[
    {
        "title": "Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down",
        "description": "Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down.",
        "url": "https://news.sky.com/story/trump-says-no-pause-on-tariffs-after-rollercoaster-day-on-wall-street-ends-with-most-us-markets-down-13344156",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-s-and-p-share-stock-market_6879445.jpg?20250407232520",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-07 21:14:00",
        "Headline": "The US president also threatened to impose a further 50% duty on China as economists fear his sweeping tariffs could plunge the world into a global recession.",
        "Content": " Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down. Intense swings were seen on the three main stock market indexes on Monday as economists fear the US president's \"Liberation Day\" levies could cause a global recession. The S&P 500 closed the day 0.23% lower, while the Dow Jones Industrial Average finished down 0.91%, and the Nasdaq ended in positive territory, up 0.10%. Trump tariffs: Follow latest updates All three indexes started the day sharply lower, and the Dow plunged as many as 1,700 points following even worse losses elsewhere in the world. But it suddenly surged to a gain of nearly 900 points in the late morning. The S&P 500, meanwhile, went from a loss of 4.7% to a leap of 3.4%, which would have been its biggest jump in years. The sudden rise appears to have been the result of a social media post that incorrectly claimed that Kevin Hassett, White House National Economic Council director, said Mr Trump was considering a 90-day pause in tariffs for all countries except China. Reports first emerged through the US business news channel CNBC. The White House later told CNBC any talk of a 90-day pause was \"fake news\". Financial pain hammers investments around the world The financial pain once again hammered investments around the world, with stocks in Hong Kong plunging 13.2% for their worst day since 1997. Meanwhile, the UK's benchmark stock index, the FTSE 100, closed 4.38% down. It is one of the biggest drops in years, in line with the falls seen in the early days of COVID-19 lockdowns, but less steep than the 4.95% loss seen on Friday. Only a handful of the 100 most valuable companies listed on the London Stock Exchange saw any boost to their share price all day. Read more: Major economic shock happening because of TrumpIs this the start of an 'economic nuclear winter?'Global bank chiefs hold talks over tariffs crisis 👉 Follow Trump 100 on your podcast app 👈 Trump 'not looking' at pausing tariffs When asked in the Oval Office on Monday evening whether he would pause tariffs, Mr Trump said: \"We're not looking at that.\" The president added that affected countries have been negotiating with his administration, which he said will try and make \"fair deals\" with each of them. \"We're going to get fair deals with every country and if we don't they are not going to be able to participate with the US,\" he added. Mr Trump also claimed the US \"has been ripped off by many countries over the years\", adding: \"We can't do it anymore. We can't be the stupid people anymore.\" Analysis: Tariffs could herald one of the most painful episodes in modern times Trump threatens additional 50% tariff on China It came after the US president threatened in a post on his Truth Social platform that he would impose an additional 50% tariff on China if the nation does not withdraw its 34% retaliatory tariff. Beijing imposed the duty after Mr Trump announced his tariff on China last week. The US president added in his Truth Social post that Beijing has until Tuesday to remove its retaliatory tariff. Some investors are holding onto hope that Mr Trump may still lower his tariffs after negotiating with countries, and Mr Trump said on Sunday that he has heard from leaders \"dying to make a deal\".  'Sometimes you have to take medicine to fix something' A drop in tariffs relatively soon could help avoid a recession, but whether that can happen is still uncertain. On Sunday, Mr Trump told reporters aboard Air Force One that he does not want markets to fall. But he also said he was not concerned about a sell-off, saying \"sometimes you have to take medicine to fix something\". Mr Trump has given several reasons for his stiff tariffs, including to bring manufacturing jobs back to the United States, which is a process that could take years. The US president has said he wanted to bring down the numbers for how much more the United States imports from other countries versus how much it sends to them. \"The recent tariffs will likely increase inflation and are causing many to consider a greater probability of a recession,\" JP Morgan chief executive Jamie Dimon wrote in his annual letter to shareholders on Monday. \"Whether or not the menu of tariffs causes a recession remains in question, but it will slow down growth\", added Mr Dimon, who is one of the most influential executives on Wall Street."
    },
    {
        "title": "A major economic shock is happening thanks to Trump - and the UK can do little to stop it",
        "description": "A major global economic shock is taking place; its duration unknown, its severity anyone's guess, and no one has a surefire way of stopping it because it's all based on the proclivities of one man who is supposed to be our ally.",
        "url": "https://news.sky.com/story/a-major-economic-shock-is-happening-thanks-to-trump-and-the-uk-can-do-little-to-stop-it-13344098",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-maryland_6878467.jpg?20250407072148",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-04-07 19:05:00",
        "Headline": "With high borrowing and tax at record levels, the government lacks the levers available in the 2008 financial crash and COVID.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n A major global economic shock is taking place; its duration unknown, its severity anyone's guess, and no one has a surefire way of stopping it because it's all based on the proclivities of one man who is supposed to be our ally. Billions have been wiped off the stock market since Donald Trump announced his global tariff scheme last week, meaning a hit to prices, pensions and jobs that could get a lot worse. So what can the government do, in practice? After the economic shocks of modern times - the 2008 financial crisis and 2020 pandemic - hundreds of billions of pounds were served up by the UK government to cushion the impact. Debates rage to this day about whether banks should have been bailed out by Gordon Brown and whether Rishi Sunak's COVID furlough scheme should have been so generous. On both occasions, the Bank of England rose to the challenge too, using its quantitative easing scheme to ensure cheap money. But as we stand on the precipice of economic decline of uncertain severity, it is clear that any kind of big bazooka option of the scale seen during those two crises is not open to the UK this time around. Borrowing is so high, and taxes at record levels, that there is not the headroom to do this now. The government's options are severely limited. \n                  Starmer promises 'bold changes' to rules over electric cars in wake of Trump's tariffs\n                 \n                  Starmer can see no quick Trump deal\n                 \n                  MP deported from Israel accuses it of 'control and censorship'\n                 That, in practice, is the starting point for Prime Minister Sir Keir Starmer and Chancellor Rachel Reeves. The big concession today is that tariffs may be in place for some time - the hope of two weeks ago for a quick deal that dampens or exempts tariffs appears to be fading. The White House says 50 nations are queuing up to do a deal - there is no guarantee we are close to the front of the queue. So instead, they have to look for other answers that cost little - cutting red tape and helping business grow. And here, there are no straightforward answers. Read more:Trump's tariffs - a negotiating tactic or start of an 'economic nuclear winter'?Social media post sparks US markets upturn - before White House sends them back into red  The big announcement on Monday is to water down green rules for cars, delaying a ban on hybrids to 2035 from 2030 and giving the car sector more flexibility to meet its electric car goals on the path to the end of the decade. But, although the government did not want to talk about it, these involve trade-offs which is why they have not happened to date. When it comes to deregulation, there is no such thing as an easy win. The policy watered down on Monday was on course to be, by a very large margin, the single biggest lever for the UK to achieve its climate goals for the 2030s, so this will blow an even bigger hole in the ability to get on track for net zero. Meanwhile, this change of policy means uncertainty for different firms - those that make batteries and charging points are no longer in such urgent demand after Monday's decisions. Yet Rachel Reeves makes clear this approach is the one she will follow. Pharmaceuticals and steel will also get help in coming days. But whatever the announcement, remember there's a cost - just not one the government will spell out when it tries to get back on the front foot."
    },
    {
        "title": "US having direct talks with Iran over its nuclear programme",
        "description": "Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail.",
        "url": "https://news.sky.com/story/us-having-direct-talks-with-iran-as-trump-insists-tehran-cannot-get-nuclear-weapons-13344111",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-tehran-nuclear_6879402.jpg?20250407223122",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-07 19:24:00",
        "Headline": "Iran has previously pushed back against Donald Trump's demand that it enter direct negotiations, but the US president has now said discussions \"at almost the highest level\" have begun.",
        "Content": " Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail. The president has insisted Tehran cannot get nuclear weapons. Iran had pushed back against Trump's demand that it enter negotiations over its nuclear programme or be bombed, but speaking at the White House on Monday, Mr Trump said: \"We're having direct talks with Iran, and they've started. \"It'll go on Saturday,\" he continued. \"We have a very big meeting, and we'll see what can happen. And I think everybody agrees that doing a deal would be preferable.\" When pressed for more details on the talks, the US president said they are taking place \"at almost the highest level\". He would not be drawn on where the meeting this weekend is taking place. \"Hopefully those talks will be successful, it would be in Iran's best interests if they are successful,\" he said. \"We hope that's going to happen.\" Mr Trump made the comments to reporters during an Oval Office meeting with Israeli Prime Minister Benjamin Netanyahu. \n                  Trump's tariffs news conference with Netanyahu was typically noncommittal, vague and contradictory\n                 \n                  US Supreme Court delays deadline to return man mistakenly deported to El Salvador\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 Mr Trump's previous warnings of possible military action against Iran heightened already tense nerves across the Middle East. He has said he would prefer a deal over military confrontation and in March wrote to Iran's supreme leader Ayatollah Ali Khamenei to suggest talks. Iranian officials at the time said Tehran would not be bullied into negotiations. Middle East correspondent It now seems clear why the Israelis were summoned to the White House at short notice.  The US and Iran will sit down together to directly negotiate a nuclear deal in a matter of days.  Mr Trump didn’t say who would be taking part in the talks but said it would be “almost at the highest level”.  He wouldn’t reveal the location, and he didn’t put a timeline on it, but Washington and Tehran in close dialogue is a major development in Middle East geopolitics.  Benjamin Netanyahu had to sit there, listen and accept it.  By doing it publicly, in the Oval Office, Mr Trump has asserted his power and effectively forced the Israeli prime minister to accept the outcome.  Iran is yet to respond publicly, and it’s not clear what role Britain and France might play, as nuclear states and permanent members of the UN Security Council. Maybe none at all.  Mr Trump said Iran would be “in great danger” if the talks failed, but stopped short of explicitly saying he would order military action.  Mr Trump wants a deal, Israel will not be at the table and Mr Netanyahu’s ability to influence the talks, if he doesn’t like the way they are going, will be limited.  Some in Israeli media are describing the meeting as a humiliation for the prime minister and I suspect Mr Netanyahu will have left the White House concerned and possibly angry by what he heard.  But Mr Netanyahu has long shown an ability to force himself into the conversation - he won’t sit by and watch the talks progress without finding a way to have his say. \n\n During his first White House term, Mr Trump withdrew the US from a deal between Iran and world powers designed to curb Iran's nuclear work in exchange for sanctions relief. He also reimposed US sanctions. 👉 Follow Trump 100 on your podcast app 👈 Iran has since far surpassed that deal's limits on uranium enrichment. Tehran insists its nuclear programme is wholly for civilian energy purposes but Western powers accuse it of having a clandestine agenda. Read more from Sky News:Social media rumour sparks markets upturnTwo charged over Trump golf resort damage Mr Netanyahu's White House visit - his second in just over two months - was also due to include a news conference but this was cancelled earlier on Monday. Officials said the decision was made because he and Mr Trump had \"two back-to-back media availabilities (the greeting in the Oval Office and the formal news conference), and they wanted to streamline things\"."
    },
    {
        "title": "Baby girl becomes first child in UK to be born from womb transplant",
        "description": "A baby girl has become the first child in the UK to be born from a womb transplant.",
        "url": "https://news.sky.com/story/baby-girl-becomes-first-child-in-uk-to-be-born-from-womb-transplant-13343832",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-amy-isabel-davidson_6878835.jpg?20250407133231",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:46:00",
        "Headline": "It was the first time the procedure had taken place in the UK. The birth will give hope to thousands of women born without a womb.",
        "Content": " A baby girl has become the first child in the UK to be born from a womb transplant. Grace Davidson, who received the transplant in 2023, said the birth of her daughter Amy Isabel was the \"greatest gift we could ever have asked for\". The 36-year-old, from north London, received the donated womb from her older sister, Amy. It was the first time the procedure had taken place in the UK, and the birth will give hope to thousands of women born without a womb - like those with Mayer-Rokitansky-Kuster-Hauser (MRKH) syndrome - or whose womb fails to function. Amy Isabel was named after her aunt, and a surgeon who helped perfect the technique, and was born by planned caesarean section on 27 February at Queen Charlotte's and Chelsea Hospital in London. Mrs Davidson, an NHS dietitian, said she felt \"shock\" when she first held her daughter, adding: \"We have been given the greatest gift we could ever have asked for. \"It was just hard to believe she was real. I knew she was ours, but it's just hard to believe. \"It sort of feels like there's a completeness now where there maybe wasn't before.\" Her husband Angus, 37, said: \"The moment we saw her was incredible, and both of us just broke down in emotional tears - it's hard to describe, it was elation. \"It had been such a long wait. We'd been intending to have a family somehow since we were married, and we've kind of been on this journey for such a long time.\" Science and technology editor The birth of Amy Isabel is not just a first for the UK, but an important step towards womb transplantation becoming an established medical procedure. It was little more than a decade ago that the world's first baby was born following a womb transplant in Sweden. And not without eyebrows being raised by some in the world of medical ethics. Not all womb transplants, whether from a living relative or from a deceased donor, are successful. And not all result in successful or uncomplicated pregnancies. But the surgical team behind this UK success have achieved a one-for-one: a healthy baby born from the first womb transplant ever performed here. Amy Isabel joins an estimated 50 other babies and children worldwide now born via a womb transplant. And she won't be the last. Around 100 women in at least 10 countries have undergone the procedure – three transplants have taken place in the UK since Amy's mother became the first in 2023. A study of 33 womb transplants in the US found 74% of the transplants remained healthy after a year and 80% of those resulted in a successful birth.\n But a womb transplant is unlikely to ever become \"routine\". While the number of eligible women – those lacking a functioning uterus but having healthy ovaries – might number in the low thousands in a country the size of the UK, not all would meet the strict medical criteria needed to maximise the chance of a successful transplant and subsequent birth. And not all might choose it. A successful birth following a womb transplant involves three major operations. The first to receive the transplanted womb, a caesarean section to deliver the baby, then a hysterectomy to remove the womb once the recipient mother decides to have no more children. Given a womb transplant isn't \"life-saving\", ethics guidelines require the procedure to be temporary. The long-term risks of organ rejection, and the drugs needed to prevent it, are considered too great once the womb has served its miraculous function. Some medical ethicists still question the procedure as a whole, arguing it is unnecessarily risky for both the mother and baby, especially if babies are born seriously pre-term and at low birth weight. However, this latest success, and the increasing number of healthy babies born via the procedure worldwide may change that. Womb transplantation is on the way to becoming an acceptable, life-giving procedure for women who previously had no hope of carrying a baby of their own.\n Rare condition affects one in 5,000 women Mrs Davidson was born with Mayer-Rokitansky-Kuster-Hauser, a rare condition that affects around one in every 5,000 women. It means they have an underdeveloped or missing womb. However, the ovaries are intact and still function to produce eggs and female hormones, making conceiving via fertility treatment a possibility. How the procedure worked Before receiving the donated womb, Mrs Davidson and her husband underwent fertility treatment to create seven embryos, which were frozen for in vitro fertilisation (IVF) in central London. Mrs Davidson had surgery in February 2023 to receive the womb from her 42-year-old sister Amy Purdie, who is a mother to two girls aged 10 and six. Several months later, one of the stored embryos was transferred via IVF to Mrs Davidson. The baby weighed 4.5lbs and was delivered several weeks early to ensure a safe, hospital-based delivery. Ms Purdie called the birth of her niece \"worth every moment\". Read more:AI could help more women get pregnant via IVFFertility patients offered unnecessary treatments - report  'We've waited a very, very long time for this' Professor Richard Smith and Isabel Quiroga were the lead surgeons for the womb transplant and both were in the operating theatre when Amy was delivered, with her parents choosing her middle name in honour of Ms Quiroga. Prof Smith, clinical lead at the charity Womb Transplant UK and consultant gynaecological surgeon at Imperial College Healthcare NHS Trust, told Sky News that being in the operating theatre when Amy was delivered was \"really quite remarkable\". The medic said: \"We've waited a very, very long time for this, and there's been quite a lot of tears shed. Ironically the scariest bit of the day for me was when [Amy's] mum and dad asked me to hold their baby, which was incredible.\" Ms Quiroga, consultant surgeon at the Oxford Transplant Centre, part of Oxford University Hospitals, told Sky News it was \"quite a complex procedure\" and \"the pressure was immense when we did the transplant\". But she said it was \"totally amazing to see all that effort\" and it has \"been totally worth it\"."
    },
    {
        "title": "Why the King and Queen's visit to Italy is one of the UK's most important power plays",
        "description": "They weren&#8217;t going for understated as the King and Queen arrived in Rome, with two fighter jets accompanying their plane, emblazoned with its Union flag paintwork.",
        "url": "https://news.sky.com/story/why-the-king-and-queens-visit-to-italy-is-one-of-the-uks-most-important-power-plays-13344172",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-king-camilla-charles_6879060.jpg?20250407164704",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-07 22:01:00",
        "Headline": "The smiles and handshakes over the next few days may seem insignificant but those in diplomatic circles will tell you royal tours still have a vital and lasting role to play.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n They weren’t going for understated as the King and Queen arrived in Rome, with two fighter jets accompanying their plane, emblazoned with its Union flag paintwork. At a time of heightened global tensions, one the UK's most important power plays was being deployed to Italy. It is easy to be sniffy about what soft power really means; the UK's ambassador to Italy, Edward Llewelyn, did his best to sum it up by briefing journalists that the King and Queen's visit will \"do something intangible but priceless\". And with his experience as the former ambassador to France and David Cameron's chief of staff, he should have a good idea.  Emphasising why it matters now, he said: \"This state visit comes at a key moment. \"The UK's relationship with Italy continues to strengthen as we reset our relationships with our European partners.\" When it comes to defence ties, \"these are closer than ever with Italy right now, which is vital in a changing Europe, and as both countries stand steadfast in our support for Ukraine\", he added. \n                  Catholic jubilee: What is it and should you still travel to Italy this year?\n                 \n                  King Charles arrives in Rome for Italy tour with Queen Camilla after health concerns\n                 \n                  King honours Alan Titchmarsh and Olympic star in first public engagement since short hospital stay\n                 The fact Foreign Secretary David Lammy is joining the King and Queen on parts of this this visit underpins the importance. You could say the photo opportunities of the royals posing for wedding anniversary pictures, food tasting and visiting cultural hotspots such as Rome's Colosseum are the window dressing - as behind closed doors, important political and diplomatic talks have been arranged because of the honour of this visit. All this comes in the wider context of a destabilising Trump presidency and his disruptive tariffs. The importance of trade is often a topic that comes up as a reason for a royal tour and never has it seemed more significant to hear the UK's ambassador talk about the economic ties between the UK and Italy \"flourishing\". Read more:What is the Catholic jubilee?King plays musical carrot The smiles and the handshakes over the next few days may seem insignificant compared to the tough talks going on elsewhere. But talk to those in diplomatic circles and they will consistently tell you that the foundations of friendship laid down by a royal tour, especially in this current climate, have a vital and lasting role to play."
    },
    {
        "title": "March hottest on record in Europe and by some margin",
        "description": "Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin.",
        "url": "https://news.sky.com/story/march-hottest-on-record-in-europe-and-by-some-margin-13344125",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weather-europe_6879451.jpg?20250408004718",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-07 19:54:00",
        "Headline": "March was not just warmer than average, it was a lot warmer, the EU's Copernicus Climate Change Service has found.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin. And that raises the risk, for now, of wildfires this summer, campaigners have warned. The average air temperature across the continent was a significant 2.41C above the recent average for March (1991-2020), according to new figures from the EU's Copernicus Climate Change Service. That figure may not sound like much, but as it is an average figure, it smooths out the extremes, meaning it will have been much higher in some places. Eastern Europe and southwest Russia in particular saw the mercury soar. A heat map released alongside the data paints most of Europe in dark orange and red to signify just how high the heat was above average. Last week the UK's Met Office found England had its sunniest March on records going back to 1920. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Britons urged to stop mowing lawns to boost butterfly numbers 'in long-term decline'\n                 \n                  UK greenhouse gases fall again - as renewable electricity hits 50% for the first time\n                 The total of 185.8 hours of sunshine smashed the previous record from 1929 by more than 14 hours. The outstanding hot and dry conditions fuelled multiple wildfires by drying out plants and trees. And this week temperatures of above 20C (68F) are set to return, following the hottest day of the year so far on Friday. But when it comes to rainfall, March was a month of two extremes in Europe, Copernicus found. It was drier than average in the UK and Ireland, and in a big area from central Europe to Greece and Turkey - shown in dark brown on a second map that illustrates wet versus dry conditions. Not so over Spain and Portugal, where a series of storms brought widespread floods, forcing some from their homes but refilling reservoirs parched in last year's drought. While some parts of Europe had their driest March on record, elsewhere it was the wettest in at least the past 47 years. Samantha Burgess from the European Centre for Medium-Range Weather Forecasts, which runs Copernicus, said the new data is \"highlighting once again how temperatures are continuing to break records\". United Nations scientists say it is \"unequivocal\" that humans are warming the planet, which drives up average temperatures as well as extreme heatwaves.  That's because activities like burning fossil fuels release greenhouse gases that trap heat around the Earth. Rebecca Newsom from Greenpeace warned hot and dry weather could fuel the conditions for intense wildfires this summer. \"As early spring weather starts to feel more and more like summer, Europe is potentially on track to face ever harsher heat waves and wildfires later in the year. \"The past month's contrasting rainfall extremes across the European region alone pose an immediate challenge to our food systems and to the economy as a whole. \"Europe's citizens must not be left alone to pay for the chaos that dirty energy companies are fuelling.\" She called for new taxes on oil majors to help communities cope with climate disasters."
    },
    {
        "title": "US Supreme Court delays deadline to return man mistakenly deported to El Salvador",
        "description": "The US Supreme Court has delayed a midnight deadline for Donald Trump's administration to return a man mistakenly deported to a notorious prison in El Salvador.",
        "url": "https://news.sky.com/story/us-supreme-court-delays-deadline-to-return-man-mistakenly-deported-to-el-salvador-13344180",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-07 23:18:00",
        "Headline": "A US district judge had ordered the administration to return Kilmar Abrego Garcia by the end of Monday, after he and his family filed a lawsuit challenging the legality of his deportation.",
        "Content": "The US Supreme Court has delayed a midnight deadline for Donald Trump's administration to return a man mistakenly deported to a notorious prison in El Salvador. A US district judge had ordered the administration to return Kilmar Abrego Garcia by the end of Monday, after he and his family filed a lawsuit challenging the legality of his deportation. The US president's administration had conceded the 29-year-old should not have been sent to El Salvador because an immigration judge found he likely would face persecution by local gangs. But the administration argued he is no longer in US custody and the government has no way to get him back. US District Judge Paula Xinis gave the administration until just before midnight to \"facilitate and effectuate\" Mr Garcia's return. She found the government had no lawful authority to detain and deport Mr Garcia, a Salvadoran migrant who lived in Maryland legally with a work permit. She said the decision to arrest him and send him to El Salvador appears to be \"wholly lawless\" as little to no evidence supports a \"vague, uncorroborated\" allegation he was once a member of the gang MS-13, which Mr Trump's administration had designated a foreign terrorist organisation. Mr Garcia's lawyers have denied he is part of a gang. 👉 Follow Trump 100 on your podcast app 👈 Chief Justice John Roberts, acting on behalf of the US Supreme Court, temporarily halted the judge's order, giving the nine justices additional time to consider the administration's request to block the order while litigation in the case continues. Read more from Sky News:Trump says there will be no pause on tariffsUS having direct talks with Iran over its nuclear programmeFirst child in UK born from womb transplant Supreme Court allows Trump to use 18th-century law for deportations It comes as the Supreme Court allowed the Trump administration to use a wartime law from 1798 to deport Venezuelan migrants - but said they must get a court hearing before they are removed from the US. The bitterly divided 5-4 decision was a response to the administration's emergency appeal over a court order that had temporarily blocked the summary deportations under President Trump's usage of the Alien Enemies Act while litigation in the case continues. Reacting to the decision with a post on his social media platform Truth Social, Mr Trump wrote: \"The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself. A GREAT DAY FOR JUSTICE IN AMERICA!\" The president invoked the act, best known for being used to intern Japanese, Italian and German immigrants during the Second World War, on 15 March to deport alleged members of the Tren de Aragua gang."
    },
    {
        "title": "Plastic surgeon Peter Brooks found guilty of attempting to murder former boss",
        "description": "A plastic surgeon has been found guilty of the attempted murder of his former boss, who he stabbed after a failed attempt to set his house on fire.",
        "url": "https://news.sky.com/story/plastic-surgeon-peter-brooks-found-guilty-of-attempting-to-murder-colleague-13343901",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-peter-brooks-plastic-surgeon_6879002.png?20250407155419",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-07 13:51:00",
        "Headline": "Brooks cycled to Graeme Perks' home while wearing camouflage gear and armed with a crowbar, petrol and matches before carrying out the attack in January 2021.",
        "Content": "A plastic surgeon has been found guilty of the attempted murder of his former boss, who he stabbed after a failed attempt to set his house on fire. Peter Brooks had cycled to the home of Graeme Perks in Halam, near Southwell, Nottinghamshire, while wearing camouflage gear and armed with a crowbar, petrol, matches and a knife in the early hours of 14 January 2021. The 61-year-old then doused the ground floor of the property with petrol before stabbing fellow plastic surgeon Mr Perks because he wanted him \"out of the way\", his trial at Loughborough Courthouse heard. The victim's wife and children were sleeping at the time of the attack which took place during a COVID lockdown, the jury was told. The jury heard Mr Perks, a consultant plastic surgeon who was previously Brooks' boss, had provided evidence in disciplinary proceedings against the defendant, who faced potentially losing his job with Nottingham University Hospitals NHS Trust. Brooks was \"voluntarily absent\" from his month-long trial because he was on hunger strike and said he would \"rather be dead than incarcerated\", it can now be reported. He also sacked his lawyers before the trial and was unrepresented in the case. When opening the prosecution's case, Tracy Ayling KC had told the jury it was \"clear that the defendant hated Graeme Perks\" and wanted him \"out of the way\". Mr Perks, who was 65 at the time, had retired the month before the stabbing and suffered \"extremely life-threatening\" injuries to his liver, intestines and pancreas, and was given a 95% chance of death, the court was told. He had woken up on the night of the attack when Brooks smashed through his conservatory, the jury heard. Mr Perks then went downstairs where his feet \"felt a bit damp\" from the petrol, which Brooks had also thrown against the wall next to the stairs, before he felt a \"blow to his body\", the court was told. Brooks fled the scene on his bicycle after the stabbing and returned to his home in nearby Southwell. He was found asleep on a garden bench later that morning when he was taken to hospital for injuries to his hand, and was arrested. Brooks' blood was found in the conservatory of Mr Perks' home and on a crowbar he had used to force entry. His blood was also found on the handle of the knife used in the attack. The consultant, who specialised in burns, has been convicted of two counts of attempted murder, attempted arson with intent to endanger life, and possession of a knife in a public place. Jurors deliberated for more than 12 hours before finding Brooks guilty of all the charges against him. His hunger strike could not be reported throughout the trial and the jury were told not to speculate about his absence from the dock. He appeared in court via video-link for the first time in the trial from HMP Norwich on 1 April, in the absence of the jury, and told the judge Mr Justice Pepperall he wanted to defend himself, that he did not have \"sufficient time to prepare\" for the trial, and wanted a four-week adjournment. Brooks, who could be seen lying on the floor during his court appearance because sitting in his wheelchair made him \"feel unwell\", said: \"I would rather be dead than in prison so I continued with my hunger strike. I have had enough of being in prison. \"I don't particularly want to die but if my choice is between incarceration and death, I would rather be dead than incarcerated.\" Brooks said his autism may have made it more likely that he went on hunger strike and added that someone in hospital said he \"may be suffering from anorexia\". Read more from Sky News:Family reveal worst fears for sonPolice officer won't be prosecuted over e-bike crashWho are the two MPs deported by Israel? Ms Ayling responded to Brooks' submissions and said he was \"manipulating the court process\", and that the court had \"bent over backwards\" to maintain his rights in the trial. The judge agreed to adjourn the trial for 48 hours for Brooks to give evidence, but he became upset and said he was \"not well enough\" to do so at short notice. The court heard he \"asked to be taken back to his cell\" and refused to participate further in proceedings. Mr Justice Pepperall ruled that on \"no fewer than eight occasions\" since 2021 Brooks had \"used hunger strikes or the threat of some other self-harm to achieve some advantage\". Brooks' convictions follow a four-year series of legal hearings, including a mistrial and seven other aborted trial dates. He put forward numerous possible defences, including self-defence and lack of intent, but never gave evidence directly to a jury. His first trial, in July 2022, had to be adjourned because he was suffering from a medical complication of radiotherapy, which required surgery. Manjeet Shehmar, medical director at Nottingham University Hospitals NHS Trust, said: \"We have been following the case of Mr Brooks closely and respect the decision made in court today. \"We would like to offer our sympathies to those who were affected by Mr Brooks' actions, including Mr Perks and his family, and other colleagues from within the Trust.\" Brooks, who is also known by the first name Jonathan, is expected to attend his sentencing at the same court on 3 June."
    },
    {
        "title": "Wolf extinct for 10,000 years brought back to life, researchers claim - but is it true?",
        "description": "A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true?",
        "url": "https://news.sky.com/story/wolf-extinct-for-10000-years-brought-back-to-life-researchers-claim-but-is-it-true-13344117",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pup-wolf_6879422.jpg?20250407225328",
        "type": "Home",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-04-07 19:30:00",
        "Headline": "Colossal Biosciences claims to have \"de-extincted\" dire wolves by creating three pups named Romulus, Remus and Khaleesi. But has genetic engineering really led to a rebirth of dire wolves, a species last seen more than 10,000 years ago?",
        "Content": "By Claire Gilbody Dickerson, news reporter  A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true? Here's all we know about the three pups created by Colossal Biosciences, a genetic engineering company which claims to have \"de-extincted\" the dire wolf. What does Colossal say? On Monday, Colossal posted a clip showing two of the pups, named Romulus and Remus (after the mythical founders of Rome who, as legend has it, were brought up by a wolf), howling. \"Sound on\", the enthusiastic post on X reads. \"You're hearing the first howl of a dire wolf in over 10,000 years. \"Meet Romulus and Remus-the world's first de-extinct animals, born on October 1, 2024.\" Another pup, named Khaleesi after the character in Game of Thrones, was born on 31 January this year. \n                  Israeli troops opened fire on ambulances because of 'perceived threat', preliminary IDF investigation says\n                 \n                  US having direct talks with Iran over its nuclear programme\n                 \n                  US President Donald Trump says the US are in direct talks with Iran\n                 Colossal are the same company that created woolly mice in their quest to revive the woolly mammoth, and their goal is to fix extinction by \"combining the science of genetics with the business of discovery\". In the X post, Colossal explained how the pups were \"brought back from extinction\" using genetic edits which came from a complete dire wolf genome which was \"meticulously reconstructed\" from ancient DNA found in fossils of a 13,000-year-old tooth from Ohio and a 72,000-year-old inner ear bone from Idaho. Grey wolves were chosen as the donor species for establishing cell lines as they are the closest living relative of dire wolves. The company edited grey wolf DNA in 20 places over 14 genes to bring about specific changes like a lighter coloured coat, hair length, patterning, as well as body size and musculature. Fertilised eggs were then implanted into surrogate dogs. So the pups look and maybe sound like dire wolves, but they are not a complete genetic match. The research has other limitations. The wolves won't learn to live in the wild. Beth Shapiro, the chief scientific officer of Colossal, said while she would \"love to know the natural behaviour of a dire wolf,\" the pups are \"essentially living the Ritz Carlton lifestyle of a wolf. \"They can't get a splinter without us knowing about it,\" the New York Times quoted her as saying. What do other scientists say?  Adam Boyko, a geneticist at Cornell University who was not involved in the project, told the New York Times: \"It's exciting that we can make functional versions of extinct species.\" Read more from Sky News: King arrives in Rome with Queen after health concernsGlobal bank chiefs hold talks over Trump tariffs crisis But he claimed the pups can't truly be dire wolves as they are not being brought up in dire-wolf packs where they would learn their behaviour. And while the dire-wolf genes being carried by the pups could shed some light on the biology of the extinct species, Dr Boyko suggested there are many other genes which may have contributed to making dire wolves distinct from other wolves. \"We don't know what that number is,\" he said. \"It could be 20, or it could be 2,000.\" The New Scientist also looked at Colossal's claim of having recreated dire wolves and weren't entirely convinced. In an article entitled \"No the dire wolf has not been brought back from extinction\" they noted Dr Shapiro's claim grey wolves and dire wolves share 99.5 per cent of their DNA, but \"since the grey wolf genome is around 2.4 billion base pairs long, that still leaves room for millions of base-pairs of differences\". Given that there were only 20 gene edits it's not close to having the genetic make up of the dire wolf. But as Colossal's Beth Shapiro told the magazine: \"if they look like this animal, then they are the animal.\""
    },
    {
        "title": "Baby girl becomes first child in UK to be born from womb transplant",
        "description": "A baby girl has become the first child in the UK to be born from a womb transplant.",
        "url": "https://news.sky.com/story/baby-girl-becomes-first-child-in-uk-to-be-born-from-womb-transplant-13343832",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-amy-isabel-davidson_6878835.jpg?20250407133231",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:46:00",
        "Headline": "It was the first time the procedure had taken place in the UK. The birth will give hope to thousands of women born without a womb.",
        "Content": " A baby girl has become the first child in the UK to be born from a womb transplant. Grace Davidson, who received the transplant in 2023, said the birth of her daughter Amy Isabel was the \"greatest gift we could ever have asked for\". The 36-year-old, from north London, received the donated womb from her older sister, Amy. It was the first time the procedure had taken place in the UK, and the birth will give hope to thousands of women born without a womb - like those with Mayer-Rokitansky-Kuster-Hauser (MRKH) syndrome - or whose womb fails to function. Amy Isabel was named after her aunt, and a surgeon who helped perfect the technique, and was born by planned caesarean section on 27 February at Queen Charlotte's and Chelsea Hospital in London. Mrs Davidson, an NHS dietitian, said she felt \"shock\" when she first held her daughter, adding: \"We have been given the greatest gift we could ever have asked for. \"It was just hard to believe she was real. I knew she was ours, but it's just hard to believe. \"It sort of feels like there's a completeness now where there maybe wasn't before.\" Her husband Angus, 37, said: \"The moment we saw her was incredible, and both of us just broke down in emotional tears - it's hard to describe, it was elation. \"It had been such a long wait. We'd been intending to have a family somehow since we were married, and we've kind of been on this journey for such a long time.\" Science and technology editor The birth of Amy Isabel is not just a first for the UK, but an important step towards womb transplantation becoming an established medical procedure. It was little more than a decade ago that the world's first baby was born following a womb transplant in Sweden. And not without eyebrows being raised by some in the world of medical ethics. Not all womb transplants, whether from a living relative or from a deceased donor, are successful. And not all result in successful or uncomplicated pregnancies. But the surgical team behind this UK success have achieved a one-for-one: a healthy baby born from the first womb transplant ever performed here. Amy Isabel joins an estimated 50 other babies and children worldwide now born via a womb transplant. And she won't be the last. Around 100 women in at least 10 countries have undergone the procedure – three transplants have taken place in the UK since Amy's mother became the first in 2023. A study of 33 womb transplants in the US found 74% of the transplants remained healthy after a year and 80% of those resulted in a successful birth.\n But a womb transplant is unlikely to ever become \"routine\". While the number of eligible women – those lacking a functioning uterus but having healthy ovaries – might number in the low thousands in a country the size of the UK, not all would meet the strict medical criteria needed to maximise the chance of a successful transplant and subsequent birth. And not all might choose it. A successful birth following a womb transplant involves three major operations. The first to receive the transplanted womb, a caesarean section to deliver the baby, then a hysterectomy to remove the womb once the recipient mother decides to have no more children. Given a womb transplant isn't \"life-saving\", ethics guidelines require the procedure to be temporary. The long-term risks of organ rejection, and the drugs needed to prevent it, are considered too great once the womb has served its miraculous function. Some medical ethicists still question the procedure as a whole, arguing it is unnecessarily risky for both the mother and baby, especially if babies are born seriously pre-term and at low birth weight. However, this latest success, and the increasing number of healthy babies born via the procedure worldwide may change that. Womb transplantation is on the way to becoming an acceptable, life-giving procedure for women who previously had no hope of carrying a baby of their own.\n Rare condition affects one in 5,000 women Mrs Davidson was born with Mayer-Rokitansky-Kuster-Hauser, a rare condition that affects around one in every 5,000 women. It means they have an underdeveloped or missing womb. However, the ovaries are intact and still function to produce eggs and female hormones, making conceiving via fertility treatment a possibility. How the procedure worked Before receiving the donated womb, Mrs Davidson and her husband underwent fertility treatment to create seven embryos, which were frozen for in vitro fertilisation (IVF) in central London. Mrs Davidson had surgery in February 2023 to receive the womb from her 42-year-old sister Amy Purdie, who is a mother to two girls aged 10 and six. Several months later, one of the stored embryos was transferred via IVF to Mrs Davidson. The baby weighed 4.5lbs and was delivered several weeks early to ensure a safe, hospital-based delivery. Ms Purdie called the birth of her niece \"worth every moment\". Read more:AI could help more women get pregnant via IVFFertility patients offered unnecessary treatments - report  'We've waited a very, very long time for this' Professor Richard Smith and Isabel Quiroga were the lead surgeons for the womb transplant and both were in the operating theatre when Amy was delivered, with her parents choosing her middle name in honour of Ms Quiroga. Prof Smith, clinical lead at the charity Womb Transplant UK and consultant gynaecological surgeon at Imperial College Healthcare NHS Trust, told Sky News that being in the operating theatre when Amy was delivered was \"really quite remarkable\". The medic said: \"We've waited a very, very long time for this, and there's been quite a lot of tears shed. Ironically the scariest bit of the day for me was when [Amy's] mum and dad asked me to hold their baby, which was incredible.\" Ms Quiroga, consultant surgeon at the Oxford Transplant Centre, part of Oxford University Hospitals, told Sky News it was \"quite a complex procedure\" and \"the pressure was immense when we did the transplant\". But she said it was \"totally amazing to see all that effort\" and it has \"been totally worth it\"."
    },
    {
        "title": "Plastic surgeon Peter Brooks found guilty of attempting to murder former boss",
        "description": "A plastic surgeon has been found guilty of the attempted murder of his former boss, who he stabbed after a failed attempt to set his house on fire.",
        "url": "https://news.sky.com/story/plastic-surgeon-peter-brooks-found-guilty-of-attempting-to-murder-colleague-13343901",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-peter-brooks-plastic-surgeon_6879002.png?20250407155419",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-07 13:51:00",
        "Headline": "Brooks cycled to Graeme Perks' home while wearing camouflage gear and armed with a crowbar, petrol and matches before carrying out the attack in January 2021.",
        "Content": "A plastic surgeon has been found guilty of the attempted murder of his former boss, who he stabbed after a failed attempt to set his house on fire. Peter Brooks had cycled to the home of Graeme Perks in Halam, near Southwell, Nottinghamshire, while wearing camouflage gear and armed with a crowbar, petrol, matches and a knife in the early hours of 14 January 2021. The 61-year-old then doused the ground floor of the property with petrol before stabbing fellow plastic surgeon Mr Perks because he wanted him \"out of the way\", his trial at Loughborough Courthouse heard. The victim's wife and children were sleeping at the time of the attack which took place during a COVID lockdown, the jury was told. The jury heard Mr Perks, a consultant plastic surgeon who was previously Brooks' boss, had provided evidence in disciplinary proceedings against the defendant, who faced potentially losing his job with Nottingham University Hospitals NHS Trust. Brooks was \"voluntarily absent\" from his month-long trial because he was on hunger strike and said he would \"rather be dead than incarcerated\", it can now be reported. He also sacked his lawyers before the trial and was unrepresented in the case. When opening the prosecution's case, Tracy Ayling KC had told the jury it was \"clear that the defendant hated Graeme Perks\" and wanted him \"out of the way\". Mr Perks, who was 65 at the time, had retired the month before the stabbing and suffered \"extremely life-threatening\" injuries to his liver, intestines and pancreas, and was given a 95% chance of death, the court was told. He had woken up on the night of the attack when Brooks smashed through his conservatory, the jury heard. Mr Perks then went downstairs where his feet \"felt a bit damp\" from the petrol, which Brooks had also thrown against the wall next to the stairs, before he felt a \"blow to his body\", the court was told. Brooks fled the scene on his bicycle after the stabbing and returned to his home in nearby Southwell. He was found asleep on a garden bench later that morning when he was taken to hospital for injuries to his hand, and was arrested. Brooks' blood was found in the conservatory of Mr Perks' home and on a crowbar he had used to force entry. His blood was also found on the handle of the knife used in the attack. The consultant, who specialised in burns, has been convicted of two counts of attempted murder, attempted arson with intent to endanger life, and possession of a knife in a public place. Jurors deliberated for more than 12 hours before finding Brooks guilty of all the charges against him. His hunger strike could not be reported throughout the trial and the jury were told not to speculate about his absence from the dock. He appeared in court via video-link for the first time in the trial from HMP Norwich on 1 April, in the absence of the jury, and told the judge Mr Justice Pepperall he wanted to defend himself, that he did not have \"sufficient time to prepare\" for the trial, and wanted a four-week adjournment. Brooks, who could be seen lying on the floor during his court appearance because sitting in his wheelchair made him \"feel unwell\", said: \"I would rather be dead than in prison so I continued with my hunger strike. I have had enough of being in prison. \"I don't particularly want to die but if my choice is between incarceration and death, I would rather be dead than incarcerated.\" Brooks said his autism may have made it more likely that he went on hunger strike and added that someone in hospital said he \"may be suffering from anorexia\". Read more from Sky News:Family reveal worst fears for sonPolice officer won't be prosecuted over e-bike crashWho are the two MPs deported by Israel? Ms Ayling responded to Brooks' submissions and said he was \"manipulating the court process\", and that the court had \"bent over backwards\" to maintain his rights in the trial. The judge agreed to adjourn the trial for 48 hours for Brooks to give evidence, but he became upset and said he was \"not well enough\" to do so at short notice. The court heard he \"asked to be taken back to his cell\" and refused to participate further in proceedings. Mr Justice Pepperall ruled that on \"no fewer than eight occasions\" since 2021 Brooks had \"used hunger strikes or the threat of some other self-harm to achieve some advantage\". Brooks' convictions follow a four-year series of legal hearings, including a mistrial and seven other aborted trial dates. He put forward numerous possible defences, including self-defence and lack of intent, but never gave evidence directly to a jury. His first trial, in July 2022, had to be adjourned because he was suffering from a medical complication of radiotherapy, which required surgery. Manjeet Shehmar, medical director at Nottingham University Hospitals NHS Trust, said: \"We have been following the case of Mr Brooks closely and respect the decision made in court today. \"We would like to offer our sympathies to those who were affected by Mr Brooks' actions, including Mr Perks and his family, and other colleagues from within the Trust.\" Brooks, who is also known by the first name Jonathan, is expected to attend his sentencing at the same court on 3 June."
    },
    {
        "title": "MP deported from Israel accuses it of 'control and censorship'",
        "description": "An MP denied entry and deported from Israel has accused the state of \"control and censorship\".",
        "url": "https://news.sky.com/story/mp-deported-from-israel-accuses-it-of-control-and-censorship-13343977",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-abtisam-mohamed-yuan-yang_6879185.png?20250407182735",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-07 15:51:00",
        "Headline": "\"No state, however powerful, should be beyond criticism,\" says Abtisam Mohamed, who was visiting the West Bank along with fellow Labour MP Yuan Yang to learn about the work of humanitarian aid projects. ",
        "Content": "\n          Political reporter\n              @alixculbertson\n  An MP denied entry and deported from Israel has accused the state of \"control and censorship\". Labour MP Abtisam Mohamed told the House of Commons: \"This act was not just a diplomatic affront, this wasn't about security. \"It was about control and censorship and the exposure of Israel. No state, however powerful, should be beyond criticism.\" Ms Mohamed and fellow Labour MP Yuan Yang were denied entry to Israel when they arrived there on Saturday as part of a parliamentary delegation to visit humanitarian aid projects in the West Bank, they said. The two women were then deported, sparking a political row in which the Israelis have accused them of being there to \"provoke anti-Israel activities\" following comments they have made in parliament. Ms Mohamed said it had been \"a challenging few days\" and that the two MPs are not the only ones who have been \"speaking about the atrocities\" and calling for change. She said many Israelis and Israeli charities were also doing so. Ms Yang, a former journalist, told the Commons she \"understands deeply the significance of bearing witness\" and understood the risks, \"but I did not, however, anticipate the risks of detention and deportation from a British ally\". \n                  Starmer promises 'bold changes' to rules over electric cars in wake of Trump's tariffs\n                 \n                  Starmer can see no quick Trump deal\n                 \n                  Furious row after Labour MPs denied entry to Israel - as Lammy criticises 'disgraceful' Badenoch response\n                 She said their deportation proves what MPs say in the Commons \"matters\", and she asked the Middle East minister what the government can do to ensure future delegations of MPs \"can do so without having to censor their remarks\". Ms Yang revealed another delegation of MPs was set to visit the West Bank this weekend. Middle East minister Hamish Falconer said he would encourage MPs to continue to speak out on Israel and Gaza and advised MPs going to Israel to talk to the Foreign Office in advance. Government needs to make it clear this is 'unacceptable' Earlier, the head of the group who organised the MPs' trip told Sky News the government needed to make it \"very clear\" to the Israelis it was \"unacceptable\" to have denied them entry. Chris Doyle, director of Caabu, said he wanted the government to tell the Israelis the deportations \"should be revoked\". On Sunday, Foreign Secretary David Lammy said he had spoken to his Israeli counterparts and made it clear \"this is no way to treat British parliamentarians\". \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities,\" he added. Read more:Who are the two MPs deported from Israel?'Atrocious' killing of aid workers by Israel must be independently investigated Former journalist Ms Yang has only spoken once in the Commons about Israel-Gaza since she became an MP last year. She called on the government to ensure journalists can work safely in Gaza and then posted on X about many of her former Financial Times colleagues being denied entry to Gaza by Israel, as have all international reporters. Ms Mohamed is Yemeni-Muslim and has been outspoken against Israel in her role on the Foreign Affairs Committee, speaking in the Commons five times on the topic since becoming an MP last July. The MP has described Israel's actions in Gaza as \"war crimes\", something Israel has rejected. She also spearheaded a cross-party call from 61 MPs for a UK ban on Israeli goods.  It is 'right' MPs visit West Bank Mr Doyle has been Caabu's director for 23 years and said Ms Yang and Ms Mohamed were visiting as part of a \"long-running programme\" that has seen the organisation take MPs and peers from all parties to the occupied West Bank, and previously to Gaza, to \"assess the situation on the ground\". Caabu has taken 161 politicians there since 1997, including party leaders and MPs now in the cabinet, Mr Doyle said. He said the two MPs and their two aides had been set to meet Oxfam and UN representatives, which he said is the \"right and proper thing\" because the UK is a major donor to projects there, giving hundreds of millions of pounds over the years.  Israel: MPs promoted sanctions Israel's UK embassy said the MPs were denied entry because they had \"accused Israel of false claims, were actively involved in promoting sanctions against Israeli ministers, and supported campaigns aimed at boycotting the state of Israel\". Conservative leader Kemi Badenoch has caused consternation among many MPs after saying Israel \"has a right to police its borders\" and that the government's travel advice states if you have called for a boycott of Israel or Israeli settlements, or publicly criticised Israel, you can be refused entry."
    },
    {
        "title": "Police officer won't be prosecuted over fatal e-bike crash in Cardiff that sparked riot",
        "description": "A police officer who was driving a van that followed two teenagers shortly before they died in an e-bike crash will not be prosecuted.",
        "url": "https://news.sky.com/story/police-officer-who-was-driving-van-that-followed-teens-before-e-bike-crash-will-not-face-charges-13343686",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-harvey-evans-kyrees-sullivan_6166086.jpg?20240919151401",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-07 10:25:00",
        "Headline": "Dozens of people were charged and police officers needed hospital treatment after a riot broke out in the aftermath of the crash.",
        "Content": "A police officer who was driving a van that followed two teenagers shortly before they died in an e-bike crash will not be prosecuted. The deaths of Harvey Evans, 15, and Kyrees Sullivan, 16, sparked riots in the Ely area of Cardiff in May 2023. The officer was facing a dangerous driving allegation, but prosecutors decided there was not enough evidence for a realistic prospect of conviction. A Crown Prosecution Service (CPS) statement said: \"We fully understand that this will be disappointing news for the families of both boys and will offer a meeting with them to explain our reasoning further.\" Rumours on social media that the teenagers were being pursued by police were initially denied. South Wales Police said none of its vehicles were in Snowden Road at the time of the crash. But police watchdog the Independent Office for Police Conduct (IOPC) later confirmed it was investigating after video appeared to show them being followed by a van - without blue lights or a siren - minutes before the incident. Other footage, however, showed the van turn off, and it wasn't following the boys at the time of the collision. A key factor under consideration was whether there was any point at which the actions of the officers in the van \"constituted a pursuit\". Read more:Timeline of events before fatal Cardiff crash  The driver and passenger of the marked police van were previously issued with gross misconduct notices. IOPC director David Frost said his thoughts and sympathies remained with the boys' families and \"all those affected by their untimely deaths\". \"We are finalising our position over any potential disciplinary proceedings in relation to the driver of the police van and will provide a further update once final decisions have been made,\" he added. A second investigation was also opened by the IOPC into issues including police management of the crash scene and treatment of the families and the watchdog says that probe is close to concluding. A riot of several hours broke out after the boys' deaths, with cars set alight and fireworks and other missiles thrown at police. Eleven officers needed hospital treatment and 31 people were eventually charged. The decision not to charge the police officer driving the van can be challenged under the Victims' Right of Review Scheme."
    },
    {
        "title": "Global bank chiefs hold talks over Trump tariffs crisis",
        "description": "The chief executives of some of the world's biggest banks have held private talks about the carnage in financial markets and the global economy precipitated by President Donald Trump's tariffs blitz.",
        "url": "https://news.sky.com/story/global-bank-chiefs-hold-talks-over-trump-tariffs-crisis-13343860",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hsbc-bank-barclays_6878916.jpg?20250407145609",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-07 12:33:00",
        "Headline": "Executives from Bank of America, Barclays and Citi were among the participants in a weekend call to discuss the unfolding chaos over President Trump's tariffs blitz, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executives of some of the world's biggest banks have held private talks about the carnage in financial markets and the global economy precipitated by President Donald Trump's tariffs blitz. Sky News has learnt that bosses from lenders including Bank of America, Barclays, Citi and HSBC Holdings held a call on Sunday to discuss the ongoing chaos as plunging equity markets reflect fears of a worldwide recession. Sources said that Sunday's call was convened by the Bank Policy Institute, a Washington-based public policy group. Brian Moynihan of BoA, Barclays' CS Venkatakrishnan and Georges Elhedery of HSBC were among those who took part in the call, according to one overseas bank executive. JP Morgan, whose chairman and CEO Jamie Dimon warned of the inflationary and recessionary implications of a trade war in his annual shareholder letter on Monday, is also said to have taken part in the call. One source said the call was aimed at enabling US bank executives to outline their views of the unfolding tariffs chaos to their international peers. \"I am hoping that after negotiations, the long-term effect will have some positive benefits for the United States,\" Mr Dimon wrote in his letter released on Monday. \"My most serious concern is how this will affect America's long-term economic alliances.\" Shares in leading banks have been hard hit by the stock market chaos around the world, with Rachel Reeves, the chancellor, understood to be in regular contact with UK bank chiefs as well as the Bank of England. On Monday, Andrew Bailey, the BoE governor, was nominated as the next chair of the Financial Stability Board, a key international body. None of the banks contacted by Sky News would comment on Monday."
    },
    {
        "title": "UK weather: Forecasts say temperatures to soar above 20C in some areas",
        "description": "Temperatures of above 20C (68F) are set to return to the UK at the end of this week, according to forecasts.",
        "url": "https://news.sky.com/story/uk-weather-forecasts-say-temperatures-to-soar-above-20c-in-some-areas-13343772",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-warm-weather-glamorgan_6878628.jpg?20250407103523",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-07 09:17:00",
        "Headline": "Forecasters are expecting warm conditions for much of the week - but there is then a threat of unsettled weather which could bring thundery downpours by the middle of the month.",
        "Content": "Temperatures of above 20C (68F) are set to return to the UK at the end of this week, according to forecasts. Warm and dry weather is expected to continue in most areas through the coming days ahead of above-average heat on Friday and Saturday - which \"will be close\" to the year's temperature record. Last Friday became the hottest day of the year so far when 23.7C (74.66F) was recorded in Otterbourne, Hampshire. Early forecasts from the Met Office predict southern parts of the UK could see temperatures of around 21C (69.8F) on Friday and Saturday. Temperatures are expected to hover between 14C (57.2F) and 19C (66.2F) across the country during the middle part of the week. Find out the forecast for your area  However, the agency's long range forecast suggests the warm period will be followed by a \"gradual change to a more unsettled weather regime\". This could bring a \"wetter period\" through the middle of April with showers and rain potentially turning \"heavy and thundery\". Sky News meteorologist Christopher England said that despite the \"chilly wind\" and frosty nights, Hampshire enjoyed 2025's record heat so far last week - and the incoming warmth will be close to repeating those conditions. \"Top temperatures have declined a little since then, although they are still above average away from exposed eastern coasts, but look set to rise towards the weekend, with 20-21C likely in places,\" said Dr England. \"Areas to the east of the northern hills look like having the highest temperatures on Thursday, with 20C possible in both Aberdeen and Newcastle for example, while the South will see temperatures climbing on Friday and Saturday. \"A temperature of 20C is likely quite widely there, with 21C in parts of the South East. \"It's unlikely that this year's temperature record will be broken, but it may come close in places. Temperatures look set to fall again on Sunday.\"  The risk of wildfires is reducing in many areas after it had been rated as \"severe\" across much of the UK last week. Major blazes erupted during dry weather in Scotland and Dorset, with the fires spanning an area of around 1.5 miles and 50 hectares respectively. Read more from Sky News:Second child dies in US measles outbreakKing and Queen to begin Italy tour Staffordshire Fire and Rescue Service said it responded to a \"significantly large fire\" on Gentleshaw Common in Burntwood on Friday."
    },
    {
        "title": "Two-phase public inquiry into Southport murders formally launched",
        "description": "A two-phase statutory public inquiry into the Southport murders has been formally launched.",
        "url": "https://news.sky.com/story/two-phase-public-inquiry-into-southport-murders-formally-launched-13343834",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:49:00",
        "Headline": "The first part of the inquiry begins on Monday and will look at the circumstances surrounding the attack by Axel Rudakubana, who killed three young girls last summer.",
        "Content": "A two-phase statutory public inquiry into the Southport murders has been formally launched. Home Secretary Yvette Cooper said the first phase would look at the circumstances around Axel Rudakubana's attack on a Taylor Swift-themed dance class last summer. It will focus on issues around policing, the criminal justice system and the multiple agencies involved with the attacker who killed three girls - seven-year-old Elsie Stancombe, six-year-old Bebe King and Alice da Silva Aguiar, nine. Politics latest: Starmer to deliver speech on UK response to Trump tariffs  It follows the revelation Rudakubana had been referred to the government's Prevent scheme on three occasions, with the cases being closed each time. The second phase of the inquiry, which will be chaired by retired judge Sir Adrian Fulford, is expected to examine the wider issue of children and young people being drawn into extreme violence. Ms Cooper said: \"The brutal murder of three young girls: Bebe, Elsie and Alice in Southport was an unimaginable tragedy - we owe it to their families, and all those affected on that terrible day to quickly understand what went wrong, answer difficult questions and do everything in our power to prevent something like this from happening again. \"The Southport inquiry will provide insights into any failings that allowed a young man with a previous history of violence to commit this horrendous attack.\" The home secretary first announced there would be an inquiry into the Southport murders in January, after Rudakubana pleaded guilty to the murders of the three girls. He also admitted 10 counts of attempted murder and possession of a kitchen knife over the mass stabbing, as well as charges of producing ricin and possessing an al Qaeda training manual found in searches of his home in Banks, Lancashire, in the following days. Eight other children, aged between seven and 13, along with yoga instructor Leanne Lucas and businessman John Hayes, were injured in the attack, which took place at the Hart Space in the Merseyside town on 29 July. Rudakubana was jailed for a minimum of 52 years for his crimes, with the sentencing judge saying it was \"highly likely\" he will never be released. Read more politics news:Furious row after Labour MPs denied entry to IsraelMore support for businesses over Trump tariffs In the aftermath of the stabbings, misinformation about the attacker - including false claims that he was a 17-year-old asylum seeker who had come to the country by boat - were spread online, sparking riots across England. It later emerged Rudakubana, who was born in Cardiff, had been referred to the government's anti-extremism Prevent scheme three times before the murders. A rapid review into his contact with Prevent found his case should have been kept open and that he should have been referred to Channel, another anti-terror scheme.  Instead, the report noted that in his second referral to Prevent, Rudakubana's name was spelt differently from the first and that a supervisor was unable to find the previous referral - and \"this may have caused the case to be closed quickly on minimal information\". The review also concluded that too much focus was placed on the absence of Rudakubana following a distinct ideology, while his fascination with violence was under-explored. The final report for the first phase of the inquiry is expected to be completed by the end of the year or early 2026."
    },
    {
        "title": "Israeli troops opened fire on ambulances because of 'perceived threat', preliminary IDF investigation says",
        "description": "Israeli troops opened fire on a group of vehicles in Gaza including ambulances due to a \"perceived threat following a previous encounter in the area\", a preliminary IDF inquiry has said.",
        "url": "https://news.sky.com/story/atrocious-killing-of-15-aid-workers-by-israel-must-independently-investigated-palestine-red-crescent-says-13343820",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-paramedics_6876598.jpg?20250406043742",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:14:00",
        "Headline": "The Palestine Red Crescent Society (PRCS) has demanded an independent investigation into the \"atrocious\" deaths of the aid workers.",
        "Content": " Israeli troops opened fire on a group of vehicles in Gaza including ambulances due to a \"perceived threat following a previous encounter in the area\", a preliminary IDF inquiry has said. Fifteen emergency workers were killed in the incident near the southern city of Rafah on 23 March. The Israel Defence Forces (IDF) said the early investigation indicated six of those who died \"were identified as Hamas terrorists\". The IDF also said in a statement: \"All the claims raised regarding the incident will be examined through the mechanism and presented in a detailed and thorough manner for a decision on how to handle the event.\" The Palestine Red Crescent Society (PRCS) has demanded an independent investigation into the \"atrocious\" deaths of the aid workers. The group's president, Dr Younis al Khatib, said he had asked the UN Security Council to form an investigation committee into the \"intentional killing of the medics\". In response to Sky's Alistair Bunkall, spokesman David Mencer claimed the killings were the result of Hamas hiding among civilians and using them as human shields. \n                  Video emerges of aid workers being fired on in Gaza - contradicting Israeli account of deadly attack\n                 \n                  Hundreds of names removed from official Gaza war death list\n                 \n                  Israeli troops expand 'security zone' in northern Gaza - after announcing plans to seize areas of south\n                 But speaking in Ramallah, Dr al Khatib said those responsible must be held \"accountable for these crimes\" via international humanitarian law and the Geneva Convention. \"It's not enough to comfort us with condolences and nice words of investigation and accountability. There has to be action taken,\" he added.  He urged an \"independent and thorough investigation of this atrocious crime\" and that \"no one should be above the law\". \"So many questions being asked of the Israelis,\" he said. \"Why were they killed? Why did you destroy the ambulances after killing them? Why did you try to dig deep and hide the ambulances? They have to answer for that.\" It comes after footage at the weekend showed the moment the aid workers were killed, with ambulances and fire insignia clearly visible and red lights flashing. The paramedic filming, later found with a bullet in his head, is heard saying there are Israelis present and reciting a declaration of faith often used before someone dies. He adds: \"Forgive me, mother, this is the path I chose mother, to help people, forgive me, mother, I swear I chose this path only to help people.\" The Israeli military originally claimed the vehicles - which were travelling north of Rafah on 23 March - didn't have headlights or emergency signals on and were targeted as they looked \"suspicious\". An IDF investigation is ongoing, but an Israeli government spokesman claimed on Monday that \"six Hamas terrorists\" were among those killed.  Middle East correspondent It's now more than two weeks since 15 medics were shot dead by Israeli forces in southern Gaza and there are still many unanswered questions. Israel initially said that the medics had been fired upon because they were behaving suspiciously and travelling without lights on.  When footage emerged at the weekend contradicting that, and showing that the vehicles were clearly marked as ambulances, the IDF released a new statement admitting that their soldiers made a mistake. For the first time since that video was made public, Sky News was able to put a series of questions to Israeli government spokesman David Mencer about the incident. We asked what evidence the IDF have that six of the medics killed were in fact Hamas operatives, whether they will put any of their evidence into the public domain, and whether any of the soldiers involved in the incident had been withdrawn from operational duties in Gaza until their investigation is complete. Mr Mencer did not answer those important questions directly but told an online briefing that Hamas use ambulances to travel around Gaza, and insisted six of those killed were Hamas terrorists, without providing any new evidence, and accused the international media of readily accepting Hamas' version of events. However, this version of events in fact came from United Nations bodies and the Palestinian Red Crescent, reputed organisations with people on the ground in Gaza itself. The fact that Israel has already had to dramatically change its story once is why questions will remain until they provide the evidence to back up their latest version of what happened near Rafah around dawn on 23 March. Mr Mencer said: \"IDF soldiers opened fire at a distance at vehicles moving suspiciously in their direction. \"Among the dead were six Hamas terrorists - what were Hamas terrorists doing in ambulances? The incident was reported in real time to UN officials.\" He claimed there were \"many documented occasions\" when Hamas had used ambulances as cover. An evacuation order was also in place at the time, which meant moving vehicles were prohibited, according to Israel. The head of the UN's humanitarian affairs office, Jonathan Whittall, said the 15 people were found in a \"mass grave\" in the sand. He said those killed comprised eight members of the PRCS, six civil defence members and one UN employee. Dylan Winder, from the International Federation of Red Cross and Red Crescent Societies (IFRC), said it was \"outraged at the deaths\" and that \"even in the most complex conflict zones, there are rules\". \"They were humanitarians. They wore emblems that should have been protected. Their ambulances were clearly marked, and they should have returned to their families. They did not,\" he said."
    },
    {
        "title": "US having direct talks with Iran over its nuclear programme",
        "description": "Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail.",
        "url": "https://news.sky.com/story/us-having-direct-talks-with-iran-as-trump-insists-tehran-cannot-get-nuclear-weapons-13344111",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-tehran-nuclear_6879402.jpg?20250407223122",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-07 19:24:00",
        "Headline": "Iran has previously pushed back against Donald Trump's demand that it enter direct negotiations, but the US president has now said discussions \"at almost the highest level\" have begun.",
        "Content": " Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail. The president has insisted Tehran cannot get nuclear weapons. Iran had pushed back against Trump's demand that it enter negotiations over its nuclear programme or be bombed, but speaking at the White House on Monday, Mr Trump said: \"We're having direct talks with Iran, and they've started. \"It'll go on Saturday,\" he continued. \"We have a very big meeting, and we'll see what can happen. And I think everybody agrees that doing a deal would be preferable.\" When pressed for more details on the talks, the US president said they are taking place \"at almost the highest level\". He would not be drawn on where the meeting this weekend is taking place. \"Hopefully those talks will be successful, it would be in Iran's best interests if they are successful,\" he said. \"We hope that's going to happen.\" Mr Trump made the comments to reporters during an Oval Office meeting with Israeli Prime Minister Benjamin Netanyahu. \n                  Trump's tariffs news conference with Netanyahu was typically noncommittal, vague and contradictory\n                 \n                  US Supreme Court delays deadline to return man mistakenly deported to El Salvador\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 Mr Trump's previous warnings of possible military action against Iran heightened already tense nerves across the Middle East. He has said he would prefer a deal over military confrontation and in March wrote to Iran's supreme leader Ayatollah Ali Khamenei to suggest talks. Iranian officials at the time said Tehran would not be bullied into negotiations. Middle East correspondent It now seems clear why the Israelis were summoned to the White House at short notice.  The US and Iran will sit down together to directly negotiate a nuclear deal in a matter of days.  Mr Trump didn’t say who would be taking part in the talks but said it would be “almost at the highest level”.  He wouldn’t reveal the location, and he didn’t put a timeline on it, but Washington and Tehran in close dialogue is a major development in Middle East geopolitics.  Benjamin Netanyahu had to sit there, listen and accept it.  By doing it publicly, in the Oval Office, Mr Trump has asserted his power and effectively forced the Israeli prime minister to accept the outcome.  Iran is yet to respond publicly, and it’s not clear what role Britain and France might play, as nuclear states and permanent members of the UN Security Council. Maybe none at all.  Mr Trump said Iran would be “in great danger” if the talks failed, but stopped short of explicitly saying he would order military action.  Mr Trump wants a deal, Israel will not be at the table and Mr Netanyahu’s ability to influence the talks, if he doesn’t like the way they are going, will be limited.  Some in Israeli media are describing the meeting as a humiliation for the prime minister and I suspect Mr Netanyahu will have left the White House concerned and possibly angry by what he heard.  But Mr Netanyahu has long shown an ability to force himself into the conversation - he won’t sit by and watch the talks progress without finding a way to have his say. \n\n During his first White House term, Mr Trump withdrew the US from a deal between Iran and world powers designed to curb Iran's nuclear work in exchange for sanctions relief. He also reimposed US sanctions. 👉 Follow Trump 100 on your podcast app 👈 Iran has since far surpassed that deal's limits on uranium enrichment. Tehran insists its nuclear programme is wholly for civilian energy purposes but Western powers accuse it of having a clandestine agenda. Read more from Sky News:Social media rumour sparks markets upturnTwo charged over Trump golf resort damage Mr Netanyahu's White House visit - his second in just over two months - was also due to include a news conference but this was cancelled earlier on Monday. Officials said the decision was made because he and Mr Trump had \"two back-to-back media availabilities (the greeting in the Oval Office and the formal news conference), and they wanted to streamline things\"."
    },
    {
        "title": "March hottest on record in Europe and by some margin",
        "description": "Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin.",
        "url": "https://news.sky.com/story/march-hottest-on-record-in-europe-and-by-some-margin-13344125",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weather-europe_6879451.jpg?20250408004718",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-07 19:54:00",
        "Headline": "March was not just warmer than average, it was a lot warmer, the EU's Copernicus Climate Change Service has found.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin. And that raises the risk, for now, of wildfires this summer, campaigners have warned. The average air temperature across the continent was a significant 2.41C above the recent average for March (1991-2020), according to new figures from the EU's Copernicus Climate Change Service. That figure may not sound like much, but as it is an average figure, it smooths out the extremes, meaning it will have been much higher in some places. Eastern Europe and southwest Russia in particular saw the mercury soar. A heat map released alongside the data paints most of Europe in dark orange and red to signify just how high the heat was above average. Last week the UK's Met Office found England had its sunniest March on records going back to 1920. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Britons urged to stop mowing lawns to boost butterfly numbers 'in long-term decline'\n                 \n                  UK greenhouse gases fall again - as renewable electricity hits 50% for the first time\n                 The total of 185.8 hours of sunshine smashed the previous record from 1929 by more than 14 hours. The outstanding hot and dry conditions fuelled multiple wildfires by drying out plants and trees. And this week temperatures of above 20C (68F) are set to return, following the hottest day of the year so far on Friday. But when it comes to rainfall, March was a month of two extremes in Europe, Copernicus found. It was drier than average in the UK and Ireland, and in a big area from central Europe to Greece and Turkey - shown in dark brown on a second map that illustrates wet versus dry conditions. Not so over Spain and Portugal, where a series of storms brought widespread floods, forcing some from their homes but refilling reservoirs parched in last year's drought. While some parts of Europe had their driest March on record, elsewhere it was the wettest in at least the past 47 years. Samantha Burgess from the European Centre for Medium-Range Weather Forecasts, which runs Copernicus, said the new data is \"highlighting once again how temperatures are continuing to break records\". United Nations scientists say it is \"unequivocal\" that humans are warming the planet, which drives up average temperatures as well as extreme heatwaves.  That's because activities like burning fossil fuels release greenhouse gases that trap heat around the Earth. Rebecca Newsom from Greenpeace warned hot and dry weather could fuel the conditions for intense wildfires this summer. \"As early spring weather starts to feel more and more like summer, Europe is potentially on track to face ever harsher heat waves and wildfires later in the year. \"The past month's contrasting rainfall extremes across the European region alone pose an immediate challenge to our food systems and to the economy as a whole. \"Europe's citizens must not be left alone to pay for the chaos that dirty energy companies are fuelling.\" She called for new taxes on oil majors to help communities cope with climate disasters."
    },
    {
        "title": "Wolf extinct for 10,000 years brought back to life, researchers claim - but is it true?",
        "description": "A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true?",
        "url": "https://news.sky.com/story/wolf-extinct-for-10000-years-brought-back-to-life-researchers-claim-but-is-it-true-13344117",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pup-wolf_6879422.jpg?20250407225328",
        "type": "World",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-04-07 19:30:00",
        "Headline": "Colossal Biosciences claims to have \"de-extincted\" dire wolves by creating three pups named Romulus, Remus and Khaleesi. But has genetic engineering really led to a rebirth of dire wolves, a species last seen more than 10,000 years ago?",
        "Content": "By Claire Gilbody Dickerson, news reporter  A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true? Here's all we know about the three pups created by Colossal Biosciences, a genetic engineering company which claims to have \"de-extincted\" the dire wolf. What does Colossal say? On Monday, Colossal posted a clip showing two of the pups, named Romulus and Remus (after the mythical founders of Rome who, as legend has it, were brought up by a wolf), howling. \"Sound on\", the enthusiastic post on X reads. \"You're hearing the first howl of a dire wolf in over 10,000 years. \"Meet Romulus and Remus-the world's first de-extinct animals, born on October 1, 2024.\" Another pup, named Khaleesi after the character in Game of Thrones, was born on 31 January this year. \n                  Israeli troops opened fire on ambulances because of 'perceived threat', preliminary IDF investigation says\n                 \n                  US having direct talks with Iran over its nuclear programme\n                 \n                  US President Donald Trump says the US are in direct talks with Iran\n                 Colossal are the same company that created woolly mice in their quest to revive the woolly mammoth, and their goal is to fix extinction by \"combining the science of genetics with the business of discovery\". In the X post, Colossal explained how the pups were \"brought back from extinction\" using genetic edits which came from a complete dire wolf genome which was \"meticulously reconstructed\" from ancient DNA found in fossils of a 13,000-year-old tooth from Ohio and a 72,000-year-old inner ear bone from Idaho. Grey wolves were chosen as the donor species for establishing cell lines as they are the closest living relative of dire wolves. The company edited grey wolf DNA in 20 places over 14 genes to bring about specific changes like a lighter coloured coat, hair length, patterning, as well as body size and musculature. Fertilised eggs were then implanted into surrogate dogs. So the pups look and maybe sound like dire wolves, but they are not a complete genetic match. The research has other limitations. The wolves won't learn to live in the wild. Beth Shapiro, the chief scientific officer of Colossal, said while she would \"love to know the natural behaviour of a dire wolf,\" the pups are \"essentially living the Ritz Carlton lifestyle of a wolf. \"They can't get a splinter without us knowing about it,\" the New York Times quoted her as saying. What do other scientists say?  Adam Boyko, a geneticist at Cornell University who was not involved in the project, told the New York Times: \"It's exciting that we can make functional versions of extinct species.\" Read more from Sky News: King arrives in Rome with Queen after health concernsGlobal bank chiefs hold talks over Trump tariffs crisis But he claimed the pups can't truly be dire wolves as they are not being brought up in dire-wolf packs where they would learn their behaviour. And while the dire-wolf genes being carried by the pups could shed some light on the biology of the extinct species, Dr Boyko suggested there are many other genes which may have contributed to making dire wolves distinct from other wolves. \"We don't know what that number is,\" he said. \"It could be 20, or it could be 2,000.\" The New Scientist also looked at Colossal's claim of having recreated dire wolves and weren't entirely convinced. In an article entitled \"No the dire wolf has not been brought back from extinction\" they noted Dr Shapiro's claim grey wolves and dire wolves share 99.5 per cent of their DNA, but \"since the grey wolf genome is around 2.4 billion base pairs long, that still leaves room for millions of base-pairs of differences\". Given that there were only 20 gene edits it's not close to having the genetic make up of the dire wolf. But as Colossal's Beth Shapiro told the magazine: \"if they look like this animal, then they are the animal.\""
    },
    {
        "title": "MP deported from Israel accuses it of 'control and censorship'",
        "description": "An MP denied entry and deported from Israel has accused the state of \"control and censorship\".",
        "url": "https://news.sky.com/story/mp-deported-from-israel-accuses-it-of-control-and-censorship-13343977",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-abtisam-mohamed-yuan-yang_6879185.png?20250407182735",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-07 15:51:00",
        "Headline": "\"No state, however powerful, should be beyond criticism,\" says Abtisam Mohamed, who was visiting the West Bank along with fellow Labour MP Yuan Yang to learn about the work of humanitarian aid projects. ",
        "Content": "\n          Political reporter\n              @alixculbertson\n  An MP denied entry and deported from Israel has accused the state of \"control and censorship\". Labour MP Abtisam Mohamed told the House of Commons: \"This act was not just a diplomatic affront, this wasn't about security. \"It was about control and censorship and the exposure of Israel. No state, however powerful, should be beyond criticism.\" Ms Mohamed and fellow Labour MP Yuan Yang were denied entry to Israel when they arrived there on Saturday as part of a parliamentary delegation to visit humanitarian aid projects in the West Bank, they said. The two women were then deported, sparking a political row in which the Israelis have accused them of being there to \"provoke anti-Israel activities\" following comments they have made in parliament. Ms Mohamed said it had been \"a challenging few days\" and that the two MPs are not the only ones who have been \"speaking about the atrocities\" and calling for change. She said many Israelis and Israeli charities were also doing so. Ms Yang, a former journalist, told the Commons she \"understands deeply the significance of bearing witness\" and understood the risks, \"but I did not, however, anticipate the risks of detention and deportation from a British ally\". \n                  Starmer promises 'bold changes' to rules over electric cars in wake of Trump's tariffs\n                 \n                  Starmer can see no quick Trump deal\n                 \n                  Furious row after Labour MPs denied entry to Israel - as Lammy criticises 'disgraceful' Badenoch response\n                 She said their deportation proves what MPs say in the Commons \"matters\", and she asked the Middle East minister what the government can do to ensure future delegations of MPs \"can do so without having to censor their remarks\". Ms Yang revealed another delegation of MPs was set to visit the West Bank this weekend. Middle East minister Hamish Falconer said he would encourage MPs to continue to speak out on Israel and Gaza and advised MPs going to Israel to talk to the Foreign Office in advance. Government needs to make it clear this is 'unacceptable' Earlier, the head of the group who organised the MPs' trip told Sky News the government needed to make it \"very clear\" to the Israelis it was \"unacceptable\" to have denied them entry. Chris Doyle, director of Caabu, said he wanted the government to tell the Israelis the deportations \"should be revoked\". On Sunday, Foreign Secretary David Lammy said he had spoken to his Israeli counterparts and made it clear \"this is no way to treat British parliamentarians\". \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities,\" he added. Read more:Who are the two MPs deported from Israel?'Atrocious' killing of aid workers by Israel must be independently investigated Former journalist Ms Yang has only spoken once in the Commons about Israel-Gaza since she became an MP last year. She called on the government to ensure journalists can work safely in Gaza and then posted on X about many of her former Financial Times colleagues being denied entry to Gaza by Israel, as have all international reporters. Ms Mohamed is Yemeni-Muslim and has been outspoken against Israel in her role on the Foreign Affairs Committee, speaking in the Commons five times on the topic since becoming an MP last July. The MP has described Israel's actions in Gaza as \"war crimes\", something Israel has rejected. She also spearheaded a cross-party call from 61 MPs for a UK ban on Israeli goods.  It is 'right' MPs visit West Bank Mr Doyle has been Caabu's director for 23 years and said Ms Yang and Ms Mohamed were visiting as part of a \"long-running programme\" that has seen the organisation take MPs and peers from all parties to the occupied West Bank, and previously to Gaza, to \"assess the situation on the ground\". Caabu has taken 161 politicians there since 1997, including party leaders and MPs now in the cabinet, Mr Doyle said. He said the two MPs and their two aides had been set to meet Oxfam and UN representatives, which he said is the \"right and proper thing\" because the UK is a major donor to projects there, giving hundreds of millions of pounds over the years.  Israel: MPs promoted sanctions Israel's UK embassy said the MPs were denied entry because they had \"accused Israel of false claims, were actively involved in promoting sanctions against Israeli ministers, and supported campaigns aimed at boycotting the state of Israel\". Conservative leader Kemi Badenoch has caused consternation among many MPs after saying Israel \"has a right to police its borders\" and that the government's travel advice states if you have called for a boycott of Israel or Israeli settlements, or publicly criticised Israel, you can be refused entry."
    },
    {
        "title": "Israeli airstrikes kill more than 30 people in Gaza - including more than a dozen women and children",
        "description": "Israeli airstrikes have killed more than 30 people in Gaza, including over a dozen women and children, local health officials have said.",
        "url": "https://news.sky.com/story/israeli-airstrikes-kill-more-than-30-people-in-gaza-including-more-than-a-dozen-women-and-children-13343661",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-palestinian-journalists_6878452.jpg?20250407065720",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-07 02:48:00",
        "Headline": "An Israeli airstrike also hit a tent in Khan Younis, which was being used as a base by a number of journalists.",
        "Content": "Israeli airstrikes have killed more than 30 people in Gaza, including over a dozen women and children, local health officials have said. Strikes overnight into Sunday hit a tent and a house in Khan Younis, killing five men, five women and five children, according to Nasser Hospital, which received the bodies. Later on Sunday, at least two people were killed, and six others injured when an Israeli airstrike hit a tent in Khan Younis located outside the Nasser hospital, which was being used as a base by a number of journalists. A number of them were among the injured, according to hospital officials. Footage showed a journalist being engulfed by flames after his tent was hit by an airstrike. He is reported to be in a critical condition. Israeli shelling killed at least four people in the Jabaliya refugee camp, according to Gaza's Hamas-run Health Ministry. The bodies of seven people, including a child and three women, arrived at Al Aqsa Martyrs Hospital in Deir al Balah, according to an Associated Press journalist there. And a strike in Gaza City hit people waiting outside a bakery, killing six, including three children, according to the civil defence, which operates under the Hamas-run government. Last month, Israel ended its ceasefire with Hamas and restarted its air and ground offensive. It has carried out waves of strikes and seized territory in an attempt to pressure Hamas to accept a new deal for a truce and release the remaining hostages. It has also blocked the import of food, fuel and humanitarian aid for over a month. \"Stocks are getting low and the situation is becoming desperate,\" the United Nations agency for Palestinian refugees said on social media. Read more from Sky News:Stock markets tumble as Trump calls tariffs 'medicine'Starmer promises 'bold changes' in wake of tariffsFurious row after Labour MPs denied entry to Israel  On Sunday night, Israel's military ordered Palestinians to evacuate several neighbourhoods in Gaza's Deir al Balah shortly after around 10 projectiles were fired from Gaza. The military said around five were intercepted, and Hamas's military arm claimed responsibility. Police said a rocket fell in Ashkelon, an Israeli city just to the north of Gaza, and fragments fell in several other areas. The Magen David Adom emergency service said one man was lightly injured, and the military later said it struck a rocket launcher in Gaza. Netanyahu visits Trump It comes as Israeli Prime Minister Benjamin Netanyahu heads to the United States to meet with Donald Trump to discuss the war. Mr Netanyahu said the pair would also discuss the new 17% tariff imposed on Israel as part of Mr Trump's sweeping new tariffs. \"There is a very large queue of leaders who want to do this with respect to their economies. I think it reflects the special personal connection and the special connection between the United States and Israel, which is so vital at this time,\" Mr Netanyahu said during a visit to Hungary. The war between Israel and Hamas began when Hamas-led militants invaded Israel on 7 October 2023 and killed around 1,200 people and took 251 hostage. Some 59 hostages are still being held in Gaza, with 24 still believed to be alive. Israel's offensive has killed at least 50,695 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between civilians or combatants, with another 115,338 wounded. Israel says it has killed around 20,000 militants."
    },
    {
        "title": "Catholic jubilee: What is it and should you still travel to Italy this year?",
        "description": "The King and Queen are set to begin a state visit to Italy, a trip that coincides with the Catholic jubilee year, an event that only happens every 25 years.&#160;",
        "url": "https://news.sky.com/story/catholic-jubilee-what-is-it-why-are-the-king-and-queen-going-and-should-you-still-travel-to-italy-13339826",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vatican-city-pop-jubilee_6873673.jpg?20250402101056",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-07 06:30:00",
        "Headline": "The King and Queen's state visit to Italy will coincide with the jubilee year, an event in the Catholic calendar that is estimated to bring 30-32 million visitors to Rome across 12 months. Here is everything you need to know.",
        "Content": "The King and Queen are set to begin a state visit to Italy, a trip that coincides with the Catholic jubilee year, an event that only happens every 25 years.  The four-day visit will see Charles and Camilla attend a series of public and diplomatic events in the capital, Rome, and the city of Ravenna. This year, Rome expects to welcome three times its normal number of visitors - between 30 and 32 million, compared to an average of 10 million - as Catholics travel to the city for the jubilee, which marks a time of pilgrimage, reflection, and spiritual renewal. The jubilee, also known as the holy year, officially began on 24 December 2024 and will run until 6 January 2026. With major events throughout the year, Rome will be particularly busy - so much so that the UK Foreign Office has updated its advice for tourists planning to travel there. Here is everything you need to know. What is the Catholic jubilee? A jubilee year is a time for Catholics to \"re-establish a proper relationship with God, one another and with all of creation\", according to the Catholic Church in England and Wales. Each jubilee year starts with the Pope opening the Holy Doors at St Peter's Basilica on Christmas Eve in the Vatican City. This represents the passage from sin to grace and new beginnings. The pontiff then opens a further four Holy Doors which remain open for the entire year. This jubilee year, the Pope opened San Giovanni in Laterano (St John Lateran) on 29 December, Santa Maria Maggiore (St Mary Major) on 1 January and St Paul's Outside the Walls on 5 January. For the first time, he also opened a Holy Door at a prison. He opened one at Rebibbia new complex prison in Rome on 26 December as a gesture of hope for prisoners. As the pontiff, the Pope has the authority to proclaim any church door as a Holy Door. The goal of pilgrims who travel to Rome during a jubilee year is to pass through at least one of the Holy Doors. Why are the royals going to Italy? Despite being head of the Church of England, the King was set to meet the Pope, a meeting that would have marked \"a significant step forward in relations between the Catholic Church and Church of England\", according to Buckingham Palace.  However, due to the 88-year-old pontiff recovering from pneumonia, the private meeting between the two has been postponed. Instead of going to the Holy See - the government of the Roman Catholic Church located in the Vatican - Charles and Camilla will make a historic visit to the Papal Basilica of St Paul's Outside the Walls and the King will become the first British monarch to address a joint session of the Italian parliament. During the last jubilee, in the year 2000, Queen Elizabeth II met with Pope John Paul II at the Vatican. Can I still travel to Italy this year? Rome is expected to be \"very busy\" throughout this year, particularly when bigger jubilee events take place, the UK Foreign Office (FCDO) has said. In an update on 17 March, it advised Britons wanting to head to Italy, particularly the capital, to plan ahead. The US Embassy in Italy has also updated its website to say: \"Be prepared for crowds and extended wait times for transportation and entry into locations. \"You should book accommodations, transportation, and attraction tickets well in advance of arrival. Rome's public transportation system will be under strain, and regular routes and schedules may change.\" There are events taking place nearly every month, with the most listed for May and June. Events targeted towards specific groups of people, including families, workers, entrepreneurs and disabled people will take place, as well as concerts and special exhibitions in Rome's museums. The FCDO says people wanting to take part in the jubilee or organise a pilgrimage will need a Pilgrim's card. This is free to download and can be obtained on the jubilee website or through the official app. Despite Italy being busier than usual, Rome and other parts of the country are set to look their best for the jubilee, having been under construction nearly all of last year. The capital pulled together billions of euros of state and European funds to overhaul tourist sites, transport hubs, parks, streets and even its rubbish bins. Mayor Roberto Gualtieri told Reuters last year that the jubilee was an \"unmissable opportunity to make structural changes... and transform Rome\". A record 3,200 public construction works were scheduled to take place, including 322 projects that were deemed essential for the jubilee. Tips from a tour guide Livia Angelini, a travel specialist at tour operator Scott Dunn, said for people planning to visit the Italian capital this year, \"timing is everything\". She recommends avoiding peak travel season in June and July, and when planning to visit major tourist sites such as the Vatican and Colosseum, go earlier in the morning rather than in the afternoon and on weekdays rather than weekends. Read more:Pope arrives back at VaticanKing returns to official duties Ms Angelini added that visiting \"lesser-known neighbourhoods to see some of the more local areas\" will also give tourists a more authentic Roman experience without huge crowds. \"Wander the quiet, charming streets of Garbatella, and lose yourself in Monti, home to eclectic boutiques and traditional Roman trattorias,\" she said. \"For those travellers who seek to combine another area, I recommend heading to the coast or countryside after your time in Rome. Hop on a train to Naples and ferry across to the idyllic island of Ischia, explore the vineyards and hilltop towns of Tuscany, or embrace a slower pace of life in Puglia.\""
    },
    {
        "title": "Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down",
        "description": "Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down.",
        "url": "https://news.sky.com/story/trump-says-no-pause-on-tariffs-after-rollercoaster-day-on-wall-street-ends-with-most-us-markets-down-13344156",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-s-and-p-share-stock-market_6879445.jpg?20250407232520",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 21:14:00",
        "Headline": "The US president also threatened to impose a further 50% duty on China as economists fear his sweeping tariffs could plunge the world into a global recession.",
        "Content": " Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down. Intense swings were seen on the three main stock market indexes on Monday as economists fear the US president's \"Liberation Day\" levies could cause a global recession. The S&P 500 closed the day 0.23% lower, while the Dow Jones Industrial Average finished down 0.91%, and the Nasdaq ended in positive territory, up 0.10%. Trump tariffs: Follow latest updates All three indexes started the day sharply lower, and the Dow plunged as many as 1,700 points following even worse losses elsewhere in the world. But it suddenly surged to a gain of nearly 900 points in the late morning. The S&P 500, meanwhile, went from a loss of 4.7% to a leap of 3.4%, which would have been its biggest jump in years. The sudden rise appears to have been the result of a social media post that incorrectly claimed that Kevin Hassett, White House National Economic Council director, said Mr Trump was considering a 90-day pause in tariffs for all countries except China. Reports first emerged through the US business news channel CNBC. The White House later told CNBC any talk of a 90-day pause was \"fake news\". Financial pain hammers investments around the world The financial pain once again hammered investments around the world, with stocks in Hong Kong plunging 13.2% for their worst day since 1997. Meanwhile, the UK's benchmark stock index, the FTSE 100, closed 4.38% down. It is one of the biggest drops in years, in line with the falls seen in the early days of COVID-19 lockdowns, but less steep than the 4.95% loss seen on Friday. Only a handful of the 100 most valuable companies listed on the London Stock Exchange saw any boost to their share price all day. Read more: Major economic shock happening because of TrumpIs this the start of an 'economic nuclear winter?'Global bank chiefs hold talks over tariffs crisis 👉 Follow Trump 100 on your podcast app 👈 Trump 'not looking' at pausing tariffs When asked in the Oval Office on Monday evening whether he would pause tariffs, Mr Trump said: \"We're not looking at that.\" The president added that affected countries have been negotiating with his administration, which he said will try and make \"fair deals\" with each of them. \"We're going to get fair deals with every country and if we don't they are not going to be able to participate with the US,\" he added. Mr Trump also claimed the US \"has been ripped off by many countries over the years\", adding: \"We can't do it anymore. We can't be the stupid people anymore.\" Analysis: Tariffs could herald one of the most painful episodes in modern times Trump threatens additional 50% tariff on China It came after the US president threatened in a post on his Truth Social platform that he would impose an additional 50% tariff on China if the nation does not withdraw its 34% retaliatory tariff. Beijing imposed the duty after Mr Trump announced his tariff on China last week. The US president added in his Truth Social post that Beijing has until Tuesday to remove its retaliatory tariff. Some investors are holding onto hope that Mr Trump may still lower his tariffs after negotiating with countries, and Mr Trump said on Sunday that he has heard from leaders \"dying to make a deal\".  'Sometimes you have to take medicine to fix something' A drop in tariffs relatively soon could help avoid a recession, but whether that can happen is still uncertain. On Sunday, Mr Trump told reporters aboard Air Force One that he does not want markets to fall. But he also said he was not concerned about a sell-off, saying \"sometimes you have to take medicine to fix something\". Mr Trump has given several reasons for his stiff tariffs, including to bring manufacturing jobs back to the United States, which is a process that could take years. The US president has said he wanted to bring down the numbers for how much more the United States imports from other countries versus how much it sends to them. \"The recent tariffs will likely increase inflation and are causing many to consider a greater probability of a recession,\" JP Morgan chief executive Jamie Dimon wrote in his annual letter to shareholders on Monday. \"Whether or not the menu of tariffs causes a recession remains in question, but it will slow down growth\", added Mr Dimon, who is one of the most influential executives on Wall Street."
    },
    {
        "title": "Trump's tariffs: A negotiating tactic or the start of an 'economic nuclear winter'?",
        "description": "Traders called this morning a complete bloodbath as the UK's FTSE 100 joined world indexes in turning red as uncertainty over Donald Trump's tariffs continued to batter stock markets.",
        "url": "https://news.sky.com/story/trumps-tariffs-a-negotiating-tactic-or-the-start-of-an-economic-nuclear-winter-13343781",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6879222.jpg?20250407191347",
        "type": "US",
        "Author": "Darren McCaffrey, business presenter",
        "Date Published": "2025-04-07 09:47:00",
        "Headline": "Bill Ackman - a billionaire Trump backer who is against the tariffs - has warned of an \"economic nuclear winter\" if the president does not change course. ",
        "Content": "By Darren McCaffrey, business presenter  Traders called this morning a complete bloodbath as the UK's FTSE 100 joined world indexes in turning red as uncertainty over Donald Trump's tariffs continued to batter stock markets. Across Asia and Europe, hundreds of billions have been wiped off companies' values, particularly in banking and manufacturing. The cause is not just the imposition of those tariffs (the largest the US has inflicted since the 1930s) and the very obvious drag this will have on global trade and growth, but also the uncertainty of 'what next?'.  Trump tariffs latest: Musk shares video about 'essential' free market Investors cannot work out if the Trump administration is genuinely wedded to tariffs on this scale, on the proviso that they will help re-shore companies and millions of jobs to the United States. They don't know if they are permanent or merely part of a negotiating tactic to address trade imbalances, and for America to use its economic heft to strike better deals. If Mr Trump is open to deals (the first test comes later in a meeting with the Israeli prime minister), markets will calm, even if the midst of uncertainty hasn't fully cleared.  However, if this is a genuine rewiring of global trade and the end of globalisation as we know it, markets and economies will continue to get battered. Read more:Trump's 'Liberation Day' explainedWhat Sky correspondents make of tariff announcement As one Trump supporter, billionaire Bill Ackman - who opposes the tariffs - put it, President Trump has launched a \"global economic war against the whole world\" that will usher in an \"economic nuclear winter.\" It's time for all of us to buckle up."
    },
    {
        "title": "Social media posts spark US markets upturn - before White House clarification sends them back into the red",
        "description": "A rumour on social media fuelled a brief upturn for struggling US stock markets &#8211; but they swiftly swung back down again after the claim was debunked by the White House.",
        "url": "https://news.sky.com/story/social-media-posts-spark-us-markets-upturn-before-white-house-clarification-sends-them-back-into-the-red-13344032",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-stock-exchange-new-york_6879214.jpg?20250407190609",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 17:29:00",
        "Headline": "On Monday, the US markets opened with a fall for the third day in a row, before a brief lift which has been attributed to social media posts labelled 'fake news' by the White House.",
        "Content": "A rumour on social media fuelled a brief upturn for struggling US stock markets – but they swiftly swung back down again after the claim was debunked by the White House. Markets around the world have struggled since some of Donald Trump's new import tariffs came into effect over the weekend. Tariffs latest: Starmer sets out response to US levies The US markets opened on Monday with a fall for the third day in a row but briefly rallied and showed growth of over 2% at 3.15pm UK time. The upturn came after a social media rumour claimed a top Trump administration adviser had suggested the president could be considering a 90-day pause on tariffs. The origin of the false report was unclear but it appeared to be a misinterpretation of a comment made by a White House employee during a Fox News interview. Asked if the US president would consider a pause, Kevin Hassett, White House National Economic Council director, said: \"I think the president is going to decide what the president is going to decide. \n                  Trump's tariffs news conference with Netanyahu was typically noncommittal, vague and contradictory\n                 \n                  US Supreme Court delays deadline to return man mistakenly deported to El Salvador\n                 \n                  US having direct talks with Iran over its nuclear programme\n                 \"There are more than 50 countries in negotiation with the president.\" Nearly two hours later, multiple X accounts posted identical messages claiming Mr Hassett said a pause - for all countries except China - was being considered. The identical posts were picked up by some news outlets and stock traders, sending the markets skyrocketing. However, when the White House said any talk of a pause was \"fake news\", they were sent back into the red. US correspondent It was the stock market as a spectator sport. The moment, mid-morning, when a Trump aide had given a TV interview and subsequent headlines screamed that Trump was considering a 90-day pause on tariffs.   Suddenly, the markets went from red to green.   Make that green to red, just minutes later, when the White House dismissed the story as fake news, insisting there would be no pause.  Investors duly reverted back to panic mode.  It was market volatility writ large.  The stance inside the White House can be best characterised as 'panic, what panic?'.  Donald Trump on Monday joked his way through a photo call with the Los Angeles Dodgers, winners of baseball's World Series, ahead of his meeting with Israeli Prime Minister Benjamin Netanyahu. For those two men, there is much on the agenda, of course - not least the collapse of the ceasefire in Gaza. On that, this will be an important stage in a grinding diplomacy that has ground to a halt around a ceasefire.  On tariffs, with Netanyahu, there will be a first look at how negotiations work with the punitive president.  Israel faces a 17% tariff from its largest trade partner and ally.  How to strategise a route towards the sweet spot? With Trump's first visitor since the tariff announcement comes a first test of how negotiations work and what they produce. The world will be watching agog – as all the world has a stake. Mr Trump has remained defiant despite fears that his levies could be pushing the US towards a recession. 👉 Follow Trump 100 on your podcast app 👈 The US president has insisted the taxes are necessary for rebuilding domestic manufacturing and resetting trade relationships with other countries. \"Be Strong, Courageous, and Patient, and GREATNESS will be the result!\" he wrote on Truth Social on Monday. More from Sky News:Trump and Netanyahu cancel news conferenceAsian stock markets tumble after tariffs   Mr Trump - who played golf in Florida over the weekend - has also threatened an extra tariff on China, after Beijing announced a retaliatory levy on the US. He said if Beijing does not withdraw its retaliatory tax, the US will impose an additional 50% levy on China and \"negotiations with other countries, which have also requested meetings, will begin taking place immediately\"."
    },
    {
        "title": "US having direct talks with Iran over its nuclear programme",
        "description": "Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail.",
        "url": "https://news.sky.com/story/us-having-direct-talks-with-iran-as-trump-insists-tehran-cannot-get-nuclear-weapons-13344111",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-tehran-nuclear_6879402.jpg?20250407223122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 19:24:00",
        "Headline": "Iran has previously pushed back against Donald Trump's demand that it enter direct negotiations, but the US president has now said discussions \"at almost the highest level\" have begun.",
        "Content": " Donald Trump has said the US is having direct talks with Iran over its nuclear programme - stating Iran will be in \"great danger\" if the negotiations fail. The president has insisted Tehran cannot get nuclear weapons. Iran had pushed back against Trump's demand that it enter negotiations over its nuclear programme or be bombed, but speaking at the White House on Monday, Mr Trump said: \"We're having direct talks with Iran, and they've started. \"It'll go on Saturday,\" he continued. \"We have a very big meeting, and we'll see what can happen. And I think everybody agrees that doing a deal would be preferable.\" When pressed for more details on the talks, the US president said they are taking place \"at almost the highest level\". He would not be drawn on where the meeting this weekend is taking place. \"Hopefully those talks will be successful, it would be in Iran's best interests if they are successful,\" he said. \"We hope that's going to happen.\" Mr Trump made the comments to reporters during an Oval Office meeting with Israeli Prime Minister Benjamin Netanyahu. \n                  Trump's tariffs news conference with Netanyahu was typically noncommittal, vague and contradictory\n                 \n                  US Supreme Court delays deadline to return man mistakenly deported to El Salvador\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 Mr Trump's previous warnings of possible military action against Iran heightened already tense nerves across the Middle East. He has said he would prefer a deal over military confrontation and in March wrote to Iran's supreme leader Ayatollah Ali Khamenei to suggest talks. Iranian officials at the time said Tehran would not be bullied into negotiations. Middle East correspondent It now seems clear why the Israelis were summoned to the White House at short notice.  The US and Iran will sit down together to directly negotiate a nuclear deal in a matter of days.  Mr Trump didn’t say who would be taking part in the talks but said it would be “almost at the highest level”.  He wouldn’t reveal the location, and he didn’t put a timeline on it, but Washington and Tehran in close dialogue is a major development in Middle East geopolitics.  Benjamin Netanyahu had to sit there, listen and accept it.  By doing it publicly, in the Oval Office, Mr Trump has asserted his power and effectively forced the Israeli prime minister to accept the outcome.  Iran is yet to respond publicly, and it’s not clear what role Britain and France might play, as nuclear states and permanent members of the UN Security Council. Maybe none at all.  Mr Trump said Iran would be “in great danger” if the talks failed, but stopped short of explicitly saying he would order military action.  Mr Trump wants a deal, Israel will not be at the table and Mr Netanyahu’s ability to influence the talks, if he doesn’t like the way they are going, will be limited.  Some in Israeli media are describing the meeting as a humiliation for the prime minister and I suspect Mr Netanyahu will have left the White House concerned and possibly angry by what he heard.  But Mr Netanyahu has long shown an ability to force himself into the conversation - he won’t sit by and watch the talks progress without finding a way to have his say. \n\n During his first White House term, Mr Trump withdrew the US from a deal between Iran and world powers designed to curb Iran's nuclear work in exchange for sanctions relief. He also reimposed US sanctions. 👉 Follow Trump 100 on your podcast app 👈 Iran has since far surpassed that deal's limits on uranium enrichment. Tehran insists its nuclear programme is wholly for civilian energy purposes but Western powers accuse it of having a clandestine agenda. Read more from Sky News:Social media rumour sparks markets upturnTwo charged over Trump golf resort damage Mr Netanyahu's White House visit - his second in just over two months - was also due to include a news conference but this was cancelled earlier on Monday. Officials said the decision was made because he and Mr Trump had \"two back-to-back media availabilities (the greeting in the Oval Office and the formal news conference), and they wanted to streamline things\"."
    },
    {
        "title": "News conference between Trump and Netanyahu in Washington DC cancelled",
        "description": "A news conference between Donald Trump and Israeli Prime Minister Benjamin Netanyahu due to take place on Monday has been cancelled, the White House has said.",
        "url": "https://news.sky.com/story/news-conference-between-trump-and-netanyahu-in-washington-dc-cancelled-13344027",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 17:13:00",
        "Headline": "The US president and Israeli prime minister, who are expected to hold talks on tariffs and the conflict in Gaza, will still take questions from a smaller number of reporters.",
        "Content": "A news conference between Donald Trump and Israeli Prime Minister Benjamin Netanyahu due to take place on Monday has been cancelled, the White House has said. Officials have said the decision was made because the two leaders had \"two back-to-back media availabilities (the greeting in the Oval Office and the formal news conference), and they wanted to streamline things\". There will instead be \"one big, beautiful news conference\" in the Oval Office, the officials added. A much smaller number of approved reporters will be at the Oval Office than would have been at the now-cancelled news conference. It comes as President Trump is under pressure over his tariffs policy which has sparked a meltdown in the global markets, and Mr Netanyahu faces questions over the killing of 15 aid workers by Israeli troops in Gaza. Whether Mr Netanyahu's visit succeeds in bringing down or eliminating Israel's tariffs remains to be seen, but how it plays out could set the stage for how other world leaders try to address the new tariffs. Tariffs latest: Follow live updates \n                  Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down\n                 \n                  Trump's tariffs: A negotiating tactic or the start of an 'economic nuclear winter'?\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 Mr Netanyahu is the first world leader to visit Mr Trump since he unleashed levies on countries across the world. The two leaders were seen greeting each other with a firm handshake outside the White House ahead of talks on Monday. The US president ignored shouted questions from reporters about the tumbling global markets and whether he would lift tariffs on Israel. Mr Netanyahu's office has put the focus of the hastily organised Washington visit on the tariffs, while stressing that the two leaders will discuss major geopolitical issues including the war in Gaza and tensions with Iran. They will also discuss Israel-Turkey ties and the International Criminal Court, which issued an arrest warrant against the Israeli leader last year. Mr Trump in February signed an executive order imposing sanctions on the ICC over its investigations of Israel. Shortly after arriving in Washington on Sunday evening, Mr Netanyahu met Commerce Secretary Howard Lutnick and US Trade Representative Jameson Greer, to discuss tariffs. In a pre-emptive move last week, Israel announced that it was removing all tariffs on goods from the US, mostly on imported food and agricultural products, according to a statement from Netanyahu's office. But the apparent tactic failed, and with a 17% rate, Israel was just one of dozens of countries that were slapped with tariffs on Mr Trump's so-called Liberation Day the following day. Ahead of his meeting with Mr Trump, the Israeli prime minister met Steve Witkoff, Mr Trump's special envoy to the Middle East, on Monday.Read more from Sky NewsDo tariffs mark start of an 'economic nuclear winter'?Singer 'thrown to lions' in El Salvador jailMP deported from Israel accuses it of 'censorship'  The US president and Mr Netanyahu are expected to discuss Israel's hoped-for annexation of parts of the occupied West Bank, which the Palestinians want as the heart of their future independent state. Eytan Gilboa, an expert on US-Israel relations, said he expected Mr Trump to use the tariffs as leverage to force concessions from Mr Netanyahu. In Israel's case, those concessions might not be economic. Mr Trump may pressure Mr Netanyahu to move towards ending the war in Gaza - at the very least through some interim truce with Hamas that would pause the fighting and free more hostages. Mr Gilboa said Mr Trump is hoping to return from his first overseas trip - expected next month to Saudi Arabia - with some movement on a deal to normalise relations with Israel, which would likely require significant Israeli concessions on Gaza. If he does manage to move toward bolstering ties between Israel and Saudi Arabia, that would act as a regional diplomatic counterweight to pressure Iran, against which Mr Trump has threatened new sanctions and suggested military action over its nuclear programme."
    },
    {
        "title": "US Supreme Court delays deadline to return man mistakenly deported to El Salvador",
        "description": "The US Supreme Court has delayed a midnight deadline for Donald Trump's administration to return a man mistakenly deported to a notorious prison in El Salvador.",
        "url": "https://news.sky.com/story/us-supreme-court-delays-deadline-to-return-man-mistakenly-deported-to-el-salvador-13344180",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 23:18:00",
        "Headline": "A US district judge had ordered the administration to return Kilmar Abrego Garcia by the end of Monday, after he and his family filed a lawsuit challenging the legality of his deportation.",
        "Content": "The US Supreme Court has delayed a midnight deadline for Donald Trump's administration to return a man mistakenly deported to a notorious prison in El Salvador. A US district judge had ordered the administration to return Kilmar Abrego Garcia by the end of Monday, after he and his family filed a lawsuit challenging the legality of his deportation. The US president's administration had conceded the 29-year-old should not have been sent to El Salvador because an immigration judge found he likely would face persecution by local gangs. But the administration argued he is no longer in US custody and the government has no way to get him back. US District Judge Paula Xinis gave the administration until just before midnight to \"facilitate and effectuate\" Mr Garcia's return. She found the government had no lawful authority to detain and deport Mr Garcia, a Salvadoran migrant who lived in Maryland legally with a work permit. She said the decision to arrest him and send him to El Salvador appears to be \"wholly lawless\" as little to no evidence supports a \"vague, uncorroborated\" allegation he was once a member of the gang MS-13, which Mr Trump's administration had designated a foreign terrorist organisation. Mr Garcia's lawyers have denied he is part of a gang. 👉 Follow Trump 100 on your podcast app 👈 Chief Justice John Roberts, acting on behalf of the US Supreme Court, temporarily halted the judge's order, giving the nine justices additional time to consider the administration's request to block the order while litigation in the case continues. Read more from Sky News:Trump says there will be no pause on tariffsUS having direct talks with Iran over its nuclear programmeFirst child in UK born from womb transplant Supreme Court allows Trump to use 18th-century law for deportations It comes as the Supreme Court allowed the Trump administration to use a wartime law from 1798 to deport Venezuelan migrants - but said they must get a court hearing before they are removed from the US. The bitterly divided 5-4 decision was a response to the administration's emergency appeal over a court order that had temporarily blocked the summary deportations under President Trump's usage of the Alien Enemies Act while litigation in the case continues. Reacting to the decision with a post on his social media platform Truth Social, Mr Trump wrote: \"The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself. A GREAT DAY FOR JUSTICE IN AMERICA!\" The president invoked the act, best known for being used to intern Japanese, Italian and German immigrants during the Second World War, on 15 March to deport alleged members of the Tren de Aragua gang."
    },
    {
        "title": "Texas: Second child with measles dies as US outbreak spreads",
        "description": "A second child in Texas with measles has died as the outbreak of the childhood disease reached nearly 500 cases in the state, officials have said.",
        "url": "https://news.sky.com/story/texas-second-child-with-measles-dies-as-us-outbreak-spreads-13343693",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-measles-texas_6878451.jpg?20250407065328",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 05:53:00",
        "Headline": "An unvaccinated schoolgirl dies from measles pulmonary failure, officials say, having caught the illness recently in an area where vaccination rates are below the safe level.",
        "Content": "A second child in Texas with measles has died as the outbreak of the childhood disease reached nearly 500 cases in the state, officials have said. The unvaccinated schoolgirl, who had no underlying health conditions, died on Thursday in hospital from measles pulmonary failure, the Texas Department of State Health Services said. She was being treated for complications from the illness, a spokesperson for University Medical Center Children's Hospital in Lubbock said in an email.   The girl was recently diagnosed with the viral disease, NBC, Sky's US partner said, quoting from the hospital's statement issued on Sunday. Two children have now died in Texas since an outbreak of measles in late January in Gaines County, where the vaccination rate is about 82%, below the 95% believed to ensure those who cannot be vaccinated are safe. An adult in New Mexico is also suspected of having died from measles, NBC said, calling the deaths the first from the disease in the US for 10 years. US President Donald Trump, speaking to reporters on Air Force One on Sunday, said that, if the outbreak continues, his administration will \"have to take action very strongly\". Measles is spread when an infected person breathes, coughs or sneezes. A rash usually appears a few days after the cold-like symptoms. The rash starts on the face and behind the ears before spreading to the rest of the body. A person is infectious from when they first have symptoms (around four days before the rash appears) until four days after they get the rash. There are things people can do to reduce the risk of spreading or catching measles.\n Do: Wash hands often with soap and warm water. Use tissues when coughing or sneezing. Throw used tissues in the bin. Don't: Do not share cutlery, cups, towels, clothes, or bedding.\n\n Information from NHS website US Health and Human Services Secretary Robert F Kennedy Jr, identified the child as eight-year-old Daisy Hildebrand and said he visited Texas on Sunday to comfort the child's family. Pictures were published of him at the girl's funeral in Seminole, northwest Texas. In a post on X, Mr Kennedy, a vaccine sceptic who says it should be a personal choice, said vaccines are nonetheless the best protection against the illness. He said the MMR (measles, mumps, rubella) vaccine is \"the most effective way to prevent the spread of measles\", confirming that, as of Sunday, there were 642 confirmed cases of measles in the US, 499 of those in Texas.  The Texas Department of State Health Services said, as of Friday, 481 cases of measles had been confirmed, a rise of 14% in a week. They include six infants and toddlers at a Lubbock day care centre that tested positive in the past two weeks. Read more on SkyMeasles 'wake-up call'Mum urges parents to vaccinate childen Two of those children are among 56 people who have been treated in hospital for measles in the area since the outbreak started, NBC said, quoting health officials. Measles is one of the most contagious viruses for humans. In serious cases, infections can cause complications including pneumonia, encephalitis, dehydration and blindness. The Texas Department of State Health Services described it as a \"highly contagious viral infection, which can cause life-threatening illness to anyone who is not vaccinated\". Early symptoms can include a fever, cough and a runny nose, developing into a red-brown rash and high temperature."
    },
    {
        "title": "At least 19 dead after storms bring flooding and tornadoes to parts of US",
        "description": "At least 19 people are reported to have died after severe weather, including tornadoes, heavy rain, and flooding, continued to hit parts of the US over the weekend.",
        "url": "https://news.sky.com/story/at-least-19-dead-after-storms-bring-flooding-and-tornadoes-to-parts-of-us-13343749",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kentucky-dawson-springs_6878502.jpg?20250407080305",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 08:44:00",
        "Headline": "A series of storms, brought on by warm temperatures, an unstable atmosphere, strong winds, and large amounts of moisture arriving from the Gulf, have brought tornadoes, heavy rains and flooding to parts of the US.",
        "Content": "At least 19 people are reported to have died after severe weather, including tornadoes, heavy rain, and flooding, continued to hit parts of the US over the weekend. Sky's US partner network, NBC News, put the total number of deaths at 19, including 10 in Tennessee, where a 57-year-old man's car went into floodwaters, and two in Mississippi. Some cities ordered people to leave their homes, while rescue crews have been using inflatable boats to check on residents in Kentucky and Tennessee. Stocks falling again - latest Power and gas have been cut off in parts of a region stretching from Texas to Ohio. Nonstop rain has seen the Kentucky River crest above 49 feet in the state capital, Frankfort, two feet below the maximum the city's flood wall is designed for. A nine-year-old boy was one of the reported deaths in the state, after he was caught up in floodwaters while walking to catch his school bus. He was one of two people who died in Kentucky, where more than 500 roads were closed, according to state governor Andy Beshear. He said on X on Sunday that \"rivers have not yet crested, so we still have a day - if not more - of rising waters. We'vealready lost two of our people\". In Arkansas, a five-year-old boy died after a tree fell on his family's home, police said, while a 16-year-old volunteer Missouri firefighter died in a crash while trying to rescue people caught in the storm. A mandatory evacuation was issued for two towns, Falmouth and Butler, near the bend of the rising Licking River, which rose to 50 feet (15 meters) in 1995, leading to five deaths and 1,000 homes being destroyed. A series of storms, brought on by warm temperatures, an unstable atmosphere, strong winds, and large amounts of moisture arriving from the Gulf, began to crash into the south and parts of the midwest last week. By Sunday, more than 90 tornadoes had been reported in at least 10 states, from Kansas to Ohio, ABC News reported. More than five inches (13cm) of rain fell on Saturday in Jonesboro, Arkansas, setting a new April record in the city. In Tennessee, 14 inches (35cm) of rain fell on Memphis from Wednesday to Sunday, NWS said. Rives, a northwestern Tennessee town of about 200 people, was almost entirely underwater after the Obion River overflowed. In nearby Dyersburg, dozens of people arrived over the weekend at a storm shelter carrying essentials, including blankets and pillows. Read more on Sky News:'Thrown to lions' in El Salvador jailSecond child with measles diesUS movie star confirms special relationship It came days after the city was hit by a tornado that caused millions of dollars in damage. Dozens of locations in multiple states could see extensive flooding of structures, roads, bridges, and other critical infrastructure, the National Weather Service (NWS) warned on Sunday. Kentucky, Tennessee, and Alabama could see more flooding from torrential rains, while tornadoes are possible in Alabama, Georgia, and Florida, NWS said. Numerous flood and flash flood warnings remained in place on the NWS website."
    },
    {
        "title": "'The heartbeat of Blondie': Drummer Clem Burke dies aged 70",
        "description": "Blondie drummer Clem Burke has died at the age of 70",
        "url": "https://news.sky.com/story/the-heartbeat-of-blondie-drummer-clem-burke-dies-aged-70-13343992",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-clem-burke-blondiw_6878986.jpg?20250407154707",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-07 16:03:00",
        "Headline": "The musician was hailed as a \"beloved friend and bandmate\" whose talent and energy were \"unmatched\" and as \"a source of inspiration both on and off the stage\". His final live appearance was with Blondie last year.",
        "Content": "Blondie drummer Clem Burke has died at the age of 70 The band said Burke had been diagnosed with cancer, and described his death as a \"profound loss\". He featured on all the Debbie Harry-fronted group's studio albums since joining a year after their formation in 1975. Burke was with the band from their self-titled debut, through their 1978 classic Parallel Lines, to 2017's Pollinator. In a statement on Blondie's Instagram, Harry and the band's guitarist, Chris Stein, said: \"It is with profound sadness that we relay news of the passing of our beloved friend and bandmate Clem Burke following a private battle with cancer. \"Clem was not just a drummer, he was the heartbeat of Blondie. \"His talent, energy, and passion for music were unmatched, and his contributions to our sound and success are immeasurable. \n                  Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down\n                 \n                  Trump's tariffs: A negotiating tactic or the start of an 'economic nuclear winter'?\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 \"Beyond his musicianship, Clem was a source of inspiration both on and off the stage. His vibrant spirit, infectious enthusiasm and rock solid work ethic touched everyone who had the privilege of knowing him. \"Clem's influence extended far beyond Blondie, a self-proclaimed 'rock and roll survivalist', he played and collaborated with numerous iconic artists.\" Burke featured on Iggy Pop's 1982 album Zombie Birdhouse and also performed with Bob Dylan, The Ramones, The Who guitarist Pete Townshend and Joan Jett. The statement went on to say Burke had left an \"indelible mark on every project he was part of\". It added: \"We extend our deepest condolences to Clem's family, friends, and fans around the world. His legacy will live on through the tremendous amount of music he created and the countless lives he touched.\" Burke, who performed on classic tracks such as Call Me, Heart Of Glass and One Way Or Another, made his final live appearance with Blondie last year. Read more from Sky News:King arrives in Rome for Italy tour with Queen after health concernsGlobal bank chiefs hold talks over Trump tariffs crisis Among those paying tribute to him was Kinks guitarist Dave Davies, who said: \"I feel saddened that Clem Burke was taken from us so soon. \"May he rest in peace, spectacular drumming, we were friends.\" Nancy Sinatra said: \"My heart is shattered. Clem became an icon as a member of Blondie, but he was also an important part of my band, the K.A.B. I was blessed to call him my friend. \"If I ever needed him, he was there. Always. Sending healing prayers and comfort to his widow, Ellen, his family, and all who loved him.\""
    },
    {
        "title": "Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down",
        "description": "Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down.",
        "url": "https://news.sky.com/story/trump-says-no-pause-on-tariffs-after-rollercoaster-day-on-wall-street-ends-with-most-us-markets-down-13344156",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-s-and-p-share-stock-market_6879445.jpg?20250407232520",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-07 21:14:00",
        "Headline": "The US president also threatened to impose a further 50% duty on China as economists fear his sweeping tariffs could plunge the world into a global recession.",
        "Content": " Donald Trump has ruled out pausing the sweeping tariffs he has imposed on countries across the world after a rollercoaster day on Wall Street that ended with most of the US markets down. Intense swings were seen on the three main stock market indexes on Monday as economists fear the US president's \"Liberation Day\" levies could cause a global recession. The S&P 500 closed the day 0.23% lower, while the Dow Jones Industrial Average finished down 0.91%, and the Nasdaq ended in positive territory, up 0.10%. Trump tariffs: Follow latest updates All three indexes started the day sharply lower, and the Dow plunged as many as 1,700 points following even worse losses elsewhere in the world. But it suddenly surged to a gain of nearly 900 points in the late morning. The S&P 500, meanwhile, went from a loss of 4.7% to a leap of 3.4%, which would have been its biggest jump in years. The sudden rise appears to have been the result of a social media post that incorrectly claimed that Kevin Hassett, White House National Economic Council director, said Mr Trump was considering a 90-day pause in tariffs for all countries except China. Reports first emerged through the US business news channel CNBC. The White House later told CNBC any talk of a 90-day pause was \"fake news\". Financial pain hammers investments around the world The financial pain once again hammered investments around the world, with stocks in Hong Kong plunging 13.2% for their worst day since 1997. Meanwhile, the UK's benchmark stock index, the FTSE 100, closed 4.38% down. It is one of the biggest drops in years, in line with the falls seen in the early days of COVID-19 lockdowns, but less steep than the 4.95% loss seen on Friday. Only a handful of the 100 most valuable companies listed on the London Stock Exchange saw any boost to their share price all day. Read more: Major economic shock happening because of TrumpIs this the start of an 'economic nuclear winter?'Global bank chiefs hold talks over tariffs crisis 👉 Follow Trump 100 on your podcast app 👈 Trump 'not looking' at pausing tariffs When asked in the Oval Office on Monday evening whether he would pause tariffs, Mr Trump said: \"We're not looking at that.\" The president added that affected countries have been negotiating with his administration, which he said will try and make \"fair deals\" with each of them. \"We're going to get fair deals with every country and if we don't they are not going to be able to participate with the US,\" he added. Mr Trump also claimed the US \"has been ripped off by many countries over the years\", adding: \"We can't do it anymore. We can't be the stupid people anymore.\" Analysis: Tariffs could herald one of the most painful episodes in modern times Trump threatens additional 50% tariff on China It came after the US president threatened in a post on his Truth Social platform that he would impose an additional 50% tariff on China if the nation does not withdraw its 34% retaliatory tariff. Beijing imposed the duty after Mr Trump announced his tariff on China last week. The US president added in his Truth Social post that Beijing has until Tuesday to remove its retaliatory tariff. Some investors are holding onto hope that Mr Trump may still lower his tariffs after negotiating with countries, and Mr Trump said on Sunday that he has heard from leaders \"dying to make a deal\".  'Sometimes you have to take medicine to fix something' A drop in tariffs relatively soon could help avoid a recession, but whether that can happen is still uncertain. On Sunday, Mr Trump told reporters aboard Air Force One that he does not want markets to fall. But he also said he was not concerned about a sell-off, saying \"sometimes you have to take medicine to fix something\". Mr Trump has given several reasons for his stiff tariffs, including to bring manufacturing jobs back to the United States, which is a process that could take years. The US president has said he wanted to bring down the numbers for how much more the United States imports from other countries versus how much it sends to them. \"The recent tariffs will likely increase inflation and are causing many to consider a greater probability of a recession,\" JP Morgan chief executive Jamie Dimon wrote in his annual letter to shareholders on Monday. \"Whether or not the menu of tariffs causes a recession remains in question, but it will slow down growth\", added Mr Dimon, who is one of the most influential executives on Wall Street."
    },
    {
        "title": "Insurer Hiscox lines up chairman months after Bayesian sinking",
        "description": "Hiscox, the London-listed insurer, is close to naming a new chairman nearly eight months after the drowning of Jonathan Bloomer on the luxury yacht of technology tycoon Mike Lynch.",
        "url": "https://news.sky.com/story/insurer-hiscox-lines-up-chairman-months-after-bayesian-sinking-13344008",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hiscox-logo_6879140.jpg?20250407174917",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-07 16:44:00",
        "Headline": "Richard Berliand, the chairman of interdealer broker TP ICAP, is among a small number of contenders to succeed Jonathan Bloomer following his death last summer, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Hiscox, the London-listed insurer, is close to naming a new chairman nearly eight months after the drowning of Jonathan Bloomer on the luxury yacht of technology tycoon Mike Lynch. Sky News has learnt that Hiscox has narrowed its search to candidates including Richard Berliand, who chairs the interdealer broker TP ICAP. Insurance insiders said that Mr Berliand was among fewer than a handful of potential successors to Mr Bloomer. The sinking of the Bayesian off the Sicilian coast last August claimed the lives of Mr Lynch and his daughter, along with five other passengers, including Mr Bloomer. A former boss of Prudential, Mr Bloomer was a well-liked figure in the City. He had chaired Hiscox for just a year when he died. The identities of the other candidates being considered by the company were unclear on Monday. \n                  Baby girl becomes first child in UK to be born from womb transplant\n                 \n                  Prince Harry's security case back in court - all you need to know\n                 \n                  Plastic surgeon Peter Brooks found guilty of attempting to murder former boss\n                 Read more business newsGlobal bank chiefs hold talks over tariffs crisisAsian stock markets tumbleEco-tycoon Vince weighs sale of solar energy project Hiscox, which has a market capitalisation of just over £3.8bn, has seen its shares slip by about 12pc over the last year. It was founded as a single underwriter at Lloyd's in 1901. A Hiscox spokesperson declined to comment."
    },
    {
        "title": "Trump's tariffs could herald one of the most painful episodes in modern times - here's why | Ed Conway",
        "description": "Of course this is dramatic. Of course markets are slumping.",
        "url": "https://news.sky.com/story/why-the-device-youre-reading-this-on-shows-us-how-trumps-tariffs-could-herald-one-of-the-most-painful-episodes-in-modern-times-13343764",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-christopher-lagana_6876331.jpg?20250404225630",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-04-07 09:13:00",
        "Headline": "Unpicking globalisation will be phenomenally difficult and phenomenally expensive. Trying to relocate factories and labour markets with expertise that has built up over decades would be incredibly hard and take a long time - but that appears to be Trump's aim.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Of course this is dramatic. Of course markets are slumping. Because if you take Donald Trump at his word (something investors are now finally beginning to do), he is attempting single-handedly to reverse and uproot decades worth of economic history in the space of a few months. Because if this really is \"the end of globalisation\", as a few politicians, including Keir Starmer, are now calling it, it constitutes one of the most wrenching, painful episodes in modern times. Money: Petrol prices could tumble within 10 days To see what I mean, the best place to begin is by pondering the hidden life of the device you're reading this on. I'm assuming it's a smartphone, specifically the latest iPhone, but most of the following applies for other smartphones and, indeed, many laptops or desktop computers. The display was made in South Korea or Japan. The camera module was made by Sony in Japan (who have a particular expertise in this type of specialised silicon that few other companies have been able to match). The batteries (for the latest iPhone at least) are made in India, though these days, the vast majority of the world's cells are made in China. On it goes - the memory chips from South Korea, which has a near monopoly on solid state storage silicon. The logic chips - the ones that help the device \"think\"- made in Taiwan, albeit with intellectual property (IP) from all over the world, including America and even Britain. Some of the chips do indeed come from the US - in particular the modem, though the company behind them (Qualcomm) sometimes manufactures in Taiwan. But there are some from Europe too - most notably the spatial sensor chips that come from Bosch in Germany. \n                  Market turmoil: Are we heading for a global recession?\n                 \n                  Stock markets slump for second day running after Trump announces tariffs - in worst day for indexes since COVID\n                 \n                  Global markets have given Trump a clear no-confidence vote - and his fickleness is making the problem worse  \n                 Globalisation is in your hands If you are looking for an example of \"globalisation\", you couldn't do much better than the smartphone. But even this potted geography lesson understates it because those fabrication plants in Taiwan and South Korea, turning out those silicon chips that help the phone think and remember stuff, are totally dependent on machines made by a company called ASML, based in the Netherlands. Those Dutch machines, in turn, contain components from hundreds of other companies around the world, including in Germany and the US. On it goes. Nor is this degree of interconnectedness solely to be found in high-tech equipment. The other day, I was up in Scunthorpe at the blast furnaces of British Steel. It turns out the iron they smelt there doesn't just go into the rails that striate this country. They also make the steel that go into the tracks of Caterpillar trucks. Trump tariffs latest: UK stock market suffersPolitics latest: Trump tariffs 'bad news' for global economy, cabinet minister That's right: the iconic tracked diggers - for many people the most American of all things - are all mounted on steel \"track shoes\" made in the North East of England (the plant is a little further north of Scunthorpe, in Skinningrove). The further you look around the world of manufactured products, the more you realise that nearly everything you touch on a daily basis has, in the months before it arrived in your life, been on a long trip from factory to factory, taking it all around the world. That device you're reading this on may say \"made in China\" on the back, but that's an enormous over-simplification. It was made more or less everywhere. This is the way the world works today - like it or not. In a sense it's the ultimate extension of what Adam Smith discussed back in the earliest days of economics, when he described a \"pin factory\" where the work of making a simple pin was divided up between different people, with each worker specialising in a particular task rather than trying to make the whole pin themselves. The swings and roundabouts of globalisation Today, we have a sort of international division of labour. Today, nearly everyone goes to China to get their batteries. They go to South Korea to get their memory chips. The upshot is these factories have become ever more efficient at making their products. And - here's where it matters for the rest of us - the price of making and buying this stuff goes down. Today, the reason one can buy what would once have been classified as a supercomputer for a few hundred pounds is because of this division of labour. Globalisation made everything, from computers to Caterpillar trucks to T-Shirts, that bit cheaper than they would have been had we attempted to manufacture them all in a single country. But the ugly side of this economic shift is that those regions that used to do the manufacturing - be it the \"rust belt\" of America or the Midlands and North East of England - have seen much of their traditional work disappear. And while economists have insisted that cheaper products make everyone better off in net terms, the reality is that these parts of our countries haven't got better off. They have been hollowed out. And in time, resentment about globalisation has built up - for good reason. Trump's aspiration This is the world we inhabit today. Unpicking it will be phenomenally difficult and phenomenally expensive. Trying to relocate all those functions - factories and labour markets with expertise that has built up over decades - would be incredibly difficult and would take a long time. But that seems, as far as anyone can tell, to be the aspiration of Donald Trump. That appears to be the objective of his tariff policy. Up until now, most investors had assumed that the president wasn't entirely serious about this - that he merely intended to scare a few Asian companies into opening factories in key swing states. And who knows - that may well turn out to be the case. But he certainly seems more serious this time around - and less fazed by the negative market reaction. In the meantime, we are left with those tariffs. Costs will go up  Think back to that iPhone. Think back to those Caterpillar tracks. All those components now face swinging tariffs when they arrive in the US. That will push up the cost of buying pretty much anything in the US and will accordingly push down the demand for those goods. And since America is the world's consumer of last resort - the biggest importer of goods anywhere - that has an enormous bearing on demand around the world. So, yes, of course, this is dramatic. Of course, markets are slumping. No one knows what the US president will do next. But either way, what happened last week in the Rose Garden will reverberate for a long time to come."
    },
    {
        "title": "A major economic shock is happening thanks to Trump - and the UK can do little to stop it",
        "description": "A major global economic shock is taking place; its duration unknown, its severity anyone's guess, and no one has a surefire way of stopping it because it's all based on the proclivities of one man who is supposed to be our ally.",
        "url": "https://news.sky.com/story/a-major-economic-shock-is-happening-thanks-to-trump-and-the-uk-can-do-little-to-stop-it-13344098",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-maryland_6878467.jpg?20250407072148",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-04-07 19:05:00",
        "Headline": "With high borrowing and tax at record levels, the government lacks the levers available in the 2008 financial crash and COVID.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n A major global economic shock is taking place; its duration unknown, its severity anyone's guess, and no one has a surefire way of stopping it because it's all based on the proclivities of one man who is supposed to be our ally. Billions have been wiped off the stock market since Donald Trump announced his global tariff scheme last week, meaning a hit to prices, pensions and jobs that could get a lot worse. So what can the government do, in practice? After the economic shocks of modern times - the 2008 financial crisis and 2020 pandemic - hundreds of billions of pounds were served up by the UK government to cushion the impact. Debates rage to this day about whether banks should have been bailed out by Gordon Brown and whether Rishi Sunak's COVID furlough scheme should have been so generous. On both occasions, the Bank of England rose to the challenge too, using its quantitative easing scheme to ensure cheap money. But as we stand on the precipice of economic decline of uncertain severity, it is clear that any kind of big bazooka option of the scale seen during those two crises is not open to the UK this time around. Borrowing is so high, and taxes at record levels, that there is not the headroom to do this now. The government's options are severely limited. \n                  Starmer promises 'bold changes' to rules over electric cars in wake of Trump's tariffs\n                 \n                  Starmer can see no quick Trump deal\n                 \n                  MP deported from Israel accuses it of 'control and censorship'\n                 That, in practice, is the starting point for Prime Minister Sir Keir Starmer and Chancellor Rachel Reeves. The big concession today is that tariffs may be in place for some time - the hope of two weeks ago for a quick deal that dampens or exempts tariffs appears to be fading. The White House says 50 nations are queuing up to do a deal - there is no guarantee we are close to the front of the queue. So instead, they have to look for other answers that cost little - cutting red tape and helping business grow. And here, there are no straightforward answers. Read more:Trump's tariffs - a negotiating tactic or start of an 'economic nuclear winter'?Social media post sparks US markets upturn - before White House sends them back into red  The big announcement on Monday is to water down green rules for cars, delaying a ban on hybrids to 2035 from 2030 and giving the car sector more flexibility to meet its electric car goals on the path to the end of the decade. But, although the government did not want to talk about it, these involve trade-offs which is why they have not happened to date. When it comes to deregulation, there is no such thing as an easy win. The policy watered down on Monday was on course to be, by a very large margin, the single biggest lever for the UK to achieve its climate goals for the 2030s, so this will blow an even bigger hole in the ability to get on track for net zero. Meanwhile, this change of policy means uncertainty for different firms - those that make batteries and charging points are no longer in such urgent demand after Monday's decisions. Yet Rachel Reeves makes clear this approach is the one she will follow. Pharmaceuticals and steel will also get help in coming days. But whatever the announcement, remember there's a cost - just not one the government will spell out when it tries to get back on the front foot."
    },
    {
        "title": "Social media posts spark US markets upturn - before White House clarification sends them back into the red",
        "description": "A rumour on social media fuelled a brief upturn for struggling US stock markets &#8211; but they swiftly swung back down again after the claim was debunked by the White House.",
        "url": "https://news.sky.com/story/social-media-posts-spark-us-markets-upturn-before-white-house-clarification-sends-them-back-into-the-red-13344032",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-stock-exchange-new-york_6879214.jpg?20250407190609",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-07 17:29:00",
        "Headline": "On Monday, the US markets opened with a fall for the third day in a row, before a brief lift which has been attributed to social media posts labelled 'fake news' by the White House.",
        "Content": "A rumour on social media fuelled a brief upturn for struggling US stock markets – but they swiftly swung back down again after the claim was debunked by the White House. Markets around the world have struggled since some of Donald Trump's new import tariffs came into effect over the weekend. Tariffs latest: Starmer sets out response to US levies The US markets opened on Monday with a fall for the third day in a row but briefly rallied and showed growth of over 2% at 3.15pm UK time. The upturn came after a social media rumour claimed a top Trump administration adviser had suggested the president could be considering a 90-day pause on tariffs. The origin of the false report was unclear but it appeared to be a misinterpretation of a comment made by a White House employee during a Fox News interview. Asked if the US president would consider a pause, Kevin Hassett, White House National Economic Council director, said: \"I think the president is going to decide what the president is going to decide. \n                  Trump's tariffs news conference with Netanyahu was typically noncommittal, vague and contradictory\n                 \n                  US Supreme Court delays deadline to return man mistakenly deported to El Salvador\n                 \n                  US having direct talks with Iran over its nuclear programme\n                 \"There are more than 50 countries in negotiation with the president.\" Nearly two hours later, multiple X accounts posted identical messages claiming Mr Hassett said a pause - for all countries except China - was being considered. The identical posts were picked up by some news outlets and stock traders, sending the markets skyrocketing. However, when the White House said any talk of a pause was \"fake news\", they were sent back into the red. US correspondent It was the stock market as a spectator sport. The moment, mid-morning, when a Trump aide had given a TV interview and subsequent headlines screamed that Trump was considering a 90-day pause on tariffs.   Suddenly, the markets went from red to green.   Make that green to red, just minutes later, when the White House dismissed the story as fake news, insisting there would be no pause.  Investors duly reverted back to panic mode.  It was market volatility writ large.  The stance inside the White House can be best characterised as 'panic, what panic?'.  Donald Trump on Monday joked his way through a photo call with the Los Angeles Dodgers, winners of baseball's World Series, ahead of his meeting with Israeli Prime Minister Benjamin Netanyahu. For those two men, there is much on the agenda, of course - not least the collapse of the ceasefire in Gaza. On that, this will be an important stage in a grinding diplomacy that has ground to a halt around a ceasefire.  On tariffs, with Netanyahu, there will be a first look at how negotiations work with the punitive president.  Israel faces a 17% tariff from its largest trade partner and ally.  How to strategise a route towards the sweet spot? With Trump's first visitor since the tariff announcement comes a first test of how negotiations work and what they produce. The world will be watching agog – as all the world has a stake. Mr Trump has remained defiant despite fears that his levies could be pushing the US towards a recession. 👉 Follow Trump 100 on your podcast app 👈 The US president has insisted the taxes are necessary for rebuilding domestic manufacturing and resetting trade relationships with other countries. \"Be Strong, Courageous, and Patient, and GREATNESS will be the result!\" he wrote on Truth Social on Monday. More from Sky News:Trump and Netanyahu cancel news conferenceAsian stock markets tumble after tariffs   Mr Trump - who played golf in Florida over the weekend - has also threatened an extra tariff on China, after Beijing announced a retaliatory levy on the US. He said if Beijing does not withdraw its retaliatory tax, the US will impose an additional 50% levy on China and \"negotiations with other countries, which have also requested meetings, will begin taking place immediately\"."
    },
    {
        "title": "Global bank chiefs hold talks over Trump tariffs crisis",
        "description": "The chief executives of some of the world's biggest banks have held private talks about the carnage in financial markets and the global economy precipitated by President Donald Trump's tariffs blitz.",
        "url": "https://news.sky.com/story/global-bank-chiefs-hold-talks-over-trump-tariffs-crisis-13343860",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hsbc-bank-barclays_6878916.jpg?20250407145609",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-07 12:33:00",
        "Headline": "Executives from Bank of America, Barclays and Citi were among the participants in a weekend call to discuss the unfolding chaos over President Trump's tariffs blitz, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executives of some of the world's biggest banks have held private talks about the carnage in financial markets and the global economy precipitated by President Donald Trump's tariffs blitz. Sky News has learnt that bosses from lenders including Bank of America, Barclays, Citi and HSBC Holdings held a call on Sunday to discuss the ongoing chaos as plunging equity markets reflect fears of a worldwide recession. Sources said that Sunday's call was convened by the Bank Policy Institute, a Washington-based public policy group. Brian Moynihan of BoA, Barclays' CS Venkatakrishnan and Georges Elhedery of HSBC were among those who took part in the call, according to one overseas bank executive. JP Morgan, whose chairman and CEO Jamie Dimon warned of the inflationary and recessionary implications of a trade war in his annual shareholder letter on Monday, is also said to have taken part in the call. One source said the call was aimed at enabling US bank executives to outline their views of the unfolding tariffs chaos to their international peers. \"I am hoping that after negotiations, the long-term effect will have some positive benefits for the United States,\" Mr Dimon wrote in his letter released on Monday. \"My most serious concern is how this will affect America's long-term economic alliances.\" Shares in leading banks have been hard hit by the stock market chaos around the world, with Rachel Reeves, the chancellor, understood to be in regular contact with UK bank chiefs as well as the Bank of England. On Monday, Andrew Bailey, the BoE governor, was nominated as the next chair of the Financial Stability Board, a key international body. None of the banks contacted by Sky News would comment on Monday."
    },
    {
        "title": "Market turmoil: Are we heading for a global recession?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>\n ",
        "url": "https://news.sky.com/story/market-turmoil-are-we-heading-for-a-global-recession-13343836",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-daily-070425-markets_6878861.png?20250407135448",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:45:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈\n Today has seen chaos on global stock markets, with price plunges reminiscent of the famous Black Monday crash of 1987. Back then, the causes were unclear, whereas today there's no doubt - Donald Trump's \"liberation day\" tariffs have spooked the markets. In 1987, people feared Black Monday was a sign of a global recession. They were wrong. Are we right to have the same fears today? Tom Cheshire is joined by Sky's Darren McCaffrey and stockbroker Russ Mould to discuss what might come next."
    },
    {
        "title": "Trump's tariffs: A negotiating tactic or the start of an 'economic nuclear winter'?",
        "description": "Traders called this morning a complete bloodbath as the UK's FTSE 100 joined world indexes in turning red as uncertainty over Donald Trump's tariffs continued to batter stock markets.",
        "url": "https://news.sky.com/story/trumps-tariffs-a-negotiating-tactic-or-the-start-of-an-economic-nuclear-winter-13343781",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6879222.jpg?20250407191347",
        "type": "Business",
        "Author": "Darren McCaffrey, business presenter",
        "Date Published": "2025-04-07 09:47:00",
        "Headline": "Bill Ackman - a billionaire Trump backer who is against the tariffs - has warned of an \"economic nuclear winter\" if the president does not change course. ",
        "Content": "By Darren McCaffrey, business presenter  Traders called this morning a complete bloodbath as the UK's FTSE 100 joined world indexes in turning red as uncertainty over Donald Trump's tariffs continued to batter stock markets. Across Asia and Europe, hundreds of billions have been wiped off companies' values, particularly in banking and manufacturing. The cause is not just the imposition of those tariffs (the largest the US has inflicted since the 1930s) and the very obvious drag this will have on global trade and growth, but also the uncertainty of 'what next?'.  Trump tariffs latest: Musk shares video about 'essential' free market Investors cannot work out if the Trump administration is genuinely wedded to tariffs on this scale, on the proviso that they will help re-shore companies and millions of jobs to the United States. They don't know if they are permanent or merely part of a negotiating tactic to address trade imbalances, and for America to use its economic heft to strike better deals. If Mr Trump is open to deals (the first test comes later in a meeting with the Israeli prime minister), markets will calm, even if the midst of uncertainty hasn't fully cleared.  However, if this is a genuine rewiring of global trade and the end of globalisation as we know it, markets and economies will continue to get battered. Read more:Trump's 'Liberation Day' explainedWhat Sky correspondents make of tariff announcement As one Trump supporter, billionaire Bill Ackman - who opposes the tariffs - put it, President Trump has launched a \"global economic war against the whole world\" that will usher in an \"economic nuclear winter.\" It's time for all of us to buckle up."
    },
    {
        "title": "Asian stock markets tumble - with Hong Kong's Hang Seng index suffering worst fall for 28 years",
        "description": "Asian stock markets have fallen dramatically amid escalating fears of a global trade war - as Donald Trump called his tariffs \"medicine\" and showed no sign of backing down.",
        "url": "https://news.sky.com/story/international-stock-markets-tumble-as-trump-calls-tariffs-medicine-13343658",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hong-kong-stock-markets_6878760.jpg?20250407123753",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-07 00:40:00",
        "Headline": "Mr Trump's bombshell tariff announcement causes more turmoil as investor fear grows over a global trade war and a possible recession in the US.",
        "Content": " Asian stock markets have fallen dramatically amid escalating fears of a global trade war - as Donald Trump called his tariffs \"medicine\" and showed no sign of backing down. Hong Kong's Hang Seng index of shares closed down 13.2% - its biggest drop since 1997, while the Shanghai composite index lost 7.3% - the worst fall there since 2020. Taiwan's stock market was also hammered, losing nearly 10% on Monday, its biggest one-day drop on record. Elsewhere, Japan's Nikkei 225 lost 7.8%, while London's FTSE 100 was down 4.5% at lunchtime. Tariffs latest - FTSE falls after Asian markets tumble America's S&P500 opened Monday 3.7% down, the tech-dominated NASDAQ lost 3.9%, while the Dow Jones shed more than 3% at the bell. Markets are reacting to ongoing uncertainty over the impact of President Trump's tariffs on goods imported to the US, which he announced last week. Speaking on Air Force One on Sunday, Mr Trump said foreign governments would have to pay \"a lot of money\" to lift his tariffs. \"I don't want anything to go down. But sometimes you have to take medicine to fix something,\" he said. The US president said world leaders were trying to convince him to lower further tariffs, which are due to take effect this week. \"I spoke to a lot of leaders, European, Asian, from all over the world,\" Mr Trump told reporters. \"They're dying to make a deal. And I said, we're not going to have deficits with your country. \"We're not going to do that because to me, a deficit is a loss. We're going to have surpluses or, at worst, going to be breaking even.\" Mr Trump, who spent much of the weekend playing golf in Florida, posted on his Truth Social platform: \"WE WILL WIN. HANG TOUGH, it won't be easy.\" President Trump believes his policy will make the US richer, forcing companies to relocate more manufacturing to America and creating jobs. However, his announcement has shocked stock markets, triggered retaliatory levies from China and sparked fears of a global trade war. Asia correspondent China's announcement of its tariff retaliation came late afternoon on Friday local time. Most Asian markets closed shortly after - and markets in China, Hong Kong and Taiwan were closed for a public holiday - meaning the scale of the hit did not play out until today. This morning we are getting a sense of the impact. Dramatic falls across all Asian markets clearly signal a realisation a global trade war is no longer just a threat, but a reality here to stay, and a global recession could yet follow. Up until Friday, China's response to Donald Trump's tariffs had been perceived as restrained and designed to avoid escalation, the markets had reacted accordingly. But that all changed last week when Mr Trump's new 34% levy on all Chinese goods was matched by China with an identical tax. Both sit on top of previous tariffs levied, meaning many goods now face rates in excess of 50%. These are numbers that make most trade between the world's two biggest economies almost impossible and that will have a global impact. China has clearly decided any forthcoming pain will have to be managed, and not being seen to be cowed and bullied by Mr Trump is being deemed more important. But the scale of the retaliation will have further spooked the markets as it makes the prospect of negotiation and retreat increasingly unlikely. Mr Trump added to the atmosphere of intransigence when he told the media on Sunday the trade deficit with China would need to be addressed before any deal could be done. The complete lack of concern from the White House over the weekend will also not have helped. While smaller economies like Japan, South Korea, Cambodia and Vietnam are all lining up to attempt to negotiate, there are a lot of nations in that queue. There is a sense none of this will be easily rectified. US customs agents began collecting Mr Trump's baseline 10% tariff on Saturday. Higher \"reciprocal\" tariffs of between 11% and 50% - depending on the country - are due to kick in on Wednesday. Investors and world leaders are unsure whether the US tariffs are here to stay or a negotiating tactic to win concessions from other countries. Richard Flax, chief investment officer at wealth manager Moneyfarm, said: \"I guess there was some hope over the weekend that maybe we would see this as part of the start of a negotiation. \"But the messages that we've so far seen suggest that the President Trump is comfortable with the market reaction and that he's going to continue on this course. Goldman Sachs has raised the odds of a US recession to 45%, joining other investment banks that have also revised their forecasts. 👉 Follow Trump 100 on your podcast app 👈 In the UK, Sir Keir Starmer has promised \"bold changes\" and said he would relax rules around electric vehicles as British carmakers deal with a new 25% US tariff on vehicles. The prime minister said \"global trade is being transformed\" by President Trump's actions. Read more:Global markets give Trump clear no-confidence voteJaguar Land Rover decision sparks anxiety KPMG has warned tariffs on UK exports could see GDP growth fall to 0.8% in 2025 and 2026. The accountancy firm said higher tariffs on specific categories, such as cars, aluminium and steel, would more than offset the exemption on pharmaceutical exports, leaving the effective tariff rate around 12%. Yael Selfin, chief economist at KPMG UK, said: \"Given the economic impact that tariffs would cause, there is a strong incentive to seek a negotiated settlement that diminishes the need for tariffs. \"The UK automotive manufacturing sector is particularly exposed given the complex supply chains of some producers.\""
    },
    {
        "title": "Starmer can see no quick Trump deal",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/starmer-can-see-no-quick-trump-deal-13343695",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-07 06:09:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy look ahead to the day in British politics. It's the day Sir Keir Starmer is due to deliver a speech which answers whether globalisation as we know it is over, as financial markets plummet for a third day in a row following the announcement of Donald Trump's trade tariffs. Sam and Anne discuss what to expect from the speech following the prime minister's weekend at Chequers with other world leaders, discussing how to avoid an all-out trade war and the first projections of the impact of tariffs on the UK. They also discuss the prime minister's decision to water down green policy on UK cars and ask if the decision is a 'quick-fix' which could scupper the UK's net-zero plans."
    },
    {
        "title": "MP deported from Israel accuses it of 'control and censorship'",
        "description": "An MP denied entry and deported from Israel has accused the state of \"control and censorship\".",
        "url": "https://news.sky.com/story/mp-deported-from-israel-accuses-it-of-control-and-censorship-13343977",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-abtisam-mohamed-yuan-yang_6879185.png?20250407182735",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-07 15:51:00",
        "Headline": "\"No state, however powerful, should be beyond criticism,\" says Abtisam Mohamed, who was visiting the West Bank along with fellow Labour MP Yuan Yang to learn about the work of humanitarian aid projects. ",
        "Content": "\n          Political reporter\n              @alixculbertson\n  An MP denied entry and deported from Israel has accused the state of \"control and censorship\". Labour MP Abtisam Mohamed told the House of Commons: \"This act was not just a diplomatic affront, this wasn't about security. \"It was about control and censorship and the exposure of Israel. No state, however powerful, should be beyond criticism.\" Ms Mohamed and fellow Labour MP Yuan Yang were denied entry to Israel when they arrived there on Saturday as part of a parliamentary delegation to visit humanitarian aid projects in the West Bank, they said. The two women were then deported, sparking a political row in which the Israelis have accused them of being there to \"provoke anti-Israel activities\" following comments they have made in parliament. Ms Mohamed said it had been \"a challenging few days\" and that the two MPs are not the only ones who have been \"speaking about the atrocities\" and calling for change. She said many Israelis and Israeli charities were also doing so. Ms Yang, a former journalist, told the Commons she \"understands deeply the significance of bearing witness\" and understood the risks, \"but I did not, however, anticipate the risks of detention and deportation from a British ally\". \n                  Starmer promises 'bold changes' to rules over electric cars in wake of Trump's tariffs\n                 \n                  Starmer can see no quick Trump deal\n                 \n                  Furious row after Labour MPs denied entry to Israel - as Lammy criticises 'disgraceful' Badenoch response\n                 She said their deportation proves what MPs say in the Commons \"matters\", and she asked the Middle East minister what the government can do to ensure future delegations of MPs \"can do so without having to censor their remarks\". Ms Yang revealed another delegation of MPs was set to visit the West Bank this weekend. Middle East minister Hamish Falconer said he would encourage MPs to continue to speak out on Israel and Gaza and advised MPs going to Israel to talk to the Foreign Office in advance. Government needs to make it clear this is 'unacceptable' Earlier, the head of the group who organised the MPs' trip told Sky News the government needed to make it \"very clear\" to the Israelis it was \"unacceptable\" to have denied them entry. Chris Doyle, director of Caabu, said he wanted the government to tell the Israelis the deportations \"should be revoked\". On Sunday, Foreign Secretary David Lammy said he had spoken to his Israeli counterparts and made it clear \"this is no way to treat British parliamentarians\". \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities,\" he added. Read more:Who are the two MPs deported from Israel?'Atrocious' killing of aid workers by Israel must be independently investigated Former journalist Ms Yang has only spoken once in the Commons about Israel-Gaza since she became an MP last year. She called on the government to ensure journalists can work safely in Gaza and then posted on X about many of her former Financial Times colleagues being denied entry to Gaza by Israel, as have all international reporters. Ms Mohamed is Yemeni-Muslim and has been outspoken against Israel in her role on the Foreign Affairs Committee, speaking in the Commons five times on the topic since becoming an MP last July. The MP has described Israel's actions in Gaza as \"war crimes\", something Israel has rejected. She also spearheaded a cross-party call from 61 MPs for a UK ban on Israeli goods.  It is 'right' MPs visit West Bank Mr Doyle has been Caabu's director for 23 years and said Ms Yang and Ms Mohamed were visiting as part of a \"long-running programme\" that has seen the organisation take MPs and peers from all parties to the occupied West Bank, and previously to Gaza, to \"assess the situation on the ground\". Caabu has taken 161 politicians there since 1997, including party leaders and MPs now in the cabinet, Mr Doyle said. He said the two MPs and their two aides had been set to meet Oxfam and UN representatives, which he said is the \"right and proper thing\" because the UK is a major donor to projects there, giving hundreds of millions of pounds over the years.  Israel: MPs promoted sanctions Israel's UK embassy said the MPs were denied entry because they had \"accused Israel of false claims, were actively involved in promoting sanctions against Israeli ministers, and supported campaigns aimed at boycotting the state of Israel\". Conservative leader Kemi Badenoch has caused consternation among many MPs after saying Israel \"has a right to police its borders\" and that the government's travel advice states if you have called for a boycott of Israel or Israeli settlements, or publicly criticised Israel, you can be refused entry."
    },
    {
        "title": "March hottest on record in Europe and by some margin",
        "description": "Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin.",
        "url": "https://news.sky.com/story/march-hottest-on-record-in-europe-and-by-some-margin-13344125",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-weather-europe_6879451.jpg?20250408004718",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-07 19:54:00",
        "Headline": "March was not just warmer than average, it was a lot warmer, the EU's Copernicus Climate Change Service has found.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Last month was the hottest March on record in Europe, new data has found - surpassing the average by some margin. And that raises the risk, for now, of wildfires this summer, campaigners have warned. The average air temperature across the continent was a significant 2.41C above the recent average for March (1991-2020), according to new figures from the EU's Copernicus Climate Change Service. That figure may not sound like much, but as it is an average figure, it smooths out the extremes, meaning it will have been much higher in some places. Eastern Europe and southwest Russia in particular saw the mercury soar. A heat map released alongside the data paints most of Europe in dark orange and red to signify just how high the heat was above average. Last week the UK's Met Office found England had its sunniest March on records going back to 1920. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Britons urged to stop mowing lawns to boost butterfly numbers 'in long-term decline'\n                 \n                  UK greenhouse gases fall again - as renewable electricity hits 50% for the first time\n                 The total of 185.8 hours of sunshine smashed the previous record from 1929 by more than 14 hours. The outstanding hot and dry conditions fuelled multiple wildfires by drying out plants and trees. And this week temperatures of above 20C (68F) are set to return, following the hottest day of the year so far on Friday. But when it comes to rainfall, March was a month of two extremes in Europe, Copernicus found. It was drier than average in the UK and Ireland, and in a big area from central Europe to Greece and Turkey - shown in dark brown on a second map that illustrates wet versus dry conditions. Not so over Spain and Portugal, where a series of storms brought widespread floods, forcing some from their homes but refilling reservoirs parched in last year's drought. While some parts of Europe had their driest March on record, elsewhere it was the wettest in at least the past 47 years. Samantha Burgess from the European Centre for Medium-Range Weather Forecasts, which runs Copernicus, said the new data is \"highlighting once again how temperatures are continuing to break records\". United Nations scientists say it is \"unequivocal\" that humans are warming the planet, which drives up average temperatures as well as extreme heatwaves.  That's because activities like burning fossil fuels release greenhouse gases that trap heat around the Earth. Rebecca Newsom from Greenpeace warned hot and dry weather could fuel the conditions for intense wildfires this summer. \"As early spring weather starts to feel more and more like summer, Europe is potentially on track to face ever harsher heat waves and wildfires later in the year. \"The past month's contrasting rainfall extremes across the European region alone pose an immediate challenge to our food systems and to the economy as a whole. \"Europe's citizens must not be left alone to pay for the chaos that dirty energy companies are fuelling.\" She called for new taxes on oil majors to help communities cope with climate disasters."
    },
    {
        "title": "Wolf extinct for 10,000 years brought back to life, researchers claim - but is it true?",
        "description": "A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true?",
        "url": "https://news.sky.com/story/wolf-extinct-for-10000-years-brought-back-to-life-researchers-claim-but-is-it-true-13344117",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pup-wolf_6879422.jpg?20250407225328",
        "type": "Technology",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-04-07 19:30:00",
        "Headline": "Colossal Biosciences claims to have \"de-extincted\" dire wolves by creating three pups named Romulus, Remus and Khaleesi. But has genetic engineering really led to a rebirth of dire wolves, a species last seen more than 10,000 years ago?",
        "Content": "By Claire Gilbody Dickerson, news reporter  A group of scientists claims to have brought back to life a species of wolf that went extinct more than 10,000 years ago - but is it true? Here's all we know about the three pups created by Colossal Biosciences, a genetic engineering company which claims to have \"de-extincted\" the dire wolf. What does Colossal say? On Monday, Colossal posted a clip showing two of the pups, named Romulus and Remus (after the mythical founders of Rome who, as legend has it, were brought up by a wolf), howling. \"Sound on\", the enthusiastic post on X reads. \"You're hearing the first howl of a dire wolf in over 10,000 years. \"Meet Romulus and Remus-the world's first de-extinct animals, born on October 1, 2024.\" Another pup, named Khaleesi after the character in Game of Thrones, was born on 31 January this year. \n                  Israeli troops opened fire on ambulances because of 'perceived threat', preliminary IDF investigation says\n                 \n                  US having direct talks with Iran over its nuclear programme\n                 \n                  US President Donald Trump says the US are in direct talks with Iran\n                 Colossal are the same company that created woolly mice in their quest to revive the woolly mammoth, and their goal is to fix extinction by \"combining the science of genetics with the business of discovery\". In the X post, Colossal explained how the pups were \"brought back from extinction\" using genetic edits which came from a complete dire wolf genome which was \"meticulously reconstructed\" from ancient DNA found in fossils of a 13,000-year-old tooth from Ohio and a 72,000-year-old inner ear bone from Idaho. Grey wolves were chosen as the donor species for establishing cell lines as they are the closest living relative of dire wolves. The company edited grey wolf DNA in 20 places over 14 genes to bring about specific changes like a lighter coloured coat, hair length, patterning, as well as body size and musculature. Fertilised eggs were then implanted into surrogate dogs. So the pups look and maybe sound like dire wolves, but they are not a complete genetic match. The research has other limitations. The wolves won't learn to live in the wild. Beth Shapiro, the chief scientific officer of Colossal, said while she would \"love to know the natural behaviour of a dire wolf,\" the pups are \"essentially living the Ritz Carlton lifestyle of a wolf. \"They can't get a splinter without us knowing about it,\" the New York Times quoted her as saying. What do other scientists say?  Adam Boyko, a geneticist at Cornell University who was not involved in the project, told the New York Times: \"It's exciting that we can make functional versions of extinct species.\" Read more from Sky News: King arrives in Rome with Queen after health concernsGlobal bank chiefs hold talks over Trump tariffs crisis But he claimed the pups can't truly be dire wolves as they are not being brought up in dire-wolf packs where they would learn their behaviour. And while the dire-wolf genes being carried by the pups could shed some light on the biology of the extinct species, Dr Boyko suggested there are many other genes which may have contributed to making dire wolves distinct from other wolves. \"We don't know what that number is,\" he said. \"It could be 20, or it could be 2,000.\" The New Scientist also looked at Colossal's claim of having recreated dire wolves and weren't entirely convinced. In an article entitled \"No the dire wolf has not been brought back from extinction\" they noted Dr Shapiro's claim grey wolves and dire wolves share 99.5 per cent of their DNA, but \"since the grey wolf genome is around 2.4 billion base pairs long, that still leaves room for millions of base-pairs of differences\". Given that there were only 20 gene edits it's not close to having the genetic make up of the dire wolf. But as Colossal's Beth Shapiro told the magazine: \"if they look like this animal, then they are the animal.\""
    },
    {
        "title": "Baby girl becomes first child in UK to be born from womb transplant",
        "description": "A baby girl has become the first child in the UK to be born from a womb transplant.",
        "url": "https://news.sky.com/story/baby-girl-becomes-first-child-in-uk-to-be-born-from-womb-transplant-13343832",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-amy-isabel-davidson_6878835.jpg?20250407133231",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-07 11:46:00",
        "Headline": "It was the first time the procedure had taken place in the UK. The birth will give hope to thousands of women born without a womb.",
        "Content": " A baby girl has become the first child in the UK to be born from a womb transplant. Grace Davidson, who received the transplant in 2023, said the birth of her daughter Amy Isabel was the \"greatest gift we could ever have asked for\". The 36-year-old, from north London, received the donated womb from her older sister, Amy. It was the first time the procedure had taken place in the UK, and the birth will give hope to thousands of women born without a womb - like those with Mayer-Rokitansky-Kuster-Hauser (MRKH) syndrome - or whose womb fails to function. Amy Isabel was named after her aunt, and a surgeon who helped perfect the technique, and was born by planned caesarean section on 27 February at Queen Charlotte's and Chelsea Hospital in London. Mrs Davidson, an NHS dietitian, said she felt \"shock\" when she first held her daughter, adding: \"We have been given the greatest gift we could ever have asked for. \"It was just hard to believe she was real. I knew she was ours, but it's just hard to believe. \"It sort of feels like there's a completeness now where there maybe wasn't before.\" Her husband Angus, 37, said: \"The moment we saw her was incredible, and both of us just broke down in emotional tears - it's hard to describe, it was elation. \"It had been such a long wait. We'd been intending to have a family somehow since we were married, and we've kind of been on this journey for such a long time.\" Science and technology editor The birth of Amy Isabel is not just a first for the UK, but an important step towards womb transplantation becoming an established medical procedure. It was little more than a decade ago that the world's first baby was born following a womb transplant in Sweden. And not without eyebrows being raised by some in the world of medical ethics. Not all womb transplants, whether from a living relative or from a deceased donor, are successful. And not all result in successful or uncomplicated pregnancies. But the surgical team behind this UK success have achieved a one-for-one: a healthy baby born from the first womb transplant ever performed here. Amy Isabel joins an estimated 50 other babies and children worldwide now born via a womb transplant. And she won't be the last. Around 100 women in at least 10 countries have undergone the procedure – three transplants have taken place in the UK since Amy's mother became the first in 2023. A study of 33 womb transplants in the US found 74% of the transplants remained healthy after a year and 80% of those resulted in a successful birth.\n But a womb transplant is unlikely to ever become \"routine\". While the number of eligible women – those lacking a functioning uterus but having healthy ovaries – might number in the low thousands in a country the size of the UK, not all would meet the strict medical criteria needed to maximise the chance of a successful transplant and subsequent birth. And not all might choose it. A successful birth following a womb transplant involves three major operations. The first to receive the transplanted womb, a caesarean section to deliver the baby, then a hysterectomy to remove the womb once the recipient mother decides to have no more children. Given a womb transplant isn't \"life-saving\", ethics guidelines require the procedure to be temporary. The long-term risks of organ rejection, and the drugs needed to prevent it, are considered too great once the womb has served its miraculous function. Some medical ethicists still question the procedure as a whole, arguing it is unnecessarily risky for both the mother and baby, especially if babies are born seriously pre-term and at low birth weight. However, this latest success, and the increasing number of healthy babies born via the procedure worldwide may change that. Womb transplantation is on the way to becoming an acceptable, life-giving procedure for women who previously had no hope of carrying a baby of their own.\n Rare condition affects one in 5,000 women Mrs Davidson was born with Mayer-Rokitansky-Kuster-Hauser, a rare condition that affects around one in every 5,000 women. It means they have an underdeveloped or missing womb. However, the ovaries are intact and still function to produce eggs and female hormones, making conceiving via fertility treatment a possibility. How the procedure worked Before receiving the donated womb, Mrs Davidson and her husband underwent fertility treatment to create seven embryos, which were frozen for in vitro fertilisation (IVF) in central London. Mrs Davidson had surgery in February 2023 to receive the womb from her 42-year-old sister Amy Purdie, who is a mother to two girls aged 10 and six. Several months later, one of the stored embryos was transferred via IVF to Mrs Davidson. The baby weighed 4.5lbs and was delivered several weeks early to ensure a safe, hospital-based delivery. Ms Purdie called the birth of her niece \"worth every moment\". Read more:AI could help more women get pregnant via IVFFertility patients offered unnecessary treatments - report  'We've waited a very, very long time for this' Professor Richard Smith and Isabel Quiroga were the lead surgeons for the womb transplant and both were in the operating theatre when Amy was delivered, with her parents choosing her middle name in honour of Ms Quiroga. Prof Smith, clinical lead at the charity Womb Transplant UK and consultant gynaecological surgeon at Imperial College Healthcare NHS Trust, told Sky News that being in the operating theatre when Amy was delivered was \"really quite remarkable\". The medic said: \"We've waited a very, very long time for this, and there's been quite a lot of tears shed. Ironically the scariest bit of the day for me was when [Amy's] mum and dad asked me to hold their baby, which was incredible.\" Ms Quiroga, consultant surgeon at the Oxford Transplant Centre, part of Oxford University Hospitals, told Sky News it was \"quite a complex procedure\" and \"the pressure was immense when we did the transplant\". But she said it was \"totally amazing to see all that effort\" and it has \"been totally worth it\"."
    },
    {
        "title": "Texas: Second child with measles dies as US outbreak spreads",
        "description": "A second child in Texas with measles has died as the outbreak of the childhood disease reached nearly 500 cases in the state, officials have said.",
        "url": "https://news.sky.com/story/texas-second-child-with-measles-dies-as-us-outbreak-spreads-13343693",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-measles-texas_6878451.jpg?20250407065328",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-07 05:53:00",
        "Headline": "An unvaccinated schoolgirl dies from measles pulmonary failure, officials say, having caught the illness recently in an area where vaccination rates are below the safe level.",
        "Content": "A second child in Texas with measles has died as the outbreak of the childhood disease reached nearly 500 cases in the state, officials have said. The unvaccinated schoolgirl, who had no underlying health conditions, died on Thursday in hospital from measles pulmonary failure, the Texas Department of State Health Services said. She was being treated for complications from the illness, a spokesperson for University Medical Center Children's Hospital in Lubbock said in an email.   The girl was recently diagnosed with the viral disease, NBC, Sky's US partner said, quoting from the hospital's statement issued on Sunday. Two children have now died in Texas since an outbreak of measles in late January in Gaines County, where the vaccination rate is about 82%, below the 95% believed to ensure those who cannot be vaccinated are safe. An adult in New Mexico is also suspected of having died from measles, NBC said, calling the deaths the first from the disease in the US for 10 years. US President Donald Trump, speaking to reporters on Air Force One on Sunday, said that, if the outbreak continues, his administration will \"have to take action very strongly\". Measles is spread when an infected person breathes, coughs or sneezes. A rash usually appears a few days after the cold-like symptoms. The rash starts on the face and behind the ears before spreading to the rest of the body. A person is infectious from when they first have symptoms (around four days before the rash appears) until four days after they get the rash. There are things people can do to reduce the risk of spreading or catching measles.\n Do: Wash hands often with soap and warm water. Use tissues when coughing or sneezing. Throw used tissues in the bin. Don't: Do not share cutlery, cups, towels, clothes, or bedding.\n\n Information from NHS website US Health and Human Services Secretary Robert F Kennedy Jr, identified the child as eight-year-old Daisy Hildebrand and said he visited Texas on Sunday to comfort the child's family. Pictures were published of him at the girl's funeral in Seminole, northwest Texas. In a post on X, Mr Kennedy, a vaccine sceptic who says it should be a personal choice, said vaccines are nonetheless the best protection against the illness. He said the MMR (measles, mumps, rubella) vaccine is \"the most effective way to prevent the spread of measles\", confirming that, as of Sunday, there were 642 confirmed cases of measles in the US, 499 of those in Texas.  The Texas Department of State Health Services said, as of Friday, 481 cases of measles had been confirmed, a rise of 14% in a week. They include six infants and toddlers at a Lubbock day care centre that tested positive in the past two weeks. Read more on SkyMeasles 'wake-up call'Mum urges parents to vaccinate childen Two of those children are among 56 people who have been treated in hospital for measles in the area since the outbreak started, NBC said, quoting health officials. Measles is one of the most contagious viruses for humans. In serious cases, infections can cause complications including pneumonia, encephalitis, dehydration and blindness. The Texas Department of State Health Services described it as a \"highly contagious viral infection, which can cause life-threatening illness to anyone who is not vaccinated\". Early symptoms can include a fever, cough and a runny nose, developing into a red-brown rash and high temperature."
    },
    {
        "title": "'The heartbeat of Blondie': Drummer Clem Burke dies aged 70",
        "description": "Blondie drummer Clem Burke has died at the age of 70",
        "url": "https://news.sky.com/story/the-heartbeat-of-blondie-drummer-clem-burke-dies-aged-70-13343992",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-clem-burke-blondiw_6878986.jpg?20250407154707",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-07 16:03:00",
        "Headline": "The musician was hailed as a \"beloved friend and bandmate\" whose talent and energy were \"unmatched\" and as \"a source of inspiration both on and off the stage\". His final live appearance was with Blondie last year.",
        "Content": "Blondie drummer Clem Burke has died at the age of 70 The band said Burke had been diagnosed with cancer, and described his death as a \"profound loss\". He featured on all the Debbie Harry-fronted group's studio albums since joining a year after their formation in 1975. Burke was with the band from their self-titled debut, through their 1978 classic Parallel Lines, to 2017's Pollinator. In a statement on Blondie's Instagram, Harry and the band's guitarist, Chris Stein, said: \"It is with profound sadness that we relay news of the passing of our beloved friend and bandmate Clem Burke following a private battle with cancer. \"Clem was not just a drummer, he was the heartbeat of Blondie. \"His talent, energy, and passion for music were unmatched, and his contributions to our sound and success are immeasurable. \n                  Trump says no pause on tariffs after rollercoaster day on Wall Street ends with most US markets down\n                 \n                  Trump's tariffs: A negotiating tactic or the start of an 'economic nuclear winter'?\n                 \n                  Social media posts spark US markets upturn - before White House clarification sends them back into the red\n                 \"Beyond his musicianship, Clem was a source of inspiration both on and off the stage. His vibrant spirit, infectious enthusiasm and rock solid work ethic touched everyone who had the privilege of knowing him. \"Clem's influence extended far beyond Blondie, a self-proclaimed 'rock and roll survivalist', he played and collaborated with numerous iconic artists.\" Burke featured on Iggy Pop's 1982 album Zombie Birdhouse and also performed with Bob Dylan, The Ramones, The Who guitarist Pete Townshend and Joan Jett. The statement went on to say Burke had left an \"indelible mark on every project he was part of\". It added: \"We extend our deepest condolences to Clem's family, friends, and fans around the world. His legacy will live on through the tremendous amount of music he created and the countless lives he touched.\" Burke, who performed on classic tracks such as Call Me, Heart Of Glass and One Way Or Another, made his final live appearance with Blondie last year. Read more from Sky News:King arrives in Rome for Italy tour with Queen after health concernsGlobal bank chiefs hold talks over Trump tariffs crisis Among those paying tribute to him was Kinks guitarist Dave Davies, who said: \"I feel saddened that Clem Burke was taken from us so soon. \"May he rest in peace, spectacular drumming, we were friends.\" Nancy Sinatra said: \"My heart is shattered. Clem became an icon as a member of Blondie, but he was also an important part of my band, the K.A.B. I was blessed to call him my friend. \"If I ever needed him, he was there. Always. Sending healing prayers and comfort to his widow, Ellen, his family, and all who loved him.\""
    }
]