[
    {
        "title": "Mark Carney's Liberal Party wins Canada election, according to Canadian broadcasters",
        "description": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government.",
        "url": "https://news.sky.com/story/mark-carneys-liberal-party-wins-canada-election-according-to-canadian-broadcasters-13357890",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mark-carney-alberta_6899482.jpg?20250428080325",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-28 23:35:00",
        "Headline": "However, it is too soon to say whether the Liberals will form a majority government, CBC and CTV News said.",
        "Content": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government. Mr Carney, who took over as prime minister after Justin Trudeau stepped down earlier this year, has beaten the leader of the Conservative Party Pierre Poilievre, according to CBC and CTV News projections. However, it is too soon to say whether the Liberals will form a majority government, they added. The party has not yet secured the 172 electoral districts it needs for a majority. The election initially appeared to be a clear-cut race for the opposition Conservatives, who were enjoying a double-digit lead over the Liberals before Mr Trudeau resigned, and an intervention by Donald Trump led to a surge in support for Mr Carney's party. Mr Trump has repeatedly called for Canada to become the 51st US state since he was elected president for a second time and has imposed sweeping tariffs on Canada.  Mr Carney has vowed to take a tougher approach with Washington over its tariffs and has said Canada will need to spend billions to reduce its reliance on the US. If Mr Carney's party only captures a minority of the House's 343 seats, he will be forced to negotiate with other parties in order to stay in power. Such minority governments rarely last longer than two-and-a-half years in Canada. Canadians went to the polls after 11 people were killed in a deadly attack at a Vancouver street fair over the weekend that led to the suspension of campaigning for several hours. Police have ruled out terrorism and said the suspect is a local man with a history of mental health issues. Mr Carney previously ran Canada's central bank and later became the first non-Briton to become governor of the Bank of England. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Power returning in Spain and Portugal after large parts hit by blackout - but what caused it?",
        "description": "Power supplies have been returning in Spain and Portugal after large parts, including the capitals Madrid and Lisbon, were hit by a huge outage on Monday.",
        "url": "https://news.sky.com/story/power-returning-in-spain-and-portugal-after-large-parts-hit-by-blackout-but-what-caused-it-13357374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-police-car-madrid-traffic-jam_6900320.jpg?20250428233523",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-28 05:15:00",
        "Headline": "Airports, trains and internet and mobile coverage were among the services affected by the blackout - with traffic lights also down.",
        "Content": " Power supplies have been returning in Spain and Portugal after large parts, including the capitals Madrid and Lisbon, were hit by a huge outage on Monday. Millions of people were caught up in the chaos after the mass blackout brought many areas to a standstill, with trains stopping, planes grounded, internet and mobile phone services cut, traffic lights and ATMs down, and some routine hospital operations suspended. Spain's interior ministry declared a national emergency and the two countries' governments convened emergency cabinet meetings as officials tried to find out what caused the outage which started around 12.30pm (11.30am UK time). Blackouts in Spain and Portugal: Follow latest updates About half the electricity supplies in Spain have now been restored by the grid operator, Prime Minister Pedro Sanchez said on Monday evening, adding the rest should be back by Tuesday. In a televised address, Mr Sanchez said authorities have not yet worked out what had caused the blackout in the Iberian Peninsula and were not ruling anything out. He asked the public to refrain from speculation, and urged people to call emergency services only if really necessary. Eduardo Prieto, the head of operations at Spanish power grid operator Red Electrica, said the event was unprecedented, calling it \"exceptional and extraordinary\". Meanwhile, Portugal's Prime Minister Luis Montenegro said power in his country would be fully restored in the coming hours. He said all the state services remained operating in the country despite all the difficulties. He also said there was \"no indication\" a cyberattack was the cause. Read more: Analysis - How electricity grids fail 'Rare atmospheric phenomenon' Portugal's grid operator Ren claimed the outage was caused by a fault in the Spanish electricity grid, related to a \"rare atmospheric phenomenon\". Ren says that, due to extreme temperature variations in Spain, there were \"anomalous oscillations\" in very high-voltage lines. It also says that given the complexity of the issue, it could take up to a week for the network to fully normalise again. It comes as France briefly lost power following the outages in Spain and Portugal, French grid operator RTE said. Parts of Madrid underground were evacuated and traffic lights in the city were not working, according to local media. Play was suspended at the Madrid Open tennis tournament due to the outage - with Britain's Jacob Fearnley forced off court in a critical moment during his third-round tie with Grigor Dimitrov. The loss of power affected scoreboards and the camera above the court. Organisers later announced the tournament would not be able to resume on Monday, with afternoon and evening sessions cancelled. Here's what we know has been impacted so far: :: Transport, including trains, metros and airports - with traffic lights also down. :: Internet and mobile coverage.\n :: Lighting in homes, businesses and other buildings, though backup generators are in place in many. :: ATMs and card payments, as well as most till systems. :: Lifts in buildings are stuck.\n :: Electric car chargers and fuel pumps are also down. :: Air conditioning units. :: A significant quantity of water pumps, meaning some homes have no access to drinking water. Airports affected Aena, which runs international airports across Spain, said earlier that \"some incidents were occurring\" at the airports due to the outage. The company added in a statement: \"Contingency generators are active. Please check with your airline, as there may be disruptions to access and ground transportation.\" People 'had nowhere to go' Maddie Sephton, who is from west London, was on the Madrid Metro when the power outage occurred. \"We got on the train and everything was fine,\" she told Sky News. \"But then everything went dark.\" She was stuck on the train for 20 minutes until a staff member opened the doors manually. Mrs Sephton says she was on her way to the airport at the time - and had to exit the station by walking up 15 flights of stairs with her luggage. \"No lifts are operating - making it difficult for elderly people with limited mobility,\" she added. Above ground, she said that \"everyone is just standing around and waiting\". Bars were unable to take card payments, cash machines are down, and traffic lights weren't working either. \"I currently don't have any internet service and just €15 in my wallet - I can't withdraw any money from the ATM,\" she added. \"A couple have offered to let us get a ride in their taxi to the airport. Their flight is at 4.30pm so they're pretty relaxed - but my flight back to London is at 3pm and I'm nervous.\" Mrs Sephton said: \"People are just walking but have nowhere to go, and nothing to do.\" Meanwhile, thousands of passengers had to be evacuated after the blackout left the metro service in Barcelona without power. The blackout was also reported to have forced the closure of the city's tram system and rendered some traffic lights there inoperable. It has also impacted medical facilities, with hospitals in Madrid and Catalonia forced to suspend routine medical work. Staff have been able to attend to critical patients using power from backup generators. It comes as Metrovalencia, the urban rail system, encompassing both metro and tram services in Valencia, said traffic in the city was \"disrupted\" due to a \"general power outage in the city\". The outage also hit the Portuguese capital Lisbon and surrounding areas, as well as northern and southern parts of the country. Portugal's government said the incident appeared to stem from problems outside the country, an official told national news agency Lusa. \"It looks like it was a problem with the distribution network, apparently in Spain. It's still being ascertained,\" Cabinet Minister Leitão Amaro was quoted as saying."
    },
    {
        "title": "How electricity grids fail - and why restoring Spain and Portugal's power will be a nightmare",
        "description": "We rarely think about how essential and reliable electricity grids are until they fail.",
        "url": "https://news.sky.com/story/how-electricity-grids-fail-and-why-restoring-spain-and-portugals-power-will-be-a-nightmare-13357727",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-madrid-outage_6900038.jpg?20250428173758",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-28 16:23:00",
        "Headline": "Keeping a grid running is a constant and highly complex balancing act. Gradually restoring one is a huge challenge for engineers. ",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  We rarely think about how essential and reliable electricity grids are until they fail. Now, millions of people across Spain, Portugal and parts of France are likely thinking of little else. While local power cuts are fairly common, what's happened across the Iberian peninsula is something far more extreme.  Much of Spain and Portugal's electricity transmission system collapsed in seconds including in major cities Lisbon, Madrid, Barcelona and Seville. Blackouts latest: 'Rare atmospheric phenomenon' behind outages  It's likely the outage will surpass Europe's largest blackout to date when 56 million people in Italy and Switzerland lost power for up to 12 hours in 2003. The cause of the outage is unclear. Portugal's grid operator has blamed a \"rare atmospheric phenomenon\" that caused \"anomalous oscillations\" in high voltage power lines in Spain. \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Ultra-processed foods could be linked to thousands of UK deaths a year - study\n                 \n                  You wouldn't steal a font: Famous anti-piracy campaign may have used pirated typeface\n                 Spain's grid operator has yet to respond to that or provide an update on the cause. But it's unlikely whatever caused the outage was a single, localised event. A major power line going down can cause a large outage - as it did in 2021, when an interconnector between France and Spain failed leaving a million people without power for a few hours. But it's unlikely to cause a system-wide failure of the kind we're seeing now. However, when things do start to fail on a power grid, they can cascade uncontrollably. Keeping a grid running is a constant and highly complex balancing act. Spain's mains AC electricity supply grid, like ours in the UK, runs at 50Hz. That frequency is based on the speed at which generating hardware such as gas and nuclear turbines spin. If there are sudden fluctuations in power supply or demand - a power station failing or a high voltage power line going down, for example - the frequency of AC power in the transmission lines changes and circuit breakers trip to protect either the transmission network, or power plant hardware from burning out. To prevent such failures, grid engineers constantly measure and forecast supply and demand to keep the grid balanced. More from Sky News:The 3G switch-off explained Just Stop Oil holds final protest To protect the system in emergencies, they occasionally have to \"shed load\" by cutting power to parts of the grid - the reason we've all experienced the occasional short-lived power cut. But if balance is lost, a grid can fail in a domino effect with sections of the grid tripping, then power plants shutting down to protect themselves from the drop in demand, one after another. The challenge now, and it's a nightmare for Spain and Portugal's power engineers, is to gradually restore the grid section by section while maintaining the balance of supply and demand. Act too fast, and the grid can trip again. Take too long and some power plants or substations might struggle to restart - especially if they rely on battery power to do so. While some regions of Spain have already had power restored, and Portugal says its power will be back to normal within hours, it could take much longer for the system to be fully restored."
    },
    {
        "title": "Kneecap should apologise for 'kill your MP' remarks, says murdered MP's daughter",
        "description": "The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\".",
        "url": "https://news.sky.com/story/kneecap-should-apologise-for-kill-your-mp-remarks-says-murdered-mps-daughter-13357465",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-28 09:32:00",
        "Headline": "Kneecap say they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\".",
        "Content": " The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\". Footage of the group at a November 2023 gig appears to show one member saying: \"The only good Tory is a dead Tory. Kill your local MP.\" Sir David was killed at a constituency surgery in 2021. Speaking to the UK Tonight With Sarah-Jane Mee, Katie Amess said: \"I'm more than happy to sit down and speak with them. I'm sure they've never met a victim of such a heinous crime, and so they're not thinking it through. \"If they were to meet with me and to see and to hear the pain and the torture and the torment that I go through every day, I'm sure they would feel terribly guilty. \"And I'm sure that they would apologise, because if not, what kind of people are they?\" Conservative leader Kemi Badenoch has demanded the prosecution of the rap trio Kneecap after the video emerged. Downing Street has described the alleged comments as \"completely unacceptable\". Police are investigating - and are also assessing footage reportedly from a gig a year later in London's Kentish Town Forum. In the November 2024 video, a member of the band appears to shout \"up Hamas, up Hezbollah\" - referencing groups which are banned as terrorist organisations in the UK. A Metropolitan Police spokesman said: \"We were made aware of a video on 22 April, believed to be from an event in November 2024, and it has been referred to the counter-terrorism internet referral unit for assessment and to determine whether any further police investigation may be required. \"We have also been made aware of another video believed to be from an event in November 2023.\" Mrs Badenoch said it was \"good\" the police were looking into the allegations, adding: \"Kneecap's glorification of terrorism and anti-British hatred has no place in our society. \"Now footage shows one of them saying: 'The only good Tory is a dead Tory. Kill your local MP'. \"After the murder of Sir David Amess, this demands prosecution.\" Ms Amess also welcomed the investigation. She told Sky News: \"I wake up every day with the knowledge that I will never see my father again. \"He will never meet my children. He wasn't able to be at my wedding. There's nothing funny about this. \"This is serious, and the government and the police need to take it seriously and to nip this in the bud and stop this kind of rhetoric being tolerated.\" Kneecap, made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In a statement Kneecap said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"We also reject any suggestion that we would seek to incite violence against any MP or individual. Ever. An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action.\" The band added: \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Read more from Sky News:UK temperatures could hit 29C this weekM&S tells agency staff to stay at home Mrs Badenoch and Kneecap are already known to each other. The Tory leader blocked a government grant to the bilingual Belfast group while she was business secretary. But last November, Kneecap won a discrimination challenge over the decision to refuse them a £14,250 funding award after the UK government conceded it was \"unlawful\". Downing Street condemned the alleged comments. \"We do not think individuals expressing those views should be receiving government funding,\" the prime minister's official spokesman said. Asked if the money should be returned, the spokesman added: \"That's up to the group, but clearly the PM rejects the views expressed ... does not shy away from condemning them.\""
    },
    {
        "title": "UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt",
        "description": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House.",
        "url": "https://news.sky.com/story/uk-us-trade-talks-moving-in-a-very-positive-way-says-white-house-spokesperson-karoline-leavitt-13357785",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trump_6887098.jpg?20250415185739",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-28 18:06:00",
        "Headline": "Discussions surrounding a US-UK trade deal have been taking place since Brexit, although they were not prioritised as highly under Joe Biden. Ministers from the UK side have also recently appeared optimistic about the chances of a deal. ",
        "Content": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House. President Donald Trump's press secretary Karoline Leavitt spoke about the likelihood of the long-discussed agreement during a press briefing. In Westminster, there are hopes such a deal could soften the impact of the Trump tariffs announced last month. Leavitt told reporters: \"As for the trade talks, I understand they are moving in a very positive way with the UK. \"I don't want to get ahead of the president or our trade team in how those negotiations are going, but I have heard they have been very positive and productive with the UK.\" She said Mr Trump always \"speaks incredibly highly\" of the UK. \"He has a good relationship with your prime minister, though they disagree on domestic policy issues,\" she added. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  China-US tariff war could be reaching stalemate, but more danger lingers\n                 \"I have witnessed the camaraderie between them first hand in the Oval Office, and there is a deep mutual respect between our two countries that certainly the president upholds.\" Chancellor of the Duchy of Lancaster Pat McFadden gave the UK's position on the talks when speaking to Sunday Morning With Trevor Phillips. He said there was \"a serious level of engagement going on at high levels\" to secure a UK-US trade deal. Mr McFadden is one of the most powerful members of Sir Keir Starmer's government and a key ally of the prime minister. Read more:Deal 'possible' but not certainChancellor lays out redlines for deal He was careful to not get ahead of developments, however, saying: \"I think an agreement is possible - I don't think it's certain, and I don't want to say it's certain, but I think it's possible.\" He went on to say the government wanted an \"agreement in the UK's interests\" and not a \"hasty deal\", amid fears from critics that Number 10 could acquiesce a deal that lowers food standards, for example, or changes certain taxes in a bid to persuade Donald Trump to lower some of the tariffs that have been placed on British goods. Mr McFadden's tone was more cautious than Chancellor Rachel Reeves' last week. She had been in the US and, speaking to Sky News business and economics correspondent Gurpreet Narwan, the chancellor said she was \"confident\" a deal could be done.  But she sought to play down fears that UK standards could be watered down, both on food and online safety. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" Ms Reeves said."
    },
    {
        "title": "Sex offenders to be denied refugee status under plans to improve women's safety",
        "description": "Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security.",
        "url": "https://news.sky.com/story/sex-offenders-to-be-denied-refugee-status-under-plans-to-improve-womens-safety-13357749",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-border-force-channel_6899979.jpg?20250428164411",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-04-28 16:53:00",
        "Headline": "The government says the proposals will improve safety for women and girls, while clamping down on illegal migration.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security. The Home Office announcement means foreign nationals who are added to the sex offenders register will forfeit their rights to protection under the Refugee Convention. Politics latest: Tory-Reform coalition would be disaster, warns PM As part of the 1951 UN treaty, countries are allowed to refuse asylum to terrorists, war criminals and individuals convicted of a \"particularly serious crime\" - which is currently defined in UK law as an offence carrying a sentence of 12 months or more. The government now plans to extend that definition to include all individuals added to the Sex Offenders' Register, regardless of the length of sentence, in an amendment to the Border Security, Asylum and Immigration Bill, which is currently going through parliament. It's understood they also hope to include those convicted of equivalent crimes overseas. Those affected will still be able to appeal their removal from the UK in the courts under the European Convention on Human Rights (ECHR). It is unclear how many asylum seekers will be affected, as the government has been unable to provide any projections or past data on the number of asylum seekers added to the Sex Offenders' Register. \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 \n                  UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt\n                 \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 Home Secretary Yvette Cooper said: \"Sex offenders who pose a risk to the community should not be allowed to benefit from refugee protections in the UK. \"We are strengthening the law to ensure these appalling crimes are taken seriously.\" Safeguarding and Violence Against Women and Girls Minister Jess Philips said: \"We are determined to achieve our mission of halving violence against women and girls in a decade. \"That's exactly why we are taking action to ensure there are robust safeguards across the system, including by clamping down on foreign criminals who commit heinous crimes like sex offences.\" Read more:PM 'doesn't want to see strike action'Former Streeting aide avoids jail after exposing himself  The Home Office would like voters to see this as a substantial change. But that's hard to demonstrate without providing any indication of the scale of the problem it seeks to solve. Clearly, the government does not want to fan the flames of resentment towards asylum seekers by implying large numbers have been committing sex crimes. But amid rising voter frustration about the government's grip on the issue, and under pressure from Reform - this measure is about signalling it is prepared to take tough action. Conservatives: 'Too little, too late' The Conservatives claim Labour are engaged in \"pre-election posturing\". Chris Philp MP, the shadow home secretary, said: \"This is too little, too late from a Labour government that has scrapped our deterrent and overseen the worst year ever for small boat crossings - with a record 10,000 people crossing this year already. \"Foreign criminals pose a danger to British citizens and must be removed, but so often this is frustrated by spurious legal claims based on human rights claims, not asylum claims.\"  The Home Office has also announced plans to introduce a 24-week target for appeal hearings (known as \"first-tier tribunals\") to be held for rejected asylum seekers living in taxpayer-supported accommodation, or for foreign national offenders. The current average wait is 50 weeks. The idea is to cut the asylum backlog and save taxpayers money - Labour have committed to end the use of asylum hotels by the end of this parliament. It's unclear how exactly this will be achieved, although a number of additional court days have already been announced. The government also plans to crack down on fake immigration lawyers who advise migrants on how to lodge fraudulent asylum claims, with the Immigration Advice Authority given new powers to issue fines of up to £15,000."
    },
    {
        "title": "Schoolgirl who attempted to murder teachers and pupil in Wales detained for 15 years",
        "description": "A 14-year-old girl who attempted to murder two teachers and a pupil at a school in Wales has been sentenced to 15 years in detention.",
        "url": "https://news.sky.com/story/schoolgirl-who-attempted-to-murder-teachers-and-pupil-sentenced-to-15-years-in-detention-13354841",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-liz-hopkin-fiona-elias_6899928.jpg?20250428153258",
        "type": "Home",
        "Author": "Tomos Evans",
        "Date Published": "2025-04-28 07:00:00",
        "Headline": "The girl, who cannot be named for legal reasons, was previously found guilty of attempting to murder Fiona Elias and Liz Hopkin - and a fellow pupil.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n A 14-year-old girl who attempted to murder two teachers and a pupil at a school in Wales has been sentenced to 15 years in detention. The girl, who cannot be named for legal reasons, was previously found guilty of attempting to murder teachers Fiona Elias and Liz Hopkin and a pupil at Ysgol Dyffryn Aman in Ammanford, Carmarthenshire. Emergency services were called to the school on 24 April last year, in what the trial heard was a \"serious episode of violence\" during the mid-morning break. The girl had taken her father's fishing \"multi-tool\" to school and she admitted three counts of wounding with intent and possession of a bladed article on a school premises. Following a week-long trial in February, a jury found her guilty of attempted murder. After her arrest, the teenager told officers she was \"pretty sure\" the incident would be on the news, and added \"that's one way to be a celebrity\". Both Mrs Elias and Mrs Hopkin \"received significant and serious injuries\", Swansea Crown Court heard. Mrs Hopkin was airlifted to hospital after she suffered \"four stab wounds\", while Mrs Elias and the pupil also attended hospital for treatment. 'Changed my life forever' Reading a victim impact statement from the witness box on Monday, Mrs Elias said the incident had shown her that life was \"fragile\" and had been \"a steep learning curve\". \"Walking out on duty that day would change my life forever,\" she said, adding it was a moment which \"replays itself over and over no matter how much time passes\". \"It's not easy, and I know I'll continue to face challenges, but every day I'm taking steps towards healing,\" Mrs Elias told the court. Addressing the defendant, Mrs Elias said \"your motive was clear, you intended to murder me\" but that she was stopped \"thanks to Liz's selfless actions\". She said she was not \"ruling out the possibility of a meeting with [the pupil] in the future,\" but that she first needed to know she would \"engage with the interventions that will be put in place\". Outlining her plans to campaign for safer working conditions at schools, Mrs Elias said: \"I never expected to give my blood, but I will always give my heart to Ysgol Dyffryn Aman and to the world of education.\" 'I was sure I was going to die' Mrs Hopkin said it had been \"the worst experience of [her] life\" but that she was \"glad\" she was \"in the right place at the right time\" to protect Mrs Elias. \"I'm still here, I'm still alive, though at the time I was sure that I was going to die,\" she told the court. \"Physically, my wounds have healed but the scars remain.\" Mrs Hopkin added that the thought of returning to a career in teaching now filled her with \"anxiety and dread\". \"You were prepared to kill someone you did not know,\" she said, addressing the defendant. \"The decision to end my life was never yours to make.\" Mrs Hopkin said she worried about the defendant's future, adding: \"I don't want you to be punished forever but I do want you to take every opportunity to make your life better.\" Concluding her victim personal statement, Mrs Hopkin said: \"It has changed me in ways I never wanted and that is something I will have to live with for the rest of my life.\" 'Very complex young girl' In mitigation, Caroline Rees KC said the defendant was \"a very complex young girl\" and had a \"difficult background\". Handing down his sentence, Judge Paul Thomas said the defendant would serve half of the 15-year sentence before she can be considered for release. Addressing the defendant, he said: \"What you did in school almost a year ago to the day has caused a large number of people a great deal of harm and upset. It has hugely affected many lives, including, of course, your own.\" \"The simple fact is you tried to kill three people - two teachers and another pupil,\" he added. \"I think that it is very important here - that what you did, you did in full view of so many other pupils... in my view you wanted as many of your fellow pupils as possible to see what you intended to do.\" The judge added that \"for one reason or other, [the defendant wasn't] really listening\" to the victim impact statements of Mrs Elias and Mrs Hopkin. He said he did not think the teenager was \"genuinely sorry\" for what she did, adding: \"You showed no emotion or even interest in how they felt that day or ever since.\" Speaking after the sentence was passed, Detective Chief Superintendent Ross Evans from Dyfed-Powys Police said the impact on the victims \"remains ongoing\". \"All three suffered physical harm at the hands of the defendant and although wounds can heal with time, it will take considerably longer to recover from the mental trauma her actions caused,\" he said. \"For the students who unfortunately witnessed such an act of violence as they went about their day, I sincerely hope they are still able to view their school as a place of safety, and that today's sentence shows that any attempt to compromise school safety will not be tolerated.\""
    },
    {
        "title": "End the 'absolute scandal' of new homes built without solar panels, government urged",
        "description": "The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels. ",
        "url": "https://news.sky.com/story/end-the-absolute-scandal-of-new-homes-built-without-solar-panels-government-urged-13357705",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-build-solar-panel_6900006.jpg?20250428171210",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-28 22:59:00",
        "Headline": "Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels.  Doing so would cut both household bills and greenhouse gases that cause climate change, the Local Government Association (LGA) said in a new report. Just four in 10 new homes in England come with solar power, according to separate figures from the industry body Solar Energy UK. Although that is a significant three-fold increase over the space of a year, the LGA said making it mandatory would benefit bill-payers and the climate for years to come, saving people £440 per year. The UK lags behind its neighbours in the European Union, which last year adopted new legislation demanding all new residential buildings come with solar panels from 2030. Greenpeace UK called it an \"absolute scandal that homes are built without rooftop solar panels in this day and age\". Its campaigner, Lily Rose Ellis, said: \"Given the soaring cost of electricity, our desperate need to cut planet-heating emissions, and the relatively low cost of installation to housebuilders, solar panels on all new builds should be mandatory.\" \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 \n                  The good, the bad and the ugly in Donald Trump's coal plans\n                 Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory, as it also courts the house-building industry to help it meet its target to build 1.5 million homes during this parliament.  The LGA wants the government to allocate them long-term funding in the upcoming spending review so they can help the country meet net zero. A spokesperson for the Ministry of Housing, Communities and Local Government said they plan to \"maximise the installation of solar panels on new homes\" in its long-delayed new regulations, the Future Homes Standard, due later this year. The Home Builders Federation said \"Moving forward, to meet the ever more challenging carbon reductions set by government, we will see solar on the overwhelming majority of new homes, albeit it is not appropriate in every situation.\" Pylon rows The push on solar power is part of the government's broader plans to ensure all the UK's electricity comes from green sources by 2030. Electricity demand is also growing as the country switches to electric cars and heating, and builds more data centres. All this requires more wind and solar farms, as well as 1,000 kilometres of new cables to carry the electricity from where it is generated - often a wind farm in the North Sea - to where it is used in urban areas far away. In parts of the country like East Anglia, a row has been simmering over whether to run those cables overhead on pylons or, to protect countryside views, underground. A hefty new report by the Institution of Engineering and Technology today weighed in on the debate, finding underground cables are on average 4.5 times more expensive than overhead lines. Liam Hardy, head of research at thinktank Green Alliance, said: \"Those costs need to go somewhere. They go on to all of our electricity bills. And of course, it's the poorest in society for whom those bills make up a bigger percentage of their income. He added: \"What they want to see is value for money as we build out that clean infrastructure that we need.\" The government has promised communities disrupted by the new infrastructure that they should reap some of the benefits, including giving households near new pylons £2,500 off their energy bills over 10 years."
    },
    {
        "title": "Schoolgirl who attempted to murder teachers and pupil in Wales detained for 15 years",
        "description": "A 14-year-old girl who attempted to murder two teachers and a pupil at a school in Wales has been sentenced to 15 years in detention.",
        "url": "https://news.sky.com/story/schoolgirl-who-attempted-to-murder-teachers-and-pupil-sentenced-to-15-years-in-detention-13354841",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-liz-hopkin-fiona-elias_6899928.jpg?20250428153258",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-04-28 07:00:00",
        "Headline": "The girl, who cannot be named for legal reasons, was previously found guilty of attempting to murder Fiona Elias and Liz Hopkin - and a fellow pupil.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n A 14-year-old girl who attempted to murder two teachers and a pupil at a school in Wales has been sentenced to 15 years in detention. The girl, who cannot be named for legal reasons, was previously found guilty of attempting to murder teachers Fiona Elias and Liz Hopkin and a pupil at Ysgol Dyffryn Aman in Ammanford, Carmarthenshire. Emergency services were called to the school on 24 April last year, in what the trial heard was a \"serious episode of violence\" during the mid-morning break. The girl had taken her father's fishing \"multi-tool\" to school and she admitted three counts of wounding with intent and possession of a bladed article on a school premises. Following a week-long trial in February, a jury found her guilty of attempted murder. After her arrest, the teenager told officers she was \"pretty sure\" the incident would be on the news, and added \"that's one way to be a celebrity\". Both Mrs Elias and Mrs Hopkin \"received significant and serious injuries\", Swansea Crown Court heard. Mrs Hopkin was airlifted to hospital after she suffered \"four stab wounds\", while Mrs Elias and the pupil also attended hospital for treatment. 'Changed my life forever' Reading a victim impact statement from the witness box on Monday, Mrs Elias said the incident had shown her that life was \"fragile\" and had been \"a steep learning curve\". \"Walking out on duty that day would change my life forever,\" she said, adding it was a moment which \"replays itself over and over no matter how much time passes\". \"It's not easy, and I know I'll continue to face challenges, but every day I'm taking steps towards healing,\" Mrs Elias told the court. Addressing the defendant, Mrs Elias said \"your motive was clear, you intended to murder me\" but that she was stopped \"thanks to Liz's selfless actions\". She said she was not \"ruling out the possibility of a meeting with [the pupil] in the future,\" but that she first needed to know she would \"engage with the interventions that will be put in place\". Outlining her plans to campaign for safer working conditions at schools, Mrs Elias said: \"I never expected to give my blood, but I will always give my heart to Ysgol Dyffryn Aman and to the world of education.\" 'I was sure I was going to die' Mrs Hopkin said it had been \"the worst experience of [her] life\" but that she was \"glad\" she was \"in the right place at the right time\" to protect Mrs Elias. \"I'm still here, I'm still alive, though at the time I was sure that I was going to die,\" she told the court. \"Physically, my wounds have healed but the scars remain.\" Mrs Hopkin added that the thought of returning to a career in teaching now filled her with \"anxiety and dread\". \"You were prepared to kill someone you did not know,\" she said, addressing the defendant. \"The decision to end my life was never yours to make.\" Mrs Hopkin said she worried about the defendant's future, adding: \"I don't want you to be punished forever but I do want you to take every opportunity to make your life better.\" Concluding her victim personal statement, Mrs Hopkin said: \"It has changed me in ways I never wanted and that is something I will have to live with for the rest of my life.\" 'Very complex young girl' In mitigation, Caroline Rees KC said the defendant was \"a very complex young girl\" and had a \"difficult background\". Handing down his sentence, Judge Paul Thomas said the defendant would serve half of the 15-year sentence before she can be considered for release. Addressing the defendant, he said: \"What you did in school almost a year ago to the day has caused a large number of people a great deal of harm and upset. It has hugely affected many lives, including, of course, your own.\" \"The simple fact is you tried to kill three people - two teachers and another pupil,\" he added. \"I think that it is very important here - that what you did, you did in full view of so many other pupils... in my view you wanted as many of your fellow pupils as possible to see what you intended to do.\" The judge added that \"for one reason or other, [the defendant wasn't] really listening\" to the victim impact statements of Mrs Elias and Mrs Hopkin. He said he did not think the teenager was \"genuinely sorry\" for what she did, adding: \"You showed no emotion or even interest in how they felt that day or ever since.\" Speaking after the sentence was passed, Detective Chief Superintendent Ross Evans from Dyfed-Powys Police said the impact on the victims \"remains ongoing\". \"All three suffered physical harm at the hands of the defendant and although wounds can heal with time, it will take considerably longer to recover from the mental trauma her actions caused,\" he said. \"For the students who unfortunately witnessed such an act of violence as they went about their day, I sincerely hope they are still able to view their school as a place of safety, and that today's sentence shows that any attempt to compromise school safety will not be tolerated.\""
    },
    {
        "title": "Teen driver who caused deaths of three students weeks after passing test detained for two years",
        "description": "The mother of a girl killed in a car crash says the government's lack of action on reducing the number of young fatalities is \"not good enough anymore\" &#8211; as the teenager responsible for her death was detained for two years.",
        "url": "https://news.sky.com/story/teen-motorist-who-caused-deaths-of-three-students-weeks-after-passing-test-detained-for-two-years-13356839",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-purcell-tilly_6859999.jpg?20250428221823",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-04-28 06:00:00",
        "Headline": "Edward Spencer admitted causing the deaths of three of his fellow student by careless driving six weeks after passing his test. ",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  The mother of a girl killed in a car crash says the government's lack of action on reducing the number of young fatalities is \"not good enough anymore\" – as the teenager responsible for her death was detained for two years. Edward Spencer, 19, was sentenced at Warwick Crown Court for causing the deaths by careless driving of three fellow students while driving home from school in April 2023. Spencer, who was 17 at the time of the crash, lost control of his Ford Fiesta near Shipston-on-Stour just six weeks after passing his test. His passengers, Matilda \"Tilly\" Seccombe, 16, Frank Wormald, 16, and Harry Purcell, 17, all died. The teenager was travelling at around 64mph when he hit an oncoming Fiat 500 - two children aged 10 and 12 and their stepmother inside suffered \"life-changing\" injuries. Police say his speed was too fast for the road and the conditions, with the court also hearing he had a \"history of bad driving\" including showing off, evidenced by social media posts and videos.  Tilly's mother Juliet Seccombe recalled the moment she raced to the scene of the crash. \"Immediately when I got to a junction the police were shouting down the road, I saw an air ambulance, that complete panic… you freeze… everything shuts down,\" she said. \"It's devastating. Absolutely devastating. The birthdays, anniversaries, everything, you know, just being a mother… you feel lost… when you've lost one of your children.\" She criticised the government for not implementing Graduated Driving Licences (GDLs) to help reduce the number of crashes involving new drivers. \"If graduated driving licences were in place this would have saved Tilly's life,\" she said. 'Do something about it' GDLs would see certain restrictions imposed on learner drivers - such as a ban on night time driving and passenger numbers - in the first few months. They are already used in countries such as Canada, the US, Australia and New Zealand. In Canada, deaths among 16-year-old drivers have fallen by more than 80% following the introduction of GDLs. \"No action and procrastination is not good enough anymore,\" said Ms Seccombe. \"It's no good just accepting there's a problem - do something about it. Doing nothing is going to cause some other family the pain and anguish we are going through.\" In 2023 around a fifth of people killed or seriously injured in Great Britain in car collisions involved a young driver - and the UK government says young male drivers are four times more likely to be killed or injured compared with other motorists. Despite growing evidence of their success, the government is continuing to refuse to consider them as part of its new road safety strategy. Previously it has said it is looking at options that do not \"penalise\" young drivers - a comment that has angered grieving families. \"We're penalised because our son's been killed,\" said Toni Purcell, Harry's mother. \"It's a double-edged sword isn't it. Our son is no longer here because somebody was driving without due care and attention. \"If the government is saying it penalises young drivers, what about the families who've been penalised by the loss of their children?\" The stepmother driving the car Spencer hit - who cannot be named for legal reasons - recalled to Sky News the moment the crash happened. \"I was on a straight strip of road, and I saw a silver Ford Fiesta coming towards me round the corner and I could tell the driver had lost control. \"I knew it was going to hit my car… and the only thing I could do is to tell my children to close their eyes because I knew they were going to die.\" Both children required major surgery and continue to receive treatment for their injuries. She is also calling on the government to reconsider its position on GDLs, saying they have been proven to work in other countries. \"Young people have a disproportionate number of accidents; they cause a disproportionate number of accidents,\" she said. \"I think that needs to change. There needs to be systemic change otherwise it's going to stay the same - we're going to keep hearing about it on the news.\" 'She was a beautiful girl' Mrs Seccombe said she wanted Tilly to be remembered for her beautiful smile. \"She was a beautiful girl, and she was bright, she had everything to go for in life. Just a bright, happy, funny, spark. She was blossoming into a beautiful young lady,\" she said. Harry's mother said Harry's death has left a \"massive hole\" in their family. \"He'd grown into such a beautiful, funny, loving, kind young man… he had such a kind heart and he always had a positive word to say…he was a beautiful character, beautiful personality,\" she said. Both mothers believe Spencer has showed no remorse since the crash. \"It's made Tilly's life worthless in his eyes as far as I'm concerned - and that's extremely painful to accept,\" said Ms Seccombe. \"I'm just really saddened that he hasn't reflected on his actions, and he hasn't learnt to atone.\" Spencer changed his plea to guilty in March, nearly two years after the crash. As well as two years' detention, he was also banned from driving for eight years and ordered to take an extended re-test. Judge Andrew Lockhart KC highlighted a social media video of Spencer passing a mobility scooter at more than 50mph in the weeks prior to the crash. The judge said it was \"crystal clear evidence of previous poor driving\", adding: \"It is disturbing material and it seriously aggravates the position you find yourself in.\" The judge said the crash was caused by a \"lethal combination\" of grossly excessive speed and a failure to drive to the road conditions. A Department for Transport spokesperson told Sky News: \"Every death on our roads is a tragedy and our thoughts remain with the families of everyone who has lost a loved one in this way. \"Whilst we are not considering Graduated Driving Licences, we absolutely recognise that young people are disproportionately victims of tragic incidents on our roads. \"We are determined to tackle this, including through our THINK! campaign, which has a focus on men aged 17-24 as they are four times more likely to be killed or seriously injured than other drivers.\""
    },
    {
        "title": "Driver who killed mother and daughter in crash is jailed",
        "description": "A driver has been jailed after causing the deaths of a mother and daughter by careless driving.",
        "url": "https://news.sky.com/story/driver-who-killed-mother-and-daughter-in-crash-is-jailed-13357662",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-cheryl-woods-sarha-smith_6333661.jpg?20231025141910",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-28 14:33:00",
        "Headline": "Firas Zeineddine is jailed for causing the deaths of Cheryl Woods, 61, and Sarha Smith, 40, by careless driving. Data from his Tesla car recorded speeds of more than 90mph during Storm Babet.",
        "Content": "A driver has been jailed after causing the deaths of a mother and daughter by careless driving. Firas Zeineddine was jailed for 12 months on Monday at Swindon Crown Court for causing the deaths of Cheryl Woods, 61, and Sarha Smith, 40, from Caerphilly in South Wales. The court heard the 46-year-old had been driving his Tesla car at speeds of more than 90mph on the M4 near Chippenham, Wiltshire. The defendant lost control of the vehicle in October 2023 because of surface water which followed heavy rain and strong winds brought to the UK by Storm Babet. Zeineddine, from Keynsham, Bristol, collided with a lorry which then crashed into and fell on Ms Woods and Ms Smith's vehicle. They had stopped on the hard shoulder after an earlier minor collision and officers say the lorry narrowly missed an officer from National Highways. Both Ms Woods and Ms Smith were declared dead at the scene. \n                  One-year-old girl dies after collision with vehicle on campsite in North Wales\n                 \n                  Schoolgirl who attempted to murder teachers and pupil in Wales detained for 15 years\n                 \n                  Headteacher jailed for attacking his deputy over 'sexual jealousy'\n                 Detective Constable Sean Williams, from Wiltshire Police said after the sentencing that this was \"an utterly tragic and needless incident\". \"Zeineddine's speeding in the conditions was completely reckless and he admitted having impaired vision due to the amount of mist and spray that was coming off the road,\" he added. \"Despite this, data from his Tesla showed his speed was in excess of 90mph.\" DC Williams added that the deaths of Ms Woods and Ms Smith \"provide a clear illustration of why it is vital to drive to the conditions\". Read more from Sky News:Teachers address girl who tried to murder them and pupilLarge parts of Spain and Portugal hit by power outage'Powerful individuals' at BBC making lives of colleagues 'unbearable' The family of the two women paid tribute to them after their deaths and described them as devoted mothers and grandmothers, respectively. They said Ms Woods's \"selflessness was a defining trait\" and that she took \"immense pride in her Welsh heritage\". Their family added that Ms Smith's absence \"leaves a void for those who relied on her radiant presence\". \"Her legacy lives on through her six daughters, who will forever hold her memory close and strive to honour her with their efforts,\" they added."
    },
    {
        "title": "One-year-old girl dies after collision with vehicle on campsite in North Wales",
        "description": "A one-year-old girl has died after a crash on a campsite near Caernarfon, police have confirmed.",
        "url": "https://news.sky.com/story/one-year-old-girl-dies-after-collision-with-vehicle-on-campsite-in-north-wales-13357703",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bryn-gloch-caravan-camping-park_6900005.jpg?20250428170543",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-28 15:41:00",
        "Headline": "North Wales Police said the girl was airlifted to Alder Hey children's hospital in Liverpool where she later died.",
        "Content": "A one-year-old girl has died after a crash on a campsite near Caernarfon, police have confirmed. North Wales Police said it received a 999 call at 10.20am on Monday to a report of a collision involving the girl and a vehicle on the Bryn Gloch Caravan and Camping Park. Emergency services attended, including an air ambulance, which airlifted the child to Alder Hey Children's Hospital in Liverpool. The force said in a statement that the child died in hospital this afternoon, despite the best efforts of all involved. Sergeant Simon Hughes of North Wales Police's roads crime unit said the \"profound sympathies\" of officers were with the girl's family \"at this extremely difficult time\". \"They will now be supported by a specially-trained family liaison officer,\" he added. \"The investigation to establish the cause of the collision is well under way and I would like to thank all those who assisted on the site today.\" \n                  Driver who killed mother and daughter in crash is jailed\n                 \n                  Schoolgirl who attempted to murder teachers and pupil in Wales detained for 15 years\n                 \n                  Headteacher jailed for attacking his deputy over 'sexual jealousy'\n                 Read more from Sky News:Girl who tried to murder two teachers and pupil sentencedLarge parts of Spain and Portugal hit by power outage The campsite is located in Betws Garmon, a small hamlet in the county of Gwynedd, with a population of around 249. The police added in their statement that the coroner had been informed and that they were unable to release further details at this time."
    },
    {
        "title": "BBC has failed to foster an environment where employees feel comfortable about speaking up",
        "description": "It is often cited as being the \"envy of the world\", seen as a gold standard public service broadcaster.",
        "url": "https://news.sky.com/story/bbc-has-failed-to-foster-an-environment-where-employees-feel-comfortable-about-speaking-up-13357661",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bbc-broadcasting-house_6899934.jpg?20250428154301",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-28 14:26:00",
        "Headline": "The BBC's new report talks of a Call It Out campaign for bad behaviour, which is not too dissimilar to its 2013 promise to \"publicise support for bullying\".",
        "Content": "\n          Arts and entertainment correspondent\n       It is often cited as being the \"envy of the world\", seen as a gold standard public service broadcaster. But while this latest report ultimately found no evidence of a toxic culture for staff at the BBC, it brought to light why the bad behaviour of some of its stars often goes unchecked. The process of reporting was described by one employee as \"traumatising... unsupportive, overly long... [with]... relentless rounds of meetings... and uncertainty\". And while BBC chairman Samir Shah says there is \"absolute determination... [to] rid the BBC of these behaviours for good\", it has clearly failed to do so to date. From staff feeling unable to raise concerns about Russell Brand, to failing to \"take adequate action\" over DJ Tim Westwood's behaviour (both of whom deny any wrongdoing), on some level the corporation has to accept it has failed to foster an environment where its employees feel comfortable about speaking up. It is also worth noting that if the recommendations sound familiar, similar was said after Jimmy Savile's abuse was exposed when the corporation published its Respect at Work Review in 2013. Read more from Sky News:Girl who tried to kill teachers and pupil detained for 15 yearsSky News investigates UK's 'worst ambulance service' \n                  Star behaviour – will the scandals ever stop?      \n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  'They have to come up with another model': For many the BBC licence fee increase is a bad joke\n                 This new 2025 report talks of a Call It Out campaign for bad behaviour, which is not too dissimilar to its 2013 promise to \"publicise support for bullying\". It also says it will implement \"new pledges for individuals... on what they can expect from the BBC\", which again sounds rather like back when they promised to relaunch the BBC's values. Tough talking from the big bosses in there, but pretty damning that over a decade later these are still issues that it is struggling with."
    },
    {
        "title": "Kneecap should apologise for 'kill your MP' remarks, says murdered MP's daughter",
        "description": "The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\".",
        "url": "https://news.sky.com/story/kneecap-should-apologise-for-kill-your-mp-remarks-says-murdered-mps-daughter-13357465",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-28 09:32:00",
        "Headline": "Kneecap say they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\".",
        "Content": " The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\". Footage of the group at a November 2023 gig appears to show one member saying: \"The only good Tory is a dead Tory. Kill your local MP.\" Sir David was killed at a constituency surgery in 2021. Speaking to the UK Tonight With Sarah-Jane Mee, Katie Amess said: \"I'm more than happy to sit down and speak with them. I'm sure they've never met a victim of such a heinous crime, and so they're not thinking it through. \"If they were to meet with me and to see and to hear the pain and the torture and the torment that I go through every day, I'm sure they would feel terribly guilty. \"And I'm sure that they would apologise, because if not, what kind of people are they?\" Conservative leader Kemi Badenoch has demanded the prosecution of the rap trio Kneecap after the video emerged. Downing Street has described the alleged comments as \"completely unacceptable\". Police are investigating - and are also assessing footage reportedly from a gig a year later in London's Kentish Town Forum. In the November 2024 video, a member of the band appears to shout \"up Hamas, up Hezbollah\" - referencing groups which are banned as terrorist organisations in the UK. A Metropolitan Police spokesman said: \"We were made aware of a video on 22 April, believed to be from an event in November 2024, and it has been referred to the counter-terrorism internet referral unit for assessment and to determine whether any further police investigation may be required. \"We have also been made aware of another video believed to be from an event in November 2023.\" Mrs Badenoch said it was \"good\" the police were looking into the allegations, adding: \"Kneecap's glorification of terrorism and anti-British hatred has no place in our society. \"Now footage shows one of them saying: 'The only good Tory is a dead Tory. Kill your local MP'. \"After the murder of Sir David Amess, this demands prosecution.\" Ms Amess also welcomed the investigation. She told Sky News: \"I wake up every day with the knowledge that I will never see my father again. \"He will never meet my children. He wasn't able to be at my wedding. There's nothing funny about this. \"This is serious, and the government and the police need to take it seriously and to nip this in the bud and stop this kind of rhetoric being tolerated.\" Kneecap, made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In a statement Kneecap said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"We also reject any suggestion that we would seek to incite violence against any MP or individual. Ever. An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action.\" The band added: \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Read more from Sky News:UK temperatures could hit 29C this weekM&S tells agency staff to stay at home Mrs Badenoch and Kneecap are already known to each other. The Tory leader blocked a government grant to the bilingual Belfast group while she was business secretary. But last November, Kneecap won a discrimination challenge over the decision to refuse them a £14,250 funding award after the UK government conceded it was \"unlawful\". Downing Street condemned the alleged comments. \"We do not think individuals expressing those views should be receiving government funding,\" the prime minister's official spokesman said. Asked if the money should be returned, the spokesman added: \"That's up to the group, but clearly the PM rejects the views expressed ... does not shy away from condemning them.\""
    },
    {
        "title": "UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt",
        "description": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House.",
        "url": "https://news.sky.com/story/uk-us-trade-talks-moving-in-a-very-positive-way-says-white-house-spokesperson-karoline-leavitt-13357785",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trump_6887098.jpg?20250415185739",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-28 18:06:00",
        "Headline": "Discussions surrounding a US-UK trade deal have been taking place since Brexit, although they were not prioritised as highly under Joe Biden. Ministers from the UK side have also recently appeared optimistic about the chances of a deal. ",
        "Content": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House. President Donald Trump's press secretary Karoline Leavitt spoke about the likelihood of the long-discussed agreement during a press briefing. In Westminster, there are hopes such a deal could soften the impact of the Trump tariffs announced last month. Leavitt told reporters: \"As for the trade talks, I understand they are moving in a very positive way with the UK. \"I don't want to get ahead of the president or our trade team in how those negotiations are going, but I have heard they have been very positive and productive with the UK.\" She said Mr Trump always \"speaks incredibly highly\" of the UK. \"He has a good relationship with your prime minister, though they disagree on domestic policy issues,\" she added. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  China-US tariff war could be reaching stalemate, but more danger lingers\n                 \"I have witnessed the camaraderie between them first hand in the Oval Office, and there is a deep mutual respect between our two countries that certainly the president upholds.\" Chancellor of the Duchy of Lancaster Pat McFadden gave the UK's position on the talks when speaking to Sunday Morning With Trevor Phillips. He said there was \"a serious level of engagement going on at high levels\" to secure a UK-US trade deal. Mr McFadden is one of the most powerful members of Sir Keir Starmer's government and a key ally of the prime minister. Read more:Deal 'possible' but not certainChancellor lays out redlines for deal He was careful to not get ahead of developments, however, saying: \"I think an agreement is possible - I don't think it's certain, and I don't want to say it's certain, but I think it's possible.\" He went on to say the government wanted an \"agreement in the UK's interests\" and not a \"hasty deal\", amid fears from critics that Number 10 could acquiesce a deal that lowers food standards, for example, or changes certain taxes in a bid to persuade Donald Trump to lower some of the tariffs that have been placed on British goods. Mr McFadden's tone was more cautious than Chancellor Rachel Reeves' last week. She had been in the US and, speaking to Sky News business and economics correspondent Gurpreet Narwan, the chancellor said she was \"confident\" a deal could be done.  But she sought to play down fears that UK standards could be watered down, both on food and online safety. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" Ms Reeves said."
    },
    {
        "title": "End the 'absolute scandal' of new homes built without solar panels, government urged",
        "description": "The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels. ",
        "url": "https://news.sky.com/story/end-the-absolute-scandal-of-new-homes-built-without-solar-panels-government-urged-13357705",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-build-solar-panel_6900006.jpg?20250428171210",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-28 22:59:00",
        "Headline": "Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels.  Doing so would cut both household bills and greenhouse gases that cause climate change, the Local Government Association (LGA) said in a new report. Just four in 10 new homes in England come with solar power, according to separate figures from the industry body Solar Energy UK. Although that is a significant three-fold increase over the space of a year, the LGA said making it mandatory would benefit bill-payers and the climate for years to come, saving people £440 per year. The UK lags behind its neighbours in the European Union, which last year adopted new legislation demanding all new residential buildings come with solar panels from 2030. Greenpeace UK called it an \"absolute scandal that homes are built without rooftop solar panels in this day and age\". Its campaigner, Lily Rose Ellis, said: \"Given the soaring cost of electricity, our desperate need to cut planet-heating emissions, and the relatively low cost of installation to housebuilders, solar panels on all new builds should be mandatory.\" \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 \n                  The good, the bad and the ugly in Donald Trump's coal plans\n                 Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory, as it also courts the house-building industry to help it meet its target to build 1.5 million homes during this parliament.  The LGA wants the government to allocate them long-term funding in the upcoming spending review so they can help the country meet net zero. A spokesperson for the Ministry of Housing, Communities and Local Government said they plan to \"maximise the installation of solar panels on new homes\" in its long-delayed new regulations, the Future Homes Standard, due later this year. The Home Builders Federation said \"Moving forward, to meet the ever more challenging carbon reductions set by government, we will see solar on the overwhelming majority of new homes, albeit it is not appropriate in every situation.\" Pylon rows The push on solar power is part of the government's broader plans to ensure all the UK's electricity comes from green sources by 2030. Electricity demand is also growing as the country switches to electric cars and heating, and builds more data centres. All this requires more wind and solar farms, as well as 1,000 kilometres of new cables to carry the electricity from where it is generated - often a wind farm in the North Sea - to where it is used in urban areas far away. In parts of the country like East Anglia, a row has been simmering over whether to run those cables overhead on pylons or, to protect countryside views, underground. A hefty new report by the Institution of Engineering and Technology today weighed in on the debate, finding underground cables are on average 4.5 times more expensive than overhead lines. Liam Hardy, head of research at thinktank Green Alliance, said: \"Those costs need to go somewhere. They go on to all of our electricity bills. And of course, it's the poorest in society for whom those bills make up a bigger percentage of their income. He added: \"What they want to see is value for money as we build out that clean infrastructure that we need.\" The government has promised communities disrupted by the new infrastructure that they should reap some of the benefits, including giving households near new pylons £2,500 off their energy bills over 10 years."
    },
    {
        "title": "Sex offenders to be denied refugee status under plans to improve women's safety",
        "description": "Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security.",
        "url": "https://news.sky.com/story/sex-offenders-to-be-denied-refugee-status-under-plans-to-improve-womens-safety-13357749",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-border-force-channel_6899979.jpg?20250428164411",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-04-28 16:53:00",
        "Headline": "The government says the proposals will improve safety for women and girls, while clamping down on illegal migration.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security. The Home Office announcement means foreign nationals who are added to the sex offenders register will forfeit their rights to protection under the Refugee Convention. Politics latest: Tory-Reform coalition would be disaster, warns PM As part of the 1951 UN treaty, countries are allowed to refuse asylum to terrorists, war criminals and individuals convicted of a \"particularly serious crime\" - which is currently defined in UK law as an offence carrying a sentence of 12 months or more. The government now plans to extend that definition to include all individuals added to the Sex Offenders' Register, regardless of the length of sentence, in an amendment to the Border Security, Asylum and Immigration Bill, which is currently going through parliament. It's understood they also hope to include those convicted of equivalent crimes overseas. Those affected will still be able to appeal their removal from the UK in the courts under the European Convention on Human Rights (ECHR). It is unclear how many asylum seekers will be affected, as the government has been unable to provide any projections or past data on the number of asylum seekers added to the Sex Offenders' Register. \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 \n                  UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt\n                 \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 Home Secretary Yvette Cooper said: \"Sex offenders who pose a risk to the community should not be allowed to benefit from refugee protections in the UK. \"We are strengthening the law to ensure these appalling crimes are taken seriously.\" Safeguarding and Violence Against Women and Girls Minister Jess Philips said: \"We are determined to achieve our mission of halving violence against women and girls in a decade. \"That's exactly why we are taking action to ensure there are robust safeguards across the system, including by clamping down on foreign criminals who commit heinous crimes like sex offences.\" Read more:PM 'doesn't want to see strike action'Former Streeting aide avoids jail after exposing himself  The Home Office would like voters to see this as a substantial change. But that's hard to demonstrate without providing any indication of the scale of the problem it seeks to solve. Clearly, the government does not want to fan the flames of resentment towards asylum seekers by implying large numbers have been committing sex crimes. But amid rising voter frustration about the government's grip on the issue, and under pressure from Reform - this measure is about signalling it is prepared to take tough action. Conservatives: 'Too little, too late' The Conservatives claim Labour are engaged in \"pre-election posturing\". Chris Philp MP, the shadow home secretary, said: \"This is too little, too late from a Labour government that has scrapped our deterrent and overseen the worst year ever for small boat crossings - with a record 10,000 people crossing this year already. \"Foreign criminals pose a danger to British citizens and must be removed, but so often this is frustrated by spurious legal claims based on human rights claims, not asylum claims.\"  The Home Office has also announced plans to introduce a 24-week target for appeal hearings (known as \"first-tier tribunals\") to be held for rejected asylum seekers living in taxpayer-supported accommodation, or for foreign national offenders. The current average wait is 50 weeks. The idea is to cut the asylum backlog and save taxpayers money - Labour have committed to end the use of asylum hotels by the end of this parliament. It's unclear how exactly this will be achieved, although a number of additional court days have already been announced. The government also plans to crack down on fake immigration lawyers who advise migrants on how to lodge fraudulent asylum claims, with the Immigration Advice Authority given new powers to issue fines of up to £15,000."
    },
    {
        "title": "Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands",
        "description": "Small boat crossings have passed 10,000 in 2025 at the earliest point in a year since records began, Sky News understands.",
        "url": "https://news.sky.com/story/small-boat-crossings-pass-10000-at-earliest-point-in-year-since-records-began-sky-news-understands-13357691",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-channel-dover-kent_6785311.jpg?20241226143228",
        "type": "UK",
        "Author": "Josh Gafson, politics producer, and Tim Baker, political reporter",
        "Date Published": "2025-04-28 15:24:00",
        "Headline": "Sky News analysis shows the milestone has been passed as of 28 April. In the past three years, it took until June for 10,000 people to cross. Data has been collected since 2018 when the crossings first became a popular route of entry to the UK.",
        "Content": "By Josh Gafson, politics producer, and Tim Baker, political reporter  Small boat crossings have passed 10,000 in 2025 at the earliest point in a year since records began, Sky News understands. Analysis of previous Home Office numbers and footage of people arriving today show the number of people crossing the Channel continuing to rise. The issue has become a lodestone for political parties across the spectrum, with Rishi Sunak's pledge to \"Stop The Boats\" falling well short. Politics latest: PM warns of Tory-Reform pact 'disaster' Sir Keir Starmer promised to clear the backlog of asylum applications and \"Smash The Gangs\" of people smugglers upstream, but critics say he has failed to do this almost a year into his stint in Number Ten. Reform's Nigel Farage has made the issue key to his party's pitch to voters. The 10,000 figure is understood to have been passed on 28 April. Official figures only go until 27 April at the time of writing, with 9,885 people detected crossing the Channel by the UK government at this point \n                  Labour's plan for failed asylum seekers shows they're willing to adopt previously unpalatable policies\n                 \n                  Gig economy bosses could face jail time if they fail to check employees can legally work in UK\n                 \n                  Home Office cancels hotel company's contract to house asylum seekers\n                 This compares to 7,167 by the same date in 2024, 5,745 in 2023, 5,352 in 2022, and 1,796 in 2021. Data only started to get collected in 2018, and for the first three years fewer than 1,000 people were observed crossing the Channel before 28 April. Fine weather conditions are known to lead to an increase in people crossing the Channel, with some efforts earlier this year stymied by heavy winds. Sir Keir scrapped the Conservative's Rwanda deportation plan when entering office. In March, the prime minister said his government had \"returned\" 24,000 people who had no right to be in the UK. Read more:Why more people cross on the weekend?Gusty conditions halt small boat crossingsStarmer: 24,000 people returned Chris Philp, the shadow home secretary, said: \"Britain's borders are being torn apart under Labour. This year is already the worst on record for small boat crossings after over 10,000 illegal immigrants arrived in Britain, but Labour just sit on their hands. \"Labour scrapped our deterrent before it even started, flung open the door to extremists and criminals, and handed the bill to hardworking taxpayers. \"Under new Conservative leadership, we are serious about tackling this crisis with deliverable reforms, but Labour continue to block these at every turn. Labour's open-door chaos is a betrayal of the British people, and we will not let them get away with it.\" Mr Philp was part of previous Conservative governments, which also failed to reduce crossings. Speaking to broadcasters, Mr Farage said: \"If this carries on at this rate, by the end of this Labour government another quarter of a million people will have come into this country, many of whom frankly don't fit our culture or cost us a fortune.\" He claimed that Reform is \"the only party\" saying that \"unless you deport those that come illegally, they will just continue to come\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 A Home Office spokesperson said: \"We all want to end dangerous small boat crossings, which threaten lives and undermine our border security. \"The people-smuggling gangs do not care if the vulnerable people they exploit live or die, as long as they pay and we will stop at nothing to dismantle their business models and bring them to justice. \"That is why this government has put together a serious plan to take down these networks at every stage. \"Through international intelligence sharing under our Border Security Command, enhanced enforcement operations in Northern France and tougher legislation in the Border Security and Asylum Bill, we are strengthening international partnerships and boosting our ability to identify, disrupt, and dismantle criminal gangs whilst strengthening the security of our borders.\""
    },
    {
        "title": "Mark Carney's Liberal Party wins Canada election, according to Canadian broadcasters",
        "description": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government.",
        "url": "https://news.sky.com/story/mark-carneys-liberal-party-wins-canada-election-according-to-canadian-broadcasters-13357890",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mark-carney-alberta_6899482.jpg?20250428080325",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 23:35:00",
        "Headline": "However, it is too soon to say whether the Liberals will form a majority government, CBC and CTV News said.",
        "Content": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government. Mr Carney, who took over as prime minister after Justin Trudeau stepped down earlier this year, has beaten the leader of the Conservative Party Pierre Poilievre, according to CBC and CTV News projections. However, it is too soon to say whether the Liberals will form a majority government, they added. The party has not yet secured the 172 electoral districts it needs for a majority. The election initially appeared to be a clear-cut race for the opposition Conservatives, who were enjoying a double-digit lead over the Liberals before Mr Trudeau resigned, and an intervention by Donald Trump led to a surge in support for Mr Carney's party. Mr Trump has repeatedly called for Canada to become the 51st US state since he was elected president for a second time and has imposed sweeping tariffs on Canada.  Mr Carney has vowed to take a tougher approach with Washington over its tariffs and has said Canada will need to spend billions to reduce its reliance on the US. If Mr Carney's party only captures a minority of the House's 343 seats, he will be forced to negotiate with other parties in order to stay in power. Such minority governments rarely last longer than two-and-a-half years in Canada. Canadians went to the polls after 11 people were killed in a deadly attack at a Vancouver street fair over the weekend that led to the suspension of campaigning for several hours. Police have ruled out terrorism and said the suspect is a local man with a history of mental health issues. Mr Carney previously ran Canada's central bank and later became the first non-Briton to become governor of the Bank of England. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Power returning in Spain and Portugal after large parts hit by blackout - but what caused it?",
        "description": "Power supplies have been returning in Spain and Portugal after large parts, including the capitals Madrid and Lisbon, were hit by a huge outage on Monday.",
        "url": "https://news.sky.com/story/power-returning-in-spain-and-portugal-after-large-parts-hit-by-blackout-but-what-caused-it-13357374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-police-car-madrid-traffic-jam_6900320.jpg?20250428233523",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 05:15:00",
        "Headline": "Airports, trains and internet and mobile coverage were among the services affected by the blackout - with traffic lights also down.",
        "Content": " Power supplies have been returning in Spain and Portugal after large parts, including the capitals Madrid and Lisbon, were hit by a huge outage on Monday. Millions of people were caught up in the chaos after the mass blackout brought many areas to a standstill, with trains stopping, planes grounded, internet and mobile phone services cut, traffic lights and ATMs down, and some routine hospital operations suspended. Spain's interior ministry declared a national emergency and the two countries' governments convened emergency cabinet meetings as officials tried to find out what caused the outage which started around 12.30pm (11.30am UK time). Blackouts in Spain and Portugal: Follow latest updates About half the electricity supplies in Spain have now been restored by the grid operator, Prime Minister Pedro Sanchez said on Monday evening, adding the rest should be back by Tuesday. In a televised address, Mr Sanchez said authorities have not yet worked out what had caused the blackout in the Iberian Peninsula and were not ruling anything out. He asked the public to refrain from speculation, and urged people to call emergency services only if really necessary. Eduardo Prieto, the head of operations at Spanish power grid operator Red Electrica, said the event was unprecedented, calling it \"exceptional and extraordinary\". Meanwhile, Portugal's Prime Minister Luis Montenegro said power in his country would be fully restored in the coming hours. He said all the state services remained operating in the country despite all the difficulties. He also said there was \"no indication\" a cyberattack was the cause. Read more: Analysis - How electricity grids fail 'Rare atmospheric phenomenon' Portugal's grid operator Ren claimed the outage was caused by a fault in the Spanish electricity grid, related to a \"rare atmospheric phenomenon\". Ren says that, due to extreme temperature variations in Spain, there were \"anomalous oscillations\" in very high-voltage lines. It also says that given the complexity of the issue, it could take up to a week for the network to fully normalise again. It comes as France briefly lost power following the outages in Spain and Portugal, French grid operator RTE said. Parts of Madrid underground were evacuated and traffic lights in the city were not working, according to local media. Play was suspended at the Madrid Open tennis tournament due to the outage - with Britain's Jacob Fearnley forced off court in a critical moment during his third-round tie with Grigor Dimitrov. The loss of power affected scoreboards and the camera above the court. Organisers later announced the tournament would not be able to resume on Monday, with afternoon and evening sessions cancelled. Here's what we know has been impacted so far: :: Transport, including trains, metros and airports - with traffic lights also down. :: Internet and mobile coverage.\n :: Lighting in homes, businesses and other buildings, though backup generators are in place in many. :: ATMs and card payments, as well as most till systems. :: Lifts in buildings are stuck.\n :: Electric car chargers and fuel pumps are also down. :: Air conditioning units. :: A significant quantity of water pumps, meaning some homes have no access to drinking water. Airports affected Aena, which runs international airports across Spain, said earlier that \"some incidents were occurring\" at the airports due to the outage. The company added in a statement: \"Contingency generators are active. Please check with your airline, as there may be disruptions to access and ground transportation.\" People 'had nowhere to go' Maddie Sephton, who is from west London, was on the Madrid Metro when the power outage occurred. \"We got on the train and everything was fine,\" she told Sky News. \"But then everything went dark.\" She was stuck on the train for 20 minutes until a staff member opened the doors manually. Mrs Sephton says she was on her way to the airport at the time - and had to exit the station by walking up 15 flights of stairs with her luggage. \"No lifts are operating - making it difficult for elderly people with limited mobility,\" she added. Above ground, she said that \"everyone is just standing around and waiting\". Bars were unable to take card payments, cash machines are down, and traffic lights weren't working either. \"I currently don't have any internet service and just €15 in my wallet - I can't withdraw any money from the ATM,\" she added. \"A couple have offered to let us get a ride in their taxi to the airport. Their flight is at 4.30pm so they're pretty relaxed - but my flight back to London is at 3pm and I'm nervous.\" Mrs Sephton said: \"People are just walking but have nowhere to go, and nothing to do.\" Meanwhile, thousands of passengers had to be evacuated after the blackout left the metro service in Barcelona without power. The blackout was also reported to have forced the closure of the city's tram system and rendered some traffic lights there inoperable. It has also impacted medical facilities, with hospitals in Madrid and Catalonia forced to suspend routine medical work. Staff have been able to attend to critical patients using power from backup generators. It comes as Metrovalencia, the urban rail system, encompassing both metro and tram services in Valencia, said traffic in the city was \"disrupted\" due to a \"general power outage in the city\". The outage also hit the Portuguese capital Lisbon and surrounding areas, as well as northern and southern parts of the country. Portugal's government said the incident appeared to stem from problems outside the country, an official told national news agency Lusa. \"It looks like it was a problem with the distribution network, apparently in Spain. It's still being ascertained,\" Cabinet Minister Leitão Amaro was quoted as saying."
    },
    {
        "title": "How electricity grids fail - and why restoring Spain and Portugal's power will be a nightmare",
        "description": "We rarely think about how essential and reliable electricity grids are until they fail.",
        "url": "https://news.sky.com/story/how-electricity-grids-fail-and-why-restoring-spain-and-portugals-power-will-be-a-nightmare-13357727",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-madrid-outage_6900038.jpg?20250428173758",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-28 16:23:00",
        "Headline": "Keeping a grid running is a constant and highly complex balancing act. Gradually restoring one is a huge challenge for engineers. ",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  We rarely think about how essential and reliable electricity grids are until they fail. Now, millions of people across Spain, Portugal and parts of France are likely thinking of little else. While local power cuts are fairly common, what's happened across the Iberian peninsula is something far more extreme.  Much of Spain and Portugal's electricity transmission system collapsed in seconds including in major cities Lisbon, Madrid, Barcelona and Seville. Blackouts latest: 'Rare atmospheric phenomenon' behind outages  It's likely the outage will surpass Europe's largest blackout to date when 56 million people in Italy and Switzerland lost power for up to 12 hours in 2003. The cause of the outage is unclear. Portugal's grid operator has blamed a \"rare atmospheric phenomenon\" that caused \"anomalous oscillations\" in high voltage power lines in Spain. \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Ultra-processed foods could be linked to thousands of UK deaths a year - study\n                 \n                  You wouldn't steal a font: Famous anti-piracy campaign may have used pirated typeface\n                 Spain's grid operator has yet to respond to that or provide an update on the cause. But it's unlikely whatever caused the outage was a single, localised event. A major power line going down can cause a large outage - as it did in 2021, when an interconnector between France and Spain failed leaving a million people without power for a few hours. But it's unlikely to cause a system-wide failure of the kind we're seeing now. However, when things do start to fail on a power grid, they can cascade uncontrollably. Keeping a grid running is a constant and highly complex balancing act. Spain's mains AC electricity supply grid, like ours in the UK, runs at 50Hz. That frequency is based on the speed at which generating hardware such as gas and nuclear turbines spin. If there are sudden fluctuations in power supply or demand - a power station failing or a high voltage power line going down, for example - the frequency of AC power in the transmission lines changes and circuit breakers trip to protect either the transmission network, or power plant hardware from burning out. To prevent such failures, grid engineers constantly measure and forecast supply and demand to keep the grid balanced. More from Sky News:The 3G switch-off explained Just Stop Oil holds final protest To protect the system in emergencies, they occasionally have to \"shed load\" by cutting power to parts of the grid - the reason we've all experienced the occasional short-lived power cut. But if balance is lost, a grid can fail in a domino effect with sections of the grid tripping, then power plants shutting down to protect themselves from the drop in demand, one after another. The challenge now, and it's a nightmare for Spain and Portugal's power engineers, is to gradually restore the grid section by section while maintaining the balance of supply and demand. Act too fast, and the grid can trip again. Take too long and some power plants or substations might struggle to restart - especially if they rely on battery power to do so. While some regions of Spain have already had power restored, and Portugal says its power will be back to normal within hours, it could take much longer for the system to be fully restored."
    },
    {
        "title": "Israel is 'starving, killing and displacing' Gaza civilians, Palestinian envoy tells UN court ",
        "description": "A Palestinian diplomat has told the United Nations' top court that Israel is \"starving, killing and displacing\" civilians and targeting aid workers in Gaza.",
        "url": "https://news.sky.com/story/israel-is-starving-killing-and-displacing-gaza-civilians-palestinian-envoy-tells-un-court-13357493",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-child_6899797.jpg?20250428132404",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 10:16:00",
        "Headline": "Israel denies deliberately targeting civilians and aid staff and did not attend the hearing at the International Court of Justice on Monday.",
        "Content": "A Palestinian diplomat has told the United Nations' top court that Israel is \"starving, killing and displacing\" civilians and targeting aid workers in Gaza. Israel denies deliberately targeting civilians and aid staff and did not attend the hearing at the International Court of Justice (ICJ) on Monday. At The Hague, Palestinian ambassador to the Netherlands, Ammar Hijazi, accused Israel of breaching international law in the occupied territories. He said: \"Israel is starving, killing and displacing Palestinians while also targeting and blocking humanitarian organisations trying to save their lives.\" The hearings are focused on a request last year from the UN General Assembly, which asked the court to weigh in on Israel's legal responsibilities after the country blocked the United Nations Relief and Works Agency (UNRWA) for Palestine refugees from operating on its territory. In a resolution sponsored by Norway, the General Assembly requested an advisory opinion, a non-binding but legally important decision from the court, on Israel's obligations in the occupied territories to \"ensure and facilitate the unhindered provision of urgently needed supplies essential to the survival of the Palestinian civilian population\". While Israel was not in court, foreign minister Gideon Saar told a news conference in Jerusalem: \"I accuse UNRWA, I accuse the UN, I accuse the secretary-general and I accuse all those that weaponised international law and its institutions in order to deprive the most attacked country in the world, Israel, of its most basic right to defend itself.\" \n                  Israeli official says claims IDF targets aid workers are 'blood libel' after UK minister calls for investigation\n                 \n                  World Food Programme stocks in Gaza have run out under Israel's blockade, UN agency says\n                 \n                  IDF admits responsibility for deadly attack on UN building last month\n                 Forty states and four international organisations are scheduled to participate in the ICJ hearings, with it likely taking months for the court to rule. The hearings come amid the near collapse of the humanitarian aid system in Gaza. Israel has blocked the entry of food, fuel, medicine and other humanitarian supplies since 2 March. The World Food Programme said last week its food stocks in the Gaza Strip had run out. Israel also renewed its bombardment on 18 March, breaking a ceasefire, and seized large parts of the territory, claiming it aims to push Hamas to release more hostages. Overnight into Monday, at least 27 Palestinians were killed in Israeli strikes, according to local health officials. An air strike hit a home in Beit Lahia, killing 10 people, including a Palestinian prisoner, Abdel-Fattah Abu Mahadi, who had been released as part of the ceasefire. His wife, two of their children and a grandchild were also killed, according to Indonesia Hospital which received the bodies. Another strike hit a home in Gaza City, killing seven people, according to the Gaza Health Ministry's emergency service. And late on Sunday, a strike hit a home in the southern city of Khan Younis, killing at least 10 people, including five siblings as young as four-years-old, according to the health ministry. Two other children were killed along with their parents, according to Nasser Hospital which received the bodies. There was no immediate comment from the Israeli military. Israel claims it makes every effort to avoid harming civilians and blames Hamas for their deaths because the militants operate in densely populated areas.  Read more:Israeli troops shot at Gaza aid workers from 'point-blank range'Israeli official says claims IDF targets aid workers are 'blood libel' Israel's ban on UNRWA came into effect in January. The organisation has faced increased criticism from Prime Minister Benjamin Netanyahu and his far-right allies, who claim the group is deeply infiltrated by Hamas, which UNRWA refutes. Amir Weissbrod, a foreign ministry official, presented Israel's case against UNRWA on Monday. He accused it of failing to act before the war against evidence that Hamas had used its facilities, including by digging tunnels underneath them. The official said UNRWA employed 1,400 Palestinians with militant ties. Israel claims some of those employees also took part in Hamas' attacks on 7 October 2023, with at least three of those employees still allegedly working for the UN. The presentation included videos, documents and pictures of the alleged employees. The 7 October 2023 attack in southern Israel killed around 1,200 people and prompted the ongoing Israeli offensive in Gaza - which the territory's health ministry says has killed more than 52,000 people. UNRWA said it fired nine staffers after an internal UN investigation concluded that they could have been involved, although the evidence was not authenticated and corroborated. The ban does not apply directly to Gaza, but UNRWA is prohibited from operating inside Israel which affects the agency's ability to function. Israeli officials claim they are looking for alternative ways to deliver aid to Gaza that would cut out the UN."
    },
    {
        "title": "Sistine Chapel to close ahead of conclave: Here's how it's preparing for gathering of cardinals",
        "description": "Work to prepare the Sistine Chapel for the gathering of the cardinals to elect a new pope has begun.",
        "url": "https://news.sky.com/story/sistine-chapel-to-close-ahead-of-conclave-heres-how-its-preparing-for-gathering-of-cardinals-13357654",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sistine-chapel-pope_6899807.jpg?20250428133212",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 14:16:00",
        "Headline": "Millions visit the Sistine Chapel every year - making it the second most visited museum in the world - but it will now transform into a place for the secretive process to elect the successor to Pope Francis.",
        "Content": "Work to prepare the Sistine Chapel for the gathering of the cardinals to elect a new pope has begun. The building in Vatican City is the second most visited museum in the world and will become the focus of the 1.4 billion-strong Catholic Church as it chooses a successor to Pope Francis. The Vatican has confirmed the conclave to elect a new pope will take place on 7 May. What work is being carried out? The main task is the installation of the chimney where ballots will be burned after votes have been made. The cardinals will use smoke to signal to the world whether the round of voting has been decisive or not. Black smoke will indicate no decision, but white will confirm a new pope has been elected. Catholics traditionally gather in St Peter's Square to watch for the smoke above the chapel. What does it mean for tourists? Many visitors to the surrounding city of Rome plan time to view the famous chapel at Vatican City - the world's smallest independent state - with a high number of trips scheduled well in advance. But for those heading there now, they will be unable to visit. \"Notice is hereby given that the Sistine Chapel will be closed to the public from Monday 28 April 2025 for the requirements of the Conclave,\" reads a statement on the Vatican Museums' website. Nearly seven million people are said to have visited the chapel in 2023 with many travelling across the world to view the paintings and structure. But viewings will not be possible until after the election of a new pope. Tours of the archaeological area, the Necropolis of the Via Triumphalis, and the Vatican Gardens have also been suspended. When was the chapel first used for a conclave? This was after the death of Pope Sixtus IV in 1484, who had been the pontiff since 1471 and after whom the building takes its name. A number of conclaves have been held elsewhere, including several in the 19th century at the Quirinal Palace in Rome, which is formerly a summer palace for the popes and currently the official residence of the Italian president. The Sistine Chapel has been the site of all conclaves since 1878. What art and detail can be seen at the chapel? The cardinals will be surrounded by the great beauty of the frescoes painted by Michelangelo and other renowned Renaissance artists. The most recognisable is Michelangelo's Creation Of Adam, showing God's outstretched hand imparting the divine spark of life to the first man. Pope Sixtus IV was an art patron who oversaw the construction and restoration of the main papal chapel - originally called the Cappella Magna - in the 15th century. But it was a later pontiff, Julius II, who commissioned the works by Michelangelo. The Italian sculptor and painter created the ceiling art depicting scenes from Genesis from 1508 and 1512, and then later returned to paint the Last Judgement on one of the walls before it was unveiled in 1541. The side walls are decorated by other artists, including Pietro Perugino, Sandro Botticelli and Domenico Ghirlandaio. German writer Johann Wolfgang von Goethe once remarked: \"Without having seen the Sistine Chapel, one can form no appreciable idea of what one man is capable of achieving.\" Read more:British cardinal who will be in the conclavePope Francis was 'one of our easiest customers'How accurate is Conclave the film?Pictures of Pope Francis's tomb released   The chapel's dimensions and thick doors The cardinals will spend time electing a new pope in a chapel which is 40m (131ft) long, 13m (43ft) wide and 21m (69ft) high. It is lit on either side by high windows. Built from 1473 to 1481, the chapel has thick double doors that will ensure the cardinals are not interrupted. The surroundings are as much a key part of the secretive process aimed at shielding the vote from external interference."
    },
    {
        "title": "Number killed in Iran explosion rises to 65 after Tehran denied blast was 'linked to fuel for missiles'",
        "description": "The number of people killed in an explosion at Iran's biggest container port has risen to 65, with over 1,200 injured, according to state media.",
        "url": "https://news.sky.com/story/number-killed-in-iran-explosion-rises-to-65-after-tehran-denied-blast-was-linked-to-fuel-for-missiles-13356888",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-explosion-port_6900112.jpg?20250428184843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 18:05:00",
        "Headline": "Goods inside containers were badly damaged and the explosion was so powerful that windows several miles away were shattered, reports said.",
        "Content": "The number of people killed in an explosion at Iran's biggest container port has risen to 65, with over 1,200 injured, according to state media. The blast, at the Shahid Rajaei container hub near the southern city of Bandar Abbas, happened on Saturday as Iran held a third round of talks with the US in Oman about Tehran's nuclear programme. Shipping containers burned, goods inside were badly damaged and the explosion was so powerful that windows several miles away were shattered, reports said.  Helicopters and aircraft dumped water from the air on the blaze and it has now been put out, Iran's interior minister Eskandar Momeni announced on Monday. The updated death toll comes as a new satellite image reveals the scale of the explosion. The blast disintegrated a building next to the blast site and shredded most of another building to the west. The new image also appears to show two craters measuring some 50 metres across. Port activities resumed in unaffected parts of Shahid Rajaei on Sunday, authorities said. But Iran's state media warned on Monday it could take two weeks to remove containers damaged by the explosion. \n                  Eighteen dead and more than 700 injured after chemical explosion at Iran's largest port\n                 \n                  Women in Iran increasingly deciding not to wear headscarves in public\n                 \n                  Inside Iran special - how close is a nuclear deal?\n                 Chemicals at the port were suspected to have worsened the blast, but the exact cause of the explosion was not clear. Iran's defence ministry denied international media reports that the explosion may be connected to the mishandling of solid fuel used for missiles. The reports were \"aligned with enemy psyops [psychological operations]\", according to a ministry spokesperson, who told state TV the blast-hit area did not contain any military cargo. Read more:Spain and Portugal hit by widespread power outages How the new pope will be selected According to the Associated Press, British security company Ambrey said that the port in March received sodium perchlorate, which is used to propel ballistic missiles and the mishandling of which could have led to the explosion. The Financial Times previously reported two Iranian vessels had shipped from China enough of the ingredient to propel up to 260 mid-range missiles. It was reportedly to help Tehran replenish stocks after its missile attacks on Israel in 2024. Iran's military has sought to deny the delivery of sodium perchlorate from China. Iran's state-run Irna news agency reported on Sunday that Russian President Vladimir Putin deployed several emergency aircraft to Bandar Abbas to provide help."
    },
    {
        "title": "Kim Kardashian to testify in Paris armed robbery trial as proceedings get under way",
        "description": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week.",
        "url": "https://news.sky.com/story/kim-kardashian-to-testify-in-paris-armed-robbery-trial-as-proceedings-get-under-way-13357617",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-kardashian-kardashians_6899885.jpg?20250428144207",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 13:36:00",
        "Headline": "The reality star turned business mogul is expected to testify in person at the Palais de Justice next month.",
        "Content": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week. The reality star turned business mogul was targeted during the early hours of 3 October 2016 while staying at the Hotel de Pourtales. Kardashian is expected to testify in person at the Palais de Justice on 13 May. Her lawyers said: \"Ms Kardashian is reserving her testimony for the court and jury and does not wish to elaborate further at this time. \"She has great respect and admiration for the French justice system and has been treated with great respect by the French authorities.\" Kim Kardashian's Paris robbery trial: Everything you need to know  The trial began with the selection of the jury of six citizens who will conduct the trial along with three magistrates - a procedure in France reserved for the most serious crimes. \n                  Kim Kardashian's Paris robbery trial: Everything you need to know\n                 \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 \n                  Kim Kardashian visits Lyle and Erik Menendez in jail amid controversy over Netflix show\n                 There were initially 12 defendants in the case, but one person has since died and another has a medical condition that prevents their involvement. Ten people - nine men and one woman - are currently standing trial. Five of the suspects - Yunice Abbas, Aomar Ait Khedache, Harminv Ait Khedache, Didier Dubreucq and Marc-Alexandre Boyer - are facing armed robbery and kidnapping charges. The remaining five defendants - Gary Madar, Christiane Glotin, Francois Delaporte and Marc Boyer - are charged with complicity in the heist or the unauthorised possession of a weapon. Two have acknowledged their participation. The others have denied it. The group has been nicknamed \"the grandpa robbers\" in local media, owing to some of them being in their 60s and 70s. The court heard how Kardashian told investigators she was taken to a bathroom and placed in the bathtub. Her attackers fled on bicycles or on foot, and she freed herself by removing the tape. She then rushed to her stylist's room and called her sister Kourtney. Kardashian told investigators that she had not been injured. She filed a complaint, adding that she wanted to leave France as soon as possible to be reunited with her children. According to her testimony and that of the concierge, Abderrahmane Ouatiki, at least one suspect had a handgun with which he threatened the victims. Lawyer Henri de Beauregard, representing Mr Ouatiki, said the intruders \"were experienced, determined criminals who did not hesitate to threaten him while he was working nights to finance his studies\". The robbers stole many pieces of jewellery estimated to be worth $6m, including Kardashian's engagement ring. Only one piece - a diamond cross on platinum that was lost during the suspects' escape - has been recovered. Two of the accused have partially confessed to the crime as their DNA was found at the scene. Aomar Ait Khedache, 68, is one of two who allegedly entered the apartment. Nicknamed \"Old Omar,\" his genetic profile was found on the tape used to gag Kardashian. Khedache's lawyer, Franck Berton, said his client was pleading guilty because he acknowledges his participation and \"will apologise, will actually explain how it happened, how he was contacted and finally how the events unfolded\". Khedache, who is deaf, will answer the court's questions in writing. He is said to have left the hotel on a bicycle, as did two others, then reportedly met his son, who was allegedly waiting for him in a parked car at a nearby train station. Yunice Abbas, 71, admitted tying up the concierge but denied going into Kardashian's apartment. He said he acted as a lookout in the ground floor reception area, making sure the escape route was clear. Gabriel Dumenil, Abbas' lawyer, said his client aims to \"deliver his own truth and explain the reasons that prompted him to do this and simply perhaps also ask for forgiveness and express his remorse\". Abbas was arrested in January 2017 and spent 21 months in prison before being released under judicial supervision. In 2021, he co-authored a French-language book titled \"I Kidnapped Kim Kardashian\". Didier Dubreucq, 69, known as \"Blue Eyes\", is the second alleged robber suspected of entering the apartment. He denies involvement, although he was filmed by CCTV cameras, and numerous telephone contacts with the other co-defendants show his involvement, according to the investigators. The other defendants are suspected of providing information about Kardashian's presence in the property or accused of playing a role in the reset of the jewellery in Antwerp, Belgium."
    },
    {
        "title": "What impact is the blackout in Spain and Portugal having and how long will it last?",
        "description": "An \"exceptional and extraordinary\" power outage has brought large parts of Portugal and Spain to a standstill.&#160;",
        "url": "https://news.sky.com/story/what-impact-is-the-blackout-in-spain-and-portugal-having-and-how-long-will-it-last-13357656",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lisbon-airport-power-outage_6899986.jpg?20250428164747",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-28 14:22:00",
        "Headline": "Public transport services, internet connectivity and ATM machines across the Iberian Peninsula, an area home to 50 million people, have been affected by the outage.",
        "Content": " An \"exceptional and extraordinary\" power outage has brought large parts of Portugal and Spain to a standstill.  Public transport services, internet connectivity and ATM machines across the Iberian Peninsula, an area home to 50 million people, have been affected by the outage, which occurred suddenly just after midday local time (11.30am UK time). Blackouts latest: Follow live updates Work is ongoing to try and restore power to affected parts of the two nations - including the capitals of Madrid and Lisbon - with Portugal's grid operator warning it could take up to a week for the network to fully normalise again. Here is everything you need to know. What has been affected and where? Huge swathes of Spain and Portugal, including major cities like Barcelona, Lisbon, Madrid, Porto and Seville have been affected by the power outage. Parts of the Basque region in France were also briefly affected. As traffic lights stopped working, traffic began to pile up on roads. In Barcelona, civilians worked to direct traffic at junctions along the Gran Via avenue, a road that cuts through the city. Spain's traffic authority, DGT, then urged citizens to not use their cars unless absolutely necessary. A similar situation occurred on the railways. Train services in both countries ground to a halt, with Spanish television showing people evacuating from metro stations in Madrid and empty stations with trains stopped in Barcelona. Maddie Sephton, who is from west London, was on the Madrid Metro when the power outage occurred. She told Sky News \"everything went dark\" on the train and she had to exit the station by hiking up 15 flights of stairs with her luggage. \"No lifts are operating - making it difficult for elderly people with limited mobility,\" she added. Above ground, she said that \"everyone is just standing around and waiting\". Passengers at airports in Lisbon, Madrid and Barcelona are also facing disruption. Spanish airports were operating on backup electrical systems and some flights were delayed, according to Aena, the company that runs 56 airports in Spain. While in Lisbon, terminals closed and crowds of tourists sat outside in the sun and the shade waiting for news about their flights. The power outage occurred as three matches were ongoing at the Madrid Open. The Spanish parliament in Madrid has since closed play and suspended the tournament. US tennis star Coco Gauff was in the middle of a post-match interview when the power cut happened. The 2023 US Open champion later posted on an Instagram showing only emergency lighting working in a locker room.  Other things that have been affected include:• Internet and mobile coverage;• Lighting in homes, businesses and other buildings, though backup generators are in place in many;• ATMs and card payment machines, as well as most till systems;• Lifts in buildings• Electric car chargers and fuel pumps;• Air conditioning units;• Several Spanish oil refineries;• A large quantity of water pumps, meaning some homes have no access to drinking water. What caused the outage? No official cause of the blackout is yet to be determined, but Portugal's grid operator REN has said it was down to a fault in the Spanish electricity grid, related to a \"rare atmospheric phenomenon\". REN said due to extreme temperature variations in Spain, there were \"anomalous oscillations\" in very high-voltage lines. The operator said this is known as \"induced atmospheric variation\", which in turn led to oscillations which caused synchronisation failures between systems. In turn, that led to successive disturbances across the interconnected European network. This claim has not been confirmed by Spain's grid operator, and Spanish Prime Minister Pedro Sanchez said there was no conclusive information yet on the cause. The Portuguese National Cybersecurity Centre also issued a statement to say there was no sign the outage was due to a cyberattack. How long will blackouts last? Spanish power distributor Red Electrica said that restoring power fully to the country and neighbouring Portugal could take six to 10 hours. By mid-afternoon, the operator said substations had been restored in parts of the north, south and west. Eduardo Prieto, head of operations at Red Electrica, called the unprecedented event \"exceptional and extraordinary\". In Portugal, power distributor E-Redes initially said it could take up to a week for the network to fully normalise again, but the country's prime minister, Luis Montenegro, said he had spoken several times to Spanish Prime Minister Pedro Sanchez, and expected power to be restored by the end of the day. Governments in both countries arranged emergency meetings to discuss efforts to restore grid operations.  A grid operator's 'worst nightmare' Sky News' science and technology editor, Tom Clarke, said the blackout is \"about a grid operator's worst nightmare\", but it could have been worse. \"They still have half up [the grid] up and running,\" Clarke said, adding: \"This is crucial as it means they have got power to put back onto the grid to help restore the balance. \"It is not a 'black start', which is the real nightmare. This is where you have no power at all, even to get your power stations running again.\" Clarke explained that getting power back into the grid is \"no easy feat\" due to it running at alternating current that runs at a specific frequency. \"If this [the current] drops even a few hertz below a certain frequency, things start to go wrong and start to trip,\" he said. \"The reason why the frequency might fall or rise is if there is a sudden fall or rise in demand or supply of power. \"What power operators will be doing in this scenario is very carefully switching on small components of the grid, bit-by-bit. This involves making phone calls to controllers and engineers and very gradually getting bits of the grid back up and running. And this can take hours.\""
    },
    {
        "title": "Mark Carney's Liberal Party wins Canada election, according to Canadian broadcasters",
        "description": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government.",
        "url": "https://news.sky.com/story/mark-carneys-liberal-party-wins-canada-election-according-to-canadian-broadcasters-13357890",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mark-carney-alberta_6899482.jpg?20250428080325",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-28 23:35:00",
        "Headline": "However, it is too soon to say whether the Liberals will form a majority government, CBC and CTV News said.",
        "Content": "Mark Carney's Liberal Party has won the election in Canada, according to Canadian broadcasters, but it is too soon to say whether they will form a majority government. Mr Carney, who took over as prime minister after Justin Trudeau stepped down earlier this year, has beaten the leader of the Conservative Party Pierre Poilievre, according to CBC and CTV News projections. However, it is too soon to say whether the Liberals will form a majority government, they added. The party has not yet secured the 172 electoral districts it needs for a majority. The election initially appeared to be a clear-cut race for the opposition Conservatives, who were enjoying a double-digit lead over the Liberals before Mr Trudeau resigned, and an intervention by Donald Trump led to a surge in support for Mr Carney's party. Mr Trump has repeatedly called for Canada to become the 51st US state since he was elected president for a second time and has imposed sweeping tariffs on Canada.  Mr Carney has vowed to take a tougher approach with Washington over its tariffs and has said Canada will need to spend billions to reduce its reliance on the US. If Mr Carney's party only captures a minority of the House's 343 seats, he will be forced to negotiate with other parties in order to stay in power. Such minority governments rarely last longer than two-and-a-half years in Canada. Canadians went to the polls after 11 people were killed in a deadly attack at a Vancouver street fair over the weekend that led to the suspension of campaigning for several hours. Police have ruled out terrorism and said the suspect is a local man with a history of mental health issues. Mr Carney previously ran Canada's central bank and later became the first non-Briton to become governor of the Bank of England. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Boat crashes into ferry in Florida - one dead and multiple injured as 'mass casualty incident' declared ",
        "description": "One person has died and multiple others have been injured after a boat crashed into a ferry in Florida, in what firefighters have described as a \"mass casualty incident\".",
        "url": "https://news.sky.com/story/one-dead-and-multiple-injured-after-boat-crashes-into-ferry-in-florida-13357348",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ferry-clearwater_6899504.jpg?20250428083750",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-28 02:43:00",
        "Headline": "The boat that crashed into the ferry fled the scene, authorities say, with the collision happening at the end of the 17-day Sugar Sand Festival held on Clearwater beach. ",
        "Content": "One person has died and multiple others have been injured after a boat crashed into a ferry in Florida, in what firefighters have described as a \"mass casualty incident\". The boat that crashed into the ferry fled the scene, authorities said, following the collision near the Memorial Causeway Bridge in Clearwater at about 8.30pm local time on Sunday. All the casualties were on the ferry, which was carrying 45 people including two crew members. Six patients were \"declared as trauma alerts\" including two with serious injuries who were airlifted to hospital, the City of Clearwater said on X. The Clearwater Fire Department declared the crash a \"mass casualty incident\" because of the number and severity of injuries. The ferry came to rest on a sandbar just south of the bridge and there is not thought to be anyone missing. \"The boat that fled the scene has been identified by another law enforcement agency,\" the City of Clearwater said. \n                  Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport\n                 \n                  Two dead and five injured in shooting at Florida university\n                 \n                  Florida elementary school principal charged over house party at her home \n                 \"The Florida Fish and Wildlife Conservation Commission will be taking the lead on the crash investigation.\" The collision happened at the end of the 17-day Sugar Sand Festival, held on Clearwater beach. Videos posted on social media showed several emergency workers rushing to the scene with lights flashing. Police had earlier cautioned drivers to avoid Memorial Causeway."
    },
    {
        "title": "Trump says death of Virginia Giuffre, who accused Prince Andrew of sexual assault, is 'a horrible thing'",
        "description": "Donald Trump has said the death of Virginia&#160;Giuffre, who accused Prince Andrew of sexual assault, is \"a horrible thing\".",
        "url": "https://news.sky.com/story/trump-says-death-of-virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-is-a-horrible-thing-13357433",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-giuffre-jeffery-epstein_6872288.jpg?20250331160500",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-28 08:31:00",
        "Headline": "Virginia Giuffre's family said the 41-year-old, who had become an advocate for survivors of sex trafficking, died at her farm in Australia last week.",
        "Content": "Donald Trump has said the death of Virginia Giuffre, who accused Prince Andrew of sexual assault, is \"a horrible thing\". Her family said Ms Giuffre \"lost her life to suicide\" at her farm in Western Australia on Friday, aged 41. And responding to a reporter's question at a New Jersey airport, the US president said: \"That whole situation is very sad - her and others. \"Certainly, that's a horrible thing.\" On Monday, a Western Australia Police spokeswoman confirmed Ms Giuffre's death was still under investigation, but did not appear to be suspicious. Ms Giuffre sued the Duke of York for sexual abuse in August 2021. The duke has repeatedly denied the claims and has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Prince Andrew had reached an out-of-court settlement. American-born Ms Giuffre was one of the most outspoken accusers of convicted sex offenders Jeffrey Epstein and his former girlfriend Ghislaine Maxwell. She became an advocate for survivors of sex trafficking after emerging as a central figure in the prolonged downfall of Epstein, who was a financier.  In subsequent civil lawsuits, Ms Giuffre said she was a spa attendant as a teenager at Mar-a-Lago - Mr Trump's Palm Beach club - when she was approached in 2000 by Maxwell. Ms Giuffre was hired as a masseuse for Epstein and was flown around the world for meetings with men at his behest while she was 17 and 18. Maxwell, the British socialite, was convicted in 2021 on federal sex trafficking and conspiracy charges and was sentenced to 20 years in prison. Ms Giuffre alleged she was trafficked to Prince Andrew when she was 17, a claim he has denied. Her family said in a statement that Ms Giuffre was a \"fierce warrior in the fight against sexual abuse\" but that the \"toll of abuse… became unbearable\". :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Donald Trump's immigration crackdown has changed lives",
        "description": "On the campaign trail Donald Trump promised the biggest mass deportation operation in history, railing against illegal immigration and pledging a crackdown on numbers of people crossing the southern border.",
        "url": "https://news.sky.com/story/donald-trumps-immigration-crackdown-has-changed-lives-13357837",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-border-ysidro-california_6900254.jpg?20250428214907",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-04-28 20:17:00",
        "Headline": "The current situation at the southern border can be viewed as a PR victory for the White House. But even on this signature issue of immigration, one of his biggest strengths, President Trump's approval ratings are declining.",
        "Content": "\n          US correspondent\n              @marthakelner\n  On the campaign trail Donald Trump promised the biggest mass deportation operation in history, railing against illegal immigration and pledging a crackdown on numbers of people crossing the southern border. Immigrant communities across America were braced for the impact of his second term but few could have predicted the speed and ferocity with which new policies have been enacted in Trump's first 100 days. \"I did not expect the administration to be as sophisticated and effective in intimidating millions of people,\" says Adriana Jasso, who works for a Quaker charity which supports immigrants. American Friends Service Committee used to hand out bottles of water, food and other supplies to immigrants attempting to cross into the United States at the border in San Ysidro, California, the country's biggest port of entry. Hundreds of people would be sandwiched between the huge metal fences, with Mexico on one side and the US on the other, waiting to be processed. Many would be at the end of months-long journeys that were often fraught with danger and would be desperate to contact family and friends at their point of origin. Dozens of hands would poke through gaps in the metal slats, holding out their phones, asking anyone to help charge them. \n                  Trump says death of Virginia Giuffre, who accused Prince Andrew of sexual assault, is 'a horrible thing'\n                 \n                  More than 100 immigrants detained at illegal after-hours nightclub in Colorado\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 But just a few months into Donald Trump's second term, a leftover white marquee tent is the only evidence of the charities that used to operate here and the immigrants they supported. Adriana Jasso says her organisation has not seen anyone other than border patrol or construction workers there since mid-February. Additional barbed wire has been added to the fence and a building project is under way to reinforce the metal slats. A helicopter flies overhead, monitoring the perimeter, and a border patrol agent on a quad bike approaches our camera crew asking if we have permission to be at the border. Numbers of immigrants trying to cross into the United States without authorisation had been declining towards the end of the Biden administration but have fallen sharply again since Trump took office. Millions of people voted for Trump, motivated primarily by immigration, and the current situation at the southern border can be viewed as a PR victory for the White House. But even on this signature issue of immigration, one of his biggest strengths, President Trump's approval ratings are declining. Some view him as having gone too far in his efforts to boost deportation numbers. Voters are divided on his strategy of deporting Venezuelan men, who the White House claims are gang members, to a notorious El Salvador prison.  The high-profile case of Kilmar Abrego Garcia, who the White House admitted was deported to El Salvador in an \"administrative error\" but has not been returned, was a low point. Immigration advocacy groups have also highlighted cases of children who are US citizens being deported with their mothers, who the administration says are in the country illegally. President Trump wasted no time enacting his immigration policy. On inauguration day, he declared a national emergency at the southern border, effectively ending all asylum applications within 13 minutes of becoming president. Sky News was filming inside a migrant shelter in Piedras Negras, a town on the Mexican side of the border from Texas, on Trump's first day. We met Ericka Mendoza, a Guatemalan woman, who was in tears as she explained receiving an email cancelling a long-awaited appointment with immigration officials, which she hoped would lead to her being granted asylum.  One hundred days later, Mendoza has just moved out of that migrant shelter because she could no longer afford the few dollars a day it costs to stay there. But she remains in Piedras Negras, in the hope the president will change his mind and reopen asylum applications. She is working during the day at a butcher shop \"washing rags, sweeping, keeping everything tidy,\" and at night in a parking garage. Her two sons, aged 10 and 12, are not currently in school and she worries about their education. She says there are far fewer migrants in the town now and she believes some have tried to cross illegally over the Rio Grande river. \"A lot of people here, when they saw that the application was shut down, that no appointments were being given and those already scheduled were cancelled, they went with coyotes, smugglers,\" she says. \"They charge between $7,000 dollars to $10,000.\" Mendoza begins to cry as she contemplates the future. She says she cannot return to Guatemala because she is a victim of domestic violence and her abuser has threatened her safety. \"I don't know what I'm going to do,\" she says. \"Not being from this country, people sometimes deny you work. They close the doors. I don't see opportunities here. I try not to think about it because I don't even have anywhere to go. All my hopes collapsed in a moment.\" With the flick of a pen, Donald Trump likely changed the course of Ericka Mendoza's life and so many others, both inside and outside the United States.  "
    },
    {
        "title": "Kim Kardashian to testify in Paris armed robbery trial as proceedings get under way",
        "description": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week.",
        "url": "https://news.sky.com/story/kim-kardashian-to-testify-in-paris-armed-robbery-trial-as-proceedings-get-under-way-13357617",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-kardashian-kardashians_6899885.jpg?20250428144207",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-28 13:36:00",
        "Headline": "The reality star turned business mogul is expected to testify in person at the Palais de Justice next month.",
        "Content": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week. The reality star turned business mogul was targeted during the early hours of 3 October 2016 while staying at the Hotel de Pourtales. Kardashian is expected to testify in person at the Palais de Justice on 13 May. Her lawyers said: \"Ms Kardashian is reserving her testimony for the court and jury and does not wish to elaborate further at this time. \"She has great respect and admiration for the French justice system and has been treated with great respect by the French authorities.\" Kim Kardashian's Paris robbery trial: Everything you need to know  The trial began with the selection of the jury of six citizens who will conduct the trial along with three magistrates - a procedure in France reserved for the most serious crimes. \n                  Kim Kardashian's Paris robbery trial: Everything you need to know\n                 \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 \n                  Kim Kardashian visits Lyle and Erik Menendez in jail amid controversy over Netflix show\n                 There were initially 12 defendants in the case, but one person has since died and another has a medical condition that prevents their involvement. Ten people - nine men and one woman - are currently standing trial. Five of the suspects - Yunice Abbas, Aomar Ait Khedache, Harminv Ait Khedache, Didier Dubreucq and Marc-Alexandre Boyer - are facing armed robbery and kidnapping charges. The remaining five defendants - Gary Madar, Christiane Glotin, Francois Delaporte and Marc Boyer - are charged with complicity in the heist or the unauthorised possession of a weapon. Two have acknowledged their participation. The others have denied it. The group has been nicknamed \"the grandpa robbers\" in local media, owing to some of them being in their 60s and 70s. The court heard how Kardashian told investigators she was taken to a bathroom and placed in the bathtub. Her attackers fled on bicycles or on foot, and she freed herself by removing the tape. She then rushed to her stylist's room and called her sister Kourtney. Kardashian told investigators that she had not been injured. She filed a complaint, adding that she wanted to leave France as soon as possible to be reunited with her children. According to her testimony and that of the concierge, Abderrahmane Ouatiki, at least one suspect had a handgun with which he threatened the victims. Lawyer Henri de Beauregard, representing Mr Ouatiki, said the intruders \"were experienced, determined criminals who did not hesitate to threaten him while he was working nights to finance his studies\". The robbers stole many pieces of jewellery estimated to be worth $6m, including Kardashian's engagement ring. Only one piece - a diamond cross on platinum that was lost during the suspects' escape - has been recovered. Two of the accused have partially confessed to the crime as their DNA was found at the scene. Aomar Ait Khedache, 68, is one of two who allegedly entered the apartment. Nicknamed \"Old Omar,\" his genetic profile was found on the tape used to gag Kardashian. Khedache's lawyer, Franck Berton, said his client was pleading guilty because he acknowledges his participation and \"will apologise, will actually explain how it happened, how he was contacted and finally how the events unfolded\". Khedache, who is deaf, will answer the court's questions in writing. He is said to have left the hotel on a bicycle, as did two others, then reportedly met his son, who was allegedly waiting for him in a parked car at a nearby train station. Yunice Abbas, 71, admitted tying up the concierge but denied going into Kardashian's apartment. He said he acted as a lookout in the ground floor reception area, making sure the escape route was clear. Gabriel Dumenil, Abbas' lawyer, said his client aims to \"deliver his own truth and explain the reasons that prompted him to do this and simply perhaps also ask for forgiveness and express his remorse\". Abbas was arrested in January 2017 and spent 21 months in prison before being released under judicial supervision. In 2021, he co-authored a French-language book titled \"I Kidnapped Kim Kardashian\". Didier Dubreucq, 69, known as \"Blue Eyes\", is the second alleged robber suspected of entering the apartment. He denies involvement, although he was filmed by CCTV cameras, and numerous telephone contacts with the other co-defendants show his involvement, according to the investigators. The other defendants are suspected of providing information about Kardashian's presence in the property or accused of playing a role in the reset of the jewellery in Antwerp, Belgium."
    },
    {
        "title": "More than 100 immigrants detained at illegal after-hours nightclub in Colorado",
        "description": "More than 100 immigrants have been taken into custody following a federal raid at an illegal after-hours nightclub in Colorado.",
        "url": "https://news.sky.com/story/more-than-100-immigrants-detained-at-illegal-after-hours-nightclub-in-colorado-13357424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nightclub-colorado-springs_6899493.jpg?20250428091031",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-28 08:08:00",
        "Headline": "DEA agents raided the club in Colorado Springs in the early hours of Sunday as Donald Trump's crackdown on immigration enforcement continues.",
        "Content": "More than 100 immigrants have been taken into custody following a federal raid at an illegal after-hours nightclub in Colorado. Video posted online by the Drug Enforcement Administration (DEA) showed agents announcing their presence outside the premises in Colorado Springs in the early hours of Sunday and ordering patrons to leave with their hands up. Other clips showed dozens of people fleeing the building through its entrance after federal agents smashed a window. Later, dozens of suspects were shown in handcuffs standing on a pavement waiting to be transported. US President Donald Trump posted a link to the DEA video on his social media site, Truth Social, saying: \"A big raid last night on some of the worst people illegally in our country - drug dealers, murderers, and other violent criminals, of all shapes and sizes.\" Jonathan Pullen, special agent in charge of the DEA's Rocky Mountain Division, said US Immigration and Customs Enforcement (ICE) took the immigrants into custody. Speaking at a news conference, he said: \"Colorado Springs is waking up to a safer community today.\" \n                  United Airlines flight forced into emergency landing after 'rabbit' sucked into engine\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 \n                  1999 Columbine school massacre claims another life as paralysed survivor's death ruled homicide\n                 The city, Colorado's second largest, lies about 70 miles south of Denver and sits at the eastern foot of the Rocky Mountains. Mr Pullen said more than 300 law enforcement officers and officials from multiple agencies were involved in the nightclub operation, which had been under investigation for several months for alleged activities including drug trafficking, prostitution and \"crimes of violence\". Read more from Sky News:Canada might be the second election Trump wins in six monthsOne dead and multiple injured after boat crashes into ferry Cocaine was among the drugs found, Mr Pullen said. He added: \"When the cops showed up at the door, most of the drugs hit the floor. An undisclosed number of guns were also reportedly seized. 👉 Follow Trump100 on your podcast app 👈 Mr Pullen estimated more than 200 people were inside the nightclub. Among those detained were a dozen active-duty military members who either were patrons or working as armed security. Some patrons were arrested on undisclosed outstanding warrants, Mr Pullen said. However, he did not specify the countries where the detained immigrants were from. During his second stint in office, Mr Trump's unprecedented campaign of immigration enforcement has pushed the limits of executive power, and he has clashed with federal judges trying to restrain him. His recent crackdown has included detaining more than 1,000 international college students, some of whom have seen their legal status restored, at least temporarily. And earlier this month, a federal judge in Colorado temporarily blocked deportations of immigrants who face possible removal under the president's invocation of an 18th century law known as the Alien Enemies Act."
    },
    {
        "title": "M&S tells agency workers to stay at home after cyberattack",
        "description": "Marks & Spencer (M&S) has ordered hundreds of agency workers at its main distribution centre to stay at home as it grapples with the unfolding impact of a cyberattack on Britain's best-known retailer.",
        "url": "https://news.sky.com/story/ms-tells-agency-workers-to-stay-at-home-after-cyberattack-13357434",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marks-and-spencer-shop_6896501.jpg?20250425144859",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-28 08:31:00",
        "Headline": "Hundreds of agency staff at M&S's main clothing and home warehouse in the East Midlands have been told not to come in as the retailer wrestles with the impact of a huge cyberattack, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Marks & Spencer (M&S) has ordered hundreds of agency workers at its main distribution centre to stay at home as it grapples with the unfolding impact of a cyberattack on Britain's best-known retailer. Sky News has learnt that roughly 200 people who had been due to undertake shift work at M&S's vast Castle Donington clothing and homewares logistics centre in the East Midlands have been told not to come in amid the escalating crisis. Agency staff make up about 20% of Castle Donington's workforce, according to a source close to M&S. Money latest: Vet hits back at critics of prices The retailer's own employees who work at the site have been told to come in as usual, the source added. \"There is work for them to do,\" they said. M&S disclosed last week that it was suspending online orders as a result of the cyberattack, but has provided few other details about the nature and extent of the incident. In its latest update to investors, the company said on Friday that its product range was \"available to browse online, and our stores remain open and ready to welcome and serve customers\". \"We continue to manage the incident proactively and the M&S team - supported by leading experts - is working extremely hard to restore online operations and continue to serve customers well,\" it added. Read more from Sky News:Deliveroo shares surge 17% as takeover loomsUK growth could be 'postponed' for two years, report warns It was unclear on Monday how long the disruption to M&S's e-commerce operations would last, although retail executives said the cyberattack was \"extensive\" and that it could take the company some time to fully resolve its impact. Shares in M&S slid a further 2.4% on Monday morning, following a sharp fall last week, as investors reacted to the absence of positive news about the incident. M&S declined to comment further."
    },
    {
        "title": "Buyout firms circle £400m NCC division Escode",
        "description": "A pack of private equity firms are circling one of the main subsidiaries of NCC Group, the London-listed cybersecurity specialist.",
        "url": "https://news.sky.com/story/buyout-firms-circle-163400m-ncc-division-escode-13357606",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-london-london-stock-exchange_6636524.jpg?20240722164849",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-28 13:18:00",
        "Headline": "Private equity groups including Montagu and Bridgepoint are exploring potential bids for the software escrow and verification unit of cybersecurity specialist NCC Group, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A pack of private equity firms are circling one of the main subsidiaries of NCC Group, the London-listed cybersecurity specialist. Sky News has learnt that Montagu Private Equity and Bridgepoint are among the buyout firms which are interested in bidding for Escode, which specialises in software escrow and verification services. City sources said a deal for Escode could be worth between £300m and £400m, while NCC Group's entire market capitalisation on Monday afternoon was just over £440m. Several other private equity firms are also said to be interested, although a formal auction is not under way and the identities of the other parties was unclear. Shares in NCC rose by more than 6% during the trading session amid market speculation about a takeover bid or sale of parts of the company. The buyout firms' interest in Escode follows a string of reviews by NCC about potential disposals. In January 2024, the group said its board had \"decided not to restart the strategic review of Escode at this juncture\", while other parts of the company have also been the subject of exploratory discussions with possible buyers. \n                  M&S tells agency workers to stay at home after cyberattack\n                 \n                  Deliveroo shares surge 17% as £2.7bn takeover looms\n                 \n                  UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt\n                 NCC employs about 2,200 people across Europe, North America and Asia-Pacific. It announced on Monday that it had signed a £120m loan facility with a syndicate of banks comprising Barclays, HSBC, NatWest and Santander UK. NCC, Montagu and Bridgepoint all declined to comment."
    },
    {
        "title": "Deliveroo shares surge 17% as £2.7bn takeover looms",
        "description": "Shares in meal delivery platform Deliveroo have surged by 17% as investors react to news of a &#163;2.7bn takeover proposal.",
        "url": "https://news.sky.com/story/deliveroo-shares-surge-17-as-16327bn-takeover-looms-13357408",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-money-blog-deliveroo_6645265.jpg?20240802073109",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-28 06:47:00",
        "Headline": "The meal delivery platform's founder stands to make more than £170m if the deal offered by US rival DoorDash goes through.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in meal delivery platform Deliveroo have surged by 17% as investors react to news of a £2.7bn takeover proposal. The company revealed after the market had closed on Friday that it had been in talks since 5 April with US rival DoorDash. Deliveroo suggested then it was likely the 180p per share offer would be recommended, though full terms were yet to be agreed. Money latest: Vet hits back at critics of prices At that price, the company's founder and chief executive, Will Shu, would be in line for a windfall of more than £170m. Deliveroo further announced, before trading on Monday, that it had suspended its £100m share buyback programme. The opening share price reaction took the value to 171p per share - still shy of the 180p on the table - and well under the 390p per share flotation price seen in 2021. \n                  M&S tells agency workers to stay at home after cyberattack\n                 \n                  Buyout firms circle £400m NCC division Escode\n                 \n                  UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt\n                 Deliveroo's shares have weakened nearly 50% since their market debut. The deal is not expected to face regulatory hurdles as it provides DoorDash access to 10 new markets where it currently has no presence. Read more from Sky News:M&S tells agency workers to stay at home after cyberattackUK growth could be 'postponed' for two years, report warns But a takeover would likely represent a blow to the City of London given the anticipated loss of a tech-focused player. Susannah Streeter, head of money and markets at Hargreaves Lansdown, said: \"If the deal is done at that price, the company will fail to shake off the 'Floperoo' tag it was saddled with after its disastrous IPO debut in 2021. \"Even though Deliveroo has finally broken through into profitable territory, the prolonged bout of indigestion around its share price has continued. \"The surge in demand for home deliveries during the pandemic waned just as competition heated up. Deliveroo's foray into grocery deliveries has helped it turn a profit but it's still facing fierce rivals.\" She added: \"The DoorDash Deliveroo deal will be unappetising for the government which has been trying to boost the number of tech companies listed in London. \"If Deliveroo is purchased it would join a stream of companies leaving the London Stock Exchange, with too few IPOs [initial public offerings] in the pipeline to make up the numbers.\""
    },
    {
        "title": "UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt",
        "description": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House.",
        "url": "https://news.sky.com/story/uk-us-trade-talks-moving-in-a-very-positive-way-says-white-house-spokesperson-karoline-leavitt-13357785",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trump_6887098.jpg?20250415185739",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-28 18:06:00",
        "Headline": "Discussions surrounding a US-UK trade deal have been taking place since Brexit, although they were not prioritised as highly under Joe Biden. Ministers from the UK side have also recently appeared optimistic about the chances of a deal. ",
        "Content": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House. President Donald Trump's press secretary Karoline Leavitt spoke about the likelihood of the long-discussed agreement during a press briefing. In Westminster, there are hopes such a deal could soften the impact of the Trump tariffs announced last month. Leavitt told reporters: \"As for the trade talks, I understand they are moving in a very positive way with the UK. \"I don't want to get ahead of the president or our trade team in how those negotiations are going, but I have heard they have been very positive and productive with the UK.\" She said Mr Trump always \"speaks incredibly highly\" of the UK. \"He has a good relationship with your prime minister, though they disagree on domestic policy issues,\" she added. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  China-US tariff war could be reaching stalemate, but more danger lingers\n                 \"I have witnessed the camaraderie between them first hand in the Oval Office, and there is a deep mutual respect between our two countries that certainly the president upholds.\" Chancellor of the Duchy of Lancaster Pat McFadden gave the UK's position on the talks when speaking to Sunday Morning With Trevor Phillips. He said there was \"a serious level of engagement going on at high levels\" to secure a UK-US trade deal. Mr McFadden is one of the most powerful members of Sir Keir Starmer's government and a key ally of the prime minister. Read more:Deal 'possible' but not certainChancellor lays out redlines for deal He was careful to not get ahead of developments, however, saying: \"I think an agreement is possible - I don't think it's certain, and I don't want to say it's certain, but I think it's possible.\" He went on to say the government wanted an \"agreement in the UK's interests\" and not a \"hasty deal\", amid fears from critics that Number 10 could acquiesce a deal that lowers food standards, for example, or changes certain taxes in a bid to persuade Donald Trump to lower some of the tariffs that have been placed on British goods. Mr McFadden's tone was more cautious than Chancellor Rachel Reeves' last week. She had been in the US and, speaking to Sky News business and economics correspondent Gurpreet Narwan, the chancellor said she was \"confident\" a deal could be done.  But she sought to play down fears that UK standards could be watered down, both on food and online safety. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" Ms Reeves said."
    },
    {
        "title": "UK growth could be 'postponed' for two years, report warns",
        "description": "UK economic growth could be \"postponed\" for two years amid a toxic cocktail of headwinds for confidence, according to a respected forecast which says further interest rate cuts may help lift the mood.",
        "url": "https://news.sky.com/story/uk-growth-could-be-postponed-for-two-years-report-shows-13357369",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-money-economy_6827500.jpg?20250213114357",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-28 04:51:00",
        "Headline": "EY ITEM Club forecast cites damage from trade war, tariff uncertainty and persistent inflation - but says action by the Bank of England has the potential to help.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n UK economic growth could be \"postponed\" for two years amid a toxic cocktail of headwinds for confidence, according to a respected forecast which says further interest rate cuts may help lift the mood. EY ITEM Club, which uses the Treasury's economic modelling, downgraded expectations for output in both 2025 and 2026 in its latest report. It warns of a direct hit from Donald Trump's trade war and from persistent high inflation in the UK economy. But the forecast says the biggest impact would come from weaker sentiment among both households and businesses, given the surge in uncertainty and hits to global growth caused by the imposition of tariffs. Money latest: Vet hits back at critics of prices A \"baseline\" 10% tariff on imports from most countries around the world is in place while UK-produced steel, aluminium and cars are subject to duties of 25%. Around 16% of all goods shipped abroad head for the United States typically but the study said that weaker demand for exports would likely hit that number. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Trump trade war: How UK figures show his tariff argument doesn't add up\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 It forecast UK growth of 0.8% this year - down from the 1% it expected three months ago - and a figure of 0.9% for 2026. That last figure represented a downgrade of 0.6 percentage points. These are not the numbers the Treasury will want to see, coming in even lower than the International Monetary Fund's downgrades last week, as it leads work on the government's stated priority of securing economic growth.  It has been accused of an own goal through the chancellor's tax increases on business, which came into effect at the beginning of this month. At the same time, households are grappling a surge in bills, including those for energy, water and council tax, which are threatening to depress spending power further. Data on Friday showed a renewed slump in consumer confidence and sharp increases in the number of firms in \"critical\" financial distress and going to the wall.  EY said the weaker global economic backdrop and spiralling levels of uncertainty would weigh on both families and businesses. It warned the consumer mood remained \"cautious\" amid the continuing pressures on household budgets, further limiting demand for major purchases. Read more from Sky News:US trade deal 'possible' but not 'certain' - ministerBank chiefs to Reeves: Ditch ring-fencing to boost UK economy Anna Anthony, regional managing partner for EY UK & Ireland, said: \"There had been signs that the economy was exceeding expectations in the opening months of 2025, but a combination of global trade disruption, uncertainty, and persistent inflation look likely to postpone the UK's return to more moderate levels of growth. \"Businesses thrive on certainty, so it's unsurprising that an unpredictable global market is translating into lower levels of business investment over the short term. \"While conditions remain challenging, there are still some grounds for optimism. \"The services-led UK economy is projected to see continued growth this year and gradual interest rate cuts should slowly bolster business and household spending. \"Over time, the unpredictable global landscape may offer opportunities for the UK to position itself as a stable, attractive destination for investment.\""
    },
    {
        "title": "Sex offenders to be denied refugee status under plans to improve women's safety",
        "description": "Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security.",
        "url": "https://news.sky.com/story/sex-offenders-to-be-denied-refugee-status-under-plans-to-improve-womens-safety-13357749",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-border-force-channel_6899979.jpg?20250428164411",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-04-28 16:53:00",
        "Headline": "The government says the proposals will improve safety for women and girls, while clamping down on illegal migration.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Migrants convicted of sex offences in the UK or overseas will be unable to claim asylum under government plans to change the law to improve border security. The Home Office announcement means foreign nationals who are added to the sex offenders register will forfeit their rights to protection under the Refugee Convention. Politics latest: Tory-Reform coalition would be disaster, warns PM As part of the 1951 UN treaty, countries are allowed to refuse asylum to terrorists, war criminals and individuals convicted of a \"particularly serious crime\" - which is currently defined in UK law as an offence carrying a sentence of 12 months or more. The government now plans to extend that definition to include all individuals added to the Sex Offenders' Register, regardless of the length of sentence, in an amendment to the Border Security, Asylum and Immigration Bill, which is currently going through parliament. It's understood they also hope to include those convicted of equivalent crimes overseas. Those affected will still be able to appeal their removal from the UK in the courts under the European Convention on Human Rights (ECHR). It is unclear how many asylum seekers will be affected, as the government has been unable to provide any projections or past data on the number of asylum seekers added to the Sex Offenders' Register. \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 \n                  UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt\n                 \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 Home Secretary Yvette Cooper said: \"Sex offenders who pose a risk to the community should not be allowed to benefit from refugee protections in the UK. \"We are strengthening the law to ensure these appalling crimes are taken seriously.\" Safeguarding and Violence Against Women and Girls Minister Jess Philips said: \"We are determined to achieve our mission of halving violence against women and girls in a decade. \"That's exactly why we are taking action to ensure there are robust safeguards across the system, including by clamping down on foreign criminals who commit heinous crimes like sex offences.\" Read more:PM 'doesn't want to see strike action'Former Streeting aide avoids jail after exposing himself  The Home Office would like voters to see this as a substantial change. But that's hard to demonstrate without providing any indication of the scale of the problem it seeks to solve. Clearly, the government does not want to fan the flames of resentment towards asylum seekers by implying large numbers have been committing sex crimes. But amid rising voter frustration about the government's grip on the issue, and under pressure from Reform - this measure is about signalling it is prepared to take tough action. Conservatives: 'Too little, too late' The Conservatives claim Labour are engaged in \"pre-election posturing\". Chris Philp MP, the shadow home secretary, said: \"This is too little, too late from a Labour government that has scrapped our deterrent and overseen the worst year ever for small boat crossings - with a record 10,000 people crossing this year already. \"Foreign criminals pose a danger to British citizens and must be removed, but so often this is frustrated by spurious legal claims based on human rights claims, not asylum claims.\"  The Home Office has also announced plans to introduce a 24-week target for appeal hearings (known as \"first-tier tribunals\") to be held for rejected asylum seekers living in taxpayer-supported accommodation, or for foreign national offenders. The current average wait is 50 weeks. The idea is to cut the asylum backlog and save taxpayers money - Labour have committed to end the use of asylum hotels by the end of this parliament. It's unclear how exactly this will be achieved, although a number of additional court days have already been announced. The government also plans to crack down on fake immigration lawyers who advise migrants on how to lodge fraudulent asylum claims, with the Immigration Advice Authority given new powers to issue fines of up to £15,000."
    },
    {
        "title": "Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands",
        "description": "Small boat crossings have passed 10,000 in 2025 at the earliest point in a year since records began, Sky News understands.",
        "url": "https://news.sky.com/story/small-boat-crossings-pass-10000-at-earliest-point-in-year-since-records-began-sky-news-understands-13357691",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-channel-dover-kent_6785311.jpg?20241226143228",
        "type": "Politics",
        "Author": "Josh Gafson, politics producer, and Tim Baker, political reporter",
        "Date Published": "2025-04-28 15:24:00",
        "Headline": "Sky News analysis shows the milestone has been passed as of 28 April. In the past three years, it took until June for 10,000 people to cross. Data has been collected since 2018 when the crossings first became a popular route of entry to the UK.",
        "Content": "By Josh Gafson, politics producer, and Tim Baker, political reporter  Small boat crossings have passed 10,000 in 2025 at the earliest point in a year since records began, Sky News understands. Analysis of previous Home Office numbers and footage of people arriving today show the number of people crossing the Channel continuing to rise. The issue has become a lodestone for political parties across the spectrum, with Rishi Sunak's pledge to \"Stop The Boats\" falling well short. Politics latest: PM warns of Tory-Reform pact 'disaster' Sir Keir Starmer promised to clear the backlog of asylum applications and \"Smash The Gangs\" of people smugglers upstream, but critics say he has failed to do this almost a year into his stint in Number Ten. Reform's Nigel Farage has made the issue key to his party's pitch to voters. The 10,000 figure is understood to have been passed on 28 April. Official figures only go until 27 April at the time of writing, with 9,885 people detected crossing the Channel by the UK government at this point \n                  Labour's plan for failed asylum seekers shows they're willing to adopt previously unpalatable policies\n                 \n                  Gig economy bosses could face jail time if they fail to check employees can legally work in UK\n                 \n                  Home Office cancels hotel company's contract to house asylum seekers\n                 This compares to 7,167 by the same date in 2024, 5,745 in 2023, 5,352 in 2022, and 1,796 in 2021. Data only started to get collected in 2018, and for the first three years fewer than 1,000 people were observed crossing the Channel before 28 April. Fine weather conditions are known to lead to an increase in people crossing the Channel, with some efforts earlier this year stymied by heavy winds. Sir Keir scrapped the Conservative's Rwanda deportation plan when entering office. In March, the prime minister said his government had \"returned\" 24,000 people who had no right to be in the UK. Read more:Why more people cross on the weekend?Gusty conditions halt small boat crossingsStarmer: 24,000 people returned Chris Philp, the shadow home secretary, said: \"Britain's borders are being torn apart under Labour. This year is already the worst on record for small boat crossings after over 10,000 illegal immigrants arrived in Britain, but Labour just sit on their hands. \"Labour scrapped our deterrent before it even started, flung open the door to extremists and criminals, and handed the bill to hardworking taxpayers. \"Under new Conservative leadership, we are serious about tackling this crisis with deliverable reforms, but Labour continue to block these at every turn. Labour's open-door chaos is a betrayal of the British people, and we will not let them get away with it.\" Mr Philp was part of previous Conservative governments, which also failed to reduce crossings. Speaking to broadcasters, Mr Farage said: \"If this carries on at this rate, by the end of this Labour government another quarter of a million people will have come into this country, many of whom frankly don't fit our culture or cost us a fortune.\" He claimed that Reform is \"the only party\" saying that \"unless you deport those that come illegally, they will just continue to come\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 A Home Office spokesperson said: \"We all want to end dangerous small boat crossings, which threaten lives and undermine our border security. \"The people-smuggling gangs do not care if the vulnerable people they exploit live or die, as long as they pay and we will stop at nothing to dismantle their business models and bring them to justice. \"That is why this government has put together a serious plan to take down these networks at every stage. \"Through international intelligence sharing under our Border Security Command, enhanced enforcement operations in Northern France and tougher legislation in the Border Security and Asylum Bill, we are strengthening international partnerships and boosting our ability to identify, disrupt, and dismantle criminal gangs whilst strengthening the security of our borders.\""
    },
    {
        "title": "UK-US trade talks 'moving in a very positive way', says White House spokesperson Karoline Leavitt",
        "description": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House.",
        "url": "https://news.sky.com/story/uk-us-trade-talks-moving-in-a-very-positive-way-says-white-house-spokesperson-karoline-leavitt-13357785",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trump_6887098.jpg?20250415185739",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 18:06:00",
        "Headline": "Discussions surrounding a US-UK trade deal have been taking place since Brexit, although they were not prioritised as highly under Joe Biden. Ministers from the UK side have also recently appeared optimistic about the chances of a deal. ",
        "Content": "Trade talks between the UK and the United States are \"moving in a very positive way\", according to the White House. President Donald Trump's press secretary Karoline Leavitt spoke about the likelihood of the long-discussed agreement during a press briefing. In Westminster, there are hopes such a deal could soften the impact of the Trump tariffs announced last month. Leavitt told reporters: \"As for the trade talks, I understand they are moving in a very positive way with the UK. \"I don't want to get ahead of the president or our trade team in how those negotiations are going, but I have heard they have been very positive and productive with the UK.\" She said Mr Trump always \"speaks incredibly highly\" of the UK. \"He has a good relationship with your prime minister, though they disagree on domestic policy issues,\" she added. \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  China-US tariff war could be reaching stalemate, but more danger lingers\n                 \"I have witnessed the camaraderie between them first hand in the Oval Office, and there is a deep mutual respect between our two countries that certainly the president upholds.\" Chancellor of the Duchy of Lancaster Pat McFadden gave the UK's position on the talks when speaking to Sunday Morning With Trevor Phillips. He said there was \"a serious level of engagement going on at high levels\" to secure a UK-US trade deal. Mr McFadden is one of the most powerful members of Sir Keir Starmer's government and a key ally of the prime minister. Read more:Deal 'possible' but not certainChancellor lays out redlines for deal He was careful to not get ahead of developments, however, saying: \"I think an agreement is possible - I don't think it's certain, and I don't want to say it's certain, but I think it's possible.\" He went on to say the government wanted an \"agreement in the UK's interests\" and not a \"hasty deal\", amid fears from critics that Number 10 could acquiesce a deal that lowers food standards, for example, or changes certain taxes in a bid to persuade Donald Trump to lower some of the tariffs that have been placed on British goods. Mr McFadden's tone was more cautious than Chancellor Rachel Reeves' last week. She had been in the US and, speaking to Sky News business and economics correspondent Gurpreet Narwan, the chancellor said she was \"confident\" a deal could be done.  But she sought to play down fears that UK standards could be watered down, both on food and online safety. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" Ms Reeves said."
    },
    {
        "title": "End the 'absolute scandal' of new homes built without solar panels, government urged",
        "description": "The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels. ",
        "url": "https://news.sky.com/story/end-the-absolute-scandal-of-new-homes-built-without-solar-panels-government-urged-13357705",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-build-solar-panel_6900006.jpg?20250428171210",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-28 22:59:00",
        "Headline": "Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels.  Doing so would cut both household bills and greenhouse gases that cause climate change, the Local Government Association (LGA) said in a new report. Just four in 10 new homes in England come with solar power, according to separate figures from the industry body Solar Energy UK. Although that is a significant three-fold increase over the space of a year, the LGA said making it mandatory would benefit bill-payers and the climate for years to come, saving people £440 per year. The UK lags behind its neighbours in the European Union, which last year adopted new legislation demanding all new residential buildings come with solar panels from 2030. Greenpeace UK called it an \"absolute scandal that homes are built without rooftop solar panels in this day and age\". Its campaigner, Lily Rose Ellis, said: \"Given the soaring cost of electricity, our desperate need to cut planet-heating emissions, and the relatively low cost of installation to housebuilders, solar panels on all new builds should be mandatory.\" \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 \n                  The good, the bad and the ugly in Donald Trump's coal plans\n                 Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory, as it also courts the house-building industry to help it meet its target to build 1.5 million homes during this parliament.  The LGA wants the government to allocate them long-term funding in the upcoming spending review so they can help the country meet net zero. A spokesperson for the Ministry of Housing, Communities and Local Government said they plan to \"maximise the installation of solar panels on new homes\" in its long-delayed new regulations, the Future Homes Standard, due later this year. The Home Builders Federation said \"Moving forward, to meet the ever more challenging carbon reductions set by government, we will see solar on the overwhelming majority of new homes, albeit it is not appropriate in every situation.\" Pylon rows The push on solar power is part of the government's broader plans to ensure all the UK's electricity comes from green sources by 2030. Electricity demand is also growing as the country switches to electric cars and heating, and builds more data centres. All this requires more wind and solar farms, as well as 1,000 kilometres of new cables to carry the electricity from where it is generated - often a wind farm in the North Sea - to where it is used in urban areas far away. In parts of the country like East Anglia, a row has been simmering over whether to run those cables overhead on pylons or, to protect countryside views, underground. A hefty new report by the Institution of Engineering and Technology today weighed in on the debate, finding underground cables are on average 4.5 times more expensive than overhead lines. Liam Hardy, head of research at thinktank Green Alliance, said: \"Those costs need to go somewhere. They go on to all of our electricity bills. And of course, it's the poorest in society for whom those bills make up a bigger percentage of their income. He added: \"What they want to see is value for money as we build out that clean infrastructure that we need.\" The government has promised communities disrupted by the new infrastructure that they should reap some of the benefits, including giving households near new pylons £2,500 off their energy bills over 10 years."
    },
    {
        "title": "Kneecap should apologise for 'kill your MP' remarks, says murdered MP's daughter",
        "description": "The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\".",
        "url": "https://news.sky.com/story/kneecap-should-apologise-for-kill-your-mp-remarks-says-murdered-mps-daughter-13357465",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 09:32:00",
        "Headline": "Kneecap say they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\".",
        "Content": " The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\". Footage of the group at a November 2023 gig appears to show one member saying: \"The only good Tory is a dead Tory. Kill your local MP.\" Sir David was killed at a constituency surgery in 2021. Speaking to the UK Tonight With Sarah-Jane Mee, Katie Amess said: \"I'm more than happy to sit down and speak with them. I'm sure they've never met a victim of such a heinous crime, and so they're not thinking it through. \"If they were to meet with me and to see and to hear the pain and the torture and the torment that I go through every day, I'm sure they would feel terribly guilty. \"And I'm sure that they would apologise, because if not, what kind of people are they?\" Conservative leader Kemi Badenoch has demanded the prosecution of the rap trio Kneecap after the video emerged. Downing Street has described the alleged comments as \"completely unacceptable\". Police are investigating - and are also assessing footage reportedly from a gig a year later in London's Kentish Town Forum. In the November 2024 video, a member of the band appears to shout \"up Hamas, up Hezbollah\" - referencing groups which are banned as terrorist organisations in the UK. A Metropolitan Police spokesman said: \"We were made aware of a video on 22 April, believed to be from an event in November 2024, and it has been referred to the counter-terrorism internet referral unit for assessment and to determine whether any further police investigation may be required. \"We have also been made aware of another video believed to be from an event in November 2023.\" Mrs Badenoch said it was \"good\" the police were looking into the allegations, adding: \"Kneecap's glorification of terrorism and anti-British hatred has no place in our society. \"Now footage shows one of them saying: 'The only good Tory is a dead Tory. Kill your local MP'. \"After the murder of Sir David Amess, this demands prosecution.\" Ms Amess also welcomed the investigation. She told Sky News: \"I wake up every day with the knowledge that I will never see my father again. \"He will never meet my children. He wasn't able to be at my wedding. There's nothing funny about this. \"This is serious, and the government and the police need to take it seriously and to nip this in the bud and stop this kind of rhetoric being tolerated.\" Kneecap, made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In a statement Kneecap said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"We also reject any suggestion that we would seek to incite violence against any MP or individual. Ever. An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action.\" The band added: \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Read more from Sky News:UK temperatures could hit 29C this weekM&S tells agency staff to stay at home Mrs Badenoch and Kneecap are already known to each other. The Tory leader blocked a government grant to the bilingual Belfast group while she was business secretary. But last November, Kneecap won a discrimination challenge over the decision to refuse them a £14,250 funding award after the UK government conceded it was \"unlawful\". Downing Street condemned the alleged comments. \"We do not think individuals expressing those views should be receiving government funding,\" the prime minister's official spokesman said. Asked if the money should be returned, the spokesman added: \"That's up to the group, but clearly the PM rejects the views expressed ... does not shy away from condemning them.\""
    },
    {
        "title": "Tory-Reform coalition would be 'disaster for Britain', says Sir Keir Starmer as he defends immigration record",
        "description": "A coalition between the Conservatives and Reform would be a \"disaster for Britain\", Sir Keir Starmer has said as he defended his record on immigration.",
        "url": "https://news.sky.com/story/tory-reform-coalition-would-be-disaster-for-britain-says-sir-keir-starmer-as-he-defends-immigration-record-13357501",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trans-women_6893580.jpg?20250422094522",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 10:33:00",
        "Headline": "The prime minister says there is a \"serious problem\" with immigration, as the number of people arriving in small boats this year is set to pass 10,000.",
        "Content": " A coalition between the Conservatives and Reform would be a \"disaster for Britain\", Sir Keir Starmer has said as he defended his record on immigration. The prime minister said voters of the rival parties were \"being conned\" as he suggested there were attempts to merge the two parties going on \"behind the scenes\". The prime minister was asked by Sky News political editor Beth Rigby whether he was \"more worried\" about Reform rather than the Conservatives ahead of the local and mayoral elections taking place across England this week. He said: \"I would challenge either of them. \"The Tories have got a terrible record - 14 years of failure. Reform moan about everything, but have got no answers. And at the end of the day, Reform and the Tories, there's all this talk about them getting together and merging. \"If you're a Tory voter who doesn't want a pro-Russia foreign policy, how does a merger with Reform work for you? If you're a Reform voter that thinks the Tories have failed for 14 years, how does a merger or coalition with the Tories work for you?\" He added: \"Both sets of voters are being conned, because behind the scenes and behind the leader of the opposition, other people are looking for a coalition of these two parties. \n                  Day 96: 'Vladimir STOP!' Will Trump's plea to Putin make a difference?\n                 \n                  Can there ever be a calm debate on trans rights?\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 \"It would be a disaster for Britain.\" Sir Keir was challenged about the threat of Reform as the number of migrants crossing the Chanel in small boats this year is set to pass 10,000. The number is recorded from between January and April this year and is more than in any equivalent four-year period since monitoring began in 2018. The Labour leader said there was a \"serious problem\" but accused the last government of losing control of the country's borders. He added: \"My strong belief is that we need to take down the gangs that are running the trade of putting people into boats.  \"That's why we're passing the Borders Bill - that gives much greater powers to our law enforcement. The Tories actually voted against that, if you can believe it. \"But also, what we've done is to... put an intense focus on removing people who have no right to be in this country, so 24,000 have been returned since we've had a Labour government. \"That's the highest for nearly a decade I'm not going to duck your challenge, we've got to do more, but I think passing the legislation to get those stronger powers.\" Speculation that the Tories and Reform could join forces heightened after two senior Conservatives appeared to advocate for some sort of agreement between the two rival parties. Robert Jenrick, the shadow justice secretary, was captured in a video recording leaked to Sky News vowing to \"bring this coalition together\" to ensure that Conservatives and Reform UK are no longer competing for votes by the time of the next general election.  Mr Jenrick has denied his words amounted to calling for a pact with Reform. Meanwhile, in an interview with Politico, the Conservative Tees Valley Mayor Ben Houchen also suggested the two parties should join forces in some way. \"I don't know what it looks like. I don't know whether it's a pact. I don't know whether it's a merger… [or] a pact of trust and confidence or whatever,\" he said. Read more:Badenoch demands prosecution of rap group KneecapUS trade deal 'possible' but not 'certain' \"But if we want to make sure that there is a sensible centre-right party leading this country, then there is going to have to be a coming together of Reform and the Conservative Party in some way.\" On Sunday, Kemi Badenoch did not rule out forming coalitions with Reform after the council elections on Thursday - but she did categorically rule out a pact with Nigel Farage's party on a national level. \"I am not going into any coalition with Nigel Farage... read my lips,\" she Sunday Morning with Trevor Phillips. This is part of a series of election previews with all major parties invited."
    },
    {
        "title": "Wes Streeting's ex-aide Samuel Gould given suspended sentence after exposing himself to girl",
        "description": "A former aide to Health Secretary Wes Streeting has been spared jail after exposing himself to a teenage girl and following her.",
        "url": "https://news.sky.com/story/wes-streetings-ex-aide-samuel-gould-given-suspended-sentence-after-exposing-himself-to-girl-13357479",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-councillor-samuel-sam_6899930.jpg?20250428153719",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 09:56:00",
        "Headline": "Gould, 33, has already been sacked by the minister after admitting two counts of indecent exposure. Mr Streeting previously spoke of his \"horror\" at the offences.",
        "Content": "A former aide to Health Secretary Wes Streeting has been spared jail after exposing himself to a teenage girl and following her. Samuel Gould was sentenced at Barkingside Magistrates' Court to 22 weeks' imprisonment suspended for two years after admitting two counts of exposure. The 33-year-old, of Hornchurch, Essex, who was also a councillor in Redbridge, was seen by the 13-year-old girl masturbating in his parked car in Romford on 8 March. Politics latest: PM warns of Tory-Reform pact 'disaster' Gould then followed the girl, who hid and knocked on nearby flats to try and get help, prosecutors said. He was also seen by a woman masturbating while he was seated in a Mini Cooper with the windows down on Patricia Drive in Hornchurch on 9 February, the court heard. Mr Streeting previously spoke of his \"horror\" at Gould's offences. \"As soon as I was made aware of his arrest he was suspended, and as soon as the guilty plea was entered I took immediate steps to sack him through official HR processes,\" Mr Streeting said in March. Gould admitted the two charges against him last month. As well as the suspended sentence, the former Labour Party member was given a seven-year sexual harm prevention order by District Judge Paul Donegan, which stops him from contacting girls under the age of 18. Gould was also ordered to pay legal costs of £239. Prosecutor Jeannel Ambrose claimed Gould specifically targeted a \"particularly vulnerable victim\" when following the 13-year-old girl. The second victim felt \"distressed and violated\" after she saw Gould masturbating while she was walking her dog, the court heard. She took his vehicle registration before reporting him to police, Ms Ambrose said. Read more from politics:PM wants to avoid pay strikesYour ultimate guide to the local elections Nicholas Jennaway, defending, claimed Gould had been going through difficulties at work and his personal life at the time of the incidents. He said the 33-year-old followed the girl in a \"very panicked state\" to try to talk to her, having not seen her approaching. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Mr Jennaway added that Gould, a \"shy, introverted person\" was a man of previous good character and \"apologises profusely\" for the harm his actions caused. The former councillor accepted that his role in public service means he is held to a \"higher standard\"."
    },
    {
        "title": "NHS prescription charges in England frozen for first time in three years",
        "description": "NHS prescription charges in England will be frozen for the first time in three years, the government has announced.",
        "url": "https://news.sky.com/story/nhs-prescription-charges-in-england-frozen-for-first-time-in-three-years-13357420",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-prescription-prescriptions_5737403.jpg?20220412143045",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 07:49:00",
        "Headline": "The government says the freeze will keep the cost of prescriptions under £10 and will help with the cost of living.",
        "Content": "NHS prescription charges in England will be frozen for the first time in three years, the government has announced. It means the cost of prescriptions will be kept under the cost of £10 - at £9.90 - in a move the government says will deliver £18m in savings for patients. Meanwhile, a three-month prescription prepayment certificate (PPC) will be frozen at £32.05, while a 12-month PPC will remain at £114.50. The announcement comes as voters across England head to the polls on Thursday for local council elections.Health Secretary Wes Streeting said: \"Fixing our NHS will be a long road - but by working closer with our pharmacies we're saving money and shifting care to the community where it's closer to your home.\"We made the difficult but necessary choices at the budget to fund moves like this and change our NHS so it can once again be there for you when you need it.\" NHS prescription charges apply in England only, with Northern Ireland, Scotland and Wales abolishing the fee after devolution. Read more:Sky News investigates UK's 'worst ambulance service'Local elections 2025: The first public test for party leaders  The last time they were frozen was in 2022, under Boris Johnson's Conservative government, when it was also used to help people with the rising cost of living. Around 89% of prescriptions in England are already dispensed free of charge, including for children, over-65s, pregnant women, and people with certain medical conditions. Annual charges can be made in instalments, allowing those who need regular medicine to spend just over £2 a week."
    },
    {
        "title": "Sir Keir Starmer says he 'does not want to see strike action' as government considers pay offers",
        "description": "Sir Keir Starmer has said he does not want to see public sector workers strike over pay, arguing there is a \"much better way of doing business\".",
        "url": "https://news.sky.com/story/pay-rise-recommendations-will-be-given-careful-consideration-says-minister-amid-strike-threat-13357401",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-neu-teachers-strike_6075233.jpg?20250428092309",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-28 06:21:00",
        "Headline": "The prime minister says there is a \"better way to do business\" as ministers consider the recommendations of pay review bodies.",
        "Content": " Sir Keir Starmer has said he does not want to see public sector workers strike over pay, arguing there is a \"much better way of doing business\". The prime minister was speaking after The Times reported that teachers had been recommended for a near 4% pay rise and NHS workers close to 3% by the two relevant independent pay review bodies. Care minister Stephen Kinnock said on Monday that the government had now received the recommendations and would give them \"very careful consideration\". Asked about the possibility of strikes, Sir Keir told broadcasters at a health centre: \"I don't want to see strike action, I don't think anybody wants to see strike action. \"And certainly here we are in a healthcare environment with all the staff working really hard. The last thing they want to do is to go into dispute again. \"We solved disputes, we are working with the NHS. It's because of the way that we are working with the NHS that we are able to bring waiting lists down and make other announcements today.\" He added: \"What I think we are proving here - what I hope we are proving - is if you work with the NHS staff, you get better results than the last government, which just went into battle with them. \"So, we have got our doctors and nurses on the front line, not the picket line, and I think everybody appreciates that's a much better way of doing business.\" According to The Times, teachers and NHS workers in England have been told to expect a pay rise of close to 4% and 3%, respectively. The figures are higher than the 2.8% the government has offered - meaning it must now decide whether to increase its offer in line with the pay review bodies, as it did last year. But Downing Street was clear on Monday that the government would not be providing any extra funding for increases above 2.8%. The prime minister's official spokesman said: \"There'll be no additional funding for pay if recommended awards exceed what departments can afford.\" Speaking to Wilfred Frost on Sky News Breakfast, Mr Kinnock also urged trade unions to \"engage constructively with us\". \"We've received the recommendation of the pay review body and we will give that very careful consideration,\" he said. He said the government was \"all about putting more money into the pockets of working people\", citing how the junior doctors' strike was resolved when they accepted a government pay offer worth an extra 22.3% on average over two years. But he added: \"We also have to ensure that we are balancing the books, and we've got to work - in terms of public sector pay - within fiscal constraints. \"So of course we will give these recommendations careful consideration, but I would, of course, also urge our colleagues in the trade union movement to engage constructively with us and recognise the reality of the financial position.\" The decision of the independent pay review bodies to recommend pay rises higher than the government offer presents a headache for Chancellor Rachel Reeves, who is already grappling with the impact of Donald Trump's punitive tariff regime. Ms Reeves will need to balance her promise to keep spending within certain fiscal constraints with the government's long-term ambition to improve public services - seen as crucial to Labour's electoral success. Read more:US trade deal 'possible' but not 'certain'Badenoch does not rule out local coalitions with Reform Unions have already signalled they are prepared to go on strike again if the government does not increase its offer of 2.8%. The Royal College of Nursing (RCN) said the figure amounted to \"as little as £2 extra a day\" - while the British Medical Association (BMA) accused Labour of failing to grasp unresolved issues from two years of strikes under the Tories. Last week, Sky News reported the National Education Union, the largest teaching union in the UK, drew up plans for strike action while it waited to learn the outcome of the School Teachers' Review Body report into pay. The NEU, led by general secretary Daniel Kebede, has rejected the government's 2.8% pay offer as \"unacceptable\" and \"unfunded\". Instead, the union is calling for a fully funded, above-inflation pay rise - although it has not put a figure on the proposal it would like to receive."
    },
    {
        "title": "End the 'absolute scandal' of new homes built without solar panels, government urged",
        "description": "The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels. ",
        "url": "https://news.sky.com/story/end-the-absolute-scandal-of-new-homes-built-without-solar-panels-government-urged-13357705",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-build-solar-panel_6900006.jpg?20250428171210",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-28 22:59:00",
        "Headline": "Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is being urged to end the \"absolute scandal\" of new homes being built without solar panels.  Doing so would cut both household bills and greenhouse gases that cause climate change, the Local Government Association (LGA) said in a new report. Just four in 10 new homes in England come with solar power, according to separate figures from the industry body Solar Energy UK. Although that is a significant three-fold increase over the space of a year, the LGA said making it mandatory would benefit bill-payers and the climate for years to come, saving people £440 per year. The UK lags behind its neighbours in the European Union, which last year adopted new legislation demanding all new residential buildings come with solar panels from 2030. Greenpeace UK called it an \"absolute scandal that homes are built without rooftop solar panels in this day and age\". Its campaigner, Lily Rose Ellis, said: \"Given the soaring cost of electricity, our desperate need to cut planet-heating emissions, and the relatively low cost of installation to housebuilders, solar panels on all new builds should be mandatory.\" \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 \n                  The good, the bad and the ugly in Donald Trump's coal plans\n                 Last year, Labour promised a \"rooftop revolution\" that would see millions more homes fitted with solar panels. But they have been accused of wavering over proposals to make it mandatory, as it also courts the house-building industry to help it meet its target to build 1.5 million homes during this parliament.  The LGA wants the government to allocate them long-term funding in the upcoming spending review so they can help the country meet net zero. A spokesperson for the Ministry of Housing, Communities and Local Government said they plan to \"maximise the installation of solar panels on new homes\" in its long-delayed new regulations, the Future Homes Standard, due later this year. The Home Builders Federation said \"Moving forward, to meet the ever more challenging carbon reductions set by government, we will see solar on the overwhelming majority of new homes, albeit it is not appropriate in every situation.\" Pylon rows The push on solar power is part of the government's broader plans to ensure all the UK's electricity comes from green sources by 2030. Electricity demand is also growing as the country switches to electric cars and heating, and builds more data centres. All this requires more wind and solar farms, as well as 1,000 kilometres of new cables to carry the electricity from where it is generated - often a wind farm in the North Sea - to where it is used in urban areas far away. In parts of the country like East Anglia, a row has been simmering over whether to run those cables overhead on pylons or, to protect countryside views, underground. A hefty new report by the Institution of Engineering and Technology today weighed in on the debate, finding underground cables are on average 4.5 times more expensive than overhead lines. Liam Hardy, head of research at thinktank Green Alliance, said: \"Those costs need to go somewhere. They go on to all of our electricity bills. And of course, it's the poorest in society for whom those bills make up a bigger percentage of their income. He added: \"What they want to see is value for money as we build out that clean infrastructure that we need.\" The government has promised communities disrupted by the new infrastructure that they should reap some of the benefits, including giving households near new pylons £2,500 off their energy bills over 10 years."
    },
    {
        "title": "How electricity grids fail - and why restoring Spain and Portugal's power will be a nightmare",
        "description": "We rarely think about how essential and reliable electricity grids are until they fail.",
        "url": "https://news.sky.com/story/how-electricity-grids-fail-and-why-restoring-spain-and-portugals-power-will-be-a-nightmare-13357727",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-madrid-outage_6900038.jpg?20250428173758",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-28 16:23:00",
        "Headline": "Keeping a grid running is a constant and highly complex balancing act. Gradually restoring one is a huge challenge for engineers. ",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  We rarely think about how essential and reliable electricity grids are until they fail. Now, millions of people across Spain, Portugal and parts of France are likely thinking of little else. While local power cuts are fairly common, what's happened across the Iberian peninsula is something far more extreme.  Much of Spain and Portugal's electricity transmission system collapsed in seconds including in major cities Lisbon, Madrid, Barcelona and Seville. Blackouts latest: 'Rare atmospheric phenomenon' behind outages  It's likely the outage will surpass Europe's largest blackout to date when 56 million people in Italy and Switzerland lost power for up to 12 hours in 2003. The cause of the outage is unclear. Portugal's grid operator has blamed a \"rare atmospheric phenomenon\" that caused \"anomalous oscillations\" in high voltage power lines in Spain. \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Ultra-processed foods could be linked to thousands of UK deaths a year - study\n                 \n                  You wouldn't steal a font: Famous anti-piracy campaign may have used pirated typeface\n                 Spain's grid operator has yet to respond to that or provide an update on the cause. But it's unlikely whatever caused the outage was a single, localised event. A major power line going down can cause a large outage - as it did in 2021, when an interconnector between France and Spain failed leaving a million people without power for a few hours. But it's unlikely to cause a system-wide failure of the kind we're seeing now. However, when things do start to fail on a power grid, they can cascade uncontrollably. Keeping a grid running is a constant and highly complex balancing act. Spain's mains AC electricity supply grid, like ours in the UK, runs at 50Hz. That frequency is based on the speed at which generating hardware such as gas and nuclear turbines spin. If there are sudden fluctuations in power supply or demand - a power station failing or a high voltage power line going down, for example - the frequency of AC power in the transmission lines changes and circuit breakers trip to protect either the transmission network, or power plant hardware from burning out. To prevent such failures, grid engineers constantly measure and forecast supply and demand to keep the grid balanced. More from Sky News:The 3G switch-off explained Just Stop Oil holds final protest To protect the system in emergencies, they occasionally have to \"shed load\" by cutting power to parts of the grid - the reason we've all experienced the occasional short-lived power cut. But if balance is lost, a grid can fail in a domino effect with sections of the grid tripping, then power plants shutting down to protect themselves from the drop in demand, one after another. The challenge now, and it's a nightmare for Spain and Portugal's power engineers, is to gradually restore the grid section by section while maintaining the balance of supply and demand. Act too fast, and the grid can trip again. Take too long and some power plants or substations might struggle to restart - especially if they rely on battery power to do so. While some regions of Spain have already had power restored, and Portugal says its power will be back to normal within hours, it could take much longer for the system to be fully restored."
    },
    {
        "title": "Ultra-processed foods could be linked to thousands of UK deaths a year - study",
        "description": "Thousands of UK deaths each year could be linked to the consumption of ultra-processed foods (UPFs), analysis suggests.",
        "url": "https://news.sky.com/story/ultra-processed-foods-could-be-linked-to-thousands-of-uk-deaths-a-year-study-13357542",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-unhealthy-foods-generic_6899806.jpg?20250428133126",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-28 11:07:00",
        "Headline": "Experts behind the research say they believe there is a relationship between people eating UPFs and an increased risk of early death.",
        "Content": "Thousands of UK deaths each year could be linked to the consumption of ultra-processed foods (UPFs), analysis suggests. Experts believe there is a relationship between people eating UPFs - such as processed meats, ice cream and crisps - and an increased risk of early death. UPFs often contain high levels of saturated fat, salt, sugar and additives, which researchers said leaves less room in people's diets for more nutritious foods. The analysis suggested that in 2018-19, some 17,781 premature deaths in the UK could have been linked to UPFs. Such foods also tend to include ingredients that are not normally used when people cook from scratch - including preservatives, emulsifiers and artificial colours and flavours. Other examples of UPFs include mass-produced bread, some breakfast cereals, biscuits, ready meals and fizzy drinks. UPFs have previously been linked to an increased risk of early death and a range of health issues, including obesity, heart disease, cancer and diabetes. However, some experts say it is not clear why UPFs are linked to poor health and more studies will be needed \"to establish the mechanisms involved\". The latest study, published in the American Journal Of Preventive Medicine, calls on governments to issue dietary recommendations aimed at cutting consumption of UPFs. In analysing data from eight countries, it was found UPFs made up 53% of people's energy intake in the UK - the second highest after 55% in the US. In Colombia, which has a lower consumption of UPFs, premature deaths attributable to these types of foods was 4%. But premature deaths from UPFs jumped to 14% for the UK and the US, according to the research. Read more from Sky News:UK temperatures could hit 29C this weekM&S tells agency staff to stay at home Lead researcher Eduardo Nilson, from the scientific body the Oswaldo Cruz Foundation in Brazil, said the study found \"each 10% increase in the participation of UPFs in the diet increases the risk of death from all causes by 3%\". Nerys Astbury, associate professor from the University Of Oxford, said it is known that consuming diets higher in calories, fat and sugar can have detrimental effects on health, including premature mortality. \"More research is needed to ascertain a causal link between UPF and disease and to establish the mechanisms involved,\" she added."
    },
    {
        "title": "You wouldn't steal a font: Famous anti-piracy campaign may have used pirated typeface",
        "description": "A famous anti-piracy campaign from the early 2000s is in the spotlight after it appeared the font used in the adverts was pirated.",
        "url": "https://news.sky.com/story/you-wouldnt-steal-a-font-famous-anti-piracy-campaign-may-have-used-pirated-typeface-13357462",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-font-piracy_6899646.png?20250428111642",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-28 09:35:00",
        "Headline": "The dramatic adverts, which compared pirating films to stealing cars, handbags and televisions, became a piece of pop culture history, with spoofs spawned for years afterwards.",
        "Content": "\n          Science and Technology reporter\n       A famous anti-piracy campaign from the early 2000s is in the spotlight after it appeared the font used in the adverts was pirated. The dramatic campaign compared pirating films to stealing cars, handbags and televisions, telling viewers: \"You wouldn't steal a car\". It appeared in cinemas and on DVDs around the world from 2004. But now, social media users have discovered the font used in the campaign was pirated from a typeface created by designer Just van Rossum. Bluesky user Rib extracted the fonts used in one of the campaign's old PDFs and discovered the pirated font Xband-Rough was used instead of Mr van Rossum's licensed font FF Confidential. Sky News was able to replicate this process and found the same results. There's no evidence to suggest that the campaign's designers were aware that the font was pirated, as copies of it were being widely shared at the time. The creator of the original font doesn't seem too worried, however. He told tech newsite TorrentFreak: \n                  Oil tanker hijacking: Somali pirates release ship and crew after gunfight\n                 \n                  Armed Somali pirates demand ransom for hijacked oil tanker\n                 \"I knew my font was used for the campaign and that a pirated clone named XBand-Rough existed. \"I did not know that the campaign used XBand-Rough and not FF Confidential, though. So this fact is new to me, and I find it hilarious.\" Read more from science, climate and technology:M&S tells agency workers to stay at home after cyberattackJust Stop Oil holds final protest, claiming it has been 'successful' The adverts became a piece of pop culture history, with spoofs spawned for years afterwards. In fact, if you try to go to the campaign's official URL, you will be redirected to the most famous spoof, a sketch in the sitcom IT Crowd. Sky News contacted the organisations behind the adverts, the UK's anti-piracy agency FACT, America's Motion Picture Association and the Intellectual Property Office of Singapore. FACT declined to comment, saying the campaign pre-dated anyone working at the organisation. The other two organisations did not immediately comment."
    },
    {
        "title": "'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman",
        "description": "\"Powerful individuals\" at the BBC are making the lives of their colleagues \"unbearable\", the corporation's chairman has said, after a review into its workplace culture.",
        "url": "https://news.sky.com/story/powerful-individuals-at-bbc-making-lives-of-colleagues-unbearable-says-chairman-13357508",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bbc-broadcasting-house_6842109.jpg?20250228111317",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-04-28 10:38:00",
        "Headline": "BBC chairman Samir Shah's remarks came as the findings of a review into the BBC's workplace culture were released in the wake of the Huw Edwards scandal.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  \"Powerful individuals\" at the BBC are making the lives of their colleagues \"unbearable\", the corporation's chairman has said, after a review into its workplace culture. The independent report, sparked by the Huw Edwards scandal, was carried out by Change Associates, the same management consultancy that led a similar review in 2013, following the Jimmy Savile scandal. BBC chairman Samir Shah told staff ahead of the report's release on Monday morning: \"There is a minority of people whose behaviour is simply not acceptable. And there are still places where powerful individuals - on and off screen - can abuse that power to make life for their colleagues unbearable.\" He said the report made recommendations to \"prioritise action over procedural change\", as well as addressing \"deep-seated issues\" including staff not feeling confident enough to speak up. Mr Shah added: \"In the end, it's quite simple: if you are a person who is prepared to abuse power or punch down or behave badly, there is no place for you at the BBC.\" While the review, which heard from around 2,500 employees and freelancers from 19 different countries, found no evidence of a toxic culture within the corporation, some staff said there was \"a minority of people at the BBC - both on and off-air - who were able to behave unacceptably without it being addressed\". The report said: \"Even though they are small in number, their behaviour creates large ripples which negatively impact the BBC's culture and external reputation.\" \n                  Star behaviour – will the scandals ever stop?      \n                 \n                  BBC has failed to foster an environment where employees feel comfortable about speaking up\n                 \n                  'They have to come up with another model': For many the BBC licence fee increase is a bad joke\n                 It said these people were \"dotted across the organisation in different functions and departments\", and were \"often in positions where power could be abused\". While no specific names were mentioned in the report, it did note \"some names were mentioned several times\". Some considered 'indispensable' One example of poor behaviour given included an \"untouchable\" presenter being \"called out for exceptionally inappropriate language\". It said that while \"a report was made\" and sanctions promised, a senior manager who was in the room at the time of the incident was \"perceived as deferring so as not to rock the boat\". It said a blind eye could be turned to poor behaviours \"when productions were award-winning or attracting large audiences,\" with some \"difficult\" presenters subsequently \"man-marked\" by BBC managers. The report went on to warn that, \"at its worst\", the corporation \"rewards\" such individuals \"by providing little or no consequence to their actions\". It recognised that some of those displaying \"unacceptable behaviour\" were perceived as \"indispensable\" to the corporation, and that by moving \"potentially vexatious issues\" to formal grievance without appropriate due diligence, the BBC was \"tolerating\" the problem. It also said that by keeping those who formally raised an issue \"in the dark about progress and outcomes,\" it was unfairly punishing them. 'Embarrassed and ashamed' The power imbalance between \"talent\" and \"crew\" was raised, with one report contributor saying: \"The pay differential between a producer and a flagship programme presenter is huge. The actual and perceived value of the presenter to the BBC versus the value to the BBC of the producer. How empowered really is a producer to raise and address issues?\" And while the report said many of the presenters they spoke to were \"embarrassed and ashamed to be associated with people who feature in the press for their behavioural misdemeanours\", it also noted the tendency to treat talent with kid gloves. One presenter said: \"As the so-called talent, I'm aware that no one wants to upset me, people laugh at jokes, fuss around me, can't do enough for me - it is false and unnecessary, and I can see how over time, some would come to expect it.\" The BBC board has fully accepted the report and its findings, as has BBC management. BBC director-general Tim Davie called the report \"an important moment for the BBC and the wider industry\". He said the corporation would implement the recommendations \"at pace\", making sure that BBC values are \"lived and championed by the whole organisation each and every day.\" Actions being taken include: • A strengthened code of conduct, with specific guidance for on-air presenters• A more robust disciplinary policy, with updated examples of misconduct and clear consequences• All TV production partners must meet Creative Industries Independent Standards Authority (CIISA) industry standards• A new \"Call It Out\" campaign to promote positive behaviour, empower informal resolution and challenge poor conduct• Clear pledges for anyone raising concerns, setting out what they can expect from the BBC Further actions include succession planning for the most senior on-air roles, a new \"resolving concerns helpline\", more training for managers and clearer behaviour expectations for freelancers. A difficult year for the BBC The BBC has been under pressure to act after a string of complaints against some of its top talent over the last 12 months. In September, Edwards, who was the BBC's lead news presenter, pleaded guilty to three counts of \"making\" indecent images of children. He was given a six-month suspended jail sentence and will be on the sex offenders' register for seven years.  Earlier this month, following a CPS review, Russell Brand was charged with rape and sexual assault. Brand, who worked for BBC Radio 2 and 6 Music between 2006 and 2008, denies all allegations against him and says all his sexual encounters were consensual. The BBC also apologised in January after a review found it \"did not take adequate action\" upon learning about concerns over former Radio 1 DJ Tim Westwood following claims of \"bullying and misogynistic behaviour\". Westwood has denied the allegations. Other allegations of misconduct against BBC talent include accusations of a toxic environment on Strictly Come Dancing and the firing of The One Show presenter Jermaine Jenas after he admitted sending inappropriate messages to female colleagues. And late last year, Gregg Wallace stepped down from his presenting role on MasterChef after multiple historical allegations of misconduct. Wallace's lawyers have said it is \"entirely false that he engages in behaviour of a sexually harassing nature\". Wallace has since said he is seeking \"space to heal\"."
    },
    {
        "title": "Kneecap should apologise for 'kill your MP' remarks, says murdered MP's daughter",
        "description": "The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\".",
        "url": "https://news.sky.com/story/kneecap-should-apologise-for-kill-your-mp-remarks-says-murdered-mps-daughter-13357465",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-28 09:32:00",
        "Headline": "Kneecap say they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\".",
        "Content": " The daughter of murdered MP Sir David Amess has called on Irish band Kneecap to apologise for allegedly telling fans \"kill your local MP\". Footage of the group at a November 2023 gig appears to show one member saying: \"The only good Tory is a dead Tory. Kill your local MP.\" Sir David was killed at a constituency surgery in 2021. Speaking to the UK Tonight With Sarah-Jane Mee, Katie Amess said: \"I'm more than happy to sit down and speak with them. I'm sure they've never met a victim of such a heinous crime, and so they're not thinking it through. \"If they were to meet with me and to see and to hear the pain and the torture and the torment that I go through every day, I'm sure they would feel terribly guilty. \"And I'm sure that they would apologise, because if not, what kind of people are they?\" Conservative leader Kemi Badenoch has demanded the prosecution of the rap trio Kneecap after the video emerged. Downing Street has described the alleged comments as \"completely unacceptable\". Police are investigating - and are also assessing footage reportedly from a gig a year later in London's Kentish Town Forum. In the November 2024 video, a member of the band appears to shout \"up Hamas, up Hezbollah\" - referencing groups which are banned as terrorist organisations in the UK. A Metropolitan Police spokesman said: \"We were made aware of a video on 22 April, believed to be from an event in November 2024, and it has been referred to the counter-terrorism internet referral unit for assessment and to determine whether any further police investigation may be required. \"We have also been made aware of another video believed to be from an event in November 2023.\" Mrs Badenoch said it was \"good\" the police were looking into the allegations, adding: \"Kneecap's glorification of terrorism and anti-British hatred has no place in our society. \"Now footage shows one of them saying: 'The only good Tory is a dead Tory. Kill your local MP'. \"After the murder of Sir David Amess, this demands prosecution.\" Ms Amess also welcomed the investigation. She told Sky News: \"I wake up every day with the knowledge that I will never see my father again. \"He will never meet my children. He wasn't able to be at my wedding. There's nothing funny about this. \"This is serious, and the government and the police need to take it seriously and to nip this in the bud and stop this kind of rhetoric being tolerated.\" Kneecap, made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In a statement Kneecap said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"We also reject any suggestion that we would seek to incite violence against any MP or individual. Ever. An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action.\" The band added: \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Read more from Sky News:UK temperatures could hit 29C this weekM&S tells agency staff to stay at home Mrs Badenoch and Kneecap are already known to each other. The Tory leader blocked a government grant to the bilingual Belfast group while she was business secretary. But last November, Kneecap won a discrimination challenge over the decision to refuse them a £14,250 funding award after the UK government conceded it was \"unlawful\". Downing Street condemned the alleged comments. \"We do not think individuals expressing those views should be receiving government funding,\" the prime minister's official spokesman said. Asked if the money should be returned, the spokesman added: \"That's up to the group, but clearly the PM rejects the views expressed ... does not shy away from condemning them.\""
    },
    {
        "title": "Kim Kardashian to testify in Paris armed robbery trial as proceedings get under way",
        "description": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week.",
        "url": "https://news.sky.com/story/kim-kardashian-to-testify-in-paris-armed-robbery-trial-as-proceedings-get-under-way-13357617",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-kardashian-kardashians_6899885.jpg?20250428144207",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-28 13:36:00",
        "Headline": "The reality star turned business mogul is expected to testify in person at the Palais de Justice next month.",
        "Content": "A trial has started in France over the 2016 heist in which armed robbers tied up Kim Kardashian and stole millions of dollars' worth of jewellery during Paris Fashion Week. The reality star turned business mogul was targeted during the early hours of 3 October 2016 while staying at the Hotel de Pourtales. Kardashian is expected to testify in person at the Palais de Justice on 13 May. Her lawyers said: \"Ms Kardashian is reserving her testimony for the court and jury and does not wish to elaborate further at this time. \"She has great respect and admiration for the French justice system and has been treated with great respect by the French authorities.\" Kim Kardashian's Paris robbery trial: Everything you need to know  The trial began with the selection of the jury of six citizens who will conduct the trial along with three magistrates - a procedure in France reserved for the most serious crimes. \n                  Kim Kardashian's Paris robbery trial: Everything you need to know\n                 \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 \n                  Kim Kardashian visits Lyle and Erik Menendez in jail amid controversy over Netflix show\n                 There were initially 12 defendants in the case, but one person has since died and another has a medical condition that prevents their involvement. Ten people - nine men and one woman - are currently standing trial. Five of the suspects - Yunice Abbas, Aomar Ait Khedache, Harminv Ait Khedache, Didier Dubreucq and Marc-Alexandre Boyer - are facing armed robbery and kidnapping charges. The remaining five defendants - Gary Madar, Christiane Glotin, Francois Delaporte and Marc Boyer - are charged with complicity in the heist or the unauthorised possession of a weapon. Two have acknowledged their participation. The others have denied it. The group has been nicknamed \"the grandpa robbers\" in local media, owing to some of them being in their 60s and 70s. The court heard how Kardashian told investigators she was taken to a bathroom and placed in the bathtub. Her attackers fled on bicycles or on foot, and she freed herself by removing the tape. She then rushed to her stylist's room and called her sister Kourtney. Kardashian told investigators that she had not been injured. She filed a complaint, adding that she wanted to leave France as soon as possible to be reunited with her children. According to her testimony and that of the concierge, Abderrahmane Ouatiki, at least one suspect had a handgun with which he threatened the victims. Lawyer Henri de Beauregard, representing Mr Ouatiki, said the intruders \"were experienced, determined criminals who did not hesitate to threaten him while he was working nights to finance his studies\". The robbers stole many pieces of jewellery estimated to be worth $6m, including Kardashian's engagement ring. Only one piece - a diamond cross on platinum that was lost during the suspects' escape - has been recovered. Two of the accused have partially confessed to the crime as their DNA was found at the scene. Aomar Ait Khedache, 68, is one of two who allegedly entered the apartment. Nicknamed \"Old Omar,\" his genetic profile was found on the tape used to gag Kardashian. Khedache's lawyer, Franck Berton, said his client was pleading guilty because he acknowledges his participation and \"will apologise, will actually explain how it happened, how he was contacted and finally how the events unfolded\". Khedache, who is deaf, will answer the court's questions in writing. He is said to have left the hotel on a bicycle, as did two others, then reportedly met his son, who was allegedly waiting for him in a parked car at a nearby train station. Yunice Abbas, 71, admitted tying up the concierge but denied going into Kardashian's apartment. He said he acted as a lookout in the ground floor reception area, making sure the escape route was clear. Gabriel Dumenil, Abbas' lawyer, said his client aims to \"deliver his own truth and explain the reasons that prompted him to do this and simply perhaps also ask for forgiveness and express his remorse\". Abbas was arrested in January 2017 and spent 21 months in prison before being released under judicial supervision. In 2021, he co-authored a French-language book titled \"I Kidnapped Kim Kardashian\". Didier Dubreucq, 69, known as \"Blue Eyes\", is the second alleged robber suspected of entering the apartment. He denies involvement, although he was filmed by CCTV cameras, and numerous telephone contacts with the other co-defendants show his involvement, according to the investigators. The other defendants are suspected of providing information about Kardashian's presence in the property or accused of playing a role in the reset of the jewellery in Antwerp, Belgium."
    },
    {
        "title": "Comedian Milton Jones reveals he has prostate cancer - as he cancels multiple UK tour dates",
        "description": "Comedian Milton Jones has revealed he has been diagnosed with prostate cancer.",
        "url": "https://news.sky.com/story/comedian-milton-jones-reveals-he-has-prostate-cancer-as-he-cancels-multiple-uk-tour-dates-13357720",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milton-jones-comedian_6900039.jpg?20250428174049",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-28 16:14:00",
        "Headline": "The 60-year-old, who is known for his appearances on Mock The Week, received a number of supportive messages, including from Olympic cyclist Sir Chris Hoy.",
        "Content": "Comedian Milton Jones has revealed he has been diagnosed with prostate cancer. The 60-year-old, who is known for his appearances on Mock The Week, has cancelled a number of UK tour dates as he undergoes surgery. In an Instagram post, he said the cancer was treatable, adding: \"Thanks for your support and respecting my privacy during this time. This decision has not been taken lightly, trust me. \"Abnormal service will resume as soon as possible and I'm looking forward to being back out on the road again soon - though probably not on a bike.\" Jones said he would be \"undergoing surgery soon\", adding he will \"need time afterwards to fully recover\". Olympic cyclist Sir Chris Hoy, who himself has stage four cancer after his prostate cancer spread, replied: \"Really sorry to hear it mate, best of luck.\" Fellow comedian Al Murray added: \"All the best Milton for a speedy recovery.\" Read more from Sky News:'Powerful individuals' at BBC making lives of colleagues 'unbearable'Badenoch demands prosecution of rap group over 'dead Tory' remark Jones apologised as he announced the cancellation of several dates of his ongoing Ha!Milton Tour. The Richmond-born comedian said shows in Leeds, Coventry, Basingstoke, Sterts, Launceston, Durham, Hexham, Ilkley, Wakefield, Lichfield, Tunbridge Wells, Portsmouth and Lyme Regis would no longer go ahead, while shows in Colchester, London, Bridlington and Stroud would be rescheduled to the autumn. Jones's career has seen him perform on Live At The Apollo, Lee Mack's All Star Cast and Michael McIntyre's Comedy Roadshow."
    },
    {
        "title": "You wouldn't steal a font: Famous anti-piracy campaign may have used pirated typeface",
        "description": "A famous anti-piracy campaign from the early 2000s is in the spotlight after it appeared the font used in the adverts was pirated.",
        "url": "https://news.sky.com/story/you-wouldnt-steal-a-font-famous-anti-piracy-campaign-may-have-used-pirated-typeface-13357462",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-font-piracy_6899646.png?20250428111642",
        "type": "Entertainment",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-28 09:35:00",
        "Headline": "The dramatic adverts, which compared pirating films to stealing cars, handbags and televisions, became a piece of pop culture history, with spoofs spawned for years afterwards.",
        "Content": "\n          Science and Technology reporter\n       A famous anti-piracy campaign from the early 2000s is in the spotlight after it appeared the font used in the adverts was pirated. The dramatic campaign compared pirating films to stealing cars, handbags and televisions, telling viewers: \"You wouldn't steal a car\". It appeared in cinemas and on DVDs around the world from 2004. But now, social media users have discovered the font used in the campaign was pirated from a typeface created by designer Just van Rossum. Bluesky user Rib extracted the fonts used in one of the campaign's old PDFs and discovered the pirated font Xband-Rough was used instead of Mr van Rossum's licensed font FF Confidential. Sky News was able to replicate this process and found the same results. There's no evidence to suggest that the campaign's designers were aware that the font was pirated, as copies of it were being widely shared at the time. The creator of the original font doesn't seem too worried, however. He told tech newsite TorrentFreak: \n                  Oil tanker hijacking: Somali pirates release ship and crew after gunfight\n                 \n                  Armed Somali pirates demand ransom for hijacked oil tanker\n                 \"I knew my font was used for the campaign and that a pirated clone named XBand-Rough existed. \"I did not know that the campaign used XBand-Rough and not FF Confidential, though. So this fact is new to me, and I find it hilarious.\" Read more from science, climate and technology:M&S tells agency workers to stay at home after cyberattackJust Stop Oil holds final protest, claiming it has been 'successful' The adverts became a piece of pop culture history, with spoofs spawned for years afterwards. In fact, if you try to go to the campaign's official URL, you will be redirected to the most famous spoof, a sketch in the sitcom IT Crowd. Sky News contacted the organisations behind the adverts, the UK's anti-piracy agency FACT, America's Motion Picture Association and the Intellectual Property Office of Singapore. FACT declined to comment, saying the campaign pre-dated anyone working at the organisation. The other two organisations did not immediately comment."
    }
]