[
    {
        "title": "Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation",
        "description": "David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM.",
        "url": "https://news.sky.com/story/lammy-appointed-justice-secretary-and-deputy-pm-following-rayners-resignation-13425692",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-david-lammy-shabana-mahmood_7012268.jpg?20250906001444",
        "type": "Home",
        "Author": "Will Charley",
        "Date Published": "2025-09-05 17:38:00",
        "Headline": "Sir Keir Starmer has carried out a major ministerial reshuffle following Angela Rayner's exit. Here's what you need to know.",
        "Content": "\n          Political reporter\n              @WillCharley1\n  David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM. Mr Lammy's move was one of the most momentous of Sir Keir Starmer's ministerial reshuffle on Friday afternoon, which saw a whole host of roles change hands, and two departments partially combined. Politics latest: Follow for live updates The PM moved him away from one of the great offices of state, despite his apparently burgeoning 'bromance' with US vice president JD Vance. But Mr Lammy benefited from Angela Rayner's departure. The deputy prime minister and housing secretary resigned from government on Friday morning, after it was found she had breached the ministerial code over her tax affairs. Sir Keir regretfully accepted her resignation, leaving her roles vacant. Thus began the ministerial reshuffle, brought forward by several weeks as a result of Ms Rayner's departure. Mr Lammy has been given the role of deputy prime minister, and appeared cheery on Friday afternoon - strolling up Downing Street in the sunshine with a big smile on his face. \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  His move from the Foreign Office to the Ministry of Justice then allowed Yvette Cooper, the home secretary, to take on Mr Lammy's previous job. She has never served in any role involving foreign affairs before, bar a three-month stint as shadow foreign secretary in 2010. Her pivot to foreign affairs then allowed the biggest promotion of them all, with then justice secretary and key Starmer ally, Shabana Mahmood, being appointed as home secretary. This means that for the first time in British history, all three great offices of state, after the prime minister, are held by women. With those roles rejigged, and Number 10 insisting from the start that Rachel Reeves was safe as chancellor, it was time to tinker with the rest of the cabinet. It appears that while the reshuffle was carried out unexpectedly early, a lot of thought had gone into it. Sir Keir began by creating a new 'super ministry', combining the skills remit of the Department for Education with the Department for Work and Pensions.  Pat McFadden, on Friday morning the chancellor of the Duchy of Lancaster (the highest ranking Cabinet Office minister), has been given responsibility for this new ministerial empire. It also means that Bridget Phillipson, who was and remains the education secretary, has had her responsibilities slimmed down. Officially, Mr McFadden has become the work and pensions secretary. This meant the current occupant of that role, Liz Kendall, also needed to be reshuffled. She has now been appointed as the science, innovation and technology secretary. Her predecessor in that role, Peter Kyle, in turn received a promotion to lead the Department of Business and Trade. Mr Kyle made incorporating and using AI a key part of his first year in office, and had been seen to be doing well in the job. His promotion, though, has led to the current business secretary, Jonathan Reynolds, being left without a department. While he remains in the cabinet, his appointment to the job of chief whip is unlikely to be viewed as a promotion. The reshuffle brought better news for Darren Jones, who was only promoted on Monday to the newly created role of chief secretary to the prime minister. He got to keep his role, but was gifted Mr McFadden's old job - chancellor of the Duchy of Lancaster - to add to his growing political portfolio.  Read more:Cabinet reshuffle: Who's in and who's outWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time Steve Reed, another long-time Starmer ally, benefitted alongside Mr Lammy from Ms Rayner's departure. He has been given her former role of housing secretary, leaving behind the Department for Environment, Food and Rural Affairs. Also ending in a better position than they started off on Friday morning are Emma Reynolds, a Treasury minister who has now received Mr Reed's old job, and trade minister Douglas Alexander, who has now become the Scotland secretary. Sir Alan Campbell, previously chief whip, has now become leader of the House of Commons. On the other side of the spectrum, former leader of the Commons Lucy Powell, and ex-Scotland secretary Ian Murray, joined Ms Rayner in leaving the government. Both were sacked, and both made clear their desire not to lose their roles. Ms Powell said it had been \"an honour\" to serve but warned that \"the future of our democracy looks uncertain\", citing rising levels of \"abuse, misrepresentation.... and the call for easy answers\". Mr Murray also echoed this sentiment, stating that politics in the UK \"is at a dangerous crossroads\". He called on MPs to bring \"prosperity, hope and our communities together, rather than furthering division and despair\", and said he would support Sir Keir's government from the backbenches."
    },
    {
        "title": "Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party",
        "description": "It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted.",
        "url": "https://news.sky.com/story/angela-rayner-may-no-longer-be-at-the-top-table-but-she-remains-a-powerful-force-in-the-labour-party-13425829",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-labour_7012455.jpg?20250905222440",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-05 20:58:00",
        "Headline": "Ms Rayner is badly wounded but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more.",
        "Content": "\n          Political editor\n              @BethRigby\n It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted. And so he should: Ms Rayner's departure from his government is a huge loss. She is a powerhouse within the Labour Party and a figurehead of the left, who brought Sir Keir's project some legitimacy from quarters of the Labour movement minded to give him short shrift. Describing her as a \"true friend\" and the embodiment of the sort of social mobility he would want to leave as his legacy in office, it was clear that the prime minister both mourned her departure and wanted to keep his formidable and politically astute former deputy onside. Because her departure does create difficulties. She is badly-wounded now, but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more. Ms Rayner is a politician deeply admired in pockets of the party and a product of the trade union movement. Politics latest: Cabinet reshuffle after Rayner quits  There is no sense that she would be disloyal to Sir Keir but she is a figurehead whether she wants it or not. The manner of her departure - forced out because she underpaid her tax and in doing so failed to uphold the highest standards in public office, is also difficult. Sir Keir's rivals will be armed with plenty of ammunition this Budget should the chancellor choose to raise property taxes even as a leading Labour figure underpaid theirs. There is also the matter of the deputy Labour leadership race: this is an elected post that Ms Rayner quit on Friday and already there is a battle emerging between the party's left and centre right over who should succeed her. As the saying goes, \"divided parties don't win elections\" and Labour's divisions are now about to be put on full display in a very public race to replace Ms Rayner at the top of the Labour Party. But for all these difficulties, Sir Keir on Friday sought to turn a crisis into a catalyst for change by completely overhauling his top team in a reshuffle that even serving cabinet ministers had no clue was coming. Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next electionThe working class mum who left school at 16 and became deputy PM  This is a prime minister that is trying to reinvigorate a flagging government and reset a stuttering Number 10. It was decisive and defiant. For months he has been under fire for being too careful and cautious, tentative and timid. But today he has rolled the dice and changed the top team in an effort to reset the government and get back to winning ways. The biggest changes reserved for the two of the biggest priorities: a new home secretary in Shabana Mahmood tasked with tackling the small boats crisis and a new super ministry, headed up by Sir Keir's close ally Pat McFadden, to tackle the burgeoning welfare bill and get people back to work. One senior figure told me on Friday night that the prime minister had been thinking hard over the summer about having a \"kitchen cabinet\" - a phrase which alludes to a band of trusted advisors - to give him more advice.  In this reshuffle you can see some of the fruits of that, with his leadership campaign manager and close friend David Lammy becoming deputy prime minister and Jonathan Reynolds moving to chief whip - a critical role for a prime minister struggling with his backbenches - and Mr McFadden tasked with another key job. \"What he needs are politicians he feels comfortable with,\" said one figure. \"This is about the PM reaching for the right kind of support and a team he trusts and can rely on\". Ms Rayner is no longer around that table but she will remain a powerful force in the Labour Party and British politics as we watch what she does next from the backbenches. Sir Keir will hope his fresh top table can restore some of his power too. It is hard to see now how this prime minister gets back to his winning ways, but this reshuffle at least showed an appetite to try."
    },
    {
        "title": "Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?",
        "description": "Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home.",
        "url": "https://news.sky.com/story/cabinet-reshuffle-whos-on-keir-starmers-new-team-and-whos-out-13425636",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cabinet-reshuffle-yvette-cooper_7012244.jpg?20250905185730",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-05 15:48:00",
        "Headline": "The prime minister has completed a major cabinet reshuffle, replacing key figures in his top team. But who is in and who is out?",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home. The prime minister's former right-hand woman stepped down as deputy prime minister, housing secretary and deputy leader of the Labour Party after standards adviser Sir Laurie Magnus found she had breached the ministerial code. Politics latest: Reshuffle after Rayner quits She paid standard stamp duty on a flat she bought in Hove, East Sussex, in May after taking advice that it counted as her only home due to her disabled son's trust owning the family home in Ashton-under-Lyne - but it was established she should have paid more. Her resignation has left a hole around the cabinet table, which Sir Keir is now filling.  It was stressed early on Chancellor Rachel Reeves would remain as chancellor, in an attempt to stop the markets moving. Read more: The working class mum who left school at 16 and became deputy PM \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 This is who is moving and where to: David Lammy - foreign secretary to justice secretary and deputy PM After flexing his diplomatic muscles with Donald Trump and his deputy JD Vance over the past year, Mr Lammy will now move to the justice brief. The move is likely to be a blow as the PM had promised, most recently in November, he would be foreign secretary for the whole parliament until 2029. Although he is no longer holding one of the four great offices of state, he has also been made deputy prime minister, presumably to soften the blow. Mr Lammy is close to Sir Keir, both as a friend and in his next door constituency, and was seen grinning as he went into Number 10 after being appointed. Yvette Cooper - home secretary to foreign secretary The Labour stalwart had made tackling illegal migration a priority, so the move could be seen as a disappointment for her. However, she remains in one of the four great offices of state - PM, chancellor, foreign and home. Shabana Mahmood - justice secretary to home secretary A big promotion, the straight-talking Labour MP will be tasked with tackling the small boats crisis and asylum seeker hotel protests. She is no stranger to making difficult decisions, deciding to free criminals early to reduce prison overcrowding as justice secretary. Her move makes it the first time all three great offices of state, after the prime minister, are held by women. Pat McFadden - chancellor of the Duchy of Lancaster and intergovernmental minister to work and pensions secretary and head of \"super ministry\" Often seen as Sir Keir's \"number two\", Mr McFadden will take over a newly formed \"super ministry\". It will include the department for work and pensions and the skills remit of the department for education - taking a large part of Education Secretary Bridget Phillipson's brief and taking over from Liz Kendall as work and pensions secretary. While it is not a promotion at first glance, it is a much wider role than he has had as chancellor of the Duchy of Lancaster - the highest-ranking Cabinet Office minister after the PM. Darren Jones - chancellor of the Duchy of Lancaster It is the second new job in the space of one week for the new chancellor of the Duchy of Lancaster. The close ally of the prime minister was promoted from chief secretary to the Treasury on Monday to chief secretary to the prime minister. And now he gets another new job. Steve Reed - environment secretary to housing secretary A promotion for the man who has consistently defended the government lifting inheritance tax relief on farmers. He takes over one of the two major vacancies left by Ms Rayner and will have the massive task of building 1.5 million new homes during this parliament, as promised by the government. Jonathan Reynolds - business and trade secretary to chief whip A slightly odd move for the MP seen as a steady pair of hands in his business secretary role. He takes over from Sir Alan Campbell and will now have to hustle Labour MPs to vote with the government - something that has sometimes proved difficult with the current cohort. Mr Reynolds will also attend cabinet, as is necessary so he can liaise between the party and No 10. Peter Kyle - science secretary to business and trade secretary A promotion for Mr Kyle, who is taking over from Jonathan Reynolds. He is seen as a rising star and impressed Labour MPs when he refused to stand down after suggesting Nigel Farage was on the side of people like Jimmy Savile by opposing the government's online safety law. Mr Kyle will be in charge of getting trade deals with other countries over the line. Emma Reynolds - economic secretary to the Treasury to environment secretary Probably the biggest promotion of the reshuffle, Ms Reynolds is taking on Mr Reed's role after serving as a junior minister in the Treasury. She will have to take on farmers and deal with the water companies - a big undertaking. Liz Kendall - work and pensions secretary to science, innovation and technology secretary Pat McFadden has taken her role as work and pensions secretary, while Ms Kendall takes over Peter Kyle's brief. He has made AI a major facet of his role so we will wait to see which direction Ms Kendall takes the job in. Douglas Alexander - trade policy minister to Scotland secretary A promotion for the Blair/Brown minister who returned to politics last year after being ousted in 2015 by then 20-year-old SNP MP Mhairi Black. He takes over from Ian Murray, who has been removed from the cabinet. Sir Alan Campbell - Chief whip to Lord President of the Council and leader of the House of Commons An MP since 1997 and part of Tony Blair and Gordon Brown's frontbench, Sir Alan is taking over Lucy Powell's role. He will be in charge of organising government business in the Commons - a sizeable job. Who is out? Lucy Powell has been sacked as leader of the House of Commons. Ian Murray has been sacked as Scotland secretary. Not out - but Bridget Phillipson remains as education secretary but her brief has narrowed as Mr McFadden has taken over the skills part of her job."
    },
    {
        "title": "What a moment for Shabana Mahmood to take the helm at the Home Office",
        "description": "Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary. ",
        "url": "https://news.sky.com/story/what-a-moment-for-shabana-mahmood-to-take-the-helm-at-the-home-office-13425665",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-shabana-mahmood-taser_6975862.jpg?20250728102659",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-05 16:45:00",
        "Headline": "Ms Mahmood, considered a \"blue Labour\" social conservative, will take charge of the police, MI5 and the government's domestic direction of travel at a time of great flux.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary.  The department she will now head up will be making dynamic shifts to counter the public mood on immigration and grooming gangs. Politics latest: Major cabinet reshuffle What a moment for the Home Office mantle to be grasped by the first Muslim woman to occupy one of the great offices, taking charge of the police, MI5 and the government's domestic direction of travel at a time of great flux. She has also become the home secretary of a country where the national flag is being hoisted as a symbol of dissatisfaction - with anger at the arrival of desperate migrants crossing the Channel in small boats. Ms Mahmood picks up the in-tray of a home secretary who has been forced to make moves that often seemed to defy her natural position - tougher rules on asylum seekers, proscribing a pro-Palestinian group of activists, and ordering an inquiry into grooming gangs. But perhaps all this will come more naturally to our new home secretary. \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 \n                  'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls\n                 \n                  Two Labour-run councils 'considering all options' to challenge migrant hotel use\n                 The Oxford-educated MP is considered a \"blue Labour\" social conservative. Only last month she announced that foreign criminals will be deported after sentencing to free up prison space and protect the public.  Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next election On the issue of Asian grooming gangs, she recently told former Tory Cabinet minister Michael Gove in the Spectator that \"there is still a moment of reckoning\", adding \"there is still an outstanding question of why so many people looked the other way\". She studied at Lincoln College, Oxford, where she managed to win the vote of Rishi Sunak to become junior common room president, and she used her electioneering skills to help Prime Minister Sir Keir Starmer win the general election. She had declined a position in Jeremy Corbyn's shadow cabinet and became crucial to Labour's regeneration, describing her role as \"dragging them back to a position of common sense\". Ms Mahmood will need that antenna for public opinion in the months to come."
    },
    {
        "title": "Rookie diplomat Yvette Cooper could not be picking up the Foreign Secretary reins at a more challenging time",
        "description": "David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary.",
        "url": "https://news.sky.com/story/rookie-diplomat-yvette-cooper-could-not-be-picking-up-the-foreign-secretary-reins-at-a-more-challenging-time-13425682",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-yvette-cooper-downing-street_7012221.jpg?20250905183442",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-05 17:27:00",
        "Headline": "Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary. Those who travelled with him observed a man in his element, whether in the frozen wastes of Svalbard or the corridors of power. He confided that he expected to stay in the job for the duration of this parliament. So much for all that. Follow the latest: Lammy, Cooper and Mahmood get new jobs While opinions differ on how good he was at his job, he certainly revelled in it and threw himself into the role. He is making way for someone who has never held an international affairs posting in government. Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front. And yet this rookie diplomat could not be taking up the reins as Britain's foreign secretary at a more challenging time. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 The war in Ukraine has mutated into something even more challenging than the biggest land war on the continent of Europe since the Second World War. It is turning into a monumental struggle between East and West. Vladimir Putin is resurgent, striding the world stage again, and this week winning more support from China and North Korea. The West seems divided between Europeans who want a ceasefire and more severe sanctions on Russia's oil trade and Donald Trump, who doesn't anymore but seems at a loss over what to do instead. Gaza is sinking into even more of a horror show with no let-up in the war, and accusations that the Labour government is conniving in an alleged genocide perpetrated by Israel. On top of the diary entries Yvette Cooper will be handed as she takes up her new job will be the UN General Assembly in New York, where Britain is expected to recognise the state of Palestine along with other nations. Read more:Cabinet reshuffle: Who's in and who's out?In full: Angela Rayner's resignation letter If the Home Office is known for being strewn with banana skins, the Foreign Office is rigged with minefields. Foremost among them, the Middle East and the Starmer government's attempts to walk a perilous tightrope between friends of Israel and supporters of the Palestinians. David Lammy was criticised by some for not being firm enough or decisive. In his defence, he had not been in the job that long, and he avoided any massive missteps. He thought deeply about his role and seemed adept at managing the Trump administration. Not bad for someone who once called Donald Trump a \"neo nazi sociopath\". He managed to maintain good relations with both Barack Obama and JD Vance. Yvette Cooper has a reputation for straight talking, not always helpful in diplomacy. But she is regarded as intellectually rigorous, preferring substance over style. She will need to be a quick learner as she tries to master her brief in a world that is only becoming more dangerous and more complicated."
    },
    {
        "title": "From non-job to key job - Why there's so much at stake in the election for Rayner's replacement",
        "description": "It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war.",
        "url": "https://news.sky.com/story/from-non-job-to-key-job-why-theres-so-much-at-stake-in-the-election-for-rayners-replacement-13425671",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-bespoke-rayner_7011923.jpg?20250905132200",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-05 17:03:00",
        "Headline": "Labour's deputy role was once thought of as a nothing job, but it's now become a key position - and will be fiercely fought over.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war. The contest, whenever it happens, could potentially be the most divisive since the bitter left-right split when Tony Benn challenged the incumbent, Denis Healey, in 1981. It was the year of the launch of the breakaway SDP by the \"Gang of Four\" - Roy Jenkins, David Owen, Shirley Williams and Bill Rodgers - and defections by several more Labour MPs. There was speculation that if Benn had won - then in his hard-left phase before he became a national treasure in his latter years - there would be far more defections to the SDP. Politics latest - follow live This time, however, the threat of defections by Labour MPs comes not from the centre, but from Jeremy Corbyn's new party, which could be triggered if the left's candidate is crushed. So many Labour MPs will want to see a candidate elected to replace Ms Rayner who provides a balanced ticket, a left-right combination with Sir Keir Starmer. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  Back in 1981 the Benn-Healey battle was fought out in a filthy mood at Labour's autumn conference in Brighton, with the former chancellor winning by a wafer-thin 50.4% to 49.6%. The mood was so poisonous that Neil Kinnock, who'd refused to back Mr Benn, has claimed he was assailed by a young Benn supporter in the lavatory of the Grand Hotel and boasted: \"I beat the **** out of him.\" Contrast that with the comradely contest when Ms Rayner beat rivals Richard Burgon, Dawn Butler, Rosena Allin-Khan and Ian Murray in a ballot of party members in 2020. Of those four, a furious Mr Murray has just been sacked as Scotland Secretary by Sir Keir, while Mr Burgon and Ms Butler are regarded as likely to stand again this time. Big names and famous faces in the role throughout the years Over the years, some big names have been Labour's deputy leader, including Clement Attlee in the 1930s before he became leader and left-wing firebrand Aneurin Bevan for a year, until his death in 1960. Mr Healey was followed in 1983 by Roy Hattersley, who'd stood on a so-called \"dream ticket\" with Mr Kinnock. Mr Benn and fellow left-winger Eric Heffer were derided by MPs as \"the nightmare ticket\". Then came Margaret Beckett, John Prescott, Harriet Harman and Tom Watson. But of all Labour's deputies, Mr Attlee was the only one to go on to become leader and a Labour prime minister. The post was said to be a non-job under Harold Wilson when his deputy was George Brown, better known for his drinking than his political achievements, and Ted Short, who even called his memoirs \"I Knew My Place\". It was the bruising Benn-Healey contest that elevated the status of deputy leader. And the two most famous recent deputies, John Prescott and Angela Rayner, went on to become deputy prime minister. So from a non-job, it's become a key job. Mr Prescott and Ms Rayner were seen as human shields for Mr Blair and Sir Keir against the left and the more militant trade unions. Read more:Rayner admits she should have paid more stamp dutyRayner came out fighting in Sky interviewRayner's tax affairs statement in full No wonder Sir Keir's handwritten letter to Ms Rayner after her resignation was so friendly and sympathetic. He didn't want to lose his human shield. In the Conservative Party, Margaret Thatcher famously said of her deputy William Whitelaw: \"Every prime minister needs a Willie.\" In the Labour Party, these days every prime minister needs a protector, a gatekeeper, a fixer and a go-between. That's why there's so much at stake in the election for Angela Rayner's successor."
    },
    {
        "title": "British couple killed in Lisbon funicular crash named",
        "description": "Two of the three Britons killed in the Lisbon funicular crash have been named.",
        "url": "https://news.sky.com/story/british-couple-killed-in-lisbon-funicular-crash-named-13425823",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lisbon-kayleigh-smith_7012432.jpg?20250905220811",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-05 20:57:00",
        "Headline": "There is speculation the steel cable linking the two carriages may have snapped or that the brakes on one of the cars failed. A preliminary technical report is due on Saturday.",
        "Content": "Two of the three Britons killed in the Lisbon funicular crash have been named. Kayleigh Smith, 36, and William Nelson, 44, were a couple and died alongside 14 others in Wednesday's incident. Ms Smith graduated from the Arden School of Theatre in Manchester, where Mr Nelson ran the master's degree in directing.  The identity of the third British victim has not yet been confirmed. MADS theatre in Macclesfield, Cheshire, said Ms Smith was a \"valued member of our society\" who will be \"greatly missed\". It said she was an award-winning director and actress, who had also done multiple crew and front-of-house roles. Five Portuguese citizens died when the packed carriage plummeted out of control - four of them workers at a charity on the hill - but most victims were foreigners. Police said the other fatalities were two Canadians, two South Koreans, one American, one French citizen, one Swiss and one Ukrainian. All but one were declared dead at the scene - and 21 others in the packed carriage were injured.  The yellow carriages of the Gloria funicular are a big draw for tourists, as well as a proud symbol of the Portuguese capital. The journey is just 265m (870ft) up a steep hill and takes three minutes, with two carriages travelling in opposite directions on a linked cable. Read more:Everything we know about the Lisbon crash Witnesses reported seeing one of the carriages hurtle down the hill before derailing and crashing 30m from the bottom. The aftermath shows it crumpled and twisted against the side of a building. People who were in the bottom carriage said they were a few metres into the climb when it started going backwards. When they saw the other car speeding towards them, many jumped through the windows to escape. Prime Minister Luis Montenegro called the crash \"one of the biggest tragedies of our recent past\" and authorities are under intense pressure to quickly identifying the cause. One witness who was in the lower carriage told Sky's Europe correspondent Alistair Bunkall that the brakes appeared to fail. The carriage's brakeman, Andre Marques, has also been confirmed among the dead.  Officials said the streetcar, which has been running since 1914, had a half-hour visual inspection every day and underwent full maintenance last year. The line links the downtown area near Restauradores Square with Lisbon's Bairro Alto neighbourhood. A preliminary technical report due on Friday has now been delayed until Saturday. Another report with a broader scope is expected within 45 days. Three other funicular lines in Lisbon have been suspended."
    },
    {
        "title": "Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'",
        "description": "Bribes have been used to beat the long waiting lists for affordable homes, according to the City of London Police - which has now launched an investigation into corrupt housing officers.",
        "url": "https://news.sky.com/story/two-arrested-as-police-suspect-corrupt-council-staff-allocated-hundreds-of-homes-for-cash-13425562",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dagenham-london_7012014.jpg?20250905144721",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-05 23:01:00",
        "Headline": "Investigators believe there was blatant advertising on social media offering prospective tenants a means to beat the queue for affordable housing. ",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Bribes have been used to beat the long waiting lists for affordable homes, according to the City of London Police - which has now launched an investigation into corrupt housing officers. Two people have been arrested and police say \"evidence exists\" that hundreds of homes have been allocated through fraudulent dealings in the east London borough of Barking and Dagenham. Officers believe homes were sometimes sublet by associates of housing officers. Investigators also believe there was blatant advertising on social media offering prospective tenants a means to beat the queue. The force said: \"As part of this process, prospective tenants paid fraudsters 'finder's fees', and inflated rents. \"Some rents were paid in part to London Borough Barking Dagenham Council and some were not.\" The council's counter-corruption team is assisting in the investigation and says it follows months of intelligence gathering. Leader of the council, Dominic Twomey, said: \"Every day, our fraud team are behind the scenes, looking into anything from corruption concerns to illegal sub-letting. \n                  Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness\n                 \n                  Rushanara Ali: Labour promised to fix housing - but are they leading by example?\n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \"Ultimately their job is to make sure public money is being spent in the way it should be, so I'm really pleased their proactive work has helped lead to today's arrests.\" Affordable housing is a system of offering below-market-rate homes to support lower-income households and priority groups, such as those with disabilities. It is administered by local authorities, which set qualification requirements, such as residency periods and points-based systems to assess housing needs and wait times. Read more from Sky News:UK couple killed in Lisbon funicular crash namedRayner resigns after tax admissionDuchess of Kent dies Email us at news@skynews.com to share any information.\n Please include the name 'Jason Farrell' in the subject. Waiting lists in England have been increasing over decades due to a shortage of social homes. The latest government figures show the total number of households on the waiting list in 2023-24 was 1,330,611 - a six per cent rise on the year before. In April, a study by the National Housing Federation found Barking and Dagenham is one of the 50 councils with the longest waiting times - where at current rates, it would take over 15 years for a family joining the back of the queue to be allocated a three-bedroom home.  In these conditions, this issue of corruption is likely to extend beyond one council, housing campaigner Kwajo Tweneboa told Sky News. \"I've had people far beyond Barking and Dagenham reach out to me about the exact same issue of corruption, some even saying it's been going on for decades,\" he said. \"Let's be clear, exploiting people who are already suffering, just so individuals in the public sector can line their own pockets, is disgraceful. It has to be exposed and rooted out.\""
    },
    {
        "title": "Katharine, Duchess of Kent, dies aged 92",
        "description": "The Duchess of Kent has died at the age of 92, Buckingham Palace has said.",
        "url": "https://news.sky.com/story/katharine-duchess-of-kent-dies-aged-92-13425457",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duchess-of-kent-jana-novotna_7011962.jpg?20250905135027",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-05 10:29:00",
        "Headline": "The Union Flag at Buckingham Palace was lowered to half-mast as a mark of respect shortly after the duchess's death was announced. A formal framed announcement is displayed on the palace railings.",
        "Content": " The Duchess of Kent has died at the age of 92, Buckingham Palace has said. Katharine - who became the oldest living member of the Royal Family when Queen Elizabeth II died in 2022 - was known for consoling losing Wimbledon finalists, notably a tearful Jana Novotna in 1993. A skilled pianist, organist and singer, she dropped her HRH style, preferring to be known as Mrs Kent, and retreated from royal life to spend 13 years teaching music at a primary school in Hull. The palace said in a statement on Friday: \"It is with deep sorrow that Buckingham Palace announces the death of Her Royal Highness The Duchess of Kent. \"Her Royal Highness passed away peacefully last night at Kensington Palace, surrounded by her family. \"The King and Queen and all Members of The Royal Family join The Duke of Kent, his children and grandchildren in mourning their loss and remembering fondly The Duchess's life-long devotion to all the organisations with which she was associated, her passion for music and her empathy for young people.\" The Union Flag at Buckingham Palace was lowered to half-mast as a mark of respect shortly after the duchess's death was announced. A formal framed announcement is displayed on the palace railings. The Prince and Princess of Wales paid a personal tribute to the Duchess of Kent, praising her for working \"tirelessly to help others\" and describing her as a \"much missed member of the family\". Prime Minister Sir Keir Starmer said the Duchess of Kent brought \"compassion, dignity and a human touch to everything she did\", as he paid tribute following her death.   An online condolence book will be available in the coming days and funeral details will be announced in due course. Katharine married Prince Edward, the Duke of Kent - who is the cousin of the late Queen Elizabeth II - in a grand ceremony at York Minster in 1961. The couple have three surviving children, George, Earl of St Andrews, Lady Helen Windsor, and Lord Nicholas Windsor. Royal correspondent The Duchess of Kent was rarely seen in public in recent years, but at 92 years old was a much loved and respected member of the family and had a fascinating life. She brought royal glamour to Wimbledon with her annual appearances and yet was happiest rolling up her sleeves and teaching music to children, simply known as \"Mrs Kent\".  Her friends and those who knew her talk of her fun, her desire to just fit in as part of a very different community away from royal circles.  A woman who \"went into the staff room and made herself a cuppa like everybody else\" said the current headmistress of the school she taught at in Hull. We often talk of younger royals being socially engaged and wanting to tackle taboo subjects. Her openness in the 1990's to talk about miscarriage and depression was truly ahead of its time. Her decision to convert to Catholicism, because \"I do love guidelines\" another moment that thrust her into the media glare. The tributes from the royal family bring to life the legacy that she leaves. Her love of music and commitment to helping young people shine through in their messages. A Duchess who later in life had the most private life, her important contribution again brought into the royal spotlight. Read more from Sky News:Angela Rayner resigns from governmentThree Britons among Lisbon crash fatalities The duchess suffered heartbreak when she was forced to have a termination after catching German measles while pregnant in 1975. Two years later, she endured the devastation of giving birth to a stillborn son, Patrick. She led a separate life from the Duke of Kent for many years but the couple did not divorce - and were said to be closer than ever after Edward suffered a stroke in 2013, which prompted his wife to move back into their Kensington Palace home. Katharine's famous Wimbledon moments Her appearances at Wimbledon, where she presented the winners' trophies, became a familiar feature of the summer sporting calendar. In 1993, she put royal formalities and protocol aside to hug Novotna after she lost the ladies' singles final to Steffi Graff. Her relationship with Wimbledon authorities later soured, when she was refused permission to take the young son of murdered headmaster Philip Lawrence into the royal box at the tournament."
    },
    {
        "title": "Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation",
        "description": "David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM.",
        "url": "https://news.sky.com/story/lammy-appointed-justice-secretary-and-deputy-pm-following-rayners-resignation-13425692",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-david-lammy-shabana-mahmood_7012268.jpg?20250906001444",
        "type": "UK",
        "Author": "Will Charley",
        "Date Published": "2025-09-05 17:38:00",
        "Headline": "Sir Keir Starmer has carried out a major ministerial reshuffle following Angela Rayner's exit. Here's what you need to know.",
        "Content": "\n          Political reporter\n              @WillCharley1\n  David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM. Mr Lammy's move was one of the most momentous of Sir Keir Starmer's ministerial reshuffle on Friday afternoon, which saw a whole host of roles change hands, and two departments partially combined. Politics latest: Follow for live updates The PM moved him away from one of the great offices of state, despite his apparently burgeoning 'bromance' with US vice president JD Vance. But Mr Lammy benefited from Angela Rayner's departure. The deputy prime minister and housing secretary resigned from government on Friday morning, after it was found she had breached the ministerial code over her tax affairs. Sir Keir regretfully accepted her resignation, leaving her roles vacant. Thus began the ministerial reshuffle, brought forward by several weeks as a result of Ms Rayner's departure. Mr Lammy has been given the role of deputy prime minister, and appeared cheery on Friday afternoon - strolling up Downing Street in the sunshine with a big smile on his face. \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  His move from the Foreign Office to the Ministry of Justice then allowed Yvette Cooper, the home secretary, to take on Mr Lammy's previous job. She has never served in any role involving foreign affairs before, bar a three-month stint as shadow foreign secretary in 2010. Her pivot to foreign affairs then allowed the biggest promotion of them all, with then justice secretary and key Starmer ally, Shabana Mahmood, being appointed as home secretary. This means that for the first time in British history, all three great offices of state, after the prime minister, are held by women. With those roles rejigged, and Number 10 insisting from the start that Rachel Reeves was safe as chancellor, it was time to tinker with the rest of the cabinet. It appears that while the reshuffle was carried out unexpectedly early, a lot of thought had gone into it. Sir Keir began by creating a new 'super ministry', combining the skills remit of the Department for Education with the Department for Work and Pensions.  Pat McFadden, on Friday morning the chancellor of the Duchy of Lancaster (the highest ranking Cabinet Office minister), has been given responsibility for this new ministerial empire. It also means that Bridget Phillipson, who was and remains the education secretary, has had her responsibilities slimmed down. Officially, Mr McFadden has become the work and pensions secretary. This meant the current occupant of that role, Liz Kendall, also needed to be reshuffled. She has now been appointed as the science, innovation and technology secretary. Her predecessor in that role, Peter Kyle, in turn received a promotion to lead the Department of Business and Trade. Mr Kyle made incorporating and using AI a key part of his first year in office, and had been seen to be doing well in the job. His promotion, though, has led to the current business secretary, Jonathan Reynolds, being left without a department. While he remains in the cabinet, his appointment to the job of chief whip is unlikely to be viewed as a promotion. The reshuffle brought better news for Darren Jones, who was only promoted on Monday to the newly created role of chief secretary to the prime minister. He got to keep his role, but was gifted Mr McFadden's old job - chancellor of the Duchy of Lancaster - to add to his growing political portfolio.  Read more:Cabinet reshuffle: Who's in and who's outWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time Steve Reed, another long-time Starmer ally, benefitted alongside Mr Lammy from Ms Rayner's departure. He has been given her former role of housing secretary, leaving behind the Department for Environment, Food and Rural Affairs. Also ending in a better position than they started off on Friday morning are Emma Reynolds, a Treasury minister who has now received Mr Reed's old job, and trade minister Douglas Alexander, who has now become the Scotland secretary. Sir Alan Campbell, previously chief whip, has now become leader of the House of Commons. On the other side of the spectrum, former leader of the Commons Lucy Powell, and ex-Scotland secretary Ian Murray, joined Ms Rayner in leaving the government. Both were sacked, and both made clear their desire not to lose their roles. Ms Powell said it had been \"an honour\" to serve but warned that \"the future of our democracy looks uncertain\", citing rising levels of \"abuse, misrepresentation.... and the call for easy answers\". Mr Murray also echoed this sentiment, stating that politics in the UK \"is at a dangerous crossroads\". He called on MPs to bring \"prosperity, hope and our communities together, rather than furthering division and despair\", and said he would support Sir Keir's government from the backbenches."
    },
    {
        "title": "Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?",
        "description": "Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home.",
        "url": "https://news.sky.com/story/cabinet-reshuffle-whos-on-keir-starmers-new-team-and-whos-out-13425636",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cabinet-reshuffle-yvette-cooper_7012244.jpg?20250905185730",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-05 15:48:00",
        "Headline": "The prime minister has completed a major cabinet reshuffle, replacing key figures in his top team. But who is in and who is out?",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home. The prime minister's former right-hand woman stepped down as deputy prime minister, housing secretary and deputy leader of the Labour Party after standards adviser Sir Laurie Magnus found she had breached the ministerial code. Politics latest: Reshuffle after Rayner quits She paid standard stamp duty on a flat she bought in Hove, East Sussex, in May after taking advice that it counted as her only home due to her disabled son's trust owning the family home in Ashton-under-Lyne - but it was established she should have paid more. Her resignation has left a hole around the cabinet table, which Sir Keir is now filling.  It was stressed early on Chancellor Rachel Reeves would remain as chancellor, in an attempt to stop the markets moving. Read more: The working class mum who left school at 16 and became deputy PM \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 This is who is moving and where to: David Lammy - foreign secretary to justice secretary and deputy PM After flexing his diplomatic muscles with Donald Trump and his deputy JD Vance over the past year, Mr Lammy will now move to the justice brief. The move is likely to be a blow as the PM had promised, most recently in November, he would be foreign secretary for the whole parliament until 2029. Although he is no longer holding one of the four great offices of state, he has also been made deputy prime minister, presumably to soften the blow. Mr Lammy is close to Sir Keir, both as a friend and in his next door constituency, and was seen grinning as he went into Number 10 after being appointed. Yvette Cooper - home secretary to foreign secretary The Labour stalwart had made tackling illegal migration a priority, so the move could be seen as a disappointment for her. However, she remains in one of the four great offices of state - PM, chancellor, foreign and home. Shabana Mahmood - justice secretary to home secretary A big promotion, the straight-talking Labour MP will be tasked with tackling the small boats crisis and asylum seeker hotel protests. She is no stranger to making difficult decisions, deciding to free criminals early to reduce prison overcrowding as justice secretary. Her move makes it the first time all three great offices of state, after the prime minister, are held by women. Pat McFadden - chancellor of the Duchy of Lancaster and intergovernmental minister to work and pensions secretary and head of \"super ministry\" Often seen as Sir Keir's \"number two\", Mr McFadden will take over a newly formed \"super ministry\". It will include the department for work and pensions and the skills remit of the department for education - taking a large part of Education Secretary Bridget Phillipson's brief and taking over from Liz Kendall as work and pensions secretary. While it is not a promotion at first glance, it is a much wider role than he has had as chancellor of the Duchy of Lancaster - the highest-ranking Cabinet Office minister after the PM. Darren Jones - chancellor of the Duchy of Lancaster It is the second new job in the space of one week for the new chancellor of the Duchy of Lancaster. The close ally of the prime minister was promoted from chief secretary to the Treasury on Monday to chief secretary to the prime minister. And now he gets another new job. Steve Reed - environment secretary to housing secretary A promotion for the man who has consistently defended the government lifting inheritance tax relief on farmers. He takes over one of the two major vacancies left by Ms Rayner and will have the massive task of building 1.5 million new homes during this parliament, as promised by the government. Jonathan Reynolds - business and trade secretary to chief whip A slightly odd move for the MP seen as a steady pair of hands in his business secretary role. He takes over from Sir Alan Campbell and will now have to hustle Labour MPs to vote with the government - something that has sometimes proved difficult with the current cohort. Mr Reynolds will also attend cabinet, as is necessary so he can liaise between the party and No 10. Peter Kyle - science secretary to business and trade secretary A promotion for Mr Kyle, who is taking over from Jonathan Reynolds. He is seen as a rising star and impressed Labour MPs when he refused to stand down after suggesting Nigel Farage was on the side of people like Jimmy Savile by opposing the government's online safety law. Mr Kyle will be in charge of getting trade deals with other countries over the line. Emma Reynolds - economic secretary to the Treasury to environment secretary Probably the biggest promotion of the reshuffle, Ms Reynolds is taking on Mr Reed's role after serving as a junior minister in the Treasury. She will have to take on farmers and deal with the water companies - a big undertaking. Liz Kendall - work and pensions secretary to science, innovation and technology secretary Pat McFadden has taken her role as work and pensions secretary, while Ms Kendall takes over Peter Kyle's brief. He has made AI a major facet of his role so we will wait to see which direction Ms Kendall takes the job in. Douglas Alexander - trade policy minister to Scotland secretary A promotion for the Blair/Brown minister who returned to politics last year after being ousted in 2015 by then 20-year-old SNP MP Mhairi Black. He takes over from Ian Murray, who has been removed from the cabinet. Sir Alan Campbell - Chief whip to Lord President of the Council and leader of the House of Commons An MP since 1997 and part of Tony Blair and Gordon Brown's frontbench, Sir Alan is taking over Lucy Powell's role. He will be in charge of organising government business in the Commons - a sizeable job. Who is out? Lucy Powell has been sacked as leader of the House of Commons. Ian Murray has been sacked as Scotland secretary. Not out - but Bridget Phillipson remains as education secretary but her brief has narrowed as Mr McFadden has taken over the skills part of her job."
    },
    {
        "title": "Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party",
        "description": "It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted.",
        "url": "https://news.sky.com/story/angela-rayner-may-no-longer-be-at-the-top-table-but-she-remains-a-powerful-force-in-the-labour-party-13425829",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-labour_7012455.jpg?20250905222440",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-05 20:58:00",
        "Headline": "Ms Rayner is badly wounded but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more.",
        "Content": "\n          Political editor\n              @BethRigby\n It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted. And so he should: Ms Rayner's departure from his government is a huge loss. She is a powerhouse within the Labour Party and a figurehead of the left, who brought Sir Keir's project some legitimacy from quarters of the Labour movement minded to give him short shrift. Describing her as a \"true friend\" and the embodiment of the sort of social mobility he would want to leave as his legacy in office, it was clear that the prime minister both mourned her departure and wanted to keep his formidable and politically astute former deputy onside. Because her departure does create difficulties. She is badly-wounded now, but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more. Ms Rayner is a politician deeply admired in pockets of the party and a product of the trade union movement. Politics latest: Cabinet reshuffle after Rayner quits  There is no sense that she would be disloyal to Sir Keir but she is a figurehead whether she wants it or not. The manner of her departure - forced out because she underpaid her tax and in doing so failed to uphold the highest standards in public office, is also difficult. Sir Keir's rivals will be armed with plenty of ammunition this Budget should the chancellor choose to raise property taxes even as a leading Labour figure underpaid theirs. There is also the matter of the deputy Labour leadership race: this is an elected post that Ms Rayner quit on Friday and already there is a battle emerging between the party's left and centre right over who should succeed her. As the saying goes, \"divided parties don't win elections\" and Labour's divisions are now about to be put on full display in a very public race to replace Ms Rayner at the top of the Labour Party. But for all these difficulties, Sir Keir on Friday sought to turn a crisis into a catalyst for change by completely overhauling his top team in a reshuffle that even serving cabinet ministers had no clue was coming. Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next electionThe working class mum who left school at 16 and became deputy PM  This is a prime minister that is trying to reinvigorate a flagging government and reset a stuttering Number 10. It was decisive and defiant. For months he has been under fire for being too careful and cautious, tentative and timid. But today he has rolled the dice and changed the top team in an effort to reset the government and get back to winning ways. The biggest changes reserved for the two of the biggest priorities: a new home secretary in Shabana Mahmood tasked with tackling the small boats crisis and a new super ministry, headed up by Sir Keir's close ally Pat McFadden, to tackle the burgeoning welfare bill and get people back to work. One senior figure told me on Friday night that the prime minister had been thinking hard over the summer about having a \"kitchen cabinet\" - a phrase which alludes to a band of trusted advisors - to give him more advice.  In this reshuffle you can see some of the fruits of that, with his leadership campaign manager and close friend David Lammy becoming deputy prime minister and Jonathan Reynolds moving to chief whip - a critical role for a prime minister struggling with his backbenches - and Mr McFadden tasked with another key job. \"What he needs are politicians he feels comfortable with,\" said one figure. \"This is about the PM reaching for the right kind of support and a team he trusts and can rely on\". Ms Rayner is no longer around that table but she will remain a powerful force in the Labour Party and British politics as we watch what she does next from the backbenches. Sir Keir will hope his fresh top table can restore some of his power too. It is hard to see now how this prime minister gets back to his winning ways, but this reshuffle at least showed an appetite to try."
    },
    {
        "title": "From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust",
        "description": "The damage is immense.&#160;In retrospect, it seems incredible that Sir Keir Starmer and Angela Rayner thought they could tough it out before establishing the facts.",
        "url": "https://news.sky.com/story/from-denial-to-resignation-how-rayners-position-fell-apart-and-why-tax-row-risks-damaging-public-trust-13425558",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-angela-rayner_6875118.jpg?20250403175319",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-09-05 13:18:00",
        "Headline": "Angela Rayner has resigned from the government after she admitted to not paying enough stamp duty on a second home she bought earlier this year.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n The damage is immense.In retrospect, it seems incredible that Sir Keir Starmer and Angela Rayner thought they could tough it out before establishing the facts. But they did, and not for the first time. Politics latest: Starmer starts cabinet reshuffle So, before we assess this particular case, it highlights a pre-existing nagging doubt. Is speaking without checking a defining pattern of this government? Tax promises. Welfare cuts. Tulip Siddiq. Waspi Women. The initial winter fuel plan. The vow there would be no winter fuel U-turn. A pledge that David Lammy would be foreign secretary for five years. Even a cast-iron guarantee in July that there would be no reshuffle this month - now there might be three, if you include junior ministers next week. Each one: an action taken or promise made, combined with fighting talk - before reality dawns and the government retreats into reverse. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                 Is the word of ministers and their advisers in this government worth less than it should be?  Starmer and Rayner casually tossed untruths So now this. For days, two of the most senior politicians in the UK have clutched at factually inaccurate (Rayner) and emotionally charged (Starmer) smears against media reports that are today vindicated, and in doing so, casually tossed untruths into the public domain - even though behind the scenes they were still checking the facts. The issue hinged on whether Ms Rayner should have paid a lower level of stamp duty on her new Hove flat, because it was her main home, or whether the rate 40,000 higher was due because of her interests in property elsewhere. Read more:Angela Rayner resigns after admitting she did not pay enough taxThe working class mum who left school at 16 to deputy PM After the Telegraph asked whether she had got it wrong last Friday, her spokesman said on the record she \"paid the correct duty\" and \"any suggestion otherwise is entirely without basis\". Yet later the same day, on Friday night, they decided to check and get a second opinion from a tax barrister. This led to a change of position from Ms Rayner on Wednesday, and the self-referral to the ministerial standards adviser.  Starmer's defence But in the interim, on Monday, while the tax barrister was re-checking the facts, Sir Keir was picking a side. He attacked critics - who were asking if the housing minister had paid the main housing tax at the right rate - for pursuing a class war. \"Angela has had people briefing against her and talking her down over and over again. It's a mistake, by the way,\" he said. By this point, No 10 also knew that Ms Rayner was trying to lift a court order which she claims prevented her from going public with the truth. There was no attempt to nuance from the top, however.  Only finally, on Wednesday, on Sky News, did Ms Rayner concede a mistake. The deputy prime minister's defence was that lawyers had wrongly advised her to pay the lower stamp duty - it was all their fault and she should not be found culpable. Even this has turned out to be a partial explanation, and that is why she's gone. Rayner took a chance The conclusion by the Downing Street investigator was that she'd ignored clear warnings about her tax bill that she should have followed. In his adjudication to the PM, Sir Laurie Magnus wrote: \"In two instances, [the legal advice] was qualified that it did not constitute expert tax advice and was accompanied by a suggestion, and in one case a recommendation, that specific tax advice be found.\" So she took a chance on not following advice to get a proper tax lawyer, and took a chance a second time by claiming on telly that the advice to her was wrong - and has been caught out only because of media scrutiny. Ministers take nuanced advice from professionals on a daily basis and have to use their political determination on whether they agree. Something very similar happened here in Ms Rayner's private life, and she got it wrong. And at no point did someone in No 10 or her team seek to challenge her explanations before multiple figures mounted a case for her defence in public, of things that proved later to be partial or untrue. This is the sort of thing that damages public trust: making categorical statements that are untrue because the facts weren't properly established in advance. Will lessons be learned across the top of government?"
    },
    {
        "title": "Farage says Reform is on course to win next election and he expects 'big rift' in Labour Party",
        "description": "Reform leader Nigel Farage has said his party is on track to become the next government - adding that there will be a \"big rift\" in the Labour Party following Angela Rayner's resignation.",
        "url": "https://news.sky.com/story/farage-says-reform-is-on-course-to-win-next-election-and-he-expects-big-rift-in-labour-party-13425595",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-party_7012132.jpg?20250905170041",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-05 14:28:00",
        "Headline": "The Reform UK leader also welcomed former culture secretary Nadine Dorries to the stage after she defected to the party from the Tories. ",
        "Content": " Reform leader Nigel Farage has said his party is on track to become the next government - adding that there will be a \"big rift\" in the Labour Party following Angela Rayner's resignation. Mr Farage struck a triumphant tone at the Reform UK conference in Birmingham this afternoon, where he said there is \"every chance\" the next general election will take place in 2027. Politics latest: Major cabinet reshuffle The Reform leader was due to speak at 4pm today but brought the meeting forward by three hours after Ms Rayner stepped down as deputy prime minister and housing minister. Ms Rayner had been under pressure after admitting to Sky News' political editor Beth Rigby on the Electoral Dysfunction podcast this week that she didn't pay enough tax on her second home. Mr Farage told activists he was making his speech earlier than planned because the government is \"deep in crisis\" following her resignation. He continued: \"You simply can't get away, can you, from being the housing secretary and avoiding 40,000 of council tax.\" \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 Ms Rayner had in fact failed to not pay enough stamp duty - not council tax as Mr Farage claimed. The Reform leader said her failure to pay the money \"screams to entitlement\" and claimed the government is \"as bad if not worse\" than their Conservative predecessors. Ms Rayner's replacement as deputy leader of the party will be decided through a vote by members - with details of the contest to be set out at a later date. Mr Farage said during his speech that he expects there to be a \"big rift in the Labour Party\" and added: \"Before long, there'll be Labour MPs that reckon they've got a better chance on the Jeremy Corbyn sectarian ticket. \"I think there is every chance now of a general election happening in 2027.\" Mr Corbyn announced in July that he would be setting up a new left-wing political party. Mr Farage told members he believes Reform is \"on track\" to enter government and that he is setting up an internal department to prepare for office. He also said he would stop migrants arriving in the UK on small boats within a fortnight if he wins the next election. The Reform leader had been welcomed onto the stage with pyrotechnic smoke and fireworks and a standing ovation. People in the crowd were seen drinking pints as they watched his speech. Mr Farage also welcomed former Conservative culture secretary Nadine Dorries on stage after the former I'm a Celebrity Get Me Out of Here contestant announced her defection from the Tories on the eve of the conference. The pair had an awkward embrace on stage which included Mr Farage kissing Ms Dorries on the top of her head.  Ms Dorries told members: \"I feel for the first time in a number of years as though I'm at a conference and amongst people who share the same principles and values as I have always held.\" Meanwhile, the Labour Party said Mr Farage was offering \"anger without answers\" with his speech. It added in a statement: \"His answer to the charge that Reform is a one-man band was to unveil one of the faces of failure from the last Tory government, Nadine Dorries.\" Dame Andrea Jenkyns, a former Conservative MP who defected to Reform after losing her seat in the last election, later walked on stage singing a song named Insomniac while wearing a sparkling outfit. Dame Andrea reportedly wrote the song herself. Starmer shuffles his pack The opening day of the Reform conference has been held as Prime Minister Sir Keir Starmer has been reshuffling his top team for the first time since taking office in July last year. Chancellor Rachel Reeves has kept her job, while David Lammy has been moved from foreign secretary to justice secretary. Mr Lammy will also replace Ms Rayner as deputy prime minister. Meanwhile, Yvette Cooper has been moved from home secretary to foreign secretary. Shabana Mahmood will move from justice secretary to home secretary."
    },
    {
        "title": "What a moment for Shabana Mahmood to take the helm at the Home Office",
        "description": "Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary. ",
        "url": "https://news.sky.com/story/what-a-moment-for-shabana-mahmood-to-take-the-helm-at-the-home-office-13425665",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-shabana-mahmood-taser_6975862.jpg?20250728102659",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-05 16:45:00",
        "Headline": "Ms Mahmood, considered a \"blue Labour\" social conservative, will take charge of the police, MI5 and the government's domestic direction of travel at a time of great flux.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary.  The department she will now head up will be making dynamic shifts to counter the public mood on immigration and grooming gangs. Politics latest: Major cabinet reshuffle What a moment for the Home Office mantle to be grasped by the first Muslim woman to occupy one of the great offices, taking charge of the police, MI5 and the government's domestic direction of travel at a time of great flux. She has also become the home secretary of a country where the national flag is being hoisted as a symbol of dissatisfaction - with anger at the arrival of desperate migrants crossing the Channel in small boats. Ms Mahmood picks up the in-tray of a home secretary who has been forced to make moves that often seemed to defy her natural position - tougher rules on asylum seekers, proscribing a pro-Palestinian group of activists, and ordering an inquiry into grooming gangs. But perhaps all this will come more naturally to our new home secretary. \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 \n                  'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls\n                 \n                  Two Labour-run councils 'considering all options' to challenge migrant hotel use\n                 The Oxford-educated MP is considered a \"blue Labour\" social conservative. Only last month she announced that foreign criminals will be deported after sentencing to free up prison space and protect the public.  Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next election On the issue of Asian grooming gangs, she recently told former Tory Cabinet minister Michael Gove in the Spectator that \"there is still a moment of reckoning\", adding \"there is still an outstanding question of why so many people looked the other way\". She studied at Lincoln College, Oxford, where she managed to win the vote of Rishi Sunak to become junior common room president, and she used her electioneering skills to help Prime Minister Sir Keir Starmer win the general election. She had declined a position in Jeremy Corbyn's shadow cabinet and became crucial to Labour's regeneration, describing her role as \"dragging them back to a position of common sense\". Ms Mahmood will need that antenna for public opinion in the months to come."
    },
    {
        "title": "From non-job to key job - Why there's so much at stake in the election for Rayner's replacement",
        "description": "It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war.",
        "url": "https://news.sky.com/story/from-non-job-to-key-job-why-theres-so-much-at-stake-in-the-election-for-rayners-replacement-13425671",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-bespoke-rayner_7011923.jpg?20250905132200",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-05 17:03:00",
        "Headline": "Labour's deputy role was once thought of as a nothing job, but it's now become a key position - and will be fiercely fought over.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war. The contest, whenever it happens, could potentially be the most divisive since the bitter left-right split when Tony Benn challenged the incumbent, Denis Healey, in 1981. It was the year of the launch of the breakaway SDP by the \"Gang of Four\" - Roy Jenkins, David Owen, Shirley Williams and Bill Rodgers - and defections by several more Labour MPs. There was speculation that if Benn had won - then in his hard-left phase before he became a national treasure in his latter years - there would be far more defections to the SDP. Politics latest - follow live This time, however, the threat of defections by Labour MPs comes not from the centre, but from Jeremy Corbyn's new party, which could be triggered if the left's candidate is crushed. So many Labour MPs will want to see a candidate elected to replace Ms Rayner who provides a balanced ticket, a left-right combination with Sir Keir Starmer. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  Back in 1981 the Benn-Healey battle was fought out in a filthy mood at Labour's autumn conference in Brighton, with the former chancellor winning by a wafer-thin 50.4% to 49.6%. The mood was so poisonous that Neil Kinnock, who'd refused to back Mr Benn, has claimed he was assailed by a young Benn supporter in the lavatory of the Grand Hotel and boasted: \"I beat the **** out of him.\" Contrast that with the comradely contest when Ms Rayner beat rivals Richard Burgon, Dawn Butler, Rosena Allin-Khan and Ian Murray in a ballot of party members in 2020. Of those four, a furious Mr Murray has just been sacked as Scotland Secretary by Sir Keir, while Mr Burgon and Ms Butler are regarded as likely to stand again this time. Big names and famous faces in the role throughout the years Over the years, some big names have been Labour's deputy leader, including Clement Attlee in the 1930s before he became leader and left-wing firebrand Aneurin Bevan for a year, until his death in 1960. Mr Healey was followed in 1983 by Roy Hattersley, who'd stood on a so-called \"dream ticket\" with Mr Kinnock. Mr Benn and fellow left-winger Eric Heffer were derided by MPs as \"the nightmare ticket\". Then came Margaret Beckett, John Prescott, Harriet Harman and Tom Watson. But of all Labour's deputies, Mr Attlee was the only one to go on to become leader and a Labour prime minister. The post was said to be a non-job under Harold Wilson when his deputy was George Brown, better known for his drinking than his political achievements, and Ted Short, who even called his memoirs \"I Knew My Place\". It was the bruising Benn-Healey contest that elevated the status of deputy leader. And the two most famous recent deputies, John Prescott and Angela Rayner, went on to become deputy prime minister. So from a non-job, it's become a key job. Mr Prescott and Ms Rayner were seen as human shields for Mr Blair and Sir Keir against the left and the more militant trade unions. Read more:Rayner admits she should have paid more stamp dutyRayner came out fighting in Sky interviewRayner's tax affairs statement in full No wonder Sir Keir's handwritten letter to Ms Rayner after her resignation was so friendly and sympathetic. He didn't want to lose his human shield. In the Conservative Party, Margaret Thatcher famously said of her deputy William Whitelaw: \"Every prime minister needs a Willie.\" In the Labour Party, these days every prime minister needs a protector, a gatekeeper, a fixer and a go-between. That's why there's so much at stake in the election for Angela Rayner's successor."
    },
    {
        "title": "Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'",
        "description": "Bribes have been used to beat the long waiting lists for affordable homes, according to the City of London Police - which has now launched an investigation into corrupt housing officers.",
        "url": "https://news.sky.com/story/two-arrested-as-police-suspect-corrupt-council-staff-allocated-hundreds-of-homes-for-cash-13425562",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dagenham-london_7012014.jpg?20250905144721",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-05 23:01:00",
        "Headline": "Investigators believe there was blatant advertising on social media offering prospective tenants a means to beat the queue for affordable housing. ",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Bribes have been used to beat the long waiting lists for affordable homes, according to the City of London Police - which has now launched an investigation into corrupt housing officers. Two people have been arrested and police say \"evidence exists\" that hundreds of homes have been allocated through fraudulent dealings in the east London borough of Barking and Dagenham. Officers believe homes were sometimes sublet by associates of housing officers. Investigators also believe there was blatant advertising on social media offering prospective tenants a means to beat the queue. The force said: \"As part of this process, prospective tenants paid fraudsters 'finder's fees', and inflated rents. \"Some rents were paid in part to London Borough Barking Dagenham Council and some were not.\" The council's counter-corruption team is assisting in the investigation and says it follows months of intelligence gathering. Leader of the council, Dominic Twomey, said: \"Every day, our fraud team are behind the scenes, looking into anything from corruption concerns to illegal sub-letting. \n                  Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness\n                 \n                  Rushanara Ali: Labour promised to fix housing - but are they leading by example?\n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \"Ultimately their job is to make sure public money is being spent in the way it should be, so I'm really pleased their proactive work has helped lead to today's arrests.\" Affordable housing is a system of offering below-market-rate homes to support lower-income households and priority groups, such as those with disabilities. It is administered by local authorities, which set qualification requirements, such as residency periods and points-based systems to assess housing needs and wait times. Read more from Sky News:UK couple killed in Lisbon funicular crash namedRayner resigns after tax admissionDuchess of Kent dies Email us at news@skynews.com to share any information.\n Please include the name 'Jason Farrell' in the subject. Waiting lists in England have been increasing over decades due to a shortage of social homes. The latest government figures show the total number of households on the waiting list in 2023-24 was 1,330,611 - a six per cent rise on the year before. In April, a study by the National Housing Federation found Barking and Dagenham is one of the 50 councils with the longest waiting times - where at current rates, it would take over 15 years for a family joining the back of the queue to be allocated a three-bedroom home.  In these conditions, this issue of corruption is likely to extend beyond one council, housing campaigner Kwajo Tweneboa told Sky News. \"I've had people far beyond Barking and Dagenham reach out to me about the exact same issue of corruption, some even saying it's been going on for decades,\" he said. \"Let's be clear, exploiting people who are already suffering, just so individuals in the public sector can line their own pockets, is disgraceful. It has to be exposed and rooted out.\""
    },
    {
        "title": "Man arrested on suspicion of murdering two women in London in five months",
        "description": "A man has has been arrested on suspicion of murdering a woman while he was being investigated over the death of another woman five months earlier.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murdering-two-women-in-london-in-five-months-13425749",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-aylesbury-estate-southwark_7012349.png?20250905203753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-05 18:51:00",
        "Headline": "The 40-year-old suspect was being investigated over the death of a woman in March and was detained again after a woman died in August. ",
        "Content": "A man has has been arrested on suspicion of murdering a woman while he was being investigated over the death of another woman five months earlier. The 40-year-old suspect was first arrested on suspicion of murder on 1 April this year after Carmenza Trujillo, 53, died in the Aylesbury Estate in Southwark, southeast London, on 17 March. He was released under investigation while police probed the death. Ms Trujillo had been pronounced dead at the scene after officers and paramedics responded to reports of an unresponsive woman in a building. Months later Sheryl Wilkins, 39, was found unresponsive on High Road in Tottenham, London, at around 7.30am on 24 August and pronounced dead at the scene. The suspect in the Ms Trujillo case was arrested on Thursday on suspicion of murdering Ms Wilkins, the Metropolitan Police said. He was also rearrested in relation to the death of Ms Trujillo, the force added. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 Read more from Sky News:Angela Rayner resigns from governmentThree Britons among Lisbon crash fatalities Post-mortem examinations were unable to determine how either woman died, the Met said. He remains in custody and Detective Chief Inspector Neil John, leading the investigation, said: \"My sympathy goes to the family and friends of both victims, who have been updated on this development and continue to be supported by specialist officers. \"No woman should feel unsafe in our city, and we know this news will cause concern across communities. Our investigation is continuing at pace and remains a priority. \"I urge anyone who has information relating to either incident to contact us as soon as possible.\""
    },
    {
        "title": "Rookie diplomat Yvette Cooper could not be picking up the Foreign Secretary reins at a more challenging time",
        "description": "David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary.",
        "url": "https://news.sky.com/story/rookie-diplomat-yvette-cooper-could-not-be-picking-up-the-foreign-secretary-reins-at-a-more-challenging-time-13425682",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-yvette-cooper-downing-street_7012221.jpg?20250905183442",
        "type": "UK",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-05 17:27:00",
        "Headline": "Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary. Those who travelled with him observed a man in his element, whether in the frozen wastes of Svalbard or the corridors of power. He confided that he expected to stay in the job for the duration of this parliament. So much for all that. Follow the latest: Lammy, Cooper and Mahmood get new jobs While opinions differ on how good he was at his job, he certainly revelled in it and threw himself into the role. He is making way for someone who has never held an international affairs posting in government. Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front. And yet this rookie diplomat could not be taking up the reins as Britain's foreign secretary at a more challenging time. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 The war in Ukraine has mutated into something even more challenging than the biggest land war on the continent of Europe since the Second World War. It is turning into a monumental struggle between East and West. Vladimir Putin is resurgent, striding the world stage again, and this week winning more support from China and North Korea. The West seems divided between Europeans who want a ceasefire and more severe sanctions on Russia's oil trade and Donald Trump, who doesn't anymore but seems at a loss over what to do instead. Gaza is sinking into even more of a horror show with no let-up in the war, and accusations that the Labour government is conniving in an alleged genocide perpetrated by Israel. On top of the diary entries Yvette Cooper will be handed as she takes up her new job will be the UN General Assembly in New York, where Britain is expected to recognise the state of Palestine along with other nations. Read more:Cabinet reshuffle: Who's in and who's out?In full: Angela Rayner's resignation letter If the Home Office is known for being strewn with banana skins, the Foreign Office is rigged with minefields. Foremost among them, the Middle East and the Starmer government's attempts to walk a perilous tightrope between friends of Israel and supporters of the Palestinians. David Lammy was criticised by some for not being firm enough or decisive. In his defence, he had not been in the job that long, and he avoided any massive missteps. He thought deeply about his role and seemed adept at managing the Trump administration. Not bad for someone who once called Donald Trump a \"neo nazi sociopath\". He managed to maintain good relations with both Barack Obama and JD Vance. Yvette Cooper has a reputation for straight talking, not always helpful in diplomacy. But she is regarded as intellectually rigorous, preferring substance over style. She will need to be a quick learner as she tries to master her brief in a world that is only becoming more dangerous and more complicated."
    },
    {
        "title": "Vladimir Putin sends grave warning to Ukraine's allies over Western troop deployment",
        "description": "Russian President Vladimir Putin has said any foreign troops operating as part of a peacekeeping force in Ukraine would be considered a \"legitimate target\" by Moscow. ",
        "url": "https://news.sky.com/story/vladimir-putin-warns-western-troops-in-ukraine-would-be-legitimate-target-for-moscow-13425588",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-putin-ukraine-russia_7011712.jpg?20250905103005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 14:16:00",
        "Headline": "Ukraine's allies formally committed this week to deploying troops \"by land, sea or air\" to provide security after any potential peace deal is struck.",
        "Content": " Russian President Vladimir Putin has said any foreign troops operating as part of a peacekeeping force in Ukraine would be considered a \"legitimate target\" by Moscow.  It comes a day after French President Emmanuel Macron said 26 of Ukraine's allies had formally committed to deploying troops \"by land, sea or air\" to help guarantee Kyiv's security the day after any ceasefire or peace is achieved. Mr Macron stressed any troops would be deployed to prevent \"any new major aggression\" and not at the frontline, adding the force does \"not have the will or the objective of waging war against Russia\". Mr Putin quickly poured cold water on the proposals when speaking at an economic forum in Russia's eastern Vladivostok region on Friday. Directly responding to Mr Macron's comments, he said: \"If any troops appear there, especially now, during military operations, we proceed from the fact that these will be legitimate targets for their destruction. \"And if decisions are reached that lead to peace, to long-term peace, then I simply do not see any sense in their presence on the territory of Ukraine, full stop.\" Russia has long argued that one of its reasons for going to war in Ukraine was to prevent NATO from admitting Kyiv as a member and placing its forces in Ukraine. \n                  China's Xi believes in destiny - and it's bad news for the West\n                 \n                  Xi presents his vision of the future - and the company by his side was no accident\n                 \n                  Xi hails 'great regeneration of China' with dramatic show of military might\n                 Speaking today, Ukrainian President Volodymyr Zelenskyy said it was important that security guarantees \"start working now, during the war, and not only after it ends\". On Thursday, NATO chief Mark Rutte said Russia had no veto on Western troops being deployed to Ukraine: \"Why are we interested in what Russia thinks about troops in Ukraine? It's a sovereign country. It's not for them to decide.\"  'Please come to Moscow' Mr Putin also addressed the chances of a direct meeting between himself and Mr Zelesnkyy aimed at ending the war. Such a proposal looked positive after the Russian met Donald Trump in Alaska last month, but Mr Putin said on Friday he did not see much point in such a meeting because \"it will be practically impossible to reach an agreement with the Ukrainian side on key issues\". However, he reiterated an offer he made earlier this week to host Mr Zelenskyy for talks in Moscow, which Ukraine's defence minister previously declared as \"knowingly unacceptable\". \"I said: 'I'm ready, please, come, we will definitely provide working conditions and security, a 100% guarantee',\" Mr Putin said. \"But if they tell us: 'we want to meet with you, but you have to go somewhere else for this meeting', it seems to me that these are simply excessive requests on us.\" Speaking at a news conference in Paris on Thursday, Mr Zelenskyy said US mediators informed him about Mr Putin's invitation. \"Our American partners told us that Putin invited me to Moscow, and I believe that if you want to avoid a meeting, you should invite me to Moscow,\" he said. However, he said the fact that the issue of organising a meeting arose was \"not bad\". Drone strikes continue While talks to end the war continue at a diplomatic level, more heavy drone strikes were recorded across Ukraine. Kyiv's air force said Moscow attacked Ukraine overnight with 157 strike and decoy drones, as well as seven missiles of various types. Air defences shot down or jammed 121 of the drones, it said, but 35 drones and seven missiles still struck 10 locations. Elsewhere, Russian troops destroyed 92 Ukrainian drones overnight, according to its defence ministry. Local social media channels in the city of Ryazan, approximately 200 kilometres (125 miles) southeast of Moscow, reported that the city's Rosneft oil refinery had been targeted. Ryazan's regional governor said that drone debris had fallen on an \"industrial enterprise\" but did not give further details. Ukraine has stepped up attacks on Russian oil infrastructure that it says fuels Moscow's war effort in recent months. Military analyst Professor Michael Clarke said Ukraine's campaign on Russia's oil refineries has been a successful one so far, but doubts it will hurt Moscow's war machine too much. \"Will that directly affect the war? Probably not. Because the Russian military runs on diesel,\" he said. \"It filters through to the war in the sense that it inconveniences and bothers the Russians and reminds the Russian population that this war has a cost to them as well.\""
    },
    {
        "title": "Two hostages shown in Hamas video - as Israel strikes high-rise building in Gaza City",
        "description": "Hamas has released a video showing two Israeli hostages, one of whom says he is being held in Gaza City, where the IDF has launched a major offensive. ",
        "url": "https://news.sky.com/story/two-hostages-shown-in-hamas-video-as-israel-strikes-high-rise-building-in-gaza-city-13425546",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-gaza-city_7012136.jpg?20250905170628",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 13:00:00",
        "Headline": "Guy Gilboa-Dalal and Alon Ohel were kidnapped from a music festival in Israel on October 7 2023, and are two of 20 hostages held by Hamas thought to still be alive.",
        "Content": " Hamas has released a video showing two Israeli hostages, one of whom says he is being held in Gaza City, where the IDF has launched a major offensive.  Guy Gilboa-Dalal and Alon Ohel were kidnapped during the October 2023 massacre and are two of 48 captives still believed to be held by Hamas, with 20 thought to still be alive. Israel's Prime Minister Benjamin Netanyahu has ordered his military to occupy the whole of Gaza, with troops and armour currently assaulting Gaza City, where around a million people lived before the war broke out. On Friday, the IDF bombed a high-rise building in the city's west that - without providing evidence - it said was being used by Hamas. The military claimed that civilians were warned beforehand. Pictures from Gaza City show Palestinians running for safety as the building collapses. Hostages appear in video released by Hamas The video was edited and featured an exhausted-looking Mr Gilboa-Dalal speaking for around three-and-a-half minutes. \n                  Anger over Israeli president's planned visit to UK - as ministers urged not to meet him\n                 \n                  Israeli bombardment pushes more Palestinians out of their homes\n                 \n                  'Miss Palestine' Nadeen Ayoub to compete in global pageant to show 'we are human beings'\n                 He appears in a car for some of the video and says that he is being held in Gaza City along with other hostages. He says that he is afraid of being killed by Israel's latest assault. The video is dated 28 August. Sky News could not independently determine the date of recording. Mr Gilboa-Dalal appears to be in the backseat of a car that is being driven around. At one point, he identifies a passing building as one belonging to the Red Cross. Hamas has refused to allow the Red Cross to see the hostages. At one point, Mr Ohel, 24, is also seen.  Family mark 'sign of life' In a statement, Mr Gilboa-Dalal's family said: \"We have received a sign of life from our Guy after six months since the previous video in which he was seen with Evyatar David watching their friends being released. \"Guy, Alon, and other hostages were transferred to Gaza, and we are deeply concerned for their lives. They must be brought home.\" But talks between Israel and Hamas via mediators - aimed at stopping the fighting and freeing the hostages - collapsed in July. After the release of the video, Israeli opposition leader Yair Lapid urged Israeli negotiators to resume talks on a deal to free the hostages. Read more:Anger over Israeli president's visit to UKA diary of daily life in Gaza Strike on high-rise building The release of the hostage video comes as the Israeli military continues its attack on Gaza City, where residents say it bombed a high-rise tower on Friday. The building's management said it was being used for displaced people and denied it had been used for anything other than civilian purposes. Footage of the strike showed the building collapsing and sending thick clouds of smoke billowing over nearby tent camps. Father-of-two Ismail, from the city's Sheikh Radwan neighbourhood, told Reuters that his family feared they would not be able to return if they fled. \"We pray for a ceasefire,\" he said. More than 64,000 Palestinians have been killed in the Gaza Strip since the war began, Gaza health authorities say. The war was sparked by Hamas' attack on Israel, when militants killed 1,200 people and took around 250 hostages."
    },
    {
        "title": "Fifteen people killed after bus crashes off 1,000ft cliff in Sri Lanka",
        "description": "Fifteen people have been killed in Sri Lanka after a passenger bus veered off a 1,000ft cliff. ",
        "url": "https://news.sky.com/story/fifteen-people-killed-after-bus-crashes-off-1000ft-cliff-in-sri-lanka-13425336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lanka-bus-wellawaya_7011640.jpg?20250905080348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 06:56:00",
        "Headline": "Deadly bus accidents are common in Sri Lanka, especially in the island nation's mountainous regions, often due to poorly maintained and narrow roads, and reckless driving.",
        "Content": "Fifteen people have been killed in Sri Lanka after a passenger bus veered off a 1,000ft cliff.  A further 16 people have been injured, including five children, a police spokesman said. The crash took place on a mountain road near the town of Wellawaya, around 280km east of the capital Colombo, on Thursday night. The spokesman said an initial police investigation has revealed the bus was travelling at a high speed when its driver lost control. He added that the bus crashed into another vehicle and the road's guardrails, before toppling off the cliff. More from Sky News:All we know about the Lisbon funicular crashBiden has skin cancer surgery Local television footage showed the severely damaged bus lying at the bottom of the precipice as rescue crews - including soldiers, police officers and volunteers - removed the injured people throughout the night. Deadly bus accidents are common in Sri Lanka, especially in the island nation's mountainous regions, often due to poorly maintained and narrow roads, and reckless driving."
    },
    {
        "title": "Aryna Sabalenka hits back at Nick Kyrgios and vows to 'kick his ass' in 'Battle of the Sexes' showdown",
        "description": "Aryna Sabalenka has said she can beat Nick Kyrgios when they play against each other next January, even promising to &#8220;kick his ass\".",
        "url": "https://news.sky.com/story/aryna-sabalenka-hits-back-at-nick-kyrgios-and-vows-to-kick-his-ass-in-battle-of-the-sexes-showdown-13425638",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-aryna-sabalenka-wimbledon_6957498.jpg?20250704230945",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 15:47:00",
        "Headline": "Women's world number one Sabalenka says she can \"genuinely\" beat the Australian when they meet in tennis's most anticipated gender showdown for over 50 years.",
        "Content": "Aryna Sabalenka has said she can beat Nick Kyrgios when they play against each other next January, even promising to kick his ass\". The Belarusian, who has just made it through to the US Open where she is defending her title, will face the tennis bad boy in a match that will mimic one of the most famous showdowns in the sport's history - Billie Jean King's 1973 victory over Bobby Riggs at the Houston Astrodome. Sabalenka said the match with Kyrgios, expected to take place before the Australian Open in January, was a \"good idea\" and will be \"spectacular to watch\". \"It's going to be fun, especially against someone like Nick. Like he said in another interview, that I genuinely think that I'm going to win, and I'll definitely go out there, and I'll try my best to kick his ass (laughter),\" she said. She was responding to Kyrgios, who, earlier in the week, indulged in some tennis trash talk when he claimed he would not have to play at 100 per cent to beat the women's world number one. Sabalenka, 27, has won three grand slams and also reached three Wimbledon semi-finals. Kyrgios, 30, has won no majors and reached the Wimbledon final in 2022, where he lost in four sets. It has been reported that the pair could play in Hong Kong in January, just before the Australian Open, but Sabalenka said the time and location of the eagerly anticipated contest have not yet been confirmed. \n                  Vladimir Putin sends grave warning to Ukraine's allies over Western troop deployment\n                 \n                  Two hostages shown in Hamas video - as Israel strikes high-rise building in Gaza City\n                 \n                  Fifteen people killed after bus crashes off 1,000ft cliff in Sri Lanka\n                 \"Definitely if we're going to bring it, we're going to bring it to somewhere where it's going to be a lot of people watching, and we're gonna put a lot of pressure on Nick.\" Read more from Sky News:Football star apologises for spitting at rival team's stafferTeacher stabbed at school in Germany Speaking on the 'Tea with Bublik podcast', with fellow player Alexander Bublik earlier this week, Kyrgios said that \"Sabalenka is awesome, she's such a character\". \"I think she's the type of player who genuinely believes she's going to win,\" he added. Sabalenka secured her place in the US Open final with a commanding victory over Jessica Pegula in the 2025 US Open semi-finals. The match will be a modern-day replay of the legendary clash between Billie Jean King and Bobby Riggs, 52 years ago King, 29, triumphed over the 55-year-old Riggs with a straight-sets victory of 6-4, 6-4, 6-4, and won $100,000. Prior to that, Riggs had defeated Margaret Court, who was the world's top-ranked female player at the time."
    },
    {
        "title": "475 people detained during immigration raid on Hyundai factory in Georgia",
        "description": "Officers detained 475 people during an immigration raid on a Hyundai factory for electric vehicles in Georgia. ",
        "url": "https://news.sky.com/story/475-people-detained-during-immigration-raid-on-hyundai-factory-in-georgia-13425630",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hyundai-immigration-raid_7012196.jpg?20250905181315",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 15:35:00",
        "Headline": "The majority of those detained at the 3,000-acre site west of Savannah are from South Korea",
        "Content": "Officers detained 475 people during an immigration raid on a Hyundai factory for electric vehicles in Georgia.  The majority of those detained at the 3,000-acre site west of Savannah are from South Korea, according to Steven Schrank, special agent in charge at Homeland Security Investigations. Mr Schrank said the raid was the \"largest single-site enforcement operation\" in the history of the agency and followed an investigation of several months, which involved leads from community members and former workers. The spokesman for the South Korean foreign ministry, Lee Jaewoong, said there was a \"large\" number of South Koreans among those detained in the raid, but did not provide an exact number. He said the detained workers were part of a \"network of subcontractors\" and that the employees worked for several different companies on the Georgia site. Mr Lee said South Korea's foreign ministry is dispatching diplomats from its embassy in Washington and consulate in Atlanta to the site, and plans to form an on-site response team centred on the local mission. \"The business activities of our investors and the rights of our nationals must not be unjustly infringed in the process of US law enforcement,\" Mr Lee added. \n                  Five soldiers shot by sergeant at major US army base\n                 \n                  Man who claimed weedkiller caused cancer awarded $2.1bn by US jury\n                 \n                  Woman sues fertility clinic after giving birth to another couple's baby\n                 The Department of Homeland Security said in a statement that agents executed a search warrant \"as part of an ongoing criminal investigation into allegations of unlawful employment practices and other serious federal crimes\". The manufacturing site, which employs about 1,200 people, has been hailed as the largest economic development project in the state's history by Governor Brian Kemp and other officials. Hyundai Motor Group, the biggest automaker in South Korea, started manufacturing electric vehicles at the $7.6bn (7.4bn) site a year ago and partnered with LG Energy Solution to build an adjacent battery plant, which is set to open in 2026. ICE spokesman Lindsay Williams confirmed the raid and said agents were focused on the construction site for the battery plant. LG said in a statement that it was \"closely monitoring the situation and gathered all relevant details\". The firm said it couldn't immediately confirm how many of its employees or Hyundai workers had been detained. \"Our top priority is always ensuring the safety and well-being of our employees and partners. We will fully cooperate with the relevant authorities,\" LG said. Hyundai and LG's battery joint venture, HL-GA Battery Company, said in a statement that it's \"cooperating fully with the appropriate authorities\" and paused construction of the battery site to assist the investigation. Operations at Hyundai's electric vehicle manufacturing plant weren't interrupted, plant spokesperson Biance Johnson said. Read more from Sky News:Trump to rebrand Pentagon as Department of WarFormer President Biden has skin cancer surgery The raid is the latest in a series of sweeping ICE operations as part of President Donald Trump's mass deportation agenda, which saw immigration officers raid farms, construction sites, restaurants and auto repair shops. The US labour force lost more than 1.2 million immigrants from January through July, which includes legal and illegal immigrants, according to the Pew Research Centre, citing preliminary census data."
    },
    {
        "title": "Essen: Suspect shot, 17, during arrest after teacher was stabbed at German school, police say",
        "description": "A 17-year-old suspected of stabbing a teacher at a school in Germany has been injured by gunfire during his arrest, police said.",
        "url": "https://news.sky.com/story/essen-suspect-shot-17-during-arrest-after-teacher-was-stabbed-at-german-school-police-say-13425439",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-essen-stabbing_7011973.jpg?20250905140346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 09:54:00",
        "Headline": "In posts on X, police said the suspect wasinjured when officers used firearms during the arrest. He is receiving medical care, they added.",
        "Content": "A 17-year-old suspected of stabbing a teacher at a school in Germany has been injured by gunfire during his arrest, police said. The teenager is said to have stabbed a 45-year-old teacher multiple times at a vocational college in Essen, a city in western Germany, on Friday morning. The suspect then fled the scene of the attack, the city's police said. As the teacher was treated at the scene before being taken to hospital, numerous officers were dispatched to search the school and city for the suspect. Shortly after 11.15am, investigators located the teen, who pulled out a knife as officers tried to arrest him, Essen Police said. Read more:Duchess of Kent diesTrump to rebrand Pentagon Police used their firearms to stop and arrest the young man, who has also been taken to hospital, the police statement concluded. Members of the public had been advised to avoid Blucherstrasse, a street in the city, while police operations were ongoing."
    },
    {
        "title": "Football star Luis Suarez apologises for spitting at rival team's staff member",
        "description": "Inter Miami's Luis Suarez has apologised for spitting at a member of another team's coaching staff during an on-pitch scuffle.",
        "url": "https://news.sky.com/story/football-star-luis-suarez-apologises-for-spitting-at-rival-teams-staff-member-13425390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-suarez-miami-seattle_7011682.jpg?20250905093934",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 08:32:00",
        "Headline": "The striker's Inter Miami side had just lost a cup final 3-0 when the incident occurred.",
        "Content": "Inter Miami's Luis Suarez has apologised for spitting at a member of another team's coaching staff during an on-pitch scuffle. Inter Miami, who are co-owned by David Beckham, lost 3-0 to the Seattle Sounders in the Leagues Cup final on Monday. After the match ended, players from both sides were involved in a confrontation - which saw Suarez clash with one of the Sounders' coaches while his teammate Sergio Busquets appeared to throw a punch. In a post shared on Instagram on Thursday night, Suarez congratulated Seattle Sounders for their win before saying he wanted to \"apologise for my behaviour when the game ended\". The 38-year-old, writing in Spanish, continued: \"It was a moment of much tension and frustration, where just after the game ended, things happened that shouldn't have happened, but that doesn't justify my reaction. \"I made a mistake and sincerely apologise. It's not the image I want to give in front of my family, who suffer because of my mistakes, nor in front of my club, that also doesn't deserve seeing itself affected by something like this. \"I feel bad for what happened, and I didn't want to miss the opportunity to recognise and apologise to everyone who felt hurt by what I did.\" Inter Miami also released a statement saying it \"condemns the altercations that took place\" after the match. \"These actions do not reflect the values of our sport, and we remain committed to upholding the highest standards of sportsmanship both on and off the pitch,\" it said. Suarez has a history of bad behaviour on the pitch, having been suspended three times for biting opponents. It is unclear what punishment he will receive for the latest incident as the cup has a separate disciplinary committee from the two main leagues its sides come from, the MLS in the States and Mexico's Liga MX."
    },
    {
        "title": "Cannabis campaigner to prime minister - Thailand's new leader wins decisive vote",
        "description": "Thailand has a new prime minister.",
        "url": "https://news.sky.com/story/cannabis-campaigner-to-prime-minister-thailands-new-leader-wins-decisive-vote-13425444",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-thailand-anutin-charnvirakul_7011755.jpg?20250905111748",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 10:01:00",
        "Headline": "US college graduate Anutin Charnvirakul, championed legalising cannabis, was the Thai health minister during the COVID pandemic, and flies emergency organs cross-country.",
        "Content": "Thailand has a new prime minister. Anutin Charnvirakul won a total of 311 votes, far exceeding the 247 required majority from the House of Representative's 492 active members. He and his government are expected to take office in a few days after obtaining a formal appointment from King Maha Vajiralongkorn. He succeeds Paetongtarn Shinawatra, who was dismissed by court order as prime minister last week after being found guilty of ethics violations over a politically compromising phone call with neighbouring Cambodia's Senate President Hun Sen. Born to an influential politician-businessman, Anutin, 58, studied at an all-boys private school in Bangkok before heading to university in the United States for an engineering degree. After working for his father's construction company, he entered politics as deputy minister of public health under previous prime minster Thaksin Shinawatra in 2004. He rose to the rank of Health Minister and was widely praised within the country for his handling of the COVID-19 pandemic, and championing Thailand's legalisation of cannabis in 2022. \n                  Thai prime minister Paetongtarn Shinawatra sacked for ethics violation after leaked phone call\n                 \n                  Inside the monastery where 'crazy medicine' addicts drink secret potion to detox\n                 \n                  Cambodian soldiers returned by Thailand after ceasefire deal\n                 More from Sky News:All we know about the Lisbon funicular crashBiden has skin cancer surgery Political analyst Napon Jatusripitak said Mr Anutin and his party were a rare bridge spanning powerful family clans that dominate provincial politics and sections of the influential royalist-conservative establishment. \"He is very much a pragmatic politician, cut from the same cloth as Thaksin Shinawatra,\" Outside of business and politics, Anutin's interests include collecting Buddhist amulets and recreational flying, which he sometimes uses to facilitate emergency organ donations."
    },
    {
        "title": "British couple killed in Lisbon funicular crash named",
        "description": "Two of the three Britons killed in the Lisbon funicular crash have been named.",
        "url": "https://news.sky.com/story/british-couple-killed-in-lisbon-funicular-crash-named-13425823",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lisbon-kayleigh-smith_7012432.jpg?20250905220811",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-05 20:57:00",
        "Headline": "There is speculation the steel cable linking the two carriages may have snapped or that the brakes on one of the cars failed. A preliminary technical report is due on Saturday.",
        "Content": "Two of the three Britons killed in the Lisbon funicular crash have been named. Kayleigh Smith, 36, and William Nelson, 44, were a couple and died alongside 14 others in Wednesday's incident. Ms Smith graduated from the Arden School of Theatre in Manchester, where Mr Nelson ran the master's degree in directing.  The identity of the third British victim has not yet been confirmed. MADS theatre in Macclesfield, Cheshire, said Ms Smith was a \"valued member of our society\" who will be \"greatly missed\". It said she was an award-winning director and actress, who had also done multiple crew and front-of-house roles. Five Portuguese citizens died when the packed carriage plummeted out of control - four of them workers at a charity on the hill - but most victims were foreigners. Police said the other fatalities were two Canadians, two South Koreans, one American, one French citizen, one Swiss and one Ukrainian. All but one were declared dead at the scene - and 21 others in the packed carriage were injured.  The yellow carriages of the Gloria funicular are a big draw for tourists, as well as a proud symbol of the Portuguese capital. The journey is just 265m (870ft) up a steep hill and takes three minutes, with two carriages travelling in opposite directions on a linked cable. Read more:Everything we know about the Lisbon crash Witnesses reported seeing one of the carriages hurtle down the hill before derailing and crashing 30m from the bottom. The aftermath shows it crumpled and twisted against the side of a building. People who were in the bottom carriage said they were a few metres into the climb when it started going backwards. When they saw the other car speeding towards them, many jumped through the windows to escape. Prime Minister Luis Montenegro called the crash \"one of the biggest tragedies of our recent past\" and authorities are under intense pressure to quickly identifying the cause. One witness who was in the lower carriage told Sky's Europe correspondent Alistair Bunkall that the brakes appeared to fail. The carriage's brakeman, Andre Marques, has also been confirmed among the dead.  Officials said the streetcar, which has been running since 1914, had a half-hour visual inspection every day and underwent full maintenance last year. The line links the downtown area near Restauradores Square with Lisbon's Bairro Alto neighbourhood. A preliminary technical report due on Friday has now been delayed until Saturday. Another report with a broader scope is expected within 45 days. Three other funicular lines in Lisbon have been suspended."
    },
    {
        "title": "475 people detained during immigration raid on Hyundai factory in Georgia",
        "description": "Officers detained 475 people during an immigration raid on a Hyundai factory for electric vehicles in Georgia. ",
        "url": "https://news.sky.com/story/475-people-detained-during-immigration-raid-on-hyundai-factory-in-georgia-13425630",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hyundai-immigration-raid_7012196.jpg?20250905181315",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-05 15:35:00",
        "Headline": "The majority of those detained at the 3,000-acre site west of Savannah are from South Korea",
        "Content": "Officers detained 475 people during an immigration raid on a Hyundai factory for electric vehicles in Georgia.  The majority of those detained at the 3,000-acre site west of Savannah are from South Korea, according to Steven Schrank, special agent in charge at Homeland Security Investigations. Mr Schrank said the raid was the \"largest single-site enforcement operation\" in the history of the agency and followed an investigation of several months, which involved leads from community members and former workers. The spokesman for the South Korean foreign ministry, Lee Jaewoong, said there was a \"large\" number of South Koreans among those detained in the raid, but did not provide an exact number. He said the detained workers were part of a \"network of subcontractors\" and that the employees worked for several different companies on the Georgia site. Mr Lee said South Korea's foreign ministry is dispatching diplomats from its embassy in Washington and consulate in Atlanta to the site, and plans to form an on-site response team centred on the local mission. \"The business activities of our investors and the rights of our nationals must not be unjustly infringed in the process of US law enforcement,\" Mr Lee added. \n                  Five soldiers shot by sergeant at major US army base\n                 \n                  Man who claimed weedkiller caused cancer awarded $2.1bn by US jury\n                 \n                  Woman sues fertility clinic after giving birth to another couple's baby\n                 The Department of Homeland Security said in a statement that agents executed a search warrant \"as part of an ongoing criminal investigation into allegations of unlawful employment practices and other serious federal crimes\". The manufacturing site, which employs about 1,200 people, has been hailed as the largest economic development project in the state's history by Governor Brian Kemp and other officials. Hyundai Motor Group, the biggest automaker in South Korea, started manufacturing electric vehicles at the $7.6bn (7.4bn) site a year ago and partnered with LG Energy Solution to build an adjacent battery plant, which is set to open in 2026. ICE spokesman Lindsay Williams confirmed the raid and said agents were focused on the construction site for the battery plant. LG said in a statement that it was \"closely monitoring the situation and gathered all relevant details\". The firm said it couldn't immediately confirm how many of its employees or Hyundai workers had been detained. \"Our top priority is always ensuring the safety and well-being of our employees and partners. We will fully cooperate with the relevant authorities,\" LG said. Hyundai and LG's battery joint venture, HL-GA Battery Company, said in a statement that it's \"cooperating fully with the appropriate authorities\" and paused construction of the battery site to assist the investigation. Operations at Hyundai's electric vehicle manufacturing plant weren't interrupted, plant spokesperson Biance Johnson said. Read more from Sky News:Trump to rebrand Pentagon as Department of WarFormer President Biden has skin cancer surgery The raid is the latest in a series of sweeping ICE operations as part of President Donald Trump's mass deportation agenda, which saw immigration officers raid farms, construction sites, restaurants and auto repair shops. The US labour force lost more than 1.2 million immigrants from January through July, which includes legal and illegal immigrants, according to the Pew Research Centre, citing preliminary census data."
    },
    {
        "title": "Joe Biden has skin cancer surgery - months after 'aggressive' prostate cancer diagnosis",
        "description": "Former US president Joe Biden has had surgery for skin cancer, his spokesperson has said.",
        "url": "https://news.sky.com/story/joe-biden-has-skin-cancer-surgery-months-after-aggressive-prostate-cancer-diagnosis-13425277",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-joe-biden_7011573.jpg?20250905042030",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-05 02:48:00",
        "Headline": "The 82-year-old revealed in May he had been diagnosed with prostate cancer that had spread to his bones.",
        "Content": "Former US president Joe Biden has had surgery for skin cancer, his spokesperson has said. It's unclear when he had the procedure, but video from late August showed him leaving church in Delaware with a large, fresh scar on his head. The spokesperson told Sky's US partner, NBC News, that he was recovering well. Mr Biden had Mohs surgery, which involves removing a layer of tissue, examining it under a microscope to see if any cancer cells remain, and repeating if necessary. The 82-year had a basal cell carcinoma, one of the two most common skin cancer types, removed from his chest in 2023. His doctor said at the time that all the cancerous cells had been removed. The same year, Mr Biden's wife, Jill, had two basal cell carcinomas removed from near her eye and on her chest. The former president also revealed this May that he had stage-four prostate cancer - with the disease having spread to his bones and having a Gleason score of nine. Such a score means the disease is \"likely to grow quickly\", according to Cancer Research UK. Read more from Sky News:Trump to rebrand Pentagon as 'Department of War'The proxy war that will redefine US public health His office said the prostate cancer was discovered when Mr Biden visited a doctor for urinary symptoms and that he was considering \"multiple treatment options\". \"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive which allows for effective management,\" said a statement."
    },
    {
        "title": "Mark Zuckerberg sues Meta - but he's not who you think",
        "description": "Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook.",
        "url": "https://news.sky.com/story/mark-zuckerberg-sues-meta-but-hes-not-who-you-think-13425401",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-meta-facebook-file_6525684.jpg?20240418183042",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-05 08:55:00",
        "Headline": "Indiana bankruptcy lawyer Mark S Zuckerberg says his Facebook account is \"constantly hacked\", businesses refuse to take his bookings and he gets constant requests online for money or favours aimed at the billionaire Meta founder.",
        "Content": "\n          Science and technology reporter\n       Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook. After years of putting up with people mistaking him for the founder of Facebook, the Indiana bankruptcy lawyer has had enough. Between 2022 and 2025, Mr Zuckerberg paid over $11,000 (8,160) to Meta to advertise his law business, in an attempt to draw new clients to his law practice. His adverts, however, were repeatedly removed for \"impersonating a celebrity\" or using an inauthentic name, according to the legal filing. It was the final straw for a man who had been dealing with sharing the name of one of the world's most powerful men for well over a decade. He has documented the struggles of being Mark S Zuckerberg (rather than Meta's Mark E Zuckerberg) on his website, in a list entitled: \"Things that have happened to me because my name is Mark S Zuckerberg (I give it Zero likes)\". According to the list, he was mistakenly sued by the State of Washington who thought he was the Meta owner. He said his Facebook account is \"constantly hacked\", businesses refuse to take his bookings as they think it is a prank and on the family tree website 23andMe, he has more than 753 people claiming to be relatives who \"immediately request money\". While speaking at a Las Vegas event, he said \"a limo-driver was waiting for me at the bottom of the escalator with a sign saying 'Mark Zuckerberg', causing chaos as a large disappointed crowd had been waiting\". During an email exchange he shared between himself and Meta employees after his account was deactivated again, he said: \"If you happen to run into the younger, richer Mark Zuckerberg, tell him I say hi and he causes me great aggravation each day.\" Read more from Sky News:Revealed: Huge shortfall in NHS funding for weight-loss jabHow fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid The Indiana lawyer has spent years in communication with Facebook and verified his identity using government-issued ID and other documents, according to the emails, but his accounts were still repeatedly deactivated. Meta employees would then have to reinstate his accounts, according to the emails, and mark the pages as \"verified\" to stop it from happening again. In one email asking for help, he said to Meta: \"I don't want to make waves or cause problems, I just want my account to be reactivated and [be] left to play on the social media in peace.\" Now, however, he says he has lost thousands of dollars in advertising fees and is suing the company. \"It's not funny,\" he said to Indianapolis news channel WTHR. \"Not when they take my money. This really pissed me off.\" \"It's like buying a billboard on the side of the highway, paying the people for the billboard and then they come and put a giant blanket over it and you don't get the benefit of what you paid for,\" he said. He is accusing Meta of attempting to prevent him from having \"full use, benefit and enjoyment\" of his own legal name, which he was given before the celebrity Mark Zuckerberg was even born. A Meta spokesperson told Sky News it has reinstated Mark Zuckerberg's account, \"after finding it had been disabled in error\". \"We appreciate Mr. Zuckerberg's continued patience on this issue and are working to try and prevent this from happening in the future.\" The case has been lodged in Indiana's Marion Superior Court."
    },
    {
        "title": "Why did some people think Trump was dead?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'> Follow Trump100 on your podcast app  </a>         ",
        "url": "https://news.sky.com/story/why-did-some-people-think-trump-was-dead-13425265",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-100-donald-trump_7008873.jpg?20250902062852",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-05 00:00:00",
        "Headline": "No subtitle found",
        "Content": " Follow Trump100 on your podcast app    What is Nigel Farage doing in Washington DC? And how did he fare against the Democrats, rather than the Labour Party? Elsewhere, James Matthews speaks to survivors of Jeffrey Epstein and Ghislaine Maxwells crimes. Plus, parents in Florida can now choose not to give their children vital vaccines against diseases that could soon rear their ugly heads again. Why? And what has the health secretary, conspiracy theorist Robert F Kennedy, got to do with all of it? And why did social media think Trump was dead this week? You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Good weather and Women's Euros helps UK net surprise boost to retail sales",
        "description": "Retail sales rose a surprising amount in July, as good weather and the Women's Euros led people to part with their cash, official figures show.",
        "url": "https://news.sky.com/story/good-weather-and-womens-euros-helps-uk-net-surprise-boost-to-retail-sales-13425303",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-euros_6975528.jpg?20250727202703",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-05 05:27:00",
        "Headline": "The ONS apologised for errors in its data and the delay in releasing the latest figures. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Retail sales rose a surprising amount in July, as good weather and the Women's Euros led people to part with their cash, official figures show. The amount of spending rose 0.6% in July, according to figures from the Office for National Statistics (ONS), far above the 0.2% rise anticipated by economists polled by Reuters. In particular, clothing and footwear stores, as well as online shopping, experienced strong growth. Money blog: UK airport ranked worst for fourth year in a row When looked at on a three-month basis, the numbers are weaker, with a 0.6% fall in sales up to July due in part to downward revisions in June. Spending has declined since March, when supermarkets, sports shops, and household goods saw strong sales at the beginning of the year as warm and sunny weather pushed summer purchases earlier. Though compared to a year ago, sales are up 1.1%. Retail sales figures are significant as they measure household consumption, the largest expenditure in the UK economy. Growing retail sales can mean economic growth, which the government has repeatedly said is its top priority. A problem with the figures These figures were originally due to be published in August but were delayed by two weeks so the ONS could carry out \"quality assurance\" checks. Following the checks, the statistics body found a \"problem\", which meant it had to correct seasonally adjusted figures. It hasn't been the only question mark over the reliability of ONS figures. In March, UK trade figures were delayed due to errors from 2023, and the office continues to advise caution in interpreting changes in the monthly unemployment rate due to concerns over data reliability.  As a result of the latest error, previously monthly figures overstated the monthly volatility in the first five months of 2025, the ONS's director general of economic statistics, James Benford, said. Mr Benford apologised for the release delay and for the errors. What could it mean? It could mean retrospective changes to the UK economic growth rate, according to Rob Wood, the chief UK economist at Pantheon Macroeconomics. Read more:Firms cut jobs at fastest pace since 2021, Bank of England data showsMore than a quarter of cars sold in August were electric vehicles April's economic growth rate will be revised down, and May's will be moved up as a result, Mr Wood said. There will be no impact on the Bank of England's interest rate decision, he added."
    },
    {
        "title": "Starmer dealt trade blow as investment minister Gustafsson quits",
        "description": "The investment minister appointed by Sir Keir Starmer less than a year ago is to quit her role, dealing a fresh blow to the government's fledgling industrial strategy.",
        "url": "https://news.sky.com/story/starmer-dealt-trade-blow-as-investment-minister-gustafsson-quits-13425429",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-baroness-gustafsson_6934495.jpg?20250604143848",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-05 09:33:00",
        "Headline": "The former boss of Darktrace is quitting Sir Keir Starmer's government after less than a year as a minister in the House of Lords, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The investment minister appointed by Sir Keir Starmer less than a year ago is to quit her role, dealing a fresh blow to the government's fledgling industrial strategy. Sky News can exclusively reveal that Baroness Gustafsson of Chesterton, the former boss of cybersecurity firm Darktrace, intends to relinquish her ministerial role after just 11 months. Sources said her departure could be announced in the coming days. Money blog: UK airport ranked worst for fourth year in a row One added that her successor was in the process of being lined up and could be announced shortly, although their identity could not be learned on Friday morning. Baroness Gustafsson's resignation as a minister is said to be the result of her challenging professional schedule clashing with the demands of raising a young family, according to a person close to her. Her departure from the ministerial ranks comes less than three months after Sir Keir Starmer's government launched its long-term industrial strategy, including an enhanced role for the Office for Investment - the agency responsible for generating billions of pounds of inbound trade for the UK. \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 \n                  Tesla seeks $1trn pay package for Elon Musk\n                 \n                  Mark Zuckerberg sues Meta - but he's not who you think\n                 At the time of her appointment last year, Baroness Gustafsson said: \"It is a huge privilege to be appointed as the minister of investment, and I am excited to get started. \"I have first-hand experience of building and scaling a business here in the UK, and I am thrilled to have the opportunity to share with the international investment community what I already know to be true: the UK is a great place to do business.\" The Department for Business and Trade declined to comment. The Conservatives' shadow business secretary, Andrew Griffith, said in response to Sky News' revelation of Baroness Gustafsson's decision to quit the government: \"This is zero surprise. \"Poppy has a decent claim for constructive dismissal given Labour's attacks on wealth creators, higher taxes and exodus of international investors since day one.\""
    },
    {
        "title": "Tesla seeks $1trn pay package for Elon Musk",
        "description": "The world's richest man could be in line for a roughly $1trn pay award.",
        "url": "https://news.sky.com/story/tesla-seeks-1trn-pay-package-for-elon-musk-13425509",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-tesla_6966280.jpg?20250716161109",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-05 11:53:00",
        "Headline": "The proposed 10-year pay deal includes a series of extremely ambitious performance targets, including doubling the company value and delivering a million robotaxis and a million artificial intelligence bots.",
        "Content": "The world's richest man could be in line for a roughly $1trn pay award. Elon Musk's electric car company, Tesla, is trying to pay him about $1trn over the next decade. Money blog: UK airport ranked worst for fourth year in a row Under the proposal, Mr Musk would receive no salary or bonus but instalments of company shares for hitting ambitious targets around increasing Tesla's market share, sales, revenue and company value. It's hoped that the incentives will drive Mr Musk's performance after he left his role at the US government's Department of Government Efficiency (DOGE) and returned to spending time in the office as Tesla's chief executive. Could he get it? Tesla has regularly missed sales targets and struggled with plans to launch a robotaxi and supply chain woes. \n                  Tesla approves $29bn share award to Elon Musk\n                 \n                  Elon Musk vows to appeal after Tesla ordered to pay $243m to victims of Autopilot crash\n                 \n                  Tesla looks to cheaper model as revenue suffers worst drop in over a decade\n                 It's seeking to move away from producing just electric vehicles and move into robotics and artificial intelligence (AI). But to obtain the share tranches, very early in the plan Tesla would have to reach a market valuation of $2trn, nearly double the current value, and achieve 20 million vehicle deliveries. Over the next decade, Tesla would have to be valued at around $7.5trn, nearly eight times the current worth. Tesla delivered fewer than two million vehicles in 2024. Read more from Sky News:Firms cut jobs at fastest pace since 2021 - Bank of England dataMore than a quarter of cars sold in August were electric vehicles The deliveries milestone also requires a million robotaxis to be in commercial operation and the delivery of a million artificial intelligence bots. Mr Musk will also need to remain at Tesla for at least seven and a half years to cash out on any stock, and 10 years to earn the full amount.  A condition of the final, 11th and 12th tranches of the plan involves Mr Musk coming up with a succession plan for his CEO role. As well as getting shares, Mr Musk would also receive more voting rights within Tesla under the proposed plan. Investors will vote on the proposal at Tesla's annual shareholders meeting on 6 November. Just last month, the company board signed off on a $29bn (21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum. "
    },
    {
        "title": "Mark Zuckerberg sues Meta - but he's not who you think",
        "description": "Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook.",
        "url": "https://news.sky.com/story/mark-zuckerberg-sues-meta-but-hes-not-who-you-think-13425401",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-meta-facebook-file_6525684.jpg?20240418183042",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-05 08:55:00",
        "Headline": "Indiana bankruptcy lawyer Mark S Zuckerberg says his Facebook account is \"constantly hacked\", businesses refuse to take his bookings and he gets constant requests online for money or favours aimed at the billionaire Meta founder.",
        "Content": "\n          Science and technology reporter\n       Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook. After years of putting up with people mistaking him for the founder of Facebook, the Indiana bankruptcy lawyer has had enough. Between 2022 and 2025, Mr Zuckerberg paid over $11,000 (8,160) to Meta to advertise his law business, in an attempt to draw new clients to his law practice. His adverts, however, were repeatedly removed for \"impersonating a celebrity\" or using an inauthentic name, according to the legal filing. It was the final straw for a man who had been dealing with sharing the name of one of the world's most powerful men for well over a decade. He has documented the struggles of being Mark S Zuckerberg (rather than Meta's Mark E Zuckerberg) on his website, in a list entitled: \"Things that have happened to me because my name is Mark S Zuckerberg (I give it Zero likes)\". According to the list, he was mistakenly sued by the State of Washington who thought he was the Meta owner. He said his Facebook account is \"constantly hacked\", businesses refuse to take his bookings as they think it is a prank and on the family tree website 23andMe, he has more than 753 people claiming to be relatives who \"immediately request money\". While speaking at a Las Vegas event, he said \"a limo-driver was waiting for me at the bottom of the escalator with a sign saying 'Mark Zuckerberg', causing chaos as a large disappointed crowd had been waiting\". During an email exchange he shared between himself and Meta employees after his account was deactivated again, he said: \"If you happen to run into the younger, richer Mark Zuckerberg, tell him I say hi and he causes me great aggravation each day.\" Read more from Sky News:Revealed: Huge shortfall in NHS funding for weight-loss jabHow fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid The Indiana lawyer has spent years in communication with Facebook and verified his identity using government-issued ID and other documents, according to the emails, but his accounts were still repeatedly deactivated. Meta employees would then have to reinstate his accounts, according to the emails, and mark the pages as \"verified\" to stop it from happening again. In one email asking for help, he said to Meta: \"I don't want to make waves or cause problems, I just want my account to be reactivated and [be] left to play on the social media in peace.\" Now, however, he says he has lost thousands of dollars in advertising fees and is suing the company. \"It's not funny,\" he said to Indianapolis news channel WTHR. \"Not when they take my money. This really pissed me off.\" \"It's like buying a billboard on the side of the highway, paying the people for the billboard and then they come and put a giant blanket over it and you don't get the benefit of what you paid for,\" he said. He is accusing Meta of attempting to prevent him from having \"full use, benefit and enjoyment\" of his own legal name, which he was given before the celebrity Mark Zuckerberg was even born. A Meta spokesperson told Sky News it has reinstated Mark Zuckerberg's account, \"after finding it had been disabled in error\". \"We appreciate Mr. Zuckerberg's continued patience on this issue and are working to try and prevent this from happening in the future.\" The case has been lodged in Indiana's Marion Superior Court."
    },
    {
        "title": "Holiday park giant Parkdean lines up 250m Centerbridge funding ",
        "description": "Britain's biggest holiday parks operator is lining up an American investment firm to provide hundreds of millions of pounds of funding firepower as it eyes opportunities to consolidate the market.",
        "url": "https://news.sky.com/story/holiday-park-giant-parkdean-lines-up-163250m-centerbridge-funding-13425406",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-parkdean-resorts_5737312.jpg?20220412131233",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-05 09:10:00",
        "Headline": "Britain's biggest holiday parks operator, which employs 8,000 people during peak trading, is in talks to secure additional financing firepower from a US investment giant, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest holiday parks operator is lining up an American investment firm to provide hundreds of millions of pounds of funding firepower as it eyes opportunities to consolidate the market. Sky News has learnt that Centerbridge Partners, which has more than $50bn in assets under management, is in talks to inject roughly 250m into Parkdean Resorts. The funding, which would be provided as debt, has yet to be finalised, with sources close to Parkdean saying on Friday that other parties remained interested in leading the deal. Money blog: UK airport ranked worst for fourth year in a row Parkdean operates 65 sites across the UK, and during the summer peak trading period employs approximately 8,000 people. The company has been owned by Canada's Onex Corporation since 2016, although there have been persistent questions about how much of the 1.35bn purchase price it can expect to recoup. Industry sources believe that is a particularly pertinent issue amid growing financial pressures on British consumers. \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 \n                  Starmer dealt trade blow as investment minister Gustafsson quits\n                 \n                  Tesla seeks $1trn pay package for Elon Musk\n                 Onex has also ploughed further funding into Parkdean since the original deal, notably in the aftermath of the pandemic. Sources said that if successfully concluded, Centerbridge would join Parkdean's capital structure alongside Ares Management Corporation, its existing senior lender. The new financing would be used to strengthen Parkdean's balance sheet, and provide headroom to fund growth by upgrading some of its existing parks. Consolidation of the market through acquisitions, given the fragmented nature of the sector's ownership, is also said to be on the company's agenda. A spokesperson for the company said: \"Parkdean Resorts is running a process to strengthen the balance sheet, and to provide firepower for continued growth and sector consolidation. \"We've had record trading over the summer peak, with 98% occupancy, and growth in both revenue and [earnings].\" The capital-raising process is being run by bankers at Rothschild. Parkdean is run by Steve Richards, the veteran leisure industry executive. Centerbridge declined to comment."
    },
    {
        "title": "Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation",
        "description": "David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM.",
        "url": "https://news.sky.com/story/lammy-appointed-justice-secretary-and-deputy-pm-following-rayners-resignation-13425692",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-david-lammy-shabana-mahmood_7012268.jpg?20250906001444",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-09-05 17:38:00",
        "Headline": "Sir Keir Starmer has carried out a major ministerial reshuffle following Angela Rayner's exit. Here's what you need to know.",
        "Content": "\n          Political reporter\n              @WillCharley1\n  David Lammy has been stripped of his role as foreign secretary, and given the job of justice secretary, along with the role of deputy PM. Mr Lammy's move was one of the most momentous of Sir Keir Starmer's ministerial reshuffle on Friday afternoon, which saw a whole host of roles change hands, and two departments partially combined. Politics latest: Follow for live updates The PM moved him away from one of the great offices of state, despite his apparently burgeoning 'bromance' with US vice president JD Vance. But Mr Lammy benefited from Angela Rayner's departure. The deputy prime minister and housing secretary resigned from government on Friday morning, after it was found she had breached the ministerial code over her tax affairs. Sir Keir regretfully accepted her resignation, leaving her roles vacant. Thus began the ministerial reshuffle, brought forward by several weeks as a result of Ms Rayner's departure. Mr Lammy has been given the role of deputy prime minister, and appeared cheery on Friday afternoon - strolling up Downing Street in the sunshine with a big smile on his face. \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  His move from the Foreign Office to the Ministry of Justice then allowed Yvette Cooper, the home secretary, to take on Mr Lammy's previous job. She has never served in any role involving foreign affairs before, bar a three-month stint as shadow foreign secretary in 2010. Her pivot to foreign affairs then allowed the biggest promotion of them all, with then justice secretary and key Starmer ally, Shabana Mahmood, being appointed as home secretary. This means that for the first time in British history, all three great offices of state, after the prime minister, are held by women. With those roles rejigged, and Number 10 insisting from the start that Rachel Reeves was safe as chancellor, it was time to tinker with the rest of the cabinet. It appears that while the reshuffle was carried out unexpectedly early, a lot of thought had gone into it. Sir Keir began by creating a new 'super ministry', combining the skills remit of the Department for Education with the Department for Work and Pensions.  Pat McFadden, on Friday morning the chancellor of the Duchy of Lancaster (the highest ranking Cabinet Office minister), has been given responsibility for this new ministerial empire. It also means that Bridget Phillipson, who was and remains the education secretary, has had her responsibilities slimmed down. Officially, Mr McFadden has become the work and pensions secretary. This meant the current occupant of that role, Liz Kendall, also needed to be reshuffled. She has now been appointed as the science, innovation and technology secretary. Her predecessor in that role, Peter Kyle, in turn received a promotion to lead the Department of Business and Trade. Mr Kyle made incorporating and using AI a key part of his first year in office, and had been seen to be doing well in the job. His promotion, though, has led to the current business secretary, Jonathan Reynolds, being left without a department. While he remains in the cabinet, his appointment to the job of chief whip is unlikely to be viewed as a promotion. The reshuffle brought better news for Darren Jones, who was only promoted on Monday to the newly created role of chief secretary to the prime minister. He got to keep his role, but was gifted Mr McFadden's old job - chancellor of the Duchy of Lancaster - to add to his growing political portfolio.  Read more:Cabinet reshuffle: Who's in and who's outWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time Steve Reed, another long-time Starmer ally, benefitted alongside Mr Lammy from Ms Rayner's departure. He has been given her former role of housing secretary, leaving behind the Department for Environment, Food and Rural Affairs. Also ending in a better position than they started off on Friday morning are Emma Reynolds, a Treasury minister who has now received Mr Reed's old job, and trade minister Douglas Alexander, who has now become the Scotland secretary. Sir Alan Campbell, previously chief whip, has now become leader of the House of Commons. On the other side of the spectrum, former leader of the Commons Lucy Powell, and ex-Scotland secretary Ian Murray, joined Ms Rayner in leaving the government. Both were sacked, and both made clear their desire not to lose their roles. Ms Powell said it had been \"an honour\" to serve but warned that \"the future of our democracy looks uncertain\", citing rising levels of \"abuse, misrepresentation.... and the call for easy answers\". Mr Murray also echoed this sentiment, stating that politics in the UK \"is at a dangerous crossroads\". He called on MPs to bring \"prosperity, hope and our communities together, rather than furthering division and despair\", and said he would support Sir Keir's government from the backbenches."
    },
    {
        "title": "Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?",
        "description": "Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home.",
        "url": "https://news.sky.com/story/cabinet-reshuffle-whos-on-keir-starmers-new-team-and-whos-out-13425636",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cabinet-reshuffle-yvette-cooper_7012244.jpg?20250905185730",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-05 15:48:00",
        "Headline": "The prime minister has completed a major cabinet reshuffle, replacing key figures in his top team. But who is in and who is out?",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has reshuffled his cabinet following Angela Rayner's resignation after admitting she had not paid enough stamp duty on the purchase of a new home. The prime minister's former right-hand woman stepped down as deputy prime minister, housing secretary and deputy leader of the Labour Party after standards adviser Sir Laurie Magnus found she had breached the ministerial code. Politics latest: Reshuffle after Rayner quits She paid standard stamp duty on a flat she bought in Hove, East Sussex, in May after taking advice that it counted as her only home due to her disabled son's trust owning the family home in Ashton-under-Lyne - but it was established she should have paid more. Her resignation has left a hole around the cabinet table, which Sir Keir is now filling.  It was stressed early on Chancellor Rachel Reeves would remain as chancellor, in an attempt to stop the markets moving. Read more: The working class mum who left school at 16 and became deputy PM \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 This is who is moving and where to: David Lammy - foreign secretary to justice secretary and deputy PM After flexing his diplomatic muscles with Donald Trump and his deputy JD Vance over the past year, Mr Lammy will now move to the justice brief. The move is likely to be a blow as the PM had promised, most recently in November, he would be foreign secretary for the whole parliament until 2029. Although he is no longer holding one of the four great offices of state, he has also been made deputy prime minister, presumably to soften the blow. Mr Lammy is close to Sir Keir, both as a friend and in his next door constituency, and was seen grinning as he went into Number 10 after being appointed. Yvette Cooper - home secretary to foreign secretary The Labour stalwart had made tackling illegal migration a priority, so the move could be seen as a disappointment for her. However, she remains in one of the four great offices of state - PM, chancellor, foreign and home. Shabana Mahmood - justice secretary to home secretary A big promotion, the straight-talking Labour MP will be tasked with tackling the small boats crisis and asylum seeker hotel protests. She is no stranger to making difficult decisions, deciding to free criminals early to reduce prison overcrowding as justice secretary. Her move makes it the first time all three great offices of state, after the prime minister, are held by women. Pat McFadden - chancellor of the Duchy of Lancaster and intergovernmental minister to work and pensions secretary and head of \"super ministry\" Often seen as Sir Keir's \"number two\", Mr McFadden will take over a newly formed \"super ministry\". It will include the department for work and pensions and the skills remit of the department for education - taking a large part of Education Secretary Bridget Phillipson's brief and taking over from Liz Kendall as work and pensions secretary. While it is not a promotion at first glance, it is a much wider role than he has had as chancellor of the Duchy of Lancaster - the highest-ranking Cabinet Office minister after the PM. Darren Jones - chancellor of the Duchy of Lancaster It is the second new job in the space of one week for the new chancellor of the Duchy of Lancaster. The close ally of the prime minister was promoted from chief secretary to the Treasury on Monday to chief secretary to the prime minister. And now he gets another new job. Steve Reed - environment secretary to housing secretary A promotion for the man who has consistently defended the government lifting inheritance tax relief on farmers. He takes over one of the two major vacancies left by Ms Rayner and will have the massive task of building 1.5 million new homes during this parliament, as promised by the government. Jonathan Reynolds - business and trade secretary to chief whip A slightly odd move for the MP seen as a steady pair of hands in his business secretary role. He takes over from Sir Alan Campbell and will now have to hustle Labour MPs to vote with the government - something that has sometimes proved difficult with the current cohort. Mr Reynolds will also attend cabinet, as is necessary so he can liaise between the party and No 10. Peter Kyle - science secretary to business and trade secretary A promotion for Mr Kyle, who is taking over from Jonathan Reynolds. He is seen as a rising star and impressed Labour MPs when he refused to stand down after suggesting Nigel Farage was on the side of people like Jimmy Savile by opposing the government's online safety law. Mr Kyle will be in charge of getting trade deals with other countries over the line. Emma Reynolds - economic secretary to the Treasury to environment secretary Probably the biggest promotion of the reshuffle, Ms Reynolds is taking on Mr Reed's role after serving as a junior minister in the Treasury. She will have to take on farmers and deal with the water companies - a big undertaking. Liz Kendall - work and pensions secretary to science, innovation and technology secretary Pat McFadden has taken her role as work and pensions secretary, while Ms Kendall takes over Peter Kyle's brief. He has made AI a major facet of his role so we will wait to see which direction Ms Kendall takes the job in. Douglas Alexander - trade policy minister to Scotland secretary A promotion for the Blair/Brown minister who returned to politics last year after being ousted in 2015 by then 20-year-old SNP MP Mhairi Black. He takes over from Ian Murray, who has been removed from the cabinet. Sir Alan Campbell - Chief whip to Lord President of the Council and leader of the House of Commons An MP since 1997 and part of Tony Blair and Gordon Brown's frontbench, Sir Alan is taking over Lucy Powell's role. He will be in charge of organising government business in the Commons - a sizeable job. Who is out? Lucy Powell has been sacked as leader of the House of Commons. Ian Murray has been sacked as Scotland secretary. Not out - but Bridget Phillipson remains as education secretary but her brief has narrowed as Mr McFadden has taken over the skills part of her job."
    },
    {
        "title": "Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party",
        "description": "It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted.",
        "url": "https://news.sky.com/story/angela-rayner-may-no-longer-be-at-the-top-table-but-she-remains-a-powerful-force-in-the-labour-party-13425829",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-labour_7012455.jpg?20250905222440",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-05 20:58:00",
        "Headline": "Ms Rayner is badly wounded but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more.",
        "Content": "\n          Political editor\n              @BethRigby\n It was clear from the prime minister's very personal and handwritten letter to his fallen deputy Angela Rayner, that this was a resignation he did not want and deeply regretted. And so he should: Ms Rayner's departure from his government is a huge loss. She is a powerhouse within the Labour Party and a figurehead of the left, who brought Sir Keir's project some legitimacy from quarters of the Labour movement minded to give him short shrift. Describing her as a \"true friend\" and the embodiment of the sort of social mobility he would want to leave as his legacy in office, it was clear that the prime minister both mourned her departure and wanted to keep his formidable and politically astute former deputy onside. Because her departure does create difficulties. She is badly-wounded now, but could be a beacon on the backbenches should she seek to rebuild her political career and climb the ladder once more. Ms Rayner is a politician deeply admired in pockets of the party and a product of the trade union movement. Politics latest: Cabinet reshuffle after Rayner quits  There is no sense that she would be disloyal to Sir Keir but she is a figurehead whether she wants it or not. The manner of her departure - forced out because she underpaid her tax and in doing so failed to uphold the highest standards in public office, is also difficult. Sir Keir's rivals will be armed with plenty of ammunition this Budget should the chancellor choose to raise property taxes even as a leading Labour figure underpaid theirs. There is also the matter of the deputy Labour leadership race: this is an elected post that Ms Rayner quit on Friday and already there is a battle emerging between the party's left and centre right over who should succeed her. As the saying goes, \"divided parties don't win elections\" and Labour's divisions are now about to be put on full display in a very public race to replace Ms Rayner at the top of the Labour Party. But for all these difficulties, Sir Keir on Friday sought to turn a crisis into a catalyst for change by completely overhauling his top team in a reshuffle that even serving cabinet ministers had no clue was coming. Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next electionThe working class mum who left school at 16 and became deputy PM  This is a prime minister that is trying to reinvigorate a flagging government and reset a stuttering Number 10. It was decisive and defiant. For months he has been under fire for being too careful and cautious, tentative and timid. But today he has rolled the dice and changed the top team in an effort to reset the government and get back to winning ways. The biggest changes reserved for the two of the biggest priorities: a new home secretary in Shabana Mahmood tasked with tackling the small boats crisis and a new super ministry, headed up by Sir Keir's close ally Pat McFadden, to tackle the burgeoning welfare bill and get people back to work. One senior figure told me on Friday night that the prime minister had been thinking hard over the summer about having a \"kitchen cabinet\" - a phrase which alludes to a band of trusted advisors - to give him more advice.  In this reshuffle you can see some of the fruits of that, with his leadership campaign manager and close friend David Lammy becoming deputy prime minister and Jonathan Reynolds moving to chief whip - a critical role for a prime minister struggling with his backbenches - and Mr McFadden tasked with another key job. \"What he needs are politicians he feels comfortable with,\" said one figure. \"This is about the PM reaching for the right kind of support and a team he trusts and can rely on\". Ms Rayner is no longer around that table but she will remain a powerful force in the Labour Party and British politics as we watch what she does next from the backbenches. Sir Keir will hope his fresh top table can restore some of his power too. It is hard to see now how this prime minister gets back to his winning ways, but this reshuffle at least showed an appetite to try."
    },
    {
        "title": "What a moment for Shabana Mahmood to take the helm at the Home Office",
        "description": "Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary. ",
        "url": "https://news.sky.com/story/what-a-moment-for-shabana-mahmood-to-take-the-helm-at-the-home-office-13425665",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-shabana-mahmood-taser_6975862.jpg?20250728102659",
        "type": "Politics",
        "Author": "Jason Farrell",
        "Date Published": "2025-09-05 16:45:00",
        "Headline": "Ms Mahmood, considered a \"blue Labour\" social conservative, will take charge of the police, MI5 and the government's domestic direction of travel at a time of great flux.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Shabana Mahmood is moving from dealing with a creaking-at-the-seams prison service as justice secretary to an even more pressured asylum system as home secretary.  The department she will now head up will be making dynamic shifts to counter the public mood on immigration and grooming gangs. Politics latest: Major cabinet reshuffle What a moment for the Home Office mantle to be grasped by the first Muslim woman to occupy one of the great offices, taking charge of the police, MI5 and the government's domestic direction of travel at a time of great flux. She has also become the home secretary of a country where the national flag is being hoisted as a symbol of dissatisfaction - with anger at the arrival of desperate migrants crossing the Channel in small boats. Ms Mahmood picks up the in-tray of a home secretary who has been forced to make moves that often seemed to defy her natural position - tougher rules on asylum seekers, proscribing a pro-Palestinian group of activists, and ordering an inquiry into grooming gangs. But perhaps all this will come more naturally to our new home secretary. \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 \n                  'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls\n                 \n                  Two Labour-run councils 'considering all options' to challenge migrant hotel use\n                 The Oxford-educated MP is considered a \"blue Labour\" social conservative. Only last month she announced that foreign criminals will be deported after sentencing to free up prison space and protect the public.  Read more:Cabinet reshuffle: Who's in and who's out?Angela Rayner's resignation letter in fullFarage says Reform is on course to win next election On the issue of Asian grooming gangs, she recently told former Tory Cabinet minister Michael Gove in the Spectator that \"there is still a moment of reckoning\", adding \"there is still an outstanding question of why so many people looked the other way\". She studied at Lincoln College, Oxford, where she managed to win the vote of Rishi Sunak to become junior common room president, and she used her electioneering skills to help Prime Minister Sir Keir Starmer win the general election. She had declined a position in Jeremy Corbyn's shadow cabinet and became crucial to Labour's regeneration, describing her role as \"dragging them back to a position of common sense\". Ms Mahmood will need that antenna for public opinion in the months to come."
    },
    {
        "title": "Rayner resigns and Starmer resets (again)",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'>  Click here to listen to Electoral Dysfunction on your podcast app </a>     ",
        "url": "https://news.sky.com/story/rayner-resigns-and-starmer-resets-again-13425459",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-05 10:34:00",
        "Headline": "No subtitle found",
        "Content": "  Click here to listen to Electoral Dysfunction on your podcast app   Beth, Harriet and Ruth reassemble after Angela Rayner's resignation prompts one of the biggest cabinet reshuffles in years. She admitted she didn't pay enough stamp duty on the purchase of a new home and, after an ethics investigation, quit as deputy prime minister and housing secretary. David Lammy takes the deputy role with a move to justice secretary. Keir Starmer's had two resets in a week - can he now get on with his dream of delivery? Remember, you can also watch us on YouTube."
    },
    {
        "title": "Rookie diplomat Yvette Cooper could not be picking up the Foreign Secretary reins at a more challenging time",
        "description": "David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary.",
        "url": "https://news.sky.com/story/rookie-diplomat-yvette-cooper-could-not-be-picking-up-the-foreign-secretary-reins-at-a-more-challenging-time-13425682",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-yvette-cooper-downing-street_7012221.jpg?20250905183442",
        "type": "Politics",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-05 17:27:00",
        "Headline": "Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n David Lammy recently told a radio interviewer he had \"a powerful sense that I'm the right guy in the right job at the right time to do this\", as foreign secretary. Those who travelled with him observed a man in his element, whether in the frozen wastes of Svalbard or the corridors of power. He confided that he expected to stay in the job for the duration of this parliament. So much for all that. Follow the latest: Lammy, Cooper and Mahmood get new jobs While opinions differ on how good he was at his job, he certainly revelled in it and threw himself into the role. He is making way for someone who has never held an international affairs posting in government. Yvette Cooper's experience in power goes back to the Blair years, but it's always been on the home front. And yet this rookie diplomat could not be taking up the reins as Britain's foreign secretary at a more challenging time. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 The war in Ukraine has mutated into something even more challenging than the biggest land war on the continent of Europe since the Second World War. It is turning into a monumental struggle between East and West. Vladimir Putin is resurgent, striding the world stage again, and this week winning more support from China and North Korea. The West seems divided between Europeans who want a ceasefire and more severe sanctions on Russia's oil trade and Donald Trump, who doesn't anymore but seems at a loss over what to do instead. Gaza is sinking into even more of a horror show with no let-up in the war, and accusations that the Labour government is conniving in an alleged genocide perpetrated by Israel. On top of the diary entries Yvette Cooper will be handed as she takes up her new job will be the UN General Assembly in New York, where Britain is expected to recognise the state of Palestine along with other nations. Read more:Cabinet reshuffle: Who's in and who's out?In full: Angela Rayner's resignation letter If the Home Office is known for being strewn with banana skins, the Foreign Office is rigged with minefields. Foremost among them, the Middle East and the Starmer government's attempts to walk a perilous tightrope between friends of Israel and supporters of the Palestinians. David Lammy was criticised by some for not being firm enough or decisive. In his defence, he had not been in the job that long, and he avoided any massive missteps. He thought deeply about his role and seemed adept at managing the Trump administration. Not bad for someone who once called Donald Trump a \"neo nazi sociopath\". He managed to maintain good relations with both Barack Obama and JD Vance. Yvette Cooper has a reputation for straight talking, not always helpful in diplomacy. But she is regarded as intellectually rigorous, preferring substance over style. She will need to be a quick learner as she tries to master her brief in a world that is only becoming more dangerous and more complicated."
    },
    {
        "title": "From non-job to key job - Why there's so much at stake in the election for Rayner's replacement",
        "description": "It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war.",
        "url": "https://news.sky.com/story/from-non-job-to-key-job-why-theres-so-much-at-stake-in-the-election-for-rayners-replacement-13425671",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-bespoke-rayner_7011923.jpg?20250905132200",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-05 17:03:00",
        "Headline": "Labour's deputy role was once thought of as a nothing job, but it's now become a key position - and will be fiercely fought over.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n It was once regarded as a non-job. But the election for Angela Rayner's successor as deputy Labour leader threatens to plunge the party into a new civil war. The contest, whenever it happens, could potentially be the most divisive since the bitter left-right split when Tony Benn challenged the incumbent, Denis Healey, in 1981. It was the year of the launch of the breakaway SDP by the \"Gang of Four\" - Roy Jenkins, David Owen, Shirley Williams and Bill Rodgers - and defections by several more Labour MPs. There was speculation that if Benn had won - then in his hard-left phase before he became a national treasure in his latter years - there would be far more defections to the SDP. Politics latest - follow live This time, however, the threat of defections by Labour MPs comes not from the centre, but from Jeremy Corbyn's new party, which could be triggered if the left's candidate is crushed. So many Labour MPs will want to see a candidate elected to replace Ms Rayner who provides a balanced ticket, a left-right combination with Sir Keir Starmer. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From denial to resignation: How Rayner's position fell apart - and why tax row risks damaging public trust\n                 \n                  Angela Rayner quits: Full text of ethics adviser's verdict on tax affairs\n                  Back in 1981 the Benn-Healey battle was fought out in a filthy mood at Labour's autumn conference in Brighton, with the former chancellor winning by a wafer-thin 50.4% to 49.6%. The mood was so poisonous that Neil Kinnock, who'd refused to back Mr Benn, has claimed he was assailed by a young Benn supporter in the lavatory of the Grand Hotel and boasted: \"I beat the **** out of him.\" Contrast that with the comradely contest when Ms Rayner beat rivals Richard Burgon, Dawn Butler, Rosena Allin-Khan and Ian Murray in a ballot of party members in 2020. Of those four, a furious Mr Murray has just been sacked as Scotland Secretary by Sir Keir, while Mr Burgon and Ms Butler are regarded as likely to stand again this time. Big names and famous faces in the role throughout the years Over the years, some big names have been Labour's deputy leader, including Clement Attlee in the 1930s before he became leader and left-wing firebrand Aneurin Bevan for a year, until his death in 1960. Mr Healey was followed in 1983 by Roy Hattersley, who'd stood on a so-called \"dream ticket\" with Mr Kinnock. Mr Benn and fellow left-winger Eric Heffer were derided by MPs as \"the nightmare ticket\". Then came Margaret Beckett, John Prescott, Harriet Harman and Tom Watson. But of all Labour's deputies, Mr Attlee was the only one to go on to become leader and a Labour prime minister. The post was said to be a non-job under Harold Wilson when his deputy was George Brown, better known for his drinking than his political achievements, and Ted Short, who even called his memoirs \"I Knew My Place\". It was the bruising Benn-Healey contest that elevated the status of deputy leader. And the two most famous recent deputies, John Prescott and Angela Rayner, went on to become deputy prime minister. So from a non-job, it's become a key job. Mr Prescott and Ms Rayner were seen as human shields for Mr Blair and Sir Keir against the left and the more militant trade unions. Read more:Rayner admits she should have paid more stamp dutyRayner came out fighting in Sky interviewRayner's tax affairs statement in full No wonder Sir Keir's handwritten letter to Ms Rayner after her resignation was so friendly and sympathetic. He didn't want to lose his human shield. In the Conservative Party, Margaret Thatcher famously said of her deputy William Whitelaw: \"Every prime minister needs a Willie.\" In the Labour Party, these days every prime minister needs a protector, a gatekeeper, a fixer and a go-between. That's why there's so much at stake in the election for Angela Rayner's successor."
    },
    {
        "title": "A more polished set of players - but is Reform really now a government in waiting?",
        "description": "For a party in the throes of professionalisation, you still don't have to look far at Reform UK's conference for evidence of the unexpected.",
        "url": "https://news.sky.com/story/a-more-polished-set-of-players-but-is-reform-really-now-a-government-in-waiting-13425762",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage_7012131.jpg?20250905165923",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-09-05 19:39:00",
        "Headline": "The first day of Reform UK's conference has gone smoothly - but are they ready for office?",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  For a party in the throes of professionalisation, you still don't have to look far at Reform UK's conference for evidence of the unexpected. Exhibit A - The Lincolnshire mayor on stage singing a song she wrote about insomnia in a sparkly blue jumpsuit. Exhibit B - One of the party's MPs being accused of leaking details about a former colleague's terminally ill dog. All of that aside, this is still - by a country mile - the slickest any Farage-led outfit has ever looked. They are of course helped on this occasion by the latest bout of havoc afflicting the government. Politics latest - Starmer holds major reshuffle Ever the canny media operator, Nigel Farage brought his speech forward to capitalise on this chaos. \n                  Watch Reform party conference live\n                 \n                  Why did some people think Trump was dead?\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 Rules over balance mean broadcasters are bound to air leader's speeches.  So here was the Reform leader - as is his way - inserting himself into the centre of the story in a way that his Tory rival Kemi Badenoch seems unable, or perhaps unwilling, to do. And Mr Farage couldn't have wished for a better scandal to seize on. \"A government that despite all the promises that this would be a new, different kind of politics is as bad, if not worse, than the one that went before\", he declared. This is the 'two cheeks of the same backside' strategy in action.  But beyond the customised football shirts and branded wallets, is this a party genuinely evolving from rag-tag rabble rousers to a possible government in waiting? Whisper it round this conference, but Reform hasn't had the smoothest of runs in their newly expanded state. Yes, they've gained an MP through a by-election, but they've also lost two through infighting and scandal. Then there's party bigwig Zia Yusuf walking out the fold, before changing his mind and walking back in a day later. On policy, too, sources point to the broader range of issues being discussed this year, but there are still large question marks hanging over some of the party's big proposals. For a start, they may be eye-catching, but are the asylum plans really workable? Likewise, after running on a platform last year around big tax cuts, the party will need to work hard to avoid accusations they are Liz Truss round two.  Then on people, there may be potential for the future, but as it stands this is still pretty much a case of Farage and friends. Their latest arrival, Nadine Dorries, is being hailed as bringing that much-needed government experience. Though that way danger might still lie, if these insurgents start to look too much like the broken politics of the past they are claiming to overhaul. So, a more polished set of players, yes - but these are still tactics that have been deployed by Nigel Farage for decades. But in all honesty, that's probably why it all seems to be working so well."
    },
    {
        "title": "Farage says Reform is on course to win next election and he expects 'big rift' in Labour Party",
        "description": "Reform leader Nigel Farage has said his party is on track to become the next government - adding that there will be a \"big rift\" in the Labour Party following Angela Rayner's resignation.",
        "url": "https://news.sky.com/story/farage-says-reform-is-on-course-to-win-next-election-and-he-expects-big-rift-in-labour-party-13425595",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-party_7012132.jpg?20250905170041",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-05 14:28:00",
        "Headline": "The Reform UK leader also welcomed former culture secretary Nadine Dorries to the stage after she defected to the party from the Tories. ",
        "Content": " Reform leader Nigel Farage has said his party is on track to become the next government - adding that there will be a \"big rift\" in the Labour Party following Angela Rayner's resignation. Mr Farage struck a triumphant tone at the Reform UK conference in Birmingham this afternoon, where he said there is \"every chance\" the next general election will take place in 2027. Politics latest: Major cabinet reshuffle The Reform leader was due to speak at 4pm today but brought the meeting forward by three hours after Ms Rayner stepped down as deputy prime minister and housing minister. Ms Rayner had been under pressure after admitting to Sky News' political editor Beth Rigby on the Electoral Dysfunction podcast this week that she didn't pay enough tax on her second home. Mr Farage told activists he was making his speech earlier than planned because the government is \"deep in crisis\" following her resignation. He continued: \"You simply can't get away, can you, from being the housing secretary and avoiding 40,000 of council tax.\" \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  Cabinet reshuffle: Who's on Keir Starmer's new team and who's out?\n                 \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 Ms Rayner had in fact failed to not pay enough stamp duty - not council tax as Mr Farage claimed. The Reform leader said her failure to pay the money \"screams to entitlement\" and claimed the government is \"as bad if not worse\" than their Conservative predecessors. Ms Rayner's replacement as deputy leader of the party will be decided through a vote by members - with details of the contest to be set out at a later date. Mr Farage said during his speech that he expects there to be a \"big rift in the Labour Party\" and added: \"Before long, there'll be Labour MPs that reckon they've got a better chance on the Jeremy Corbyn sectarian ticket. \"I think there is every chance now of a general election happening in 2027.\" Mr Corbyn announced in July that he would be setting up a new left-wing political party. Mr Farage told members he believes Reform is \"on track\" to enter government and that he is setting up an internal department to prepare for office. He also said he would stop migrants arriving in the UK on small boats within a fortnight if he wins the next election. The Reform leader had been welcomed onto the stage with pyrotechnic smoke and fireworks and a standing ovation. People in the crowd were seen drinking pints as they watched his speech. Mr Farage also welcomed former Conservative culture secretary Nadine Dorries on stage after the former I'm a Celebrity Get Me Out of Here contestant announced her defection from the Tories on the eve of the conference. The pair had an awkward embrace on stage which included Mr Farage kissing Ms Dorries on the top of her head.  Ms Dorries told members: \"I feel for the first time in a number of years as though I'm at a conference and amongst people who share the same principles and values as I have always held.\" Meanwhile, the Labour Party said Mr Farage was offering \"anger without answers\" with his speech. It added in a statement: \"His answer to the charge that Reform is a one-man band was to unveil one of the faces of failure from the last Tory government, Nadine Dorries.\" Dame Andrea Jenkyns, a former Conservative MP who defected to Reform after losing her seat in the last election, later walked on stage singing a song named Insomniac while wearing a sparkling outfit. Dame Andrea reportedly wrote the song herself. Starmer shuffles his pack The opening day of the Reform conference has been held as Prime Minister Sir Keir Starmer has been reshuffling his top team for the first time since taking office in July last year. Chancellor Rachel Reeves has kept her job, while David Lammy has been moved from foreign secretary to justice secretary. Mr Lammy will also replace Ms Rayner as deputy prime minister. Meanwhile, Yvette Cooper has been moved from home secretary to foreign secretary. Shabana Mahmood will move from justice secretary to home secretary."
    },
    {
        "title": "Mark Zuckerberg sues Meta - but he's not who you think",
        "description": "Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook.",
        "url": "https://news.sky.com/story/mark-zuckerberg-sues-meta-but-hes-not-who-you-think-13425401",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-meta-facebook-file_6525684.jpg?20240418183042",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-05 08:55:00",
        "Headline": "Indiana bankruptcy lawyer Mark S Zuckerberg says his Facebook account is \"constantly hacked\", businesses refuse to take his bookings and he gets constant requests online for money or favours aimed at the billionaire Meta founder.",
        "Content": "\n          Science and technology reporter\n       Mark Zuckerberg - not that one - is suing Meta, the owner of Facebook. After years of putting up with people mistaking him for the founder of Facebook, the Indiana bankruptcy lawyer has had enough. Between 2022 and 2025, Mr Zuckerberg paid over $11,000 (8,160) to Meta to advertise his law business, in an attempt to draw new clients to his law practice. His adverts, however, were repeatedly removed for \"impersonating a celebrity\" or using an inauthentic name, according to the legal filing. It was the final straw for a man who had been dealing with sharing the name of one of the world's most powerful men for well over a decade. He has documented the struggles of being Mark S Zuckerberg (rather than Meta's Mark E Zuckerberg) on his website, in a list entitled: \"Things that have happened to me because my name is Mark S Zuckerberg (I give it Zero likes)\". According to the list, he was mistakenly sued by the State of Washington who thought he was the Meta owner. He said his Facebook account is \"constantly hacked\", businesses refuse to take his bookings as they think it is a prank and on the family tree website 23andMe, he has more than 753 people claiming to be relatives who \"immediately request money\". While speaking at a Las Vegas event, he said \"a limo-driver was waiting for me at the bottom of the escalator with a sign saying 'Mark Zuckerberg', causing chaos as a large disappointed crowd had been waiting\". During an email exchange he shared between himself and Meta employees after his account was deactivated again, he said: \"If you happen to run into the younger, richer Mark Zuckerberg, tell him I say hi and he causes me great aggravation each day.\" Read more from Sky News:Revealed: Huge shortfall in NHS funding for weight-loss jabHow fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid The Indiana lawyer has spent years in communication with Facebook and verified his identity using government-issued ID and other documents, according to the emails, but his accounts were still repeatedly deactivated. Meta employees would then have to reinstate his accounts, according to the emails, and mark the pages as \"verified\" to stop it from happening again. In one email asking for help, he said to Meta: \"I don't want to make waves or cause problems, I just want my account to be reactivated and [be] left to play on the social media in peace.\" Now, however, he says he has lost thousands of dollars in advertising fees and is suing the company. \"It's not funny,\" he said to Indianapolis news channel WTHR. \"Not when they take my money. This really pissed me off.\" \"It's like buying a billboard on the side of the highway, paying the people for the billboard and then they come and put a giant blanket over it and you don't get the benefit of what you paid for,\" he said. He is accusing Meta of attempting to prevent him from having \"full use, benefit and enjoyment\" of his own legal name, which he was given before the celebrity Mark Zuckerberg was even born. A Meta spokesperson told Sky News it has reinstated Mark Zuckerberg's account, \"after finding it had been disabled in error\". \"We appreciate Mr. Zuckerberg's continued patience on this issue and are working to try and prevent this from happening in the future.\" The case has been lodged in Indiana's Marion Superior Court."
    },
    {
        "title": "Tesla seeks $1trn pay package for Elon Musk",
        "description": "The world's richest man could be in line for a roughly $1trn pay award.",
        "url": "https://news.sky.com/story/tesla-seeks-1trn-pay-package-for-elon-musk-13425509",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-tesla_6966280.jpg?20250716161109",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-05 11:53:00",
        "Headline": "The proposed 10-year pay deal includes a series of extremely ambitious performance targets, including doubling the company value and delivering a million robotaxis and a million artificial intelligence bots.",
        "Content": "The world's richest man could be in line for a roughly $1trn pay award. Elon Musk's electric car company, Tesla, is trying to pay him about $1trn over the next decade. Money blog: UK airport ranked worst for fourth year in a row Under the proposal, Mr Musk would receive no salary or bonus but instalments of company shares for hitting ambitious targets around increasing Tesla's market share, sales, revenue and company value. It's hoped that the incentives will drive Mr Musk's performance after he left his role at the US government's Department of Government Efficiency (DOGE) and returned to spending time in the office as Tesla's chief executive. Could he get it? Tesla has regularly missed sales targets and struggled with plans to launch a robotaxi and supply chain woes. \n                  Tesla approves $29bn share award to Elon Musk\n                 \n                  Elon Musk vows to appeal after Tesla ordered to pay $243m to victims of Autopilot crash\n                 \n                  Tesla looks to cheaper model as revenue suffers worst drop in over a decade\n                 It's seeking to move away from producing just electric vehicles and move into robotics and artificial intelligence (AI). But to obtain the share tranches, very early in the plan Tesla would have to reach a market valuation of $2trn, nearly double the current value, and achieve 20 million vehicle deliveries. Over the next decade, Tesla would have to be valued at around $7.5trn, nearly eight times the current worth. Tesla delivered fewer than two million vehicles in 2024. Read more from Sky News:Firms cut jobs at fastest pace since 2021 - Bank of England dataMore than a quarter of cars sold in August were electric vehicles The deliveries milestone also requires a million robotaxis to be in commercial operation and the delivery of a million artificial intelligence bots. Mr Musk will also need to remain at Tesla for at least seven and a half years to cash out on any stock, and 10 years to earn the full amount.  A condition of the final, 11th and 12th tranches of the plan involves Mr Musk coming up with a succession plan for his CEO role. As well as getting shares, Mr Musk would also receive more voting rights within Tesla under the proposed plan. Investors will vote on the proposal at Tesla's annual shareholders meeting on 6 November. Just last month, the company board signed off on a $29bn (21.8bn) share award to Elon Musk after a court blocked an earlier package worth almost double that sum. "
    },
    {
        "title": "How to see the blood moon total lunar eclipse this weekend",
        "description": "If you look up to the sky on Sunday, you might just see a rare celestial event - a total lunar eclipse. ",
        "url": "https://news.sky.com/story/how-to-see-the-blood-moon-total-lunar-eclipse-this-weekend-13425363",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-blood-moon-south-carolina_6856009.jpg?20250314100534",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-05 07:37:00",
        "Headline": "The last total lunar eclipse visible in the UK was in 2022, and it won't occur again until August 2026. Here's how and when you can spot the rare celestial event.",
        "Content": "If you look up to the sky on Sunday, you might just see a rare celestial event - a total lunar eclipse.  The phenomenon occurs when the sun, Earth and the moon align perfectly with one another in a straight line. As the moon passes through the darkest part of the Earth's shadow - known as the umbra - it causes it to turn a deep, dark red colour, creating what is known as a blood moon. Lunar eclipses are not always 'total' and for UK observers, a total eclipse hasn't been visible since 2022, and won't occur again until August 2026. Here is everything you need to know in order to catch a glimpse this weekend. When is the blood moon? The eclipse will begin while the moon is still below the UK's horizon. This means that as it rises, it will already be in total eclipse. The Royal Observatory says the best time to see the blood moon is 7.33pm on Sunday. It will continue to slowly move out of the Earth's shadow until 9.55pm, giving stargazers in the UK approximately two hours and 22 minutes to see the eclipse. Those in easternmost Africa, the Middle East, most of Asia, and western Australia will be able to witness the entire event from start to finish, while UK observers will catch the latter stages. What causes the red colour? When the moon is in the Earth's umbra, it does not get any direct sunlight, meaning only light that is refracted through Earth's atmosphere manages to reach the moon. Shorter blue wavelengths of light are typically scattered by the Earth's atmosphere, leaving longer red wavelengths to pass through - hence the red tones of the moon. The more dust or clouds in Earth's atmosphere during the eclipse, the redder the moon appears, according to NASA. This same atmospheric refraction effect is what causes sunsets and sunrises to look red. How best to see it? Unlike some celestial events, a blood moon can be seen with the naked eye, but astronomer Tom Kerss told the Royal Observatory some of his tips for how to improve your viewing experience:  Know your horizon - the blood moon will be best for UK observers when the moon starts to rise in the west and southwest; Use a telescope to see details of the lunar surface; Tripods and or remote shutter lenses could help improve the quality of photographs. In urban areas, people are encouraged to head to a hill or a high viewpoint to get the best view of the moon, which will appear low on the horizon line. What is the weather going to be like? The UK's Met Office says Sunday evening is expected to be fairly cloudy in many areas of the country. But all is not lost. The forecaster adds for those in the east and northeast, cloud may be thin enough to allow some sunshine through earlier in the day and clearer skies by evening, increasing the chances of a clear view of the total lunar eclipse. Read more from Sky News:Huge shortfall in NHS funding for weight-loss jabOne of the world's biggest icebergs is breaking up The clearest skies for viewing the blood moon will most likely be across the southwest and parts of eastern England. \"As with all weather forecasts, especially several days in advance, this is subject to change. It's advisable to check the latest forecast closer to the weekend for the most up-to-date information,\" the Met Office says."
    },
    {
        "title": "Former London's Burning actor John Alford guilty of sexually assaulting girls aged 14 and 15",
        "description": "Former London's Burning actor John Alford has been found guilty of sexually assaulting teenage girls aged 14 and 15 at a friend's home.",
        "url": "https://news.sky.com/story/former-londons-burning-actor-john-alford-guilty-of-sexually-assaulting-girls-aged-14-and-15-13425585",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-john-alford-londons_7012024.jpg?20250905151851",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-05 14:04:00",
        "Headline": "Alford told the court the allegations were 'a set-up' and shouted protests of innocence after he was found guilty.",
        "Content": "Former London's Burning actor John Alford has been found guilty of sexually assaulting teenage girls aged 14 and 15 at a friend's home. Jurors heard the 53-year-old, who rose to fame in BBC show Grange Hill, sexually assaulted the girls while they were drunk following a night out at the pub. St Albans Crown Court was told he bought 250 worth of food, alcohol and cigarettes from a nearby petrol station in the early hours of the morning, including a bottle of vodka which the victims subsequently drank. Alford then had sexual intercourse with the 14-year-old in the garden of the home and later in a downstairs toilet, and inappropriately touched the 15-year-old as she lay half asleep on the living room sofa. He denied four counts of sexual activity with the younger girl and charges of sexual assault and assault by penetration relating to the second teenager at a property in Hertfordshire on April 9 2022. But, after 13 hours of deliberations, he was found guilty. Alford, of Holloway, north London, who was charged under his real name John Shannon, had previously told the court the allegations were a \"set-up\". He put his head in his hand and shouted \"Wrong, I didn't do this\" from the dock as the verdicts were read out in court. 'I didn't want sex with an old man' During the week-long trial, Alford, who cried while giving evidence, told jurors \"I never touched either of them girls\", adding there was \"no DNA\" evidence and that he would stand by his denial \"until the day I die\". However, the 15-year-old girl said: \"We were all just like dozing off. That was when John started to touch me.\" Asked how she felt after the assault, the girl said: \"Sick. I felt absolutely sick. I wasn't going to tell anyone.\" In a video of her police interview played to the court, the 14-year-old girl said she had never had sex before the night of the alleged incidents. \"I told him to stop because I didn't want to have sex with an old man,\" she said."
    },
    {
        "title": "Death cap mushroom trial: How murder plot unfolded - and how killer tried to cover her tracks",
        "description": "An Australian woman convicted of murdering her parents-in-law and an aunt after serving them poisonous mushrooms for lunch is due to find out how long she will spend in prison.",
        "url": "https://news.sky.com/story/death-cap-mushroom-trial-how-murder-plot-unfolded-and-how-killer-tried-to-cover-her-tracks-13363700",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-erin-patterson-australia_6346181.jpg?20231103075841",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-09-05 13:39:00",
        "Headline": "Erin Patterson was found guilty of the murder of her parents-in-law and an aunt, who died days after she served them a beef wellington for lunch.",
        "Content": " An Australian woman convicted of murdering her parents-in-law and an aunt after serving them poisonous mushrooms for lunch is due to find out how long she will spend in prison. Mother-of-two Erin Patterson, 50, was convicted of the 2023 murders of her parents-in-law, Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, along with the attempted murder of Reverend Ian Wilkinson, Heather's husband. She served guests beef wellington knowing it contained deadly death cap mushrooms, also known as Amanita phalloides. After a nine-week trial in Morwell, Victoria, the jury concluded unanimously that she poisoned the guests on purpose and rejected her defence that the deaths were a \"terrible accident\". Patterson faces a potential life sentence for each of the murders and 25 years for attempted murder. The sentencing is due to take place from 9.30am in Victoria, which is just after midnight in the UK. Once a sentence has been passed, Patterson will have 28 days to lodge an appeal against the sentence, the convictions, or both. Here's everything you need to know about the case that has gripped Australia. Patterson's husband rejected the invite 'out of fear' Patterson invited the four victims for lunch at her home in Leongatha, a small town in Melbourne, on 29 July 2023. Her estranged husband, Simon Patterson, with whom she shares two children, was also invited but didn't attend. In court, the jury was not told why Mr Patterson rejected the invite, but it has now been revealed that he told a pre-trial hearing that he did so \"out of fear\". \"I thought there'd be a risk that she'd poison me if I attended,\" he told the court months before the trial. He said he believed Patterson, from whom he had been estranged since 2015, had tried to poison him with her cooking three times in the past, and had therefore stopped eating food she prepared. He said the previous alleged poisonings had occurred on family camping trips after he had eaten dishes including penne bolognese pasta, chicken korma curry and a vegetable curry wrap. Mr Patterson claimed he became seriously ill after the meals, but no poisonings were ever found. He said he didn't believe anyone else would be at risk from her cooking. On Friday the court ruled in favour of lawyers representing media who sought to overturn the gag order on this information, meaning it could be shared for the first time. Patterson told guests she was prepping 'special meal' During the trial, text messages read out revealed Patterson found her husband's decision not to come \"really disappointing\" as she had spent time and money preparing the \"special meal\". Mr Patterson told the court he had listed them as financially separated on a tax return, which triggered a series of child support payments that meant he would no longer pay their two children's private school fees directly. Speaking through tears, Mr Patterson said: \"I was sure she was very upset about that.\" Reverend Wilkinson said he and his wife were surprised by the invitation, telling the Australian Broadcasting Corporation (ABC): \"There was no reason given for the lunch, and I remember talking to Heather wondering why the sudden invitation.\" But he said the pair were \"very happy to be invited\". Patterson's daughter, according to ABC, told the court that her mother organised a trip to the cinema for her and her brother in advance of the lunch. Sole survivor gives details about the lunch Reverend Wilkinson told the court that Heather and Gail offered to help plate up the food, but Patterson rejected the offer. Each plate had a serving of mashed potatoes, green beans and an individual beef wellington. Patterson said the mushrooms were a mixture of button mushrooms from a supermarket and dried mushrooms bought at an Asian grocery store several months before, which were in a hand-labelled packet. Reverend Wilkinson said the four guests were given large grey dinner plates, while Patterson ate from a smaller, tan-coloured plate. He said he remembered his wife pointing this out after they became ill. The reverend said he and his wife ate their full servings, while Don ate his own and half of his wife's. Reverend Wilkinson said that after the meal, Patterson told them she had been diagnosed with cancer, suggesting the lunch was put together so that she could ask them the best way to tell her children about the illness. The prosecution said she did this to justify the children's absence. The defence does not dispute that Patterson lied about having cancer. When asked why she lied about her health, Patterson told the court it was partly to elicit sympathy from her husband's relatives, as she felt they were growing apart. \"I didn't want their care of me to stop, so I kept it going. I shouldn't have done it,\" she said, adding: \"I did lie to them.\" Defendant wanted to serve 'something special' While on the stand at the beginning of June, Patterson said she might have accidentally included foraged mushrooms in the fatal lunch. She said she brought expensive ingredients and researched ideas to find \"something special\" to serve. She said she deviated from her chosen recipe to improve the \"bland\" flavour. However, she denied that a series of photos showing mushrooms placed on weighing scales in her kitchen was evidence she had been measuring a \"fatal dose\" to serve to her lunch guests. Prosecutor Nanette Rogers asked: \"I suggest that you were weighing these death cap mushrooms so that you could calculate the weight required for the administration of a fatal dose for one person. Agree or disagree?\" \"Disagree,\" Patterson replied. The mother of two said she began foraging for mushrooms around the towns of Korumburra and Leongatha during the COVID lockdowns in 2020 and would use a food dehydrator to dry and preserve them. Prosecutors earlier claimed the defendant denied ever owning a food dehydrator, but police traced one owned by her to a nearby dump. It was later found to contain death cap mushrooms. The death cap is one of the most toxic mushrooms on the planet and is involved in the majority of fatal mushroom poisonings worldwide.  The species contains three main groups of toxins: amatoxins, phallotoxins, and virotoxins.  From these, amatoxins are primarily responsible for the toxic effects in humans.  The alpha-amanitin amatoxin has been found to cause protein deficit and ultimately cell death, although other mechanisms are thought to be involved.  The liver is the main organ that fails due to the poison, but other organs are also affected, most notably the kidneys.  The effects usually begin after a short latent period and include gastrointestinal disorders followed by jaundice, seizures, coma, and, eventually, death.  Two mobile phones she owned were also reset to factory status three times. Patterson told the court she disposed of the dehydrator before a visit from child protection, who were investigating her living arrangements. She said the phones were wiped because she panicked during the police investigation. \"I was scared of the conversation that might flow about the meal and the dehydrator,\" she said. \"I was scared they would blame me for it, for making everyone sick. I was scared that they would remove the children.\" Patterson talks through tears Lawyer Mr Mandy also questioned Patterson about a series of expletive-laden messages she sent to friends about the Patterson family. \"I wish I'd never said it. I feel ashamed for saying it and I wish that the family didn't have to hear that I said that,\" Patterson told the court about the messages. Talking through tears, she added: \"I was really frustrated with Simon, but it wasn't Don and Gail's fault.\" The court previously heard that the relationship between Patterson and her estranged husband deteriorated shortly before the murders due to a disagreement over child support. Patterson's children 'ate leftovers after guests went to hospital' All four victims fell ill and were experiencing severe vomiting and diarrhoea by midnight on the day of the lunch. Police previously said the symptoms of all four of those who became ill were consistent with poisoning from death cap mushrooms, which are responsible for 90% of all toxic mushroom-related fatalities. Patterson said she also became unwell hours after eating the meal, but claimed she wasn't as ill as her guests because she had vomited due to an eating disorder. Her daughter, according to the ABC, told the court she remembers Patterson telling her she had diarrhoea that night. Patterson claimed she and her children ate leftovers from the beef wellington on the same day. Her daughter told the court she remembered this, and that her mum didn't eat much because she was still feeling unwell. The mum said she scraped the mushrooms off the plates in advance because she knew her children didn't like them. Patterson went to hospital two days after the lunch, where she initially discharged herself against medical advice, the court was told. A nurse at the hospital where she was treated told the court she \"didn't look unwell like Ian and Heather\", who were at the same hospital. Read more:Murder of woman exposes date-to-rob crime syndicateInside the recovered sunken Bayesian superyacht Gail and Heather died on Friday 4 August 2023, while Don died a day later. Reverend Wilkinson spent seven weeks in hospital but survived. Days after the deaths, police opened a homicide investigation and confirmed Patterson was a suspect. She was charged on 2 November 2023 and convicted in July 2025."
    }
]