[
    {
        "title": "Trump says Ukraine will have to accept peace plan - but critics warn it has 'real problems'",
        "description": "Donald Trump has said Volodymyr Zelenskyy will have to approve a proposed peace plan to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-ukraine-will-have-to-accept-peace-plan-but-critics-warn-it-has-real-problems-13473794",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-zelenskyy-putin_7052858.jpg?20251017012300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-21 22:28:00",
        "Headline": "A prominent member of Donald Trump's own party says: \"I am highly sceptical it will achieve peace... Ukraine should not be forced to give up its lands to one of the world's most flagrant war criminals in Vladimir Putin.\"",
        "Content": " Donald Trump has said Volodymyr Zelenskyy will have to approve a proposed peace plan to end the war in Ukraine. The controversial 28-point proposal - which would hand swathes of land to Russia and limit the size of Kyiv's military - closely resembles the Kremlin's demands. Mr Zelenskyy has warned he has reservations about the plan, telling Ukrainians in a solemn speech: \"Now is one of the most difficult days in our history.\"  But Russian President Vladimir Putin has cautiously welcomed the US proposals - and said they \"could form the basis for a final peace settlement\". Speaking to reporters at the White House, Mr Trump appeared to dismiss Mr Zelenskyy's concerns: \"He'll have to like it... at some point, he's going to have to accept something.\" The US president went on to reference their now-infamous Oval Office meeting back in February, where he told Ukraine's leader \"you don't have the cards\". Kyiv has been given until Thursday to accept the peace plan - but this deadline could be extended to finalise the terms. Ukraine war - latest updates  'I am highly sceptical it will achieve peace' Mr Trump has received pushback from members of his own party, with a prominent Republican warning the plan \"has real problems\". Senator Roger Wicker, who chairs the Senate Committee on Armed Services, expressed doubt that the White House proposals would achieve peace. \"Ukraine should not be forced to give up its lands to one of the world's most flagrant war criminals in Vladimir Putin,\" he warned. Tim Ash from the Chatham House think tank added: \"Russia gets everything it wants and Ukraine gets not very much. \"If Zelenskyy accepts this, I anticipate huge political, social and economic instability in Ukraine.\" International affairs editor The Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively a surrender ultimatum for Ukraine. If accepted, it would reward armed aggression. The principle that even de facto borders cannot be changed by force - sacrosanct since World War Two for very good reasons - will have been trampled on at the behest of the leader of the free world. Read Dominic's full analysis here. According to Reuters, European nations including the UK, France and Germany are now working on a counterproposal with Kyiv. EU leaders, who were not consulted about the plan, will hold a meeting on the sidelines of the G20 summit in South Africa on Saturday. Sir Keir Starmer, who spoke to Mr Zelenskyy by phone on Friday, has warned \"Russia pretends to be serious about peace, but their actions never live up to their words\". Ahead of the talks, the prime minister said: \"Ukraine has been ready to negotiate for months, while Russia has stalled and continued its murderous rampage. That is why we must all work together, with both the US and Ukraine, to secure a just and lasting peace once and for all. We will continue to coordinate closely with Washington and Kyiv to achieve that. \"However, we cannot simply wait for peace, we must strain every sinew to secure it. We must cut off Putin's finance flows by ending our reliance on Russian gas. It won't be easy, but it's the right thing to do.\"  The EU's foreign policy chief, Kaja Kallas, said: \"We all want this war to end, but how it ends matters. Russia has no legal right whatsoever to any concessions from the country it invaded. This is a very dangerous moment for us all.\" Read more from Sky News:Starmer refuses to rule out manifesto-breaking tax risesBBC board member resigns - and criticises 'governance issues' 'Ukraine may be facing an extremely difficult decision' During his address, Mr Zelenskyy said he would not betray Ukraine's national interest - but warned dilemmas lie ahead. He added: \"Either a loss of dignity or the risk of losing a key partner. Either accepting a complicated list of 28 demands or enduring an extremely harsh winter, the harshest yet, with all the risks that follow. \"A life without freedom, without dignity, without justice. And all while being asked to trust someone who has already attacked us twice.\" Washington has reportedly threatened to cut off intelligence sharing and weapons supplies if Kyiv refuses to accept the deal. The US-backed proposal would require Ukraine to withdraw from territory it still controls in eastern provinces that Russia claims to have annexed - with Russia giving up smaller amounts of land it holds in other regions. Ukraine would also be permanently barred from joining NATO, and its armed forces would be capped at 600,000 troops. Sanctions against Russia would also be gradually lifted, with Moscow invited back into the G8 and frozen assets pooled into an investment fund."
    },
    {
        "title": "Trump peace plan: We could all pay if Europe doesn't step up and guarantee Ukraine's security",
        "description": "The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum.",
        "url": "https://news.sky.com/story/trump-peace-plan-we-could-all-pay-if-europe-doesnt-step-up-and-guarantee-ukraines-security-13473738",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7087749.jpg?20251121161948",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-21 22:45:00",
        "Headline": "World leaders praising Trump for his Gaza ceasefire plan only encouraged him to believe he can solve the world's most complex conflicts with minimal effort.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression. The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world. The Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped. It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO. The question now is: are Europe's leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure. The plan proposes the following: • Land seized by Vladimir Putin's unwarranted and unprovoked invasion would be ceded by Kyiv. • Territory his forces have fought but failed to take with colossal loss of life will be thrown into the bargain for good measure. • Ukraine will be barred from NATO, from having long-range weapons, from hosting foreign troops, from allowing foreign diplomatic planes to land, and its military neutered, reduced in size by more than half. And most worryingly for Western leaders, the plan proposes NATO and Russia negotiate with America acting as mediator. Lest we forget, America is meant to be the strongest partner in NATO, not an outside arbitrator. In one clause, Mr Trump's lack of commitment to the Western alliance is laid bare in chilling clarity. And even for all that, the plan will not bring peace. Mr Putin has made it abundantly clear he wants all of Ukraine. He has a proven track record of retiring, rallying his forces, then returning for more. Reward a bully as they say, and he will only come back for more. Why wouldn't he, if he is handed the fortress cities of Donetsk and a clear run over open tank country to Kyiv in a few years?  Since the beginning of Trump's presidency, Europe has tried to keep the maverick president onside when his true sympathies have repeatedly reverted to Moscow. It has been a demeaning and sycophantic spectacle, NATO's secretary general stooping even to calling the US president 'Daddy'. And it hasn't worked. It may have made matters worse. The parade of world leaders trooping through Sharm el-Sheikh, Egypt, lavishing praise on his Gaza ceasefire plan, only encouraged him to believe he is capable of solving the world's most complex conflicts with the minimum of effort. The Gaza plan is mired in deepening difficulty, and it never came near addressing the underlying causes of the war. Read more:Ukraine war latest: Putin welcomes peace planTrump's 28-point Ukraine peace plan in full Most importantly, principles the West has held inviolable for eight decades cannot be torn up for the sake of a quick and uncertain peace. With a partner as unreliable, the challenge to Europe cannot be clearer. In the words of one former Baltic foreign minister: \"There is a glaringly obvious message for Europe in the 28-point plan: This is the end of the end. \"We have been told repeatedly and unambiguously that Ukraine's security, and therefore Europe's security, will be Europe's responsibility. And now it is. Entirely.\" If Europe does not step up to the plate and guarantee Ukraine's security in the face of this American betrayal, we could all pay the consequences."
    },
    {
        "title": "Starmer refuses to rule out manifesto-breaking tax rises in budget",
        "description": "The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-manifesto-breaking-tax-rises-in-budget-13473641",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-interview_7087664.jpg?20251121143043",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:58:00",
        "Headline": "The prime minister would not be drawn on the contents of his government's second budget while speaking to Beth Rigby. Follow live coverage of the budget from 12.30pm on Wednesday with Sky News.",
        "Content": " The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby. Sir Keir Starmer was interviewed by Rigby while the pair were in South Africa for a meeting of the G20 group of nations. Despite the government last year indicating it was not going to raise more taxes, it appears that Wednesday's fiscal event will involve substantial increases in levies. The 2024 Labour manifesto said: \"We will ensure taxes on working people are kept as low as possible. \"Labour will not increase taxes on working people, which is why we will not increase national insurance, the basic, higher, or additional rates of income tax, or VAT.\" At the start of their interview, the prime minister was asked by Rigby if it was important for politicians to \"stick to their word\". Sir Keir said: \"Yes, it is important that politicians stick to their word. \n                  Government borrowing third-highest record in October as people not spending - official figures\n                 \n                  Budget 2025: Consumer confidence falls as speculation ramps up - but London mayor welcomes major rail investment\n                 \n                  Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds\n                 \"They have to make decisions against a political backdrop. And, we've also got big decisions to make in the budget that's coming in just a few days time.\" This caveat matches the expectations that a range of taxes are going to be increased so the government can keep its spending pledges and increase its fiscal headroom amid worsening economic headwinds. There was chaos last week after the reported increase in income tax that many had expected to be on the way was revealed to no longer be on the cards. Asked specifically on the manifesto commitment on tax, Sir Keir told Rigby that decisions will be made \"against a very difficult backdrop\". In total, the prime minister refused 12 times to rule out tax rises. Political editor No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. Read Beth Rigby's full analysis here He added it was \"important to take the right decisions for our country\". Rigby pointed out in the lead-up to the budget in 2024, the prime minister was more unequivocal, saying income tax, national insurance and VAT would not all go up. The prime minister declined to make the same promise, saying the decisions on tax will be announced on Wednesday.  Read more:Did Reeves pull off something extraordinary?Government borrowing higher than expectedWill energy bills be made cheaper? However, Sir Keir said the budget will be guided by \"principles\", including \"fairness\". The prime minister said the three areas he is \"bearing down on\" are the NHS, cutting national debt and dealing with the cost of living crisis. One tax rise that has not been ruled out is what is known as a \"stealth tax rise\" of freezing income tax thresholds. Rigby highlighted that in last year's budget, Rachel Reeves said freezing thresholds will \"hurt working people\" - and asked the prime minister if he agreed. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir said: \"We are going to set out our decisions. \"We will have absolutely in mind that the cost of living is the number one issue for people across the country.\" Pushed again, if working people will have their taxes increased, the prime minister instead mentioned he has people who are \"struggling with the cost of living\" in mind when making decisions."
    },
    {
        "title": "From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding",
        "description": "Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him.",
        "url": "https://news.sky.com/story/from-xmas-gifts-to-piles-of-cash-how-ex-reform-mep-was-caught-doing-russias-bidding-13473671",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nathan-gill-mep-russia_7087319.jpg?20251121215441",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-21 16:18:00",
        "Headline": "Police say Nathan Gill, ex-leader of Reform UK Wales, would receive statements from his handler and repeat them, sometimes word for word, in public.",
        "Content": " Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him. Gill, the former leader of Reform UK Wales and a one-time member of the European Parliament, who on Friday was jailed for 10-a-half-years, was stopped by police before boarding and had his phone seized in 2021. While they interrogated him, his home in Anglesey was raided, with detectives discovering more electronics and cash piles of €5,000 (£4,400) and $5,000 (£3,800) respectively. The evidence on Gill's phone would damn him – he was in contact with a pro-Russian politician in Ukraine, Oleg Voloshyn, and had agreed to boost pro-Russia viewpoints in exchange for money. Voloshyn would dictate the statement, and Gill would repeat it – in some cases, almost word for word – in the media or the European Parliament. In one instance, Gill appeared on the now-banned Ukrainian TV channel, 112 Ukraine, which was known for its pro-Russian stance. In the interview, he was critical of the Ukrainian decision to open criminal proceedings against Viktor Medvedchuk, the owner of the television channel and a personal friend of Vladimir Putin. Speaking to the outlet, he said he was \"very concerned\" about the investigation, and wondered whether it was meant to silence \"opposition politicians\". Prosecutors said messages on Gill's phone showed that this was at his paymaster's instruction, with Voloshyn offering a \"reward\" if he would say that it was unacceptable to persecute a person for their political convictions. Read more:Reform UK's former Wales leader jailedTrump's 28-point Ukraine peace plan in full Voloshyn also offered the MEP €2,000 (£1,750) if he would express concern that Mr Medvedchuk could no longer mediate with Russia on Ukraine's behalf, the court heard. He added that \"V\" – understood to be Mr Medvedchuk – did not believe Ukrainian President Volodymyr Zelenskyy had \"true intentions to pursue a peace agenda\", prosecutors said. Sure enough, Gill appeared on 112 Ukraine saying it was \"very sad\" that Mr Medvedchuk felt he no longer had Mr Zelensky's backing to act as a mediator with Russia, and suggested that using him \"would be a sensible thing to do\". The messages traded in innuendo, referring to the exchange of \"Xmas gifts\" or \"postcards\" instead of money. But as the pair grew more comfortable with each other, they bargained more explicitly, with the sum of \"£5k\" quoted for Gill's work. Dominic Murphy, head of Counter Terrorism Command at the Met Police, said Gill had also offered access to other MEPs. \"This is where we get into that slightly odd situation where it feels very much like a real effort to undermine democracy here,\" he said. \"This is Nathan Gill reaching out to individuals that he knows, who are Brits, who might be willing to be paid to go and make speeches.\" Commander Murphy declined to name names, but said there was an ongoing investigation and that other people had been spoken to. None of the pro-Brexit MEPs Gill allegedly approached have been interviewed under caution. Police confirmed there was no evidence to suggest Reform UK leader Nigel Farage was involved. Gill was stopped at Manchester Airport on 13 September 2021, under schedule 3 of the Counter Terrorism and Borders Security Act 2019. He offered police no explanation for his actions and answered no comment in a March 2022 police interview. But the 52-year-old is believed to have had financial problems. Mr Murphy added that while Gill appeared to have pro-Russian sympathies, he was primarily motivated by money. The ex-MEP has been jailed for 10-and-a-half years after pleading guilty to eight counts of bribery between December 2018 and July 2019. Following an investigation by counter-terrorism police, officers said they believe Gill likely took a minimum of £40,000 in cash and was offering to introduce other British MEPs so they could be bribed. Voloshyn was picked up by the authorities on a trip to the US in 2021, which enabled the FBI to discover his end of the conversation. He is now believed to be in Russia, but has been sanctioned by the UK government over allegations of trying to destabilise Ukraine. He remains wanted in both Britain and Ukraine. A Reform UK spokesman said: \"Mr Gill's actions were reprehensible, treasonous and unforgivable. \"We are glad that justice has been served and fully welcome the sentence Nathan Gill has received.\" Mr Farage, the Reform UK leader, said: \"An investigation into Russian and Chinese influence over British politics would be welcome.\" The MP for Clacton previously described his former colleague as a \"bad apple\" and said he was \"shocked\" after Gill pleaded guilty to eight counts of bribery. He said: \"Any political party can find in their midst all sorts of terrible people. \"You can never, ever guarantee 100% that everyone you meet in your life, you shake hands with in the pub, is a good person.\""
    },
    {
        "title": "Oxfordshire waste mountain by River Cherwell declared critical incident",
        "description": "A critical incident has been declared over a 40ft-high mountain of waste after it was branded \"utterly appalling\" by Prime Minister Sir Keir Starmer. ",
        "url": "https://news.sky.com/story/oxfordshire-waste-mountain-by-river-cherwell-declared-critical-incident-13473721",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-oxfordshire-dump-waste_7083441.jpg?20251116162336",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-21 19:56:00",
        "Headline": "Additional officers are being deployed to manage the site and hunt for those responsible in what's been called 'Operation Nation'.",
        "Content": " A critical incident has been declared over a 40ft-high mountain of waste after it was branded \"utterly appalling\" by Prime Minister Sir Keir Starmer.  The vast fly tip stretches for 150 metres in a field alongside the A34 in Kidlington, Oxfordshire, and it's feared that the nearby River Cherwell could be affected. Sky News drone footage captured the sheer scale of the rubbish pile, which is thought to weigh hundreds of tonnes and comprise multiple lorry loads of waste. The Environment Agency (EA) has declared a \"critical incident\" at the site, deploying additional officers to manage the area and progress its investigation. The probe, dubbed Operation Nation, is following \"several lines of inquiry\" in a bid to hunt down those responsible for the fly tipping. The agency will also erect additional barriers to reduce the risk of waste infecting the river if there is rainfall or flooding. A temporary boom – a floating barrier on the water meant to contain the debris – is already in place. It comes after Environment Secretary Emma Reynolds met with EA chief Philip Duffy to discuss the response to the site on Thursday. Mr Duffy said: \"The illegal tipping in Kidlington is totally abhorrent, and I share the local community's disgust at this case of environmental vandalism.  \"We’ve declared a critical incident, meaning the EA is laser focused on finding those responsible and ensuring they face the full force of the law.\" In her statement, the minister said: \"The appalling illegal waste dumped in Kidlington is disgraceful and I know how strongly local people feel about the site. \"I've instructed the EA to take decisive action to reduce the risk of environmental harm and I am pleased they are now installing additional barriers to prevent pollution of the Cherwell. \"I am being regularly updated on the ongoing investigation and I want to see justice served for this disgusting crime.\" The rubbish appears to comprise shredded domestic and commercial waste, like plastic and paper, which is non-hazardous, though it may also include items like batteries. At the site this week, Sky spotted an old DVD, tooth floss and AA batteries at the edge of the waste pile. The EA first visited the field at the beginning of July, after it was reported to them, and issued a cease-and-desist letter to stop further tipping. Read more:Analysis: How field became an illegal mountain of wasteMystery foam on river sparks investigation After more dumping was discovered, officers secured a court order to close down the site in October. Anna Burns, the EA's director for the Thames area, said the mountain of waste grew so fast that most of it was in place before her organisation was alerted. She said: \"Most of the tipping happened before we were aware of it. As soon as we were aware, we acted quickly and decisively.\""
    },
    {
        "title": "Starmer's political capital fading fast as he nears tax-raising budget",
        "description": "No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round.",
        "url": "https://news.sky.com/story/starmers-political-capital-fading-fast-as-he-nears-tax-raising-budget-13473684",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-budget-labour_7087778.jpg?20251121172846",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-21 17:25:00",
        "Headline": "The prime minister insists that this will be a budget where he will take the \"right decisions for the country\".",
        "Content": "\n          Political editor\n              @BethRigby\n  No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. As the prime minister set off on his 45th overseas trip since taking office in July 2024, he and his team were at pains to stress that diplomacy and business done at the G20 in South Africa was all about bringing jobs and investment back home. On the way over on the plane, Starmer talked about the 200,000 jobs created by G20 countries in the UK as a way of explaining why these trips do matter back home. \n                  How No 10 plunged itself into crisis ahead of a perilous budget\n                 \n                  Labour's dilemma: The two-child benefit cap\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 And, on landing, the government announced £400m of export investment into the UK on the back of this trip. To hammer home the point, we interviewed the prime minister - and this matters because those pictures will be beamed into living rooms across the UK - at a train depot in Johannesburg, to highlight that these trains were partly manufactured in Alstom's factory in Derby, East Midlands. The message here is that the prime minister is focused on trade and business for the UK. The inclement backdrop is a reminder of the difficult days he has ahead - because it looks like Labour is about to break manifesto commitments on taxes.  A year ago, just days before the October 2024 Budget, the prime minister told me in an interview that he would stick to manifesto commitments: \"We made an absolute commitment that their [working people] income tax wouldn't go up, their national insurance wouldn't go up, their VAT wouldn't go up. I said that in the campaign, we're going to keep to those promises.\" When I asked him to repeat that promise ahead of the 2025 Budget, he refused 12 times to recommit to those pledges, saying only he would set out measures \"in full in just a few days\". He said when he was making decisions for those \"people who are struggling with the cost of living, who can't necessarily make ends meet\". One option is likely to be that the government freezes income tax brackets for an extra two years, which would raise around £10bn by dragging those on lower tax bands into higher ones as their wages rise with inflation. This measure would go against the pledge not to raise taxes on working people. Read more:Starmer refuses to rule out manifesto-breaking tax rises in budgetGovernment borrowing higher than expectedWill energy bills be made cheaper? Last year, Chancellor Rachel Reeves made a point of saying in her budget that she was not going to extend the threshold freeze (first introduced by the Conservatives because it would \"hurt working people\". These were her exact words to parliament in her budget speech last year: \"Having considered the issue closely, I have come to the conclusion that extending the threshold freeze would hurt working people. \"It would take more money out of their payslips. I am keeping every single promise on tax that I made in our manifesto. I say to working people, I will not increase your national insurance, I will not increase your VAT, I will not increase your income tax.\" So you can see why this budget is going to be so difficult.  The chancellor carried out the biggest tax-raising budget in a generation last year - £40bn of taxes raised - and is now coming back for more as the UK's productivity growth is downgraded by the fiscal watchdog, and the global headwinds worsen. She has to find around £7bn after U-turns on welfare cuts and the winter fuel allowance. From the botched welfare reforms, to the winter fuel allowance backlash and reversal before the summer break, to a tumultuous few weeks this autumn, Starmer's political capital is depleting fast as his MPs despair at his operation and his leadership. Since September, we have seen the resignation of Angela Rayner over her £40,000 underpayment of stamp duty, the sacking of Lord Mandelson over his friendship with convicted sex offender Jeffrey Epstein, Andy Burnham's leadership saga, the face-off between Number 10 and the health secretary and the pitch-rolling of now ditched income tax rises. Read more:Starmer calls for investigation into Reform-Russia linksEx-leader of Reform UK in Wales jailed for accepting Russian bribes This is not the calm and steady leadership that Starmer promised - and his poll ratings reflect public disappointment in his government. There is now an open discussion about whether he should lead the party into the next general election, and he is being asked this in interviews. He told me that he will continue, he will fight the next election and that \"he'll be judged at the next election on whether we have been able to make people feel better off\".  When I asked him about the chaos of his Number 10, he told me about rolling out free childcare and extending breakfast clubs and freezing prescription charges. He said: \"Given half the change, I want to explain the change we're bringing about, because some of this is really important change we are bringing for the country.\" I can sense his frustration, and he was clearly angry about the briefings about his future and criticisms of Wes Streeting as a potential challenger. \"Every minute that we're not talking about the cost of living is a wasted minute,\" he tells me in response to my litany of difficulties and self-forced errors that have bedevilled his government. But it is true, as he himself acknowledged at the G7 in Canada, that it is Starmer's job to tell the Labour story better and manage his team. He is clear in our interview that he wants to press on and change the country, and it was he who won the mandate from the British public to do that. The prime minister insists this will be a budget where he will take the \"right decisions for the country\" with NHS improvement and driving down the cost of living, now his guiding principles. He says he is optimistic about the future of the country. But the public, and his party, have lost all enthusiasm for his premiership, and next week's tax-raising budget can't be anything but loaded with risk."
    },
    {
        "title": "BBC board member resigns - and criticises 'governance issues' at top of corporation",
        "description": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation.",
        "url": "https://news.sky.com/story/bbc-board-member-resigns-and-criticises-governance-issues-at-top-of-corporation-13473632",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shumeet-banerji-bbc_7087804.jpg?20251121190059",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:50:00",
        "Headline": "Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement.",
        "Content": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation. Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement. It comes after the corporation's director-general Tim Davie and chief executive of BBC News Deborah Turness resigned earlier this month following a row over the editing of a Panorama documentary on Donald Trump. Mr Banerji cited \"governance issues\" at the top of the BBC as the reason for his resignation, saying in a letter he was \"not consulted\" about the events leading up to the resignations of Mr Davie and Ms Turness, BBC News reports. \"Mr Banerji's term on the board as a non-executive director was due to end at the end of December and we thank him for his service,\" a BBC spokesperson said. \"The search for a replacement is already well under way and we will update further in due course.\"  Mr Banerji was appointed to the BBC board as one of the non-executive directors in January 2022, with his term running until 31 December. \n                  Strictly Come Dancing star arrested on suspicion of rape\n                 \n                  BBC Children in Need chief Terrence Duddy resigns after seriously injuring cyclist in crash\n                 \n                  BBC 'determined to fight' any Trump legal action, chairman tells staff\n                 As part of his role, he was responsible for upholding and protecting the independence of the BBC by acting in the public interest, ensuring the board's decision-making was in the public interest, and exercising independent judgement, according to a profile on the corporation's website. Arts and entertainment correspondent They say timing is everything - and Shumeet Banerji's resignation could not have come at a more delicate moment for the BBC. Few outside media and governance circles would have known his name before he handed in his notice, yet his departure lands a significant blow at an especially awkward time.  On Monday, BBC chair Samir Shah and board member Sir Robbie Gibb are due to give evidence to the Culture, Media and Sport Committee. Instead of helping to steady the ship, Banerji's exit exposes the depth of the divisions they will now be expected to defend. The BBC's official line stresses that Banerji was already scheduled to step down in December, but his decision to leave earlier tells its own story. If, as reported, 'governance issues' contributed to his decision, then Samir Shah has reason to be concerned as it would seem it's not only critics from outside the organisation who are questioning his ability to lead. Mr Banerji founded advisory and investment firm Condorcet, which focuses on early and development stage technology companies. In 2012, he stepped down as chief executive of consulting firm Booz And Company. Mr Banerji is currently serving on the board of directors of several companies, including Hewlett-Packard Company.  Mr Banerji's resignation follows several tumultuous weeks at the corporation. Last week, the BBC issued an apology to Mr Trump for the edit of his speech on 6 January 2021, which had given the \"mistaken impression that President Trump had made a direct call for violent action\". Despite the apology, Mr Trump said he would sue the corporation for between $1bn and $5bn. Read more:BBC 'determined to fight' any Trump legal actionWhy Trump might struggle to win BBC lawsuit Several BBC board members will attend a hearing by the Culture, Media and Sport Committee on 24 November. The evidence session will focus on the BBC's editorial guidelines and standards committee and how it ensures the corporation's output complies with its editorial guidelines, Culture Secretary Lisa Nandy said in the Commons last week."
    },
    {
        "title": "'COP is a nightmare but best process we've got', says Ed Miliband as climate talks run into overtime",
        "description": "The UN climate talks are a \"nightmare\" but the \"best process we've got\", the UK energy secretary Ed Miliband told Sky News as the COP30 summit ran into overtime, with a showdown on fossil fuels looming.",
        "url": "https://news.sky.com/story/cop-is-a-nightmare-but-best-process-weve-got-says-ed-miliband-as-climate-talks-run-into-overtime-13473736",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-miliband-belem-brazil_7087990.jpg?20251121213234",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-21 22:09:00",
        "Headline": "Countries gathered in northern Brazil are still locked in a stand-off over a deal to wean the world off fossil fuels, the main cause of the climate crisis.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The UN climate talks are a \"nightmare\" but the \"best process we've got\", the UK energy secretary Ed Miliband told Sky News as the COP30 summit ran into overtime, with a showdown on fossil fuels looming. Countries gathered in northern Brazil are still locked in a stand-off over a deal to wean the world off fossil fuels, the main cause of the climate crisis. Other key sticking points are cash for developing countries to adapt to more extreme weather, like drought in Afghanistan, which they have generally done little to cause. But despite the divisions, UK energy secretary Ed Miliband told Sky News in Belem: \"The process is a nightmare, but it's the best process we've got.\" The annual COP talks are \"so hard\" because they see more than 190 countries negotiating over the future of their economies, oceans and forests, he said. But he pointed to achievements from the three decades of talks, including lowering expected global warming by a substantial margin, and the fact that around 80% of global GBP is now covered by a net-zero climate target. Mr Miliband said: \"So it's painful, it's painstaking, it makes you tear your hair out, but it does represent progress. \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                 \n                  COP30: Climate protest in Brazil's city of Belem aims to hold governments' feet to the fire\n                 \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \"This is a global problem; we've got to have global cooperation to tackle it.\" The two-week conference in the Amazon city of Belem was due to end at 6pm local time (9pm UK time) on Friday, but, like previous COP summits, looked set to run well into the weekend. Brazil's President Luiz Inacio Lula da Silva and about 80 countries, including the UK and coal-rich Colombia, are pushing for a plan on how to \"transition away from fossil fuels\".  This is a pledge all countries agreed to two years ago at COP28 - then did very little about since. But scores of countries - including major oil and gas producers like Saudi Arabia and Russia - see this push as too prescriptive or a threat to their economies. Read more:Cop out: Is net zero dead?Fire disrupts efforts to strike dealRecord for wind-powered energy in UK Mr Miliband said the UK was \"determined\" that COP30 produced a commitment to a so-called \"roadmap\" to phase out fossil fuels. He said: \"There are different ways of [weaning off fossil fuels], but it's got to happen, in our view.\" A draft version of the deal, which host country Brazil released on Friday morning after talks had been delayed by a fire, had dropped any of the options previously mentioned to tackle oil and gas."
    },
    {
        "title": "From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding",
        "description": "Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him.",
        "url": "https://news.sky.com/story/from-xmas-gifts-to-piles-of-cash-how-ex-reform-mep-was-caught-doing-russias-bidding-13473671",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nathan-gill-mep-russia_7087319.jpg?20251121215441",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 16:18:00",
        "Headline": "Police say Nathan Gill, ex-leader of Reform UK Wales, would receive statements from his handler and repeat them, sometimes word for word, in public.",
        "Content": " Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him. Gill, the former leader of Reform UK Wales and a one-time member of the European Parliament, who on Friday was jailed for 10-a-half-years, was stopped by police before boarding and had his phone seized in 2021. While they interrogated him, his home in Anglesey was raided, with detectives discovering more electronics and cash piles of €5,000 (£4,400) and $5,000 (£3,800) respectively. The evidence on Gill's phone would damn him – he was in contact with a pro-Russian politician in Ukraine, Oleg Voloshyn, and had agreed to boost pro-Russia viewpoints in exchange for money. Voloshyn would dictate the statement, and Gill would repeat it – in some cases, almost word for word – in the media or the European Parliament. In one instance, Gill appeared on the now-banned Ukrainian TV channel, 112 Ukraine, which was known for its pro-Russian stance. In the interview, he was critical of the Ukrainian decision to open criminal proceedings against Viktor Medvedchuk, the owner of the television channel and a personal friend of Vladimir Putin. Speaking to the outlet, he said he was \"very concerned\" about the investigation, and wondered whether it was meant to silence \"opposition politicians\". Prosecutors said messages on Gill's phone showed that this was at his paymaster's instruction, with Voloshyn offering a \"reward\" if he would say that it was unacceptable to persecute a person for their political convictions. Read more:Reform UK's former Wales leader jailedTrump's 28-point Ukraine peace plan in full Voloshyn also offered the MEP €2,000 (£1,750) if he would express concern that Mr Medvedchuk could no longer mediate with Russia on Ukraine's behalf, the court heard. He added that \"V\" – understood to be Mr Medvedchuk – did not believe Ukrainian President Volodymyr Zelenskyy had \"true intentions to pursue a peace agenda\", prosecutors said. Sure enough, Gill appeared on 112 Ukraine saying it was \"very sad\" that Mr Medvedchuk felt he no longer had Mr Zelensky's backing to act as a mediator with Russia, and suggested that using him \"would be a sensible thing to do\". The messages traded in innuendo, referring to the exchange of \"Xmas gifts\" or \"postcards\" instead of money. But as the pair grew more comfortable with each other, they bargained more explicitly, with the sum of \"£5k\" quoted for Gill's work. Dominic Murphy, head of Counter Terrorism Command at the Met Police, said Gill had also offered access to other MEPs. \"This is where we get into that slightly odd situation where it feels very much like a real effort to undermine democracy here,\" he said. \"This is Nathan Gill reaching out to individuals that he knows, who are Brits, who might be willing to be paid to go and make speeches.\" Commander Murphy declined to name names, but said there was an ongoing investigation and that other people had been spoken to. None of the pro-Brexit MEPs Gill allegedly approached have been interviewed under caution. Police confirmed there was no evidence to suggest Reform UK leader Nigel Farage was involved. Gill was stopped at Manchester Airport on 13 September 2021, under schedule 3 of the Counter Terrorism and Borders Security Act 2019. He offered police no explanation for his actions and answered no comment in a March 2022 police interview. But the 52-year-old is believed to have had financial problems. Mr Murphy added that while Gill appeared to have pro-Russian sympathies, he was primarily motivated by money. The ex-MEP has been jailed for 10-and-a-half years after pleading guilty to eight counts of bribery between December 2018 and July 2019. Following an investigation by counter-terrorism police, officers said they believe Gill likely took a minimum of £40,000 in cash and was offering to introduce other British MEPs so they could be bribed. Voloshyn was picked up by the authorities on a trip to the US in 2021, which enabled the FBI to discover his end of the conversation. He is now believed to be in Russia, but has been sanctioned by the UK government over allegations of trying to destabilise Ukraine. He remains wanted in both Britain and Ukraine. A Reform UK spokesman said: \"Mr Gill's actions were reprehensible, treasonous and unforgivable. \"We are glad that justice has been served and fully welcome the sentence Nathan Gill has received.\" Mr Farage, the Reform UK leader, said: \"An investigation into Russian and Chinese influence over British politics would be welcome.\" The MP for Clacton previously described his former colleague as a \"bad apple\" and said he was \"shocked\" after Gill pleaded guilty to eight counts of bribery. He said: \"Any political party can find in their midst all sorts of terrible people. \"You can never, ever guarantee 100% that everyone you meet in your life, you shake hands with in the pub, is a good person.\""
    },
    {
        "title": "Starmer refuses to rule out manifesto-breaking tax rises in budget",
        "description": "The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-manifesto-breaking-tax-rises-in-budget-13473641",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-interview_7087664.jpg?20251121143043",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:58:00",
        "Headline": "The prime minister would not be drawn on the contents of his government's second budget while speaking to Beth Rigby. Follow live coverage of the budget from 12.30pm on Wednesday with Sky News.",
        "Content": " The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby. Sir Keir Starmer was interviewed by Rigby while the pair were in South Africa for a meeting of the G20 group of nations. Despite the government last year indicating it was not going to raise more taxes, it appears that Wednesday's fiscal event will involve substantial increases in levies. The 2024 Labour manifesto said: \"We will ensure taxes on working people are kept as low as possible. \"Labour will not increase taxes on working people, which is why we will not increase national insurance, the basic, higher, or additional rates of income tax, or VAT.\" At the start of their interview, the prime minister was asked by Rigby if it was important for politicians to \"stick to their word\". Sir Keir said: \"Yes, it is important that politicians stick to their word. \n                  Government borrowing third-highest record in October as people not spending - official figures\n                 \n                  Budget 2025: Consumer confidence falls as speculation ramps up - but London mayor welcomes major rail investment\n                 \n                  Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds\n                 \"They have to make decisions against a political backdrop. And, we've also got big decisions to make in the budget that's coming in just a few days time.\" This caveat matches the expectations that a range of taxes are going to be increased so the government can keep its spending pledges and increase its fiscal headroom amid worsening economic headwinds. There was chaos last week after the reported increase in income tax that many had expected to be on the way was revealed to no longer be on the cards. Asked specifically on the manifesto commitment on tax, Sir Keir told Rigby that decisions will be made \"against a very difficult backdrop\". In total, the prime minister refused 12 times to rule out tax rises. Political editor No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. Read Beth Rigby's full analysis here He added it was \"important to take the right decisions for our country\". Rigby pointed out in the lead-up to the budget in 2024, the prime minister was more unequivocal, saying income tax, national insurance and VAT would not all go up. The prime minister declined to make the same promise, saying the decisions on tax will be announced on Wednesday.  Read more:Did Reeves pull off something extraordinary?Government borrowing higher than expectedWill energy bills be made cheaper? However, Sir Keir said the budget will be guided by \"principles\", including \"fairness\". The prime minister said the three areas he is \"bearing down on\" are the NHS, cutting national debt and dealing with the cost of living crisis. One tax rise that has not been ruled out is what is known as a \"stealth tax rise\" of freezing income tax thresholds. Rigby highlighted that in last year's budget, Rachel Reeves said freezing thresholds will \"hurt working people\" - and asked the prime minister if he agreed. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir said: \"We are going to set out our decisions. \"We will have absolutely in mind that the cost of living is the number one issue for people across the country.\" Pushed again, if working people will have their taxes increased, the prime minister instead mentioned he has people who are \"struggling with the cost of living\" in mind when making decisions."
    },
    {
        "title": "Starmer's political capital fading fast as he nears tax-raising budget",
        "description": "No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round.",
        "url": "https://news.sky.com/story/starmers-political-capital-fading-fast-as-he-nears-tax-raising-budget-13473684",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-budget-labour_7087778.jpg?20251121172846",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-21 17:25:00",
        "Headline": "The prime minister insists that this will be a budget where he will take the \"right decisions for the country\".",
        "Content": "\n          Political editor\n              @BethRigby\n  No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. As the prime minister set off on his 45th overseas trip since taking office in July 2024, he and his team were at pains to stress that diplomacy and business done at the G20 in South Africa was all about bringing jobs and investment back home. On the way over on the plane, Starmer talked about the 200,000 jobs created by G20 countries in the UK as a way of explaining why these trips do matter back home. \n                  How No 10 plunged itself into crisis ahead of a perilous budget\n                 \n                  Labour's dilemma: The two-child benefit cap\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 And, on landing, the government announced £400m of export investment into the UK on the back of this trip. To hammer home the point, we interviewed the prime minister - and this matters because those pictures will be beamed into living rooms across the UK - at a train depot in Johannesburg, to highlight that these trains were partly manufactured in Alstom's factory in Derby, East Midlands. The message here is that the prime minister is focused on trade and business for the UK. The inclement backdrop is a reminder of the difficult days he has ahead - because it looks like Labour is about to break manifesto commitments on taxes.  A year ago, just days before the October 2024 Budget, the prime minister told me in an interview that he would stick to manifesto commitments: \"We made an absolute commitment that their [working people] income tax wouldn't go up, their national insurance wouldn't go up, their VAT wouldn't go up. I said that in the campaign, we're going to keep to those promises.\" When I asked him to repeat that promise ahead of the 2025 Budget, he refused 12 times to recommit to those pledges, saying only he would set out measures \"in full in just a few days\". He said when he was making decisions for those \"people who are struggling with the cost of living, who can't necessarily make ends meet\". One option is likely to be that the government freezes income tax brackets for an extra two years, which would raise around £10bn by dragging those on lower tax bands into higher ones as their wages rise with inflation. This measure would go against the pledge not to raise taxes on working people. Read more:Starmer refuses to rule out manifesto-breaking tax rises in budgetGovernment borrowing higher than expectedWill energy bills be made cheaper? Last year, Chancellor Rachel Reeves made a point of saying in her budget that she was not going to extend the threshold freeze (first introduced by the Conservatives because it would \"hurt working people\". These were her exact words to parliament in her budget speech last year: \"Having considered the issue closely, I have come to the conclusion that extending the threshold freeze would hurt working people. \"It would take more money out of their payslips. I am keeping every single promise on tax that I made in our manifesto. I say to working people, I will not increase your national insurance, I will not increase your VAT, I will not increase your income tax.\" So you can see why this budget is going to be so difficult.  The chancellor carried out the biggest tax-raising budget in a generation last year - £40bn of taxes raised - and is now coming back for more as the UK's productivity growth is downgraded by the fiscal watchdog, and the global headwinds worsen. She has to find around £7bn after U-turns on welfare cuts and the winter fuel allowance. From the botched welfare reforms, to the winter fuel allowance backlash and reversal before the summer break, to a tumultuous few weeks this autumn, Starmer's political capital is depleting fast as his MPs despair at his operation and his leadership. Since September, we have seen the resignation of Angela Rayner over her £40,000 underpayment of stamp duty, the sacking of Lord Mandelson over his friendship with convicted sex offender Jeffrey Epstein, Andy Burnham's leadership saga, the face-off between Number 10 and the health secretary and the pitch-rolling of now ditched income tax rises. Read more:Starmer calls for investigation into Reform-Russia linksEx-leader of Reform UK in Wales jailed for accepting Russian bribes This is not the calm and steady leadership that Starmer promised - and his poll ratings reflect public disappointment in his government. There is now an open discussion about whether he should lead the party into the next general election, and he is being asked this in interviews. He told me that he will continue, he will fight the next election and that \"he'll be judged at the next election on whether we have been able to make people feel better off\".  When I asked him about the chaos of his Number 10, he told me about rolling out free childcare and extending breakfast clubs and freezing prescription charges. He said: \"Given half the change, I want to explain the change we're bringing about, because some of this is really important change we are bringing for the country.\" I can sense his frustration, and he was clearly angry about the briefings about his future and criticisms of Wes Streeting as a potential challenger. \"Every minute that we're not talking about the cost of living is a wasted minute,\" he tells me in response to my litany of difficulties and self-forced errors that have bedevilled his government. But it is true, as he himself acknowledged at the G7 in Canada, that it is Starmer's job to tell the Labour story better and manage his team. He is clear in our interview that he wants to press on and change the country, and it was he who won the mandate from the British public to do that. The prime minister insists this will be a budget where he will take the \"right decisions for the country\" with NHS improvement and driving down the cost of living, now his guiding principles. He says he is optimistic about the future of the country. But the public, and his party, have lost all enthusiasm for his premiership, and next week's tax-raising budget can't be anything but loaded with risk."
    },
    {
        "title": "Oxfordshire waste mountain by River Cherwell declared critical incident",
        "description": "A critical incident has been declared over a 40ft-high mountain of waste after it was branded \"utterly appalling\" by Prime Minister Sir Keir Starmer. ",
        "url": "https://news.sky.com/story/oxfordshire-waste-mountain-by-river-cherwell-declared-critical-incident-13473721",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-oxfordshire-dump-waste_7083441.jpg?20251116162336",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 19:56:00",
        "Headline": "Additional officers are being deployed to manage the site and hunt for those responsible in what's been called 'Operation Nation'.",
        "Content": " A critical incident has been declared over a 40ft-high mountain of waste after it was branded \"utterly appalling\" by Prime Minister Sir Keir Starmer.  The vast fly tip stretches for 150 metres in a field alongside the A34 in Kidlington, Oxfordshire, and it's feared that the nearby River Cherwell could be affected. Sky News drone footage captured the sheer scale of the rubbish pile, which is thought to weigh hundreds of tonnes and comprise multiple lorry loads of waste. The Environment Agency (EA) has declared a \"critical incident\" at the site, deploying additional officers to manage the area and progress its investigation. The probe, dubbed Operation Nation, is following \"several lines of inquiry\" in a bid to hunt down those responsible for the fly tipping. The agency will also erect additional barriers to reduce the risk of waste infecting the river if there is rainfall or flooding. A temporary boom – a floating barrier on the water meant to contain the debris – is already in place. It comes after Environment Secretary Emma Reynolds met with EA chief Philip Duffy to discuss the response to the site on Thursday. Mr Duffy said: \"The illegal tipping in Kidlington is totally abhorrent, and I share the local community's disgust at this case of environmental vandalism.  \"We’ve declared a critical incident, meaning the EA is laser focused on finding those responsible and ensuring they face the full force of the law.\" In her statement, the minister said: \"The appalling illegal waste dumped in Kidlington is disgraceful and I know how strongly local people feel about the site. \"I've instructed the EA to take decisive action to reduce the risk of environmental harm and I am pleased they are now installing additional barriers to prevent pollution of the Cherwell. \"I am being regularly updated on the ongoing investigation and I want to see justice served for this disgusting crime.\" The rubbish appears to comprise shredded domestic and commercial waste, like plastic and paper, which is non-hazardous, though it may also include items like batteries. At the site this week, Sky spotted an old DVD, tooth floss and AA batteries at the edge of the waste pile. The EA first visited the field at the beginning of July, after it was reported to them, and issued a cease-and-desist letter to stop further tipping. Read more:Analysis: How field became an illegal mountain of wasteMystery foam on river sparks investigation After more dumping was discovered, officers secured a court order to close down the site in October. Anna Burns, the EA's director for the Thames area, said the mountain of waste grew so fast that most of it was in place before her organisation was alerted. She said: \"Most of the tipping happened before we were aware of it. As soon as we were aware, we acted quickly and decisively.\""
    },
    {
        "title": "BBC board member resigns - and criticises 'governance issues' at top of corporation",
        "description": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation.",
        "url": "https://news.sky.com/story/bbc-board-member-resigns-and-criticises-governance-issues-at-top-of-corporation-13473632",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shumeet-banerji-bbc_7087804.jpg?20251121190059",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:50:00",
        "Headline": "Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement.",
        "Content": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation. Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement. It comes after the corporation's director-general Tim Davie and chief executive of BBC News Deborah Turness resigned earlier this month following a row over the editing of a Panorama documentary on Donald Trump. Mr Banerji cited \"governance issues\" at the top of the BBC as the reason for his resignation, saying in a letter he was \"not consulted\" about the events leading up to the resignations of Mr Davie and Ms Turness, BBC News reports. \"Mr Banerji's term on the board as a non-executive director was due to end at the end of December and we thank him for his service,\" a BBC spokesperson said. \"The search for a replacement is already well under way and we will update further in due course.\"  Mr Banerji was appointed to the BBC board as one of the non-executive directors in January 2022, with his term running until 31 December. \n                  Strictly Come Dancing star arrested on suspicion of rape\n                 \n                  BBC Children in Need chief Terrence Duddy resigns after seriously injuring cyclist in crash\n                 \n                  BBC 'determined to fight' any Trump legal action, chairman tells staff\n                 As part of his role, he was responsible for upholding and protecting the independence of the BBC by acting in the public interest, ensuring the board's decision-making was in the public interest, and exercising independent judgement, according to a profile on the corporation's website. Arts and entertainment correspondent They say timing is everything - and Shumeet Banerji's resignation could not have come at a more delicate moment for the BBC. Few outside media and governance circles would have known his name before he handed in his notice, yet his departure lands a significant blow at an especially awkward time.  On Monday, BBC chair Samir Shah and board member Sir Robbie Gibb are due to give evidence to the Culture, Media and Sport Committee. Instead of helping to steady the ship, Banerji's exit exposes the depth of the divisions they will now be expected to defend. The BBC's official line stresses that Banerji was already scheduled to step down in December, but his decision to leave earlier tells its own story. If, as reported, 'governance issues' contributed to his decision, then Samir Shah has reason to be concerned as it would seem it's not only critics from outside the organisation who are questioning his ability to lead. Mr Banerji founded advisory and investment firm Condorcet, which focuses on early and development stage technology companies. In 2012, he stepped down as chief executive of consulting firm Booz And Company. Mr Banerji is currently serving on the board of directors of several companies, including Hewlett-Packard Company.  Mr Banerji's resignation follows several tumultuous weeks at the corporation. Last week, the BBC issued an apology to Mr Trump for the edit of his speech on 6 January 2021, which had given the \"mistaken impression that President Trump had made a direct call for violent action\". Despite the apology, Mr Trump said he would sue the corporation for between $1bn and $5bn. Read more:BBC 'determined to fight' any Trump legal actionWhy Trump might struggle to win BBC lawsuit Several BBC board members will attend a hearing by the Culture, Media and Sport Committee on 24 November. The evidence session will focus on the BBC's editorial guidelines and standards committee and how it ensures the corporation's output complies with its editorial guidelines, Culture Secretary Lisa Nandy said in the Commons last week."
    },
    {
        "title": "Man who struck and disfigured Aberdeen player with seat could face jail time",
        "description": "A man has been warned he may face jail time after he left an Aberdeen football player with a serious injury and permanent facial disfigurement by throwing a seat onto the pitch.",
        "url": "https://news.sky.com/story/man-who-struck-and-disfigured-aberdeen-player-with-seat-could-face-jail-time-13473669",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-aberdeen-football_7087756.jpg?20251121162846",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 16:13:00",
        "Headline": "The projectile struck footballer Jack MacKenzie in the face, leaving him with a \"deep 2in laceration\" to his left eyebrow and a \"5cm abrasion\".",
        "Content": "A man has been warned he may face jail time after he left an Aberdeen football player with a serious injury and permanent facial disfigurement by throwing a seat onto the pitch. David Gowans, 31, threw the projectile onto the pitch following a league match between Aberdeen and Dundee United at Tannadice on 17 May. It struck Aberdeen's Jack MacKenzie in the face, leaving him with a \"deep 2in laceration\" to his left eyebrow and a \"5cm abrasion\" below his left eye. The player had gone to the area of the pitch in front of the travelling Aberdeen FC fans to thank them for their support, following a 2-1 defeat. The court was shown CCTV footage of the incident, which showed MacKenzie lying on the pitch receiving medical attention. He was later taken off the pitch in a wheelchair. Gowans admitted culpable and reckless conduct last month. Prosecutor Lee Corr told Dundee Sheriff Court that on the day of the incident, Gowans sent text messages to Aberdeen FC supporters liaison officer Lynne Fiske, in which he admitted he had thrown the seat. In one message, which was shown to the court, the father-of-one said he \"wasn't aiming at anything or anyone\" and that the section of seat had just been \"there right next to me\". He described it as \"a disastrous mistake\". Ms Fiske advised him to turn himself into the police, but Gowans did not and was arrested and charged a couple of days later. He was also given a lifetime ban by Aberdeen FC. Sheriff Alastair Carmichael told Gowans on Friday: \"Your behaviour resulted in a severe injury and permanent disfigurement to one of the players. Read more from Sky News:Teenagers plead not guilty to London transport cyber attackStarmer preparing for China trip in new year \"When all of this is taken together, the custodial threshold has been passed.\" However, he said he would delay sentencing to allow background reports to be compiled. He later added that: \"These reports may well provide possible alternatives to a custodial sentence, but all options for sentencing will likely remain open.\" Gowans will be sentenced on 12 January next year."
    },
    {
        "title": "Man jailed for 27 years for murder of ex-wife at son's graveside",
        "description": "A man has been sentenced to life in prison with a minimum term of more than 27 years for the murder of his ex-wife.",
        "url": "https://news.sky.com/story/man-jailed-for-27-years-for160murder-of-ex-wife-at-sons-graveside-13473640",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ann-blackwood-cemetery-murder_7087688.jpg?20251121151524",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 15:11:00",
        "Headline": "Martin Suter, 68, was sentenced for fatally stabbing Ann Blackwood, 71, in a premeditated attack at their son's grave. ",
        "Content": "A man has been sentenced to life in prison with a minimum term of more than 27 years for the murder of his ex-wife. He lay in wait for her for five hours at a cemetery before attacking and fatally stabbing her with scissors at their son's graveside. Martin Suter, 68, of Lee-on-the-Solent, pleaded guilty to the murder of 71-year-old Ann Blackwood at Crofton Cemetery in Stubbington, Hampshire, on 24 July 2023. It would have been the 36th birthday of their son, Christopher. Suter, who wore a beige suit and striped tie at a hearing at Portsmouth Crown Court on Friday, was also sentenced for the indecent assault of a girl under 14 years old, which he had pleaded guilty to in May 2023. Sentencing Suter, Judge Michael Bowes KC said: \"No sentence I can pass can compensate Ann Blackwood's family and friends for their devastating loss.\" Addressing Suter, who showed no emotion, the judge said: \"Christopher's death was a tragic loss but cannot reduce in any way your culpability for the murder of his mother.\" \n                  Grooming gang victims being denied compensation because of criminal records\n                 \n                  From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding\n                 \n                  Starmer refuses to rule out manifesto-breaking tax rises in budget\n                 \"This is rightly characterised by her family and friends as an act of wickedness.\" Suter was sentenced to 27 years and 109 days for the murder charge, with a further 121 days added for the indecent assault conviction. Read more from Sky News:Plane crashes at Dubai air show, killing pilotTwo critically injured after bear attacks schoolchildren  In a victim impact statement read to the court, Ms Blackwood's brother, John Blackwood, said his sister was \"an affable, inoffensive person, easy-going, gregarious, with many friends\". \"Her shocking and brutal death has sorely impacted many people, her immediate family, and wider circle of friends.\" Robert O'Sullivan KC, prosecuting, said there was a \"significant degree of planning\" involved. \"The defendant armed himself with a large kitchen knife from his home address and took it with him to the cemetery that morning while he lay in wait to attack Ann Blackwood, rightly anticipating she would visit her son's grave that day.\" Suter attacked Ms Blackwood after she arrived by bicycle and approached the grave, Mr O'Sullivan said. The court heard that she was stabbed 19 times in the neck and shoulder with the scissors. Mr O'Sullivan said that at 3.39pm, Suter called 999 and told police: \"I have just murdered someone, I have just killed my ex-wife, I have just stabbed her to death.\" Suter had been diagnosed with autism and depression, Mr O'Sullivan said. \"It may be difficult for someone with the autism diagnosis to demonstrate, or for remorse to be assessed,\" said Jodie Mittell KC, defending."
    },
    {
        "title": "Police officer charged over death of woman in Christmas Eve crash",
        "description": "A Merseyside police officer has been charged over the death of a young woman he hit with his patrol car while responding to an emergency call on Christmas Eve three years ago.",
        "url": "https://news.sky.com/story/police-officer-charged-over-death-of-woman-in-christmas-eve-crash-13473615",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-liverpool-police_6005899.jpg?20251121151844",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 15:21:00",
        "Headline": "The officer was responding to an unrelated emergency call at the time of the collision with the 22 year-old woman.",
        "Content": "A Merseyside police officer has been charged over the death of a young woman he hit with his patrol car while responding to an emergency call on Christmas Eve three years ago. PC Scott Thompson, 32, will appear next week to face the charge of causing death by careless driving. Rachael Moore, 22, a carer, was struck by the police car on Sheil Road just after 8pm on 24 December 2022. The officer was responding to an unrelated emergency call at the time of the collision. Ms Moore, who was born in Derby and had been a university student in Liverpool, was walking home from her job as a carer when she was hit. She was pronounced dead at the scene. The charge comes after an investigation by the Independent Office for Police Conduct (IOPC). \n                  Axel Rudakubana: Southport killer asked crossbow sellers about age verification when he was 15, inquiry told\n                 \n                  Hillsborough Law: What is it, why was it delayed and what happens next?\n                 \n                  Paul Doyle: Man pleads not guilty after fans struck at Liverpool FC trophy parade\n                 That investigation followed a mandatory referral from Merseyside Police after the incident. In a statement, the IOPC said it had consulted with the Crown Prosecution Service throughout its investigation to consider any potential criminal offences. It added that this led to the authorisation of the charge against PC Thompson last month. He is due to appear at Manchester Magistrates' Court on Monday"
    },
    {
        "title": "Christmas travel chaos expected as CrossCountry rail workers announce strikes",
        "description": "Travellers are set to face disruption over Christmas as workers on rail operator CrossCountry have announced a series of strikes for December.",
        "url": "https://news.sky.com/story/christmas-travel-chaos-expected-as-crosscountry-rail-workers-announce-strikes-13473678",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-crosscountry-strikes_7087781.jpg?20251121173316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-21 16:47:00",
        "Headline": "The Rail, Maritime and Transport union (RMT) said its members working for CrossCountry will walk out over long-running pay and staffing disputes.",
        "Content": "Travellers are set to face disruption over Christmas as workers on rail operator CrossCountry have announced a series of strikes for December. The Rail, Maritime and Transport union (RMT) said its members working for CrossCountry will walk out on 6, 13, 20 and 27 December over long-running pay and staffing issues. RMT general secretary Eddie Dempsey said: \"CrossCountry has not dealt with the core issues in this dispute and has come back with a proposal that is worse than what was already on the table. \"Our members are still facing unresolved staffing shortages, unfair pay outcomes and broken commitments.\" This left RMT members \"with no choice but to take strike action\", Mr Dempsey said. \"The company must return with a serious offer that meets the commitments it has already made and treats our members with the fairness and respect they deserve,\" he added. The Birmingham-based rail operator offers connections to major British cities like Manchester, Leeds, Sheffield, Nottingham, Newcastle, Cardiff, and Edinburgh, so people set to travel via these routes around the festive period will likely see their journeys disrupted. \n                  Birmingham bin strikes to continue for months, union warns, as industrial dispute deepens\n                 \n                  Family of Katie Fox, who was fatally stabbed in neck in Birmingham, pay tribute to her\n                 \n                  Woman, 34, has died after being stabbed in the neck in Birmingham\n                 Read more from Sky News:Reform UK's former Wales leader jailedAfghan national admits rape of 12-year-old girl \"We are disappointed for our customers that the RMT has announced further industrial action,\" Shiona Rolfe, managing director at CrossCountry, said. \"We've worked hard to make a fair and reasonable offer that addresses the key points raised in this dispute, and we've made meaningful progress in negotiations. \"Our priority remains reaching an agreement that avoids disruption for passengers in the busy Christmas period, and we are ready to continue talks at any time.\""
    },
    {
        "title": "Trump says Ukraine will have to accept peace plan - but critics warn it has 'real problems'",
        "description": "Donald Trump has said Volodymyr Zelenskyy will have to approve a proposed peace plan to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-ukraine-will-have-to-accept-peace-plan-but-critics-warn-it-has-real-problems-13473794",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-zelenskyy-putin_7052858.jpg?20251017012300",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 22:28:00",
        "Headline": "A prominent member of Donald Trump's own party says: \"I am highly sceptical it will achieve peace... Ukraine should not be forced to give up its lands to one of the world's most flagrant war criminals in Vladimir Putin.\"",
        "Content": " Donald Trump has said Volodymyr Zelenskyy will have to approve a proposed peace plan to end the war in Ukraine. The controversial 28-point proposal - which would hand swathes of land to Russia and limit the size of Kyiv's military - closely resembles the Kremlin's demands. Mr Zelenskyy has warned he has reservations about the plan, telling Ukrainians in a solemn speech: \"Now is one of the most difficult days in our history.\"  But Russian President Vladimir Putin has cautiously welcomed the US proposals - and said they \"could form the basis for a final peace settlement\". Speaking to reporters at the White House, Mr Trump appeared to dismiss Mr Zelenskyy's concerns: \"He'll have to like it... at some point, he's going to have to accept something.\" The US president went on to reference their now-infamous Oval Office meeting back in February, where he told Ukraine's leader \"you don't have the cards\". Kyiv has been given until Thursday to accept the peace plan - but this deadline could be extended to finalise the terms. Ukraine war - latest updates  'I am highly sceptical it will achieve peace' Mr Trump has received pushback from members of his own party, with a prominent Republican warning the plan \"has real problems\". Senator Roger Wicker, who chairs the Senate Committee on Armed Services, expressed doubt that the White House proposals would achieve peace. \"Ukraine should not be forced to give up its lands to one of the world's most flagrant war criminals in Vladimir Putin,\" he warned. Tim Ash from the Chatham House think tank added: \"Russia gets everything it wants and Ukraine gets not very much. \"If Zelenskyy accepts this, I anticipate huge political, social and economic instability in Ukraine.\" International affairs editor The Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively a surrender ultimatum for Ukraine. If accepted, it would reward armed aggression. The principle that even de facto borders cannot be changed by force - sacrosanct since World War Two for very good reasons - will have been trampled on at the behest of the leader of the free world. Read Dominic's full analysis here. According to Reuters, European nations including the UK, France and Germany are now working on a counterproposal with Kyiv. EU leaders, who were not consulted about the plan, will hold a meeting on the sidelines of the G20 summit in South Africa on Saturday. Sir Keir Starmer, who spoke to Mr Zelenskyy by phone on Friday, has warned \"Russia pretends to be serious about peace, but their actions never live up to their words\". Ahead of the talks, the prime minister said: \"Ukraine has been ready to negotiate for months, while Russia has stalled and continued its murderous rampage. That is why we must all work together, with both the US and Ukraine, to secure a just and lasting peace once and for all. We will continue to coordinate closely with Washington and Kyiv to achieve that. \"However, we cannot simply wait for peace, we must strain every sinew to secure it. We must cut off Putin's finance flows by ending our reliance on Russian gas. It won't be easy, but it's the right thing to do.\"  The EU's foreign policy chief, Kaja Kallas, said: \"We all want this war to end, but how it ends matters. Russia has no legal right whatsoever to any concessions from the country it invaded. This is a very dangerous moment for us all.\" Read more from Sky News:Starmer refuses to rule out manifesto-breaking tax risesBBC board member resigns - and criticises 'governance issues' 'Ukraine may be facing an extremely difficult decision' During his address, Mr Zelenskyy said he would not betray Ukraine's national interest - but warned dilemmas lie ahead. He added: \"Either a loss of dignity or the risk of losing a key partner. Either accepting a complicated list of 28 demands or enduring an extremely harsh winter, the harshest yet, with all the risks that follow. \"A life without freedom, without dignity, without justice. And all while being asked to trust someone who has already attacked us twice.\" Washington has reportedly threatened to cut off intelligence sharing and weapons supplies if Kyiv refuses to accept the deal. The US-backed proposal would require Ukraine to withdraw from territory it still controls in eastern provinces that Russia claims to have annexed - with Russia giving up smaller amounts of land it holds in other regions. Ukraine would also be permanently barred from joining NATO, and its armed forces would be capped at 600,000 troops. Sanctions against Russia would also be gradually lifted, with Moscow invited back into the G8 and frozen assets pooled into an investment fund."
    },
    {
        "title": "Trump peace plan: We could all pay if Europe doesn't step up and guarantee Ukraine's security",
        "description": "The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum.",
        "url": "https://news.sky.com/story/trump-peace-plan-we-could-all-pay-if-europe-doesnt-step-up-and-guarantee-ukraines-security-13473738",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7087749.jpg?20251121161948",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-21 22:45:00",
        "Headline": "World leaders praising Trump for his Gaza ceasefire plan only encouraged him to believe he can solve the world's most complex conflicts with minimal effort.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression. The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world. The Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped. It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO. The question now is: are Europe's leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure. The plan proposes the following: • Land seized by Vladimir Putin's unwarranted and unprovoked invasion would be ceded by Kyiv. • Territory his forces have fought but failed to take with colossal loss of life will be thrown into the bargain for good measure. • Ukraine will be barred from NATO, from having long-range weapons, from hosting foreign troops, from allowing foreign diplomatic planes to land, and its military neutered, reduced in size by more than half. And most worryingly for Western leaders, the plan proposes NATO and Russia negotiate with America acting as mediator. Lest we forget, America is meant to be the strongest partner in NATO, not an outside arbitrator. In one clause, Mr Trump's lack of commitment to the Western alliance is laid bare in chilling clarity. And even for all that, the plan will not bring peace. Mr Putin has made it abundantly clear he wants all of Ukraine. He has a proven track record of retiring, rallying his forces, then returning for more. Reward a bully as they say, and he will only come back for more. Why wouldn't he, if he is handed the fortress cities of Donetsk and a clear run over open tank country to Kyiv in a few years?  Since the beginning of Trump's presidency, Europe has tried to keep the maverick president onside when his true sympathies have repeatedly reverted to Moscow. It has been a demeaning and sycophantic spectacle, NATO's secretary general stooping even to calling the US president 'Daddy'. And it hasn't worked. It may have made matters worse. The parade of world leaders trooping through Sharm el-Sheikh, Egypt, lavishing praise on his Gaza ceasefire plan, only encouraged him to believe he is capable of solving the world's most complex conflicts with the minimum of effort. The Gaza plan is mired in deepening difficulty, and it never came near addressing the underlying causes of the war. Read more:Ukraine war latest: Putin welcomes peace planTrump's 28-point Ukraine peace plan in full Most importantly, principles the West has held inviolable for eight decades cannot be torn up for the sake of a quick and uncertain peace. With a partner as unreliable, the challenge to Europe cannot be clearer. In the words of one former Baltic foreign minister: \"There is a glaringly obvious message for Europe in the 28-point plan: This is the end of the end. \"We have been told repeatedly and unambiguously that Ukraine's security, and therefore Europe's security, will be Europe's responsibility. And now it is. Entirely.\" If Europe does not step up to the plate and guarantee Ukraine's security in the face of this American betrayal, we could all pay the consequences."
    },
    {
        "title": "Gunmen kidnap more than 200 students from school in Nigeria",
        "description": "Over 200 students have been kidnapped from a Catholic boarding school in western Nigeria - the second mass abduction in the country this week.",
        "url": "https://news.sky.com/story/gunmen-kidnap-52-students-from-school-in-nigeria-say-reports-13473525",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kebbi-nigeria-school_7087505.jpg?20251121110436",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 09:40:00",
        "Headline": "The students and 12 teachers were taken from St Mary's School in Agwara, Niger state, early on Friday, according to the Christian Association of Nigeria.",
        "Content": "Over 200 students have been kidnapped from a Catholic boarding school in western Nigeria - the second mass abduction in the country this week. Gunmen took 215 students and 12 teachers from St Mary's School in Agwara, Niger state, early on Friday, according to the Christian Association of Nigeria. Daniel Atori, a spokesperson for the Niger state chapter of the association, said he met parents of the abducted children \"to assure them that we are working with the government and security agencies to see that our children are rescued and brought back safely\". St Mary's is a secondary school that has students aged 12 to 17, but the institution is attached to an adjoining primary school with more than 50 classrooms and dormitory buildings. Dauda Chekula, 62, said that four of his grandchildren, ranging in age from seven to 10, were among those abducted. \"We don't know what is happening now, because we have not heard anything since this morning,\" Mr Chekula said. \"The children who were able to escape have scattered, some of them ran back to their houses and the only information we are getting is that the attackers are still moving with the remaining children into the bush.\" On Monday, 25 schoolgirls were kidnapped from a boarding school in neighbouring Kebbi state, northwest Nigeria. Police said men armed with rifles stormed the Government Girls Comprehensive Secondary School in the town of Maga at around 4am local time (3am UK time), arriving on motorcycles in an apparently well-planned attack. Student escapes from kidnappers A 15-year-old student who was among those abducted from the boarding school in Kebbi state's Danko-Wasagu area managed to escape. She said she found refuge at a teacher's house. It was not immediately clear who was to blame for either of the abductions. Abubakar Usman, the secretary to the Niger state government, said in a statement that the latest kidnapping occurred despite a prior intelligence warning of heightened threats. \"Regrettably, St Mary's School proceeded to reopen and resume academic activities without notifying or seeking clearance from the state government, thereby exposing pupils and the staff to avoidable risk,\" it read. A security staffer was \"badly shot\" during the early-morning attack on the school, the Catholic Diocese of Kontagora said. Ransom demand for worshippers Separately, gunmen attacked a church in Kwara state on Monday, killing at least two people. A church official said 38 worshippers were also kidnapped by the gunmen, who have since issued a ransom demand of 100 million naira (£52,660) for each person. Kebbi, Kwara and Niger states border one another. Read more from Sky News:Fatal plane crash at Dubai air showIndonesian volcano eruptsEurope cannot reject Trump's peace plan The attacks have highlighted insecurity in Nigeria and forced President Bola Tinubu to postpone foreign trips. At least 1,500 students have been abducted in the region since Boko Haram extremists seized 276 Chibok schoolgirls more than a decade ago. No group has claimed responsibility for the attacks in Niger and Kebbi state, but analysts say gangs often target schools in kidnappings for ransom. Nigeria was recently thrust into the spotlight after Donald Trump singled the country out, claiming that Christians are being persecuted - an allegation that the government rejected."
    },
    {
        "title": "Eurovision to change voting rules after claims of Israeli government 'interference'",
        "description": "The Eurovision Song Contest is changing its voting system, following allegations of \"interference\" by Israel's government this year.",
        "url": "https://news.sky.com/story/eurovision-to-change-voting-rules-after-claims-of-israeli-government-interference-13473662",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eurovision-israel-gaza_7017931.jpg?20250930212636",
        "type": "World",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-21 16:05:00",
        "Headline": "The reduction in the number of votes that can be made online, or via SMS or phone call, from 20 to 10 was \"designed to encourage more balanced participation\", said contest director Martin Green.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The Eurovision Song Contest is changing its voting system, following allegations of \"interference\" by Israel's government this year. Israeli singer Yuval Raphael received the largest number of votes from the public in the contest in May, ultimately finishing as runner-up after the jury votes were counted. But a number of broadcasters raised concerns about Israel's result. After the final, Irish broadcaster RTE requested a breakdown in voting numbers from contest organiser the European Broadcasting Union (EBU), while Spain's public broadcaster, Radio Television Espanola (RTVE), called for a \"complete review\" of the voting system to avoid \"external interference\". In September, Dutch public broadcaster AVROTROS said it could no longer justify Israel's participation in the contest, due to the Israel-Hamas war in Gaza. It went on to say there had been \"proven interference by the Israeli government during the last edition of the Song Contest, with the event being used as a political instrument\". The statement did not elaborate on the means of \"interference\". Sky News has contacted the Israeli government for comment. \n                  Eurovision emergency vote on Israel's inclusion is called off\n                 \n                  Why emergency Eurovision vote on Israel might not stop a broadcast boycott\n                 \n                  Could Eurovision boycotts over Israel lead to a competition crisis?\n                 In early December, the EBU will hold its winter general assembly, with members due to consider the changes, and if not satisfied, vote on Israel's participation. Key changes to next year's competition include: • Clearer rules around promotion of artists and their songs• Cap on audience voting halved• The return of professional juries to semi-finals• Enhanced security safeguards Read more: Could Eurovision boycotts over Israel lead to a competition crisis?  Sanctions threat The EBU said the tightening of rules around promotion was to \"discourage disproportionate promotion campaigns… particularly when undertaken or supported by third parties, including governments or governmental agencies\". It said that \"any attempts to unduly influence the results will lead to sanctions\". Contest director Martin Green said \"no broadcaster or artist may now directly engage with or support campaigns by third parties - including governments or their agencies - that could distort the vote\". He said the reduction in the number of votes that can be made online, or via SMS or phone call, from 20 to 10 was \"designed to encourage more balanced participation\". He said that \"although the number of votes previously allowed did not unduly influence the results of previous contests, there were concerns expressed by participating broadcasters and fans alike\". Professional juries in semi-finals - and younger jurors It was also announced that professional juries in the semi-finals would be restored for the first time since 2022, with an expansion to the range of professions from which jurors can be chosen. The EBU said this will give roughly 50-50 percentage weight between audience and jury votes. At least two jurors aged 18-25 will be present in every jury, to reflect the appeal of the contest with younger audiences. Also mentioned were enhanced technical safeguards designed to \"protect the contest from suspicious or coordinated voting activity\" and strengthen security systems that \"monitor, detect and prevent fraudulent patterns\". Politics making itself heard over Europop lyrics Mr Green said that the neutrality and integrity of the competition is of \"paramount importance\" to the EBU, its members, and audiences, adding that the event \"should remain a neutral space and must not be instrumentalised\". A vocally apolitical event, world events have dominated Eurovision in recent years. Russia was banned from the competition in 2022 following its invasion of Ukraine. Israel has competed in Eurovision for more than 50 years and won four times, but there have been ongoing calls to block their participation over the conduct of Prime Minister Benjamin Netanyahu's government in the Hamas-Israel war. Israel denies targeting civilians in Gaza and has said it is being unfairly demonised abroad. In September, Spain, the Netherlands, Ireland, Iceland, and Slovenia threatened to withdraw their participation in Eurovision unless Israel is excluded from the competition. There were also demonstrations against Israel's inclusion in Basel, Switzerland, when the 2025 competition took place. 'Step in right direction' Responding to the changes, Iceland's official broadcaster RUV told Sky News they were \"a step in the right direction\", and they would be discussing them with their \"sister stations in the Nordic countries\" ahead of the EBU meeting in December. Ireland's official broadcaster RTE told Sky News: \"Clearly, events in the Middle East are unfolding day by day. As previously confirmed by the EBU, the issue of participation in the 2026 Eurovision Song Contest has been included on the agenda of the EBU Executive Board's ordinary Winter General Assembly.\" Sky News has also contacted the official broadcaster for the Netherlands (AVROTROS), Spain (RTVE), Slovenia (RTVSLO), and Israel (Kan) for comment. The chief executive of Kan, Golan Yochpaz, has previously said the event should not become political and that there is \"no reason\" why Israel should not be part of it. Netanyahu praised Israeli entrant Earlier this year, Israeli Prime Minister Benjamin Netanyahu told Israel's 2025 Eurovision entrant Yuval Raphael she had brought the country \"a lot of honour\" after she finished in second place, adding \"you're the real winner. Statistically, it's true… You entered the hearts of a huge portion of the public in Europe.\" The year before he told entrant Eden Golan: \"I saw that you received almost the highest number of votes from the public and this is the most important thing, not from the judges but from the public, and you held Israel's head up high in Europe.\" In October, a ceasefire deal was put in place, aimed at bringing an end to the two-year war in the Middle East. The war began when Hamas stormed into Israel on October 7 2023, killing around 1,200 people and taking 251 hostage. Israel invaded Gaza in retaliation, with airstrikes and ground assaults devastating much of the territory and killing more than 67,000, according to the Hamas-run health ministry. Its figures do not differentiate between civilians and combatants, but it says around half of those killed were women and children. The world's largest live music event, next year's contest will be held in Vienna, Austria, in May and will celebrate 70 years of Eurovision."
    },
    {
        "title": "Pilot killed after Indian fighter jet crashes at Dubai air show",
        "description": "An Indian jet fighter crashed during a demonstration flight in front of a crowd of spectators at the Dubai Air Show.",
        "url": "https://news.sky.com/story/plane-crashes-at-dubai-air-show-13473492",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-dubai-air-show-plane-crash_7087515.jpg?20251121113012",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 07:25:00",
        "Headline": "The Indian HAL Tejas jet crashed during a demonstration flight, killing the pilot.",
        "Content": " An Indian jet fighter crashed during a demonstration flight in front of a crowd of spectators at the Dubai Air Show. The Indian HAL Tejas, a combat plane used by the Indian Air Force, crashed at around 2.10pm local time (10.10am UK time), at Al Maktoum International Airport. The lone pilot was killed. Video footage of the aftermath of the crash showed black smoke rising over the airport, which was hosting a biennial air show. The plane appeared to lose control and plummeted directly towards the ground just before crashing.  Police vehicles, ambulances and a helicopter rushed to the site of the crash, spraying firefighting foam to extinguish the blaze. The Indian Air Force later confirmed the pilot died in the crash. \"IAF deeply regrets the loss of life and stands firmly with the bereaved family in this time of grief,\" it added. \"A court of inquiry is being constituted, to ascertain the cause of the accident.\" The pilot had flown across the site of the air show several times. Read more from Sky News:Miss Mexico crowned Miss Universe 2025Trump's 28-point Ukraine peace plan in full On Thursday, India's Press Information Bureau dismissed social media claims that a Tejas aircraft had leaked oil while on display at the air show. In a statement on X, the bureau described the posts as \"false\". It was unclear whether the aircraft referenced was the same one that crashed on Friday. Last year, a Tejas fighter jet crashed in India's northwestern state of Rajasthan, but the pilot ejected safely."
    },
    {
        "title": "Teenagers killed in West Bank, residents say, as 'almost two children a day killed in Gaza'",
        "description": "Israeli forces killed two Palestinian teenagers during an overnight raid on a West Bank town, residents said, as violence surges in the territory.",
        "url": "https://news.sky.com/story/teenagers-killed-in-west-bank-residents-say-as-almost-two-children-a-day-killed-in-gaza-13473551",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-west-bank-settler_7087545.jpg?20251121120135",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 10:32:00",
        "Headline": "The latest victims were aged 16 and 18, according to Palestinian health officials",
        "Content": "Israeli forces killed two Palestinian teenagers during an overnight raid on a West Bank town, residents said, as violence surges in the territory. Teens Sami Ibrahim Mashaikha, 16, and Amr Khaled Al-Marboua, 18, were shot during the raid in Kfar Aqab, in the Israeli-occupied West Bank, according to the health ministry in the Palestinian Authority, which governs parts of the region. The Israeli military deployed forces to the streets and on top of the town's buildings before opening fire, the Palestinian WAFA news agency reported. Israel Police said in a statement to Sky News: \"Overnight, Israel Police forces operated in the Aqab area against hostile elements seeking to harm security forces and provoke violent disorder. \"During the operation, a violent disturbance developed involving dozens of individuals, including heavy stone-throwing and fireworks launched toward the forces. In the close vicinity, heavy gunfire was heard, though its source was not identified. \"The forces fired at four individuals who posed an immediate threat to the personnel. The individuals were evacuated for medical treatment by medical teams.\" This month alone, six Palestinian minors, aged under 18, were killed by Israeli forces in the West Bank, according to a Reuters tally. \n                  On the ground in Gaza: It's impossible to imagine people still living here - yet some do\n                 \n                  On paper, Trump's Gaza plan looks convincing - but there's more to this story\n                 \n                  Inside Jordan warehouse where Gaza aid held 'after being refused entry by Israel'\n                 It comes against a backdrop of increasing violence in the West Bank, despite a ceasefire between Israel and Hamas in Gaza taking effect on 10 October. Read more: UN Security Council backs Trump peace plan for GazaWhat does Trump's Gaza peace plan look like? Overnight, settlers attacked communities near Nablus, setting fire to properties in Huwara and Abu Falah, residents there said. The Israeli military said soldiers responded to reports overnight of Israeli civilians hurling rocks toward Palestinian vehicles and setting fire to property in the Huwara area. No suspects were found during searches in the area by Israeli soldiers, the military said in a statement. On Tuesday, Palestinian attackers killed an Israeli man and injured three others in a car-ramming and stabbing attack in the West Bank, before being shot dead by Israeli soldiers. Israeli Prime Minister Benjamin Netanyahu called the incident a terrorist attack. It comes as UNICEF reported at least 67 children being killed in conflict-related incidents in Gaza since the ceasefire began last month. \"Dozens more have been injured. That is an average of almost two children killed every day since the ceasefire took effect,\" UNICEF spokesperson Ricardo Pires told reporters in Geneva. US President Donald Trump's plan began with a ceasefire between Israel and Hamas which led to Israeli hostages and Palestinian prisoners being handed over. The war began following the Hamas attack on Israel on 7 October 2023, when around 1,200 people were killed and 251 taken hostage. Over the past two years, more than 68,000 people have been killed in Gaza as a result of Israeli military action."
    },
    {
        "title": "Two critically injured after bear attacks schoolchildren and teachers in Canada",
        "description": "A grizzly bear attack on a group of schoolchildren and teachers in Canada has injured 11 people, two of them critically.",
        "url": "https://news.sky.com/story/two-critically-injured-after-bear-attacks-schoolchildren-and-teachers-in-canada-13473536",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-montana-grizzly-bear_6228423.jpg?20230724071712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 10:03:00",
        "Headline": "A parent described how people tried to halt the attack by using bear spray and said one teacher bore the \"brunt\" of the attack.",
        "Content": "A grizzly bear attack on a group of schoolchildren and teachers in Canada has injured 11 people, two of them critically. Armed police and conservation officers are on the scene, but the \"aggressive bear\" remains on the loose, according to the self-governing local indigenous community Nuxalk Nation. Residents have been warned by local authorities to remain indoors and not to go looking for the bear. The attack took place on Thursday afternoon in Bella Coola, British Columbia, 435 miles northwest of Vancouver, while the group of fourth and fifth graders were on a walking trail with teachers. Veronica Schooner, whose son was in the elementary class group which was attacked, said a lot of people had tried to halt the attack and that bear spray had been used. She added that a male teacher \"got the whole brunt\" of the attack and was among those taken away by helicopter. Ms Schooner added that her son was so close to the animal that \"he even felt its fur\", but that the animal \"was going after somebody else\". She said his shoes were muddy from running for safety, adding: \"he keeps crying for his friends - right away he started praying for his friends.\" The students attend Acwsalcta School, an independent school run by Nuxalk First Nation in Bella Coola. Read more from Sky News:Japan sends in troops to help tackle bear attacksPlane crashes at Dubai air show, killing pilot A Facebook post said the school would be closed on Friday, and counselling for those affected would be made available. A school statement read: \"It's hard to know what to say during this very difficult time. We are so grateful for our team and our students.\" In a separate post, it was announced that every student would be dropped off at their homes by bus or SUV."
    },
    {
        "title": "Trump's 28-point Ukraine peace plan in full",
        "description": "Donald Trump's plan for ending the war in Ukraine would hand swathes of land to Russia and limit the size of Kyiv's military, a draft has revealed.",
        "url": "https://news.sky.com/story/trumps-28-point-ukraine-peace-plan-in-full-including-land-kyiv-must-hand-to-russia-and-when-elections-must-be-held-13473491",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-vladimir-putin_7052733.jpg?20251016202525",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-21 07:27:00",
        "Headline": "The document states Ukraine must cede land it currently controls. The plan closely resembles the list of demands repeatedly outlined by Vladimir Putin.",
        "Content": " Donald Trump's plan for ending the war in Ukraine would hand swathes of land to Russia and limit the size of Kyiv's military, a draft has revealed. The copy of the proposal that originates from negotiations between Washington and Moscow was obtained by the Associated Press and appears emphatically favourable to Russia. It closely resembles the list of demands repeatedly stated by the Kremlin since it launched its full-scale invasion of Ukraine nearly four years ago. Points included in the plan are widely seen as untenable for Ukrainian President Volodymyr Zelenskyy, who has rejected Mr Trump's previous calls for territorial concessions. Ukraine war latest - Zelenskyy responds to Trump peace plan The draft was reportedly devised by Trump negotiator Steve Witkoff and Kremlin official Kirill Dmitriev. It says there would be a \"decisive coordinated military response\" in the event of further Russian incursions onto Ukrainian territory, but does not say what role the United States would play in that response. \n                  Marjorie Taylor Greene: Former Trump ally turned critic announces sudden resignation\n                 \n                  Trump says Ukraine will have to accept peace plan - but critics warn it has 'real problems'\n                 \n                  Did Trump just call for Democrats to be hanged?\n                 A side agreement aims to satisfy Ukrainian security concerns by saying a future \"significant, deliberate and sustained armed attack\" by Russia would be viewed as \"threatening the peace and security of the transatlantic community\". The agreement - detailed to the AP by an unnamed senior US official - does not obligate the US or European allies to intervene on Ukraine's behalf, although it says they would \"determine the measures necessary to restore security\". The 28-point plan states Ukraine must cede the entirety of Crimea, Luhansk and Donetsk to Russia - despite Ukraine still controlling a third of the latter. Kherson and Zaporizhzhia would be frozen along the existing lines of conflict. Ukraine's army, currently at roughly 880,000 troops, would be reduced to 600,000. Some frozen Russian assets would go toward rebuilding Ukraine, while sanctions on Russia would be lifted and Moscow and Washington would enter in a series of \"long-term\" economic arrangements. The document says Ukraine would not be allowed to join NATO, but would be eligible to join the European Union. It also says elections must be held in Ukraine in 100 days. Here is the 28-point draft agreement in full: 1. Ukraine's sovereignty will be confirmed. 2. A comprehensive non-aggression agreement will be concluded between Russia, Ukraine and Europe. All ambiguities of the last 30 years will be considered settled. 3. It is expected that Russia will not invade neighbouring countries and NATO will not expand further. 4. A dialogue will be held between Russia and NATO, mediated by the United States, to resolve all security issues and create conditions for de-escalation in order to ensure global security and increase opportunities for cooperation and future economic development. 5. Ukraine will receive reliable security guarantees. 6. The size of the Ukrainian Armed Forces will be limited to 600,000 personnel. 7. Ukraine agrees to enshrine in its constitution that it will not join NATO, and NATO agrees to include in its statutes a provision that Ukraine will not be admitted in the future. 8. NATO agrees not to station troops in Ukraine. 9. European fighter jets will be stationed in Poland. 10. The US guarantee: - The US will receive compensation for the guarantee; - If Ukraine invades Russia, it will lose the guarantee; - If Russia invades Ukraine, in addition to a decisive coordinated military response, all global sanctions will be reinstated, recognition of the new territory and all other benefits of this deal will be revoked; - If Ukraine launches a missile at Moscow or St Petersburg without cause, the security guarantee will be deemed invalid. International affairs editor The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression.  The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world.  The Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped.  It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO.  The question now is: are Europe's leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure. Read the full analysis here 11. Ukraine is eligible for EU membership and will receive short-term preferential access to the European market while this issue is being considered. 12. A powerful global package of measures to rebuild Ukraine, including but not limited to: - The creation of a Ukraine Development Fund to invest in fast-growing industries, including technology, data centres, and artificial intelligence. - The United States will cooperate with Ukraine to jointly rebuild, develop, modernise, and operate Ukraine's gas infrastructure, including pipelines and storage facilities. - Joint efforts to rehabilitate war-affected areas for the restoration, reconstruction and modernisation of cities and residential areas. - Infrastructure development. - Extraction of minerals and natural resources. - The World Bank will develop a special financing package to accelerate these efforts. 13. Russia will be reintegrated into the global economy: - The lifting of sanctions will be discussed and agreed upon in stages and on a case-by-case basis. - The United States will enter into a long-term economic cooperation agreement for mutual development in the areas of energy, natural resources, infrastructure, artificial intelligence, data centres, rare earth metal extraction projects in the Arctic, and other mutually beneficial corporate opportunities. - Russia will be invited to rejoin the G8.  14. Frozen funds will be used as follows: - $100bn (£76bn) in frozen Russian assets will be invested in US-led efforts to rebuild and invest in Ukraine; - The US will receive 50% of the profits from this venture. Europe will add $100bn (£76bn) to increase the amount of investment available for Ukraine's reconstruction. Frozen European funds will be unfrozen. The remainder of the frozen Russian funds will be invested in a separate US-Russian investment vehicle that will implement joint projects in specific areas. This fund will be aimed at strengthening relations and increasing common interests to create a strong incentive not to return to conflict. 15. A joint American-Russian working group on security issues will be established to promote and ensure compliance with all provisions of this agreement. 16. Russia will enshrine in law its policy of non-aggression towards Europe and Ukraine. 17. The United States and Russia will agree to extend the validity of treaties on the non-proliferation and control of nuclear weapons, including the START I Treaty. 18. Ukraine agrees to be a non-nuclear state in accordance with the Treaty on the Non-Proliferation of Nuclear Weapons. 19. The Zaporizhzhia Nuclear Power Plant will be launched under the supervision of the IAEA, and the electricity produced will be distributed equally between Russia and Ukraine - 50:50. 20. Both countries undertake to implement educational programmes in schools and society aimed at promoting understanding and tolerance of different cultures and eliminating racism and prejudice: - Ukraine will adopt EU rules on religious tolerance and the protection of linguistic minorities. - Both countries will agree to abolish all discriminatory measures and guarantee the rights of Ukrainian and Russian media and education. - All Nazi ideology and activities must be rejected and prohibited. 21. Territories: - Crimea, Luhansk and Donetsk will be recognised as de facto Russian, including by the United States. - Kherson and Zaporizhzhia will be frozen along the line of contact, which will mean de facto recognition along the line of contact. - Russia will relinquish other agreed territories it controls outside the five regions. Read moreAnalysis: Why Zelenskyy has to tread carefully over peace plan, or face a Trump ultimatumAnalysis: What deleted post reveals about 'secret' plan to end Ukraine war - Ukrainian forces will withdraw from the part of Donetsk Oblast that they currently control, and this withdrawal zone will be considered a neutral demilitarised buffer zone, internationally recognised as territory belonging to the Russian Federation. Russian forces will not enter this demilitarised zone. 22. After agreeing on future territorial arrangements, both the Russian Federation and Ukraine undertake not to change these arrangements by force. Any security guarantees will not apply in the event of a breach of this commitment. 23. Russia will not prevent Ukraine from using the Dnieper [Dnipro] River for commercial activities, and agreements will be reached on the free transport of grain across the Black Sea. 24. A humanitarian committee will be established to resolve outstanding issues: - All remaining prisoners and bodies will be exchanged on an 'all for all' basis. - All civilian detainees and hostages will be returned, including children. - A family reunification program will be implemented. - Measures will be taken to alleviate the suffering of the victims of the conflict. 25. Ukraine will hold elections in 100 days. 26. All parties involved in this conflict will receive full amnesty for their actions during the war and agree not to make any claims or consider any complaints in the future. 27. This agreement will be legally binding. Its implementation will be monitored and guaranteed by the Peace Council, headed by President Donald J Trump. Sanctions will be imposed for violations. 28. Once all parties agree to this memorandum, the ceasefire will take effect immediately after both sides retreat to agreed points to begin implementation of the agreement."
    },
    {
        "title": "Manhunt for teacher at centre of a row over transgender student",
        "description": "Irish police have failed to locate controversial schoolteacher Enoch Burke, three days after a Dublin court ordered his imprisonment.",
        "url": "https://news.sky.com/story/manhunt-for-teacher-at-centre-of-a-row-over-transgender-student-13473578",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-enoch-burke-transgender_7087560.jpg?20251121121943",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2025-11-21 11:46:00",
        "Headline": "Enoch Burke contends he is being jailed for his religious beliefs, and has become a cause celebre among many on the far-right.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n Irish police have failed to locate controversial schoolteacher Enoch Burke, three days after a Dublin court ordered his imprisonment. The teacher has spent more than 500 days in prison in several spells since 2022, after he refused to stop showing up at the school that sacked him. Wilson's Hospital, a secondary school in County Westmeath, dismissed Burke for misconduct that arose from his refusal to address a transgender pupil by their new pronouns. Burke, a member of an evangelical Christian family from County Mayo, contends he is being jailed for his religious beliefs, and has become a cause celebre among many on the far-right. His former employers maintain he has been jailed for flouting court orders and continuing to trespass on private property. 'Stalking the school' On Tuesday, a High Court judge described Burke as an intruder engaged in \"stalking the school\" and a \"potential danger\" to pupils and teachers. \n                  Trump says Ukraine will have to accept peace plan - but critics warn it has 'real problems'\n                 \n                  Trump peace plan: We could all pay if Europe doesn't step up and guarantee Ukraine's security\n                 \n                  Ukraine and Europe cannot reject Trump's plan - they will play for time and hope he can still be persuaded to desert the Kremlin\n                 Mr Justice Brian Cregan said that Burke had carried out a sustained and deliberate attack on the authority of the civil courts and instructed Gardai [the Irish police service] to arrest him. Garda members visited the Burke family home in Castlebar, County Mayo, at least twice on Wednesday but failed to find the teacher. Two videos documenting the visits were posted to Enoch Burke's X account. The videos showed the Gardai inquiring as to the teacher's location, but they were unsuccessful in tracing him. Enoch 'entitled to religious belief' In one of the videos, his father Sean Burke describes the Gardai's presence as \"shameful\" and declares that \"Enoch is entitled to his religious belief\". The Gardai then leave. The Garda press office confirmed to Sky News on Friday morning that no arrest had yet been made. In a statement, the service said: \"An Garda Síochána has received a Court order relating to contempt of Court by an individual. An Garda Síochána does not comment on the detail of on-going operations.\" The activities of the Burke family have been generating headlines for years in Ireland. Sean Burke was jailed for two months last year for assaulting a Garda in a courtroom. The jailing of Enoch Burke has been embraced by right-wing commentators, in Ireland and the US, as evidence of the oppression of religious freedoms. Elon Musk has shared posts containing misleading information about the case. Sky News was present at Wilson's Hospital School on a previous occasion when Burke was arrested by Irish police. He told Sky News that he detested prison, which he described as \"a terrible place\", but said that his rights were being breached."
    },
    {
        "title": "Trump peace plan: We could all pay if Europe doesn't step up and guarantee Ukraine's security",
        "description": "The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum.",
        "url": "https://news.sky.com/story/trump-peace-plan-we-could-all-pay-if-europe-doesnt-step-up-and-guarantee-ukraines-security-13473738",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7087749.jpg?20251121161948",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-21 22:45:00",
        "Headline": "World leaders praising Trump for his Gaza ceasefire plan only encouraged him to believe he can solve the world's most complex conflicts with minimal effort.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression. The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world. The Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped. It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO. The question now is: are Europe's leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure. The plan proposes the following: • Land seized by Vladimir Putin's unwarranted and unprovoked invasion would be ceded by Kyiv. • Territory his forces have fought but failed to take with colossal loss of life will be thrown into the bargain for good measure. • Ukraine will be barred from NATO, from having long-range weapons, from hosting foreign troops, from allowing foreign diplomatic planes to land, and its military neutered, reduced in size by more than half. And most worryingly for Western leaders, the plan proposes NATO and Russia negotiate with America acting as mediator. Lest we forget, America is meant to be the strongest partner in NATO, not an outside arbitrator. In one clause, Mr Trump's lack of commitment to the Western alliance is laid bare in chilling clarity. And even for all that, the plan will not bring peace. Mr Putin has made it abundantly clear he wants all of Ukraine. He has a proven track record of retiring, rallying his forces, then returning for more. Reward a bully as they say, and he will only come back for more. Why wouldn't he, if he is handed the fortress cities of Donetsk and a clear run over open tank country to Kyiv in a few years?  Since the beginning of Trump's presidency, Europe has tried to keep the maverick president onside when his true sympathies have repeatedly reverted to Moscow. It has been a demeaning and sycophantic spectacle, NATO's secretary general stooping even to calling the US president 'Daddy'. And it hasn't worked. It may have made matters worse. The parade of world leaders trooping through Sharm el-Sheikh, Egypt, lavishing praise on his Gaza ceasefire plan, only encouraged him to believe he is capable of solving the world's most complex conflicts with the minimum of effort. The Gaza plan is mired in deepening difficulty, and it never came near addressing the underlying causes of the war. Read more:Ukraine war latest: Putin welcomes peace planTrump's 28-point Ukraine peace plan in full Most importantly, principles the West has held inviolable for eight decades cannot be torn up for the sake of a quick and uncertain peace. With a partner as unreliable, the challenge to Europe cannot be clearer. In the words of one former Baltic foreign minister: \"There is a glaringly obvious message for Europe in the 28-point plan: This is the end of the end. \"We have been told repeatedly and unambiguously that Ukraine's security, and therefore Europe's security, will be Europe's responsibility. And now it is. Entirely.\" If Europe does not step up to the plate and guarantee Ukraine's security in the face of this American betrayal, we could all pay the consequences."
    },
    {
        "title": "Pras Michel: Fugees rapper 'who betrayed US for money' is jailed for 14 years",
        "description": "A Grammy-winning rapper who \"betrayed his country for money\" has been sentenced to 14 years in prison.",
        "url": "https://news.sky.com/story/pras-michel-fugees-who-betrayed-us-for-money-is-jailed-for-14-years-13473440",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pras-michel-fugees_7087218.jpg?20251121033259",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-21 03:17:00",
        "Headline": "Prosecutors said Michel \"lied unapologetically and unrelentingly to carry out his actions\" - and sought to deceive the White House, senior politicians and the FBI for almost a decade.",
        "Content": "A Grammy-winning rapper who \"betrayed his country for money\" has been sentenced to 14 years in prison. Prakazrel \"Pras\" Michel, who was part of 1990s hip-hop group The Fugees, was convicted of illegally funnelling millions of dollars in foreign contributions to Barack Obama's re-election campaign in 2012. The Justice Department had accused the 53-year-old of accepting $120m (£92m) from Malaysian financier Low Taek Jho, who wanted to gain political influence in the US. Prosecutors said Michel \"lied unapologetically and unrelentingly to carry out his actions\" - and sought to deceive the White House, senior politicians and the FBI for almost a decade. In 2018, it is claimed he urged the Trump administration and the justice department to drop embezzlement investigations against Low. Michel was convicted of 10 counts by a federal jury in 2023 - and last month, he was ordered to forfeit about $65m (£50m) for his role in the scheme. Hollywood star Leonardo DiCaprio testified at the trial, and Low was a primary financier in his 2013 film The Wolf Of Wall Street. \n                  Billion-pound money laundering network operating in 28 towns and cities in UK\n                 \n                  'Prolific and depraved' child rapist who sold abuse images jailed\n                 \n                  Ex-East Dunbartonshire Council leader Andrew Polson jailed for romance fraud and stealing money from Christian radio station\n                 The Oscar-winning actor said the businessman's funding and legitimacy had been carefully vetted before they entered a partnership. Prosecutors had been seeking a life sentence to \"reflect the breadth and depth of Michel's crimes, his indifference to the risks to his country, and the magnitude of his greed\". However, the rapper's lawyer Peter Zeidenberg has argued that the 14-year term is \"completely disproportionate to the offence\" - and is vowing to appeal. Last year, a judge rejected Michel's request for a new trial after claiming that one of his lawyers had used AI during closing arguments. Read more from Sky News:Strictly star 'arrested on suspicion of rape'The Stone Roses bassist Mani dies aged 63 Low Taek Jho has been accused of having a central role in the 1MDB scandal, amid claims billions of dollars were stolen from a Malaysian state fund. The 44-year-old is a fugitive but has maintained his innocence, with his lawyers writing: \"Low's motivation for giving Michel money to donate was not so that he could achieve some policy objective. \"Instead, Low simply wanted to obtain a photograph with himself and then President Obama.\" Michel, who was born in Brooklyn, was a founding member of The Fugees with childhood friends Lauryn Hill and Wyclef Jean - selling tens of millions of records."
    },
    {
        "title": "Trump's 28-point Ukraine peace plan in full",
        "description": "Donald Trump's plan for ending the war in Ukraine would hand swathes of land to Russia and limit the size of Kyiv's military, a draft has revealed.",
        "url": "https://news.sky.com/story/trumps-28-point-ukraine-peace-plan-in-full-including-land-kyiv-must-hand-to-russia-and-when-elections-must-be-held-13473491",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-vladimir-putin_7052733.jpg?20251016202525",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-21 07:27:00",
        "Headline": "The document states Ukraine must cede land it currently controls. The plan closely resembles the list of demands repeatedly outlined by Vladimir Putin.",
        "Content": " Donald Trump's plan for ending the war in Ukraine would hand swathes of land to Russia and limit the size of Kyiv's military, a draft has revealed. The copy of the proposal that originates from negotiations between Washington and Moscow was obtained by the Associated Press and appears emphatically favourable to Russia. It closely resembles the list of demands repeatedly stated by the Kremlin since it launched its full-scale invasion of Ukraine nearly four years ago. Points included in the plan are widely seen as untenable for Ukrainian President Volodymyr Zelenskyy, who has rejected Mr Trump's previous calls for territorial concessions. Ukraine war latest - Zelenskyy responds to Trump peace plan The draft was reportedly devised by Trump negotiator Steve Witkoff and Kremlin official Kirill Dmitriev. It says there would be a \"decisive coordinated military response\" in the event of further Russian incursions onto Ukrainian territory, but does not say what role the United States would play in that response. \n                  Marjorie Taylor Greene: Former Trump ally turned critic announces sudden resignation\n                 \n                  Trump says Ukraine will have to accept peace plan - but critics warn it has 'real problems'\n                 \n                  Did Trump just call for Democrats to be hanged?\n                 A side agreement aims to satisfy Ukrainian security concerns by saying a future \"significant, deliberate and sustained armed attack\" by Russia would be viewed as \"threatening the peace and security of the transatlantic community\". The agreement - detailed to the AP by an unnamed senior US official - does not obligate the US or European allies to intervene on Ukraine's behalf, although it says they would \"determine the measures necessary to restore security\". The 28-point plan states Ukraine must cede the entirety of Crimea, Luhansk and Donetsk to Russia - despite Ukraine still controlling a third of the latter. Kherson and Zaporizhzhia would be frozen along the existing lines of conflict. Ukraine's army, currently at roughly 880,000 troops, would be reduced to 600,000. Some frozen Russian assets would go toward rebuilding Ukraine, while sanctions on Russia would be lifted and Moscow and Washington would enter in a series of \"long-term\" economic arrangements. The document says Ukraine would not be allowed to join NATO, but would be eligible to join the European Union. It also says elections must be held in Ukraine in 100 days. Here is the 28-point draft agreement in full: 1. Ukraine's sovereignty will be confirmed. 2. A comprehensive non-aggression agreement will be concluded between Russia, Ukraine and Europe. All ambiguities of the last 30 years will be considered settled. 3. It is expected that Russia will not invade neighbouring countries and NATO will not expand further. 4. A dialogue will be held between Russia and NATO, mediated by the United States, to resolve all security issues and create conditions for de-escalation in order to ensure global security and increase opportunities for cooperation and future economic development. 5. Ukraine will receive reliable security guarantees. 6. The size of the Ukrainian Armed Forces will be limited to 600,000 personnel. 7. Ukraine agrees to enshrine in its constitution that it will not join NATO, and NATO agrees to include in its statutes a provision that Ukraine will not be admitted in the future. 8. NATO agrees not to station troops in Ukraine. 9. European fighter jets will be stationed in Poland. 10. The US guarantee: - The US will receive compensation for the guarantee; - If Ukraine invades Russia, it will lose the guarantee; - If Russia invades Ukraine, in addition to a decisive coordinated military response, all global sanctions will be reinstated, recognition of the new territory and all other benefits of this deal will be revoked; - If Ukraine launches a missile at Moscow or St Petersburg without cause, the security guarantee will be deemed invalid. International affairs editor The Donald Trump peace plan is nothing of the sort. It takes Russian demands and presents them as peace proposals, in what is effectively for Ukraine a surrender ultimatum. If accepted, it would reward armed aggression.  The principle, sacrosanct since the Second World War, for obvious and very good reasons, that even de facto borders cannot be changed by force, will have been trampled on at the behest of the leader of the free world.  The Kremlin will have imposed terms via negotiators on a country it has violated, and whose people its troops have butchered, massacred and raped.  It is without doubt the biggest crisis in Trans-Atlantic relations since the war began, if not since the inception of NATO.  The question now is: are Europe's leaders up to meeting the daunting challenges that will follow. On past form, we cannot be sure. Read the full analysis here 11. Ukraine is eligible for EU membership and will receive short-term preferential access to the European market while this issue is being considered. 12. A powerful global package of measures to rebuild Ukraine, including but not limited to: - The creation of a Ukraine Development Fund to invest in fast-growing industries, including technology, data centres, and artificial intelligence. - The United States will cooperate with Ukraine to jointly rebuild, develop, modernise, and operate Ukraine's gas infrastructure, including pipelines and storage facilities. - Joint efforts to rehabilitate war-affected areas for the restoration, reconstruction and modernisation of cities and residential areas. - Infrastructure development. - Extraction of minerals and natural resources. - The World Bank will develop a special financing package to accelerate these efforts. 13. Russia will be reintegrated into the global economy: - The lifting of sanctions will be discussed and agreed upon in stages and on a case-by-case basis. - The United States will enter into a long-term economic cooperation agreement for mutual development in the areas of energy, natural resources, infrastructure, artificial intelligence, data centres, rare earth metal extraction projects in the Arctic, and other mutually beneficial corporate opportunities. - Russia will be invited to rejoin the G8.  14. Frozen funds will be used as follows: - $100bn (£76bn) in frozen Russian assets will be invested in US-led efforts to rebuild and invest in Ukraine; - The US will receive 50% of the profits from this venture. Europe will add $100bn (£76bn) to increase the amount of investment available for Ukraine's reconstruction. Frozen European funds will be unfrozen. The remainder of the frozen Russian funds will be invested in a separate US-Russian investment vehicle that will implement joint projects in specific areas. This fund will be aimed at strengthening relations and increasing common interests to create a strong incentive not to return to conflict. 15. A joint American-Russian working group on security issues will be established to promote and ensure compliance with all provisions of this agreement. 16. Russia will enshrine in law its policy of non-aggression towards Europe and Ukraine. 17. The United States and Russia will agree to extend the validity of treaties on the non-proliferation and control of nuclear weapons, including the START I Treaty. 18. Ukraine agrees to be a non-nuclear state in accordance with the Treaty on the Non-Proliferation of Nuclear Weapons. 19. The Zaporizhzhia Nuclear Power Plant will be launched under the supervision of the IAEA, and the electricity produced will be distributed equally between Russia and Ukraine - 50:50. 20. Both countries undertake to implement educational programmes in schools and society aimed at promoting understanding and tolerance of different cultures and eliminating racism and prejudice: - Ukraine will adopt EU rules on religious tolerance and the protection of linguistic minorities. - Both countries will agree to abolish all discriminatory measures and guarantee the rights of Ukrainian and Russian media and education. - All Nazi ideology and activities must be rejected and prohibited. 21. Territories: - Crimea, Luhansk and Donetsk will be recognised as de facto Russian, including by the United States. - Kherson and Zaporizhzhia will be frozen along the line of contact, which will mean de facto recognition along the line of contact. - Russia will relinquish other agreed territories it controls outside the five regions. Read moreAnalysis: Why Zelenskyy has to tread carefully over peace plan, or face a Trump ultimatumAnalysis: What deleted post reveals about 'secret' plan to end Ukraine war - Ukrainian forces will withdraw from the part of Donetsk Oblast that they currently control, and this withdrawal zone will be considered a neutral demilitarised buffer zone, internationally recognised as territory belonging to the Russian Federation. Russian forces will not enter this demilitarised zone. 22. After agreeing on future territorial arrangements, both the Russian Federation and Ukraine undertake not to change these arrangements by force. Any security guarantees will not apply in the event of a breach of this commitment. 23. Russia will not prevent Ukraine from using the Dnieper [Dnipro] River for commercial activities, and agreements will be reached on the free transport of grain across the Black Sea. 24. A humanitarian committee will be established to resolve outstanding issues: - All remaining prisoners and bodies will be exchanged on an 'all for all' basis. - All civilian detainees and hostages will be returned, including children. - A family reunification program will be implemented. - Measures will be taken to alleviate the suffering of the victims of the conflict. 25. Ukraine will hold elections in 100 days. 26. All parties involved in this conflict will receive full amnesty for their actions during the war and agree not to make any claims or consider any complaints in the future. 27. This agreement will be legally binding. Its implementation will be monitored and guaranteed by the Peace Council, headed by President Donald J Trump. Sanctions will be imposed for violations. 28. Once all parties agree to this memorandum, the ceasefire will take effect immediately after both sides retreat to agreed points to begin implementation of the agreement."
    },
    {
        "title": "Energy minister says 'there's no shortcut' to bringing down bills - as price cap rise announced",
        "description": "Households and businesses will have to wait for energy bills to fall significantly because \"there's no shortcut\" to bringing down prices, the energy minister has told Sky News.",
        "url": "https://news.sky.com/story/consumers-must-wait-for-energy-bills-to-fall-as-minister-says-theres-no-shortcut-13473274",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gas-gas-ring-fuel-cooking_7087558.jpg?20251121121925",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-21 00:01:00",
        "Headline": "The average annual energy bill will rise by 0.2% in January, despite wholesale costs falling.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Households and businesses will have to wait for energy bills to fall significantly because \"there's no shortcut\" to bringing down prices, the energy minister has told Sky News. Speaking as Chancellor Rachel Reeves considers ways of easing the pressure on households in next week's budget, energy minister Michael Shanks conceded that Labour's election pledge to cut bills by £300 by converting the UK to clean power has not been delivered. It comes as Ofgem announced the average annual energy bill will rise by 0.2% in January, despite wholesale costs falling. Major forecasters Cornwall Insight had predicted a 1% drop - but the energy regulator has moved in the opposite direction. Between January and March, the typical annual dual fuel bill will be £1,758 - up from the current £1,755 cap. The UK has the second-highest domestic and the highest industrial electricity prices among developed nations, despite renewable sources providing more than 50% of UK electricity last year. \"The truth is, we do have to build that infrastructure in order to remove the volatility of fossil fuels from people's bills,\" Mr Shanks said. \"We obviously hope that that will happen as quickly as possible, but there's no shortcut to this, and there's not an easy solution to building the clean power system that brings down bills.\" \n                  Will the government be lowering energy bills in the budget - and will taxes have to rise?\n                 \n                  Inflation slows to 3.6%, but food costs shoot upwards\n                 \n                  ExxonMobil to close Mossmorran plastics plant in Fife with hundreds of jobs at risk\n                 His comments come amid growing scepticism about the compatibility of cutting bills as well as carbon emissions, and growing evidence that the government's pursuit of a clean power grid by 2030 is contributing to higher bills. While wholesale gas prices have fallen from their peak following the Russian invasion of Ukraine in 2022, energy bills remain around 35% higher than before the war, inflated by the rising cost of reducing reliance on fossil fuels. The price of subsidising offshore wind and building and managing the grid has increased sharply, driven by supply chain inflation and the rising cost of financing major capital projects. In response, the government has had to increase the maximum price it will pay for offshore wind by more than 10% in the latest renewables auction, and extend price guarantees from 15 years to 20. The auction concludes early next year, but it's possible it could see the price of new wind power set higher than the current average wholesale cost of electricity, primarily set by gas. Renewable subsidies and network costs make up more than a third of bills and are set to grow. The cost of new nuclear power generation will be added to bills from January. The government has also increased so-called social costs funded through bills, including the warm home discount, a £150 payment made to around six million of the least-affluent households. Gas remains central to the UK's power network, with around 50 active gas-fired power stations underpinning an increasingly renewable grid, and is also crucial to pricing. Because of the way the energy market works, wholesale gas sets the price for all sources of electricity, the majority of the time. At Connah's Quay, a gas-fired power station run by the German state-owned energy company Uniper on the Dee estuary in north Wales, four giant turbines, each capable of powering 300,000 homes, are fired up on demand when the grid needs them. Energy boss: Remove policy costs from bills Because renewables are intermittent, the UK will need to maintain and pay for a full gas network, even when renewables make up the majority of generation, and we use it a fraction of the time. \"The fundamental problem is we cannot store electricity in very large volumes, and so we have to have these plants ready to generate when customers need it,\" says Michael Lewis, chief executive of Uniper. \"You're paying for hundreds of hours when they are not used, but they're still there and they're ready to go at a moment's notice.\" He agrees that shifting away from gas will ultimately reduce costs, but there are measures the government can take in the short term. \"We have quite a lot of policy costs on our energy bills in the UK, for instance, renewables incentives, a warm home discount and other taxes. If we remove those from energy bills and put them into general taxation, that will have a big dampening effect on energy prices, but fundamentally it is about gas.\" The chancellor is understood to be considering a range of options to cut bills in the short term, including shifting some policy costs and green levies from bills into general taxation, as well as cutting VAT. Read more from Sky News:What deleted post reveals about 'secret' plan to end Ukraine warStarmer preparing for China trip in new year Tories and Reform against green energy Stubbornly high energy bills have already fractured the political consensus on net zero among the major parties. Under Kemi Badenoch, the Conservatives have reversed a policy introduced by Theresa May. Shadow energy secretary Claire Coutinho, who held the post in the last Conservative government, explained why: \"Net zero is now forcing people to make decisions which are making people poorer. And that's not what people signed up to. \"So when it comes to energy bills, we know that they're going up over the next five years to pay for green levies. \"We are losing jobs to other countries, industry is going, and that not only is a bad thing for our country, but it also is a bad thing for climate change.\" Reform UK, meanwhile, have made opposition to net zero a central theme. \"No more renewables,\" says Reform's deputy leader Richard Tice. \"They've been a catastrophe... that's the reason why we've got the highest electricity prices in the developed world because of the scandal and the lies told about renewables. \"They haven't made our energy cheaper, they haven't brought down the bills.\" Mr Shanks says his opponents are wrong and insists renewables remain the only long-term choice: \"The cost of subsidy is increasing because of the global cost of building things, but it's still significantly cheaper than it would be to build gas. \"And look, there's a bigger argument here, that we're all still paying the price of the volatility of fossil fuels. And in the past 50 years, more than half of the economic shocks this country's faced have been the direct result of fossil fuel crises across the world.\""
    },
    {
        "title": "Government borrowing third-highest record in October as people not spending - official figures",
        "description": "Government borrowing was higher than expected and consumers tightened their belts, spending less than anticipated, official figures show. ",
        "url": "https://news.sky.com/story/government-borrowing-third-highest-record-in-october-as-people-not-spending-official-figures-13473477",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-money-pounds_7028980.jpg?20250923031653",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-21 06:31:00",
        "Headline": "Less household spending and weaker consumer confidence suggest punters are bracing for bad budget news next week. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Government borrowing was higher than expected and consumers tightened their belts, spending less than anticipated, official figures show.  Government borrowing rose to the third-highest October level since records began in 1993, though less than a year ago, according to the Office for National Statistics (ONS). Money blog: Three reasons why unexpected rise in energy bills coming It's the last assessment of public finances we'll get before Chancellor Rachel Reeves makes her budget announcement next week. It showed spending on benefits and public services was up, which was offset by higher tax takes. Expensive borrowing Billions were spent on borrowing money last month, with interest payments costing central government £8.4bn. Reacting to the figures, the chancellor's deputy, James Murray, said: \"Currently we spend £1 in every £10 of taxpayer money on the interest of our national debt. \n                  Starmer refuses to rule out manifesto-breaking tax rises in budget\n                 \n                  Budget 2025: Consumer confidence falls as speculation ramps up - but London mayor welcomes major rail investment\n                 \n                  Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds\n                 \"That money should be going to our schools, hospitals, police and armed forces. That is why we are set to deliver the largest primary deficit reduction in both the G7 and G20 over the next five years - to get borrowing costs down.\"  While the numbers won't have a direct effect on the budget, with figures already submitted, it illustrates the difficult backdrop facing the chancellor, who's committed to maintaining her self-imposed fiscal rules to bring down government debt and balance the budget by 2030. It's unwelcome news for Ms Reeves. \"There was little good news for the chancellor in this morning's public finances release, with October borrowing in isolation running ahead of the [Office of Budget Responsibility] OBR's projections by £3.1bn, the second-highest overshoot so far in this fiscal year,\" said Pantheon Macroeconomics' senior UK economist Elliott Jordan-Doak. \"Borrowing has now overshot the fiscal watchdog's projections in four of the seven months so far this fiscal year.\" As a result of the fiscal bind, tax rises are widely expected to be announced next week. Public sector net borrowing reached £17.43bn, above the £15bn forecast by economists polled by Reuters. A slowdown in sales Retail sales - how much people are spending - shrank 1.1% in the half-term month too. No growth had been expected, rather than a contraction. This matters as retail sales figures measure household consumption, the largest expenditure in the UK economy. Consumers were holding back for Black Friday deals, retailers told the ONS. Along with weakened levels of consumer sentiment, the data paints a picture of worry about the impact of the budget. The long-running GfK consumer confidence index dropped this month, suggesting the public is waiting for difficult news."
    },
    {
        "title": "Curve investor files legal challenge to block £125m sale to Lloyds",
        "description": "The biggest external investor in Curve, the digital wallet provider, has filed a legal challenge aimed at overturning its &#163;125m sale to Lloyds Banking Group.",
        "url": "https://news.sky.com/story/curve-investor-files-legal-challenge-to-block-163125m-sale-to-lloyds-13473645",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lloyds-money-current-account_7079292.jpg?20251111151221",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-21 15:25:00",
        "Headline": "IDC Ventures, which holds a 12% stake in the digital wallet provider, has filed a High Court petition aimed at overturning its sale to Britain's biggest high street bank, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The biggest external investor in Curve, the digital wallet provider, has filed a legal challenge aimed at overturning its £125m sale to Lloyds Banking Group. Sky News has learnt that IDC Ventures issued a petition in the High Court on Friday seeking to overturn the deal, which was formally announced by Britain's biggest high street lender following months of negotiations. The legal claim alleges \"serious failures by key directors and investors\", including Curve founder and chief executive Shachar Bialick, and chairman Lord Fink. In it, IDC alleges that directors and Hanaco, another major Curve shareholder, had \"undermined shareholder rights, concealed material information and enabled Hanaco to secure disproportionate economic rights and voting control at the expense of other shareholders\", according to a statement issued by IDC to Sky News on Friday afternoon. It is the latest salvo in an escalating row between IDC Ventures and Curve, which Mr Bialick once predicted would attain a valuation of at least $50bn by the end of the decade. Sky News has previously reported that the distribution of the sale proceeds had sparked a major conflict between some of Curve's investors, with IDC Ventures' legal filing alleging that it had unjustly lost out. Sources said the deal involved a headline price of roughly £110m, with an earnout valued at about £15m on top of that sum. \n                  How hidden card service could save you hundreds\n                 \n                  Lloyds clinches £120m deal for digital wallet provider Curve\n                 \n                  Tech giants warn Reeves of IPO 'flight risk' over budget\n                 \"The claim sets out the intentional concealment of material information by certain parties from the board and shareholders, combined with breaches of contract and directors' duties, which caused financial distress that was then used to force through a highly favourable restructuring of voting rights in favour of Hanaco and directors aligned with it, to the detriment of other shareholders,\" IDC said in its statement. The furious shareholder said it did not believe the transaction was capable of being implemented without its support, and expressed surprise that \"Lloyds, a major UK institution, would choose to proceed with a transaction conducted under such circumstances and against the express objections of significant shareholders\". \"IDC believes that over £670m of shareholder value has been wiped out as a direct result of these actions. \"In IDC's view, no responsible purchaser could have overlooked these red flags, and Lloyds must have understood that it was benefitting from a valuation severely depressed by governance failures,\" it added. \"Lloyds was notified in writing of the governance concerns, the disputed decision-making process and the issues surrounding Hanaco's purported voting rights, yet it chose to simply ignore them and proceed with the transaction without regard to the legal dispute.\" Lloyds said earlier this week that the acquisition of Curve would allow it to offer its 28 million customers \"an enhanced payments experience within mobile banking\". IDC holds a 12% stake in Curve, having initially invested in it six years ago. It recently failed in an attempt to remove Lord Fink, the former Man Group boss, and Mr Bialick as directors of the company. Mr Bialick has previously acknowledged that the sale price was disappointing and warned the company would probably run out of money this year unless a sale to Lloyds was agreed. In total, Curve is understood to have raised at least £250m in funding since it was established. Curve declined to comment, while Lloyds has also been contacted for comment."
    },
    {
        "title": "Starmer refuses to rule out manifesto-breaking tax rises in budget",
        "description": "The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-manifesto-breaking-tax-rises-in-budget-13473641",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-interview_7087664.jpg?20251121143043",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:58:00",
        "Headline": "The prime minister would not be drawn on the contents of his government's second budget while speaking to Beth Rigby. Follow live coverage of the budget from 12.30pm on Wednesday with Sky News.",
        "Content": " The prime minister has refused to rule out manifesto-breaking tax hikes in next week's budget while speaking to Sky News's political editor Beth Rigby. Sir Keir Starmer was interviewed by Rigby while the pair were in South Africa for a meeting of the G20 group of nations. Despite the government last year indicating it was not going to raise more taxes, it appears that Wednesday's fiscal event will involve substantial increases in levies. The 2024 Labour manifesto said: \"We will ensure taxes on working people are kept as low as possible. \"Labour will not increase taxes on working people, which is why we will not increase national insurance, the basic, higher, or additional rates of income tax, or VAT.\" At the start of their interview, the prime minister was asked by Rigby if it was important for politicians to \"stick to their word\". Sir Keir said: \"Yes, it is important that politicians stick to their word. \n                  Government borrowing third-highest record in October as people not spending - official figures\n                 \n                  Budget 2025: Consumer confidence falls as speculation ramps up - but London mayor welcomes major rail investment\n                 \n                  Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds\n                 \"They have to make decisions against a political backdrop. And, we've also got big decisions to make in the budget that's coming in just a few days time.\" This caveat matches the expectations that a range of taxes are going to be increased so the government can keep its spending pledges and increase its fiscal headroom amid worsening economic headwinds. There was chaos last week after the reported increase in income tax that many had expected to be on the way was revealed to no longer be on the cards. Asked specifically on the manifesto commitment on tax, Sir Keir told Rigby that decisions will be made \"against a very difficult backdrop\". In total, the prime minister refused 12 times to rule out tax rises. Political editor No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. Read Beth Rigby's full analysis here He added it was \"important to take the right decisions for our country\". Rigby pointed out in the lead-up to the budget in 2024, the prime minister was more unequivocal, saying income tax, national insurance and VAT would not all go up. The prime minister declined to make the same promise, saying the decisions on tax will be announced on Wednesday.  Read more:Did Reeves pull off something extraordinary?Government borrowing higher than expectedWill energy bills be made cheaper? However, Sir Keir said the budget will be guided by \"principles\", including \"fairness\". The prime minister said the three areas he is \"bearing down on\" are the NHS, cutting national debt and dealing with the cost of living crisis. One tax rise that has not been ruled out is what is known as a \"stealth tax rise\" of freezing income tax thresholds. Rigby highlighted that in last year's budget, Rachel Reeves said freezing thresholds will \"hurt working people\" - and asked the prime minister if he agreed. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir said: \"We are going to set out our decisions. \"We will have absolutely in mind that the cost of living is the number one issue for people across the country.\" Pushed again, if working people will have their taxes increased, the prime minister instead mentioned he has people who are \"struggling with the cost of living\" in mind when making decisions."
    },
    {
        "title": "Starmer's political capital fading fast as he nears tax-raising budget",
        "description": "No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round.",
        "url": "https://news.sky.com/story/starmers-political-capital-fading-fast-as-he-nears-tax-raising-budget-13473684",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-budget-labour_7087778.jpg?20251121172846",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-21 17:25:00",
        "Headline": "The prime minister insists that this will be a budget where he will take the \"right decisions for the country\".",
        "Content": "\n          Political editor\n              @BethRigby\n  No sooner had the travelling broadcast pack set up outside for our short interviews with the prime minister at a railway depot in Johannesburg, than pouring rain, thunder and lightning began forcing the crews to decamp into a tin roof hanger for the broadcast round. It seemed like an apt metaphor for the storms Sir Keir Starmer is facing back home. Seventeen months into office, he has the lowest popularity ratings of any prime minister since records began, there is now open conversation in his party about whether he's right to lead Labour into the next general election, and he is heading into a very tempestuous budget in which he might end up breaking manifesto pledges to working people. Sir Keir steadfastly refused to recommit to the tax pledges he made in the election in our short interview on Friday. His operation is not impervious to the peril he is in. As the prime minister set off on his 45th overseas trip since taking office in July 2024, he and his team were at pains to stress that diplomacy and business done at the G20 in South Africa was all about bringing jobs and investment back home. On the way over on the plane, Starmer talked about the 200,000 jobs created by G20 countries in the UK as a way of explaining why these trips do matter back home. \n                  How No 10 plunged itself into crisis ahead of a perilous budget\n                 \n                  Labour's dilemma: The two-child benefit cap\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 And, on landing, the government announced £400m of export investment into the UK on the back of this trip. To hammer home the point, we interviewed the prime minister - and this matters because those pictures will be beamed into living rooms across the UK - at a train depot in Johannesburg, to highlight that these trains were partly manufactured in Alstom's factory in Derby, East Midlands. The message here is that the prime minister is focused on trade and business for the UK. The inclement backdrop is a reminder of the difficult days he has ahead - because it looks like Labour is about to break manifesto commitments on taxes.  A year ago, just days before the October 2024 Budget, the prime minister told me in an interview that he would stick to manifesto commitments: \"We made an absolute commitment that their [working people] income tax wouldn't go up, their national insurance wouldn't go up, their VAT wouldn't go up. I said that in the campaign, we're going to keep to those promises.\" When I asked him to repeat that promise ahead of the 2025 Budget, he refused 12 times to recommit to those pledges, saying only he would set out measures \"in full in just a few days\". He said when he was making decisions for those \"people who are struggling with the cost of living, who can't necessarily make ends meet\". One option is likely to be that the government freezes income tax brackets for an extra two years, which would raise around £10bn by dragging those on lower tax bands into higher ones as their wages rise with inflation. This measure would go against the pledge not to raise taxes on working people. Read more:Starmer refuses to rule out manifesto-breaking tax rises in budgetGovernment borrowing higher than expectedWill energy bills be made cheaper? Last year, Chancellor Rachel Reeves made a point of saying in her budget that she was not going to extend the threshold freeze (first introduced by the Conservatives because it would \"hurt working people\". These were her exact words to parliament in her budget speech last year: \"Having considered the issue closely, I have come to the conclusion that extending the threshold freeze would hurt working people. \"It would take more money out of their payslips. I am keeping every single promise on tax that I made in our manifesto. I say to working people, I will not increase your national insurance, I will not increase your VAT, I will not increase your income tax.\" So you can see why this budget is going to be so difficult.  The chancellor carried out the biggest tax-raising budget in a generation last year - £40bn of taxes raised - and is now coming back for more as the UK's productivity growth is downgraded by the fiscal watchdog, and the global headwinds worsen. She has to find around £7bn after U-turns on welfare cuts and the winter fuel allowance. From the botched welfare reforms, to the winter fuel allowance backlash and reversal before the summer break, to a tumultuous few weeks this autumn, Starmer's political capital is depleting fast as his MPs despair at his operation and his leadership. Since September, we have seen the resignation of Angela Rayner over her £40,000 underpayment of stamp duty, the sacking of Lord Mandelson over his friendship with convicted sex offender Jeffrey Epstein, Andy Burnham's leadership saga, the face-off between Number 10 and the health secretary and the pitch-rolling of now ditched income tax rises. Read more:Starmer calls for investigation into Reform-Russia linksEx-leader of Reform UK in Wales jailed for accepting Russian bribes This is not the calm and steady leadership that Starmer promised - and his poll ratings reflect public disappointment in his government. There is now an open discussion about whether he should lead the party into the next general election, and he is being asked this in interviews. He told me that he will continue, he will fight the next election and that \"he'll be judged at the next election on whether we have been able to make people feel better off\".  When I asked him about the chaos of his Number 10, he told me about rolling out free childcare and extending breakfast clubs and freezing prescription charges. He said: \"Given half the change, I want to explain the change we're bringing about, because some of this is really important change we are bringing for the country.\" I can sense his frustration, and he was clearly angry about the briefings about his future and criticisms of Wes Streeting as a potential challenger. \"Every minute that we're not talking about the cost of living is a wasted minute,\" he tells me in response to my litany of difficulties and self-forced errors that have bedevilled his government. But it is true, as he himself acknowledged at the G7 in Canada, that it is Starmer's job to tell the Labour story better and manage his team. He is clear in our interview that he wants to press on and change the country, and it was he who won the mandate from the British public to do that. The prime minister insists this will be a budget where he will take the \"right decisions for the country\" with NHS improvement and driving down the cost of living, now his guiding principles. He says he is optimistic about the future of the country. But the public, and his party, have lost all enthusiasm for his premiership, and next week's tax-raising budget can't be anything but loaded with risk."
    },
    {
        "title": "Will the government be lowering energy bills in the budget - and will taxes have to rise?",
        "description": "There is rampant speculation that the government might do something to bring down energy bills in the budget next week - but what could this look like, and will other taxes go up?",
        "url": "https://news.sky.com/story/will-the-government-be-lowering-energy-bills-in-the-budget-and-will-taxes-have-to-rise-13473582",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-energy-bill-money_6990304.jpg?20250814075801",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-11-21 11:58:00",
        "Headline": "Chancellor Rachel Reeves will be delivering the budget on 26 November, when taxes are widely expected to rise. But could energy bills be cut? Follow Sky News' coverage of the fiscal event on Wednesday.",
        "Content": "\n          Political reporter\n              @TimJ_B\n There is rampant speculation that the government might do something to bring down energy bills in the budget next week - but what could this look like, and will other taxes go up? The high rates people pay for heating and electricity is becoming a more salient issue as temperatures drop, and the confirmation the price cap is rising will do nothing to help public opinion on the topic. Energy bills are also rising as a direct result of government policy, including on net zero, with some criticising Energy Secretary Ed Miliband for his stalwart defence of the project. Politics latest: Follow live updates Technology Secretary Liz Kendall told Sky News that the government is looking at taking \"more action\" on the cost of living, when asked if bills were coming down. In their election manifesto last year, Labour promised to get energy bills down by £300 by 2030. Here's how this year's budget could work towards that. Remove VAT \n                  Energy minister says 'there's no shortcut' to bringing down bills - as price cap rise announced\n                 \n                  Inflation slows to 3.6%, but food costs shoot upwards\n                 \n                  ExxonMobil to close Mossmorran plastics plant in Fife with hundreds of jobs at risk\n                 Currently, bill payers have to fork out 5% of their charge in VAT. This would be an easy target for the government if it wants to knock a lump off everyone's bills, with estimates it could save people about £80 from their annual payments. Read more:'No shortcut' to cheaper bills, warns ministerBadenoch: 'get Britain drilling again'  However, there are warnings that this cut would benefit those who spend more on energy more than the poorest households, as it is a percentage tax - which might draw criticism for not aligning with the government's \"working people\" mantra. And with budgets tight, it is unlikely the government would be able to find the estimated £2.5bn in savings from axing VAT on energy, so tax would need to be raised elsewhere to account for it. Remove policy costs As Sky News business and economics correspondent Paul Kelso pointed out with the announcement of the rising price cap, wholesale energy prices have fallen. But household tariffs are going up because of government policy, according to Ofgem, Paul says, with taxpayers forking out for the Sizewell C nuclear power station, the warm homes discount and changes being made to the grid. Some think tanks and action groups have called for these payments to be moved off bills and into general taxation - like with VAT - in a bid to make those with the \"broadest shoulders\" carry more of the burden. Some estimates suggest moving policy payments off bills and to tax could save people again about £80 from their annual bill. Combined with the VAT change, this leaves a potential for about £160 to be knocked off the average yearly bill - but the money would be raised elsewhere from the expected tax rises. Changing net zero targets The most unlikely measure is a change to the government's net zero targets, but major changes to the policy could knock money off the average bill. The cost of reaching net zero by 2030 - a key goal of Mr Miliband - is borne out in bills as the reform is being paid through levies of energy bills. By delaying the 2030 target, it would allow costs to be spread over a longer period, with the trade-off being a longer period of time exposed to higher gas prices. If this was imposed on Mr Miliband by the Treasury, it would raise speculation about whether he could continue as energy secretary. There are a myriad of other problems with the energy system that are causing higher bill prices. One is curtailment costs - about £40 a year of every bill is paid to green energy producers to stop them making electricity. This is because the grid is so old it cannot transport power from areas like Scotland to the rest of the UK when a lot is being generated. This power also cannot be stored for reuse. Follow Cheat Sheet here The government is trying to resolve issues with the grid, but this is happening alongside net zero projects. The Treasury does not comment on budget speculation."
    },
    {
        "title": "From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding",
        "description": "Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him.",
        "url": "https://news.sky.com/story/from-xmas-gifts-to-piles-of-cash-how-ex-reform-mep-was-caught-doing-russias-bidding-13473671",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nathan-gill-mep-russia_7087319.jpg?20251121215441",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-21 16:18:00",
        "Headline": "Police say Nathan Gill, ex-leader of Reform UK Wales, would receive statements from his handler and repeat them, sometimes word for word, in public.",
        "Content": " Nathan Gill was at Manchester airport, about to board a flight to Russia, when accepting bribes finally caught up with him. Gill, the former leader of Reform UK Wales and a one-time member of the European Parliament, who on Friday was jailed for 10-a-half-years, was stopped by police before boarding and had his phone seized in 2021. While they interrogated him, his home in Anglesey was raided, with detectives discovering more electronics and cash piles of €5,000 (£4,400) and $5,000 (£3,800) respectively. The evidence on Gill's phone would damn him – he was in contact with a pro-Russian politician in Ukraine, Oleg Voloshyn, and had agreed to boost pro-Russia viewpoints in exchange for money. Voloshyn would dictate the statement, and Gill would repeat it – in some cases, almost word for word – in the media or the European Parliament. In one instance, Gill appeared on the now-banned Ukrainian TV channel, 112 Ukraine, which was known for its pro-Russian stance. In the interview, he was critical of the Ukrainian decision to open criminal proceedings against Viktor Medvedchuk, the owner of the television channel and a personal friend of Vladimir Putin. Speaking to the outlet, he said he was \"very concerned\" about the investigation, and wondered whether it was meant to silence \"opposition politicians\". Prosecutors said messages on Gill's phone showed that this was at his paymaster's instruction, with Voloshyn offering a \"reward\" if he would say that it was unacceptable to persecute a person for their political convictions. Read more:Reform UK's former Wales leader jailedTrump's 28-point Ukraine peace plan in full Voloshyn also offered the MEP €2,000 (£1,750) if he would express concern that Mr Medvedchuk could no longer mediate with Russia on Ukraine's behalf, the court heard. He added that \"V\" – understood to be Mr Medvedchuk – did not believe Ukrainian President Volodymyr Zelenskyy had \"true intentions to pursue a peace agenda\", prosecutors said. Sure enough, Gill appeared on 112 Ukraine saying it was \"very sad\" that Mr Medvedchuk felt he no longer had Mr Zelensky's backing to act as a mediator with Russia, and suggested that using him \"would be a sensible thing to do\". The messages traded in innuendo, referring to the exchange of \"Xmas gifts\" or \"postcards\" instead of money. But as the pair grew more comfortable with each other, they bargained more explicitly, with the sum of \"£5k\" quoted for Gill's work. Dominic Murphy, head of Counter Terrorism Command at the Met Police, said Gill had also offered access to other MEPs. \"This is where we get into that slightly odd situation where it feels very much like a real effort to undermine democracy here,\" he said. \"This is Nathan Gill reaching out to individuals that he knows, who are Brits, who might be willing to be paid to go and make speeches.\" Commander Murphy declined to name names, but said there was an ongoing investigation and that other people had been spoken to. None of the pro-Brexit MEPs Gill allegedly approached have been interviewed under caution. Police confirmed there was no evidence to suggest Reform UK leader Nigel Farage was involved. Gill was stopped at Manchester Airport on 13 September 2021, under schedule 3 of the Counter Terrorism and Borders Security Act 2019. He offered police no explanation for his actions and answered no comment in a March 2022 police interview. But the 52-year-old is believed to have had financial problems. Mr Murphy added that while Gill appeared to have pro-Russian sympathies, he was primarily motivated by money. The ex-MEP has been jailed for 10-and-a-half years after pleading guilty to eight counts of bribery between December 2018 and July 2019. Following an investigation by counter-terrorism police, officers said they believe Gill likely took a minimum of £40,000 in cash and was offering to introduce other British MEPs so they could be bribed. Voloshyn was picked up by the authorities on a trip to the US in 2021, which enabled the FBI to discover his end of the conversation. He is now believed to be in Russia, but has been sanctioned by the UK government over allegations of trying to destabilise Ukraine. He remains wanted in both Britain and Ukraine. A Reform UK spokesman said: \"Mr Gill's actions were reprehensible, treasonous and unforgivable. \"We are glad that justice has been served and fully welcome the sentence Nathan Gill has received.\" Mr Farage, the Reform UK leader, said: \"An investigation into Russian and Chinese influence over British politics would be welcome.\" The MP for Clacton previously described his former colleague as a \"bad apple\" and said he was \"shocked\" after Gill pleaded guilty to eight counts of bribery. He said: \"Any political party can find in their midst all sorts of terrible people. \"You can never, ever guarantee 100% that everyone you meet in your life, you shake hands with in the pub, is a good person.\""
    },
    {
        "title": "Shabana Mahmood – the new Margaret Thatcher?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>      ",
        "url": "https://news.sky.com/story/shabana-mahmood-8211-the-new-margaret-thatcher-13473109",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-21 05:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  The home secretary is going hard on immigration and she's taking a lot of people with her, not least Kemi Badenoch and the Reform party. Shabana Mahmood is using her identity - as a British Asian Muslim - to prove why she understands the migration problem in the country better than most. So how extreme are her new policies, modelled on the Danish system? Can she persuade the whole of Labour that they're not going too far, when they've spent years calling Tory policies \"racist\"? And as a tough, plain-speaking and passionate politician, is she the new Margaret Thatcher? And could she pose a threat to Sir Keir Starmer now the Labour Party is looking beyond him as leader? Plus - Harriet thinks the chancellor will scrap the two-child benefit cap entirely at next week's budget - but is that actually popular with the party? Or are Sir Keir and Rachel Reeves bending to the demands of their backbenchers? Remember, you can also watch Beth Rigby, Harriet Harman and Ruth Davidson on YouTube."
    },
    {
        "title": "'COP is a nightmare but best process we've got', says Ed Miliband as climate talks run into overtime",
        "description": "The UN climate talks are a \"nightmare\" but the \"best process we've got\", the UK energy secretary Ed Miliband told Sky News as the COP30 summit ran into overtime, with a showdown on fossil fuels looming.",
        "url": "https://news.sky.com/story/cop-is-a-nightmare-but-best-process-weve-got-says-ed-miliband-as-climate-talks-run-into-overtime-13473736",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-miliband-belem-brazil_7087990.jpg?20251121213234",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-21 22:09:00",
        "Headline": "Countries gathered in northern Brazil are still locked in a stand-off over a deal to wean the world off fossil fuels, the main cause of the climate crisis.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The UN climate talks are a \"nightmare\" but the \"best process we've got\", the UK energy secretary Ed Miliband told Sky News as the COP30 summit ran into overtime, with a showdown on fossil fuels looming. Countries gathered in northern Brazil are still locked in a stand-off over a deal to wean the world off fossil fuels, the main cause of the climate crisis. Other key sticking points are cash for developing countries to adapt to more extreme weather, like drought in Afghanistan, which they have generally done little to cause. But despite the divisions, UK energy secretary Ed Miliband told Sky News in Belem: \"The process is a nightmare, but it's the best process we've got.\" The annual COP talks are \"so hard\" because they see more than 190 countries negotiating over the future of their economies, oceans and forests, he said. But he pointed to achievements from the three decades of talks, including lowering expected global warming by a substantial margin, and the fact that around 80% of global GBP is now covered by a net-zero climate target. Mr Miliband said: \"So it's painful, it's painstaking, it makes you tear your hair out, but it does represent progress. \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                 \n                  COP30: Climate protest in Brazil's city of Belem aims to hold governments' feet to the fire\n                 \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \"This is a global problem; we've got to have global cooperation to tackle it.\" The two-week conference in the Amazon city of Belem was due to end at 6pm local time (9pm UK time) on Friday, but, like previous COP summits, looked set to run well into the weekend. Brazil's President Luiz Inacio Lula da Silva and about 80 countries, including the UK and coal-rich Colombia, are pushing for a plan on how to \"transition away from fossil fuels\".  This is a pledge all countries agreed to two years ago at COP28 - then did very little about since. But scores of countries - including major oil and gas producers like Saudi Arabia and Russia - see this push as too prescriptive or a threat to their economies. Read more:Cop out: Is net zero dead?Fire disrupts efforts to strike dealRecord for wind-powered energy in UK Mr Miliband said the UK was \"determined\" that COP30 produced a commitment to a so-called \"roadmap\" to phase out fossil fuels. He said: \"There are different ways of [weaning off fossil fuels], but it's got to happen, in our view.\" A draft version of the deal, which host country Brazil released on Friday morning after talks had been delayed by a fire, had dropped any of the options previously mentioned to tackle oil and gas."
    },
    {
        "title": "Teenagers plead not guilty to London transport cyber attack",
        "description": "Two teenagers have pleaded not guilty in connection with a cyber attack on Transport for London which cost millions of pounds.",
        "url": "https://news.sky.com/story/teenagers-plead-not-guilty-to-london-transport-cyber-attack-13473518",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tube-london-underground_7024175.jpg?20250918144714",
        "type": "Technology",
        "Author": "Adele Robinson",
        "Date Published": "2025-11-21 09:28:00",
        "Headline": "Thalha Jubair, 19, and Owen Flowers, 18, denied all charges over cyber attacks targeting London's public transport. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Two teenagers have pleaded not guilty in connection with a cyber attack on Transport for London which cost millions of pounds. Investigators believe the \"network intrusion\" in summer 2024 was carried out by the online criminal group known as Scattered Spider. Thalha Jubair, 19, from east London, and Owen Flowers, 18, from Walsall in the West Midlands, were arrested at their homes in September. They were detained as part of an operation by officers from the National Crime Agency (NCA) and City of London Police. Both have appeared before Southwark Crown Court and entered not guilty pleas to charges of conspiring together to commit unauthorised acts against Transport for London (TfL). They stood in the dock together and spoke only to confirm their names and enter not guilty pleas. Flowers and Jubair are both charged with conspiring to commit unauthorised acts against computer systems belonging to TfL between 29 August and 6 September 2024. \n                  Grooming gang victims being denied compensation because of criminal records\n                 \n                  From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding\n                 \n                  Starmer refuses to rule out manifesto-breaking tax rises in budget\n                 As part of that charge they are accused of \"causing, or creating a significant risk of, serious damage to human welfare and intending to cause such damage or being reckless as to whether such damage was caused.\" Flowers, who wore a black t-shirt and a grey jumper around his shoulders, is also accused of unauthorised acts against computer systems belonging to SSM Health and attempting to commit unauthorised acts against computer systems belonging to Sutter Health. Jubair, who appeared in the dock wearing a grey suit, is accused of failing to disclose the pin or passwords seized from him on 19 March 2025. A provisional trial date has been set for 8 June 2026 at Southwark Crown Court, with a pre-trial hearing on 13 February. TfL was targeted on 31 August 2024 by attackers who accessed customer data including names and contact details. The cyber incident did not cause any wider disruption to transport networks but has cost the operators millions of pounds in losses and recovery. At the time TfL described the attack as \"sophisticated\" and \"aggressive\" and were forced to shut down some areas of operation including traffic cameras, and \"dial a ride\" bookings. They were also unable to process some payments. Read more from Sky News:Plane crashes at Dubai air show, killing pilotMiss Mexico crowned Miss Universe 2025 In September, Paul Foster, head of the NCA's cyber crime unit, described the charges against Jubair and Flowers as a \"key step\" in a \"lengthy and complex investigation.\" \"This attack caused significant disruption and millions in losses to TfL, part of the UK's critical national infrastructure,\" he added. \"Earlier this year, the NCA warned of an increase in the threat from cyber criminals based in the UK and other English-speaking countries, of which Scattered Spider is a clear example. \"The NCA, UK policing and our international partners, including the FBI, are collectively committed to identifying offenders within these networks and ensuring they face justice.\" He also thanked TfL for their \"swift action\" in reporting the cyber attack and their \"engagement\" with the NCA on the investigation."
    },
    {
        "title": "BBC board member resigns - and criticises 'governance issues' at top of corporation",
        "description": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation.",
        "url": "https://news.sky.com/story/bbc-board-member-resigns-and-criticises-governance-issues-at-top-of-corporation-13473632",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shumeet-banerji-bbc_7087804.jpg?20251121190059",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-21 17:50:00",
        "Headline": "Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement.",
        "Content": "A BBC board member has resigned as he criticised \"governance issues\" at the top of the corporation. Shumeet Banerji notified the board of his resignation on Friday, the BBC said in a statement. It comes after the corporation's director-general Tim Davie and chief executive of BBC News Deborah Turness resigned earlier this month following a row over the editing of a Panorama documentary on Donald Trump. Mr Banerji cited \"governance issues\" at the top of the BBC as the reason for his resignation, saying in a letter he was \"not consulted\" about the events leading up to the resignations of Mr Davie and Ms Turness, BBC News reports. \"Mr Banerji's term on the board as a non-executive director was due to end at the end of December and we thank him for his service,\" a BBC spokesperson said. \"The search for a replacement is already well under way and we will update further in due course.\"  Mr Banerji was appointed to the BBC board as one of the non-executive directors in January 2022, with his term running until 31 December. \n                  Strictly Come Dancing star arrested on suspicion of rape\n                 \n                  BBC Children in Need chief Terrence Duddy resigns after seriously injuring cyclist in crash\n                 \n                  BBC 'determined to fight' any Trump legal action, chairman tells staff\n                 As part of his role, he was responsible for upholding and protecting the independence of the BBC by acting in the public interest, ensuring the board's decision-making was in the public interest, and exercising independent judgement, according to a profile on the corporation's website. Arts and entertainment correspondent They say timing is everything - and Shumeet Banerji's resignation could not have come at a more delicate moment for the BBC. Few outside media and governance circles would have known his name before he handed in his notice, yet his departure lands a significant blow at an especially awkward time.  On Monday, BBC chair Samir Shah and board member Sir Robbie Gibb are due to give evidence to the Culture, Media and Sport Committee. Instead of helping to steady the ship, Banerji's exit exposes the depth of the divisions they will now be expected to defend. The BBC's official line stresses that Banerji was already scheduled to step down in December, but his decision to leave earlier tells its own story. If, as reported, 'governance issues' contributed to his decision, then Samir Shah has reason to be concerned as it would seem it's not only critics from outside the organisation who are questioning his ability to lead. Mr Banerji founded advisory and investment firm Condorcet, which focuses on early and development stage technology companies. In 2012, he stepped down as chief executive of consulting firm Booz And Company. Mr Banerji is currently serving on the board of directors of several companies, including Hewlett-Packard Company.  Mr Banerji's resignation follows several tumultuous weeks at the corporation. Last week, the BBC issued an apology to Mr Trump for the edit of his speech on 6 January 2021, which had given the \"mistaken impression that President Trump had made a direct call for violent action\". Despite the apology, Mr Trump said he would sue the corporation for between $1bn and $5bn. Read more:BBC 'determined to fight' any Trump legal actionWhy Trump might struggle to win BBC lawsuit Several BBC board members will attend a hearing by the Culture, Media and Sport Committee on 24 November. The evidence session will focus on the BBC's editorial guidelines and standards committee and how it ensures the corporation's output complies with its editorial guidelines, Culture Secretary Lisa Nandy said in the Commons last week."
    },
    {
        "title": "Eurovision to change voting rules after claims of Israeli government 'interference'",
        "description": "The Eurovision Song Contest is changing its voting system, following allegations of \"interference\" by Israel's government this year.",
        "url": "https://news.sky.com/story/eurovision-to-change-voting-rules-after-claims-of-israeli-government-interference-13473662",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eurovision-israel-gaza_7017931.jpg?20250930212636",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-21 16:05:00",
        "Headline": "The reduction in the number of votes that can be made online, or via SMS or phone call, from 20 to 10 was \"designed to encourage more balanced participation\", said contest director Martin Green.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The Eurovision Song Contest is changing its voting system, following allegations of \"interference\" by Israel's government this year. Israeli singer Yuval Raphael received the largest number of votes from the public in the contest in May, ultimately finishing as runner-up after the jury votes were counted. But a number of broadcasters raised concerns about Israel's result. After the final, Irish broadcaster RTE requested a breakdown in voting numbers from contest organiser the European Broadcasting Union (EBU), while Spain's public broadcaster, Radio Television Espanola (RTVE), called for a \"complete review\" of the voting system to avoid \"external interference\". In September, Dutch public broadcaster AVROTROS said it could no longer justify Israel's participation in the contest, due to the Israel-Hamas war in Gaza. It went on to say there had been \"proven interference by the Israeli government during the last edition of the Song Contest, with the event being used as a political instrument\". The statement did not elaborate on the means of \"interference\". Sky News has contacted the Israeli government for comment. \n                  Eurovision emergency vote on Israel's inclusion is called off\n                 \n                  Why emergency Eurovision vote on Israel might not stop a broadcast boycott\n                 \n                  Could Eurovision boycotts over Israel lead to a competition crisis?\n                 In early December, the EBU will hold its winter general assembly, with members due to consider the changes, and if not satisfied, vote on Israel's participation. Key changes to next year's competition include: • Clearer rules around promotion of artists and their songs• Cap on audience voting halved• The return of professional juries to semi-finals• Enhanced security safeguards Read more: Could Eurovision boycotts over Israel lead to a competition crisis?  Sanctions threat The EBU said the tightening of rules around promotion was to \"discourage disproportionate promotion campaigns… particularly when undertaken or supported by third parties, including governments or governmental agencies\". It said that \"any attempts to unduly influence the results will lead to sanctions\". Contest director Martin Green said \"no broadcaster or artist may now directly engage with or support campaigns by third parties - including governments or their agencies - that could distort the vote\". He said the reduction in the number of votes that can be made online, or via SMS or phone call, from 20 to 10 was \"designed to encourage more balanced participation\". He said that \"although the number of votes previously allowed did not unduly influence the results of previous contests, there were concerns expressed by participating broadcasters and fans alike\". Professional juries in semi-finals - and younger jurors It was also announced that professional juries in the semi-finals would be restored for the first time since 2022, with an expansion to the range of professions from which jurors can be chosen. The EBU said this will give roughly 50-50 percentage weight between audience and jury votes. At least two jurors aged 18-25 will be present in every jury, to reflect the appeal of the contest with younger audiences. Also mentioned were enhanced technical safeguards designed to \"protect the contest from suspicious or coordinated voting activity\" and strengthen security systems that \"monitor, detect and prevent fraudulent patterns\". Politics making itself heard over Europop lyrics Mr Green said that the neutrality and integrity of the competition is of \"paramount importance\" to the EBU, its members, and audiences, adding that the event \"should remain a neutral space and must not be instrumentalised\". A vocally apolitical event, world events have dominated Eurovision in recent years. Russia was banned from the competition in 2022 following its invasion of Ukraine. Israel has competed in Eurovision for more than 50 years and won four times, but there have been ongoing calls to block their participation over the conduct of Prime Minister Benjamin Netanyahu's government in the Hamas-Israel war. Israel denies targeting civilians in Gaza and has said it is being unfairly demonised abroad. In September, Spain, the Netherlands, Ireland, Iceland, and Slovenia threatened to withdraw their participation in Eurovision unless Israel is excluded from the competition. There were also demonstrations against Israel's inclusion in Basel, Switzerland, when the 2025 competition took place. 'Step in right direction' Responding to the changes, Iceland's official broadcaster RUV told Sky News they were \"a step in the right direction\", and they would be discussing them with their \"sister stations in the Nordic countries\" ahead of the EBU meeting in December. Ireland's official broadcaster RTE told Sky News: \"Clearly, events in the Middle East are unfolding day by day. As previously confirmed by the EBU, the issue of participation in the 2026 Eurovision Song Contest has been included on the agenda of the EBU Executive Board's ordinary Winter General Assembly.\" Sky News has also contacted the official broadcaster for the Netherlands (AVROTROS), Spain (RTVE), Slovenia (RTVSLO), and Israel (Kan) for comment. The chief executive of Kan, Golan Yochpaz, has previously said the event should not become political and that there is \"no reason\" why Israel should not be part of it. Netanyahu praised Israeli entrant Earlier this year, Israeli Prime Minister Benjamin Netanyahu told Israel's 2025 Eurovision entrant Yuval Raphael she had brought the country \"a lot of honour\" after she finished in second place, adding \"you're the real winner. Statistically, it's true… You entered the hearts of a huge portion of the public in Europe.\" The year before he told entrant Eden Golan: \"I saw that you received almost the highest number of votes from the public and this is the most important thing, not from the judges but from the public, and you held Israel's head up high in Europe.\" In October, a ceasefire deal was put in place, aimed at bringing an end to the two-year war in the Middle East. The war began when Hamas stormed into Israel on October 7 2023, killing around 1,200 people and taking 251 hostage. Israel invaded Gaza in retaliation, with airstrikes and ground assaults devastating much of the territory and killing more than 67,000, according to the Hamas-run health ministry. Its figures do not differentiate between civilians and combatants, but it says around half of those killed were women and children. The world's largest live music event, next year's contest will be held in Vienna, Austria, in May and will celebrate 70 years of Eurovision."
    },
    {
        "title": "Strictly Come Dancing star arrested on suspicion of rape",
        "description": "A Strictly Come Dancing star has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/strictly-come-dancing-star-arrested-on-suspicion-of-rape-13473436",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-strictly-come-dancing_7001870.jpg?20250826170125",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-21 02:26:00",
        "Headline": "The BBC show has faced several controversies in recent months - with Tess Daly and Claudia Winkleman confirming they're stepping down as presenters.",
        "Content": "A Strictly Come Dancing star has been arrested on suspicion of rape. According to The Sun, the man was detained last month over an incident that allegedly happened in 2024. He cannot be named for legal reasons. It is understood that the woman who made the complaint was not a contestant or professional dancer on the BBC programme.  Hertfordshire Police has confirmed an arrest took place in London on 13 October, and he was later released on bail as an investigation continues. A BBC spokesperson said: \"It would not be appropriate to comment on an ongoing police investigation.\" However, a source within the corporation told the newspaper that it is an \"absolute nightmare\" for the BBC and \"a heartbreaking situation\". They added: \"Bosses have done their utmost to steady the ship and make the show as scandal-free as possible, and yet now this has happened. \n                  BBC board member resigns - and criticises 'governance issues' at top of corporation\n                 \n                  BBC Children in Need chief Terrence Duddy resigns after seriously injuring cyclist in crash\n                 \n                  BBC 'determined to fight' any Trump legal action, chairman tells staff\n                 \"The BBC is taking this very ­seriously and will absolutely offer support to all concerned.\"  This arrest comes three months after another male Strictly star was also arrested on suspicion of rape. The man in his 30s, who has not been named, faces a separate alleged offence of \"non-consensual intimate image abuse\". Strictly Come Dancing - one of the BBC's biggest entertainment shows - has faced several controversies of late. Over the summer, an external law firm was fired to investigate claims that two of the programme's stars had taken cocaine. Last year, the BBC apologised to Sherlock actress Amanda Abbington, who had accused her dancing partner of verbal bullying and harassment. \"Some, but not all\" of the allegations were upheld against Giovanni Pernice. He has denied \"threatening or abusive behaviour\" - and claimed the complaints had been made to destroy his career. Read more from Sky News:The Stone Roses bassist Mani diesCan novels survive the AI revolution? Welsh opera singer Wynne Evans, who competed in 2024, also apologised for making an \"inappropriate and unacceptable\" remark to a woman during the show's live tour launch. Last month, Strictly presenters Tess Daly and Claudia Winkleman jointly announced they will be leaving the show at the conclusion of the current series - and passing on \"the very sparkly baton\" to new hosts."
    },
    {
        "title": "Pras Michel: Fugees rapper 'who betrayed US for money' is jailed for 14 years",
        "description": "A Grammy-winning rapper who \"betrayed his country for money\" has been sentenced to 14 years in prison.",
        "url": "https://news.sky.com/story/pras-michel-fugees-who-betrayed-us-for-money-is-jailed-for-14-years-13473440",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pras-michel-fugees_7087218.jpg?20251121033259",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-21 03:17:00",
        "Headline": "Prosecutors said Michel \"lied unapologetically and unrelentingly to carry out his actions\" - and sought to deceive the White House, senior politicians and the FBI for almost a decade.",
        "Content": "A Grammy-winning rapper who \"betrayed his country for money\" has been sentenced to 14 years in prison. Prakazrel \"Pras\" Michel, who was part of 1990s hip-hop group The Fugees, was convicted of illegally funnelling millions of dollars in foreign contributions to Barack Obama's re-election campaign in 2012. The Justice Department had accused the 53-year-old of accepting $120m (£92m) from Malaysian financier Low Taek Jho, who wanted to gain political influence in the US. Prosecutors said Michel \"lied unapologetically and unrelentingly to carry out his actions\" - and sought to deceive the White House, senior politicians and the FBI for almost a decade. In 2018, it is claimed he urged the Trump administration and the justice department to drop embezzlement investigations against Low. Michel was convicted of 10 counts by a federal jury in 2023 - and last month, he was ordered to forfeit about $65m (£50m) for his role in the scheme. Hollywood star Leonardo DiCaprio testified at the trial, and Low was a primary financier in his 2013 film The Wolf Of Wall Street. \n                  Billion-pound money laundering network operating in 28 towns and cities in UK\n                 \n                  'Prolific and depraved' child rapist who sold abuse images jailed\n                 \n                  Ex-East Dunbartonshire Council leader Andrew Polson jailed for romance fraud and stealing money from Christian radio station\n                 The Oscar-winning actor said the businessman's funding and legitimacy had been carefully vetted before they entered a partnership. Prosecutors had been seeking a life sentence to \"reflect the breadth and depth of Michel's crimes, his indifference to the risks to his country, and the magnitude of his greed\". However, the rapper's lawyer Peter Zeidenberg has argued that the 14-year term is \"completely disproportionate to the offence\" - and is vowing to appeal. Last year, a judge rejected Michel's request for a new trial after claiming that one of his lawyers had used AI during closing arguments. Read more from Sky News:Strictly star 'arrested on suspicion of rape'The Stone Roses bassist Mani dies aged 63 Low Taek Jho has been accused of having a central role in the 1MDB scandal, amid claims billions of dollars were stolen from a Malaysian state fund. The 44-year-old is a fugitive but has maintained his innocence, with his lawyers writing: \"Low's motivation for giving Michel money to donate was not so that he could achieve some policy objective. \"Instead, Low simply wanted to obtain a photograph with himself and then President Obama.\" Michel, who was born in Brooklyn, was a founding member of The Fugees with childhood friends Lauryn Hill and Wyclef Jean - selling tens of millions of records."
    }
]