[
    {
        "title": "Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'",
        "description": "Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country.",
        "url": "https://news.sky.com/story/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa-13372206",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-cyril-ramaphosa_6923546.jpg?20250521193348",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:56:00",
        "Headline": "The US president says \"people are fleeing South Africa for their own safety... their land is being confiscated and in many cases they're being killed\". But Cyril Ramaphosa pushed back against Mr Trump's accusations.",
        "Content": " Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of more than a thousand white farmers and \"it's a terrible sight... I've never seen anything like it. Those people are all killed\". After an initial friendly chat where Mr Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: \"I'd like to know where that is because this [the alleged burial site in the video] I've never seen\". The lights were dimmed in the Oval Office as the clips were shown, including of South African officials allegedly calling for violence against white farmers. The scene in the heart of the White House administration was reminiscent of Mr Trump's ambush of Ukraine's President Volodymyr Zelenskyy in February. But later, as he left after around three hours at the White House, Mr Ramaphosa insisted his meeting with Mr Trump went \"very well\". And he told a news conference: \"There is just no genocide in South Africa.\" The White House's official account on X posted the footage that was shown in the Oval Office, saying it was \"proof of persecution in South Africa\". South Africa has rejected the allegation that white people are disproportionately targeted by crime. The clips included one of communist politician Julius Malema playing a controversial anti-apartheid song that includes lyrics about killing a farmer.  Mr Trump accused South Africa of failing to address the killing of white farmers. \"We have many people that feel they're being persecuted, and they're coming to the United States. So we take from many... locations, if we feel there's persecution or genocide going on,\" the US president said, referring specifically to white farmers. He added: \"People are fleeing South Africa for their own safety. Their land is being confiscated and in many cases they're being killed.\" Alluding to people in the clips, Mr Trump said: \"These are people that are officials and they're saying... kill the white farmer and take their land.\" The US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying \"death, death\" as he flipped through them. He added of one article: \"Here's burial sites all over the place, these are all white farmers that are being buried.\" South African leader rejects allegations Mr Ramaphosa pushed back against Mr Trump's accusations, by responding: \"What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies. \"And in many cases, or in some cases, those policies do not go along with government policy. \"Our government policy is completely, completely against what he [a person in the video montage] was saying, even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\" Read more from Sky News:Ex-Ukrainian politician living abroad shot dead on school runThe soldiers faced with 'raining bullets' from violent gangs Africa correspondent The screens, the visuals and President Trump's foreshadowing mentions of a \"bloodbath\" all point to one thing - this ambush was planned. As the yells of anguish and violent rhetoric echoed in the Oval Office, President Ramaphosa craned his neck with a stern expression to watch the \"evidence\" of a repeatedly disproven \"white genocide\" in his country. He interjected only to question the location of the videos - to which Mr Trump replied, almost with a \"duh\" tone of voice, \"South Africa\" - and then pushed on to direct his team to verify them. That was the singular point of outright defiance from South Africa's leader in an uncomfortable meeting where facts were dismissed as a difference in opinion and outdated videos were played as breaking news. For the rest of the meeting, Nelson Mandela's former chief negotiator kept calm and played the charm offensive - appealing to Mr Trump's ego at every sharp turn while maintaining that black South Africans are disproportionately impacted by the country's harrowing murder rate. The charm and calm may seem like dull knives in this sword fight but are necessary for peacekeeping in a meeting where £6bn in trade hangs in the balance. South Africa has the most to lose in the deteriorating bilateral relations. In just five months, the Trump administration has cut off vital humanitarian aid, including HIV assistance of which South Africa is the biggest beneficiary; expelled South Africa's ambassador; and offered white South Africans refugee status as millions of black Africans suffer across the continent.  The potential futility of Mr Ramaphosa's strategy came into vision as cameras panned to the back of the Oval Office at the end of the meeting to show a stony-faced Elon Musk. The false claims of white genocide Musk has championed on X are now a powder keg in US-South African relations, as he works to get Starlink licensed in his home country. A business strategy that even South Africa's iconic negotiator may not be able to contend with. Mr Ramaphosa also said of the behaviour alleged by Mr Trump: \"We are completely opposed to that.\" The South African leader said there was crime in his country, and the majority of victims were black. Mr Trump cut him off and said: \"The farmers are not black.\" The South African president responded: \"These are concerns we are willing to talk to you about.\" In February, Mr Trump issued an executive order which cut all funding to South Africa over some of its domestic and foreign policies. He also expelled South Africa's ambassador and offered refuge to white minority Afrikaners based on racial discrimination claims which Pretoria says are baseless. Experts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate."
    },
    {
        "title": "UK calls for investigation after IDF fired warning shots as British diplomats travelled through West Bank",
        "description": "The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank.",
        "url": "https://news.sky.com/story/uk-calls-for-investigation-after-idf-fired-warning-shots-as-british-diplomats-travelled-through-west-bank-13372358",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-west-bank-israel_6923441.jpg?20250521165900",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 22:06:00",
        "Headline": "Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday.",
        "Content": " The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank. Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday. All four countries have condemned the shooting, which comes after Western nations criticised Israel's latest offensive in Gaza. Two British diplomats are understood to be among the group of around 20 people who have been confirmed as safe following the incident in the Israeli-occupied West Bank. Footage shows the moment members of the delegation were gathered outside before fleeing the scene as the gunshots rang out. Foreign Office minister Hamish Falconer has described the incident in Jenin as \"unacceptable\". He wrote on X: \"I have spoken to our diplomats who were affected. Civilians must always be protected, and diplomats allowed to do their jobs. There must be a full investigation and those responsible should be held accountable.\" \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Donald Trump confronts South African president Cyril Ramaphosa with genocide claims\n                 \n                  Australia floods: Natural disaster declared in New South Wales as four months of rain falls in just two days\n                 Follow latest: Gaza conflict live updates In response to the situation, UK Foreign Secretary David Lammy has announced measures, including financial restrictions and travel bans, targeting prominent settler leader Daniella Weiss and two other individuals. The measures also target two illegal outposts and two organisations accused of backing violence against Palestinian communities. It came after Ireland's deputy premier Simon Harris condemned the shooting in \"the strongest terms\" and France's foreign minister Jean-Noel Barrot said he would summon the Israeli ambassador over the incident. Meanwhile, Turkey's foreign ministry said the shooting showed Israel's \"systematic disregard for international law\" and called for an immediate investigation. Germany's foreign office had earlier condemned what it referred to as \"unprovoked gunfire\", adding: \"We are fortunate that nothing worse occurred.\" The Israeli military said the delegation had \"deviated from the approved route\" of their visit and Israel Defence Force (IDF) soldiers fired warning shots to push them from the area. The IDF apologised and said it would contact all countries involved in the visit. The shooting took place a day after the UK announced it would cease all talks of a trade deal with Israel, and summoned the country's ambassador to make clear Britain is unhappy with the situation in Gaza. Hospitals in northern Gaza encircled by IDF Elsewhere, staff and aid groups have said that two of northern Gaza's last functioning hospitals have been encircled by Israeli troops - preventing anyone from entering or leaving. The Indonesian and al Awda hospitals are among the region's only remaining medical facilities, with both coming under fire this week. Tedros Adhanom Ghebreyesus, the director general of the World Health Organisation, has warned Israel's military operations and evacuation orders \"are stretching the health system beyond the breaking point\". Just 20 of the territory's 36 hospitals remain partially functioning - with centres in northern Gaza now said to be \"at a serious risk of shutting down completely\". According to the WHO, there have been almost 700 attacks on medical facilities since the war began. Israel's military has accused Hamas of using hospitals as command centres and to hide fighters, but has only provided evidence for some of these claims. Read more:British doctor in Gaza describes horrorIsrael has gone 'beyond just self-defence', minister says  UK unveils new aid package to Gaza Elsewhere, UK ministers announced they will send £4m of aid to Gaza, including essential medicines, safe drinking water and food parcels. Minister for development Jenny Chapman, who is visiting Israel and the occupied territories, said the lack of aid reaching Gazans is \"appalling\". She added: \"The Israeli government's failure to allow full humanitarian access to aid workers is abhorrent. Far too few trucks are crossing into Gaza. \"The UN has warned nearly half a million Palestinians, including children, are facing starvation. \"The UK is clear - Israel will not achieve security through prolonging the suffering of the Palestinian people.\" It comes as British Prime Minister Sir Keir Starmer said humanitarian aid needs to get into Gaza \"at pace\". On Wednesday, Downing Street did not rule out more sanctions on Israeli ministers after a report said Number 10 and other countries were drawing up plans to target key figures in Israeli Prime Minister Benjamin Netanyahu's government. Sir Keir's official spokesman said he would not speculate on future sanctions but added it has been made clear that if Israel does not cease its military offensive and lift aid restrictions then the UK will take further \"concrete actions\". The shooting in the West Bank came hours before the Israeli military said 100 aid trucks carrying flour, baby food and medical equipment had travelled from the Kerem Shalom crossing into Gaza. The transfer of aid into Gaza has become an increasingly controversial topic over the last couple of days as the international community fears the territory is on the brink of famine. The UN said earlier that no aid has been distributed in Gaza since Mr Netanyahu said an 11-week blockade on the territory had been lifted. On Wednesday evening, the Israeli prime minister held a news conference where he said he would not allow European leaders to \"influence\" Israel after he was asked about the diplomatic row over the gunfire in Jenin and the humanitarian crisis in Gaza. \"We have to complete the war,\" Mr Netahayu said. \"We are going to continue what is needed to end the war.\" He said it was a \"mark of shame\" that Britain was sanctioning Israel and not Hamas, calling the sanctions an \"absolutely horrible thing\"."
    },
    {
        "title": "Spurs beat Manchester United to win Europa League",
        "description": "Tottenham Hotspur have won the Europa League after beating Premier League rivals Manchester United 1-0 in the final.",
        "url": "https://news.sky.com/story/spurs-beat-man-utd-to-win-europa-league-13372205",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-heung-min-son-spurs_6923700.jpg?20250521222744",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 20:13:00",
        "Headline": "Brennan Johnson's scrappy goal in the 42nd minute gave Ange Postecoglou's team a 1-0 victory, which secured them a place in next season's prestigious Champions League.",
        "Content": " Tottenham Hotspur have won the Europa League after beating Premier League rivals Manchester United 1-0 in the final. Brennan Johnson's scrappy 42-minute goal gave Ange Postecoglou's team the win and a spot in next season's Champions League, which is set to bring the north London club a £100m windfall. Spurs were thankful for Micky van de Ven's second-half goal-line clearance and keeper Guglielmo Vicario's stoppage-time save. The club have endured a disappointing top-flight campaign, currently sitting in 17th place in the domestic league, but the victory in Bilbao, Spain, means they have secured a place in Europe's premier club competition and salvaged their season. It is the first time Tottenham have won a trophy since the League Cup in 2008, and it is their first European title since the UEFA Cup in 1984. Beaming boss Postecoglou silenced the critics - at least temporarily - as he stuck to his word by winning a trophy in his second season. Last September, the head coach stated: \"I'll correct myself - I don't usually win things, I always win things in my second year. Nothing's changed. \"I've said it now. I don't say things unless I believe them.\" Tottenham goalscorer Johnson told TNT Sport after the team's triumph: \"I'm so happy right now. This season hasn't been good, but not one of us players cares right now. \"This is what it's all about... it means so much. All the fans get battered, we get battered for not winning a trophy, but to get the first one in a while today, I'm so happy. \"Ever since I came here, it's been 'Tottenham are a good team but never get it done'. We got it done.\" Read more from Sky News:Liverpool win Premier League to equal Man Utd's recordNewcastle United end 70-year wait for domestic trophyCrystal Palace celebrate historic FA Cup victory Meanwhile, United, who currently lie 16th in the Premier League, will now have a season without European football for the first time since 2014-15. The Red Devils had remained unbeaten in the Europa League ahead of Wednesday's final at the San Mames stadium. But manager Ruben Amorim's already tough job of rebuilding the team now becomes that much harder without Champions League qualification. This season has been United's worst top-flight campaign since suffering relegation 51 years ago."
    },
    {
        "title": "M&S website down - hours after financial impact of ransomware attack revealed",
        "description": "The M&S website is down - hours after the retailer revealed it's facing a &#163;300m hit to profits following last month's ransomware attack.",
        "url": "https://news.sky.com/story/ms-website-down-hours-after-financial-impact-of-ransomware-attack-revealed-13372433",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-m-and-s-marks-and-spencer_6923742.jpg?20250521233206",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 23:02:00",
        "Headline": "M&S recently warned that disruption could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\".",
        "Content": "The M&S website is down - hours after the retailer revealed it's facing a £300m hit to profits following last month's ransomware attack. A holding page told customers that they are currently unable to browse the site, adding: \"We're making some updates and will be back soon.\" Online purchases have been suspended since the incident on 22 April, and it may be a couple of weeks before services are partially restored. Sky News understands that the maintenance is routine.  M&S recently warned that disruption to its operations could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\". It is widely believed the retailer fell victim to Scattered Spider, a hacking group that has also been linked to similar attacks targeting The Co-op and Harrods. Last week, M&S also admitted personal data belonging to some of its customers has been stolen - but the company stressed this didn't include \"usable payment or card details\". \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 \n                  Money blog: House prices rising at fastest pace since 2022 - with these regions growing most\n                 Passwords were also not affected, but there are reports that contact details such as names, addresses and phone numbers was taken. The company's valuation has plunged by more than £1bn as the fallout deepens. \"This incident is a bump in the road, and we will come out of this in better shape, and continue our plan to reshape M&S for customers, colleagues and shareholders,\" Mr Machin told analysts on Wednesday."
    },
    {
        "title": "Gordon Brown suggests people on top rate of income tax should be excluded from winter fuel",
        "description": "Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said.",
        "url": "https://news.sky.com/story/gordon-brown-suggests-people-on-top-rate-of-income-tax-should-be-excluded-from-winter-fuel-13372219",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gordon-brown-former-prime-minister_6754753.jpg?20241122184723",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 16:00:00",
        "Headline": "The former prime minister, who introduced winter fuel as a universal benefit when chancellor, said there is a strong case for it, but suggests society's richest pensioners could be exempt. ",
        "Content": " Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said. The former Labour prime minister told Sky News' Sophy Ridge that he welcomed Sir Keir Starmer's backtrack over his unpopular decision to means-test the allowance, which Mr Brown introduced as a universal benefit when he was chancellor in 1997. Politics live: Starmer confirms U-turn on winter fuel payments - but No.10 will not say when Asked if he thought the U-turn was the right move, he said: \"Yeah. I think what Keir's saying is the economy has improved and he feels that the country is in a better position, that they can afford to do better by the pensioner community. \"You must be fair to the different communities in your country when they're struggling... and you've got to be fair to pensioners.\" Mr Brown added there is \"a strong case\" for winter fuel payments for pensioners, but suggested the richest in society could be exempt. \"I did bring it in as a universal benefit,\" he said. \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Sir Tony Blair and Gordon Brown lead tributes to Lord Prescott at his funeral\n                 \n                  Justice secretary's assisted dying intervention is explosive - and potentially embarrassing for PM\n                 \"I think there is a case, for example, for people on the top rate of tax not receiving it, but that's something the government has got to decide. \"That was in the Labour 2015 manifesto, so I think the government's got decisions to make... but to me, the issue is nobody should be pushed into poverty if they're doing the right thing. \"Nobody who's working hard or nobody who's served the country well over their lifetime should be pushed into poverty if we can avoid it, and I believe that that's what he's [Keir] is really thinking about, a fairness guarantee for pensioners.\" Sir Keir announced that he would \"look\" at making more pensioners eligible during PMQs earlier on Wednesday. He told MPs: \"I recognise that people are still feeling the pressure of the cost of living crisis, including pensioners. \"As the economy improves, we want to make sure people feel those improvements in their days as their lives go forward. \"And that is why we want to ensure that as we go forward, more pensioners are eligible for winter fuel payment.\" While it appears a full reversal will not be implemented, the Treasury could raise the threshold at which pensioners can qualify for winter payments, which is currently £11,500. Read More:Why Keir Starmer's strategy to tackle Reform UK could end up backfiringBrexit wounds' mean EU states want to limit UK's access to rearmament fund The decision follows significant backlash from Labour MPs, who blamed the policy on the party's poor performance at the local elections this month. Means-testing the winter fuel payments, worth up to £300, was one of the first policies brought in by the Labour government. Overall, the number of pensioners eligible for the payment was slashed from 11.4 million to 1.5 million. The government argued it would save £1.5bn each year and put the public finances under control, after claiming the Tories left behind a larger-than-expected fiscal black hole of £22bn. However, in the aftermath of the May local elections - which saw Labour lose 189 council seats - more high-profile party figures began speaking out against the policy."
    },
    {
        "title": "UK weather: Tornado and funnel cloud could hit parts of country, Met Office forecaster warns",
        "description": "A tornado could batter parts of the UK, experts are warning - as southern England endures heavy rain following the driest start to spring in decades.",
        "url": "https://news.sky.com/story/uk-weather-tornado-and-funnel-cloud-could-hit-parts-of-country-today-met-office-forecaster-warns-13371907",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-uk-weather-rain-file_6923363.jpg?20250521154532",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:06:00",
        "Headline": "Met Office meteorologist Alex Burkill said it is \"not out of the question that we could see a funnel cloud, maybe even a brief tornado\" across parts of South East England on Wednesday.",
        "Content": "A tornado could batter parts of the UK, experts are warning - as southern England endures heavy rain following the driest start to spring in decades. Met Office meteorologist Alex Burkill said it was \"not out of the question that we could see a funnel cloud, maybe even a brief tornado across parts of the South East\" of England on Wednesday, with southern areas facing thunder, lightning, and hail. He added there was a \"bit of a North-South split in our weather through today\". \"Northern parts having a lot of fine, sunny weather, meanwhile in the South we've seen some wet weather push its way in... and there will be further showery bursts to come as we go through the rest of today,\" he said. Read more from Sky NewsWest Nile virus found in UK for first timeTwo dead after falling from migrant boatWill there be a hosepipe ban? Wednesday's showers follow the driest start to spring in nearly six decades. As of Friday, 80.6mm of rain had been recorded for the UK in spring 2025, nearly 20mm less than the record low for the full season of 100.7mm set in 1852. The Environment Agency is warning that it could contribute to drought this summer if there continue to be long periods without any rainfall. Drier weather to return tomorrow The UK is set to return to more dry weather on Thursday, with only a few showers forecasted in the South West of England. They will not be \"as intense\" as those throughout the UK today, Mr Burkill said, with \"a good amount of sunshine on offer\" elsewhere. Friday is due to be \"mostly fine\" but more wet and windy conditions are earmarked for the weekend. Mr Burkill described this week's wet spells as a \"real change from what we've become used to so far this spring\"."
    },
    {
        "title": "Member of Kneecap charged with terror offence",
        "description": "A member of Irish-language rap group Kneecap has been charged with a terror offence.",
        "url": "https://news.sky.com/story/member-of-kneecap-charged-with-terror-offence-13369377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250521200430",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-21 13:00:00",
        "Headline": "Liam O'Hanna - who performs under the stage name Mo Chara - will appear at Westminster Magistrates' Court next month, the Metropolitan Police says.",
        "Content": "A member of Irish-language rap group Kneecap has been charged with a terror offence. Liam O'Hanna, or Liam Og O Hannaidh, has been charged with displaying a flag in support of Hezbollah, a proscribed organisation, the Metropolitan Police said. The 27-year-old from Belfast - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June. It comes after counter-terror police assessed a video reported to be from a Kneecap concert. The charge relates to a flag that O'Hanna allegedly displayed at the O2 Forum in Kentish Town, London, on 21 November last year. Read more from Sky News:Chris Brown released on bailInside Diddy's star-studded parties Officers from the Met's Counter Terrorism Command were made aware of a video circulating online on 22 April, the force said. An investigation led to the Crown Prosecution Service authorising the charge. Kneecap are due to headline Wide Awake Festival in south London on Friday."
    },
    {
        "title": "UK calls for investigation after IDF fired warning shots as British diplomats travelled through West Bank",
        "description": "The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank.",
        "url": "https://news.sky.com/story/uk-calls-for-investigation-after-idf-fired-warning-shots-as-british-diplomats-travelled-through-west-bank-13372358",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-west-bank-israel_6923441.jpg?20250521165900",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 22:06:00",
        "Headline": "Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday.",
        "Content": " The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank. Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday. All four countries have condemned the shooting, which comes after Western nations criticised Israel's latest offensive in Gaza. Two British diplomats are understood to be among the group of around 20 people who have been confirmed as safe following the incident in the Israeli-occupied West Bank. Footage shows the moment members of the delegation were gathered outside before fleeing the scene as the gunshots rang out. Foreign Office minister Hamish Falconer has described the incident in Jenin as \"unacceptable\". He wrote on X: \"I have spoken to our diplomats who were affected. Civilians must always be protected, and diplomats allowed to do their jobs. There must be a full investigation and those responsible should be held accountable.\" \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Donald Trump confronts South African president Cyril Ramaphosa with genocide claims\n                 \n                  Australia floods: Natural disaster declared in New South Wales as four months of rain falls in just two days\n                 Follow latest: Gaza conflict live updates In response to the situation, UK Foreign Secretary David Lammy has announced measures, including financial restrictions and travel bans, targeting prominent settler leader Daniella Weiss and two other individuals. The measures also target two illegal outposts and two organisations accused of backing violence against Palestinian communities. It came after Ireland's deputy premier Simon Harris condemned the shooting in \"the strongest terms\" and France's foreign minister Jean-Noel Barrot said he would summon the Israeli ambassador over the incident. Meanwhile, Turkey's foreign ministry said the shooting showed Israel's \"systematic disregard for international law\" and called for an immediate investigation. Germany's foreign office had earlier condemned what it referred to as \"unprovoked gunfire\", adding: \"We are fortunate that nothing worse occurred.\" The Israeli military said the delegation had \"deviated from the approved route\" of their visit and Israel Defence Force (IDF) soldiers fired warning shots to push them from the area. The IDF apologised and said it would contact all countries involved in the visit. The shooting took place a day after the UK announced it would cease all talks of a trade deal with Israel, and summoned the country's ambassador to make clear Britain is unhappy with the situation in Gaza. Hospitals in northern Gaza encircled by IDF Elsewhere, staff and aid groups have said that two of northern Gaza's last functioning hospitals have been encircled by Israeli troops - preventing anyone from entering or leaving. The Indonesian and al Awda hospitals are among the region's only remaining medical facilities, with both coming under fire this week. Tedros Adhanom Ghebreyesus, the director general of the World Health Organisation, has warned Israel's military operations and evacuation orders \"are stretching the health system beyond the breaking point\". Just 20 of the territory's 36 hospitals remain partially functioning - with centres in northern Gaza now said to be \"at a serious risk of shutting down completely\". According to the WHO, there have been almost 700 attacks on medical facilities since the war began. Israel's military has accused Hamas of using hospitals as command centres and to hide fighters, but has only provided evidence for some of these claims. Read more:British doctor in Gaza describes horrorIsrael has gone 'beyond just self-defence', minister says  UK unveils new aid package to Gaza Elsewhere, UK ministers announced they will send £4m of aid to Gaza, including essential medicines, safe drinking water and food parcels. Minister for development Jenny Chapman, who is visiting Israel and the occupied territories, said the lack of aid reaching Gazans is \"appalling\". She added: \"The Israeli government's failure to allow full humanitarian access to aid workers is abhorrent. Far too few trucks are crossing into Gaza. \"The UN has warned nearly half a million Palestinians, including children, are facing starvation. \"The UK is clear - Israel will not achieve security through prolonging the suffering of the Palestinian people.\" It comes as British Prime Minister Sir Keir Starmer said humanitarian aid needs to get into Gaza \"at pace\". On Wednesday, Downing Street did not rule out more sanctions on Israeli ministers after a report said Number 10 and other countries were drawing up plans to target key figures in Israeli Prime Minister Benjamin Netanyahu's government. Sir Keir's official spokesman said he would not speculate on future sanctions but added it has been made clear that if Israel does not cease its military offensive and lift aid restrictions then the UK will take further \"concrete actions\". The shooting in the West Bank came hours before the Israeli military said 100 aid trucks carrying flour, baby food and medical equipment had travelled from the Kerem Shalom crossing into Gaza. The transfer of aid into Gaza has become an increasingly controversial topic over the last couple of days as the international community fears the territory is on the brink of famine. The UN said earlier that no aid has been distributed in Gaza since Mr Netanyahu said an 11-week blockade on the territory had been lifted. On Wednesday evening, the Israeli prime minister held a news conference where he said he would not allow European leaders to \"influence\" Israel after he was asked about the diplomatic row over the gunfire in Jenin and the humanitarian crisis in Gaza. \"We have to complete the war,\" Mr Netahayu said. \"We are going to continue what is needed to end the war.\" He said it was a \"mark of shame\" that Britain was sanctioning Israel and not Hamas, calling the sanctions an \"absolutely horrible thing\"."
    },
    {
        "title": "Gordon Brown suggests people on top rate of income tax should be excluded from winter fuel",
        "description": "Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said.",
        "url": "https://news.sky.com/story/gordon-brown-suggests-people-on-top-rate-of-income-tax-should-be-excluded-from-winter-fuel-13372219",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gordon-brown-former-prime-minister_6754753.jpg?20241122184723",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 16:00:00",
        "Headline": "The former prime minister, who introduced winter fuel as a universal benefit when chancellor, said there is a strong case for it, but suggests society's richest pensioners could be exempt. ",
        "Content": " Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said. The former Labour prime minister told Sky News' Sophy Ridge that he welcomed Sir Keir Starmer's backtrack over his unpopular decision to means-test the allowance, which Mr Brown introduced as a universal benefit when he was chancellor in 1997. Politics live: Starmer confirms U-turn on winter fuel payments - but No.10 will not say when Asked if he thought the U-turn was the right move, he said: \"Yeah. I think what Keir's saying is the economy has improved and he feels that the country is in a better position, that they can afford to do better by the pensioner community. \"You must be fair to the different communities in your country when they're struggling... and you've got to be fair to pensioners.\" Mr Brown added there is \"a strong case\" for winter fuel payments for pensioners, but suggested the richest in society could be exempt. \"I did bring it in as a universal benefit,\" he said. \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Sir Tony Blair and Gordon Brown lead tributes to Lord Prescott at his funeral\n                 \n                  Justice secretary's assisted dying intervention is explosive - and potentially embarrassing for PM\n                 \"I think there is a case, for example, for people on the top rate of tax not receiving it, but that's something the government has got to decide. \"That was in the Labour 2015 manifesto, so I think the government's got decisions to make... but to me, the issue is nobody should be pushed into poverty if they're doing the right thing. \"Nobody who's working hard or nobody who's served the country well over their lifetime should be pushed into poverty if we can avoid it, and I believe that that's what he's [Keir] is really thinking about, a fairness guarantee for pensioners.\" Sir Keir announced that he would \"look\" at making more pensioners eligible during PMQs earlier on Wednesday. He told MPs: \"I recognise that people are still feeling the pressure of the cost of living crisis, including pensioners. \"As the economy improves, we want to make sure people feel those improvements in their days as their lives go forward. \"And that is why we want to ensure that as we go forward, more pensioners are eligible for winter fuel payment.\" While it appears a full reversal will not be implemented, the Treasury could raise the threshold at which pensioners can qualify for winter payments, which is currently £11,500. Read More:Why Keir Starmer's strategy to tackle Reform UK could end up backfiringBrexit wounds' mean EU states want to limit UK's access to rearmament fund The decision follows significant backlash from Labour MPs, who blamed the policy on the party's poor performance at the local elections this month. Means-testing the winter fuel payments, worth up to £300, was one of the first policies brought in by the Labour government. Overall, the number of pensioners eligible for the payment was slashed from 11.4 million to 1.5 million. The government argued it would save £1.5bn each year and put the public finances under control, after claiming the Tories left behind a larger-than-expected fiscal black hole of £22bn. However, in the aftermath of the May local elections - which saw Labour lose 189 council seats - more high-profile party figures began speaking out against the policy."
    },
    {
        "title": "Member of Kneecap charged with terror offence",
        "description": "A member of Irish-language rap group Kneecap has been charged with a terror offence.",
        "url": "https://news.sky.com/story/member-of-kneecap-charged-with-terror-offence-13369377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250521200430",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 13:00:00",
        "Headline": "Liam O'Hanna - who performs under the stage name Mo Chara - will appear at Westminster Magistrates' Court next month, the Metropolitan Police says.",
        "Content": "A member of Irish-language rap group Kneecap has been charged with a terror offence. Liam O'Hanna, or Liam Og O Hannaidh, has been charged with displaying a flag in support of Hezbollah, a proscribed organisation, the Metropolitan Police said. The 27-year-old from Belfast - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June. It comes after counter-terror police assessed a video reported to be from a Kneecap concert. The charge relates to a flag that O'Hanna allegedly displayed at the O2 Forum in Kentish Town, London, on 21 November last year. Read more from Sky News:Chris Brown released on bailInside Diddy's star-studded parties Officers from the Met's Counter Terrorism Command were made aware of a video circulating online on 22 April, the force said. An investigation led to the Crown Prosecution Service authorising the charge. Kneecap are due to headline Wide Awake Festival in south London on Friday."
    },
    {
        "title": "M&S website down - hours after financial impact of ransomware attack revealed",
        "description": "The M&S website is down - hours after the retailer revealed it's facing a &#163;300m hit to profits following last month's ransomware attack.",
        "url": "https://news.sky.com/story/ms-website-down-hours-after-financial-impact-of-ransomware-attack-revealed-13372433",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-m-and-s-marks-and-spencer_6923742.jpg?20250521233206",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 23:02:00",
        "Headline": "M&S recently warned that disruption could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\".",
        "Content": "The M&S website is down - hours after the retailer revealed it's facing a £300m hit to profits following last month's ransomware attack. A holding page told customers that they are currently unable to browse the site, adding: \"We're making some updates and will be back soon.\" Online purchases have been suspended since the incident on 22 April, and it may be a couple of weeks before services are partially restored. Sky News understands that the maintenance is routine.  M&S recently warned that disruption to its operations could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\". It is widely believed the retailer fell victim to Scattered Spider, a hacking group that has also been linked to similar attacks targeting The Co-op and Harrods. Last week, M&S also admitted personal data belonging to some of its customers has been stolen - but the company stressed this didn't include \"usable payment or card details\". \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 \n                  Money blog: House prices rising at fastest pace since 2022 - with these regions growing most\n                 Passwords were also not affected, but there are reports that contact details such as names, addresses and phone numbers was taken. The company's valuation has plunged by more than £1bn as the fallout deepens. \"This incident is a bump in the road, and we will come out of this in better shape, and continue our plan to reshape M&S for customers, colleagues and shareholders,\" Mr Machin told analysts on Wednesday."
    },
    {
        "title": "Spurs beat Manchester United to win Europa League",
        "description": "Tottenham Hotspur have won the Europa League after beating Premier League rivals Manchester United 1-0 in the final.",
        "url": "https://news.sky.com/story/spurs-beat-man-utd-to-win-europa-league-13372205",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-heung-min-son-spurs_6923700.jpg?20250521222744",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 20:13:00",
        "Headline": "Brennan Johnson's scrappy goal in the 42nd minute gave Ange Postecoglou's team a 1-0 victory, which secured them a place in next season's prestigious Champions League.",
        "Content": " Tottenham Hotspur have won the Europa League after beating Premier League rivals Manchester United 1-0 in the final. Brennan Johnson's scrappy 42-minute goal gave Ange Postecoglou's team the win and a spot in next season's Champions League, which is set to bring the north London club a £100m windfall. Spurs were thankful for Micky van de Ven's second-half goal-line clearance and keeper Guglielmo Vicario's stoppage-time save. The club have endured a disappointing top-flight campaign, currently sitting in 17th place in the domestic league, but the victory in Bilbao, Spain, means they have secured a place in Europe's premier club competition and salvaged their season. It is the first time Tottenham have won a trophy since the League Cup in 2008, and it is their first European title since the UEFA Cup in 1984. Beaming boss Postecoglou silenced the critics - at least temporarily - as he stuck to his word by winning a trophy in his second season. Last September, the head coach stated: \"I'll correct myself - I don't usually win things, I always win things in my second year. Nothing's changed. \"I've said it now. I don't say things unless I believe them.\" Tottenham goalscorer Johnson told TNT Sport after the team's triumph: \"I'm so happy right now. This season hasn't been good, but not one of us players cares right now. \"This is what it's all about... it means so much. All the fans get battered, we get battered for not winning a trophy, but to get the first one in a while today, I'm so happy. \"Ever since I came here, it's been 'Tottenham are a good team but never get it done'. We got it done.\" Read more from Sky News:Liverpool win Premier League to equal Man Utd's recordNewcastle United end 70-year wait for domestic trophyCrystal Palace celebrate historic FA Cup victory Meanwhile, United, who currently lie 16th in the Premier League, will now have a season without European football for the first time since 2014-15. The Red Devils had remained unbeaten in the Europa League ahead of Wednesday's final at the San Mames stadium. But manager Ruben Amorim's already tough job of rebuilding the team now becomes that much harder without Champions League qualification. This season has been United's worst top-flight campaign since suffering relegation 51 years ago."
    },
    {
        "title": "Jay Slater's mother breaks down in tears at inquest - as friends fail to appear as witnesses",
        "description": "Friends of Jay Slater have failed to appear as witnesses at an inquest into his death - as a coroner heard the British teenager had drugs in his system before he died from a \"devastating\" head injury.",
        "url": "https://news.sky.com/story/jay-slater-had-drugs-in-his-system-before-he-died-as-friends-fail-to-respond-to-requests-to-give-inquest-evidence-13372127",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-jay-slater-tenerife_6585855.jpg?20240701133130",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 12:37:00",
        "Headline": "A coroner's court hears summonses have been issued for several witnesses who were in contact with the British teenager before he disappeared in Tenerife but a number had failed to respond.",
        "Content": "Friends of Jay Slater have failed to appear as witnesses at an inquest into his death - as a coroner heard the British teenager had drugs in his system before he died from a \"devastating\" head injury. Jay Slater, 19, from Oswaldtwistle in Lancashire, disappeared in Tenerife after attending a music festival in June last year. In the early hours of the following day, he is believed to have travelled to an apartment where people he had met were staying - before he went missing. His body was recovered in a remote part of La Masca village on 15 July following an extensive search of the island by authorities and his family. His mother Debbie Duncan, stepfather and other family members attended the inquest into Mr Slater's death at Preston Coroner's Court on Wednesday. Ms Duncan broke down in tears as she told the hearing she still had questions that needed answers. The hearing, scheduled to last one day, was told extensive efforts had been made to reach several witnesses who were in contact with Mr Slater before he disappeared, which included summonses being issued. However, a number of witnesses had failed to respond, including Mr Slater's friends Bradley Geoghegan, Brandon Hodgson and Lucy Law, who were out with him at the music festival. The two men who were staying at an Airbnb that Mr Slater went back to before he disappeared have also not been traced. Ms Duncan said: \"How can we ever get any understanding? \"There's things we want to question. We want these people to be sat in front of us, because our son went on holiday and didn't come back, so there's questions we need to ask.\" Coroner Dr James Adeley agreed to adjourn the hearing, at the request of Mr Slater's tearful mother, who asked for the witnesses to be brought to court to give evidence before the inquest concludes. A further hearing date has yet to be set. Earlier, the court heard analysis of Mr Slater's body showed traces of drugs including cocaine, ketamine and ecstasy. During Wednesday's hearing, Home Office pathologist Dr Richard Shepherd detailed Mr Slater's injuries. He described \"extensive fractures of the left side of his head… extending into the bottom of his skull\". Mr Slater also sustained \"fractures to the left side of the pelvis and hip joints\". Dr Shepherd said the injuries were \"entirely consistent with a heavy fall, from a height, landing on his head\". Asked by the coroner if there was any suggestion of assault or restraint, he replied: \"Nothing to suggest an assault, gripping, holding, nothing of that sort.\" Read more from Sky News:Man in court after footballer hit by seatChris Brown released on bail - but must pay £5m security fee Dr Adeley asked the pathologist about the impact of Mr Slater's injuries. Dr Shepherd replied: \"It would have had an immediate and devastating effect on Jay's consciousness. \"The injuries were so severe I have no doubt he would have been instantly unconscious from the moment of that blow to the head. Death could well have been instant, the injury was so severe.\" Failing that, it would have most likely occurred \"extremely soon after\" the fall, he added. Dr Shepherd gave an official cause of death as a head injury."
    },
    {
        "title": "UK weather: Tornado and funnel cloud could hit parts of country, Met Office forecaster warns",
        "description": "A tornado could batter parts of the UK, experts are warning - as southern England endures heavy rain following the driest start to spring in decades.",
        "url": "https://news.sky.com/story/uk-weather-tornado-and-funnel-cloud-could-hit-parts-of-country-today-met-office-forecaster-warns-13371907",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-uk-weather-rain-file_6923363.jpg?20250521154532",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:06:00",
        "Headline": "Met Office meteorologist Alex Burkill said it is \"not out of the question that we could see a funnel cloud, maybe even a brief tornado\" across parts of South East England on Wednesday.",
        "Content": "A tornado could batter parts of the UK, experts are warning - as southern England endures heavy rain following the driest start to spring in decades. Met Office meteorologist Alex Burkill said it was \"not out of the question that we could see a funnel cloud, maybe even a brief tornado across parts of the South East\" of England on Wednesday, with southern areas facing thunder, lightning, and hail. He added there was a \"bit of a North-South split in our weather through today\". \"Northern parts having a lot of fine, sunny weather, meanwhile in the South we've seen some wet weather push its way in... and there will be further showery bursts to come as we go through the rest of today,\" he said. Read more from Sky NewsWest Nile virus found in UK for first timeTwo dead after falling from migrant boatWill there be a hosepipe ban? Wednesday's showers follow the driest start to spring in nearly six decades. As of Friday, 80.6mm of rain had been recorded for the UK in spring 2025, nearly 20mm less than the record low for the full season of 100.7mm set in 1852. The Environment Agency is warning that it could contribute to drought this summer if there continue to be long periods without any rainfall. Drier weather to return tomorrow The UK is set to return to more dry weather on Thursday, with only a few showers forecasted in the South West of England. They will not be \"as intense\" as those throughout the UK today, Mr Burkill said, with \"a good amount of sunshine on offer\" elsewhere. Friday is due to be \"mostly fine\" but more wet and windy conditions are earmarked for the weekend. Mr Burkill described this week's wet spells as a \"real change from what we've become used to so far this spring\"."
    },
    {
        "title": "Sex offender found with six-year-old girl after facial recognition technology spots him",
        "description": "A registered sex offender was found with a six-year-old girl after he was detected by facial recognition technology.",
        "url": "https://news.sky.com/story/sex-offender-found-with-six-year-old-girl-after-facial-recognition-technology-spots-him-13372194",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-david-cheneler-police_6923417.jpg?20250521163806",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:39:00",
        "Headline": "David Cheneler, 73, was discovered with the child - whose mother was \"completely unaware of his offending history\" - in Camberwell, south London.",
        "Content": "A registered sex offender was found with a six-year-old girl after he was detected by facial recognition technology. David Cheneler, 73, was discovered with the child - whose mother was \"completely unaware of his offending history\" - after he was identified by a police van in Camberwell, south London, in January. He was spotted using advanced technology known as Live Facial Recognition (LFR), where live footage is recorded of members of the public as they walk past, capturing their faces, which are then compared against a database of wanted offenders. If a match is determined, the system creates an alert, which is assessed by an officer. If suspicions are aroused, the police officer may decide to speak with the individual in question. When Cheneler was detected on 10 January, cameras alerted the authorities to his status as a registered sex offender. Additional checks confirmed he had breached his Sexual Offences Prevention Order (SOPO), which prohibited him from being alone with children under 14. Cheneler was also in possession of a lock knife hidden in the buckle of his belt. He was subsequently arrested and taken into custody. Lindsey Chiswick, the Metropolitan Police's lead for LFR, said it was \"a prime example of the variety of uses\" of the technology. \"The tool is not only used to find those wanted, but also to stop people on a watch list who have conditions they must adhere to,\" she added. \"These interventions are crucial. Without this technology, Cheneler may have had the opportunity to cause further harm.\" Cheneler had picked up the child from school as a favour to her mother, which he had done twice previously, according to the Met Police. Read more on Sky News:Jay Slater's mother breaks down in tears at inquestChris Brown released on bail - but must pay £5m Detective Constable Adam Pearce said: \"Although there were no allegations made towards David Cheneler on this occasion, it's possible if he hadn't been identified using this technology, he could have gone on to abuse this child. \"Her mother was completely unaware of his offending history, and along with her young daughter, were both taken advantage of by Cheneler who abused their trust.\" Cheneler was sentenced to two years' imprisonment at Kingston Crown Court on Tuesday. In January, he pleaded guilty at Wimbledon Magistrates' Court to breaching the conditions of his SOPO, and to possessing an offensive weapon."
    },
    {
        "title": "Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'",
        "description": "Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country.",
        "url": "https://news.sky.com/story/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa-13372206",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-cyril-ramaphosa_6923546.jpg?20250521193348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:56:00",
        "Headline": "The US president says \"people are fleeing South Africa for their own safety... their land is being confiscated and in many cases they're being killed\". But Cyril Ramaphosa pushed back against Mr Trump's accusations.",
        "Content": " Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of more than a thousand white farmers and \"it's a terrible sight... I've never seen anything like it. Those people are all killed\". After an initial friendly chat where Mr Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: \"I'd like to know where that is because this [the alleged burial site in the video] I've never seen\". The lights were dimmed in the Oval Office as the clips were shown, including of South African officials allegedly calling for violence against white farmers. The scene in the heart of the White House administration was reminiscent of Mr Trump's ambush of Ukraine's President Volodymyr Zelenskyy in February. But later, as he left after around three hours at the White House, Mr Ramaphosa insisted his meeting with Mr Trump went \"very well\". And he told a news conference: \"There is just no genocide in South Africa.\" The White House's official account on X posted the footage that was shown in the Oval Office, saying it was \"proof of persecution in South Africa\". South Africa has rejected the allegation that white people are disproportionately targeted by crime. The clips included one of communist politician Julius Malema playing a controversial anti-apartheid song that includes lyrics about killing a farmer.  Mr Trump accused South Africa of failing to address the killing of white farmers. \"We have many people that feel they're being persecuted, and they're coming to the United States. So we take from many... locations, if we feel there's persecution or genocide going on,\" the US president said, referring specifically to white farmers. He added: \"People are fleeing South Africa for their own safety. Their land is being confiscated and in many cases they're being killed.\" Alluding to people in the clips, Mr Trump said: \"These are people that are officials and they're saying... kill the white farmer and take their land.\" The US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying \"death, death\" as he flipped through them. He added of one article: \"Here's burial sites all over the place, these are all white farmers that are being buried.\" South African leader rejects allegations Mr Ramaphosa pushed back against Mr Trump's accusations, by responding: \"What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies. \"And in many cases, or in some cases, those policies do not go along with government policy. \"Our government policy is completely, completely against what he [a person in the video montage] was saying, even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\" Read more from Sky News:Ex-Ukrainian politician living abroad shot dead on school runThe soldiers faced with 'raining bullets' from violent gangs Africa correspondent The screens, the visuals and President Trump's foreshadowing mentions of a \"bloodbath\" all point to one thing - this ambush was planned. As the yells of anguish and violent rhetoric echoed in the Oval Office, President Ramaphosa craned his neck with a stern expression to watch the \"evidence\" of a repeatedly disproven \"white genocide\" in his country. He interjected only to question the location of the videos - to which Mr Trump replied, almost with a \"duh\" tone of voice, \"South Africa\" - and then pushed on to direct his team to verify them. That was the singular point of outright defiance from South Africa's leader in an uncomfortable meeting where facts were dismissed as a difference in opinion and outdated videos were played as breaking news. For the rest of the meeting, Nelson Mandela's former chief negotiator kept calm and played the charm offensive - appealing to Mr Trump's ego at every sharp turn while maintaining that black South Africans are disproportionately impacted by the country's harrowing murder rate. The charm and calm may seem like dull knives in this sword fight but are necessary for peacekeeping in a meeting where £6bn in trade hangs in the balance. South Africa has the most to lose in the deteriorating bilateral relations. In just five months, the Trump administration has cut off vital humanitarian aid, including HIV assistance of which South Africa is the biggest beneficiary; expelled South Africa's ambassador; and offered white South Africans refugee status as millions of black Africans suffer across the continent.  The potential futility of Mr Ramaphosa's strategy came into vision as cameras panned to the back of the Oval Office at the end of the meeting to show a stony-faced Elon Musk. The false claims of white genocide Musk has championed on X are now a powder keg in US-South African relations, as he works to get Starlink licensed in his home country. A business strategy that even South Africa's iconic negotiator may not be able to contend with. Mr Ramaphosa also said of the behaviour alleged by Mr Trump: \"We are completely opposed to that.\" The South African leader said there was crime in his country, and the majority of victims were black. Mr Trump cut him off and said: \"The farmers are not black.\" The South African president responded: \"These are concerns we are willing to talk to you about.\" In February, Mr Trump issued an executive order which cut all funding to South Africa over some of its domestic and foreign policies. He also expelled South Africa's ambassador and offered refuge to white minority Afrikaners based on racial discrimination claims which Pretoria says are baseless. Experts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate."
    },
    {
        "title": "UK calls for investigation after IDF fired warning shots as British diplomats travelled through West Bank",
        "description": "The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank.",
        "url": "https://news.sky.com/story/uk-calls-for-investigation-after-idf-fired-warning-shots-as-british-diplomats-travelled-through-west-bank-13372358",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-west-bank-israel_6923441.jpg?20250521165900",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 22:06:00",
        "Headline": "Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday.",
        "Content": " The UK government is calling for Israel to launch an investigation after the country's troops fired warning shots while British diplomats were travelling through the West Bank. Diplomats from Ireland, France, Germany and Turkey were also travelling with the delegation in the city of Jenin when the gunshots rang out on Wednesday. All four countries have condemned the shooting, which comes after Western nations criticised Israel's latest offensive in Gaza. Two British diplomats are understood to be among the group of around 20 people who have been confirmed as safe following the incident in the Israeli-occupied West Bank. Footage shows the moment members of the delegation were gathered outside before fleeing the scene as the gunshots rang out. Foreign Office minister Hamish Falconer has described the incident in Jenin as \"unacceptable\". He wrote on X: \"I have spoken to our diplomats who were affected. Civilians must always be protected, and diplomats allowed to do their jobs. There must be a full investigation and those responsible should be held accountable.\" \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Donald Trump confronts South African president Cyril Ramaphosa with genocide claims\n                 \n                  Australia floods: Natural disaster declared in New South Wales as four months of rain falls in just two days\n                 Follow latest: Gaza conflict live updates In response to the situation, UK Foreign Secretary David Lammy has announced measures, including financial restrictions and travel bans, targeting prominent settler leader Daniella Weiss and two other individuals. The measures also target two illegal outposts and two organisations accused of backing violence against Palestinian communities. It came after Ireland's deputy premier Simon Harris condemned the shooting in \"the strongest terms\" and France's foreign minister Jean-Noel Barrot said he would summon the Israeli ambassador over the incident. Meanwhile, Turkey's foreign ministry said the shooting showed Israel's \"systematic disregard for international law\" and called for an immediate investigation. Germany's foreign office had earlier condemned what it referred to as \"unprovoked gunfire\", adding: \"We are fortunate that nothing worse occurred.\" The Israeli military said the delegation had \"deviated from the approved route\" of their visit and Israel Defence Force (IDF) soldiers fired warning shots to push them from the area. The IDF apologised and said it would contact all countries involved in the visit. The shooting took place a day after the UK announced it would cease all talks of a trade deal with Israel, and summoned the country's ambassador to make clear Britain is unhappy with the situation in Gaza. Hospitals in northern Gaza encircled by IDF Elsewhere, staff and aid groups have said that two of northern Gaza's last functioning hospitals have been encircled by Israeli troops - preventing anyone from entering or leaving. The Indonesian and al Awda hospitals are among the region's only remaining medical facilities, with both coming under fire this week. Tedros Adhanom Ghebreyesus, the director general of the World Health Organisation, has warned Israel's military operations and evacuation orders \"are stretching the health system beyond the breaking point\". Just 20 of the territory's 36 hospitals remain partially functioning - with centres in northern Gaza now said to be \"at a serious risk of shutting down completely\". According to the WHO, there have been almost 700 attacks on medical facilities since the war began. Israel's military has accused Hamas of using hospitals as command centres and to hide fighters, but has only provided evidence for some of these claims. Read more:British doctor in Gaza describes horrorIsrael has gone 'beyond just self-defence', minister says  UK unveils new aid package to Gaza Elsewhere, UK ministers announced they will send £4m of aid to Gaza, including essential medicines, safe drinking water and food parcels. Minister for development Jenny Chapman, who is visiting Israel and the occupied territories, said the lack of aid reaching Gazans is \"appalling\". She added: \"The Israeli government's failure to allow full humanitarian access to aid workers is abhorrent. Far too few trucks are crossing into Gaza. \"The UN has warned nearly half a million Palestinians, including children, are facing starvation. \"The UK is clear - Israel will not achieve security through prolonging the suffering of the Palestinian people.\" It comes as British Prime Minister Sir Keir Starmer said humanitarian aid needs to get into Gaza \"at pace\". On Wednesday, Downing Street did not rule out more sanctions on Israeli ministers after a report said Number 10 and other countries were drawing up plans to target key figures in Israeli Prime Minister Benjamin Netanyahu's government. Sir Keir's official spokesman said he would not speculate on future sanctions but added it has been made clear that if Israel does not cease its military offensive and lift aid restrictions then the UK will take further \"concrete actions\". The shooting in the West Bank came hours before the Israeli military said 100 aid trucks carrying flour, baby food and medical equipment had travelled from the Kerem Shalom crossing into Gaza. The transfer of aid into Gaza has become an increasingly controversial topic over the last couple of days as the international community fears the territory is on the brink of famine. The UN said earlier that no aid has been distributed in Gaza since Mr Netanyahu said an 11-week blockade on the territory had been lifted. On Wednesday evening, the Israeli prime minister held a news conference where he said he would not allow European leaders to \"influence\" Israel after he was asked about the diplomatic row over the gunfire in Jenin and the humanitarian crisis in Gaza. \"We have to complete the war,\" Mr Netahayu said. \"We are going to continue what is needed to end the war.\" He said it was a \"mark of shame\" that Britain was sanctioning Israel and not Hamas, calling the sanctions an \"absolutely horrible thing\"."
    },
    {
        "title": "Former Ukrainian politician living abroad shot dead on school run",
        "description": "A man who served as an aide to a former Ukrainian president has been shot dead in Madrid, local authorities have said.",
        "url": "https://news.sky.com/story/aide-to-former-ukrainian-president-shot-dead-in-madrid-13372008",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-andriy-portnov-ukrain_6923130.jpg?20250521132559",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 09:32:00",
        "Headline": "Andriy Portnov served as a senior aide to Ukraine's pro-Russian former president Viktor Yanukovich before he was ousted in 2014.",
        "Content": "A man who served as an aide to a former Ukrainian president has been shot dead in Madrid, local authorities have said. Unidentified gunmen shot former politician Andriy Portnov, 51, outside the gates of the American School of Madrid in the Pozuelo area of the Spanish capital on Wednesday morning, according to a source close to the investigation. \"Several persons shot him in the back and the head,\" according to an Interior Ministry source, before they \"fled towards a forest area\".   Police received the report at 9.15am local time and rushed to Calle America, where Mr Portnov is believed to have been taking his children to school, radio station Cadena SER said. Emergency service vehicles and a police cordon were pictured at the scene. Mr Portnov served as a senior aide to Ukraine's former president Viktor Yanukovich before he was ousted in 2014. The pro-Russian leader was driven out by Ukraine's 2014 Orange Revolution - and has been living in exile in Russia ever since. After fleeing Ukraine in 2014, Mr Portnov is believed to have lived briefly in Russia before moving to Austria. It is not known when he moved to Spain. Ukraine's secret security service opened a state treason investigation into him in 2018 over claims he was involved in Russia's illegal annexation of Crimea in 2014 - but closed it in 2019. He was sanctioned by the US in 2021, being designated as someone \"responsible for or complicit in, or (who) has directly or indirectly engaged in, corruption, including the misappropriation of state assets, the expropriation of private assets for personal gain, corruption related to government contracts or the extraction of natural resources, or bribery\". Since Vladimir Putin's invasion of Ukraine in February 2022, crimes have been committed against several high-profile Russians and Ukrainians in Spain, which has large ex-pat populations from both countries. In November and December 2022, six letter bombs were sent to targets across the country, to Spanish Prime Minister Pedro Sanchez, the Ukrainian Embassy in Madrid, as well as its US counterpart. A 76-year-old retired Spanish civil servant was jailed over the offences after his social media searches suggested he was sympathetic towards Russia's invasion. Read more from Sky NewsThis is what I do before entering a war zoneLoser in Romanian election to contest resultThree dead and two missing in flooding In April that year, a Russian businessman linked to the country's Novatek gas company was found dead with his wife and daughter, having all sustained stab wounds. In February last year, a Russian pilot who defected to the Ukrainian side was found dead with gunshot wounds in the car park of his apartment near Alicante."
    },
    {
        "title": "Putin visits Kursk region for first time since Ukrainian troops ejected",
        "description": "Vladimir Putin has visited Kursk for the first time since his troops ejected Ukrainian forces from the Russian city.",
        "url": "https://news.sky.com/story/putin-visits-kursk-region-for-first-time-since-ukrainian-troops-ejected-13371910",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kursk-vladimir-putin_6922888.jpg?20250521074624",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 05:56:00",
        "Headline": "It comes after a Russian missile attack killed six Ukrainian soldiers and injured 10 more, according to Ukraine's national guard.",
        "Content": " Vladimir Putin has visited Kursk for the first time since his troops ejected Ukrainian forces from the Russian city. The Russian president met with volunteer organisations and visited a nuclear power plant in the region on Tuesday, the Kremlin said. Mr Putin said late last month that his forces had ejected Ukrainian troops from the Kursk region, which ended the largest incursion into Russian territory since the Second World War.   Ukraine launched its attack in August last year, using swarms of drones and heavy Western weaponry to smash through the Russian border, controlling nearly 540sq m (5,813sq ft) of Kursk at the height of the incursion. More than 159 Ukrainian drones were shot down over Russian territory, Russia's defence ministry said on Wednesday. The majority were over Russia's western regions, but at least six drones were shot down over the densely populated Moscow region, the ministry added. The visit in the Kursk region comes as a Russian missile attack killed six soldiers and injured 10 more during training in the Sumy region of Ukraine, according to the country's national guard. The commander of the unit has been suspended and an internal investigation has been launched. Russia's defence ministry claimed the attack on the training camp in northeastern Ukraine killed up to 70 Ukrainian servicemen, including 20 instructors. The attack comes after US President Donald Trump spoke to both Mr Putin and Volodymyr Zelenskyy, urging them to restart ceasefire talks. Read more from Sky News:Fresh UK and EU sanctions on Russia announcedBritish doctor in Gaza describes horror But German defence minister Boris Pistorius said on Wednesday that Mr Trump misjudged his influence on Mr Putin after the call between the American and Russian leaders yielded no progress in Ukraine peace talks. Europe has since announced new sanctions on Russia over the war in Ukraine. Mr Pistorius said it remained to be seen whether the US would join those measures."
    },
    {
        "title": "Two people die as migrants try to cross English Channel",
        "description": "Two&#160;people&#160;have died after falling unconscious on a boat trying to cross the English Channel, the French coastguard has said.",
        "url": "https://news.sky.com/story/two-people-die-as-migrants-try-to-cross-english-channel-13372069",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-migrants-rnli-dover_6923128.jpg?20250521122241",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 11:16:00",
        "Headline": "The French coastguard says nearly 80 migrants were making the overnight journey on a boat when people on board became unwell.",
        "Content": "Two people have died after falling unconscious on a boat trying to cross the English Channel, the French coastguard has said. An emergency operation was launched to help the two people and 10 others who also needed assistance. They were among nearly 80 migrants making the overnight crossing on a boat which left the shore from Gravelines, near Calais, in northern France, according to the coastguard. Rescuers from a French Navy vessel set out to reach the boat and performed first aid on the two people, but a medical team later confirmed their deaths. The bodies and those rescued were taken to Calais. The remaining migrants on the boat were allowed to continue their journey towards British waters under the surveillance of the French Navy. Pictures show migrants wrapped in blankets disembarking from a Border Force boat in Dover, Kent, on Wednesday morning. Others were also brought to shore in an RNLI lifeboat. The deaths came just days after another person was confirmed dead when a small boat sank in the Channel. Read more from Sky News:M&S reveals how long cyber attack disruption could lastUK's oldest polar bear euthanised French officials said on Monday that 62 people were pulled from the water after the \"overloaded\" boat broke up overnight. More than 12,500 people have made the journey across the Channel and arrived in the UK so far in 2025 - a record number for this point in the calendar year since data was first collected in 2018."
    },
    {
        "title": "Radiation-resistant bacteria with 'unique ability' found on space station could be key for cosmos travel",
        "description": "A new species of bacteria discovered on board a space station could have profound implications for astronauts and long-term travel through the cosmos.",
        "url": "https://news.sky.com/story/radiation-resistant-bacteria-with-unique-ability-found-on-space-station-could-be-key-for-cosmos-travel-13372032",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tiangong-space-station_6923073.jpg?20250521112321",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 10:12:00",
        "Headline": "Chinese taikonauts found the new bacteria on the surface of hardware on board the Tiangong Space Station. ",
        "Content": "A new species of bacteria discovered on board a space station could have profound implications for astronauts and long-term travel through the cosmos. A strain of Niallia with a \"unique ability\" was found on China's Tiangong Space Station, according to a scientific report. The discovery was announced in the International Journal of Systematic and Evolutionary Microbiology. Chinese taikonauts found the new bacteria on the surface of hardware on board the station in May 2023, and it was analysed to see how it survived in such tough conditions \"Understanding the characteristics of microbes during long-term space missions is essential for safeguarding the health of astronauts and maintaining the functionality of spacecraft,\" the report says. Challenges faced by living things in such environments include microgravity, radiation, and limited nutrients. Read more:Microbes cling on to International Space Station  \n                  What astronauts could end up eating in space after experiment 'meets objectives'\n                 \n                  The moon's very different sides explained in new NASA study\n                 \n                  Half-tonne piece of Soviet rocket may have crashed through atmosphere over south of England\n                 The study of which bacteria survive on space stations is also necessary for understanding how to control and avoid contamination on board. According to the report, this new strain - which most closely resembles Niallia circulans found on Earth - may be better resistant to radiation and oxidative stress. It also has a \"unique ability\" to hydrolyse (break down) gelatine, which could be useful in environments with limited nutrients."
    },
    {
        "title": "Almost half a billion teenagers will be overweight by 2030, experts warn",
        "description": "Almost half a billion teenagers around the world will be obese by 2030, experts have warned.",
        "url": "https://news.sky.com/story/almost-half-a-billion-teenagers-will-be-overweight-by-2030-experts-warn-13372004",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-weight-health-weight-loss_6914683.jpg?20250513051449",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 09:28:00",
        "Headline": "Experts warn the main drivers of ill health among teenagers has switched from cigarettes and alcohol to weight gain and mental health problems.",
        "Content": "Almost half a billion teenagers around the world will be obese by 2030, experts have warned. Adolescent health has reached a \"tipping point\", according to the Lancet Commission on Adolescent Health and Wellbeing. Experts warned the main drivers of ill health among teens has switched from cigarettes and alcohol to weight gain and mental health problems. They projected 464 million teenagers around the world will be overweight or obese by 2030 - 143 million more than in 2015. But they did acknowledge that substance abuse among teenagers had declined. It comes as separate research claimed weight-loss jabs for obese children could be effective in reducing parent battles around mealtimes. But the UK's National Institute for Health and Care Excellence (Nice) is \"unable to make a recommendation\" about use of the jabs on teenagers because of a lack of evidence of their impacts. Weight-loss jabs, also known as GLP-1 receptor agonists, work by reducing food cravings but are known to cause nausea, diarrhoea, stomach cramps and vision problems. They have surged in popularity in recent years, and are available on the NHS for adults with a high body mass index (BMI) or through private providers.  Progress in teen health 'lagging well behind' Today's Lancet report warned that progress in teenage health has \"lagged well behind\" the improvements that have been made in the health and development of young children, adding that these benefits could subsequently be \"undermined\" by increasing ill health as children enter their teenage years. With a shift to an increasingly online world, the commission also argued against overly restricting access. Australia has recently approved a law to ban children under the age of 16 from using social media, in one of the strictest measures in the world. The experts also said this generation is the first to grow up under harsher climate conditions making them the \"first cohort of humans who will live their entire life experiencing the growing reverberations of climate change\". Read more from Sky News:Public has right to camp on Dartmoor, court says'I had my leg amputated at 23'How to avoid holiday roaming charges Commission co-chairwoman Professor Sarah Baird, from George Washington University in the US, said: \"The health and wellbeing of adolescents worldwide is at a tipping point, with mixed progress observed over the past three decades. \"Whilst tobacco and alcohol use has declined and participation in secondary and tertiary education has increased, overweight and obesity have risen by up to eight-fold in some countries in Africa and Asia over the past three decades, and there is a growing burden of poor adolescent mental health globally. \"Additionally, the challenges faced by the world's adolescents are at risk of being exacerbated by emerging global issues including climate change, world conflicts and a rapid transition to a more digital world. \"Investing in the health and wellbeing of young people is crucial for safeguarding our collective future.\" Last year, a report by the Food Foundation said children in the UK were getting shorter, fatter and sicker due to \"shocking levels\" of poverty and food deprivation."
    },
    {
        "title": "Pakistan's PM Shehbaz Sharif blames India after school bus attack leaves five dead",
        "description": "Pakistan's prime minister has blamed India after five people - including at least three children - were killed when a suicide car bomber targeted an army school bus.",
        "url": "https://news.sky.com/story/pakistans-pm-shehbaz-sharif-blames-india-after-school-bus-attack-leaves-five-dead-13371999",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-shehbaz-sharif-prime-minister_6923050.jpg?20250521104704",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-21 09:14:00",
        "Headline": "The bus was carrying around 40 students to an army school when it was targeted, leaving at least several children among the fatalities and dozens more people injured, officials said.",
        "Content": "Pakistan's prime minister has blamed India after five people - including at least three children - were killed when a suicide car bomber targeted an army school bus. The attack in Khuzdar, in the southwestern region of Balochistan, took place while the bus was carrying around 40 children to school. The incident also left 38 other people injured, with several children in critical condition, officials said. Prime Minister Shehbaz Sharif directly blamed India for Wednesday morning's attack without providing any evidence. He said: \"The attack on a school bus by terrorists backed by India is clear proof of their hostility toward education in Balochistan.\" Pakistan's military said the bombing was \"yet another cowardly and ghastly attack\" and alleged it had been planned by India and carried out by \"its proxies in Balochistan\". Interior minister Mohsin Naqvi strongly condemned the attack and expressed deep sorrow over the children's deaths. He called the perpetrators \"beasts\" who deserve no leniency, calling the attack an act of \"sheer barbarism by targeting innocent children\". India's foreign ministry said it \"rejects the baseless allegations\" made by Pakistan. No group has yet claimed responsibility for the attack, but suspicion is likely to fall on ethnic separatists. The attack comes days after a car bombing killed four people near a market in Qillah Abdullah, a city in Balochistan bordering Afghanistan.  Read more:The story of India and Pakistan's deadly conflictPakistan vows 'swift response' if India violates ceasefire Balochistan has been the scene of a long-running insurgency, with an array of separatist groups staging attacks. They include the outlawed Balochistan Liberation Army (BLA), designated as a terrorist organisation by the US in 2019 and which Pakistan claims has the backing of India. Earlier this week, the BLA vowed more attacks on the \"Pakistani army and its collaborators\" and says it wants to \"lay the foundation for a peaceful, prosperous and independent Balochistan\". Tensions have increased between India and Pakistan amid a cross-border escalation over the disputed Himalayan region of Kashmir, with the nuclear-armed neighbours agreeing on what observers say is a \"fragile\" ceasefire on 10 May."
    },
    {
        "title": "Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'",
        "description": "Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country.",
        "url": "https://news.sky.com/story/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa-13372206",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-cyril-ramaphosa_6923546.jpg?20250521193348",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:56:00",
        "Headline": "The US president says \"people are fleeing South Africa for their own safety... their land is being confiscated and in many cases they're being killed\". But Cyril Ramaphosa pushed back against Mr Trump's accusations.",
        "Content": " Donald Trump has ambushed South Africa's president during a White House meeting by playing a video purportedly showing evidence of a \"genocide\" of white farmers in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of more than a thousand white farmers and \"it's a terrible sight... I've never seen anything like it. Those people are all killed\". After an initial friendly chat where Mr Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: \"I'd like to know where that is because this [the alleged burial site in the video] I've never seen\". The lights were dimmed in the Oval Office as the clips were shown, including of South African officials allegedly calling for violence against white farmers. The scene in the heart of the White House administration was reminiscent of Mr Trump's ambush of Ukraine's President Volodymyr Zelenskyy in February. But later, as he left after around three hours at the White House, Mr Ramaphosa insisted his meeting with Mr Trump went \"very well\". And he told a news conference: \"There is just no genocide in South Africa.\" The White House's official account on X posted the footage that was shown in the Oval Office, saying it was \"proof of persecution in South Africa\". South Africa has rejected the allegation that white people are disproportionately targeted by crime. The clips included one of communist politician Julius Malema playing a controversial anti-apartheid song that includes lyrics about killing a farmer.  Mr Trump accused South Africa of failing to address the killing of white farmers. \"We have many people that feel they're being persecuted, and they're coming to the United States. So we take from many... locations, if we feel there's persecution or genocide going on,\" the US president said, referring specifically to white farmers. He added: \"People are fleeing South Africa for their own safety. Their land is being confiscated and in many cases they're being killed.\" Alluding to people in the clips, Mr Trump said: \"These are people that are officials and they're saying... kill the white farmer and take their land.\" The US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying \"death, death\" as he flipped through them. He added of one article: \"Here's burial sites all over the place, these are all white farmers that are being buried.\" South African leader rejects allegations Mr Ramaphosa pushed back against Mr Trump's accusations, by responding: \"What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies. \"And in many cases, or in some cases, those policies do not go along with government policy. \"Our government policy is completely, completely against what he [a person in the video montage] was saying, even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\" Read more from Sky News:Ex-Ukrainian politician living abroad shot dead on school runThe soldiers faced with 'raining bullets' from violent gangs Africa correspondent The screens, the visuals and President Trump's foreshadowing mentions of a \"bloodbath\" all point to one thing - this ambush was planned. As the yells of anguish and violent rhetoric echoed in the Oval Office, President Ramaphosa craned his neck with a stern expression to watch the \"evidence\" of a repeatedly disproven \"white genocide\" in his country. He interjected only to question the location of the videos - to which Mr Trump replied, almost with a \"duh\" tone of voice, \"South Africa\" - and then pushed on to direct his team to verify them. That was the singular point of outright defiance from South Africa's leader in an uncomfortable meeting where facts were dismissed as a difference in opinion and outdated videos were played as breaking news. For the rest of the meeting, Nelson Mandela's former chief negotiator kept calm and played the charm offensive - appealing to Mr Trump's ego at every sharp turn while maintaining that black South Africans are disproportionately impacted by the country's harrowing murder rate. The charm and calm may seem like dull knives in this sword fight but are necessary for peacekeeping in a meeting where £6bn in trade hangs in the balance. South Africa has the most to lose in the deteriorating bilateral relations. In just five months, the Trump administration has cut off vital humanitarian aid, including HIV assistance of which South Africa is the biggest beneficiary; expelled South Africa's ambassador; and offered white South Africans refugee status as millions of black Africans suffer across the continent.  The potential futility of Mr Ramaphosa's strategy came into vision as cameras panned to the back of the Oval Office at the end of the meeting to show a stony-faced Elon Musk. The false claims of white genocide Musk has championed on X are now a powder keg in US-South African relations, as he works to get Starlink licensed in his home country. A business strategy that even South Africa's iconic negotiator may not be able to contend with. Mr Ramaphosa also said of the behaviour alleged by Mr Trump: \"We are completely opposed to that.\" The South African leader said there was crime in his country, and the majority of victims were black. Mr Trump cut him off and said: \"The farmers are not black.\" The South African president responded: \"These are concerns we are willing to talk to you about.\" In February, Mr Trump issued an executive order which cut all funding to South Africa over some of its domestic and foreign policies. He also expelled South Africa's ambassador and offered refuge to white minority Afrikaners based on racial discrimination claims which Pretoria says are baseless. Experts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate."
    },
    {
        "title": "Donald Trump's administration officially accepts $400m plane as gift from Qatar",
        "description": "The Trump administration has officially accepted a luxury jet that will be used as Air Force One as a gift from Qatar, the Pentagon said. ",
        "url": "https://news.sky.com/story/donald-trumps-administration-officially-accepts-400m-plane-as-gift-from-qatar-13372304",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-jet-plane_6914667.png?20250513020237",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-21 18:03:00",
        "Headline": "The jet - dubbed a \"palace-in-the-sky\" - will be refitted to serve as Air Force One - and while the plane is a gift, the overhaul could reportedly cost $1bn.",
        "Content": "The Trump administration has officially accepted a luxury jet that will be used as Air Force One as a gift from Qatar, the Pentagon said.  US defence secretary Pete Hegseth accepted the $400m Boeing 747 and has tasked his department with working to upgrade the plane to make it safe for use by the president. Pentagon spokesman Sean Parnell said the plane - dubbed a \"palace-in-the-sky\" - was accepted \"in accordance with all federal rules and regulations\". Mr Trump has faced scrutiny over the jet, with critics questioning whether receiving the aircraft from the Qatari royal family violates constitutional laws on gifts from foreign governments. The US president has rubbished concerns, telling reporters last week: \"I think it's a great gesture from Qatar. \"I appreciate it very much. I would never be one to turn down that kind of an offer. \"I mean, I could be a stupid person saying: 'No, we don't want a free, very expensive airplane'.\" \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Is Musk ditching Trump?  \n                 \n                  Former spy chief on Gaza, China, and cyber warfare\n                 The gift came up during Mr Trump's recent trip to the Middle East. During the tour, he posted on his Truth Social platform: \"Why should our military, and therefore our taxpayers, be forced to pay hundreds of millions of Dollars when they can get it for FREE.\" Read more:Inside Air Force OneTrump ambushes South African president While the plane itself has been gifted, refitting the aircraft to meet security requirements could be costly - with Sky News' US partner NBC reporting the bill could be as high as $1bn. 👉 Follow Trump100 on your podcast app 👈 In a bid to quiet some opposition, Mr Trump has said he will not keep the plane after his term finishes, instead donating it to a future presidential library. However, that has done little to quell anger - which has even come from within the Republican party. Senator Josh Hawley previously said: \"My view is that it would be better if Air Force One were a big, beautiful jet made in the United States of America. That would be ideal.\" Boeing has been working to finish new Air Force One jets for years, and the president has previously complained about the delays. But the Trump administration has presented no national security imperative for a swift upgrade, rather than waiting for those to be ready."
    },
    {
        "title": "Universal opens $7bn Epic Universe theme park to rival Disney World in Florida",
        "description": "Universal has opened a new theme park to rival Disney World in Florida. ",
        "url": "https://news.sky.com/story/universal-opens-7bn-epic-universe-theme-park-to-rival-disney-world-in-florida-13372188",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-universal-florida_6923351.jpg?20250521153603",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:14:00",
        "Headline": "The 750-acre park features five worlds themed around movie and game franchises NBCUniversal owns or licenses, including Harry Potter and How to Train Your Dragon.",
        "Content": "Universal has opened a new theme park to rival Disney World in Florida.  NBCUniversal owner Comcast, which also owns Sky News, is rewriting the Orlando travel itinerary with its $7bn Epic Universe. The 750-acre park features five worlds themed around movie and game franchises NBCUniversal owns or licenses. These include Super Nintendo World, complete with a Mario Kart ride, and the immersive Wizarding World of Harry Potter - Ministry of Magic. How to Train Your Dragon - Isle of Berk, Celestial Park and Dark Universe complete the park. The project is the first major theme park to open in the US in more than 20 years and marks Comcast's largest investment in Universal attractions since it gained control of the business in 2011. Comcast president Mike Cavanaugh said: \"This is the one part of the media ecosystem that is not vulnerable to screen-shifting. It's still beloved as a thing to do with friends and family. \"It would be silly not to be stepping on the gas.\" Epic Universe could attract 9.5 million visitors and bring in more than $1.3bn in revenue in 2026, analyst Craig Moffett has predicted. Another new Universal theme park is also in the pipeline, with the company set to open its first European resort in 2031. More from Sky News:New Princess Kate waxwork unveiledSesame Street finds new home The park will be in Bedfordshire and is expected to become the UK's most popular visitor attraction. The UK government has said it will bring in an estimated £50bn to the British economy and create around 28,000 jobs."
    },
    {
        "title": "Chris Brown released on bail - but must pay £5m security fee",
        "description": "US singer Chris Brown says he has gone \"from the cage to the stage\" after being released on bail in time for his world tour. ",
        "url": "https://news.sky.com/story/chris-brown-released-on-bail-but-must-pay-1635m-security-fee-13372082",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-21 11:47:00",
        "Headline": "Brown, 36, faces a charge of grievous bodily harm following an alleged assault at a London nightclub in 2023.",
        "Content": "US singer Chris Brown says he has gone \"from the cage to the stage\" after being released on bail in time for his world tour.  The 36-year-old was granted bail by Judge Tony Baumgartner at Southwark Crown Court on Wednesday - but must pay a £5m security fee to the court. Brown did not appear in person. The musician had been remanded in custody following an initial hearing at Manchester Magistrates' Court on Friday but is now free to leave ahead of his next court appearance in London on 20 June. He faces a charge of grievous bodily harm following an alleged assault at a London nightclub called Tape in 2023. In an all-caps post on his Instagram story on Wednesday night, he wrote: \"FROM THE CAGE TO THE STAGE!!!\" Referring to the name of his upcoming international tour, he added: \"BREEZYBOWL.\" Brown's bail conditions allow him to continue travelling for his tour, which has dates in the UK in June and July, but he must not use his passport for any other purposes. The judge also ruled that he must live at a specific address, which he must submit to the court, and is not allowed to visit Tape, contact the alleged victim, or apply for any international travel documents. Read more from Sky NewsShoplifter banned from all Greggs storesFormer aide to Ukrainian president shot deadUK's oldest polar bear euthanised Brown - known for hits such as Loyal, Run It and Under The Influence - was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police, with the singer having flown to the city by private jet in preparation for his tour. Appearing before magistrates the following day, he listened intently as brief details of the case against him were outlined by the prosecutor. She said the alleged victim, music producer Abraham Diaw, was subjected to an \"unprovoked attack\" with a \"weapon... in a nightclub full of people\". The prosecution says the alleged victim was struck several times with a bottle and followed to a separate area of the nightclub where he was repeatedly punched and kicked. A second US rapper, best known by his stage name HoodyBaby, has also been charged with GBH over the same incident. Omololu Akinlolu, 38, will also appear at Southwark Crown Court on 20 June. A case management hearing for the pair has been set for 24 October."
    },
    {
        "title": "Is Musk ditching Trump?  ",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>    ",
        "url": "https://news.sky.com/story/is-musk-ditching-trump-13371879",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-21 03:24:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    Elon Musk says he's \"done enough\" political spending and will cut back in future, but what does this mean for Donald Trump's mid-term election plans? Sky News US correspondents Mark Stone and James Matthews discuss the timing of Musk's decision after he faced criticism for slashing spending with the Department of Government Efficiency (DOGE). And, as Trump announced a multi-billion-dollar missile defence system for the US, how will he pay for the \"Golden Dome\"? You can watch how Israel's Iron Dome works here. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "M&S website down - hours after financial impact of ransomware attack revealed",
        "description": "The M&S website is down - hours after the retailer revealed it's facing a &#163;300m hit to profits following last month's ransomware attack.",
        "url": "https://news.sky.com/story/ms-website-down-hours-after-financial-impact-of-ransomware-attack-revealed-13372433",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-m-and-s-marks-and-spencer_6923742.jpg?20250521233206",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-21 23:02:00",
        "Headline": "M&S recently warned that disruption could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\".",
        "Content": "The M&S website is down - hours after the retailer revealed it's facing a £300m hit to profits following last month's ransomware attack. A holding page told customers that they are currently unable to browse the site, adding: \"We're making some updates and will be back soon.\" Online purchases have been suspended since the incident on 22 April, and it may be a couple of weeks before services are partially restored. Sky News understands that the maintenance is routine.  M&S recently warned that disruption to its operations could last into July, but chief executive Stuart Machin says the retailer is \"on the road to recovery\". It is widely believed the retailer fell victim to Scattered Spider, a hacking group that has also been linked to similar attacks targeting The Co-op and Harrods. Last week, M&S also admitted personal data belonging to some of its customers has been stolen - but the company stressed this didn't include \"usable payment or card details\". \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 \n                  Money blog: House prices rising at fastest pace since 2022 - with these regions growing most\n                 Passwords were also not affected, but there are reports that contact details such as names, addresses and phone numbers was taken. The company's valuation has plunged by more than £1bn as the fallout deepens. \"This incident is a bump in the road, and we will come out of this in better shape, and continue our plan to reshape M&S for customers, colleagues and shareholders,\" Mr Machin told analysts on Wednesday."
    },
    {
        "title": "Inflation surges to 3.5% due to April bill shock",
        "description": "The pace of inflation surged last month to an annual rate of 3.5%, its highest level in more than a year, according to official figures which pointed to hikes to essential household bills.",
        "url": "https://news.sky.com/story/inflation-surges-to-35-due-to-april-bill-shock-13371890",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bills-biz-cost-of-living_6881705.png?20250410131148",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-05-21 04:29:00",
        "Headline": "ONS data shows the rise from 2.6% the previous month is down to increases in many essential bills, including those for energy and water.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  The pace of inflation surged last month to an annual rate of 3.5%, its highest level in more than a year, according to official figures which pointed to hikes to essential household bills. The Office for National Statistics (ONS) said the increase, up from a 2.6% rate in March, was explained by an unusual increase to energy bills during April and steeper rises for other staples such as water. Households on the energy price cap saw a rare spring rise of 6.4% in April, while council tax bills were widely up by the 5% level. Money latest: Reaction to inflation spike The water regulator allowed suppliers to charge customers an extra £10 per month, on average, across England and Wales while broadband, mobile and TV licence costs also rose. ONS acting director general Grant Fitzner said of the price picture: \"Significant increases in household bills caused inflation to climb steeply. \"Gas and electricity bills rose this month compared with sharp falls at the same time last year due to changes to the Ofgem energy price cap. \n                  M&S website down - hours after financial impact of ransomware attack revealed\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 \n                  Money blog: House prices rising at fastest pace since 2022 - with these regions growing most\n                 \"Water and sewerage bills also rose strongly this year as did vehicle excise duty, which all pushed the headline rate up to its highest level since the beginning of last year. \"This was partially offset by falling prices for motor fuels and clothing, driven by heavy discounting for children's garments and women's footwear.\" The consumer prices index measure of inflation is closely-watched as rising numbers make it difficult for the Bank of England to cut interest rates - raised sharply by the Bank from December 2021 to tackle the infancy of the cost of living crisis. There have been four cuts since August last year, as easing inflation has allowed. In advance of the ONS data, financial markets had fully priced in two further interest rate reductions this year, with no change expected at the Bank's next rate-setting meeting in mid-June.  The inflation numbers also make for tough reading at the Treasury, where Chancellor Rachel Reeves is juggling several challenges. While the recent economic growth figures have been encouraging, economists widely expect hikes to consumer bills to apply a further choke to consumer spending in the months ahead. Ms Reeves said: \"I am disappointed with these figures because I know cost of living pressures are still weighing down on working people. \"We are a long way from the double digit inflation we saw under the previous administration, but I'm determined that we go further and faster to put more money in people's pockets. \"That's why we have increased the minimum wage for millions of working people, frozen fuel duty to protect commuters and struck three trade deals in the past two weeks that will go towards cutting bills.\" Read more from Sky News:M&S warns of £300m hacking hit and months of disruptionTalks to end Birmingham bin strikes 'sabotaged' Economists have questioned whether the inflation numbers may have also been pushed higher due to firms passing on costs after the chancellor's decision to raise employer national insurance contributions and the minimum wage last month. Shadow chancellor Sir Mel Stride blamed Labour's \"damaging\" tax increase for the rise in inflation. He said: \"We left Labour with inflation bang on target, but Labour's economic mismanagement is pushing up the cost of living for families - on top of the £3,500 hit to households from the chancellor's damaging jobs tax. \"Families are paying the price for the Labour chancellor's choices.\""
    },
    {
        "title": "Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure",
        "description": "Johnson Matthey, the London-listed industrial group, will on Thursday announce the sale of a unit involved in the production of sustainable aviation fuel (SAF) as its board fends off pressure from an American activist investor.",
        "url": "https://news.sky.com/story/johnson-matthey-to-unveil-16315bn-plus-sale-amid-activist-pressure-13372286",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-johnson-matthey-chemicals_5396858.png?20210527160113",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-21 17:30:00",
        "Headline": "The London-listed industrial group, which is under pressure from an activist investor, will unveil a deal on Thursday to sell one of its four main divisions for between £1.5bn and £2bn, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Johnson Matthey, the London-listed industrial group, will on Thursday announce the sale of a unit involved in the production of sustainable aviation fuel (SAF) as its board fends off pressure from an American activist investor. Sky News has learnt that Johnson Matthey will announce, as part of its full-year result, that it is selling its Catalyst Technologies arm - one of four main divisions at the company. Banking sources said the deal had been agreed for a price of between £1.5bn and £2bn - which at the upper end would equate to more than 80% of the group's entire £2.3bn market capitalisation. The identity of the buyer could not be established on Wednesday evening. Read more:M&S warns of £300m hacking crisis hit - and disruption could last monthsInflation surges to 3.5% due to April bill shock Selling its Catalyst Technologies is expected to be welcomed by some shareholders who have argued that Johnson Matthey has been insufficiently focused on higher-growth businesses with more obvious potential to generate financial returns. The London-listed company has been under siege from Standard Industries, the US-based conglomerate which is its biggest shareholder with a stake of over 10%. \n                  M&S website down - hours after financial impact of ransomware attack revealed\n                 \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Money blog: House prices rising at fastest pace since 2022 - with these regions growing most\n                 Standard Industries wrote an open letter to Johnson Matthey's board in January, accusing it of destroying shareholder value. It said the British company's directors were guilty of a \"continued lack of urgency and incapacity...to do what is necessary to turn Johnson Matthey around and help it to realise its potential\". The Catalyst Technologies arm accounted for roughly a fifth of group sales in the half-year to the end of August, but about a third of group profit. As well as being involved in the production of technology needed to make SAF, the division is a market leader in supplying specialised services to the chemicals and energy sectors, with a particular focus on decarbonisation. More generally, Johnson Matthey is one of Britain's most significant industrial names, tracing its history back to 1817. A spokesman for Johnson Matthey, which has seen its shares slump by nearly a quarter over the last year, declined to comment on Wednesday."
    },
    {
        "title": "Defence AI start-up Adarga races to land new funding",
        "description": "A developer of AI-driven software used by the defence and intelligence communities and backed by a fund which employs the former defence secretary, Sir Ben Wallace, is racing to secure millions of pounds of new funding.",
        "url": "https://news.sky.com/story/defence-ai-start-up-adarga-races-to-land-new-funding-13372045",
        "image_url": "https://e3.365dm.com/17/12/1920x1080/skynews-donald-brydon-xavier_4175551.jpg?20230504114053",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-21 10:34:00",
        "Headline": "The company, chaired until recently by City grandee Sir Donald Brydon, is in talks to raise roughly £8m in an accelerated funding round, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A developer of AI-driven software used by the defence and intelligence communities and backed by a fund which employs the former defence secretary, Sir Ben Wallace, is racing to secure millions of pounds of new funding. Sky News has learnt that Adarga, which was founded in 2016, is in detailed talks with a prospective investor about injecting between £6m and £8m into the company. A board meeting is understood to have been scheduled for Wednesday to discuss the potential capital injection. Money latest: What the inflation spike means for you The accelerated fundraising comes several weeks after Sir Donald Brydon, the City grandee who has chaired companies including Royal Mail Group and London Stock Exchange Group, stepped down as Adarga's chairman. He has been replaced in that role by Rob Bassett Cross, the former Army officer who founded and runs the software business. Sir Donald took up the role in May 2022. \n                  M&S website down - hours after financial impact of ransomware attack revealed\n                 \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 Adarga announced a $20m funding round exactly two years ago to facilitate its expansion. That round was led by BOKA Group, a so-called deeptech investor which now employs Sir Ben as a partner. Read more from Sky News:M&S warns of £300m hacking hit and months of disruptionTalks to end Birmingham bin strikes 'sabotaged' Adarga describes itself as specialising in information intelligence, providing data and insights to corporate and other clients to aid their decision-making in often-complex and dangerous situations. It declined to comment on its fundraising talks on Wednesday."
    },
    {
        "title": "Man banned from every Greggs in England and Wales",
        "description": "A prolific shoplifter has been banned from every Greggs in England and Wales after being caught stealing from there seven times, police have said.",
        "url": "https://news.sky.com/story/prolific-shoplifter-banned-from-every-greggs-in-england-and-wales-13371954",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-greggs-bakery_6642874.jpg?20240730124722",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-21 08:01:00",
        "Headline": "Patrick Verry, 33, of no fixed address, was caught in the act by plain clothes officers at a Greggs store in Wood Green, north London, on 15 May. He had been seen stealing from the same Greggs on the shop's CCTV six times previously.",
        "Content": " A prolific shoplifter has been banned from every Greggs in England and Wales after being caught stealing from there seven times, police have said. Patrick Verry, 33, of no fixed address, was caught in the act by plain clothes officers at a Greggs store in Wood Green, north London, on 15 May. Bodycam footage of the incident shows him taking several items from the fridge in his bag and walking out without paying.   When the officers first approach him, he says \"whatever mate\", until they begin to restrain him and place him under arrest. Realising they are police officers, Verry pleads that he is \"not resisting\" and says: \"I apologise bruv, I'm sorry.\" Read more Sky NewsThird man charged over Starmer firesM&S warns of further hacking damageGirl who drowned at waterpark unlawfully killed He had been seen stealing from the same Greggs on the shop's CCTV six times previously. He pleaded guilty to six counts of theft from the shop at Highbury Corner Magistrates' Court on 16 May and was banned from all Greggs throughout England and Wales. Releasing the bodycam video on social media, the Metropolitan Police described the outcome as the \"end of his sausage roll era\". Another man banned from Sainsbury's, Boots and Co-op In a separate probe, they identified another man, Winston Wright, 44, who had stolen more than £2,500 in goods at various shops over four months. He was spotted in Deptford, southeast London, by a PCSO, who arrested him. Wright, from Lewisham, pleaded guilty to eight counts of shoplifting and one count of commercial burglary at Croydon Magistrates Court on 6 May. He was jailed for three months, fined £200, and banned from entering the Royal Borough of Greenwich, as well as every Sainsbury's, Boots, and Co-op in England and Wales for three years. Chief Inspector Rav Pathania, the Metropolitan Police's lead for tackling retail crime, said: \"The Met is focused on tackling the most prolific shoplifters like Wright and Verry. \"They cause fear to retail workers and their offending has a negative impact on communities. \"We continue to work with local business owners to investigate reports of shoplifting, understand concerns and use different tactics to crackdown, including targeted operations and regular patrols.\""
    },
    {
        "title": "Inflation figures awkward for a government promising to boost household finances",
        "description": "Inflation is the most relatable economic metric.",
        "url": "https://news.sky.com/story/inflation-figures-awkward-for-a-government-promising-to-boost-household-finances-13372038",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-reeves-red-box_6807674.jpg?20250521113109",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-05-21 10:19:00",
        "Headline": "Sky's Paul Kelso writes that the ONS data highlights a link between government policy and the acceleration in the pace of price increases.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Inflation is the most relatable economic metric. You might tut at sluggish GDP or sigh at labour market data, presuming you notice them at all, but inflation is the number you feel in your pocket. This month the link could not be plainer. The headline rate of CPI inflation in April jumped 3.5% on the same time a year ago, up almost a percentage point on March, and driven largely by the timing of changes in household bills. Money latest: What surge in inflation means for mortgages April is the start of the new financial year, and households do not need the Office for National Statistics (ONS) to tell them that means price rises. Combined gas and electricity prices are up almost 7% and water bills more than 25% on average, and index-linked broadband and mobile phone increases kicked in too. Add a council tax hike of 5%, not included in the CPI calculation, and Sky News analysis suggests an average annual increase of almost £500 for every household, inescapable for billpayers and awkward for a government that came to power promising to put more money in people's pockets. That case is harder to make when policy choices are considered inflationary. The ONS pointed to increases in transport costs driven by vehicle excise duty - car tax - for both electric and internal combustion engine vehicles. April also saw the introduction of increased employer National Insurance payments and a reduced threshold, along with a 6% increase in the minimum wage, welcome for employees but another pressure on business.  Chancellor Rachel Reeves did not deny that these costs would weigh on employers and could impact prices, but remains steadfast that tax rises were necessary to stabilise the public finances she inherited. She cited the potential impact of recent deals with the US, India and this week the EU to boost trade. Read more from Sky News:M&S warns of £300m hacking hit and months of disruptionTalks to end Birmingham bin strikes 'sabotaged' The good news is that this may be close to the peak of an inflation surge long anticipated by the Bank of England and, while wages continue to rise faster than prices, the rate of increase may be slowing down. There are also some statistical factors that inflate the April figure a little too, primarily a late Easter (last year it fell in March) which pushed up spending on airfares, recreation and culture. Having already cut rates twice this year the Bank says it remains committed to a \"gradual\" path for further reductions."
    },
    {
        "title": "Birmingham bin strike: Talks to end walkout are being 'sabotaged', union claims ",
        "description": "Government commissioners have been accused of \"sabotaging\" negotiations to end the long-running bin strike in Birmingham.",
        "url": "https://news.sky.com/story/birmingham-bin-strike-talks-to-end-walkout-are-being-sabotaged-union-claims-13371874",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rubbish-strike-bin_6883048.jpg?20250411154015",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-21 02:14:00",
        "Headline": "The Unite union is accusing the government and city council of blocking offers to end the dispute from being made - allegations that both have denied.",
        "Content": "Government commissioners have been accused of \"sabotaging\" negotiations to end the long-running bin strike in Birmingham. According to the Unite union, the city council has missed three deadlines to submit a revised pay offer for workers since talks began on 1 May. Officials claim it has become \"increasingly clear\" that government commissioners and the council's leader have blocked the offer from being made. And while the government argues a \"fair and reasonable offer\" has already been made to refuse workers, Unite alleges this does not exist.  General secretary Sharon Graham said: \"Unite deals with thousands of negotiations every year. From the council side, the negotiations in this dispute have been a shambles, with the government right at the heart of it.\" She claimed the leader of Birmingham City Council \"should stop playing games, get in the room and solve this dispute\" - adding: \"Bin workers, residents and the public at large have all been lied to. \"The bottom line is that our members can't afford to have savage pay cuts of up to £8,000 with no mitigation. Until that issue is addressed the strikes will continue.\" \n                  Brother and sister jailed for 'truly sickening' murder over cannabis debt\n                 \n                  Driver who used car as weapon to murder e-bike rider in Birmingham is jailed\n                 \n                  Birmingham bin strike resolution 'could be in touching distance' - as conciliation service drafted in\n                 Commissioners were brought in by the Conservative government after Birmingham City Council effectively declared itself bankrupt in September 2023. Unite's members have been on all-out strike for more than two months in a row over pay and jobs, with rubbish piling up on the city's streets. Read more UK news:Thames Water drops bonuses for bossesGonorrhoea vaccine to be rolled out  A spokesperson for the Ministry of Housing, Communities and Local Government said: \"It is simply false to suggest the commissioners or the leader of the council have blocked attempts to resolve this deal, and we continue to urge Unite to suspend its strike action and both parties to reach agreement on a fair and reasonable offer.\" Meanwhile, a Birmingham City Council spokesperson said it is \"fully committed\" to ending the dispute - and it is \"untrue\" to imply its leader is blocking the process. \"Our focus has been to find a solution to this that does not put the council in a position that compromises us financially and legally,\" they added. \"This is a service that needs to be transformed to one that citizens of Birmingham deserve.\" ACAS, which is overseeing the talks between both sides, did not respond to a request for comment."
    },
    {
        "title": "Gordon Brown suggests people on top rate of income tax should be excluded from winter fuel",
        "description": "Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said.",
        "url": "https://news.sky.com/story/gordon-brown-suggests-people-on-top-rate-of-income-tax-should-be-excluded-from-winter-fuel-13372219",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gordon-brown-former-prime-minister_6754753.jpg?20241122184723",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-21 16:00:00",
        "Headline": "The former prime minister, who introduced winter fuel as a universal benefit when chancellor, said there is a strong case for it, but suggests society's richest pensioners could be exempt. ",
        "Content": " Governments \"have to be fair\" to pensioners but there is a case for people on the top rate of income tax to be excluded from winter fuel payments, Gordon Brown has said. The former Labour prime minister told Sky News' Sophy Ridge that he welcomed Sir Keir Starmer's backtrack over his unpopular decision to means-test the allowance, which Mr Brown introduced as a universal benefit when he was chancellor in 1997. Politics live: Starmer confirms U-turn on winter fuel payments - but No.10 will not say when Asked if he thought the U-turn was the right move, he said: \"Yeah. I think what Keir's saying is the economy has improved and he feels that the country is in a better position, that they can afford to do better by the pensioner community. \"You must be fair to the different communities in your country when they're struggling... and you've got to be fair to pensioners.\" Mr Brown added there is \"a strong case\" for winter fuel payments for pensioners, but suggested the richest in society could be exempt. \"I did bring it in as a universal benefit,\" he said. \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Sir Tony Blair and Gordon Brown lead tributes to Lord Prescott at his funeral\n                 \n                  Justice secretary's assisted dying intervention is explosive - and potentially embarrassing for PM\n                 \"I think there is a case, for example, for people on the top rate of tax not receiving it, but that's something the government has got to decide. \"That was in the Labour 2015 manifesto, so I think the government's got decisions to make... but to me, the issue is nobody should be pushed into poverty if they're doing the right thing. \"Nobody who's working hard or nobody who's served the country well over their lifetime should be pushed into poverty if we can avoid it, and I believe that that's what he's [Keir] is really thinking about, a fairness guarantee for pensioners.\" Sir Keir announced that he would \"look\" at making more pensioners eligible during PMQs earlier on Wednesday. He told MPs: \"I recognise that people are still feeling the pressure of the cost of living crisis, including pensioners. \"As the economy improves, we want to make sure people feel those improvements in their days as their lives go forward. \"And that is why we want to ensure that as we go forward, more pensioners are eligible for winter fuel payment.\" While it appears a full reversal will not be implemented, the Treasury could raise the threshold at which pensioners can qualify for winter payments, which is currently £11,500. Read More:Why Keir Starmer's strategy to tackle Reform UK could end up backfiringBrexit wounds' mean EU states want to limit UK's access to rearmament fund The decision follows significant backlash from Labour MPs, who blamed the policy on the party's poor performance at the local elections this month. Means-testing the winter fuel payments, worth up to £300, was one of the first policies brought in by the Labour government. Overall, the number of pensioners eligible for the payment was slashed from 11.4 million to 1.5 million. The government argued it would save £1.5bn each year and put the public finances under control, after claiming the Tories left behind a larger-than-expected fiscal black hole of £22bn. However, in the aftermath of the May local elections - which saw Labour lose 189 council seats - more high-profile party figures began speaking out against the policy."
    },
    {
        "title": "Rayner tells Reeves she's wrong",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/rayner-tells-reeves-shes-wrong-13371915",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-21 06:12:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. Sir Keir Starmer and Rachel Reeves will have their strategy tested today as Deputy Prime Minister Angela Rayner sets out her plan for higher taxes, and questions are raised about their approach to Reform. Is becoming Reform-lite the way to go? And, as the prime minister joins global efforts to put pressure on Israel over Gaza, could more sanctions be next?"
    },
    {
        "title": "Israel has gone 'beyond just self-defence' with 'intolerable' attacks in Gaza, says minister",
        "description": "Israel has gone \"beyond just self-defence\" as an \"intolerable\" military offensive continues in Gaza, Environment Secretary Steve Reed has told Sky News.",
        "url": "https://news.sky.com/story/israel-has-gone-beyond-just-self-defence-with-intolerable-attacks-in-gaza-says-minister-13371920",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-smoke-israeli_6922862.jpg?20250521070758",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-21 06:27:00",
        "Headline": "Environment Secretary Steve Reed says the UK can \"no longer tolerate\" the situation and calls for an \"immediate ceasefire\" and the return of any remaining hostages.",
        "Content": " Israel has gone \"beyond just self-defence\" as an \"intolerable\" military offensive continues in Gaza, Environment Secretary Steve Reed has told Sky News. The UK has suspended trade deal talks with Israel, summoned its ambassador and sanctioned West Bank settlers in a bid to ramp up pressure on the country. Politics latest: Reeves says winter fuel cut 'was necessary' Attacks have accelerated in the Gaza Strip and international aid has been restricted, with local Palestinian doctors claiming at least 55 people were killed in Israeli strikes on Tuesday alone. Speaking to Wilfred Frost on Sky News Breakfast, Mr Reed said the UK can \"no longer tolerate\" the situation, as he called for an \"immediate ceasefire\" and the return of any remaining hostages.  The minister said: \"This has gone beyond just self-defence on the part of Israel. This is an attack that we can no longer tolerate. \"We are looking at what steps we can take as a UK government in concert with our allies to encourage Israel to stop the hostilities, get round the negotiating table and bring this situation, this crisis, to a close.\" Asked if the government is considering sanctions on Israeli Prime Minister Benjamin Netanyahu, the environment secretary refused to speculate. But he left the door open for further action against Israel. Mr Reed said he hopes \"what we've announced will already be enough\", adding: \"Let's see what happens now\". Former Labour leader Jeremy Corbyn claimed questions about the UK's relationship with Israel are being met with \"silence and evasion\". He is due to table his Gaza (Independent Public Inquiry) Bill in the Commons on 4 June, which he can support with a speech lasting up to 10 minutes. \"We are witnessing a genocide, live-streamed before the entire world, and Britain's continued military co-operation with Israel is utterly indefensible,\" he said. The now-independent MP for Islington North added: \"The public deserves to know the full scale of the UK's complicity in crimes against humanity - and we are not going anywhere until we have established the truth.\" On Tuesday, Foreign Secretary David Lammy hit out at the renewed military offensive in Gaza and the restrictions on aid to the population of the territory, describing Israel's actions as \"monstrous\". Middle East minister Hamish Falconer called Israeli ambassador Tzipi Hotovely to the Foreign Office to set out the UK's opposition to Israel's 11-week block on aid into Gaza and its escalation of military activity. But Number 10 has faced criticism for not referring to the situation as \"genocide\". The government has always insisted that genocide is a legal term which would need to be decided by the courts."
    },
    {
        "title": "Birmingham bin strike: Talks to end walkout are being 'sabotaged', union claims ",
        "description": "Government commissioners have been accused of \"sabotaging\" negotiations to end the long-running bin strike in Birmingham.",
        "url": "https://news.sky.com/story/birmingham-bin-strike-talks-to-end-walkout-are-being-sabotaged-union-claims-13371874",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rubbish-strike-bin_6883048.jpg?20250411154015",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-21 02:14:00",
        "Headline": "The Unite union is accusing the government and city council of blocking offers to end the dispute from being made - allegations that both have denied.",
        "Content": "Government commissioners have been accused of \"sabotaging\" negotiations to end the long-running bin strike in Birmingham. According to the Unite union, the city council has missed three deadlines to submit a revised pay offer for workers since talks began on 1 May. Officials claim it has become \"increasingly clear\" that government commissioners and the council's leader have blocked the offer from being made. And while the government argues a \"fair and reasonable offer\" has already been made to refuse workers, Unite alleges this does not exist.  General secretary Sharon Graham said: \"Unite deals with thousands of negotiations every year. From the council side, the negotiations in this dispute have been a shambles, with the government right at the heart of it.\" She claimed the leader of Birmingham City Council \"should stop playing games, get in the room and solve this dispute\" - adding: \"Bin workers, residents and the public at large have all been lied to. \"The bottom line is that our members can't afford to have savage pay cuts of up to £8,000 with no mitigation. Until that issue is addressed the strikes will continue.\" \n                  Brother and sister jailed for 'truly sickening' murder over cannabis debt\n                 \n                  Driver who used car as weapon to murder e-bike rider in Birmingham is jailed\n                 \n                  Birmingham bin strike resolution 'could be in touching distance' - as conciliation service drafted in\n                 Commissioners were brought in by the Conservative government after Birmingham City Council effectively declared itself bankrupt in September 2023. Unite's members have been on all-out strike for more than two months in a row over pay and jobs, with rubbish piling up on the city's streets. Read more UK news:Thames Water drops bonuses for bossesGonorrhoea vaccine to be rolled out  A spokesperson for the Ministry of Housing, Communities and Local Government said: \"It is simply false to suggest the commissioners or the leader of the council have blocked attempts to resolve this deal, and we continue to urge Unite to suspend its strike action and both parties to reach agreement on a fair and reasonable offer.\" Meanwhile, a Birmingham City Council spokesperson said it is \"fully committed\" to ending the dispute - and it is \"untrue\" to imply its leader is blocking the process. \"Our focus has been to find a solution to this that does not put the council in a position that compromises us financially and legally,\" they added. \"This is a service that needs to be transformed to one that citizens of Birmingham deserve.\" ACAS, which is overseeing the talks between both sides, did not respond to a request for comment."
    },
    {
        "title": "West Nile virus found in UK mosquitos for first time",
        "description": "West Nile virus has been found in mosquitoes collected in the UK for the first time, the UK Health Security Agency (UKHSA) has said.",
        "url": "https://news.sky.com/story/west-nile-virus-found-in-uk-mosquitos-for-first-time-13372034",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mosquito-aedes-vexans_6923098.jpg?20250521115143",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-21 10:05:00",
        "Headline": "No cases of transmission to humans have been registered in Britain to date, and the UKHSA assessed the risk to the general public as \"very low\". ",
        "Content": "West Nile virus has been found in mosquitoes collected in the UK for the first time, the UK Health Security Agency (UKHSA) has said. The virus, which mostly spreads to people through mosquito bites, can cause severe, life-threatening flu-like illness in about one in 150 people who are infected, according to the World Health Organization (WHO). Mosquitoes pick up the virus from birds they bite and, in rare cases, can pass it on to people or horses. Research by the UKHSA and the Animal and Plant Health Agency (APHA) has now detected the virus in fragments of Aedes vexans mosquitoes collected from wetlands on the River Idle near Retford, Nottinghamshire, in July 2023.  This is the first time West Nile virus has been found in mosquitoes in the UK. No cases of local transmission to humans have been registered in Britain to date, and the UKHSA assessed the risk to the general public as \"very low\". The agency said in a statement that, based on available surveillance, there was no evidence to suggest ongoing circulation of the virus in birds or mosquitoes in the UK. Nevertheless, the UKHSA issued advice to healthcare professionals enabling them to test patients with encephalitis (swelling of the brain) of an unknown cause for West Nile virus as a precaution. Read more from Sky News:Public does have right to wild camp on DartmoorUK's oldest polar bear euthanised at the age of 28 It will also enhance disease surveillance and control activities in light of the findings. \"While this is the first detection of West Nile virus in mosquitoes in the UK so far, it is not unexpected as the virus is already widespread in Europe. The risk to the general public is currently assessed as very low,\" Dr Meera Chand, UKHSA deputy director for travel health, zoonoses, emerging infections, respiratory and tuberculosis, said. Dr Arran Folly, leading the project which detected the virus, said finding it in Britain was \"part of a wider changing landscape, where, in the wake of climate change mosquito-borne diseases are expanding to new areas\". He said the Aedes vexans mosquito is native to the UK. But warming temperatures could also bring non-native species capable of transmitting infectious diseases to humans into the country as they could find it easier to survive, reproduce and establish a local population here. The main risk for contracting West Nile virus for UK residents is travel to endemic areas, which include Europe, Africa, the Middle East, West and Central Asia, North and South America, Australia and the US. There have been seven travel-associated cases of the virus in the UK since 2000."
    },
    {
        "title": "Sex offender found with six-year-old girl after facial recognition technology spots him",
        "description": "A registered sex offender was found with a six-year-old girl after he was detected by facial recognition technology.",
        "url": "https://news.sky.com/story/sex-offender-found-with-six-year-old-girl-after-facial-recognition-technology-spots-him-13372194",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-david-cheneler-police_6923417.jpg?20250521163806",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:39:00",
        "Headline": "David Cheneler, 73, was discovered with the child - whose mother was \"completely unaware of his offending history\" - in Camberwell, south London.",
        "Content": "A registered sex offender was found with a six-year-old girl after he was detected by facial recognition technology. David Cheneler, 73, was discovered with the child - whose mother was \"completely unaware of his offending history\" - after he was identified by a police van in Camberwell, south London, in January. He was spotted using advanced technology known as Live Facial Recognition (LFR), where live footage is recorded of members of the public as they walk past, capturing their faces, which are then compared against a database of wanted offenders. If a match is determined, the system creates an alert, which is assessed by an officer. If suspicions are aroused, the police officer may decide to speak with the individual in question. When Cheneler was detected on 10 January, cameras alerted the authorities to his status as a registered sex offender. Additional checks confirmed he had breached his Sexual Offences Prevention Order (SOPO), which prohibited him from being alone with children under 14. Cheneler was also in possession of a lock knife hidden in the buckle of his belt. He was subsequently arrested and taken into custody. Lindsey Chiswick, the Metropolitan Police's lead for LFR, said it was \"a prime example of the variety of uses\" of the technology. \"The tool is not only used to find those wanted, but also to stop people on a watch list who have conditions they must adhere to,\" she added. \"These interventions are crucial. Without this technology, Cheneler may have had the opportunity to cause further harm.\" Cheneler had picked up the child from school as a favour to her mother, which he had done twice previously, according to the Met Police. Read more on Sky News:Jay Slater's mother breaks down in tears at inquestChris Brown released on bail - but must pay £5m Detective Constable Adam Pearce said: \"Although there were no allegations made towards David Cheneler on this occasion, it's possible if he hadn't been identified using this technology, he could have gone on to abuse this child. \"Her mother was completely unaware of his offending history, and along with her young daughter, were both taken advantage of by Cheneler who abused their trust.\" Cheneler was sentenced to two years' imprisonment at Kingston Crown Court on Tuesday. In January, he pleaded guilty at Wimbledon Magistrates' Court to breaching the conditions of his SOPO, and to possessing an offensive weapon."
    },
    {
        "title": "Radiation-resistant bacteria with 'unique ability' found on space station could be key for cosmos travel",
        "description": "A new species of bacteria discovered on board a space station could have profound implications for astronauts and long-term travel through the cosmos.",
        "url": "https://news.sky.com/story/radiation-resistant-bacteria-with-unique-ability-found-on-space-station-could-be-key-for-cosmos-travel-13372032",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-tiangong-space-station_6923073.jpg?20250521112321",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-21 10:12:00",
        "Headline": "Chinese taikonauts found the new bacteria on the surface of hardware on board the Tiangong Space Station. ",
        "Content": "A new species of bacteria discovered on board a space station could have profound implications for astronauts and long-term travel through the cosmos. A strain of Niallia with a \"unique ability\" was found on China's Tiangong Space Station, according to a scientific report. The discovery was announced in the International Journal of Systematic and Evolutionary Microbiology. Chinese taikonauts found the new bacteria on the surface of hardware on board the station in May 2023, and it was analysed to see how it survived in such tough conditions \"Understanding the characteristics of microbes during long-term space missions is essential for safeguarding the health of astronauts and maintaining the functionality of spacecraft,\" the report says. Challenges faced by living things in such environments include microgravity, radiation, and limited nutrients. Read more:Microbes cling on to International Space Station  \n                  What astronauts could end up eating in space after experiment 'meets objectives'\n                 \n                  The moon's very different sides explained in new NASA study\n                 \n                  Half-tonne piece of Soviet rocket may have crashed through atmosphere over south of England\n                 The study of which bacteria survive on space stations is also necessary for understanding how to control and avoid contamination on board. According to the report, this new strain - which most closely resembles Niallia circulans found on Earth - may be better resistant to radiation and oxidative stress. It also has a \"unique ability\" to hydrolyse (break down) gelatine, which could be useful in environments with limited nutrients."
    },
    {
        "title": "M&S warns of £300m hacking crisis hit - and disruption could last months",
        "description": "Marks and Spencer (M&S) has warned investors it is facing a &#163;300m hit to trading profits as a result of last month's ransomware attack.",
        "url": "https://news.sky.com/story/ms-warns-of-163300m-profit-hit-due-to-hacking-crisis-13371908",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Technology",
        "Author": "James Sillars",
        "Date Published": "2025-05-21 05:47:00",
        "Headline": "The retailer's boss thanks customers for their \"unwavering support\" as he updates them, and investors, on the continuing impact from last month's cyberattack.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Marks and Spencer (M&S) has warned investors it is facing a £300m hit to trading profits as a result of last month's ransomware attack. The company said it was aiming to reduce the figure significantly through management of some costs, including the prospect of insurance payouts, but added disruption to its operations could last into July. The continuing fallout from last month's cyberattack is hanging over the retailer's outlook as its online channels remain down for payments. Website sales are expected to resume, at least partially, in a couple of weeks' time. Money latest: Reaction to inflation spike M&S said it could not comment on whether it had paid a ransom to the hackers. Chief executive Stuart Machin, who blamed \"human error\" for the attack, told an analysts' call the company was \"on the road to recovery\" and \"getting back to business\". \n                  M&S website down - hours after financial impact of ransomware attack revealed\n                 \n                  Inflation surges to 3.5% due to April bill shock\n                 \n                  Johnson Matthey to unveil £1.5bn-plus sale amid activist pressure\n                 It is widely believed the group fell victim to the same hackers, known as Scattered Spider, who were linked to similar attacks on the Co-op and Harrods towards the end of April. Both M&S and the Co-op have admitted personal customer data was snatched, but say the thefts were limited to names and contact details, with payment details safe. The Co-op said last week it was aiming to improve grocery availability in its stores but progress is believed to have been limited so far, with some empty shelves still being reported. M&S has seen more than one billion pounds lost from its stock market value since it declared the incident on 22 April.  The company said of its predicament: \"Over the last few weeks, we have been managing a highly sophisticated cyber incident. As a team, we have worked around the clock with suppliers and partners to contain the incident and stabilise operations, taking proactive measures to minimise the disruption for customers. \"We are seeking to make the most of the opportunity to accelerate the pace of improvement of our technology transformation and have found new and innovative ways of working. \"We are focused on recovery, restoring our systems, operations and customer proposition over the rest of the first half, with the aim of exiting this period a much stronger business. For a high street stalwart that has had a trouble past, today should have been a moment of pride for Marks and Spencer (M&S). With a 22% rise in profits – led by food but with clothing and homeware too, M&S has had a cracking year of sales. The turnaround is well underway.  But there would have been few champagne corks popping at the company’s HQ – after it was revealed Easter’s cyber hack is now going to cost £300m. The company was initially praised early on for its candour in revealing to customers and markets the scale of the attack. But little more has been provided today, with the CEO Stuart Machin not doing interviews and speculation rife about whether the company has paid a ransom. Extraordinary research from Barclays suggests 82% of businesses facing a cyber-attack do pay up. You can probably draw your own conclusions. And according to some insurance analysts, the reason for the lack of clarity may well be on the advice of those insurance companies, who would almost certainly have covered the cost. Whether it is M&S, Co-op or Harrods – hacking is clearly on the rise, impacting companies’ insurance premiums and ultimately their bottom lines. Pay out or no pay out – in the end, it seems all of us customers are ultimately going to end up paying for this growing crime. \"Since the incident, Food sales have been impacted by reduced availability, although this is already improving. We have also incurred additional waste and logistics costs, due to the need to operate manual processes, impacting profit in the first quarter. \"In Fashion, Home & Beauty, online sales and trading profit have been heavily impacted by the necessary decision to pause online shopping, however stores have remained resilient. \"We expect online disruption to continue throughout June and into July as we restart, then ramp up operations. This will also mean increased stock management costs in the second quarter.\" The statement added the anticipated hit to operating profits this year will be around £300m for 2025/26, which will be reduced through management of costs, insurance and other trading actions. It is expected that costs directly relating to the incident will be presented separately as an adjusting item. Read more:What should M&S customers do after cyber theft?Thousands of UK firms at risk from M&S-style hackers Mr Machin thanked customers for being \"unwavering in their support\" for the chain. \"This incident is a bump in the road, and we will come out of this in better shape, and continue our plan to reshape M&S for customers, colleagues and shareholders,\" he said. M&S gave the update while revealing financial results for the year to 29 March. They showed trading profits at a 15-year high. M&S reported a 22.2% rise to £875.5m, with sales up across each of its product divisions. Shareholders were rewarded with a 20% increase in the final dividend. However, that failed to placate investors as the share price fell by almost 3.5% at the market open on Wednesday. Dan Coatsworth, investment analyst at AJ Bell, said of the update: \"Marks & Spencer has lost a significant number of sales after temporarily halting online orders. Disruption to supplies meant gaps on the shelves and more lost sales in-store. It has also incurred extra waste and logistics costs, all having a negative impact on profit. \"The fact online operations might not be back to full power until later in the summer means the company still cannot achieve full earnings potential for some time to come. Marks & Spencer will be able to lower the total hit to profit once it claims on insurance, among other factors, but the cyber-attack has still knocked the business for six. \"There's still a big unknown regarding any potential fines on Marks & Spencer from the Information Commissioner's Office (ICO), which enforces data protection regulation. \"There are plenty of examples of companies that have been fined by the ICO for not taking appropriate steps to prevent data breaches. The maximum fine by the ICO is £17.5m or 4% of global annual turnover, whichever is higher. Marks & Spencer has just reported £13.8bn revenue, so 4% of that figure is £552m. \"That's in a worst-case scenario, and any fine would account for many different factors. We're unlikely to find out in the near term if there will be a fine as there will be investigations galore into exactly what's happened and into the retailer's overall data protection capabilities.\""
    },
    {
        "title": "Member of Kneecap charged with terror offence",
        "description": "A member of Irish-language rap group Kneecap has been charged with a terror offence.",
        "url": "https://news.sky.com/story/member-of-kneecap-charged-with-terror-offence-13369377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250521200430",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-21 13:00:00",
        "Headline": "Liam O'Hanna - who performs under the stage name Mo Chara - will appear at Westminster Magistrates' Court next month, the Metropolitan Police says.",
        "Content": "A member of Irish-language rap group Kneecap has been charged with a terror offence. Liam O'Hanna, or Liam Og O Hannaidh, has been charged with displaying a flag in support of Hezbollah, a proscribed organisation, the Metropolitan Police said. The 27-year-old from Belfast - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June. It comes after counter-terror police assessed a video reported to be from a Kneecap concert. The charge relates to a flag that O'Hanna allegedly displayed at the O2 Forum in Kentish Town, London, on 21 November last year. Read more from Sky News:Chris Brown released on bailInside Diddy's star-studded parties Officers from the Met's Counter Terrorism Command were made aware of a video circulating online on 22 April, the force said. An investigation led to the Crown Prosecution Service authorising the charge. Kneecap are due to headline Wide Awake Festival in south London on Friday."
    },
    {
        "title": "Chris Brown released on bail - but must pay £5m security fee",
        "description": "US singer Chris Brown says he has gone \"from the cage to the stage\" after being released on bail in time for his world tour. ",
        "url": "https://news.sky.com/story/chris-brown-released-on-bail-but-must-pay-1635m-security-fee-13372082",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chris-brown_6917859.jpg?20250516000703",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-21 11:47:00",
        "Headline": "Brown, 36, faces a charge of grievous bodily harm following an alleged assault at a London nightclub in 2023.",
        "Content": "US singer Chris Brown says he has gone \"from the cage to the stage\" after being released on bail in time for his world tour.  The 36-year-old was granted bail by Judge Tony Baumgartner at Southwark Crown Court on Wednesday - but must pay a £5m security fee to the court. Brown did not appear in person. The musician had been remanded in custody following an initial hearing at Manchester Magistrates' Court on Friday but is now free to leave ahead of his next court appearance in London on 20 June. He faces a charge of grievous bodily harm following an alleged assault at a London nightclub called Tape in 2023. In an all-caps post on his Instagram story on Wednesday night, he wrote: \"FROM THE CAGE TO THE STAGE!!!\" Referring to the name of his upcoming international tour, he added: \"BREEZYBOWL.\" Brown's bail conditions allow him to continue travelling for his tour, which has dates in the UK in June and July, but he must not use his passport for any other purposes. The judge also ruled that he must live at a specific address, which he must submit to the court, and is not allowed to visit Tape, contact the alleged victim, or apply for any international travel documents. Read more from Sky NewsShoplifter banned from all Greggs storesFormer aide to Ukrainian president shot deadUK's oldest polar bear euthanised Brown - known for hits such as Loyal, Run It and Under The Influence - was arrested at a hotel in Manchester in the early hours of Thursday by detectives from the Metropolitan Police, with the singer having flown to the city by private jet in preparation for his tour. Appearing before magistrates the following day, he listened intently as brief details of the case against him were outlined by the prosecutor. She said the alleged victim, music producer Abraham Diaw, was subjected to an \"unprovoked attack\" with a \"weapon... in a nightclub full of people\". The prosecution says the alleged victim was struck several times with a bottle and followed to a separate area of the nightclub where he was repeatedly punched and kicked. A second US rapper, best known by his stage name HoodyBaby, has also been charged with GBH over the same incident. Omololu Akinlolu, 38, will also appear at Southwark Crown Court on 20 June. A case management hearing for the pair has been set for 24 October."
    },
    {
        "title": "Universal opens $7bn Epic Universe theme park to rival Disney World in Florida",
        "description": "Universal has opened a new theme park to rival Disney World in Florida. ",
        "url": "https://news.sky.com/story/universal-opens-7bn-epic-universe-theme-park-to-rival-disney-world-in-florida-13372188",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-universal-florida_6923351.jpg?20250521153603",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-21 14:14:00",
        "Headline": "The 750-acre park features five worlds themed around movie and game franchises NBCUniversal owns or licenses, including Harry Potter and How to Train Your Dragon.",
        "Content": "Universal has opened a new theme park to rival Disney World in Florida.  NBCUniversal owner Comcast, which also owns Sky News, is rewriting the Orlando travel itinerary with its $7bn Epic Universe. The 750-acre park features five worlds themed around movie and game franchises NBCUniversal owns or licenses. These include Super Nintendo World, complete with a Mario Kart ride, and the immersive Wizarding World of Harry Potter - Ministry of Magic. How to Train Your Dragon - Isle of Berk, Celestial Park and Dark Universe complete the park. The project is the first major theme park to open in the US in more than 20 years and marks Comcast's largest investment in Universal attractions since it gained control of the business in 2011. Comcast president Mike Cavanaugh said: \"This is the one part of the media ecosystem that is not vulnerable to screen-shifting. It's still beloved as a thing to do with friends and family. \"It would be silly not to be stepping on the gas.\" Epic Universe could attract 9.5 million visitors and bring in more than $1.3bn in revenue in 2026, analyst Craig Moffett has predicted. Another new Universal theme park is also in the pipeline, with the company set to open its first European resort in 2031. More from Sky News:New Princess Kate waxwork unveiledSesame Street finds new home The park will be in Bedfordshire and is expected to become the UK's most popular visitor attraction. The UK government has said it will bring in an estimated £50bn to the British economy and create around 28,000 jobs."
    }
]