[
    {
        "title": "Israel allowed to take part in Eurovision 2026 - as several countries withdraw",
        "description": "Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event.",
        "url": "https://news.sky.com/story/israel-allowed-to-take-part-in-eurovision-2026-as-at-least-two-countries-withdraw-13479330",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-israel-eurovision-song-contest_7100933.jpg?20251204135255",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-04 17:45:00",
        "Headline": "Spain, Ireland, Slovenia and the Netherlands have all pulled out of next year's Eurovision contest - with some broadcasters yet to make statements.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event. Dutch broadcaster AVROTROS, Spain's RTVE, Ireland's RTE and Slovenia's RTV immediately issued statements saying they will not participate in the 2026 contest following the European Broadcasting Union's general assembly meeting on Thursday. Members from 37 countries were asked to vote in a secret ballot on whether they were happy with tougher new rules announced last month, without going ahead with a vote on participation next year. It followed criticism from some broadcasters of Israel's role in Eurovision amid the war in Gaza, and allegations that voting at this year's contest had been manipulated in favour of their contestant. In a statement, the EBU, which organises Eurovision, said members had shown \"clear support for reforms to reinforce trust and protect neutrality\". Sky News understands 11 countries voted against only accepting the rule changes. Golan Yochpaz, chief executive of Israel's public broadcaster KAN, said during the meeting that attempts to remove them from the contest could \"only be understood as a cultural boycott\", according to a statement shared by the organisation. Israel's president Isaac Herzog posted on X following the announcement, saying: \"Israel deserves to be represented on every stage around the world, a cause to which I am fully and actively committed... I hope that the competition will remain one that champions culture, music, friendship between nations, and cross-border cultural understanding.\" Boycott announcements - what have broadcasters said? The broadcasters from Spain, Ireland, Slovenia and the Netherlands had all said earlier in the year that they would not participate in 2026 should Israel be allowed to continue in the competition. In a statement following the general assembly meeting, RTE confirmed Ireland's position. \"RTE feels that Ireland's participation remains unconscionable given the appalling loss of lives in Gaza and the humanitarian crisis there which continues to put the lives of so many civilians at risk,\" the broadcaster said. AVROTROS, broadcaster for the Netherlands, said that \"under the current circumstances, participation cannot be reconciled with the public values that are fundamental to our organisation\". General director Taco Zimmerman said it had not been an easy decision, adding: \"Culture unites, but not at any price. What has happened over the past year has tested the limits of what we can uphold.\" Confirming its withdrawal, Spain's RTVE highlighted how its board of directors had agreed in September that the country would withdraw \"if Israel was part of it\". This is a big deal for Eurovision, as Spain is one of the \"Big Five\" broadcasters - a group which also includes France, Germany, Italy and the UK. While the host broadcaster - as last year's winners, this is Austria this year - will often contribute the most towards the cost of staging the contest, the Big Five will also make up a significant amount. Slovenian broadcaster RTV said it was pulling out of the competition \"on behalf of the 20,000 children who died in Gaza\". In her address to members before the decision, Natalija Gorscak, RTV Slovenia board chairwoman, said: \"For the third year in a row, the public has demanded that we say no to the participation of any country that attacks another country. We must follow European standards for peace and understanding. \"Eurovision has been a place for joy and happiness from the very beginning, performers and audiences have been united by music, and it should remain that way.\" Eurovision 'is for broadcasters, not governments' But Austria's broadcaster ORF said it was happy with the decision and is looking forward to hosting next year. Roland Weissman, ORF director-general, said the contest \"is a competition for broadcasters, not governments\", and that he had personally advocated for Israel's participation. \"In the spirit of fostering cultural dialogue and supporting and strengthening the democratic role of public broadcasters, it was important not to burn any bridges,\" he said, adding that concerns raised by some members had been taken \"very seriously\". \"Naturally, I would regret it if broadcasters were to decide against participating,\" he added. \"I see the Eurovision Song Contest in Vienna as an opportunity to emphasise what unites us rather than what divides us - United by Music.\" Politics has always played a part in Eurovision, despite the EBU's insistence that it remains politically neutral. Countries have pulled out or been banned in previous years - most notably Russia in 2022, just days after the invasion of Ukraine. But this exodus could be Eurovision's biggest political crisis yet, with suggestions that other broadcasters may follow suit. Iceland's broadcaster RUV said its board would discuss participation at a meeting next Wednesday, after previously agreeing to a motion to recommend Israel be expelled. The BBC, which broadcasts the competition in the UK, said it supported the decision for Israel to be allowed to take part. \"This is about enforcing the rules of the EBU and being inclusive,\" it said in a statement. Earlier this year, outgoing BBC director-general Tim Davie said the corporation was \"aware of the concerns\" raised, but the song contest had \"never been about politics\". Arts and entertainment correspondent With a slew of countries quitting Eurovision over Israel's inclusion, the competition has been thrown into chaos. This has been brewing for some time. A few months ago, the row had become such a point of contention that the EBU announced plans for an emergency vote. Crucially, that was called off when a Gaza ceasefire was announced. So instead, at its big assembly meeting, countries were only allowed to vote on rule changes being introduced - another issue that allegedly involved Israel amid accusations of unfair voting practices. If you read the EBU's post-meeting statement, you'd think it had gone swimmingly. But while it made it sound like everyone was in agreement, Sky News understands 11 countries in fact voted against the changes. Denied an actual vote on Israel's participation, it triggered a domino effect of countries quitting – the Netherlands, Ireland, Spain and Slovenia. Arguably, Spain pulling out could have the biggest effect. It's one of the key financial backers of the contest – and that could potentially impact the ability to stage it in the grand way we've become to accustomed to. So what happens next? The contest prides itself on maintaining political and cultural neutrality, positioning itself as celebrating music and peace rather than politics. But for now, the big question is: who will be left singing? How have the rules changed? In November, the EBU announced it was changing its voting system. This followed allegations of \"interference\" by Israel's government earlier this year. The rule changes announced in November came after Israeli singer Yuval Raphael received the largest number of votes from the public at the 2025 event, held in Basel, Switzerland, in May - ultimately finishing as runner-up to Austria's entry after the jury votes were counted. But a number of broadcasters raised concerns about Israel's result. Key changes to next year's competition include: • Clearer rules around promotion of artists and their songs• Cap on audience voting halved• The return of professional juries to semi-finals• Enhanced security safeguards It was these changes members were secretly balloted on at the general assembly. With a \"large majority\" voting that they were happy with these changes, the EBU said there was no need for a further vote on participation. Speaking after the discussion, EBU president Delphine Ernotte Cunci said the result \"demonstrates members' shared commitment to protecting transparency and trust in the Eurovision Song Contest, the world's largest live music event\". Thanking members for their \"thoughtful, respectful and constructive contributions\" during the session and throughout the year, she said these discussions had led to \"meaningful changes\" to the rules, ensuring the contest \"remains a place for unity and cultural exchange\"."
    },
    {
        "title": "Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid",
        "description": "The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found. ",
        "url": "https://news.sky.com/story/salisbury-novichok-poisonings-putin-morally-responsible-for-womans-death-after-authorising-botched-spy-assassination-bid-13479213",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/dawn-sturgess-novichok-russia_7100130.jpg?20251203211359",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-12-04 09:06:00",
        "Headline": "Dawn Sturgess's condition was \"unsurvivable\" after she unwittingly sprayed herself with novichok from a perfume bottle left by a Russian military hit squad, report says. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found.  The chairman, Lord Hughes, found there were \"failings\" in the management of Sergei Skripal, 74, who was a member of Russian military intelligence, the GRU, before coming to the UK in 2010 on a prisoner exchange after being convicted of spying for Britain. But he found the assessment that he wasn't at \"significant risk\" of assassination was not \"unreasonable\" at the time of the attack in Salisbury on 4 March 2018, which could only have been avoided by hiding him with a completely new identity. Mr Skripal and his daughter Yulia, 41, who was also poisoned, were left seriously ill, along with then police officer Nick Bailey, who was sent to search their home, but they all survived. Dawn Sturgess, 44, died on 8 July, just over a week after unwittingly spraying herself with novichok given to her by her partner, Charlie Rowley, 52, in a perfume bottle in nearby Amesbury on 30 June 2018. Mr Rowley was left seriously ill but survived. In his 174-page report, following last year's seven-week inquiry, costing more than £8m, former Supreme Court judge Lord Hughes said she received \"entirely appropriate\" medical care but her condition was \"unsurvivable\" from a very early stage. The inquiry found GRU officers using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury after arriving in London from Moscow with a third agent known as Sergey Fedotov to kill Mr Skripal on 2 March. \n                  Salisbury novichok poisonings: Seven questions to be answered by inquiry\n                 \n                  Who were the targets of Russian spy ring dubbed 'the Minions'?\n                 \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 The report said it was likely the same bottle Petrov and Boshirov used to apply the military-grade nerve agent to the handle of Mr Skripal's front door before it was \"recklessly discarded\". \"They can have had no regard to the hazard thus created, of the death of, or serious injury to, an uncountable number of innocent people,\" it said. It is \"impossible to say\" where Mr Rowley found the bottle, but was likely within a few days of it being abandoned on 4 March, meaning there is \"clear causative link\" with the death of mother-of-three Ms Sturgess. Lord Hughes said he was sure the three GRU agents \"were acting on instructions\", adding: \"I have concluded that the operation to assassinate Sergei Skripal must have been authorised at the highest level, by President Putin. \"I therefore conclude that those involved in the assassination attempt (not only Petrov, Boshirov and Fedotov, but also those who sent them, and anyone else giving authorisation or knowing assistance in Russia or elsewhere) were morally responsible for Dawn Sturgess's death,\" he said. Russian ambassador summonsed After the publication of the report, the government announced the GRU has been sanctioned in its entirety, and the Russian Ambassador has been summonsed to the Foreign Office to answer for Russia's ongoing campaign of alleged hostile activity against the UK. Sir Keir Starmer said the findings \"are a grave reminder of the Kremlin's disregard for innocent lives\" and that Ms Sturgess's \"needless\" death was a tragedy that \"will forever be a reminder of Russia's reckless aggression\". \"The UK will always stand up to Putin's brutal regime and call out his murderous machine for what it is,\" the prime minister said. He said deploying the \"highly toxic nerve agent in a busy city centre was an astonishingly reckless act\" with an \"entirely foreseeable\" risk that others beyond the intended target would be killed or injured. The inquiry heard a total of 87 people presented at A&E. Lord Hughes said there was a decision taken not to issue advice to the public not to pick anything up which they hadn't dropped, which was a \"reasonable conclusion\" at the time, so as not to cause \"widespread panic\". He also said there had been no need for training beyond specialist medics before the \"completely unexpected use of a nerve agent in an English city\". After the initial attack, wider training was \"appropriate\" and was given but should have been more widely circulated. In a statement following the publication of his report, Lord Hughes said Ms Sturgess's death was \"needless and arbitrary\", while the circumstances are \"clear but quite extraordinary\". \"She was the entirely innocent victim of the cruel and cynical acts of others,\" he said. 'We can have Dawn back now' Speaking after the report was published, Ms Sturgess's father, Stanley Sturgess, said: \"We can have Dawn back now. She's been public for seven years. We can finally put her to peace.\" In a statement, her family said they felt \"vindicated\" by the report, which recognised how Wiltshire police wrongly characterised Ms Sturgess as a drug user. But they said: \"Today's report has left us with some answers, but also a number of unanswered questions. \"We have always wanted to ensure that what happened to Dawn will not happen to others; that lessons should be learned and that meaningful changes should be made. \"The report contains no recommendations. That is a matter of real concern. There should, there must, be reflection and real change.\" Wiltshire Police Chief Constable Catherine Roper admitted the pain of Ms Sturgess's family was \"compounded by mistakes made\" by the force, adding: \"For this, I am truly sorry.\" Russia has denied involvement  The Russian Embassy has firmly denied any connection between Russia and the attack on the Skripals. But the chairman dismissed Russia's explanation that the Salisbury and Amesbury poisonings were the result of a scheme devised by the UK authorities to blame Russia, and the claims of Petrov and Borisov in a television interview that they were sightseeing. The inquiry chairman said the evidence of a Russian state attack was \"overwhelming\" and was designed not only as a revenge attack against Mr Skripal, but amounted to a \"public statement\" that Russia \"will act decisively in its own interests\". Lord Hughes found \"some features of the management\" of Mr Skripal \"could and should have been improved\", including insufficient regular written risk assessments. But although there was \"inevitably\" some risk of harm at Russia's hands, the analysis that it was not likely was \"reasonable\", he said. \"There is no sufficient basis for concluding that there ought to have been assessed to be an enhanced risk to him of lethal attack on British soil, such as to call for security measures,\" such as living under a new identity or at a secret address, the chairman said. He added that CCTV cameras, alarms or hidden bugs inside Mr Skripal's house might have been possible but wouldn't have prevented the \"professionally mounted attack with a nerve agent\". Sky News has approached the Russian Embassy for comment on the report."
    },
    {
        "title": "Nigel Farage launches tirade at BBC over allegations he was racist at school",
        "description": "Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.&#160;",
        "url": "https://news.sky.com/story/nigel-farage-launches-tirade-at-bbc-over-allegations-he-was-racist-at-school-13479504",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-04 21:43:00",
        "Headline": "The Reform UK leader accuses broadcaster of \"double standards\", claiming it was \"very happy to use blackface\" in the 1970s. ",
        "Content": " Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.  The Reform UK leader accused the broadcaster of \"double standards\", pointing to its past television shows when he claimed the BBC \"were very happy to use blackface\". The outburst comes as he faces continued pressure over allegations he made racist and antisemitic comments while a pupil at top private school Dulwich College nearly 50 years ago. Mr Farage was asked by the BBC about an interview his deputy, Richard Tice, gave on Thursday, in which he claimed those accusing his boss of racism were engaging in \"made-up twaddle\". The Reform leader said the framing of the question by the BBC interviewer had been \"despicable\". \"I think to frame a question around the leader of Reform's 'relationship with Hitler', which is how she framed it, was despicable, disgusting beyond belief,\" he said. \"The double standards and hypocrisy of the BBC are absolutely astonishing. \n                  Starmer wants to lift half a million children out of poverty - but does his plan go far enough?\n                 \n                  Reeves between a rook and a hard place after claims she 'made up' chess championship\n                 \n                  How record-breaking Reform UK donor Christopher Harborne made his millions\n                 \"At the time I was alleged to have made these remarks, one of your most popular weekly shows was 'The Black and White Minstrels'. The BBC were very happy to use blackface.\" He added: \"I cannot put up with the double standards at the BBC about what I'm alleged to have said 49 years ago, and what you were putting out on mainstream content. \"So I want an apology from the BBC for virtually everything you did during the 1970s and 80s.\" Turning to the substance of the allegations, Mr Farage read out a letter that he said was from someone who he went to school with. He quotes the unnamed Jewish pupil as saying: \"While there was plenty of macho, tongue-in-cheek schoolboy banter, it was humour. And yes, sometimes it was offensive [...] but never with malice. \"I never heard him racially abuse anyone. If he had, he would have been reported and punished. He wasn't.\" Mr Farage went on to quote the unnamed former school mate as saying claims from former pupils reported by the Guardian and BBC were \"without evidence, except for belatedly politically-dubious recollections from nearly half a century ago\". He said the former pupil who had written to him had described the culture in the 1970s and at Dulwich College as \"very different\", and \"lots of boys said things they'd regret today\". Read More:How record-breaking Reform UK donor Christopher Harborne made his millionsReform UK gets record £9m donation from ex-Tory donor Mr Farage has been under pressure since mid-November when reports from former classmates of alleged racist comments surfaced. The Guardian claims it has spoken to 20 former classmates who recall such language. Challenged in an interview on 24 November if the claims were true, Mr Farage said: \"No, this is 49 years ago by the way, 49 years ago. Have I ever tried to take it out on any individual on the basis of where they're from? No.\" He added: \"I would never, ever do it in a hurtful or insulting way. It's 49 years ago. It's 49 years ago. I had just entered my teens. Can I remember everything that happened at school? No, I can't. Have I ever been part of an extremist organisation or engaged in direct, unpleasant, personal abuse, genuine abuse, on that basis? No.\" Challenged again about whether he had racially abused anyone, Farage responded: \"No, not with intent.\" A Conservative spokesman said Mr Farage was too busy defending himself to \"defend democracy\" from election postponements announced by Labour. \"Nigel Farage just called a press conference and used it to rant at journalists over historic allegations of racism and antisemitism - allegations he has just admitted are true. \"Farage is too busy furiously defending himself to defend democracy from the Labour Party's elections delays. \"Reform's one-man band is in chaos once again.\" Labour Party chair Anna Turley said: \"Nigel Farage can't get his story straight. It really shouldn't be this difficult to say whether he racially abused people in the past. \"So far, he's claimed he can't remember, that it's not true, that he never 'directly' abused anyone, that he was responsible for 'offensive banter', and deflected by saying other people were racist too. \"Instead of shamelessly demanding apologies from others, Nigel Farage should be apologising to the victims of his alleged appalling remarks.\" She added that Reform UK was \"simply not fit for high office\"."
    },
    {
        "title": "Derby police evacuate around 200 homes as men arrested on suspicion of explosives offences",
        "description": "Around 200 homes have been evacuated in Derby after police arrested two men on suspicion of explosives offences.",
        "url": "https://news.sky.com/story/major-incident-declared-and-200-homes-evacuated-after-two-men-arrested-on-suspicion-of-explosives-offences-13479379",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-derby-evacuation_7101376.jpg?20251204234255",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-04 15:19:00",
        "Headline": "Army specialists are still at the scene and residents have been told they won't be allowed back home tonight.",
        "Content": "Around 200 homes have been evacuated in Derby after police arrested two men on suspicion of explosives offences. Officers carried out a warrant in Vulcan Street and arrested two Polish nationals - one in his 40s and another in his 50s. They remain in custody. The Army's explosive ordinance division have carried out a controlled explosion, but the incident is not being treated as a terrorism-related. Residents won't be allowed to return home tonight but can get access briefly if it's urgent, for instance to collect medication. \"The work to ensure the safe return of those who have been displaced continues by colleagues from the Army but, unfortunately, that will have to be paused overnight and resumed in the morning,\" said Superintendent Becky Webster. \"The safety of everyone in the area is our number one priority and we are doing all we can to bring this incident to a conclusion as quickly, and safely, as possible.\" The evacuation area covers: Shaftsbury Crescent - in its entiretyVulcan Street - in its entiretyReeves Road - in its entiretyShaftesbury Crescent - in its entiretyHarrington Street - from Holcombe Street to Vulcan StreetBaseball Drive - to Colombo StreetCambridge Street - at Reeves Road and Shaftesbury Crescent Read more from Sky News:Four arrested in right-wing terror investigationEarthquake recorded in the North West Police earlier went to door to door to enforce the evacuation. Anyone already away from their property is asked to contact Derbyshire Police via Facebook Messenger on the force's website, or by calling 101. A rest centre has been set up at the Salvation Army centre on Osmaston Road and there's also an assembly point at the Pakistani Community Centre on Harrington Street. Authorities will give an update after a meeting scheduled for 8am on Friday."
    },
    {
        "title": "Rats and fleas get blamed for the Black Death - but here's how it could have spread so fast",
        "description": "The rapid spread of the Black Death through medieval Europe could have its origins in a massive volcanic eruption, according to new research.",
        "url": "https://news.sky.com/story/volcanic-eruption-may-have-sparked-europes-black-death-plague-scientists-find-13479387",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-black-death-bubonic-plague_7101031.jpg?20251204155407",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-04 15:47:00",
        "Headline": "The plague killed between a third and half of the European population in the mid-14th Century.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The rapid spread of the Black Death through medieval Europe could have its origins in a massive volcanic eruption, according to new research. The plague killed between a third and half of the European population in the mid-14th century. But it's unknown what triggered the pandemic. Now scientists in Cambridge and Germany have pieced together an extraordinary sequence of events from environmental clues and historical records that they believe solves the mystery. They say sooty particles trapped deep in the ice sheets of Antarctica and Greenland suggest there was at least one eruption by an as-yet-unknown volcano in the tropics, around the year 1345, that shrouded the planet in a thick haze of ash and sulphur. That fits with written evidence from the time, which reports unusually cloudy conditions and dark lunar eclipses, according to the study published in the journal Communications Earth & Environment. New analysis of tree rings from around the time shows there were three years of stunted growth, suggesting the volcanic haze resulted in cool, wet conditions that would have led to a series of crop failures, according to a team in Cambridge. Read more:How Black Death shaped how our bodies tackle diseasesSharp rise in flu patients in hospital beds across England Dr Martin Bauch, one of the study authors and a historian of medieval climate and epidemiology at the Leibniz Institute for the History and Culture of Eastern Europe, told Sky News that the eruption's impact on food supply was the key first stage in the sequence of events building up to the pandemic. \"In the years before the Black Death arrives, there is very unusual weather from England, across the Mediterranean to the Levant,\" he said. \"That large-scale pattern can only have a climatic explanation and the volcano is a good one because the impact would last two or three years. It all fits together.\" The researchers say the subsequent famine explains why the Italian maritime cities of Venice, Genoa and Pisa reached out to the Mongols of the Golden Horde around the Black Sea in 1347 and began to import grain. Previous research has concluded that ships carrying the grain also brought fleas infected with the plague bacterium Yersinia pestis, most probably from wild gerbils somewhere in central Asia. Once in Italy, the fleas jumped onto rats and other mammals - and spread devastation around Europe. \"These powerful Italian city states had established long-distance trade routes across the Mediterranean and the Black Sea, allowing them to activate a highly efficient system to prevent starvation,\" said Dr Bauch. \"But ultimately, these would inadvertently lead to a far bigger catastrophe.\" Professor Ulf Buentgen from Cambridge University's Department of Geography, another of the study authors, said the perfect storm of climate, agricultural, societal and economic factors that led to the Black Death were an early example of the consequences of globalisation. \"Although the coincidence of factors that contributed to the Black Death seem rare, the probability of zoonotic diseases (which jump from animals to humans) emerging under climate change and translating into pandemics is likely to increase in a globalised world,\" he said. \"This is especially relevant given our recent experiences with Covid-19.\""
    },
    {
        "title": "Four arrested in Eastbourne and Brighton in right-wing terror investigation",
        "description": "Three men and a woman have been arrested in East Sussex as part of an investigation into extreme right-wing terrorism.",
        "url": "https://news.sky.com/story/four-people-arrested-in-eastbourne-and-brighton-as-part-of-investigation-into-right-wing-terrorism-13479354",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-merseyside-anonymous_7100764.jpg?20251204215736",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-04 14:09:00",
        "Headline": "Sussex Police say the arrests are part of a planned operation - with the four suspects being held under the Terrorism Act.",
        "Content": "Three men and a woman have been arrested in East Sussex as part of an investigation into extreme right-wing terrorism. The arrests were carried out by specialist officers in Eastbourne and Brighton. Police said a 27-year-old woman from Hailsham and three men from Eastbourne, aged 33, 36 and 41, were arrested. Images show at least seven armed police with a battering ram raiding one house and handcuffing a man in a grey hoody. Sussex news site The Argus reported the location as Langney Rise. The suspects are being held under the Terrorism Act while searches take place. Read more from Sky News:Police evacuate homes and make explosives arrestsEarthquake recorded in the North West Assistant Chief Constable Steve Rayland it was \"part of a planned operation\" by Counter Terrorism Policing South East supported by Sussex Police. \"People living in the local area may notice an increased police presence while search activity takes place, which is routine in cases of this nature,\" said Mr Rayland."
    },
    {
        "title": "'No discussion' about banning Maccabi Tel Aviv fans at Stuttgart Europa League match ",
        "description": "Maccabi Tel Aviv fans will be allowed into next week's Europa League match at Stuttgart as banning them was not considered, the German club has confirmed to Sky News.",
        "url": "https://news.sky.com/story/no-discussion-about-banning-maccabi-tel-aviv-fans-at-stuttgart-europa-league-match-13479482",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maccabi-tel-aviv-fans_7055538.jpg?20251019163238",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-12-04 20:11:00",
        "Headline": "Stuttgart says neither the club nor local authorities have discussed banning Maccabi fans from their upcoming game.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Maccabi Tel Aviv fans will be allowed into next week's Europa League match at Stuttgart as banning them was not considered, the German club has confirmed to Sky News. It contrasts with the Israeli club's fans being excluded from Aston Villa last month after police in Birmingham cited safety threats - a decision now condemned by Europe's main football supporters' group. West Midlands Police chiefs justified the decision on Monday to the Home Affairs Select Committee by referencing racist violence by the Maccabi fans in Amsterdam last year - evidence disputed in part by the Dutch police to Sky News.  We have learned officials in southeast Germany did not consider imposing a ban on Maccabi fans next Thursday for the club's first Europa League away match since the trip to Birmingham. \"Maccabi Tel Aviv fans can attend this game,\" Bundesliga club Stuttgart told Sky News. \"There was no discussion in Stuttgart about excluding away fans - neither among the local authorities nor within the club.\" The municipal council in Stuttgart said that after talks with \"all the authorities that deal with public safety, all of them are well prepared and focus on securing public safety\". \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 \n                  Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid\n                 The decision to allow Israeli fans into Stuttgart's MHP Arena has been backed by Football Supporters Europe, which is now expressing concern about the moves by authorities in Birmingham to shut out Maccabi fans amid community tensions inflamed by the Israel-Hamas war. Read more:Maccabi boss hits out at 'blatant falsehoods'Police blame ban on 'significant hooliganism' \"An away travel ban is always an admission of defeat from the public authorities,\" Ronan Evain, executive director of Football Supporters Europe, told Sky News. \"The vast majority of police forces in Europe are perfectly capable of hosting away fans - that's why only a handful of countries resort to travel bans. \"Germany is very experienced in organising high-profile games and never had to resort to such extreme measures. \"We are happy that, contrary to the West Midlands Police, German police opted for an intelligence-informed approach and the protection of fans' fundamental rights, including freedom of movement.\""
    },
    {
        "title": "'Drop and cover'  earthquake alert turns out to be false alarm",
        "description": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false.",
        "url": "https://news.sky.com/story/drop-and-cover-earthquake-alert-turns-out-to-be-false-alarm-13479519",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-earthquake-nevada_7101373.jpg?20251204232026",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-04 22:13:00",
        "Headline": "Seismologists say the bogus message sent out in Nevada and California may be a first and \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles, could be to blame.",
        "Content": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false. The US Geological Survey (USGS) warned a 5.9-magnitude quake had struck near Dayton, Nevada, with people in the San Francisco area, about 180 miles away, also getting the message. However, multiple law enforcement agencies near the reported epicentre reported no shaking or other earthquake signs. A 5.9 quake can typically cause minor property damage and pronounced shaking, according to magnitude scales. The reason for the false alarm is unclear but it's believed to be the first time the automatic system has sent a bogus message. \"To my knowledge we've never had a false alert like this,\" said Yaareb Altaweel, from the National Earthquake Information Center in Colorado. \"The system has put out incorrect information on exaggerated magnitude or depth, which was corrected immediately by the on-duty seismologist, [but] I have seen that happen before,\" said Altaweel. \n                  Victorious Scotland fans caused 'extremely small' earthquake in Denmark win\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 \n                  'We don't have anything for winter': Families fear months ahead after earthquake wiped out entire villages in Afghanistan\n                 Angie Lux, at the Berkeley Seismological Laboratory, also said she had never heard of a completely false alert. She said the cause could have been \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles. Natural phenomena for such triggers include wind and ocean waves. Read more from Sky News:Countries withdraw from Eurovision over Israel decisionAnti-Hamas militia leader killed in Gaza - reports The UK experienced its own (authentic) earthquake this week when a 3.3-magnitude tremor hit northwest England. The British Geological Survey (BGS) said it was \"felt across the South Lakes and Lancashire, mainly within 20km of the epicentre\", including Kendal and Ulverston in neighbouring Cumbria."
    },
    {
        "title": "Nigel Farage launches tirade at BBC over allegations he was racist at school",
        "description": "Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.&#160;",
        "url": "https://news.sky.com/story/nigel-farage-launches-tirade-at-bbc-over-allegations-he-was-racist-at-school-13479504",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 21:43:00",
        "Headline": "The Reform UK leader accuses broadcaster of \"double standards\", claiming it was \"very happy to use blackface\" in the 1970s. ",
        "Content": " Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.  The Reform UK leader accused the broadcaster of \"double standards\", pointing to its past television shows when he claimed the BBC \"were very happy to use blackface\". The outburst comes as he faces continued pressure over allegations he made racist and antisemitic comments while a pupil at top private school Dulwich College nearly 50 years ago. Mr Farage was asked by the BBC about an interview his deputy, Richard Tice, gave on Thursday, in which he claimed those accusing his boss of racism were engaging in \"made-up twaddle\". The Reform leader said the framing of the question by the BBC interviewer had been \"despicable\". \"I think to frame a question around the leader of Reform's 'relationship with Hitler', which is how she framed it, was despicable, disgusting beyond belief,\" he said. \"The double standards and hypocrisy of the BBC are absolutely astonishing. \n                  Starmer wants to lift half a million children out of poverty - but does his plan go far enough?\n                 \n                  Reeves between a rook and a hard place after claims she 'made up' chess championship\n                 \n                  How record-breaking Reform UK donor Christopher Harborne made his millions\n                 \"At the time I was alleged to have made these remarks, one of your most popular weekly shows was 'The Black and White Minstrels'. The BBC were very happy to use blackface.\" He added: \"I cannot put up with the double standards at the BBC about what I'm alleged to have said 49 years ago, and what you were putting out on mainstream content. \"So I want an apology from the BBC for virtually everything you did during the 1970s and 80s.\" Turning to the substance of the allegations, Mr Farage read out a letter that he said was from someone who he went to school with. He quotes the unnamed Jewish pupil as saying: \"While there was plenty of macho, tongue-in-cheek schoolboy banter, it was humour. And yes, sometimes it was offensive [...] but never with malice. \"I never heard him racially abuse anyone. If he had, he would have been reported and punished. He wasn't.\" Mr Farage went on to quote the unnamed former school mate as saying claims from former pupils reported by the Guardian and BBC were \"without evidence, except for belatedly politically-dubious recollections from nearly half a century ago\". He said the former pupil who had written to him had described the culture in the 1970s and at Dulwich College as \"very different\", and \"lots of boys said things they'd regret today\". Read More:How record-breaking Reform UK donor Christopher Harborne made his millionsReform UK gets record £9m donation from ex-Tory donor Mr Farage has been under pressure since mid-November when reports from former classmates of alleged racist comments surfaced. The Guardian claims it has spoken to 20 former classmates who recall such language. Challenged in an interview on 24 November if the claims were true, Mr Farage said: \"No, this is 49 years ago by the way, 49 years ago. Have I ever tried to take it out on any individual on the basis of where they're from? No.\" He added: \"I would never, ever do it in a hurtful or insulting way. It's 49 years ago. It's 49 years ago. I had just entered my teens. Can I remember everything that happened at school? No, I can't. Have I ever been part of an extremist organisation or engaged in direct, unpleasant, personal abuse, genuine abuse, on that basis? No.\" Challenged again about whether he had racially abused anyone, Farage responded: \"No, not with intent.\" A Conservative spokesman said Mr Farage was too busy defending himself to \"defend democracy\" from election postponements announced by Labour. \"Nigel Farage just called a press conference and used it to rant at journalists over historic allegations of racism and antisemitism - allegations he has just admitted are true. \"Farage is too busy furiously defending himself to defend democracy from the Labour Party's elections delays. \"Reform's one-man band is in chaos once again.\" Labour Party chair Anna Turley said: \"Nigel Farage can't get his story straight. It really shouldn't be this difficult to say whether he racially abused people in the past. \"So far, he's claimed he can't remember, that it's not true, that he never 'directly' abused anyone, that he was responsible for 'offensive banter', and deflected by saying other people were racist too. \"Instead of shamelessly demanding apologies from others, Nigel Farage should be apologising to the victims of his alleged appalling remarks.\" She added that Reform UK was \"simply not fit for high office\"."
    },
    {
        "title": "Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid",
        "description": "The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found. ",
        "url": "https://news.sky.com/story/salisbury-novichok-poisonings-putin-morally-responsible-for-womans-death-after-authorising-botched-spy-assassination-bid-13479213",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/dawn-sturgess-novichok-russia_7100130.jpg?20251203211359",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-12-04 09:06:00",
        "Headline": "Dawn Sturgess's condition was \"unsurvivable\" after she unwittingly sprayed herself with novichok from a perfume bottle left by a Russian military hit squad, report says. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found.  The chairman, Lord Hughes, found there were \"failings\" in the management of Sergei Skripal, 74, who was a member of Russian military intelligence, the GRU, before coming to the UK in 2010 on a prisoner exchange after being convicted of spying for Britain. But he found the assessment that he wasn't at \"significant risk\" of assassination was not \"unreasonable\" at the time of the attack in Salisbury on 4 March 2018, which could only have been avoided by hiding him with a completely new identity. Mr Skripal and his daughter Yulia, 41, who was also poisoned, were left seriously ill, along with then police officer Nick Bailey, who was sent to search their home, but they all survived. Dawn Sturgess, 44, died on 8 July, just over a week after unwittingly spraying herself with novichok given to her by her partner, Charlie Rowley, 52, in a perfume bottle in nearby Amesbury on 30 June 2018. Mr Rowley was left seriously ill but survived. In his 174-page report, following last year's seven-week inquiry, costing more than £8m, former Supreme Court judge Lord Hughes said she received \"entirely appropriate\" medical care but her condition was \"unsurvivable\" from a very early stage. The inquiry found GRU officers using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury after arriving in London from Moscow with a third agent known as Sergey Fedotov to kill Mr Skripal on 2 March. \n                  Salisbury novichok poisonings: Seven questions to be answered by inquiry\n                 \n                  Who were the targets of Russian spy ring dubbed 'the Minions'?\n                 \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 The report said it was likely the same bottle Petrov and Boshirov used to apply the military-grade nerve agent to the handle of Mr Skripal's front door before it was \"recklessly discarded\". \"They can have had no regard to the hazard thus created, of the death of, or serious injury to, an uncountable number of innocent people,\" it said. It is \"impossible to say\" where Mr Rowley found the bottle, but was likely within a few days of it being abandoned on 4 March, meaning there is \"clear causative link\" with the death of mother-of-three Ms Sturgess. Lord Hughes said he was sure the three GRU agents \"were acting on instructions\", adding: \"I have concluded that the operation to assassinate Sergei Skripal must have been authorised at the highest level, by President Putin. \"I therefore conclude that those involved in the assassination attempt (not only Petrov, Boshirov and Fedotov, but also those who sent them, and anyone else giving authorisation or knowing assistance in Russia or elsewhere) were morally responsible for Dawn Sturgess's death,\" he said. Russian ambassador summonsed After the publication of the report, the government announced the GRU has been sanctioned in its entirety, and the Russian Ambassador has been summonsed to the Foreign Office to answer for Russia's ongoing campaign of alleged hostile activity against the UK. Sir Keir Starmer said the findings \"are a grave reminder of the Kremlin's disregard for innocent lives\" and that Ms Sturgess's \"needless\" death was a tragedy that \"will forever be a reminder of Russia's reckless aggression\". \"The UK will always stand up to Putin's brutal regime and call out his murderous machine for what it is,\" the prime minister said. He said deploying the \"highly toxic nerve agent in a busy city centre was an astonishingly reckless act\" with an \"entirely foreseeable\" risk that others beyond the intended target would be killed or injured. The inquiry heard a total of 87 people presented at A&E. Lord Hughes said there was a decision taken not to issue advice to the public not to pick anything up which they hadn't dropped, which was a \"reasonable conclusion\" at the time, so as not to cause \"widespread panic\". He also said there had been no need for training beyond specialist medics before the \"completely unexpected use of a nerve agent in an English city\". After the initial attack, wider training was \"appropriate\" and was given but should have been more widely circulated. In a statement following the publication of his report, Lord Hughes said Ms Sturgess's death was \"needless and arbitrary\", while the circumstances are \"clear but quite extraordinary\". \"She was the entirely innocent victim of the cruel and cynical acts of others,\" he said. 'We can have Dawn back now' Speaking after the report was published, Ms Sturgess's father, Stanley Sturgess, said: \"We can have Dawn back now. She's been public for seven years. We can finally put her to peace.\" In a statement, her family said they felt \"vindicated\" by the report, which recognised how Wiltshire police wrongly characterised Ms Sturgess as a drug user. But they said: \"Today's report has left us with some answers, but also a number of unanswered questions. \"We have always wanted to ensure that what happened to Dawn will not happen to others; that lessons should be learned and that meaningful changes should be made. \"The report contains no recommendations. That is a matter of real concern. There should, there must, be reflection and real change.\" Wiltshire Police Chief Constable Catherine Roper admitted the pain of Ms Sturgess's family was \"compounded by mistakes made\" by the force, adding: \"For this, I am truly sorry.\" Russia has denied involvement  The Russian Embassy has firmly denied any connection between Russia and the attack on the Skripals. But the chairman dismissed Russia's explanation that the Salisbury and Amesbury poisonings were the result of a scheme devised by the UK authorities to blame Russia, and the claims of Petrov and Borisov in a television interview that they were sightseeing. The inquiry chairman said the evidence of a Russian state attack was \"overwhelming\" and was designed not only as a revenge attack against Mr Skripal, but amounted to a \"public statement\" that Russia \"will act decisively in its own interests\". Lord Hughes found \"some features of the management\" of Mr Skripal \"could and should have been improved\", including insufficient regular written risk assessments. But although there was \"inevitably\" some risk of harm at Russia's hands, the analysis that it was not likely was \"reasonable\", he said. \"There is no sufficient basis for concluding that there ought to have been assessed to be an enhanced risk to him of lethal attack on British soil, such as to call for security measures,\" such as living under a new identity or at a secret address, the chairman said. He added that CCTV cameras, alarms or hidden bugs inside Mr Skripal's house might have been possible but wouldn't have prevented the \"professionally mounted attack with a nerve agent\". Sky News has approached the Russian Embassy for comment on the report."
    },
    {
        "title": "Number of flu patients in hospital beds across England rises by more than 50%",
        "description": "The number of flu patients in hospital beds across England is more than 50% higher than the same period in 2024, according to NHS data.",
        "url": "https://news.sky.com/story/number-of-flu-patients-in-hospital-beds-across-england-rises-13479183",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-flu-patient-hospital_7100717.jpg?20251204104417",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 10:00:00",
        "Headline": "A record average of 1,717 patients were in beds in England each day last week, including 69 in critical care.",
        "Content": " The number of flu patients in hospital beds across England is more than 50% higher than the same period in 2024, according to NHS data. A record average of 1,717 patients were in beds in England each day last week, including 69 in critical care. This is an increase of 56% for the same week in 2024, where the total was 1,098, with 39 in critical care. The number is also higher than 2023, when there were an average of 243 flu patients, and 2022 with an average of 772. On 30 November, there were 2,040 flu patients in hospital beds across England, which is a sharp rise of 74% from the same day in 2024 with 1,175, which was already the highest on a single day since 2021. This year's flu season started earlier than usual and has yet to reach its peak, meaning pressure on hospitals is likely to grow in the run-up to Christmas, when ballooning flu cases are set to coincide with industrial action by the BMA, which could see thousands of resident doctors walking out. National medical director for urgent and emergency care, Prof Julian Redhead, warned: \"Today's numbers confirm our deepest concerns: the health service is bracing for an unprecedented flu wave this winter. \"Cases are incredibly high for this time of year and there is no peak in sight yet. \n                  A&E 'under siege from hiccups and ingrowing toenails' - as NHS makes fresh warning to patients\n                 \n                  NHS patients being 'set up to suffer' this winter, nurses warn\n                 \n                  US and UK agree zero tariffs on pharmaceuticals\n                 \"The NHS has prepared earlier for winter than ever before, but despite that we know that ballooning flu cases coinciding with strikes may stretch our staff close to breaking point in the coming weeks.\" The number of flu jabs administered so far is similar to the years before, with the NHS administering 16.9 million flu vaccinations across England between the start of the NHS's autumn vaccination campaign and the last week of November. This compares to 16.6 million last year and the year before. Health correspondent \"I thought the end was near, I'll be honest. The thing is, every time you breathe, there's the sharp pain. And so you've got to breathe obviously and it was just giving so much pain.\" These are the words of a patient on Ward 23, the Royal Preston Hospital's specialist respiratory unit.  Paul Mather thought he was going to die. Still struggling to talk, he wanted to express his gratitude to the NHS doctors who were keeping him alive.  And tellingly, one of these NHS doctors said to me: \"It's groundhog day for the NHS.\" ED consultant Michael Stewart was standing in the middle of the same hospital's emergency department.  It was heaving with patients. Every bed, bay, chair taken. Patients in trolleys lined up in the corridors. The waiting area is packed with people.  And this was on a Tuesday morning. The temperature might be relatively mild, but winter has well and truly arrived for the NHS.  Health leaders were already bracing themselves because all the early indicators from the southern hemisphere's flu season suggested ours would be challenging.  And the figures from the first winter situation report prove that to be the case.  There was an average of 1,717 patients in a hospital bed every day last week because of flu, the highest on record for this time of year. Cases were 10 times higher than in the same week in 2023 (160), and more than 50% higher than last year (1,098). And worryingly, there is no sign of infections peaking.  About half, 8.4 million, were administered to adults aged 65 and over, which is comparable to the number of jabs in the last year and the year before at 8.3 million each during the same period. The NHS is handling a higher volume of 111 calls, receiving 11,338 more calls last week than in the same week in 2024. Ambulances handed over 99,000 patients at hospitals last week, which is 4,500 more than in the same week last year. The number of patients waiting at least 30 minutes to be handed over to A&E teams after arriving by ambulance at hospitals in England is slightly lower than last year, at 30% compared to 36% in the equivalent week in 2024. About 10% of ambulance handovers - corresponding to 9,580 patients - were delayed by more than an hour last week, compared to 16% the year before. The overall percentage of available hospital beds is on par with previous years, but it is still below the target of having 8% available beds - or a maximum of 92% occupied beds - as set out in the 2023/24 NHS guidance. Meanwhile, an average of 261 hospital beds in England were filled by patients with diarrhoea and vomiting or norovirus-like symptoms last week - last year, there were 751 at this point. The figures have been published in the first of this year's NHS winter situation reports. Read more from Sky News:Why is flu season worse this year?Earthquake 'shakes homes' in the North WestPutin 'morally responsible' for woman's death Health Secretary Wes Streeting said: \"Winter is a hard time for the NHS, but because we acted earlier than ever we're seeing progress - with faster ambulance response and handover times compared to this time last year. \"This progress is being put in real jeopardy by the BMA's leadership, whose reckless behaviour to time industrial action at the height of winter, will put more patients are risk and bear down hard on their NHS colleagues in the run up to Christmas. \"We will do all we can to we can to weather this storm. I am determined that with the proper planning, record investment and modernisation this government is bringing in, we'll have a more resilient NHS for this winter and beyond.\""
    },
    {
        "title": "Derby police evacuate around 200 homes as men arrested on suspicion of explosives offences",
        "description": "Around 200 homes have been evacuated in Derby after police arrested two men on suspicion of explosives offences.",
        "url": "https://news.sky.com/story/major-incident-declared-and-200-homes-evacuated-after-two-men-arrested-on-suspicion-of-explosives-offences-13479379",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-derby-evacuation_7101376.jpg?20251204234255",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 15:19:00",
        "Headline": "Army specialists are still at the scene and residents have been told they won't be allowed back home tonight.",
        "Content": "Around 200 homes have been evacuated in Derby after police arrested two men on suspicion of explosives offences. Officers carried out a warrant in Vulcan Street and arrested two Polish nationals - one in his 40s and another in his 50s. They remain in custody. The Army's explosive ordinance division have carried out a controlled explosion, but the incident is not being treated as a terrorism-related. Residents won't be allowed to return home tonight but can get access briefly if it's urgent, for instance to collect medication. \"The work to ensure the safe return of those who have been displaced continues by colleagues from the Army but, unfortunately, that will have to be paused overnight and resumed in the morning,\" said Superintendent Becky Webster. \"The safety of everyone in the area is our number one priority and we are doing all we can to bring this incident to a conclusion as quickly, and safely, as possible.\" The evacuation area covers: Shaftsbury Crescent - in its entiretyVulcan Street - in its entiretyReeves Road - in its entiretyShaftesbury Crescent - in its entiretyHarrington Street - from Holcombe Street to Vulcan StreetBaseball Drive - to Colombo StreetCambridge Street - at Reeves Road and Shaftesbury Crescent Read more from Sky News:Four arrested in right-wing terror investigationEarthquake recorded in the North West Police earlier went to door to door to enforce the evacuation. Anyone already away from their property is asked to contact Derbyshire Police via Facebook Messenger on the force's website, or by calling 101. A rest centre has been set up at the Salvation Army centre on Osmaston Road and there's also an assembly point at the Pakistani Community Centre on Harrington Street. Authorities will give an update after a meeting scheduled for 8am on Friday."
    },
    {
        "title": "How record-breaking Reform UK donor Christopher Harborne made his millions",
        "description": "Who is the man behind the record-breaking multi-million pound donation to Reform UK?",
        "url": "https://news.sky.com/story/how-record-breaking-reform-uk-donor-christopher-harborne-made-his-millions-13479318",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-uk-rosette_7068411.jpg?20251101080911",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 12:50:00",
        "Headline": "The businessman was born in the UK but has lived in Thailand for 20 years, where he is known as Chakrit Sakunkrit. He has a long history of donations to British parties.",
        "Content": "Who is the man behind the record-breaking multi-million pound donation to Reform UK? Christopher Harborne gave Nigel Farage's party £9m in August, according to new data published by the Electoral Commission. The contribution ranks as the largest ever single donation from a living person in UK political history. Born in Britain, Mr Harborne is a businessman who owns several companies, employing more than 600 people worldwide, according to a court filing dated last year. Yet he's not resident in the UK, and is also a citizen of Thailand, where he is known as Chakrit Sakunkrit, and has lived and worked there for 20 years. Follow live: Politics latest Nonetheless, he has a long history of political donations to British parties. Electoral Commission data shows he has previously donated to the Conservatives, gifting them £10,000 in May 2001, and continuing to support them with close to £2m in donations by October 2022. \n                  Starmer wants to lift half a million children out of poverty - but does his plan go far enough?\n                 \n                  Nigel Farage launches tirade at BBC over allegations he was racist at school\n                 \n                  Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid\n                 But there was been some overlap with his backing of Reform, which first received a donation from him in April 2019, for £200,000. He's also donated to Mr Farage personally, giving £27,616.76 in January so the Reform leader could attend the second inauguration of Donald Trump. He paid another £32,836 for the Reform and a member of staff to fly to the US following the attempted assassination of Trump in July last year. And he gave one of the biggest donations ever made to an individual UK politician when he backed Boris Johnson to the tune of £1m in 2022. He served as an advisor to Mr Johnson during the former PM's trip to Kyiv in 2023. His latest cash injection to Reform UK breaks the previous record for a donation from a living person, which was £8m from supermarket tycoon Lord David Sainsbury to the Liberal Democrats in 2019. The largest ever single donation to a UK political party was from his cousin, Lord John Sainsbury, who left more than £10.2m to the Conservatives in 2022 in his will. Read more:Labour accused of 'scandalous attempt to subvert democracy'Tory-Reform pact talks 'not happening at any level' Electoral Commission records show Mr Harborne has made at least £24.5m in UK political donations since 2001. But where is his money from? Several of his businesses come under the banner of AML Global, including one registered in the UK, which has a London address listed with Companies House. AML Global is described in a court filing as an international jet fuel broker that works with oil companies, and which has been awarded $39m (£29m) worth of contracts by the US Department of Defense. Harborne was also an early investor in Bitcoin and other cryptocurrencies. On his LinkedIn page, the businessman further describes himself as chair of Sherriff Global Group. His profile shows he was educated at INSEAD business school, Cambridge University, and Westminster School. Figures from the Electoral Commission released this week show Reform UK reported the most donations of any party in the third quarter of 2025, a total of £10,526,846. By contrast, the Conservatives reported £7,038,861 in the same period, Labour £2,564,786, and the Liberal Democrats £2,174,712."
    },
    {
        "title": "Brother-in-law of Scotland's former leader, Humza Yousaf, facing extortion and drug charges",
        "description": "The brother-in-law of Scotland's former first minister Humza Yousaf has gone on trial accused of extortion and dealing class A drugs.",
        "url": "https://news.sky.com/story/brother-in-law-of-scotlands-former-leader-humza-yousaf-facing-extortion-and-drug-charges-13479425",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edinburgh-high-court_6983341.jpg?20251204171625",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 17:09:00",
        "Headline": "Ramsay El-Nakla, the brother of the wife of the former first minister, is on trial in Edinburgh accused of dealing heroine and cocaine. The High Court case follows the death of a man who fell from a window in Dundee.",
        "Content": "The brother-in-law of Scotland's former first minister Humza Yousaf has gone on trial accused of extortion and dealing class A drugs. The case follows the death of a man who fell from a window in Dundee after allegedly being threatened. Ramsay El-Nakla, 37, is on trial at the High Court in Edinburgh and is the brother of Mr Yousaf's wife, Dundee councillor Nadia El-Nakla. El-Nakla does not face a charge in relation to the death of Ryan Munro who fell from a flat on Dundee's Morgan Street on 10 January 2024. But he is is accused of dealing cocaine from the flat between 9 and 11 January 2024, as well as at another home in the city, which he denies. And El-Nakla and his co-accused Stephen Stewart, 52, Jennifer Souter, 39, and Victoria McGowan, 43, are all alleged to have put Mr Munro \"in a state of alarm and apprehension of physical harm\" and \"did extort a sum of money from him by threats\", at the flat, the court heard. Stewart, Souter and McGowan additionally face a charge specifically in relation to Mr Munro's death. \n                  Scotland's former first minister Humza Yousaf hits out at Starmer's 'dog whistle' stance on immigration\n                 \n                  Former first minister Humza Yousaf to step down as MSP in 2026\n                 \n                  Humza Yousaf questions family's future in UK after violent riots\n                 Court papers allege they \"did threaten and intimidate him, thereby placing him in an extreme state of fear and alarm for his safety, and cause said Ryan Munro to escape said flat from a window at height, causing him to fall from said window and strike the ground, whereby he was so severely injured that he died there and you did kill him\". Mr Munro fell from the window in Dundee after allegedly being abducted by Stewart, Souter and McGowan; a charge they deny. Stewart, McGowan and El-Nakla all deny dealing heroin from a flat in Dundee between 1 July 2023 and 11 January 2024. Read more from Sky News:Four arrested in right-wing terror investigationArrests after 'industrial scale' drugs laboratories found Souter, McGowan and Stewart, of Dundee, deny dealing cocaine from the same flat between 1 July 2023 and 11 January 2024. McGowan, of Aberdeen, who was said to be on bail at the time, is also accused of dealing class C drug Bromazolam between 1 July 2023 and 11 January 2024 at both Dundee addresses. She is further accused of possession of cannabis, and class C drugs Zopiclone and Pregabalin on 11 January 2024. All four deny the accusations against them. The trial, before Judge Lady Drummond, continues."
    },
    {
        "title": "Four arrested in Eastbourne and Brighton in right-wing terror investigation",
        "description": "Three men and a woman have been arrested in East Sussex as part of an investigation into extreme right-wing terrorism.",
        "url": "https://news.sky.com/story/four-people-arrested-in-eastbourne-and-brighton-as-part-of-investigation-into-right-wing-terrorism-13479354",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-merseyside-anonymous_7100764.jpg?20251204215736",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 14:09:00",
        "Headline": "Sussex Police say the arrests are part of a planned operation - with the four suspects being held under the Terrorism Act.",
        "Content": "Three men and a woman have been arrested in East Sussex as part of an investigation into extreme right-wing terrorism. The arrests were carried out by specialist officers in Eastbourne and Brighton. Police said a 27-year-old woman from Hailsham and three men from Eastbourne, aged 33, 36 and 41, were arrested. Images show at least seven armed police with a battering ram raiding one house and handcuffing a man in a grey hoody. Sussex news site The Argus reported the location as Langney Rise. The suspects are being held under the Terrorism Act while searches take place. Read more from Sky News:Police evacuate homes and make explosives arrestsEarthquake recorded in the North West Assistant Chief Constable Steve Rayland it was \"part of a planned operation\" by Counter Terrorism Policing South East supported by Sussex Police. \"People living in the local area may notice an increased police presence while search activity takes place, which is routine in cases of this nature,\" said Mr Rayland."
    },
    {
        "title": "Man charged over allegedly assisting Manchester synagogue attacker with reconnaissance of defence facility",
        "description": "A man has been charged with four terrorism offences following allegations that he assisted Manchester synagogue attacker Jihad al Shamie with an earlier reconnaissance of a UK defence facility, the Crown Prosecution Service (CPS) said.",
        "url": "https://news.sky.com/story/man-charged-over-allegedly-assisting-manchester-synagogue-attacker-with-reconnaissance-of-defence-facility-13479358",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-historic-england-manchester_5715098.jpg?20220322115633",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-04 14:19:00",
        "Headline": "Mohammad Bashir, 31, will appear at Westminster Magistrates' Court on Friday after being charged with four terrorism offences.",
        "Content": "A man has been charged with four terrorism offences following allegations that he assisted Manchester synagogue attacker Jihad al Shamie with an earlier reconnaissance of a UK defence facility, the Crown Prosecution Service (CPS) said. Mohammad Bashir, 31, of Cheetham Hill, will appear at Westminster Magistrates' Court on Friday. The CPS said the assistance provided was not in relation to the attack by al Shamie on the Heaton Park Synagogue in Crumpsall, Manchester, on 2 October. Worshippers Melvin Cravitz and Adrian Daulby were killed after 35-year-old al Shamie, a Syrian-born UK citizen, drove his Kia Picanto into the gates of the synagogue and then started attacking with a knife, wearing a fake suicide belt. The charges allege that Bashir drove al Shamie to an unnamed defence facility on 14 August. Bashir will also be prosecuted for sharing material online with intent to encourage acts of terrorism, the CPS said. Frank Ferguson, chief crown prosecutor of the Crown Prosecution Service Special Crime and Counter Terrorism Division, said: \"Today, we have decided to prosecute Mohammad Bashir with terrorism offences following a Counter Terrorism Policing North West investigation into his conduct linked to Jihad al Shamie. \"Our prosecutors have concluded that there is sufficient evidence to charge Mohammad Bashir with one offence of preparation of terrorist acts and three offences of sharing terrorist publications with al Shamie and others with the intent to encourage acts of terrorism.\" The British national, who police say has a self-defined ethnicity of British-Pakistani, was arrested at Manchester Airport on 27 November. Assistant Chief Constable Rob Potts, who holds operational responsibility for Counter Terrorism Policing North West, said: \"This morning we have charged Mohammad Asim Bashir with a number of terrorism offences, including preparation for acts of terrorism. \"These charges aren't directly linked to the terrorist attack which took place at the Heaton Park Hebrew Congregation Synagogue, but have come as a result of inquiries conducted by our investigation team. \"Our investigation into the attack remains live, and I would continue to appeal to anyone with information that could potentially be of assistance to please come forward.\" Al Shamie was fatally shot by armed police as he carried out his attack. "
    },
    {
        "title": "Hundreds of UK moderators have left TikTok - sparking safety fears, whistleblowers reveal ",
        "description": "Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\".",
        "url": "https://news.sky.com/story/hundreds-of-uk-moderators-have-left-tiktok-sparking-safety-fears-whistleblowers-reveal-13478302",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tiktok-whistleblower_7098509.png?20251202150116",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-04 03:01:00",
        "Headline": "Sky News has seen correspondence from TikTok to the employees telling them to sign termination contacts by 31 October. Hundreds did.",
        "Content": "\n          Science and technology reporter\n        Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\". More than 400 online safety workers have agreed to leave the social media company, with only five left in consultation, Sky News understands. \"[The workers have] signed a mutual termination agreement, a legally binding contract,\" said John Chadfield, national officer for the Communication Workers' Union. \"They've handed laptops in, they've handed passes in, they've been told not to come to the office. That's no longer a proposal, that's a foregone conclusion. That's a plan that's been executed.\" Safety workers and unions have told Sky News the decision could impact online safety. But TikTok said it was using \"the most advanced technology\" to make sure the platform \"is as safe as possible\". In August, TikTok announced a round of mass layoffs to its Trust and Safety teams. \n                  Rats and fleas get blamed for the Black Death - but here's how it could have spread so fast\n                 \n                  Industrial action on agenda as actors balloted by Equity over AI scanning concerns\n                 \n                  Spotify Wrapped: How does it work - and who are this year's top artists? \n                 \"Everyone in Trust and Safety\" was emailed, said Lucy, a moderator speaking on condition of anonymity for legal reasons. After a mandatory 45-day consultation period, the teams were then sent \"mutual termination agreements\" to sign by 31 October. Sky News has seen correspondence from TikTok to the employees telling them to sign by that date. \"We had to sign it before the 31st if we wanted the better deal,\" said Lucy, who had worked for TikTok for years. \"If we signed it afterwards, that diminished the benefits that we get.\" Despite hundreds of moderators signing the termination contracts by 31 October, Ali Law, TikTok's director of public policy and government affairs for northern Europe, said to MPs in a letter on 7 November: \"It is important to stress the cuts remain proposals only.\" \"We continue to engage directly with potentially affected team members,\" he said in a letter to Dame Chi Onwurah, chair of the science, innovation and technology committee. After signing the termination contracts, the employees say they were asked to hand in their laptops and had access to their work systems revoked. They were put on gardening leave until 30 December. \"We really felt like we were doing something good,\" said Saskia, a moderator also speaking under anonymity. \"You felt like you had a purpose, and now, you're the first one to get let go.\" A TikTok worker not affected by the job cuts confirmed to Sky News that all of the affected Trust and Safety employees \"are now logged out of the system\". \"Workers and the wider public are rightly concerned about these job cuts that impact safety online,\" said the TUC's general secretary, Paul Nowak. \"But TikTok seem to be obscuring the reality of job cuts to MPs. TikTok needs to come clean and clarify how many vital content moderators' roles have gone. \"The select committee must do everything to get to the bottom of the social media giant's claims, the wider issues of AI moderation, and ensure that other workers in the UK don't lose their jobs to untested, unsafe and unregulated AI systems.\" What TikTok has said about the job cuts In an interview with Sky News on 18 November, Mr Law again called the cuts \"proposals\". When asked if the cuts were in fact a plan that had already been executed, Mr Law said there was \"limited amounts\" he could directly comment on. TikTok told us: \"It is entirely right that we follow UK employment law, including when consultations remained ongoing for some employees and roles were still under proposal for removal. \"We have been open and transparent about the changes that were proposed, including in detailed public letters to the committee, and it is disingenuous to suggest otherwise.\" The three whistleblowers Sky News spoke to said they were concerned TikTok users would be put at risk by the cuts. The company said it will increase the role of AI in its moderation, while maintaining some human safety workers, but one whistleblower said she didn't think the AI was \"ready\". \"People are getting new ideas and new trends are coming. AI cannot get this,\" said Anna, a former moderator. \"Even now, with the things that it's supposed to be ready to do, I don't think it's ready.\"  Lucy also said she thought the cuts would put users at risk. \"There are a lot of nuances in the language. AI cannot understand all the nuances,\" she said. \"AI cannot differentiate some ironic comment or versus a real threat or bullying or of a lot of things that have to do with user safety, mainly of children and teenagers.\" TikTok has been asked by MPs for evidence that its safety rates - which are currently some of the best in the industry - will not worsen after these cuts. The select committee says it has not produced that evidence, although TikTok insists safety will improve. \"[In its letter to MPs] TikTok refers to evidence showing that their proposed staffing cuts and changes will improve content moderation and fact-checking - but at no point do they present any credible data on this to us,\" said Dame Chi earlier this month. \"It's alarming that they aren't offering us transparency over this information. Without it, how can we have any confidence whether these changes will safeguard users?\" TikTok's use of AI in moderation In an exclusive interview with Sky News earlier this month, Mr Law said the new moderation model would mean TikTok can \"approach moderation with a higher level of speed and consistency\". He said: \"Because, when you're doing this from a human moderation perspective, there are trade-offs. \"If you want something to be as accurate as possible, you need to give the human moderator as much time as possible to make the right decision, and so you're trading off speed and accuracy in a way that might prove harmful to people in terms of being able to see that content. \"You don't have that with the deployment of AI.\" As well as increasing the role of AI in moderation, TikTok is reportedly offshoring jobs to agencies in other countries. Sky News has spoken to multiple workers who confirmed they'd seen their jobs being advertised in other countries through third-party agencies, and has independently seen moderator job adverts in places like Lisbon. \"AI is a fantastic fig leaf. It's a fig leaf for greed,\" said Mr Chadfield. \"In TikTok's case, there's a fundamental wish to not be an employer of a significant amount of staff. \"As the platform has grown, as it has grown to hundreds of millions of users, they have realised that the overhead to maintain a professional trust and safety division means hundreds of thousands of staff employed by TikTok. \"But they don't want that. They see themselves as, you know, 'We want specialists in the roles employed directly by TikTok and we'll offshore and outsource the rest'.\" Mr Law told Sky News that TikTok is always focused \"on outcomes\". He said: \"Our focus is on making sure the platform is as safe as possible. \"And we will make deployments of the most advanced technology in order to achieve that, working with the many thousands of trust and safety professionals that we will have at TikTok around the world on an ongoing basis.\" Asked specifically about the safety concerns raised by the whistleblowers, TikTok said: \"As we have laid out in detail, this reorganisation of our global operating model for Trust and Safety will ensure we maximise effectiveness and speed in our moderation processes. \"We will continue to use a combination of technology and human teams to keep our users safe, and today over 85% of the content removed for violating our rules is identified and taken down by automated technologies.\" *All moderator names have been changed for legal reasons."
    },
    {
        "title": "Fresh sanctions on Russia seem futile - Putin is more belligerent than ever",
        "description": "There is a sense of impotent futility to the latest sanctions imposed by the UK on Russia in the wake of the Dawn Sturgess public inquiry report released today.",
        "url": "https://news.sky.com/story/impotent-sanctions-on-russia-are-no-match-for-solid-financial-support-to-ukraine-13479447",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-steve-witkoff_7098730.jpg?20251202172647",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-12-04 17:56:00",
        "Headline": "For all Europe's handwringing, rhetoric and sanctions, Putin remains unmoved.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n There is a sense of impotent futility to the latest sanctions imposed by the UK on Russia in the wake of the Dawn Sturgess public inquiry report released today. And it's not just the UK. For all Europe's handwringing, rhetoric and sanctions, Vladimir Putin remains unmoved. This week, he was more belligerent than ever, warning that while Russia does not want a war, if Europe starts one, it's more than ready. Ukraine war latest: Putin says Donald Trump has an agenda As we approach a fourth year of Russia's war with Ukraine, the world is operating under new management and new rules, but the penny has not yet dropped in Europe. The much-vaunted 'rules-based world order' is falling apart. America, so long its guardian, has deserted it and is now in league more and more with Russia.  The Trump administration is more interested in the promise of renewed trading ties and business deals with Putin's Russia, despite all its murderous faults. Putin is winning on the battlefield, slowly but steadily, and Ukraine is running out of money. America has turned off the tap and is now acting as an arms dealer, selling Ukraine weapons via Europe. Ukraine needs in excess of a hundred billion dollars a year to continue fighting. Europe is bickering over how to use frozen Russian assets to fund that. And there is certainly no sign of European governments biting the bullet and asking taxpayers to do so instead. Read more:Briton detained in UkrainePutin 'morally responsible' for Salisbury novichok death The alternative way of stopping Russia's grinding advance is sending troops to Ukraine, which remains out of the question. So for now, we have just words and sanctions instead. Sir Keir Starmer may wring his hands about the \"Kremlin's disregard for innocent lives\" in the wake of the inquiry into Dawn Sturgess's death in Salisbury in 2018. It holds the Russian leader \"morally responsible\" for the Skripal poisoning. But if Europe is not prepared to put its money where its rhetoric and sanctions are, does this add up to much more than posturing?  European governments have for almost a year seemed in denial, acting like a cheated spouse. As America's affections for Russia have become more and more obvious, Europe has hoped against hope to win back its partner. The affair between Trump and Putin is now, it seems, in full sight. America no longer wants to support either Europe or Ukraine, only to profit from arms sales to the conflict. Tantalising deals dangled by Moscow are all it takes, it seems, to keep Donald Trump's interest. Substituting impotent sanctions and rhetoric for solid financial support for Ukraine at some point becomes worse than pointless. It encourages Kyiv to carry on fighting, as Putin put it recently, \"to the last Ukrainian\" in the mistaken belief that Europe has its back. The moment of reckoning approaches for Europe, but there is no sign of its leaders accepting that fact."
    },
    {
        "title": "Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control",
        "description": "There is a desperate desire for normality in Gaza - for full shops, functioning hospitals, open schools, habitable homes and usable roads. For electricity that comes on reliably, skies that don&#8217;t hum with drones and days that don&#8217;t crackle with gunfire.",
        "url": "https://news.sky.com/story/gaza-longs-for-normality-but-quasi-anarchy-reigns-and-hamas-is-once-again-exerting-control-13479467",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-khan-younis-palestinians_7101210.jpg?20251204193512",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-12-04 19:13:00",
        "Headline": "The IDF is going nowhere and the territory is still ripped by violence and volatility. Monumental obstacles will have to be overcome before a flood of aid arrives and rebuilding can begin. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  There is a desperate desire for normality in Gaza - for full shops, functioning hospitals, open schools, habitable homes and usable roads. For electricity that comes on reliably, skies that don’t hum with drones and days that don’t crackle with gunfire. In Khan Younis, 54 couples got married at one enormous shared ceremony. The event attracted crowds who clambered on to a smashed-out building opposite the dais to wave at the brides and grooms, and to celebrate. Amid a grey landscape of dust and destruction, the image was one of colour and cheer. It is a captivating vision of a better world, but it is an illusion. Gaza is still being ripped by tides of danger, violence and volatility. And it all sits within a cobweb of conflicting interests that makes security so precarious that you wonder how peace can ever return. Take the past day or two. First, the Israeli military says that five of their soldiers have been injured after being attacked by Hamas fighters who may have emerged from hiding in tunnels. As has happened after all such incidents previously, Israel responds with a show of might - with an airstrike that, it says, was aimed at a senior Hamas official. In the ensuing fallout, civilians, including two children, are killed. Israel also announces that it will open the Rafah Crossing, but only to allow people out of Gaza. Egypt says it won't co-operate unless the crossing allows people to go in both directions. Israel, which suspects Egypt of offering financial support to Hamas, does not agree. Stalemate. Also in Rafah, Yasser Abu Shabab, leader of a militant group that opposed Hamas and was getting covert backing from Israel, is killed, presumably by Hamas fighters. Exactly how they got into his territory is hard to guess, but his killing suggests that, far from being degraded, Hamas is once again exerting control. Read more:Anti-Hamas militia leader killed in Gaza Strip - reportsRafah crossing to open 'in coming days', Israel says And then there is the return of the remains of the penultimate hostage, Sudthisak Rinthalak, from Gaza to Israel. Only one body now remains to be handed back, that of police officer Ran Gvili, and once that has been returned, then we wonder what will happen next. In theory, we enter Phase Two, which will see a flood of aid, the disarmament of Hamas, the rebuilding of Gaza and a new governance structure. But the obstacles ahead are monumental, ranging from questions about exactly who is going to take Hamas's weapons away from them, to how Palestinians are going to feel about Gaza being governed by foreigners. Sources say that a huge amount of effort has been invested, largely by American diplomats, soldiers, planners and business people, in trying to plan for this future. America has a huge co-ordination centre set up in southern Israel and President Trump believes that peace in the Middle East is his ticket to the Nobel Prize. But it would be a huge - strike that, impossible - stretch of faith to think that these plans will come into play effortlessly. They won't. The ambitions outlined in Phase Two are still little more than hopes. For one thing, half of Gaza is still under Israeli military control and the IDF are not going anywhere. For another, the other half of Gaza is in a state of quasi-anarchy. The idea of a military supervisory force has been signed off by the United Nations, but has not yet been created. Nor has a set of rules of engagement - imagine if an Egyptian military unit comes across a firefight between Hamas and a different militia - who would they shoot at first? What rules would cover their actions? How do you maintain peace in Gaza? The questions go on into the distance. And, as long as Hamas regroups, so the concept of it then choosing to voluntarily disarm and largely disband seems harder and harder to believe. If that doesn't happen, then Israel will not stop worrying about another October 7 attack. We could go on like this, but the point is clear. The return of the final hostage will bring into play a mass of new questions, none of which appear to have answers. And for the people of Gaza, the anxiety of life will roll on."
    },
    {
        "title": "Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid",
        "description": "The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found. ",
        "url": "https://news.sky.com/story/salisbury-novichok-poisonings-putin-morally-responsible-for-womans-death-after-authorising-botched-spy-assassination-bid-13479213",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/dawn-sturgess-novichok-russia_7100130.jpg?20251203211359",
        "type": "World",
        "Author": "Henry Vaughan",
        "Date Published": "2025-12-04 09:06:00",
        "Headline": "Dawn Sturgess's condition was \"unsurvivable\" after she unwittingly sprayed herself with novichok from a perfume bottle left by a Russian military hit squad, report says. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The assassination attempt on a former Russian spy was authorised by Vladimir Putin, who is \"morally responsible\" for the death of a woman poisoned by the nerve agent used in the attack, a public inquiry has found.  The chairman, Lord Hughes, found there were \"failings\" in the management of Sergei Skripal, 74, who was a member of Russian military intelligence, the GRU, before coming to the UK in 2010 on a prisoner exchange after being convicted of spying for Britain. But he found the assessment that he wasn't at \"significant risk\" of assassination was not \"unreasonable\" at the time of the attack in Salisbury on 4 March 2018, which could only have been avoided by hiding him with a completely new identity. Mr Skripal and his daughter Yulia, 41, who was also poisoned, were left seriously ill, along with then police officer Nick Bailey, who was sent to search their home, but they all survived. Dawn Sturgess, 44, died on 8 July, just over a week after unwittingly spraying herself with novichok given to her by her partner, Charlie Rowley, 52, in a perfume bottle in nearby Amesbury on 30 June 2018. Mr Rowley was left seriously ill but survived. In his 174-page report, following last year's seven-week inquiry, costing more than £8m, former Supreme Court judge Lord Hughes said she received \"entirely appropriate\" medical care but her condition was \"unsurvivable\" from a very early stage. The inquiry found GRU officers using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury after arriving in London from Moscow with a third agent known as Sergey Fedotov to kill Mr Skripal on 2 March. \n                  Salisbury novichok poisonings: Seven questions to be answered by inquiry\n                 \n                  Who were the targets of Russian spy ring dubbed 'the Minions'?\n                 \n                  Three people guilty of spying for Russia from Great Yarmouth seaside guesthouse\n                 The report said it was likely the same bottle Petrov and Boshirov used to apply the military-grade nerve agent to the handle of Mr Skripal's front door before it was \"recklessly discarded\". \"They can have had no regard to the hazard thus created, of the death of, or serious injury to, an uncountable number of innocent people,\" it said. It is \"impossible to say\" where Mr Rowley found the bottle, but was likely within a few days of it being abandoned on 4 March, meaning there is \"clear causative link\" with the death of mother-of-three Ms Sturgess. Lord Hughes said he was sure the three GRU agents \"were acting on instructions\", adding: \"I have concluded that the operation to assassinate Sergei Skripal must have been authorised at the highest level, by President Putin. \"I therefore conclude that those involved in the assassination attempt (not only Petrov, Boshirov and Fedotov, but also those who sent them, and anyone else giving authorisation or knowing assistance in Russia or elsewhere) were morally responsible for Dawn Sturgess's death,\" he said. Russian ambassador summonsed After the publication of the report, the government announced the GRU has been sanctioned in its entirety, and the Russian Ambassador has been summonsed to the Foreign Office to answer for Russia's ongoing campaign of alleged hostile activity against the UK. Sir Keir Starmer said the findings \"are a grave reminder of the Kremlin's disregard for innocent lives\" and that Ms Sturgess's \"needless\" death was a tragedy that \"will forever be a reminder of Russia's reckless aggression\". \"The UK will always stand up to Putin's brutal regime and call out his murderous machine for what it is,\" the prime minister said. He said deploying the \"highly toxic nerve agent in a busy city centre was an astonishingly reckless act\" with an \"entirely foreseeable\" risk that others beyond the intended target would be killed or injured. The inquiry heard a total of 87 people presented at A&E. Lord Hughes said there was a decision taken not to issue advice to the public not to pick anything up which they hadn't dropped, which was a \"reasonable conclusion\" at the time, so as not to cause \"widespread panic\". He also said there had been no need for training beyond specialist medics before the \"completely unexpected use of a nerve agent in an English city\". After the initial attack, wider training was \"appropriate\" and was given but should have been more widely circulated. In a statement following the publication of his report, Lord Hughes said Ms Sturgess's death was \"needless and arbitrary\", while the circumstances are \"clear but quite extraordinary\". \"She was the entirely innocent victim of the cruel and cynical acts of others,\" he said. 'We can have Dawn back now' Speaking after the report was published, Ms Sturgess's father, Stanley Sturgess, said: \"We can have Dawn back now. She's been public for seven years. We can finally put her to peace.\" In a statement, her family said they felt \"vindicated\" by the report, which recognised how Wiltshire police wrongly characterised Ms Sturgess as a drug user. But they said: \"Today's report has left us with some answers, but also a number of unanswered questions. \"We have always wanted to ensure that what happened to Dawn will not happen to others; that lessons should be learned and that meaningful changes should be made. \"The report contains no recommendations. That is a matter of real concern. There should, there must, be reflection and real change.\" Wiltshire Police Chief Constable Catherine Roper admitted the pain of Ms Sturgess's family was \"compounded by mistakes made\" by the force, adding: \"For this, I am truly sorry.\" Russia has denied involvement  The Russian Embassy has firmly denied any connection between Russia and the attack on the Skripals. But the chairman dismissed Russia's explanation that the Salisbury and Amesbury poisonings were the result of a scheme devised by the UK authorities to blame Russia, and the claims of Petrov and Borisov in a television interview that they were sightseeing. The inquiry chairman said the evidence of a Russian state attack was \"overwhelming\" and was designed not only as a revenge attack against Mr Skripal, but amounted to a \"public statement\" that Russia \"will act decisively in its own interests\". Lord Hughes found \"some features of the management\" of Mr Skripal \"could and should have been improved\", including insufficient regular written risk assessments. But although there was \"inevitably\" some risk of harm at Russia's hands, the analysis that it was not likely was \"reasonable\", he said. \"There is no sufficient basis for concluding that there ought to have been assessed to be an enhanced risk to him of lethal attack on British soil, such as to call for security measures,\" such as living under a new identity or at a secret address, the chairman said. He added that CCTV cameras, alarms or hidden bugs inside Mr Skripal's house might have been possible but wouldn't have prevented the \"professionally mounted attack with a nerve agent\". Sky News has approached the Russian Embassy for comment on the report."
    },
    {
        "title": "Israel allowed to take part in Eurovision 2026 - as several countries withdraw",
        "description": "Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event.",
        "url": "https://news.sky.com/story/israel-allowed-to-take-part-in-eurovision-2026-as-at-least-two-countries-withdraw-13479330",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-israel-eurovision-song-contest_7100933.jpg?20251204135255",
        "type": "World",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-04 17:45:00",
        "Headline": "Spain, Ireland, Slovenia and the Netherlands have all pulled out of next year's Eurovision contest - with some broadcasters yet to make statements.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event. Dutch broadcaster AVROTROS, Spain's RTVE, Ireland's RTE and Slovenia's RTV immediately issued statements saying they will not participate in the 2026 contest following the European Broadcasting Union's general assembly meeting on Thursday. Members from 37 countries were asked to vote in a secret ballot on whether they were happy with tougher new rules announced last month, without going ahead with a vote on participation next year. It followed criticism from some broadcasters of Israel's role in Eurovision amid the war in Gaza, and allegations that voting at this year's contest had been manipulated in favour of their contestant. In a statement, the EBU, which organises Eurovision, said members had shown \"clear support for reforms to reinforce trust and protect neutrality\". Sky News understands 11 countries voted against only accepting the rule changes. Golan Yochpaz, chief executive of Israel's public broadcaster KAN, said during the meeting that attempts to remove them from the contest could \"only be understood as a cultural boycott\", according to a statement shared by the organisation. Israel's president Isaac Herzog posted on X following the announcement, saying: \"Israel deserves to be represented on every stage around the world, a cause to which I am fully and actively committed... I hope that the competition will remain one that champions culture, music, friendship between nations, and cross-border cultural understanding.\" Boycott announcements - what have broadcasters said? The broadcasters from Spain, Ireland, Slovenia and the Netherlands had all said earlier in the year that they would not participate in 2026 should Israel be allowed to continue in the competition. In a statement following the general assembly meeting, RTE confirmed Ireland's position. \"RTE feels that Ireland's participation remains unconscionable given the appalling loss of lives in Gaza and the humanitarian crisis there which continues to put the lives of so many civilians at risk,\" the broadcaster said. AVROTROS, broadcaster for the Netherlands, said that \"under the current circumstances, participation cannot be reconciled with the public values that are fundamental to our organisation\". General director Taco Zimmerman said it had not been an easy decision, adding: \"Culture unites, but not at any price. What has happened over the past year has tested the limits of what we can uphold.\" Confirming its withdrawal, Spain's RTVE highlighted how its board of directors had agreed in September that the country would withdraw \"if Israel was part of it\". This is a big deal for Eurovision, as Spain is one of the \"Big Five\" broadcasters - a group which also includes France, Germany, Italy and the UK. While the host broadcaster - as last year's winners, this is Austria this year - will often contribute the most towards the cost of staging the contest, the Big Five will also make up a significant amount. Slovenian broadcaster RTV said it was pulling out of the competition \"on behalf of the 20,000 children who died in Gaza\". In her address to members before the decision, Natalija Gorscak, RTV Slovenia board chairwoman, said: \"For the third year in a row, the public has demanded that we say no to the participation of any country that attacks another country. We must follow European standards for peace and understanding. \"Eurovision has been a place for joy and happiness from the very beginning, performers and audiences have been united by music, and it should remain that way.\" Eurovision 'is for broadcasters, not governments' But Austria's broadcaster ORF said it was happy with the decision and is looking forward to hosting next year. Roland Weissman, ORF director-general, said the contest \"is a competition for broadcasters, not governments\", and that he had personally advocated for Israel's participation. \"In the spirit of fostering cultural dialogue and supporting and strengthening the democratic role of public broadcasters, it was important not to burn any bridges,\" he said, adding that concerns raised by some members had been taken \"very seriously\". \"Naturally, I would regret it if broadcasters were to decide against participating,\" he added. \"I see the Eurovision Song Contest in Vienna as an opportunity to emphasise what unites us rather than what divides us - United by Music.\" Politics has always played a part in Eurovision, despite the EBU's insistence that it remains politically neutral. Countries have pulled out or been banned in previous years - most notably Russia in 2022, just days after the invasion of Ukraine. But this exodus could be Eurovision's biggest political crisis yet, with suggestions that other broadcasters may follow suit. Iceland's broadcaster RUV said its board would discuss participation at a meeting next Wednesday, after previously agreeing to a motion to recommend Israel be expelled. The BBC, which broadcasts the competition in the UK, said it supported the decision for Israel to be allowed to take part. \"This is about enforcing the rules of the EBU and being inclusive,\" it said in a statement. Earlier this year, outgoing BBC director-general Tim Davie said the corporation was \"aware of the concerns\" raised, but the song contest had \"never been about politics\". Arts and entertainment correspondent With a slew of countries quitting Eurovision over Israel's inclusion, the competition has been thrown into chaos. This has been brewing for some time. A few months ago, the row had become such a point of contention that the EBU announced plans for an emergency vote. Crucially, that was called off when a Gaza ceasefire was announced. So instead, at its big assembly meeting, countries were only allowed to vote on rule changes being introduced - another issue that allegedly involved Israel amid accusations of unfair voting practices. If you read the EBU's post-meeting statement, you'd think it had gone swimmingly. But while it made it sound like everyone was in agreement, Sky News understands 11 countries in fact voted against the changes. Denied an actual vote on Israel's participation, it triggered a domino effect of countries quitting – the Netherlands, Ireland, Spain and Slovenia. Arguably, Spain pulling out could have the biggest effect. It's one of the key financial backers of the contest – and that could potentially impact the ability to stage it in the grand way we've become to accustomed to. So what happens next? The contest prides itself on maintaining political and cultural neutrality, positioning itself as celebrating music and peace rather than politics. But for now, the big question is: who will be left singing? How have the rules changed? In November, the EBU announced it was changing its voting system. This followed allegations of \"interference\" by Israel's government earlier this year. The rule changes announced in November came after Israeli singer Yuval Raphael received the largest number of votes from the public at the 2025 event, held in Basel, Switzerland, in May - ultimately finishing as runner-up to Austria's entry after the jury votes were counted. But a number of broadcasters raised concerns about Israel's result. Key changes to next year's competition include: • Clearer rules around promotion of artists and their songs• Cap on audience voting halved• The return of professional juries to semi-finals• Enhanced security safeguards It was these changes members were secretly balloted on at the general assembly. With a \"large majority\" voting that they were happy with these changes, the EBU said there was no need for a further vote on participation. Speaking after the discussion, EBU president Delphine Ernotte Cunci said the result \"demonstrates members' shared commitment to protecting transparency and trust in the Eurovision Song Contest, the world's largest live music event\". Thanking members for their \"thoughtful, respectful and constructive contributions\" during the session and throughout the year, she said these discussions had led to \"meaningful changes\" to the rules, ensuring the contest \"remains a place for unity and cultural exchange\"."
    },
    {
        "title": "Ukraine has become Europe's war - so why doesn't it act like it?",
        "description": "Something concrete and unarguable has emerged from the diplomatic turbulence generated by Donald Trump's attempts to end the war in Ukraine.&#160;",
        "url": "https://news.sky.com/story/ukraine-has-become-europes-war-so-why-doesnt-it-act-like-it-13479249",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-zelenskyy-ukraine-eu_7100711.jpg?20251204103737",
        "type": "World",
        "Author": "John Sparks",
        "Date Published": "2025-12-04 10:25:00",
        "Headline": "European leaders have been issuing lofty declarations, but it's time to treat Ukraine like the emergency it is - or face the consequences.",
        "Content": "\n          International correspondent\n              @sparkomat\n  Something concrete and unarguable has emerged from the diplomatic turbulence generated by Donald Trump's attempts to end the war in Ukraine.  The war in Ukraine has become Europe's war - in fact, it is unlikely to be America's problem for long. The Trump administration's 20-something-point peace plan, as shepherded by envoys Steve Witkoff and Jared Kushner, is going nowhere. When presented with the proposal on Tuesday, a Russian negotiator said President Putin made, \"no secret of our critical and even negative attitude toward a number of elements.\" But the words of the Russian leader himself are more instructive. In a belligerent speech made on the same day, he threatened to \"cut Ukraine off from the sea entirely\" in retaliation to a series of attacks on Russian-linked oil tankers. This is not a man thinking about doing a deal. Putin is the obvious obstacle. None of which will have come as any surprise to leaders in Europe and the UK, who did what they typically do when the situation looks grim. \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 \n                  Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid\n                 Britain, France, Ireland, Germany and others have been issuing lofty declarations of the \"we'll support Ukraine as long as it takes,\" variety. But this time it is different. European leaders are going to have to treat Ukraine like the emergency it is - or face the consequences. Presently, they occupy a position that many see as absurd. Europe, including Britain, bankroll the Ukrainian government. Funding which was split down the middle with the Biden administration has been assumed by Europe in full. Furthermore, the Europeans pay for all American weaponry through a NATO facility called PURL. Thus, Europe has got skin in the game - they are paying the bills. But where are they sitting at the negotiation table? They are not there at all. The Russians do not want them, and the US does not seem particularly keen. When US secretary of state Marco Rubio met a Ukrainian delegation to discuss the peace plan in Geneva, he said he did not know anything about European counter-proposals \"It's extraordinary that Europe is picking up the bill but struggles to make itself heard,\" says Marc De Vore, of St Andrews University. \"It shows the lack of vision, coordination and leadership across the continent.\" The former foreign minister of Lithuania, Gabrielius Landsbergis, is utterly exasperated by Europe's ineffectiveness. \"If you are a European leader asking your team to book you on the next flight to Washington to go talk to daddy, please don't. Not without a plan, not cap in hand, not humiliating us all in front of the cameras at the Oval Office. \"Europe is our continent, our future is decided here, not there. We aren't poor, we have options, we can finally decide to assist Ukraine to the full extent…\" Read more:Putin 'wasting the world's time' after rejecting peace dealBriton held in Ukraine on suspicion of spying for Russia This frustration is shared by the Ukrainians, who have begun to use a different word to describe this relationship - betrayal. Inna Sovsun is an MP in the Ukrainian parliament. Her husband, a combat medic, is serving at the front. \"People on the frontline feel really disappointed with the whole situation, and it does feel like betrayal. \"The challenge is much bigger than which village will be controlled by whom in Donbas. It is about, what does the future of civilisation look like? Does Russia's barbaric version win? If you are not willing to fight for that, those values aren't worth much, are they?\" Unsurprisingly perhaps, analysts and others are sketching out what Ukraine would look like if forced to capitulate. The idea here, is that Europe will not like what it sees. Picture an unstable nation on Europe's border with a proxy-Russian leader - or different groups battling for control. The population is restive, with many thousands of men both conditioned and traumatised by war. Millions of refugees seek shelter in Europe. Economists have tried to put a figure on such scenarios, with one group estimating costs to Europe approaching €3tn euros in additional defence and refugee-related spending if Ukraine is seriously weakened. For the Europeans, a test of their resolve is already at hand. The EU must agree on a plan to seize up to €210bn euros in frozen Russian assets as a means of funding the cash-strapped government in Kyiv. The issue is legally contentious, with countries like Belgium, where much of the money is held, fretting about liability. But the Ukrainians see it as a simple question of commitment. \"Given what is at stake, there just has to be stronger political will. That is what is difficult for us to grasp. (They) say all those good things, the right things, but that doesn't really matter much,\" says Ms Sovsun."
    },
    {
        "title": "'No discussion' about banning Maccabi Tel Aviv fans at Stuttgart Europa League match ",
        "description": "Maccabi Tel Aviv fans will be allowed into next week's Europa League match at Stuttgart as banning them was not considered, the German club has confirmed to Sky News.",
        "url": "https://news.sky.com/story/no-discussion-about-banning-maccabi-tel-aviv-fans-at-stuttgart-europa-league-match-13479482",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maccabi-tel-aviv-fans_7055538.jpg?20251019163238",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-12-04 20:11:00",
        "Headline": "Stuttgart says neither the club nor local authorities have discussed banning Maccabi fans from their upcoming game.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Maccabi Tel Aviv fans will be allowed into next week's Europa League match at Stuttgart as banning them was not considered, the German club has confirmed to Sky News. It contrasts with the Israeli club's fans being excluded from Aston Villa last month after police in Birmingham cited safety threats - a decision now condemned by Europe's main football supporters' group. West Midlands Police chiefs justified the decision on Monday to the Home Affairs Select Committee by referencing racist violence by the Maccabi fans in Amsterdam last year - evidence disputed in part by the Dutch police to Sky News.  We have learned officials in southeast Germany did not consider imposing a ban on Maccabi fans next Thursday for the club's first Europa League away match since the trip to Birmingham. \"Maccabi Tel Aviv fans can attend this game,\" Bundesliga club Stuttgart told Sky News. \"There was no discussion in Stuttgart about excluding away fans - neither among the local authorities nor within the club.\" The municipal council in Stuttgart said that after talks with \"all the authorities that deal with public safety, all of them are well prepared and focus on securing public safety\". \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 \n                  Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid\n                 The decision to allow Israeli fans into Stuttgart's MHP Arena has been backed by Football Supporters Europe, which is now expressing concern about the moves by authorities in Birmingham to shut out Maccabi fans amid community tensions inflamed by the Israel-Hamas war. Read more:Maccabi boss hits out at 'blatant falsehoods'Police blame ban on 'significant hooliganism' \"An away travel ban is always an admission of defeat from the public authorities,\" Ronan Evain, executive director of Football Supporters Europe, told Sky News. \"The vast majority of police forces in Europe are perfectly capable of hosting away fans - that's why only a handful of countries resort to travel bans. \"Germany is very experienced in organising high-profile games and never had to resort to such extreme measures. \"We are happy that, contrary to the West Midlands Police, German police opted for an intelligence-informed approach and the protection of fans' fundamental rights, including freedom of movement.\""
    },
    {
        "title": "'If someone took Trump's land, how would he feel?' - Ukrainians view peace talks with suspicion",
        "description": "A Ukrainian farmer-turned-soldier in the Donbas has a message for Donald Trump as the US president attempts to broker a peace deal between Kyiv and Moscow.",
        "url": "https://news.sky.com/story/if-someone-took-trumps-land-how-would-he-feel-ukrainians-view-peace-talks-with-suspicion-13478972",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donbas-ukraine_7100462.jpg?20251204015021",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-04 01:50:00",
        "Headline": "An initial proposal envisaged the Ukrainian government giving up Donetsk and Luhansk, the two regions that make up the Donbas, to Russia. But troops on the frontline are against the plans.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  A Ukrainian farmer-turned-soldier in the Donbas has a message for Donald Trump as the US president attempts to broker a peace deal between Kyiv and Moscow. Anatolii, 59, said: \"If someone took a piece of his territory, what would he say to that? The same goes for us.\" Like many Ukrainians, the serviceman volunteered to join a territorial defence unit when Russia launched its full-scale war almost four years ago. Follow live: Ukraine war latest He has been fighting ever since, but will have the option to quit next year once he turns 60. Unable to wear body armour anymore because of its weight, Anatolii now operates further back from the frontline in a small workshop on the outskirts of the city of Kramatorsk, where he helps to fix and improve the performance of drones - a crucial weapon on the battlefield. \"I want this war to finally end,\" he said. \"I want to go home, to my family, to my land.\" \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 \n                  Why Putin won't agree to latest Ukraine peace plan\n                 \n                  Imran Khan vs the military: What's just happened in Pakistan?\n                 But not at any price. He and other soldiers in 107 Brigade of Ukraine's Territorial Defence Force view Mr Trump's efforts to negotiate a peace agreement with suspicion.  An initial proposal envisaged the Ukrainian government giving up Donetsk and Luhansk, the two regions that make up the Donbas, to Russia. This includes large swathes of land that are still under Ukraine's control, and that thousands of Ukrainian soldiers have lost their lives fighting to defend. \"I feel negative about it,\" Anatolii said, referring to the proposal. \"So many people already fell for this land ... How can we give away our land? It would be like someone comes to my house and says: 'Give me a piece of your home.'\" However, he added: \"I understand, we have nothing to take it back with. Maybe through some political means... \"I do not want more people to fall, more people to die. I want politicians to somehow come to terms.\" Ukraine and US negotiators will meet in Miami on Thursday to discuss peace efforts, after American and Russian teams met in Moscow earlier this week. A short drive away from the workshop is a hidden bomb factory where other soldiers from the same unit are focused on a different kind of war effort. Surrounded by 3D printed gadgets, metal ball bearings and plastic explosives, they make improvised bombs, including anti-personnel mines and devices that can be fitted onto one-way attack drones and exploded onto targets. Vadym, 41, is in charge of the production line. He has been fighting since Russian President Vladimir Putin first attacked eastern Ukraine in 2014. Asked whether he felt tired, he said: \"We are always tired, we have no motivation as such, but there is the understanding that the enemy will keep coming as long as we do not stop him. If we stop fighting, our children and grandchildren will fight. That keeps us going.\" Vadym is also against simply handing over Ukrainian land to Russia. \"If we now give away borders, give away Donbas, then what?\" he said. \"Any country can come to any other country and say: This is our land. Let's coordinate, do business, and keep living as before. That is not normal in my view.\"  The city of Kramatorsk stands testament to Ukraine's will to fight, remaining firmly in Ukrainian hands, though Russia's war is inching closer. Nets stretched like a tunnel line a main road leading into the city to protect vehicles from the threat of small, killer drones. Coils of barbed wire are also strung across fields around the outskirts of Kramatorsk along with other fortifications such as mounds of dirt and triangular lumps of concrete. Many civilians have remained here as well as the nearby city of Slovyansk, even as other landmark sites such as Mariupol, Bakhmut and Avdiivka have fallen. Yet the toll of living in a warzone is clear. Stallholders swept away rubble and broken glass on Sunday after a Russian missile smashed into a central market in Kramatorsk on Saturday night. Some, like Ella, 60, even chose to reopen despite the carnage. \"It's frightening. We need to earn a living. I have my mother, I need to look after her, help my children. So we do what we have to do,\" she said. Her adult children live in Kyiv and want her to leave, but Kramatorsk is her home. \"We've been living like this for four years now. We're so used to it. A drone flies overhead and we keep working,\" she said.  Asked how she felt about what the war had done to her city, Ella's voice wobbled and she wiped tears from her eyes. \"We keep it all inside, but it still hurts. It's frightening and painful. I just want things as they used to be. We don't want anything here to change,\" she said. As for what she would do if a future peace deal forced Ukraine to surrender the area, Ella said: \"That's a hard question ... I wouldn't stay. I'd leave.\" Production by security and defence producer Katy Scholes, Ukraine producer Azad Safarov, camera operator Mostyn Pryce"
    },
    {
        "title": "In 'Little Kabul', Afghans feel they have to prove their US loyalty all over again",
        "description": "In a quiet suburb in the San Francisco Bay area, the smell of naan bread wafts out from the Maiwand Market and on to the street.&#160;",
        "url": "https://news.sky.com/story/in-little-kabul-afghans-feel-they-have-to-prove-their-us-loyalty-all-over-again-13479172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-fremont-san-francisco-bay_7100522.jpg?20251204070331",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-12-04 07:09:00",
        "Headline": "Many in the Afghan community in Fremont think they are being collectively punished after an Afghan national, granted asylum in the US for helping the CIA, allegedly shot two National Guard members, one of them fatally.",
        "Content": "\n          US correspondent\n              @marthakelner\n  In a quiet suburb in the San Francisco Bay area, the smell of naan bread wafts out from the Maiwand Market and on to the street.  Fremont is known locally as 'Little Kabul', a home to thousands of people who have fled Afghanistan. It's become a sanctuary for successive generations. But this community is now in the crosshairs of Donald Trump's anti-immigration policy after two National Guard troops were shot near the White House, one of whom died. The suspect is an Afghan national who was granted asylum in the US after helping the CIA during the war in Afghanistan. In the wake of the shooting, President Trump said he would immediately pause asylum applications from Afghanistan and review the status of those who arrived since the US withdrawal from the country in 2021. Many Afghan refugees in Fremont see it as a form of collective punishment. Nazi Hamini, who spoke to me at Jamal Farm, a fruit and vegetable market, said Afghans \"say that because of one person we cannot blame all of them\". Picking out a rotten orange from a box, she said \"there are so many good fruits. Only one is really bad. But you can see it didn't affect the one right next to it. I think people are like this, too\". When Nazi, 28, arrived in the US as a teenager, she said she \"could barely speak just one word of English\". She added: \"But I have worked super hard to survive, then I went to college. Now I'm married, I have a daughter, and I have a beautiful life.\" Jamal Farm's owner Mohamed Qasmi is an Afghan who has lived in the US for almost 25 years. Like many here, he feels a renewed need to justify his presence. \"We work hard, look at my hands,\" he said, showing me fingers blackened with dirt. \"We just want to work hard.\" Immigration raids are expected to intensify in Afghan communities in the coming weeks. The Trump administration says it is searching for people who have already been issued with deportation orders by judges. There is the sense in Fremont that this is a community under surveillance. Read more on Sky News:Epstein island pictures publishedTrump's World Cup plansMatthew Perry's doctor jailed Sayed Khalid, who has been in the US for six years, said: \"I know a couple of families [who] have stopped watching the news because of the pressure. \"And their kids going to school, they also think that they will be sent back. That feels really harsh because of the situation in Afghanistan, the way they have freedom here, the quality of education and also the permission for girls to go to school here. In Afghanistan, girls cannot go to school past Year 6.\" Sayed, who has a green card, is waiting for an appointment in the hope he will be able to become a US citizen, but his process is now on hold. He said: \"I'm concerned about the length of time that will be added, but we have to support the decision and help them with the vetting processes. \"I support vetting people who are here so that America stays safe, but also not punishing everyone for one person's mistakes.\""
    },
    {
        "title": "'Drop and cover'  earthquake alert turns out to be false alarm",
        "description": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false.",
        "url": "https://news.sky.com/story/drop-and-cover-earthquake-alert-turns-out-to-be-false-alarm-13479519",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-earthquake-nevada_7101373.jpg?20251204232026",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-04 22:13:00",
        "Headline": "Seismologists say the bogus message sent out in Nevada and California may be a first and \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles, could be to blame.",
        "Content": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false. The US Geological Survey (USGS) warned a 5.9-magnitude quake had struck near Dayton, Nevada, with people in the San Francisco area, about 180 miles away, also getting the message. However, multiple law enforcement agencies near the reported epicentre reported no shaking or other earthquake signs. A 5.9 quake can typically cause minor property damage and pronounced shaking, according to magnitude scales. The reason for the false alarm is unclear but it's believed to be the first time the automatic system has sent a bogus message. \"To my knowledge we've never had a false alert like this,\" said Yaareb Altaweel, from the National Earthquake Information Center in Colorado. \"The system has put out incorrect information on exaggerated magnitude or depth, which was corrected immediately by the on-duty seismologist, [but] I have seen that happen before,\" said Altaweel. \n                  Victorious Scotland fans caused 'extremely small' earthquake in Denmark win\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 \n                  'We don't have anything for winter': Families fear months ahead after earthquake wiped out entire villages in Afghanistan\n                 Angie Lux, at the Berkeley Seismological Laboratory, also said she had never heard of a completely false alert. She said the cause could have been \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles. Natural phenomena for such triggers include wind and ocean waves. Read more from Sky News:Countries withdraw from Eurovision over Israel decisionAnti-Hamas militia leader killed in Gaza - reports The UK experienced its own (authentic) earthquake this week when a 3.3-magnitude tremor hit northwest England. The British Geological Survey (BGS) said it was \"felt across the South Lakes and Lancashire, mainly within 20km of the epicentre\", including Kendal and Ulverston in neighbouring Cumbria."
    },
    {
        "title": "In 'Little Kabul', Afghans feel they have to prove their US loyalty all over again",
        "description": "In a quiet suburb in the San Francisco Bay area, the smell of naan bread wafts out from the Maiwand Market and on to the street.&#160;",
        "url": "https://news.sky.com/story/in-little-kabul-afghans-feel-they-have-to-prove-their-us-loyalty-all-over-again-13479172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-fremont-san-francisco-bay_7100522.jpg?20251204070331",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-12-04 07:09:00",
        "Headline": "Many in the Afghan community in Fremont think they are being collectively punished after an Afghan national, granted asylum in the US for helping the CIA, allegedly shot two National Guard members, one of them fatally.",
        "Content": "\n          US correspondent\n              @marthakelner\n  In a quiet suburb in the San Francisco Bay area, the smell of naan bread wafts out from the Maiwand Market and on to the street.  Fremont is known locally as 'Little Kabul', a home to thousands of people who have fled Afghanistan. It's become a sanctuary for successive generations. But this community is now in the crosshairs of Donald Trump's anti-immigration policy after two National Guard troops were shot near the White House, one of whom died. The suspect is an Afghan national who was granted asylum in the US after helping the CIA during the war in Afghanistan. In the wake of the shooting, President Trump said he would immediately pause asylum applications from Afghanistan and review the status of those who arrived since the US withdrawal from the country in 2021. Many Afghan refugees in Fremont see it as a form of collective punishment. Nazi Hamini, who spoke to me at Jamal Farm, a fruit and vegetable market, said Afghans \"say that because of one person we cannot blame all of them\". Picking out a rotten orange from a box, she said \"there are so many good fruits. Only one is really bad. But you can see it didn't affect the one right next to it. I think people are like this, too\". When Nazi, 28, arrived in the US as a teenager, she said she \"could barely speak just one word of English\". She added: \"But I have worked super hard to survive, then I went to college. Now I'm married, I have a daughter, and I have a beautiful life.\" Jamal Farm's owner Mohamed Qasmi is an Afghan who has lived in the US for almost 25 years. Like many here, he feels a renewed need to justify his presence. \"We work hard, look at my hands,\" he said, showing me fingers blackened with dirt. \"We just want to work hard.\" Immigration raids are expected to intensify in Afghan communities in the coming weeks. The Trump administration says it is searching for people who have already been issued with deportation orders by judges. There is the sense in Fremont that this is a community under surveillance. Read more on Sky News:Epstein island pictures publishedTrump's World Cup plansMatthew Perry's doctor jailed Sayed Khalid, who has been in the US for six years, said: \"I know a couple of families [who] have stopped watching the news because of the pressure. \"And their kids going to school, they also think that they will be sent back. That feels really harsh because of the situation in Afghanistan, the way they have freedom here, the quality of education and also the permission for girls to go to school here. In Afghanistan, girls cannot go to school past Year 6.\" Sayed, who has a green card, is waiting for an appointment in the hope he will be able to become a US citizen, but his process is now on hold. He said: \"I'm concerned about the length of time that will be added, but we have to support the decision and help them with the vetting processes. \"I support vetting people who are here so that America stays safe, but also not punishing everyone for one person's mistakes.\""
    },
    {
        "title": "Bank of America boss Brian Moynihan warns countries to 'be careful' when raising tax",
        "description": "The chairman and chief executive of one of the world's biggest banks has said countries have \"got to be careful\" with their budgets and ask themselves what a tax rise is for.",
        "url": "https://news.sky.com/story/bank-of-america-boss-brian-moynihan-warns-countries-to-be-careful-when-raising-tax-13479464",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-moynihan-bank-of-america_5943445.jpg?20221025193034",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-04 19:08:00",
        "Headline": "The chief executive said the King's briefing and knowledge impressed not only him but also \"impresses everybody\".",
        "Content": "The chairman and chief executive of one of the world's biggest banks has said countries have \"got to be careful\" with their budgets and ask themselves what a tax rise is for. Bank of America's Brian Moynihan was speaking about the UK budget to Sky's Wilfred Frost on his The Master Investor Podcast. While Mr Moynihan said the recent UK fiscal announcement was \"fine with Bank of America\", he added that governments must be careful with financial markets' reaction. \"All countries have to understand that the simple question a business asks is, you want higher taxes... higher taxes for what? If the 'for what' is not something that makes sense, that's when you get in trouble,\" Mr Moynihan said.  Money blog: Major airport increasing drop-off charge The American executive was complimentary of the UK as a centre for financial services, saying, \"You've got to realise this is one of your best industries\". \n                  Curve investor files legal challenge to block £125m sale to Lloyds\n                 \n                  How hidden card service could save you hundreds\n                 \n                  Lloyds clinches £120m deal for digital wallet provider Curve\n                 \"You have many other good industries, but a great industry for you is financial services\". The power of London While Paris was looked to in the wake of Brexit, London has pulling power for Bank of America and its staff, Mr Moynihan said. \"London is a great city for young kids to come work. People from all over the world will come work here a while and leave, and others will stay here permanently.  \"That's the advantage you have. You're built. And while other financial centres are trying to build.... you're built, you're there.\"  London, he said, is Bank of America's \"headquarters of the world\". Mr Moynihan was upbeat about the prospects for the country too. \"It's more upside for the UK right now than anything else,\" he said. Bank of America is the second-largest bank in America with a market capitalisation of nearly $300bn - making it roughly 10 times bigger than Barclays, Lloyds and NatWest, and more than three times bigger than HSBC. Having met with the King again on his latest trip to the UK, the CEO said, \"his briefing and his knowledge and his passion... it not only impresses me, but I've seen it in front of so many people over the last six years. It impresses everybody\". Mr Moynihan - one of the longest-serving Wall Street chief executives - has been leading Bank of America since 2010, when he was brought after the financial crisis.  "
    },
    {
        "title": "Direct trains from UK to Germany 'one step closer', but nothing yet on journeys to Berlin",
        "description": "The UK has come a \"step closer\" to having direct, high-speed rail connections to Germany, the Department for Transport has said. ",
        "url": "https://news.sky.com/story/direct-trains-from-uk-to-germany-one-step-closer-but-nothing-yet-on-journeys-to-berlin-13479372",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-eurostar-celestia-trains_7058203.jpg?20251022110500",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-04 15:05:00",
        "Headline": "No plans for direct trains from London to Berlin were announced due to commercial viability reasons, despite government highlighting potential benefits.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK has come a \"step closer\" to having direct, high-speed rail connections to Germany, the Department for Transport has said.  A partnership between international train operator Eurostar and German national rail company Deutsche Bahn (DB) has \"set the foundation\" for a fast rail connection between Britain and Europe's largest economy, the businesses announced on Thursday. It means the companies are exploring options to offer direct services between London and Cologne and Frankfurt. Money blog: Major airport increasing drop-off charge Such direct services would mean reaching Cologne in four hours, and Frankfurt in less than five from the capital city.  At present, rail passengers have to change trains in Brussels to reach those cities. It takes at least five-and-a-half hours to reach Frankfurt, and four-and-a-quarter hours to arrive in Cologne. The proposed services would use existing lines and infrastructure. Passengers would board a double-decker Eurostar in London, and be spared a change of trains on the continent. \n                  'Win for passengers' as Virgin clears first step to run Channel Tunnel trains to rival Eurostar\n                 \n                  Eurostar orders UK's first fleet of double-decker trains\n                 \n                  Thousands of Eurostar passengers facing cancellations and severe delays after cable theft\n                 The ambition to create such links had already been announced, as had a plan to allow direct rail travel from London to Geneva, but the partnership between DB and Eurostar had not. Will it definitely happen? Details and technicalities are yet to be worked out, with the German train company highlighting that any services are contingent upon \"the necessary technical, operational, and legal prerequisites being met\". \"Implementation by individual railway companies is considered extremely difficult,\" DB said. \"Joint partnerships are therefore crucial.\"  What about Berlin? Nothing was announced for a direct service to Berlin on Thursday, despite Transport Secretary Heidi Alexander singling out the benefits and prospect of journeys from London to the German capital in July.  \"The Brandenburg Gate, the Berlin Wall and Checkpoint Charlie - in just a matter of years, rail passengers in the UK could be able to visit these iconic sights direct from the comfort of a train, thanks to a direct connection linking London and Berlin,\" she said at the time. Shorter journeys, like those to Frankfurt and Cologne, are seen as more commercially viable than the current 10-hour train journey time to Berlin. Market studies conducted by Eurostar found travellers are comfortable with international rail journeys of up to six hours. \"Our research indicates that many would choose rail over air for trips within this timeframe,\" Eurostar told Sky News. \"This, combined with strong business and leisure demand on this route, is why we have prioritised London to Frankfurt.\" Read more from Sky News:Petrofac administrators eye North Sea sale by ChristmasSubmarine hunting pact signed by UK amid Russian threat The Department for Transport said the focus on the two German cities was a commercial decision by Eurostar and DB, and the UK-Germany rail taskforce, established over the summer, could pave the way for further route announcements."
    },
    {
        "title": "Energy grid £28bn upgrade to add £108 to household bills",
        "description": "The energy regulator has confirmed plans for a massive upgrade to the UK's energy grids, adding &#163;108 to customer bills by 2031.",
        "url": "https://news.sky.com/story/energy-grid-16328bn-upgrade-to-add-163108-to-household-bills-13479170",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-energy-money-gfx_7008555.jpg?20250901182947",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-04 08:06:00",
        "Headline": "Ofgem says the investment cash being demanded of energy customers will be mostly offset by efficiencies delivered by the projects.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The energy regulator has confirmed plans for a massive upgrade to the UK's energy grids, adding £108 to customer bills by 2031. Ofgem said on Thursday that the £28bn investment over the next five years would bolster resilience in the transition to a renewable energy future and that much of the bill would be offset by increased efficiency. It pointed to estimated savings for households of around £80 because of the planned investment in gas and power infrastructure, leaving a net additional contribution of £28. Money latest: Is property still a good investment? Ofgem said the £28bn sum formed part of an estimated £90bn to be invested in the energy networks by 2031, with \"adaptive\" funding arrangements helping to shield customers from volatility in the market. Most of the funding announced on Thursday will go towards maintaining gas networks, which will remain a key source of energy as green power capacity is built up further. \"Investing now to maintain world-class resilience and expand grid capacity is the most cost-effective way to harness clean power, support economic growth and protect the country from gas price shocks like the one seen in 2022\", Ofgem said. \n                  Bank of America boss Brian Moynihan warns countries to 'be careful' when raising tax\n                 \n                  Major airport increasing drop-off charge | Money blog\n                 \n                  Direct trains from UK to Germany 'one step closer', but nothing yet on journeys to Berlin\n                  Then, Russia's invasion of Ukraine and Europe's refusal to buy Russian gas in response, meant that energy bills hit unprecedented levels and gave birth to the wider cost-of-living crisis as higher energy costs were passed on across the economy. Read more: Paying up front for energy future should lead to tangible savings Ofgem made its announcement as costs of government energy policy and other upgrades make the biggest upwards contributions to household bills. However, the budget moved to take away some costs from April next year. Ofgem boss Jonathan Brearley said: \"The funding announced today will keep Britain's energy network among the safest, most secure and resilient in the world. The investment will support the transition to new forms of energy and support new industrial customers to help drive economic growth and insulate us from volatile gas prices. \"But this is not investment at any price. Every pound must deliver value for consumers. Ofgem will hold network companies accountable for delivering on time and on budget, and we make no apologies for the efficiency challenge we're setting as the industry scales up investment. \"We've built strong consumer protections into these contracts, meaning funds will only be released when needed and clawed back if not used. Households and businesses must get value for money, and we will ensure they do.\"  A Department for Energy Security and Net Zero spokesperson said: \"This government is taking action to bring down energy bills for families, with the budget taking an average £150 of costs off bills in April, and expanding our £150 Warm Home Discount to over six million families. \"Upgrading our gas and electricity networks after years of underinvestment is essential to keep the lights on and ensure energy security for our country. Without these plans, which were first set out under the previous government, costs would spiral and our security would be compromised. \"The only way to bring down bills for good and get off the fossil fuel rollercoaster is with this government's mission to deliver clean homegrown that we control.\" "
    },
    {
        "title": "Construction activity shrank 'at fastest pace since COVID' ahead of budget",
        "description": "The UK's construction sector suffered its sharpest contraction in activity since May 2020, according to a closely-watched survey taken before this month's  budget.",
        "url": "https://news.sky.com/story/construction-activity-shrank-at-fastest-pace-since-covid-ahead-of-budget-13479235",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-istock-file-stock-generic_6950998.jpg?20250626100616",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-04 09:55:00",
        "Headline": "A report highlights widespread pressure including over employment as criticism of the budget build-up continues to haunt the chancellor.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's construction sector suffered its sharpest contraction in activity since May 2020, according to a closely-watched survey taken before this month's  budget. S&P Global's monthly purchasing managers' index (PMI) covering November makes grim reading for the government. The survey of business behaviour showed steep falls in all three sub-sectors: civil engineering, residential, and commercial building. Money latest: Is property still a good investment? Of particular interest to ministers will be signs of progress on its key housebuilding target of 1.5 million new homes across England by the end of the parliament. But residential construction activity was found to be at its weakest since the first lockdown during the COVID pandemic. The report also noted \"steep reductions in new orders and employment\". \n                  Budget 2025: Over a third of Britons think Rachel Reeves exaggerated bad news\n                 \n                  Is Starmer continuing to mislead public over the budget?\n                 \n                  Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances\n                 Other recent business surveys have also shown similar concerns about investment, hiring and demand in the lead-up to Rachel Reeves's budget on 26 November.  S&P Global's measure of activity across services, manufacturing and construction suggested all but zero growth. The report will add fuel to claims that the government's messaging around the public finances since taking office has damaged the economy. While she has blamed factors such as Brexit and the US trade war for the country's slowdown during the second half of the year, inflation and the jobless rate crept up heading into autumn and business groups and economists have laid blame at the door to Number 11. It is argued that employers have passed on, since April, rising costs from her first budget, which taxed employment, hurting the jobs market and raising the pace of price growth in the process. The UK's unemployment rate stood at 4.1% when Labour took office. It is currently at 5%.  Former Bank of England chief economist Andy Haldane told Sky News ahead of this month's budget that \"repeated mistakes\" had been \"sucking all life\" from business and consumer confidence. While the government's critics have piled in over claims the country was misled over the size of the task facing Ms Reeves ahead of last week's big speech to MPs, an increasing number of industry figures are voicing their disapproval too. Frasers Group, the retailer formerly known as Sports Direct, said on Thursday that the lead-up to the budget had been \"incredibly annoying\" as shoppers' willingness to spend was \"very subdued\". Just hours later, the motor industry's new car sale figures for November blamed the budget build-up for brakes being applied to demand. Read more:The chess row facing ReevesDid Reeves exaggerate budget bad news? The Society for Motor Manufacturers and Traders said the speculation around tax rises to come had proved a \"drag\", with sales slipping by almost 2%. The respected EY ITEM Club said a budget link to the plunge in construction output should be treated with a healthy degree of scepticism. Its chief economic advisor, Matt Swannell, said: \"Throughout most of the year, the PMI has been much more pessimistic than official estimates of construction sector activity, and in November, this negativity looks to have been magnified by expectations of tax rises at the autumn budget. \"Even before November’s significant fall, a flagging construction PMI has consistently remained in contractionary territory across 2025. But between January and September, the Office for National Statistics (ONS) estimated that construction sector output grew in six of the nine months, leaving activity more than 1% higher than at the end of last year. With the tax rises announced at the budget towards the lower end of expectations, a significant rebound in the PMI next month seems likely.\" "
    },
    {
        "title": "Hundreds of UK moderators have left TikTok - sparking safety fears, whistleblowers reveal ",
        "description": "Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\".",
        "url": "https://news.sky.com/story/hundreds-of-uk-moderators-have-left-tiktok-sparking-safety-fears-whistleblowers-reveal-13478302",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tiktok-whistleblower_7098509.png?20251202150116",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-04 03:01:00",
        "Headline": "Sky News has seen correspondence from TikTok to the employees telling them to sign termination contacts by 31 October. Hundreds did.",
        "Content": "\n          Science and technology reporter\n        Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\". More than 400 online safety workers have agreed to leave the social media company, with only five left in consultation, Sky News understands. \"[The workers have] signed a mutual termination agreement, a legally binding contract,\" said John Chadfield, national officer for the Communication Workers' Union. \"They've handed laptops in, they've handed passes in, they've been told not to come to the office. That's no longer a proposal, that's a foregone conclusion. That's a plan that's been executed.\" Safety workers and unions have told Sky News the decision could impact online safety. But TikTok said it was using \"the most advanced technology\" to make sure the platform \"is as safe as possible\". In August, TikTok announced a round of mass layoffs to its Trust and Safety teams. \n                  Rats and fleas get blamed for the Black Death - but here's how it could have spread so fast\n                 \n                  Industrial action on agenda as actors balloted by Equity over AI scanning concerns\n                 \n                  Spotify Wrapped: How does it work - and who are this year's top artists? \n                 \"Everyone in Trust and Safety\" was emailed, said Lucy, a moderator speaking on condition of anonymity for legal reasons. After a mandatory 45-day consultation period, the teams were then sent \"mutual termination agreements\" to sign by 31 October. Sky News has seen correspondence from TikTok to the employees telling them to sign by that date. \"We had to sign it before the 31st if we wanted the better deal,\" said Lucy, who had worked for TikTok for years. \"If we signed it afterwards, that diminished the benefits that we get.\" Despite hundreds of moderators signing the termination contracts by 31 October, Ali Law, TikTok's director of public policy and government affairs for northern Europe, said to MPs in a letter on 7 November: \"It is important to stress the cuts remain proposals only.\" \"We continue to engage directly with potentially affected team members,\" he said in a letter to Dame Chi Onwurah, chair of the science, innovation and technology committee. After signing the termination contracts, the employees say they were asked to hand in their laptops and had access to their work systems revoked. They were put on gardening leave until 30 December. \"We really felt like we were doing something good,\" said Saskia, a moderator also speaking under anonymity. \"You felt like you had a purpose, and now, you're the first one to get let go.\" A TikTok worker not affected by the job cuts confirmed to Sky News that all of the affected Trust and Safety employees \"are now logged out of the system\". \"Workers and the wider public are rightly concerned about these job cuts that impact safety online,\" said the TUC's general secretary, Paul Nowak. \"But TikTok seem to be obscuring the reality of job cuts to MPs. TikTok needs to come clean and clarify how many vital content moderators' roles have gone. \"The select committee must do everything to get to the bottom of the social media giant's claims, the wider issues of AI moderation, and ensure that other workers in the UK don't lose their jobs to untested, unsafe and unregulated AI systems.\" What TikTok has said about the job cuts In an interview with Sky News on 18 November, Mr Law again called the cuts \"proposals\". When asked if the cuts were in fact a plan that had already been executed, Mr Law said there was \"limited amounts\" he could directly comment on. TikTok told us: \"It is entirely right that we follow UK employment law, including when consultations remained ongoing for some employees and roles were still under proposal for removal. \"We have been open and transparent about the changes that were proposed, including in detailed public letters to the committee, and it is disingenuous to suggest otherwise.\" The three whistleblowers Sky News spoke to said they were concerned TikTok users would be put at risk by the cuts. The company said it will increase the role of AI in its moderation, while maintaining some human safety workers, but one whistleblower said she didn't think the AI was \"ready\". \"People are getting new ideas and new trends are coming. AI cannot get this,\" said Anna, a former moderator. \"Even now, with the things that it's supposed to be ready to do, I don't think it's ready.\"  Lucy also said she thought the cuts would put users at risk. \"There are a lot of nuances in the language. AI cannot understand all the nuances,\" she said. \"AI cannot differentiate some ironic comment or versus a real threat or bullying or of a lot of things that have to do with user safety, mainly of children and teenagers.\" TikTok has been asked by MPs for evidence that its safety rates - which are currently some of the best in the industry - will not worsen after these cuts. The select committee says it has not produced that evidence, although TikTok insists safety will improve. \"[In its letter to MPs] TikTok refers to evidence showing that their proposed staffing cuts and changes will improve content moderation and fact-checking - but at no point do they present any credible data on this to us,\" said Dame Chi earlier this month. \"It's alarming that they aren't offering us transparency over this information. Without it, how can we have any confidence whether these changes will safeguard users?\" TikTok's use of AI in moderation In an exclusive interview with Sky News earlier this month, Mr Law said the new moderation model would mean TikTok can \"approach moderation with a higher level of speed and consistency\". He said: \"Because, when you're doing this from a human moderation perspective, there are trade-offs. \"If you want something to be as accurate as possible, you need to give the human moderator as much time as possible to make the right decision, and so you're trading off speed and accuracy in a way that might prove harmful to people in terms of being able to see that content. \"You don't have that with the deployment of AI.\" As well as increasing the role of AI in moderation, TikTok is reportedly offshoring jobs to agencies in other countries. Sky News has spoken to multiple workers who confirmed they'd seen their jobs being advertised in other countries through third-party agencies, and has independently seen moderator job adverts in places like Lisbon. \"AI is a fantastic fig leaf. It's a fig leaf for greed,\" said Mr Chadfield. \"In TikTok's case, there's a fundamental wish to not be an employer of a significant amount of staff. \"As the platform has grown, as it has grown to hundreds of millions of users, they have realised that the overhead to maintain a professional trust and safety division means hundreds of thousands of staff employed by TikTok. \"But they don't want that. They see themselves as, you know, 'We want specialists in the roles employed directly by TikTok and we'll offshore and outsource the rest'.\" Mr Law told Sky News that TikTok is always focused \"on outcomes\". He said: \"Our focus is on making sure the platform is as safe as possible. \"And we will make deployments of the most advanced technology in order to achieve that, working with the many thousands of trust and safety professionals that we will have at TikTok around the world on an ongoing basis.\" Asked specifically about the safety concerns raised by the whistleblowers, TikTok said: \"As we have laid out in detail, this reorganisation of our global operating model for Trust and Safety will ensure we maximise effectiveness and speed in our moderation processes. \"We will continue to use a combination of technology and human teams to keep our users safe, and today over 85% of the content removed for violating our rules is identified and taken down by automated technologies.\" *All moderator names have been changed for legal reasons."
    },
    {
        "title": "Dragons Den record-breaker yuv styles £9m funding round",
        "description": "A beauty technology company which recently secured a record-breaking investment from Dragons' Den judges including the entrepreneur Steven Bartlett will this week unveil a further multimillion pound funding injection.",
        "url": "https://news.sky.com/story/dragons-den-record-breaker-yuv-styles-1639m-funding-round-13479229",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-yuv-kleinman_7100668.jpg?20251204095430",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-04 09:51:00",
        "Headline": "A start-up which won backing from the entrepreneur Steven Bartlett will on Friday announce the completion of a Series A fundraising led by Sweden's Nineyards Equity. Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A beauty technology company which recently secured a record-breaking investment from Dragons' Den judges including the entrepreneur Steven Bartlett will this week unveil a further multimillion pound funding injection. Sky News has learnt that London-based yuv, which claims to have pioneered the world's first smart hair colour lab system for salons and freelance stylists, will announce on Friday a $12m (£8.9m) Series A funding round. The capital-raise has been led by Nineyards Equity, a Swedish-headquartered growth equity firm. Yuv, which was founded by Francisco Gimenez, who has also participated in the raise alongside other existing investors, created a dispensing platform for professional hair colourings, which it calls the yuv Lab. Money latest: Is property still a good investment? Connected to an app, the system replaces single-use tubes with refillable aluminium cartridges in order to reduce waste while offering precise colour formulations. The technology impressed both Mr Bartlett and fellow 'Dragon' Sara Davies, with each investing £250,000 at a £25m valuation - a record for a start-up pitching on the BBC show. \n                  Bank of America boss Brian Moynihan warns countries to 'be careful' when raising tax\n                 \n                  Major airport increasing drop-off charge | Money blog\n                 \n                  Direct trains from UK to Germany 'one step closer', but nothing yet on journeys to Berlin\n                 Yuv's Series A round is designed to accelerate its growth in the UK and pave the way for expansion in the US next year. \"With the support of Nineyards Equity, VNV Global, and our investor network, we are doubling down on our mission to transform professional hair colour through sustainability, design, and technology,\" Mr Gimenez said. \"Our next chapter will bring yuv's platform to more salons and freelancers across the UK, and soon to the US, where we see massive potential.\" Estimates suggest that the global salon hair care services market will grow in value from $204bn this year to nearly $342bn by 2032. \"Yuv is bringing true digital transformation to professional hair colour by combining hardware, colour and software into a platform that solves real pain points for salons and freelancing hairdressers alike,\" Eric Sävendahl, principal at Nineyards Equity, said."
    },
    {
        "title": "Nigel Farage launches tirade at BBC over allegations he was racist at school",
        "description": "Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.&#160;",
        "url": "https://news.sky.com/story/nigel-farage-launches-tirade-at-bbc-over-allegations-he-was-racist-at-school-13479504",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-04 21:43:00",
        "Headline": "The Reform UK leader accuses broadcaster of \"double standards\", claiming it was \"very happy to use blackface\" in the 1970s. ",
        "Content": " Nigel Farage has launched a tirade against the BBC after he was asked about claims he used racist and antisemitic language when he was at school, which he denied.  The Reform UK leader accused the broadcaster of \"double standards\", pointing to its past television shows when he claimed the BBC \"were very happy to use blackface\". The outburst comes as he faces continued pressure over allegations he made racist and antisemitic comments while a pupil at top private school Dulwich College nearly 50 years ago. Mr Farage was asked by the BBC about an interview his deputy, Richard Tice, gave on Thursday, in which he claimed those accusing his boss of racism were engaging in \"made-up twaddle\". The Reform leader said the framing of the question by the BBC interviewer had been \"despicable\". \"I think to frame a question around the leader of Reform's 'relationship with Hitler', which is how she framed it, was despicable, disgusting beyond belief,\" he said. \"The double standards and hypocrisy of the BBC are absolutely astonishing. \n                  Starmer wants to lift half a million children out of poverty - but does his plan go far enough?\n                 \n                  Reeves between a rook and a hard place after claims she 'made up' chess championship\n                 \n                  How record-breaking Reform UK donor Christopher Harborne made his millions\n                 \"At the time I was alleged to have made these remarks, one of your most popular weekly shows was 'The Black and White Minstrels'. The BBC were very happy to use blackface.\" He added: \"I cannot put up with the double standards at the BBC about what I'm alleged to have said 49 years ago, and what you were putting out on mainstream content. \"So I want an apology from the BBC for virtually everything you did during the 1970s and 80s.\" Turning to the substance of the allegations, Mr Farage read out a letter that he said was from someone who he went to school with. He quotes the unnamed Jewish pupil as saying: \"While there was plenty of macho, tongue-in-cheek schoolboy banter, it was humour. And yes, sometimes it was offensive [...] but never with malice. \"I never heard him racially abuse anyone. If he had, he would have been reported and punished. He wasn't.\" Mr Farage went on to quote the unnamed former school mate as saying claims from former pupils reported by the Guardian and BBC were \"without evidence, except for belatedly politically-dubious recollections from nearly half a century ago\". He said the former pupil who had written to him had described the culture in the 1970s and at Dulwich College as \"very different\", and \"lots of boys said things they'd regret today\". Read More:How record-breaking Reform UK donor Christopher Harborne made his millionsReform UK gets record £9m donation from ex-Tory donor Mr Farage has been under pressure since mid-November when reports from former classmates of alleged racist comments surfaced. The Guardian claims it has spoken to 20 former classmates who recall such language. Challenged in an interview on 24 November if the claims were true, Mr Farage said: \"No, this is 49 years ago by the way, 49 years ago. Have I ever tried to take it out on any individual on the basis of where they're from? No.\" He added: \"I would never, ever do it in a hurtful or insulting way. It's 49 years ago. It's 49 years ago. I had just entered my teens. Can I remember everything that happened at school? No, I can't. Have I ever been part of an extremist organisation or engaged in direct, unpleasant, personal abuse, genuine abuse, on that basis? No.\" Challenged again about whether he had racially abused anyone, Farage responded: \"No, not with intent.\" A Conservative spokesman said Mr Farage was too busy defending himself to \"defend democracy\" from election postponements announced by Labour. \"Nigel Farage just called a press conference and used it to rant at journalists over historic allegations of racism and antisemitism - allegations he has just admitted are true. \"Farage is too busy furiously defending himself to defend democracy from the Labour Party's elections delays. \"Reform's one-man band is in chaos once again.\" Labour Party chair Anna Turley said: \"Nigel Farage can't get his story straight. It really shouldn't be this difficult to say whether he racially abused people in the past. \"So far, he's claimed he can't remember, that it's not true, that he never 'directly' abused anyone, that he was responsible for 'offensive banter', and deflected by saying other people were racist too. \"Instead of shamelessly demanding apologies from others, Nigel Farage should be apologising to the victims of his alleged appalling remarks.\" She added that Reform UK was \"simply not fit for high office\"."
    },
    {
        "title": "How record-breaking Reform UK donor Christopher Harborne made his millions",
        "description": "Who is the man behind the record-breaking multi-million pound donation to Reform UK?",
        "url": "https://news.sky.com/story/how-record-breaking-reform-uk-donor-christopher-harborne-made-his-millions-13479318",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-uk-rosette_7068411.jpg?20251101080911",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-04 12:50:00",
        "Headline": "The businessman was born in the UK but has lived in Thailand for 20 years, where he is known as Chakrit Sakunkrit. He has a long history of donations to British parties.",
        "Content": "Who is the man behind the record-breaking multi-million pound donation to Reform UK? Christopher Harborne gave Nigel Farage's party £9m in August, according to new data published by the Electoral Commission. The contribution ranks as the largest ever single donation from a living person in UK political history. Born in Britain, Mr Harborne is a businessman who owns several companies, employing more than 600 people worldwide, according to a court filing dated last year. Yet he's not resident in the UK, and is also a citizen of Thailand, where he is known as Chakrit Sakunkrit, and has lived and worked there for 20 years. Follow live: Politics latest Nonetheless, he has a long history of political donations to British parties. Electoral Commission data shows he has previously donated to the Conservatives, gifting them £10,000 in May 2001, and continuing to support them with close to £2m in donations by October 2022. \n                  Starmer wants to lift half a million children out of poverty - but does his plan go far enough?\n                 \n                  Nigel Farage launches tirade at BBC over allegations he was racist at school\n                 \n                  Salisbury novichok poisonings: Putin 'morally responsible' for woman's death after authorising botched spy assassination bid\n                 But there was been some overlap with his backing of Reform, which first received a donation from him in April 2019, for £200,000. He's also donated to Mr Farage personally, giving £27,616.76 in January so the Reform leader could attend the second inauguration of Donald Trump. He paid another £32,836 for the Reform and a member of staff to fly to the US following the attempted assassination of Trump in July last year. And he gave one of the biggest donations ever made to an individual UK politician when he backed Boris Johnson to the tune of £1m in 2022. He served as an advisor to Mr Johnson during the former PM's trip to Kyiv in 2023. His latest cash injection to Reform UK breaks the previous record for a donation from a living person, which was £8m from supermarket tycoon Lord David Sainsbury to the Liberal Democrats in 2019. The largest ever single donation to a UK political party was from his cousin, Lord John Sainsbury, who left more than £10.2m to the Conservatives in 2022 in his will. Read more:Labour accused of 'scandalous attempt to subvert democracy'Tory-Reform pact talks 'not happening at any level' Electoral Commission records show Mr Harborne has made at least £24.5m in UK political donations since 2001. But where is his money from? Several of his businesses come under the banner of AML Global, including one registered in the UK, which has a London address listed with Companies House. AML Global is described in a court filing as an international jet fuel broker that works with oil companies, and which has been awarded $39m (£29m) worth of contracts by the US Department of Defense. Harborne was also an early investor in Bitcoin and other cryptocurrencies. On his LinkedIn page, the businessman further describes himself as chair of Sherriff Global Group. His profile shows he was educated at INSEAD business school, Cambridge University, and Westminster School. Figures from the Electoral Commission released this week show Reform UK reported the most donations of any party in the third quarter of 2025, a total of £10,526,846. By contrast, the Conservatives reported £7,038,861 in the same period, Labour £2,564,786, and the Liberal Democrats £2,174,712."
    },
    {
        "title": "Reform UK gets record £9m donation from ex-Tory donor",
        "description": "Nigel Farage's Reform UK have received its largest ever donation, with former Conservative donor Christopher Harborne handing the party &#163;9m.",
        "url": "https://news.sky.com/story/reform-uk-gets-record-1639m-donation-from-ex-tory-donor-13479206",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farage-smile-reform_7100619.jpg?20251204090405",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-12-04 08:46:00",
        "Headline": "The £9m handed to Reform UK is the political donation on record from a living person, after Lord Sainsbury left £10m to the Conservative in his will in 2023.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Nigel Farage's Reform UK have received its largest ever donation, with former Conservative donor Christopher Harborne handing the party £9m. The donation - one of the largest in British political history - was made in August this year, according to filings from the Electoral Commission. Mr Harborne, a British businessman based in Thailand, previously donated millions to Reform in 2019, when it was known as the Brexit Party, and has continued to give the party and Mr Farage cash. Politics latest: Reform gets its largest ever donation Between 2001 and 2022, he donated close to £2m to the Conservatives, according to Companies House. The £9m handed to Reform UK on 1 August this year is the largest political donation on record from a living person, after Lord Sainsbury left £10m to the Conservatives in his will in 2023. Educated in the UK, Mr Harbone is now based in Thailand, where he chairs the investment company Sherriff Global Group. \n                  Labour accused of 'scandalous attempt to subvert democracy'\n                 \n                  Tory-Reform pact talks 'not happening at any level', says Richard Tice\n                 \n                  From 'Xmas gifts' to piles of cash: How ex-Reform MEP was caught doing Russia's bidding\n                 He also paid around £28,000 for Mr Farage to travel to the US for Donald Trump's inauguration this year, and roughly £33,000 for the Reform leader to visit the president after the failed assassination attempt in the run-up to the election. Responding to a question at a news conference from Sky News deputy political editor Sam Coates, Mr Farage said Mr Harborne has business interests all around the world, but his \"natural home\" was the UK. He says the donation is \"nothing out of the blue\", pointing to Mr Harbone donating significant sums to the Brexit Party. \"I think what he wants to do, really, is to try and help us get onto a level playing field with the trade union funded Labour Party, and a Conservative Party where there seems to be a remarkable correlation, I can't think why, between donations and membership of the House of Lords,\" Mr Farage said. He added that \"hand on heart\" he has not promised anything to Mr Harborne in exchange for the money, adding that speaks to the Bangkok-based businessman \"maybe once a month, maybe once every six weeks\". Professor Justin Fisher of Brunel University, an expert in political donations, told Sky News: \"It exposes the fact that this is a person who is a British citizen but is able to influence British politics without being subject to the laws that any Reform government might bring in, any tax arrangements that a Reform might bring in. “This is foreign money by any other name.” The professor pointed to the fact that in the 2022 Election Act under the Conservatives, the law was changed so that British citizens could live abroad their whole lives and stay on the electoral roll, allowing them to donate. Previously, the cap had been set at 15 years of living overseas. He added that it was not surprising to see a person with an interest in a particular policy area - like cryptocurrencies - give money to a political advocating for this cause. Read more:Tice denies Tory-Reform pact talksNew rules may stop unlimited donations to Reform UK  According to the Electoral Commission, political parties raised £24m in the third quarter of this year - up from £10m over the same time period last year, and £11m last quarter. With the local and national assembly elections coming up in May next year, parties are building their war chests for the campaign. Reform reported taking a total of £10,526,846, more than the Tories (£7,038,861), Labour (£2,564,786), and the Lib Dems (£2,174,712). This means Mr Farage's party raised almost as much as the three main parties combined (£11,778,359). While the Green Party has reported an increase in donations since Zack Polanski became leader, these figures mostly cover the time before he took office, with the party only accepting £371,753. Professor Jonathan Hopkin of the London School of Economics told Sky News the donation \"shows the power of money in politics if one individual can make such a big difference to the resources available to a political party\". He added that big donors giving to Reform who also have links to the Tories could separately \"pressurise the Conservatives to step aside their candidates in seats that Reform are better placed to win\". The fact that Reform has received large volumes of cash from a former Tory donor will do nothing to extinguish reports that the two parties are considering an electoral pact in time for the next general election. The Financial Times reported that such an agreement was spoken about by Mr Farage in a discussion with party donors. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Both the Conservatives and Reform have denied they will do a deal. Reform currently lead voting intention polls, with the Conservatives and Labour together in joint second place, followed by the Greens. A spokesperson for the Reform Party said: \"This quarter's figures show the incredible progress Reform UK is making. This is further evidence that we have all the momentum in British politics.\""
    },
    {
        "title": "Brother-in-law of Scotland's former leader, Humza Yousaf, facing extortion and drug charges",
        "description": "The brother-in-law of Scotland's former first minister Humza Yousaf has gone on trial accused of extortion and dealing class A drugs.",
        "url": "https://news.sky.com/story/brother-in-law-of-scotlands-former-leader-humza-yousaf-facing-extortion-and-drug-charges-13479425",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edinburgh-high-court_6983341.jpg?20251204171625",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-04 17:09:00",
        "Headline": "Ramsay El-Nakla, the brother of the wife of the former first minister, is on trial in Edinburgh accused of dealing heroine and cocaine. The High Court case follows the death of a man who fell from a window in Dundee.",
        "Content": "The brother-in-law of Scotland's former first minister Humza Yousaf has gone on trial accused of extortion and dealing class A drugs. The case follows the death of a man who fell from a window in Dundee after allegedly being threatened. Ramsay El-Nakla, 37, is on trial at the High Court in Edinburgh and is the brother of Mr Yousaf's wife, Dundee councillor Nadia El-Nakla. El-Nakla does not face a charge in relation to the death of Ryan Munro who fell from a flat on Dundee's Morgan Street on 10 January 2024. But he is is accused of dealing cocaine from the flat between 9 and 11 January 2024, as well as at another home in the city, which he denies. And El-Nakla and his co-accused Stephen Stewart, 52, Jennifer Souter, 39, and Victoria McGowan, 43, are all alleged to have put Mr Munro \"in a state of alarm and apprehension of physical harm\" and \"did extort a sum of money from him by threats\", at the flat, the court heard. Stewart, Souter and McGowan additionally face a charge specifically in relation to Mr Munro's death. \n                  Scotland's former first minister Humza Yousaf hits out at Starmer's 'dog whistle' stance on immigration\n                 \n                  Former first minister Humza Yousaf to step down as MSP in 2026\n                 \n                  Humza Yousaf questions family's future in UK after violent riots\n                 Court papers allege they \"did threaten and intimidate him, thereby placing him in an extreme state of fear and alarm for his safety, and cause said Ryan Munro to escape said flat from a window at height, causing him to fall from said window and strike the ground, whereby he was so severely injured that he died there and you did kill him\". Mr Munro fell from the window in Dundee after allegedly being abducted by Stewart, Souter and McGowan; a charge they deny. Stewart, McGowan and El-Nakla all deny dealing heroin from a flat in Dundee between 1 July 2023 and 11 January 2024. Read more from Sky News:Four arrested in right-wing terror investigationArrests after 'industrial scale' drugs laboratories found Souter, McGowan and Stewart, of Dundee, deny dealing cocaine from the same flat between 1 July 2023 and 11 January 2024. McGowan, of Aberdeen, who was said to be on bail at the time, is also accused of dealing class C drug Bromazolam between 1 July 2023 and 11 January 2024 at both Dundee addresses. She is further accused of possession of cannabis, and class C drugs Zopiclone and Pregabalin on 11 January 2024. All four deny the accusations against them. The trial, before Judge Lady Drummond, continues."
    },
    {
        "title": "Soaring demand for mental health, ADHD and autism services to be reviewed after 'overdiagnosis' claim",
        "description": "A review into the rising demand for mental health, ADHD and autism services has been launched by the health secretary.",
        "url": "https://news.sky.com/story/soaring-demand-for-mental-health-adhd-and-autism-services-to-be-reviewed-after-overdiagnosis-claim-13479259",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/0872ed43380803cf663bf528f5328463fa262e7661e294a543fdeddc382ae321_7099311.jpg?20251203132908",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-04 10:52:00",
        "Headline": "Mental health or behavioural conditions account for more than half the post-pandemic rise in working age people claiming disability benefits.",
        "Content": "A review into the rising demand for mental health, ADHD and autism services has been launched by the health secretary. The independent review will look at rates of diagnosis, and the support offered to people. Health Secretary Wes Streeting said the issue needs to be looked at through a \"strictly clinical lens\" after he claimed in March that there had been an \"overdiagnosis\" of mental health conditions, with \"too many people being written off\". Politics latest: Reform receives largest ever UK donation from living person Mental health conditions are being more commonly reported among the working-age population, figures analysed by the Institute for Fiscal Studies found. More than half of the increase in 16 to 64-year-olds claiming disability benefits since the pandemic is due to more claims relating to mental health or behavioural conditions. A total of 1.3 million people claim disability benefits - 44% of all claimants - primarily for mental health or behavioural conditions, the analysis shows. \n                  OpenAI denies allegations ChatGPT is responsible for teenager's death\n                 \n                  NHS ward manager sentenced and trust fined more than £500,000 over death of patient\n                 \n                  Mental health affecting education attendance 'for half of young people', says report\n                 The review will be led by leading clinical psychologist Professor Peter Fonagy, the national clinical adviser on children and young people's mental health, who will work with academics, doctors, epidemiological experts, charities and parents. He will look at what is driving the rising demand for services, and inequalities in accessing support.  The Department of Health said 13 times more people were waiting for an autism assessment in September 2025 compared with April 2019. There is £688m in extra funding going towards hiring 8,500 more mental health workers so the NHS can expand on talking therapies and increase the number of mental health emergency departments. Mr Streeting said: \"I know from personal experience how devastating it can be for people who face poor mental health, have ADHD or autism, and can't get a diagnosis or the right support. \"I also know, from speaking to clinicians, how the diagnosis of these conditions is sharply rising. \"We must look at this through a strictly clinical lens to get an evidence-based understanding of what we know, what we don't know, and what these patterns tell us about our mental health system, autism and ADHD services. \"That's the only way we can ensure everyone gets timely access to accurate diagnosis and effective support.\" Read more:Tory-Reform pact talks 'not happening', says TiceReeves hit by rural Labour MP rebellion  Prof Fonagy said: \"This review will only be worthwhile if it is built on solid ground. We will examine the evidence with care to understand, in a grounded way, what is driving rising demand. \"My aim is to test assumptions rigorously, and listen closely to those most affected, so that our recommendations are both honest and genuinely useful.\" The findings will be published next summer."
    },
    {
        "title": "Hundreds of UK moderators have left TikTok - sparking safety fears, whistleblowers reveal ",
        "description": "Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\".",
        "url": "https://news.sky.com/story/hundreds-of-uk-moderators-have-left-tiktok-sparking-safety-fears-whistleblowers-reveal-13478302",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tiktok-whistleblower_7098509.png?20251202150116",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-04 03:01:00",
        "Headline": "Sky News has seen correspondence from TikTok to the employees telling them to sign termination contacts by 31 October. Hundreds did.",
        "Content": "\n          Science and technology reporter\n        Hundreds of UK online safety workers at TikTok have already signed agreements to leave the company, whistleblowers have told Sky News, despite the firm stressing to MPs that the cuts were \"still proposals only\". More than 400 online safety workers have agreed to leave the social media company, with only five left in consultation, Sky News understands. \"[The workers have] signed a mutual termination agreement, a legally binding contract,\" said John Chadfield, national officer for the Communication Workers' Union. \"They've handed laptops in, they've handed passes in, they've been told not to come to the office. That's no longer a proposal, that's a foregone conclusion. That's a plan that's been executed.\" Safety workers and unions have told Sky News the decision could impact online safety. But TikTok said it was using \"the most advanced technology\" to make sure the platform \"is as safe as possible\". In August, TikTok announced a round of mass layoffs to its Trust and Safety teams. \n                  Rats and fleas get blamed for the Black Death - but here's how it could have spread so fast\n                 \n                  Industrial action on agenda as actors balloted by Equity over AI scanning concerns\n                 \n                  Spotify Wrapped: How does it work - and who are this year's top artists? \n                 \"Everyone in Trust and Safety\" was emailed, said Lucy, a moderator speaking on condition of anonymity for legal reasons. After a mandatory 45-day consultation period, the teams were then sent \"mutual termination agreements\" to sign by 31 October. Sky News has seen correspondence from TikTok to the employees telling them to sign by that date. \"We had to sign it before the 31st if we wanted the better deal,\" said Lucy, who had worked for TikTok for years. \"If we signed it afterwards, that diminished the benefits that we get.\" Despite hundreds of moderators signing the termination contracts by 31 October, Ali Law, TikTok's director of public policy and government affairs for northern Europe, said to MPs in a letter on 7 November: \"It is important to stress the cuts remain proposals only.\" \"We continue to engage directly with potentially affected team members,\" he said in a letter to Dame Chi Onwurah, chair of the science, innovation and technology committee. After signing the termination contracts, the employees say they were asked to hand in their laptops and had access to their work systems revoked. They were put on gardening leave until 30 December. \"We really felt like we were doing something good,\" said Saskia, a moderator also speaking under anonymity. \"You felt like you had a purpose, and now, you're the first one to get let go.\" A TikTok worker not affected by the job cuts confirmed to Sky News that all of the affected Trust and Safety employees \"are now logged out of the system\". \"Workers and the wider public are rightly concerned about these job cuts that impact safety online,\" said the TUC's general secretary, Paul Nowak. \"But TikTok seem to be obscuring the reality of job cuts to MPs. TikTok needs to come clean and clarify how many vital content moderators' roles have gone. \"The select committee must do everything to get to the bottom of the social media giant's claims, the wider issues of AI moderation, and ensure that other workers in the UK don't lose their jobs to untested, unsafe and unregulated AI systems.\" What TikTok has said about the job cuts In an interview with Sky News on 18 November, Mr Law again called the cuts \"proposals\". When asked if the cuts were in fact a plan that had already been executed, Mr Law said there was \"limited amounts\" he could directly comment on. TikTok told us: \"It is entirely right that we follow UK employment law, including when consultations remained ongoing for some employees and roles were still under proposal for removal. \"We have been open and transparent about the changes that were proposed, including in detailed public letters to the committee, and it is disingenuous to suggest otherwise.\" The three whistleblowers Sky News spoke to said they were concerned TikTok users would be put at risk by the cuts. The company said it will increase the role of AI in its moderation, while maintaining some human safety workers, but one whistleblower said she didn't think the AI was \"ready\". \"People are getting new ideas and new trends are coming. AI cannot get this,\" said Anna, a former moderator. \"Even now, with the things that it's supposed to be ready to do, I don't think it's ready.\"  Lucy also said she thought the cuts would put users at risk. \"There are a lot of nuances in the language. AI cannot understand all the nuances,\" she said. \"AI cannot differentiate some ironic comment or versus a real threat or bullying or of a lot of things that have to do with user safety, mainly of children and teenagers.\" TikTok has been asked by MPs for evidence that its safety rates - which are currently some of the best in the industry - will not worsen after these cuts. The select committee says it has not produced that evidence, although TikTok insists safety will improve. \"[In its letter to MPs] TikTok refers to evidence showing that their proposed staffing cuts and changes will improve content moderation and fact-checking - but at no point do they present any credible data on this to us,\" said Dame Chi earlier this month. \"It's alarming that they aren't offering us transparency over this information. Without it, how can we have any confidence whether these changes will safeguard users?\" TikTok's use of AI in moderation In an exclusive interview with Sky News earlier this month, Mr Law said the new moderation model would mean TikTok can \"approach moderation with a higher level of speed and consistency\". He said: \"Because, when you're doing this from a human moderation perspective, there are trade-offs. \"If you want something to be as accurate as possible, you need to give the human moderator as much time as possible to make the right decision, and so you're trading off speed and accuracy in a way that might prove harmful to people in terms of being able to see that content. \"You don't have that with the deployment of AI.\" As well as increasing the role of AI in moderation, TikTok is reportedly offshoring jobs to agencies in other countries. Sky News has spoken to multiple workers who confirmed they'd seen their jobs being advertised in other countries through third-party agencies, and has independently seen moderator job adverts in places like Lisbon. \"AI is a fantastic fig leaf. It's a fig leaf for greed,\" said Mr Chadfield. \"In TikTok's case, there's a fundamental wish to not be an employer of a significant amount of staff. \"As the platform has grown, as it has grown to hundreds of millions of users, they have realised that the overhead to maintain a professional trust and safety division means hundreds of thousands of staff employed by TikTok. \"But they don't want that. They see themselves as, you know, 'We want specialists in the roles employed directly by TikTok and we'll offshore and outsource the rest'.\" Mr Law told Sky News that TikTok is always focused \"on outcomes\". He said: \"Our focus is on making sure the platform is as safe as possible. \"And we will make deployments of the most advanced technology in order to achieve that, working with the many thousands of trust and safety professionals that we will have at TikTok around the world on an ongoing basis.\" Asked specifically about the safety concerns raised by the whistleblowers, TikTok said: \"As we have laid out in detail, this reorganisation of our global operating model for Trust and Safety will ensure we maximise effectiveness and speed in our moderation processes. \"We will continue to use a combination of technology and human teams to keep our users safe, and today over 85% of the content removed for violating our rules is identified and taken down by automated technologies.\" *All moderator names have been changed for legal reasons."
    },
    {
        "title": "Rats and fleas get blamed for the Black Death - but here's how it could have spread so fast",
        "description": "The rapid spread of the Black Death through medieval Europe could have its origins in a massive volcanic eruption, according to new research.",
        "url": "https://news.sky.com/story/volcanic-eruption-may-have-sparked-europes-black-death-plague-scientists-find-13479387",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-black-death-bubonic-plague_7101031.jpg?20251204155407",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-04 15:47:00",
        "Headline": "The plague killed between a third and half of the European population in the mid-14th Century.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The rapid spread of the Black Death through medieval Europe could have its origins in a massive volcanic eruption, according to new research. The plague killed between a third and half of the European population in the mid-14th century. But it's unknown what triggered the pandemic. Now scientists in Cambridge and Germany have pieced together an extraordinary sequence of events from environmental clues and historical records that they believe solves the mystery. They say sooty particles trapped deep in the ice sheets of Antarctica and Greenland suggest there was at least one eruption by an as-yet-unknown volcano in the tropics, around the year 1345, that shrouded the planet in a thick haze of ash and sulphur. That fits with written evidence from the time, which reports unusually cloudy conditions and dark lunar eclipses, according to the study published in the journal Communications Earth & Environment. New analysis of tree rings from around the time shows there were three years of stunted growth, suggesting the volcanic haze resulted in cool, wet conditions that would have led to a series of crop failures, according to a team in Cambridge. Read more:How Black Death shaped how our bodies tackle diseasesSharp rise in flu patients in hospital beds across England Dr Martin Bauch, one of the study authors and a historian of medieval climate and epidemiology at the Leibniz Institute for the History and Culture of Eastern Europe, told Sky News that the eruption's impact on food supply was the key first stage in the sequence of events building up to the pandemic. \"In the years before the Black Death arrives, there is very unusual weather from England, across the Mediterranean to the Levant,\" he said. \"That large-scale pattern can only have a climatic explanation and the volcano is a good one because the impact would last two or three years. It all fits together.\" The researchers say the subsequent famine explains why the Italian maritime cities of Venice, Genoa and Pisa reached out to the Mongols of the Golden Horde around the Black Sea in 1347 and began to import grain. Previous research has concluded that ships carrying the grain also brought fleas infected with the plague bacterium Yersinia pestis, most probably from wild gerbils somewhere in central Asia. Once in Italy, the fleas jumped onto rats and other mammals - and spread devastation around Europe. \"These powerful Italian city states had established long-distance trade routes across the Mediterranean and the Black Sea, allowing them to activate a highly efficient system to prevent starvation,\" said Dr Bauch. \"But ultimately, these would inadvertently lead to a far bigger catastrophe.\" Professor Ulf Buentgen from Cambridge University's Department of Geography, another of the study authors, said the perfect storm of climate, agricultural, societal and economic factors that led to the Black Death were an early example of the consequences of globalisation. \"Although the coincidence of factors that contributed to the Black Death seem rare, the probability of zoonotic diseases (which jump from animals to humans) emerging under climate change and translating into pandemics is likely to increase in a globalised world,\" he said. \"This is especially relevant given our recent experiences with Covid-19.\""
    },
    {
        "title": "Industrial action on agenda as actors balloted by Equity over AI scanning concerns",
        "description": "Thousands of members of actors' trade union Equity are being asked whether they would support industrial action over artificial intelligence protections.",
        "url": "https://news.sky.com/story/industrial-action-on-agenda-as-actors-balloted-by-equity-over-ai-scanning-concerns-13479308",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ai-artificial-intelligence_7100875.jpg?20251204134147",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-04 12:37:00",
        "Headline": "The actors' union is canvassing 7,000 members working in film and TV over artificial intelligence protections.",
        "Content": "Thousands of members of actors' trade union Equity are being asked whether they would support industrial action over artificial intelligence protections. The organisation has launched an indicative ballot among about 7,000 members working in film and TV. Performers are being asked whether they are prepared to refuse to be digitally scanned on set in order to secure adequate artificial intelligence protections. It will be the first time the performing arts and entertainment trade union has asked this whole section of its membership to vote in a ballot. The announcement follows the Hollywood strikes in 2023, when members of Equity's sister union in the US, SAG-AFTRA, and writers, went on strike over issues including AI. Video game actors in the US also protested over the use of AI, ending almost a year of industrial action earlier in 2025. Equity's ballot opens on Thursday and runs for two weeks, and will show the level of support the union has for action short of a strike. Another statutory ballot would have to be made before any industrial action is taken. \"While tech companies get away with stealing artists' likeness or work, and the government and decision makers fret over whether to act, unions including Equity are at the forefront of the fight to ensure working people are protected from artificial intelligence misuse,\" Equity general secretary Paul W Fleming said in a statement. \"If bosses can't ensure someone's likeness and work won't be used without their consent, why should performers consent to be digitally scanned in the first place?\" Mr Fleming said the ballot would give members the opportunity to \"send a clear message to the industry: that it is a basic right of performers to have autonomy over their own personhood and identity\". The union has no choice but to recommend members support industrial action, he said. \"It's time for the bosses to step away from the brink and offer us a package, including on AI protections, which respects our members,\" added Mr Fleming."
    },
    {
        "title": "Spotify Wrapped: How does it work - and who are this year's top artists? ",
        "description": "The hotly anticipated Spotify Wrapped is revealing our top tracks, artists and albums for 2025.",
        "url": "https://news.sky.com/story/spotify-wrapped-how-does-it-work-and-who-are-this-years-top-artists-13479145",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bad-bunny-taylor-swift_7100479.png?20251204052525",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-04 01:00:00",
        "Headline": "The platform takes a range of users' data to create personalised listening figures and global rankings.",
        "Content": "The hotly anticipated Spotify Wrapped is revealing our top tracks, artists and albums for 2025. But how does the streaming service calculate personalised summaries of users' listening habits and rank the UK's hottest artists? Here's a look at how your data is used. The platform describes the annual statistics as \"a chance to look back on your year in sound\". It says data is captured between January and mid-November on every account, although it mostly excludes anything streamed in private mode. (Don't worry, your passion for the Spice Girls can be kept secret.) Wrapped presents personalised listening statistics, which Spotify calls the \"real story of your year of listening\", alongside global figures for comparison. The streaming service says Minutes Listened reflects the actual time spent listening to audio on the platform. \n                  Spotify hikes UK subscription prices\n                 \n                  Spotify down: Streaming app suffers major outage - as company confirms 'issues'\n                 \n                  Taylor Swift's The Tortured Poets Department streamed more than 300 million times in one day\n                 Once a user streams at least 30 tracks, Spotify generates a list of Your Top Songs. Similarly, Your Top Artists ranks artists based on total minutes listening to a particular performer. Other metrics identify the top genres users have played, as well as podcasts and audiobooks ranked by total minutes listened. And if you've listened to at least 70% of tracks on a record, you'll see top albums too. Spotify also creates Your Listening Age, a guesstimate of your age based on the era of the music \"you feel most connected to\". The streaming service says the statistic is calculated using a five-year span of music which users engaged with more than other listeners of a similar age. Swift vs Bunny Pop superstar Taylor Swift has been named the UK's most-streamed artist on Spotify for the third year in a row. But she dropped out of the top spot in the global rankings, coming second to Puerto Rican superstar Bad Bunny, who secured more than 19.8 billion streams. Third were The Weeknd, followed by Drake and Billie Eilish. Bad Bunny's LP Debi Tirar Mas Fotos was the most listened-to album worldwide. Read more from Sky News:Sabrina Carpenter fury at videoDrake's lawsuit dismissedSpotify hikes UK prices Spotify revealed Drake was the UK's second most-listened to artist, followed by Sabrina Carpenter in third, The Weeknd in fourth and Billie Eilish in fifth. Despite being the most listened-to artist, Swift failed to break into the UK's top five most listened-to songs and albums of the year. Alex Warren's Ordinary was the most-streamed song, and Short 'N' Sweet, released by Carpenter last year, the top album."
    },
    {
        "title": "Porn provider fined £1m by Ofcom as impact of new online safety rules revealed",
        "description": "Ofcom has fined a pornography provider &#163;1m for not having robust age checks.",
        "url": "https://news.sky.com/story/porn-provider-fined-1631m-by-ofcom-as-impact-of-new-online-safety-rules-revealed-13479209",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-online-safety-x_6980437.jpg?20250802033112",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-04 08:57:00",
        "Headline": "The technology secretary Liz Kendall said Ofcom has the government's \"full backing\" to use all of its powers in enforcing the rules.",
        "Content": "\n          Science and technology reporter\n       Ofcom has fined a pornography provider £1m for not having robust age checks. AVS, which runs 18 adult websites, was also fined £50,000 for not responding to information requests from the communications regulator. Since July, websites and apps that host adult content have had to have age verification checks in place to stop young people from seeing their content. Days after those rules came into force, Ofcom began investigating websites that hadn't properly complied, including AVS sites, which have millions of monthly UK users, according to the regulator. AVS has 72 hours to introduce \"highly effective\" age verification or it will be fined £1,000 a day until it does. \"They said that they had age checks in place, but they just weren't good enough,\" said Oliver Griffiths, Ofcom's online safety group director to Sky News' Sophy Ridge and Wilf Frost on Thursday morning. \"They didn't have liveness checks, so you could hold up a photograph of somebody else and that would get you through. But that's obviously just not good enough.\" This is the third company Ofcom has fined since the new rules came into place. The forum 4chan was the first; it was fined £20,000 in October. The fines came as Ofcom released new data about the impact of their new online safety rules. Almost half - 47% - of children aged eight to 17 encountered an age check online when trying to access age-restricted content after the July deadline compared to 30% before, according to the new report. Read more tech news:UK moderators lave TikTok, whistleblowers revealAustralia's under 16s social media ban: How will it work?Spotify Wrapped: Who are this year's top artists? More than half - 58% - of parents believe the measures are already improving the safety of UK children online, while 36% noticed a potential impact on their child's online activity, according to the regulator's statistics. The new rules proved controversial, however. Some say the age verification checks are too easy to bypass, while others argue they are a security risk, as users usually have to upload a picture of their face to a third-party website. The technology secretary Liz Kendall said Ofcom has the government's \"full backing\" to use all of its powers in enforcing the rules. \"Since the enforcement of the Online Safety Act, platforms have finally started taking responsibility for protecting children and removing illegal and hateful content,\" she said."
    },
    {
        "title": "Farmers lose more than £800m after hottest spring and summer on record, study finds",
        "description": "British arable farmers are facing a revenue loss of more than &#163;800m after one of the worst-ever harvests on record, analysis shows.&#160;",
        "url": "https://news.sky.com/story/farmers-lose-more-than-163800m-after-hottest-spring-and-summer-on-record-study-finds-13479198",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rape-farmers_7100587.jpg?20251204082659",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-04 08:23:00",
        "Headline": "Crop production this year was hit by the hottest spring and summer on record, including some drought conditions, leaving farmers with 20% less revenue, according to an estimate by the Energy and Climate Intelligence Unit (ECIU) thinktank.",
        "Content": "British arable farmers are facing a revenue loss of more than £800m after one of the worst-ever harvests on record, analysis shows.  Crop production this year was hit by the hottest spring and summer on record as well as drought conditions, leaving farmers with 20% less revenue, according to an estimate by the Energy and Climate Intelligence Unit (ECIU) thinktank. The estimated loss of £828m is based on researchers looking at \"per-hectare yield\" figures for wheat, spring and winter barley, oats and oilseed rape and crop area estimates for the UK. They compared current farm gate prices to government figures for the 10-year average for production volumes for the five staple crops from 2015-2024, finding a sharp drop in revenue. Farmers saw a 38.4% decline in revenue from oilseed rape, a 21.5% decline in milling oat revenues, 19.6% decline in milling wheat revenues and 16.1% in feed wheat, according to the ECIU. The provisional environment department (Defra) figures in October found 2025 to be the second-worst year on record for England, with the harvest across the UK expected to be similarly poor. This year's anticipated poor harvest comes following another one of the worst harvests on record in 2024, which came after the preceding autumn and winter saw extreme rainfall. \n                  Rachel Reeves hit by Labour rural rebellion over inheritance tax on farmers\n                 \n                  Starmer cuts short Buckinghamshire visit after farmers stage noisy tractor protest\n                 \n                  UK's 'most expensive coffee' goes on sale to fund farm's future\n                 Tom Lancaster, ECIU land, food and farming analyst, said: \"This has been another torrid year for many farmers in the UK, with the pendulum swinging from too wet to too hot and dry. \"With confidence in the sector at rock bottom, there is an urgent need to ensure farmers are better supported to adapt to these climate shocks and build their resilience as the bedrock of our food security.\"  He said delays to the relaunch of green farming payment schemes, like the sustainable farming incentive, \"are the last thing the industry needs\". David Lord, an arable farmer from Essex and member of the Nature Friendly Farming Network steering group, said that with near-constant extreme rainfall, heat and drought in recent years, green farming schemes \"are a vital lifeline for me\". \"But with the schemes closed and no clarity on their future, too many farmers are locked out, unable to access the support they need to adapt whilst facing a wider agriculture policy that does too little to build our resilience and too often works against it,\" he added. Read more from Sky News:Earthquake 'shakes homes' in North West EnglandEnergy grid £28bn upgrade to add £108 to bills A Defra spokesperson acknowledged that there are \"challenges\" in the sector and weather extremes that have affected harvests. They added: \"We are backing our farmers in the face of a changing climate with the largest nature-friendly farming budget in history to grow their businesses and get more British food on our plates,\" they said."
    },
    {
        "title": "Israel allowed to take part in Eurovision 2026 - as several countries withdraw",
        "description": "Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event.",
        "url": "https://news.sky.com/story/israel-allowed-to-take-part-in-eurovision-2026-as-at-least-two-countries-withdraw-13479330",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-israel-eurovision-song-contest_7100933.jpg?20251204135255",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-04 17:45:00",
        "Headline": "Spain, Ireland, Slovenia and the Netherlands have all pulled out of next year's Eurovision contest - with some broadcasters yet to make statements.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Israel will be allowed to compete in next year's Eurovision Song Contest, organisers have said - with several broadcasters saying they will now boycott the event. Dutch broadcaster AVROTROS, Spain's RTVE, Ireland's RTE and Slovenia's RTV immediately issued statements saying they will not participate in the 2026 contest following the European Broadcasting Union's general assembly meeting on Thursday. Members from 37 countries were asked to vote in a secret ballot on whether they were happy with tougher new rules announced last month, without going ahead with a vote on participation next year. It followed criticism from some broadcasters of Israel's role in Eurovision amid the war in Gaza, and allegations that voting at this year's contest had been manipulated in favour of their contestant. In a statement, the EBU, which organises Eurovision, said members had shown \"clear support for reforms to reinforce trust and protect neutrality\". Sky News understands 11 countries voted against only accepting the rule changes. Golan Yochpaz, chief executive of Israel's public broadcaster KAN, said during the meeting that attempts to remove them from the contest could \"only be understood as a cultural boycott\", according to a statement shared by the organisation. Israel's president Isaac Herzog posted on X following the announcement, saying: \"Israel deserves to be represented on every stage around the world, a cause to which I am fully and actively committed... I hope that the competition will remain one that champions culture, music, friendship between nations, and cross-border cultural understanding.\" Boycott announcements - what have broadcasters said? The broadcasters from Spain, Ireland, Slovenia and the Netherlands had all said earlier in the year that they would not participate in 2026 should Israel be allowed to continue in the competition. In a statement following the general assembly meeting, RTE confirmed Ireland's position. \"RTE feels that Ireland's participation remains unconscionable given the appalling loss of lives in Gaza and the humanitarian crisis there which continues to put the lives of so many civilians at risk,\" the broadcaster said. AVROTROS, broadcaster for the Netherlands, said that \"under the current circumstances, participation cannot be reconciled with the public values that are fundamental to our organisation\". General director Taco Zimmerman said it had not been an easy decision, adding: \"Culture unites, but not at any price. What has happened over the past year has tested the limits of what we can uphold.\" Confirming its withdrawal, Spain's RTVE highlighted how its board of directors had agreed in September that the country would withdraw \"if Israel was part of it\". This is a big deal for Eurovision, as Spain is one of the \"Big Five\" broadcasters - a group which also includes France, Germany, Italy and the UK. While the host broadcaster - as last year's winners, this is Austria this year - will often contribute the most towards the cost of staging the contest, the Big Five will also make up a significant amount. Slovenian broadcaster RTV said it was pulling out of the competition \"on behalf of the 20,000 children who died in Gaza\". In her address to members before the decision, Natalija Gorscak, RTV Slovenia board chairwoman, said: \"For the third year in a row, the public has demanded that we say no to the participation of any country that attacks another country. We must follow European standards for peace and understanding. \"Eurovision has been a place for joy and happiness from the very beginning, performers and audiences have been united by music, and it should remain that way.\" Eurovision 'is for broadcasters, not governments' But Austria's broadcaster ORF said it was happy with the decision and is looking forward to hosting next year. Roland Weissman, ORF director-general, said the contest \"is a competition for broadcasters, not governments\", and that he had personally advocated for Israel's participation. \"In the spirit of fostering cultural dialogue and supporting and strengthening the democratic role of public broadcasters, it was important not to burn any bridges,\" he said, adding that concerns raised by some members had been taken \"very seriously\". \"Naturally, I would regret it if broadcasters were to decide against participating,\" he added. \"I see the Eurovision Song Contest in Vienna as an opportunity to emphasise what unites us rather than what divides us - United by Music.\" Politics has always played a part in Eurovision, despite the EBU's insistence that it remains politically neutral. Countries have pulled out or been banned in previous years - most notably Russia in 2022, just days after the invasion of Ukraine. But this exodus could be Eurovision's biggest political crisis yet, with suggestions that other broadcasters may follow suit. Iceland's broadcaster RUV said its board would discuss participation at a meeting next Wednesday, after previously agreeing to a motion to recommend Israel be expelled. The BBC, which broadcasts the competition in the UK, said it supported the decision for Israel to be allowed to take part. \"This is about enforcing the rules of the EBU and being inclusive,\" it said in a statement. Earlier this year, outgoing BBC director-general Tim Davie said the corporation was \"aware of the concerns\" raised, but the song contest had \"never been about politics\". Arts and entertainment correspondent With a slew of countries quitting Eurovision over Israel's inclusion, the competition has been thrown into chaos. This has been brewing for some time. A few months ago, the row had become such a point of contention that the EBU announced plans for an emergency vote. Crucially, that was called off when a Gaza ceasefire was announced. So instead, at its big assembly meeting, countries were only allowed to vote on rule changes being introduced - another issue that allegedly involved Israel amid accusations of unfair voting practices. If you read the EBU's post-meeting statement, you'd think it had gone swimmingly. But while it made it sound like everyone was in agreement, Sky News understands 11 countries in fact voted against the changes. Denied an actual vote on Israel's participation, it triggered a domino effect of countries quitting – the Netherlands, Ireland, Spain and Slovenia. Arguably, Spain pulling out could have the biggest effect. It's one of the key financial backers of the contest – and that could potentially impact the ability to stage it in the grand way we've become to accustomed to. So what happens next? The contest prides itself on maintaining political and cultural neutrality, positioning itself as celebrating music and peace rather than politics. But for now, the big question is: who will be left singing? How have the rules changed? In November, the EBU announced it was changing its voting system. This followed allegations of \"interference\" by Israel's government earlier this year. The rule changes announced in November came after Israeli singer Yuval Raphael received the largest number of votes from the public at the 2025 event, held in Basel, Switzerland, in May - ultimately finishing as runner-up to Austria's entry after the jury votes were counted. But a number of broadcasters raised concerns about Israel's result. Key changes to next year's competition include: • Clearer rules around promotion of artists and their songs• Cap on audience voting halved• The return of professional juries to semi-finals• Enhanced security safeguards It was these changes members were secretly balloted on at the general assembly. With a \"large majority\" voting that they were happy with these changes, the EBU said there was no need for a further vote on participation. Speaking after the discussion, EBU president Delphine Ernotte Cunci said the result \"demonstrates members' shared commitment to protecting transparency and trust in the Eurovision Song Contest, the world's largest live music event\". Thanking members for their \"thoughtful, respectful and constructive contributions\" during the session and throughout the year, she said these discussions had led to \"meaningful changes\" to the rules, ensuring the contest \"remains a place for unity and cultural exchange\"."
    },
    {
        "title": "Industrial action on agenda as actors balloted by Equity over AI scanning concerns",
        "description": "Thousands of members of actors' trade union Equity are being asked whether they would support industrial action over artificial intelligence protections.",
        "url": "https://news.sky.com/story/industrial-action-on-agenda-as-actors-balloted-by-equity-over-ai-scanning-concerns-13479308",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ai-artificial-intelligence_7100875.jpg?20251204134147",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-04 12:37:00",
        "Headline": "The actors' union is canvassing 7,000 members working in film and TV over artificial intelligence protections.",
        "Content": "Thousands of members of actors' trade union Equity are being asked whether they would support industrial action over artificial intelligence protections. The organisation has launched an indicative ballot among about 7,000 members working in film and TV. Performers are being asked whether they are prepared to refuse to be digitally scanned on set in order to secure adequate artificial intelligence protections. It will be the first time the performing arts and entertainment trade union has asked this whole section of its membership to vote in a ballot. The announcement follows the Hollywood strikes in 2023, when members of Equity's sister union in the US, SAG-AFTRA, and writers, went on strike over issues including AI. Video game actors in the US also protested over the use of AI, ending almost a year of industrial action earlier in 2025. Equity's ballot opens on Thursday and runs for two weeks, and will show the level of support the union has for action short of a strike. Another statutory ballot would have to be made before any industrial action is taken. \"While tech companies get away with stealing artists' likeness or work, and the government and decision makers fret over whether to act, unions including Equity are at the forefront of the fight to ensure working people are protected from artificial intelligence misuse,\" Equity general secretary Paul W Fleming said in a statement. \"If bosses can't ensure someone's likeness and work won't be used without their consent, why should performers consent to be digitally scanned in the first place?\" Mr Fleming said the ballot would give members the opportunity to \"send a clear message to the industry: that it is a basic right of performers to have autonomy over their own personhood and identity\". The union has no choice but to recommend members support industrial action, he said. \"It's time for the bosses to step away from the brink and offer us a package, including on AI protections, which respects our members,\" added Mr Fleming."
    },
    {
        "title": "Spotify Wrapped: How does it work - and who are this year's top artists? ",
        "description": "The hotly anticipated Spotify Wrapped is revealing our top tracks, artists and albums for 2025.",
        "url": "https://news.sky.com/story/spotify-wrapped-how-does-it-work-and-who-are-this-years-top-artists-13479145",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bad-bunny-taylor-swift_7100479.png?20251204052525",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-04 01:00:00",
        "Headline": "The platform takes a range of users' data to create personalised listening figures and global rankings.",
        "Content": "The hotly anticipated Spotify Wrapped is revealing our top tracks, artists and albums for 2025. But how does the streaming service calculate personalised summaries of users' listening habits and rank the UK's hottest artists? Here's a look at how your data is used. The platform describes the annual statistics as \"a chance to look back on your year in sound\". It says data is captured between January and mid-November on every account, although it mostly excludes anything streamed in private mode. (Don't worry, your passion for the Spice Girls can be kept secret.) Wrapped presents personalised listening statistics, which Spotify calls the \"real story of your year of listening\", alongside global figures for comparison. The streaming service says Minutes Listened reflects the actual time spent listening to audio on the platform. \n                  Spotify hikes UK subscription prices\n                 \n                  Spotify down: Streaming app suffers major outage - as company confirms 'issues'\n                 \n                  Taylor Swift's The Tortured Poets Department streamed more than 300 million times in one day\n                 Once a user streams at least 30 tracks, Spotify generates a list of Your Top Songs. Similarly, Your Top Artists ranks artists based on total minutes listening to a particular performer. Other metrics identify the top genres users have played, as well as podcasts and audiobooks ranked by total minutes listened. And if you've listened to at least 70% of tracks on a record, you'll see top albums too. Spotify also creates Your Listening Age, a guesstimate of your age based on the era of the music \"you feel most connected to\". The streaming service says the statistic is calculated using a five-year span of music which users engaged with more than other listeners of a similar age. Swift vs Bunny Pop superstar Taylor Swift has been named the UK's most-streamed artist on Spotify for the third year in a row. But she dropped out of the top spot in the global rankings, coming second to Puerto Rican superstar Bad Bunny, who secured more than 19.8 billion streams. Third were The Weeknd, followed by Drake and Billie Eilish. Bad Bunny's LP Debi Tirar Mas Fotos was the most listened-to album worldwide. Read more from Sky News:Sabrina Carpenter fury at videoDrake's lawsuit dismissedSpotify hikes UK prices Spotify revealed Drake was the UK's second most-listened to artist, followed by Sabrina Carpenter in third, The Weeknd in fourth and Billie Eilish in fifth. Despite being the most listened-to artist, Swift failed to break into the UK's top five most listened-to songs and albums of the year. Alex Warren's Ordinary was the most-streamed song, and Short 'N' Sweet, released by Carpenter last year, the top album."
    },
    {
        "title": "'Drop and cover'  earthquake alert turns out to be false alarm",
        "description": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false.",
        "url": "https://news.sky.com/story/drop-and-cover-earthquake-alert-turns-out-to-be-false-alarm-13479519",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-earthquake-nevada_7101373.jpg?20251204232026",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-12-04 22:13:00",
        "Headline": "Seismologists say the bogus message sent out in Nevada and California may be a first and \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles, could be to blame.",
        "Content": "An earthquake alert preparing people to \"drop, cover, hold on\" buzzed on phones in the US on Thursday - but turned out to be completely false. The US Geological Survey (USGS) warned a 5.9-magnitude quake had struck near Dayton, Nevada, with people in the San Francisco area, about 180 miles away, also getting the message. However, multiple law enforcement agencies near the reported epicentre reported no shaking or other earthquake signs. A 5.9 quake can typically cause minor property damage and pronounced shaking, according to magnitude scales. The reason for the false alarm is unclear but it's believed to be the first time the automatic system has sent a bogus message. \"To my knowledge we've never had a false alert like this,\" said Yaareb Altaweel, from the National Earthquake Information Center in Colorado. \"The system has put out incorrect information on exaggerated magnitude or depth, which was corrected immediately by the on-duty seismologist, [but] I have seen that happen before,\" said Altaweel. \n                  Victorious Scotland fans caused 'extremely small' earthquake in Denmark win\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 \n                  'We don't have anything for winter': Families fear months ahead after earthquake wiped out entire villages in Afghanistan\n                 Angie Lux, at the Berkeley Seismological Laboratory, also said she had never heard of a completely false alert. She said the cause could have been \"noisy triggers\" from human-made sources, such as explosions or construction work, or even from large vehicles. Natural phenomena for such triggers include wind and ocean waves. Read more from Sky News:Countries withdraw from Eurovision over Israel decisionAnti-Hamas militia leader killed in Gaza - reports The UK experienced its own (authentic) earthquake this week when a 3.3-magnitude tremor hit northwest England. The British Geological Survey (BGS) said it was \"felt across the South Lakes and Lancashire, mainly within 20km of the epicentre\", including Kendal and Ulverston in neighbouring Cumbria."
    }
]