[
    {
        "title": "Former US president Joe Biden diagnosed with 'aggressive' form of prostate cancer",
        "description": "Former US president Joe Biden has prostate cancer, his office has said.",
        "url": "https://news.sky.com/story/former-president-joe-biden-diagnosed-with-aggressive-form-of-prostate-cancer-13370723",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-biden-white-house_6800851.jpg?20250116044700",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 20:04:00",
        "Headline": "The former president was diagnosed with prostate cancer, characterised by a Gleason score of 9 - which Cancer Research UK says means the cells \"look very abnormal\" and the disease is \"likely to grow quickly\".",
        "Content": " Former US president Joe Biden has prostate cancer, his office has said. Mr Biden, 82, who left the White House in January, was seen by doctors last week for urinary symptoms. He was later diagnosed with prostate cancer, with the cancer cells having spread to the bone. His office said in a statement: \"Last week, President Joe Biden was seen for a new finding of a prostate nodule after experiencing increasing urinary symptoms. \"On Friday, he was diagnosed with prostate cancer, characterised by a Gleason score of 9 (Grade Group 5) with metastasis to the bone. \"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive which allows for effective management. \"The President and his family are reviewing treatment options with his physicians.\" \n                  Weight loss jabs could almost halve risk of obesity-related cancers beyond slimming down, study suggests\n                 \n                  New tech promises faster diagnosis for millions of cancer patients\n                 \n                  Blood test that can detect 12 common cancers to be trialled on NHS\n                 According to Cancer Research UK, a Gleason score of 9 means the cancerous cells \"look very abnormal\" and the disease is \"likely to grow quickly\". Dr Imran Ahmad, professor of urological oncology at the University of Glasgow, told Sky News on Sunday evening that prostate cancer is \"very common\" for men in their 80s. \"If you biopsy 10 men of Joe Biden's age, eight would have prostate cancer,\" he said. \"But I would argue that maybe seven of those men would have low-risk prostate cancer that we could just watch, and that they would die of. \"Whereas Joe Biden's is obviously a very aggressive form that - if he is otherwise fit - will be what he dies of.\" Health correspondent Joe Biden's prostate cancer is one of the most aggressive forms of the disease.  Prostate cancers are rated with a Gleason score. This measures on a scale of one to 10 how the cancerous cells look compared with normal cells. His score is nine. It has been given a Grade Group of 5 - the highest. That means the cancer has poor differentiation from normal cells and will grow rapidly. It has already spread to his bones. Metastasised cancer is harder to treat than cancer that stays in one place because it's spread around the body, making it harder for drugs to reach and destroy all the tumours.  But there is some hope from Biden's medical team. They say his cancer appears to be hormone sensitive. When prostate cancers need hormones to grow, targeted therapy can deprive these tumours of these hormones, making treatment more effective. Prostate cancer is one of the most common cancers in men. In the UK, it accounts for around a quarter of all male cancer cases.  In the US, it's also one of the most common, second only to skin cancer. It mostly affects men over the age of 50 and becomes more common with age. A source familiar with Mr Biden and his family's thinking told Sky's US partner network NBC News that the former president is considering \"multiple treatment options\" - including hormone treatment for the cancer. They added he is at his home in Wilmington, Delaware, and that as of now, it is unclear where the former president will be treated. In a statement on social media, former president Barack Obama said: \"Michelle and I are thinking of the entire Biden family. \"Nobody has done more to find breakthrough treatments for cancer in all its forms than Joe, and I am certain he will fight this challenge with his trademark resolve and grace. We pray for a fast and full recovery.\" President Donald Trump also posted on Truth Social that he was \"saddened\" by the news, adding: \"We extend our warmest and best wishes to Jill and the family, and we wish Joe a fast and successful recovery.\" Mr Biden was the oldest person to ever serve as president, with concerns about his health raised regularly during his campaign for re-election last year. After a poor debate against Mr Trump in June, he withdrew from the 2024 election and endorsed his vice president Kamala Harris. Read more from Sky News:Gary Lineker to leave BBC next weekPro-West candidate wins Romanian election Ms Harris wrote on X: \"We are keeping him, Dr. Biden, and their entire family in our hearts and prayers during this time. \"Joe is a fighter - and I know he will face this challenge with the same strength, resilience, and optimism that have always defined his life and leadership. We are hopeful for a full and speedy recovery.\" Hillary Clinton also posted on social media that she is \"thinking of the Bidens as they take on cancer, a disease they've done so much to try to spare other families from\". Prime Minister Sir Keir Starmer said in a statement: \"I am very sorry to hear President Biden has prostate cancer. \"All the very best to Joe, his wife Jill and their family, and wishing the President swift and successful treatment.\" In February 2023, he had a skin lesion removed from his chest that was a basal cell carcinoma, a common form of skin cancer."
    },
    {
        "title": "Israel to allow 'basic quantity of food' into Gaza to avoid 'starvation crisis'",
        "description": "Israel has said it will allow a \"basic quantity of food\" into the besieged enclave of Gaza to avoid a \"starvation crisis\" following a near three-month blockade.",
        "url": "https://news.sky.com/story/israel-to-allow-basic-quantity-of-food-into-gaza-to-avoid-starvation-crisis-13370724",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-khan-younis-gaza_6900703.jpg?20250429133818",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 20:14:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu's office has said some food would be allowed into Gaza, which has been under a complete blockade on humanitarian aid since 2 March, to avoid a \"starvation crisis\".",
        "Content": "Israel has said it will allow a \"basic quantity of food\" into the besieged enclave of Gaza to avoid a \"starvation crisis\" following a near three-month blockade. Israeli Prime Minister Benjamin Netanyahu's office said the decision was \"based on the operational need to enable the expansion of the military operation to defeat Hamas\". Gaza, where local authorities say more than 53,000 people have died in Israel's 19-month campaign, has been under a complete blockade on humanitarian aid since 2 March. It comes as global food security experts warn of famine across the territory and after a UN-backed report from last Monday which warned one in five people in Gaza were facing starvation.  The statement from the prime minister's office said it would \"allow a basic quantity of food to be brought in for the population in order to make certain that no starvation crisis develops in the Gaza Strip\". \"Such a crisis would endanger the continuation of Operation 'Gideon's Chariots' to defeat Hamas,\" it added. \"Israel will act to deny Hamas's ability to take control of the distribution of humanitarian assistance in order to ensure that the assistance does not reach the Hamas terrorists.\" \n                  Gaza at mercy of what comes next as Israel ramps up brutal offensive\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Israel and Hamas resume ceasefire talks after 'extensive strikes' on Gaza\n                  It comes after a British surgeon working in Gaza said in a video to Sky News the enclave is now \"a slaughterhouse\" amid Israeli bombardment. Israel has just ramped up its offensive in Gaza - where it's been conducting a military campaign in retaliation for 1,200 people killed and 251 taken hostage by Hamas on 7 October 2023 - with Palestinian health officials reporting at least 130 people were killed overnight into Sunday. Israel Defence Forces (IDF) confirmed troops had begun \"extensive ground operations throughout the northern and southern Gaza Strip\". The Hamas-run health ministry in Gaza said 464 people had died in Israeli military strikes in the week to Sunday. Read more:Gaza at mercy of what comes next'At least 93 killed' in Israeli strikes on Gaza on Friday In a statement on Sunday, IDF said its air force struck \"over 670 Hamas terror targets throughout the Gaza Strip to disrupt enemy preparations and support ground operations\" over the past week. Israel has launched an escalation to increase pressure on Hamas, seize territory, displace Palestinians to the south and take greater control over the distribution of aid."
    },
    {
        "title": "Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win",
        "description": "This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government.",
        "url": "https://news.sky.com/story/easing-trade-and-signing-a-defence-pact-would-be-manifesto-promises-delivered-and-starmer-could-use-a-win-13370762",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Sir Keir Starmer promised in his election manifesto that the UK would sign a new security pact with the EU and improve the trading relationship with the continent. Monday is set to be when the PM makes good on those promises.",
        "Content": "\n          Political editor\n              @BethRigby\n  This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government. The Labour leader promised in his 2024 election manifesto that the UK would sign a new security pact with the EU to strengthen cooperation and improve the UK's trading relationship with the continent. Since winning power in July, he has embarked on a charm offensive across European capitals in a bid to secure that better post-Brexit deal. Monday is set to be when the PM makes good on those promises at a historic summit at Lancaster House in London. Read more: What exactly could the UK-EU reset look like?  There, the EU and UK are expected to sign a security and defence partnership, which has taken on a new sense of urgency since the arrival of President Trump in the White House. It is an agreement that will symbolise the post-Brexit reset, with the PM, European Commission president Ursula von der Leyen and European Council president Antonio Costa are also expected to sign off on a communique pledging deeper economic cooperation. \n                  Post-Brexit EU reset negotiations 'going to the wire', says minister\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 But, rather like the torturous Brexit negotiations I covered for years in London and Brussels under Conservative prime ministers, Sir Keir's post-Brexit reset talks are going down to the wire. As of 10.30pm on Sunday, discussions were set to continue overnight, the two sides snared up over details around fisheries, food trade and youth mobility. It's not that both sides don't want the reset: the war in Ukraine and the spectre of the US becoming an unreliable partner have pushed London and Brussels closer together in their common defence interest. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 Fishing and youth mobility - the two snags But the pressure for this deal weighs more heavily on our prime minister than his European colleagues. He's been talking for months about securing a reset and better trading relationship with the EU to bolster the UK economy. His need to demonstrate wins is why, suggests one continental source, the Europeans are letting talks go to the wire, with London and Brussels in a tangle over fishing rights - key demands of France and the Netherlands - and a youth mobility scheme, which is a particular focus for Berlin. \"The British came with 50 asks, we came with two - on fishing and the youth mobility scheme,\" says one European source. The EU is asking for longer-term access to UK fishing grounds - a 10-year deal - which the British government has rebuffed, insisting it will not go beyond a four-year deal. In response, Brussels is saying it will not lift regulatory checks on food, agricultural and animal products unless the UK moves on fishing. This has left the two sides at an impasse. EU sources say Brussels had offered a time-limited deal to lift checks on animal products - replicating London's offer on fisheries - but the UK is reluctant to do this as it leaves too much uncertainty for farmers and supermarkets. Scotland election weighing on talks A deal on food products, known as sanitary and phytosanitary (SPS) goods, would be a boost for the economy, with potentially up to 80% of border checks disappearing, given the breadth of products - paint, fashion goods, leather as well as foods - with an animal component. Any deal would also mean the UK would have to align with rules made in Brussels and make a financial contribution to the EU to fund work on food and animal standards. Both elements will trigger accusations of Brexit \"betrayal\", as the UK signs up as a \"rule taker\" and finds itself paying back into the EU for better access. Government figures had been telling me how they were more than prepared to face down the criticisms likely to be thrown at them from the Conservatives. But sensitivities around fishing, particularly in Scotland, where Labour is facing elections next year, have weighed on talks. Read more from Sky News:UK has not asked about asylum return hubs, other Balkan countries say'Ouch': Starmer condemned for telling MP 'she talks rubbish'Joe Biden diagnosed with 'aggressive' form of prostate cancer The other area of huge tension is over a youth mobility scheme, which would enable young adults from member states to study and work in the UK and vice versa. Government sources familiar with the talks acknowledge some sort of scheme will happen, but want details to be vague - I'm told it might be \"an agreement about a future agreement\", while the EU sees this a one of its two core demands.  In talks late on Sunday night, the UK government appeared to be softening on re-opening the pre-Brexit Erasmus student exchange scheme as perhaps a way to get around the impasse, according to one EU source. The UK rejoining this scheme had been rebuffed by Sir Keir last year, but was raised again last night in talks, according to a source. Common ground on defence and security Wherever the economic horsetrading lands, the two sides have found common ground in recent months is on defence and security, with the UK working in lockstep with European allies over Ukraine and relationships deepening in recent months as Sir Keir Starmer has worked with President Macron and others to try to smooth tensions between Kyiv and Washington and work on a European peace deal for Ukraine. If details on trade, youth mobility and fisheries are fudged on Monday, the expectation is that the two sides will sign a security partnership that will reiterate the UK's commitment to build up the continent's defence capability and stand united against Russian aggression with its partners.  The deal should also mean British arms companies will be able to access the EU's €150bn rearmament programme, which has been set up to create a massive surge in defence spending over the next five years as Europe prepares itself to better repel threats. As I write this, talks are ongoing, but it is clearly in neither side's interest for Monday to go wrong. The EU and UK need to maintain a united front and, more importantly for Keir Starmer domestically, the PM needs to show an increasingly sceptical public he can deliver on his promises. Easing trade barriers with Britain's biggest trading partner and signing an EU defence pact would be two manifesto promises delivered. And with his popularity sinking to a record low in recent days, he could really do with a win."
    },
    {
        "title": "Nicusor Dan beats hard-right favourite George Simion in Romanian election",
        "description": "Pro-Western candidate Nicusor Dan has unexpectedly beaten hard-right populist George Simion in the Romanian election.",
        "url": "https://news.sky.com/story/exit-polls-from-romanian-election-suggest-surprise-win-for-pro-western-candidate-nicusor-dan-13370509",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nicusor-dan-romania_6921063.jpg?20250518203914",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 16:01:00",
        "Headline": "The result is a dramatic turnaround from the first round of voting a few weeks ago when Mr Simion was well ahead.",
        "Content": "Pro-Western candidate Nicusor Dan has unexpectedly beaten hard-right populist George Simion in the Romanian election. Mr Simion, 38, and his rival - a centrist who's mayor of Bucharest - faced off in the second round of the contest. According to the official tally, Mr Dan was leading by nearly nine percentage points with more than 98% of the votes counted. There aren't enough votes remaining for Mr Simion to make a comeback. After exit polls suggested he wasn't going to win, Trump-supporting Mr Simion rejected the result and said estimates put him 400,000 votes ahead. Speaking after voting ended, Mr Simion said his election was \"clear\" as he posted on Facebook: \"I won!!! I am the new President of Romania and I am giving back the power to the Romanians!\"  Romania's last election was annulled after its highest court ruled the leading candidate, nationalist Calin Georgescu, should be disqualified due to claims of electoral interference by Russia. The result is surprising because in the first round, 38-year-old Mr Simion, founder of the right-wing Alliance for the Unity of Romanians (AUR), took 40.96% of the vote - almost 20 points ahead. An opinion poll on Friday had it much closer, but still suggested the two men were virtually tied. Mr Dan, a 55-year-old mathematician, is running as an independent and has pledged to clamp down on corruption. He is also staunchly pro-EU and NATO, and has said Romania's support for Ukraine is vital for its own security. When voting closed on Sunday at 9pm local time, 11.6 million people - about 64% of eligible voters - had cast ballots. About 1.64 million Romanians living abroad also took part. Read more from Sky News: British surgeon in Gaza says it's now 'a slaughterhouse'Two die as ship crashes into Brooklyn Bridge The election is being closely watched across Europe amid a rise in support for President Donald Trump. After polls closed, Mr Dan said \"elections are not about politicians\" but about communities and that in the latest vote \"a community of Romanians has won, a community that wants a profound change in Romania\". \"When Romania goes through difficult times, let us remember the strength of this Romanian society,\" he said. \"There is also a community that lost today's elections. A community that is rightly outraged by the way politics has been conducted in Romania up to now.\""
    },
    {
        "title": "Gary Lineker to leave BBC next week and will no longer host World Cup coverage in 2026",
        "description": "Gary Lineker is to leave the BBC after this season's final Match Of The Day and will no longer present its coverage of the World Cup, Sky News understands.",
        "url": "https://news.sky.com/story/gary-lineker-to-leave-bbc-immediately-and-wont-host-world-cup-coverage-13370742",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/image_6921109.jpg?20250518224615",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-05-18 21:24:00",
        "Headline": "The presenter is to leave after this season's final Match Of The Day and will no longer present its 2026 World Cup coverage, Sky News understands.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Gary Lineker is to leave the BBC after this season's final Match Of The Day and will no longer present its coverage of the World Cup, Sky News understands. It comes after he \"apologised unreservedly\" for a social media repost featuring a rat - used in propaganda by Nazi Germany to dehumanise Jewish people - and said he would \"never knowingly share anything antisemitic\". Lineker's last appearance on the BBC will be on 25 May, the final day of the season, with confirmation expected on Monday. The former England star announced in November he would step down from Match Of The Day this year, but was set to return to front the World Cup in 2026, as well as FA Cup coverage. Lineker, 64, said he was unaware the post he shared was antisemitic and it went against \"everything I believe in\". In response to the presenter resharing the post, the Campaign Against Antisemitism said his \"continued association with the BBC is untenable\". And when asked about Lineker last week, BBC director general Tim Davie said: \"When someone makes a mistake, it costs the BBC reputationally.\" \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 \n                  New presenters of BBC's Match Of The Day confirmed as Mark Chapman, Kelly Cates and Gabby Logan\n                 \n                  Gary Lineker says 'right time' to leave Match Of The Day as he hints at changes to show's format\n                 The presenter was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's asylum policy. Read more from Sky News:UK surgeon working in Gaza says it is now 'a slaughterhouse'Luke Littler hits out at vandals who targeted his van Lineker has hosted Match Of The Day since 1999 and has been the BBC's highest-paid on-air talent for seven consecutive years. He also has a successful podcast production company. Mark Chapman, Kelly Cates and Gabby Logan will take over the highlights show from next season. When the trio take over as hosts, it will be the first time the role has been shared by three people. Sky News has contacted the BBC for comment."
    },
    {
        "title": "Sean 'Diddy' Combs: What it was like to follow 'the Pied Piper of partying'",
        "description": "In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.&#160;",
        "url": "https://news.sky.com/story/sean-diddy-combs-what-it-was-like-to-follow-the-pied-piper-of-partying-13370508",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-diddy-combs-trial_6914836.jpg?20250513093531",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Magazine editor Amy DuBois Barnett describes Sean \"Diddy\" Combs as \"the Pied Piper… of the most elite level of partying\" in the 1990s and early 2000s.",
        "Content": "\n          Arts and entertainment correspondent\n        In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.  Now on trial in Manhattan, his hair grey, his beard grown, it's hard to imagine that he was \"the Pied Piper… of the most elite level of partying of that time\" - but that's how Amy DuBois Barnett describes him. She was the first Black-American woman to run a major mainstream magazine in the US, and based in Manhattan at a time when hip hop was at its zenith. \"Urban culture really ran the city,\" she says. \"That's where so much of the money was… you had all the finance bros trying to get into Puffy (Combs) parties, all the fashion executives trying to get into Puffy parties.\" And while he was welcomed by the highest echelons of the arts and entertainment world, she says: \"He was never known for being a calm kind of individual.\" Combs was \"very dismissive\" with her, and she admits: \"Puff never particularly liked me that much.\" But DuBois Barnett would often get invited to his parties because she was able to feature his up-and-coming artists in her magazines. From editor-in-chief of Ebony magazine, she'd go on to become the editor-in-chief of Honey and Teen People magazines, and then deputy editor of Harper's Bazaar. She says the man she met at those parties \"lacked warmth\" and seemed \"complicated\". Read moreCassie finishes her court evidenceNine revelations from Cassie's time in courtWhat we know about the jurors in Diddy's trial \"When he walked in the room, all of the energy changed. Puffy had his trusted individuals around him… immediately the area around him would become kind of crowded with everybody vying for his attention,\" she says. \"I think that was also partially why he didn't particularly like me because I wasn't really vying for his attention. \"He really reserved that attention for the people that he was either attracted to… or the people that he thought were important enough to his business success.\" She says it was common knowledge that he wasn't someone to cross due to \"rumours... of what he could do\". \"There were a lot of people within journalism, within media, within other industries that were afraid of his influence and also afraid of his temper,\" she adds. \"When things at parties would not go his way or somebody didn't bring him something quickly enough, or… the conversation wasn't going his way… he would just kind of snap and he was just not afraid to yell at whoever was there. \"There was not a lot of boundaries in his communication, let's just put it that way.\" But she says it was a time when a tremendous amount of misogyny was running throughout music, things that in today's culture would certainly give pause for thought. \"So many things happened to me, everything from getting groped at parties to getting locked in a limousine with music executives and having him refuse to let me out until I did whatever he thought I was going to do, which I didn't.\" She insists: \"We didn't have the vocabulary to understand the degree to which it was problematic... it was a thread that ran throughout the culture.\" Star-studded parties were the ultimate invite At the time, a ticket to one of Combs's star-studded \"white parties\" was the ultimate invite. She admits: \"It was like nothing you've ever seen before… the dress code was very strict. \"No beige, no ecru, absolutely white, you would literally be turned away if your outfit was wrong. Puffy did not sort of tolerate people in his parties that didn't look 'grown and sexy' as it were.\" She says people would mingle by the poolside listening to the best DJs in the world, while topless models posed dressed as mermaids and waiters handed out weed brownies from silver platters. \"It was every boldface name you could possibly imagine, just this gorgeous crowd.\" Behind the glamour, prosecutors now allege there was a man capable of sexual abuse and violence, and a serious abuse of power. Criminal charges which he's already pleaded not guilty to and strenuously denies. Without question, Combs had the golden touch. Expanding his music career into business enterprises that in 2022 reportedly took his net worth to around £1bn. For decades his success story was celebrated. \"I think that in the black community, there is a feeling that if a black man is successful you don't want to bring him down because there are not that many… these are cultural forces that are rooted in the systemic racism that's present in the United States… but I think that these were part of what potentially protected Puffy against people speaking out.\" Couple became 'isolated and very unhappy' While Combs had amassed a small fortune over the course of two decades which she encountered him, the former magazine editor says his behaviour had markedly changed from the first party she went to, to her last. \"The last was a post-Grammys party, in 2017 or 2018, and just the vibe was very different. He was really kind of isolated in a corner with Cassie, you know, looking very unhappy.\" For around 10 years, Combs had a relationship with the singer Cassie Ventura which ended in 2018. Once over she filed a lawsuit that both parties eventually settled alleging she was trafficked, raped, drugged and beaten by the rapper on many occasions - which he denied. Last week she made similar claims in court. \"Cassie looked very glassy-eyed and there was a sadness about her energy. Whatever was happening between the two of them, I mean, it didn't feel positive,\" says DuBois Barnett. \"They were sort of holed up in the corner for almost the entire night… it did feel very different from the kind of jubilant of energy that he projected in his earlier incarnations.\" For Combs, his freedom depends on how these next few weeks go. His representatives claim he is the victim of \"a reckless media circus\", saying he categorically denies he sexually abused anyone and wants to prove his innocence. In particular, they say, he looks forward to establishing the \"truth... based on evidence, not speculation\"."
    },
    {
        "title": "British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment",
        "description": "A British surgeon working in southern Gaza has compared the region to a \"slaughterhouse\" because of the daily bombardment from Israeli forces.",
        "url": "https://news.sky.com/story/british-surgeon-working-in-gaza-says-it-is-now-a-slaughterhouse-amid-israeli-bombardment-13370212",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-al-shifa_6920184.jpg?20250518124636",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:59:00",
        "Headline": "Dr Tom Potokar, who is based in southern Gaza, says he is treating \"awful explosive injuries\".",
        "Content": " A British surgeon working in southern Gaza has compared the region to a \"slaughterhouse\" because of the daily bombardment from Israeli forces. Dr Tom Potokar offered his assessment of the military offensive after Palestinian health officials reported at least 130 people were killed overnight into Sunday. Israel Defence Forces (IDF) confirmed troops had begun \"extensive ground operations throughout the northern and southern Gaza Strip\". In a video, Dr Potokar said it was \"another day of devastation here in Gaza\", adding: \"The stories coming from the north... absolutely horrific... particularly around the Indonesian Hospital. \"I mean, it's difficult to describe in words what's happening here... [with the] constant sound of bombardment jets overhead. \"If Cambodia was the killing fields, then Gaza now is the slaughterhouse.\" His reference to Cambodia's killing fields refers to when more than a million people were murdered in mass executions and buried by the extreme communist guerrilla group, the Khmer Rouge, under Pol Pot, between 1975 and 1979. The Hamas-run health ministry in Gaza said 464 people had died in Israeli military strikes in the week to Sunday. In a statement on Sunday, IDF said its air force struck \"over 670 Hamas terror targets throughout the Gaza Strip to disrupt enemy preparations and support ground operations\" over the past week. Dr Potokar described the impact on those on the ground, saying: \"We've been operating all morning so far and [treating] awful explosive injuries... [including] one young woman with leg fracture and shoulder fracture and a large wound on her buttock, who came in yesterday and is not yet aware that everyone in our family was killed in the onslaught.\" Israel has launched an escalation to increase pressure on Hamas, seize territory, displace Palestinians to the south and take greater control over the distribution of aid.  On Sunday, it announced and launched \"extensive\" new ground operations in Gaza. It came after airstrikes killed at least 130 people, including dozens of children, overnight and into Sunday, hospitals and medics said, and forced northern Gaza's main hospital to close. A spokesperson for the Hamas-run health ministry said: \"Complete families were wiped off the civil registration record by Israeli bombardment.\" The ministry also said the attacks had forced the closure of the Indonesian Hospital, the main hospital serving people in northern Gaza. Nasser hospital, in the southern city of Khan Younis, said more than 48 people - mostly women and children - were killed in the area which includes tents sheltering displaced people. In Deir al Balah, in central Gaza, at least 12 people were killed in three separate strikes, according to Al Aqsa Martyrs Hospital and the Nuseirat camp's Awda Hospital. Meanwhile, the Gaza health ministry and the Palestinian Civil Defence - which operates under the Hamas-run government - reported that 19 people were killed in several strikes in Jabalia in northern Gaza. The Israeli military had no immediate comment on the strikes. Read more from Sky News:How Israel has escalated Gaza bombing campaign Ceasefire talks are taking place in Qatar this weekend - with Israel saying they involve discussions on ending the war as well as a truce and hostage deal. A statement from the office of Israeli Prime Minister Benjamin Netanyahu said any lasting truce must include the demilitarisation of Gaza as well as the exile of Hamas militants. But a senior Israeli official added there had been little progress so far during talks in Qatar's capital Doha. Sky News Arabia reported Hamas had proposed freeing about half its Israeli hostages in exchange for a two-month ceasefire and the release of Palestinian prisoners held by Israel. A Palestinian official close to the discussions said: \"Hamas is flexible about the number of hostages it can free, but the problem has always been over Israel's commitment to end the war.\""
    },
    {
        "title": "People do feel like strangers in Britain - but it's not just because of migration, polling finds",
        "description": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled.",
        "url": "https://news.sky.com/story/people-do-feel-like-strangers-in-britain-but-its-not-just-because-of-migration-polling-finds-13369073",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-immigration_6913886.jpg?20250512093918",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Reasons including the cost of living, the pandemic and working from home were all given as reasons why people are feeling more and more isolated, rather than what Sir Keir Starmer said.",
        "Content": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled. Some claimed this was a controversial and dangerous stance - drawing parallels with Enoch Powell's Rivers of Blood speech. But research released today suggests close to half of those in Great Britain feel like \"strangers\" in their own country. Politics latest: Follow live updates The survey, carried out by pollsters at More In Common, asked 13,464 people in Great Britain for their feelings on the matter. And what is even more surprising is that the survey was carried out over a month before Sir Keir's speech. The research is only being released today, and it is understood that Downing Street had not seen it before the prime minister's speech. \n                  UK has not asked about asylum return hubs, other Balkan countries say\n                 \n                  An embarrassment for Starmer on migrant return hubs?\n                 \n                  Sir Keir Starmer in talks with 'a number of countries' over return hubs for failed asylum seekers\n                 However it will likely be welcomed as a justification of a position aimed outside of Westminster.  Isolation linked to wealth The prime minister's concerns about Great Britain being an \"island of strangers\" was inextricably linked to rising immigration. But the research out today shows the isolation felt by many is strongly linked to wealth - with the poorest in the country more likely to feel like strangers. The cost of living was mentioned as a contributory factor by many of those asked. And when it comes to ethnic breakdown of those saying they feel like strangers, Asian or Asian British people were more likely than either white or black British people to say they felt separate. Amy, a teacher from Runcorn, told researchers that when \"your money's all going on your bills and the boring stuff like food and gas and leccy and petrol\" there is nothing left \"to do for ourselves\". Read more:Reform tops polls for first timeReform surge in estimated national vote Who is Starmer targeting?  Those who criticised Sir Keir for his \"strangers\" speech tended to accuse the prime minister of appealing to supporters of Reform or the Conservatives. Suspended Labour MP Zarah Sultana went as far as to claim the speech was a \"foghorn to the far right\". The analysis from More in Common found that people who supported Reform and the Conservatives last year are indeed much more likely to feel like strangers in the UK. While Labour, Lib Dem and Green supporters are all less likely to feel like strangers, around a third of them do still agree with the statement that they \"sometimes feel like a stranger in my own country\". And the polling also found that Reform and Conservative voters are much more likely to think that multiculturalism threatens national identity, while supporters of the other three parties tend to largely believe multiculturalism is a benefit. Across the board, supporters of all parties were more likely than not to think that everyone needs to do more to encourage integration between people of different ethnic backgrounds - and similarly a majority think it is everyone's responsibility to do so. Luke Tryl, the UK director of More in Common, said: \"The prime minister's warning that we risk becoming an 'island of strangers' resonates with millions who say they feel disconnected from those around them. \"But it would be a mistake to say that immigration and lack of integration are the sole causes of our fragmenting social fabric.\" John McDonnell, another former Labour MP, now suspended, told Sky News that having politicians \"exploit\" resentment fuelled by economic circumstance to shift \"the blame onto migrants just exacerbates the problem\". He said the government needs to \"tackle the insecurity of people's lives and you lay the foundations of a cohesive society\". With Reform now leading in the polls and the collapse of support for Sir Keir since becoming prime minister, it is unsurprising that what he says seems to match up with what turquoise voters feel. Work from home alone The post-pandemic shift to working from home and spending more time alone has also been blamed for an increased feeling of isolation. Ruqayyah, a support worker from Peterborough, said the shift to home offices had \"destroyed our young generation\". But there are many other reasons that people feel separate from the rest of their country. Read more:Internet may help older people's mental healthNo evidence of 'two-tier policing' in handling of Southport  Young people are less trusting of strangers, and there is also a deep discontent with the political system. Many think the system is \"rigged\" in favour of the wealthy - although this belief is less common the higher the level of education someone has completed. The tension that exploded during last year's riots are also highlighted, and many people are worried about religious differences - a situation exacerbated by foreign conflicts like in the Middle East and between India and Pakistan. The research was carried out alongside the campaign group Citizens UK and UCL. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Matthew Bolton, executive director of Citizens UK, said: \"We all saw what can happen last summer when anger and mistrust boil over and threaten the fabric of our society. \"The answers to this don't lie in Whitehall. \"By listening to people closest to the ground about what causes division and what builds unity in their neighbourhood, we can build a blueprint for cohesion rooted in local leadership and community power.\""
    },
    {
        "title": "A hug from the Pope's brother underlined just how much Leo's life has changed",
        "description": "Under the Roman sun, a pope greeted his people.",
        "url": "https://news.sky.com/story/a-hug-from-the-popes-brother-underlined-just-how-much-leos-life-has-changed-13370356",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pope-brother-pope-leo_6920522.jpg?20250518161041",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-05-18 14:51:00",
        "Headline": "Amid all the symbolism and ceremony, it was perhaps the hug with his brother Louis that underlined just how much Pope Leo's life has changed. A cardinal from Chicago is now one of the most powerful leaders in the world.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Under the Roman sun, a pope greeted his people. Through the tens of thousands gathered in St Peter's Square, Leo XIV made his way. Pope Leo's inaugural mass - as it happened Riding in an open-top Popemobile, the 267th pontiff looked relaxed as he smiled and waved at the faithful. Every now and then he would stop to bless babies in the crowd who were passed up to him by their delighted parents. People wearing the flags of countries from every corner of the world held up phones as he passed, desperately hoping to capture the historic moment. The joy and exhilaration were palpable. Then after the excitement, there was a moment of reflection as Leo XIV prayed at the tomb of the first ever pope, St Peter, before retracing the journey of pontiffs past and making his way to the outside altar. In front of princes, presidents, and the public, Leo received the symbols of the papacy: first the pallium was laid around his shoulders and then the fisherman's ring placed on his finger. The person who had that honour was the Filipino cardinal Luis Antonio Tagle, a man who just over a week ago many thought would be standing in Leo's place. It was at this point the enormity of the moment seemed to hit home as the new pontiff stared at the ring on his finger and perhaps pondered the weight of responsibility he had been given as the leader of 1.4 billion Catholics worldwide.  And what type of leader will he be? His inaugural mass gave some hints through the homily of a seemingly humble man. \"I was chosen, without any merit of my own, and now, with fear and trembling, I come to you as a brother, who desires to be the servant of your faith and your joy,\" he told the masses. Again, Leo presented himself as a pontiff pledging to sow peace and unity, and critical of economic systems that marginalise the poor. Read more:Who is Pope Leo XIV?Pope Leo condemns 'religious propaganda'  The Pope then prepared the holy communion, while the crowd shook hands and offered each other the sign of peace. And that message of peace was one he would return to at the end of the mass. \"We cannot forget our brothers and sisters who are suffering because of war. \"In Gaza, the surviving children, families, and elderly are reduced to starvation. In Myanmar, new hostilities have cut short innocent young lives. \"Finally, war-torn Ukraine awaits negotiations for a just and lasting peace,\" the Pope said. Message of peace impressed on VIPs No doubt peace was a point Leo also emphasised to waiting VIPs. Among those he greeted after the mass were US vice president JD Vance and the president of Israel. Ukrainian President Volodymyr Zelenskyy was granted a special private meeting with the pontiff and later posted on X about it. \"We thank the Vatican for its willingness to serve as a platform for direct negotiations between Ukraine and Russia,\" he said. Amid all the symbolism and ceremony, it was perhaps the hug with his brother Louis that underlined just how much Leo's life has changed. A cardinal from Chicago is now one of the most powerful leaders in the world. As the crowd celebrated this historic day, the Pope appeared to be already contemplating the challenges ahead - the daunting task of trying to bring unity to an increasingly divided world."
    },
    {
        "title": "Teen arrested after Kayden Moy dies following 'disturbance' at beach in Ayrshire",
        "description": "A teenager has been arrested after a 16-year-old boy died following reports of a \"disturbance\" at a beach in Ayrshire.",
        "url": "https://news.sky.com/story/boy-16-dies-after-disturbance-at-beach-in-ayrshire-13370183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kayden-moy_6920849.jpg?20250518220826",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:07:00",
        "Headline": "The teenager was found seriously hurt at Irvine Beach, with police believing the incident may have been filmed and urging witnesses to come forward.",
        "Content": "A teenager has been arrested after a 16-year-old boy died following reports of a \"disturbance\" at a beach in Ayrshire. Kayden Moy was found seriously injured by officers at Irvine Beach at around 6.45pm on Saturday. The teenager, from East Kilbride, South Lanarkshire, was taken to hospital but died in the early hours. Police Scotland said on Sunday evening that a 17-year-old boy had been arrested and enquires were continuing. Officers believe the incident may have been filmed and have urged witnesses and anyone with information to come forward. Detective Chief Inspector Campbell Jackson said: \"An extensive investigation is under way to establish the full circumstances surrounding this death. \"Our officers are supporting the boy's family at this very difficult and heartbreaking time. \"From our investigation so far, we know there were a number of people on the beach around the time of the disturbance. \"We believe several of them were filming at the time and may have footage of what happened. \"I would urge people to review the footage they have and contact police if they think the footage captured could be of significance to our investigation.\" This can be submitted anonymously, the force said. Read more from Sky News:Vandals target Luke Littler's vanUK's negotiations with EU 'going to the wire'End of an era for English football stadium Superintendent Jim McMillan added: \"We understand this death will be of great concern for the local community, but please be assured that we are doing everything we can to identify those involved. \"There will be additional patrols in the area as we carry out our enquiries and anyone with any concerns can approach these officers.\""
    },
    {
        "title": "Gary Lineker to leave BBC next week and will no longer host World Cup coverage in 2026",
        "description": "Gary Lineker is to leave the BBC after this season's final Match Of The Day and will no longer present its coverage of the World Cup, Sky News understands.",
        "url": "https://news.sky.com/story/gary-lineker-to-leave-bbc-immediately-and-wont-host-world-cup-coverage-13370742",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/image_6921109.jpg?20250518224615",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-05-18 21:24:00",
        "Headline": "The presenter is to leave after this season's final Match Of The Day and will no longer present its 2026 World Cup coverage, Sky News understands.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Gary Lineker is to leave the BBC after this season's final Match Of The Day and will no longer present its coverage of the World Cup, Sky News understands. It comes after he \"apologised unreservedly\" for a social media repost featuring a rat - used in propaganda by Nazi Germany to dehumanise Jewish people - and said he would \"never knowingly share anything antisemitic\". Lineker's last appearance on the BBC will be on 25 May, the final day of the season, with confirmation expected on Monday. The former England star announced in November he would step down from Match Of The Day this year, but was set to return to front the World Cup in 2026, as well as FA Cup coverage. Lineker, 64, said he was unaware the post he shared was antisemitic and it went against \"everything I believe in\". In response to the presenter resharing the post, the Campaign Against Antisemitism said his \"continued association with the BBC is untenable\". And when asked about Lineker last week, BBC director general Tim Davie said: \"When someone makes a mistake, it costs the BBC reputationally.\" \n                  Gary Lineker apologises for 'Zionism' re-post featuring image of rat\n                 \n                  New presenters of BBC's Match Of The Day confirmed as Mark Chapman, Kelly Cates and Gabby Logan\n                 \n                  Gary Lineker says 'right time' to leave Match Of The Day as he hints at changes to show's format\n                 The presenter was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's asylum policy. Read more from Sky News:UK surgeon working in Gaza says it is now 'a slaughterhouse'Luke Littler hits out at vandals who targeted his van Lineker has hosted Match Of The Day since 1999 and has been the BBC's highest-paid on-air talent for seven consecutive years. He also has a successful podcast production company. Mark Chapman, Kelly Cates and Gabby Logan will take over the highlights show from next season. When the trio take over as hosts, it will be the first time the role has been shared by three people. Sky News has contacted the BBC for comment."
    },
    {
        "title": "Post-Brexit EU reset negotiations 'going to the wire', says minister",
        "description": "Negotiations to reset the UK's post-Brexit relationship with the EU are going \"to the wire\", a Cabinet Office minister has said.",
        "url": "https://news.sky.com/story/post-brexit-eu-reset-negotiations-going-to-the-wire-says-minister-13370100",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-eu-uk-reset_6819338.jpg?20250204121024",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 07:47:00",
        "Headline": "The UK's lead negotiator Nick Thomas-Symonds tells Sky News he is \"confident\"  a deal can be reached \"that makes our borders more secure, is good for jobs and growth, and brings people's household bills down\".",
        "Content": " Negotiations to reset the UK's post-Brexit relationship with the EU are going \"to the wire\", a Cabinet Office minister has said. \"There is no final deal as yet. We are in the very final hours,\" the UK's lead negotiator Nick Thomas-Symonds told Sky's Sunday Morning with Trevor Phillips. On the possibility of a youth mobility scheme with the EU, he insisted \"nothing is agreed until everything is\". \"We would be open to a smart, controlled youth mobility scheme,\" he said. \"But I should set out, we will not return to freedom of movement.\" Politics latest: PM outlines 'benefits' for UK from closer EU ties The government is set to host EU leaders in London on Monday. Put to the minister that the government could not guarantee there will be a deal by tomorrow afternoon, Mr Thomas-Symonds said: \"Nobody can guarantee anything when you have two parties in a negotiation.\" But the minister said he remained \"confident\" a deal could be reached \"that makes our borders more secure, is good for jobs and growth, and brings people's household bills down\". \"That is what is in our national interest and that's what we will continue to do over these final hours,\" he said. \"We have certainly been taking what I have called a ruthlessly pragmatic approach.\" On agricultural products, food and drink, Mr Thomas-Symonds said supermarkets were crying out for a deal because the status quo \"isn't working\", with \"lorries stuck for 16 hours and food rotting\" and producers and farmers unable to export goods because of the amount of \"red tape\". Asked how much people could expect to save on shopping as a result of the deal the government was hoping to negotiate, the minister was unable to give a figure. Read more:What could a UK-EU reset look like?Starmer's stance on immigration criticised On the issue of fishing, asked if a deal would mean allowing French boats into British waters, the minister said the Brexit deal which reduced EU fishing in UK waters by a quarter over five years comes to an end next year. He said the objectives now included \"an overall deal in the interest of our fishers, easier access to markets to sell our fish and looking after our oceans\". Turning to borders, the minister was asked if people would be able to move through queues at airports faster. Again, he could not give a definitive answer, but said it was \"certainly something we have been pushing with the EU... we want British people who are going on holiday to be able to go and enjoy their holiday, and not be stuck in queues\". PM opens door to EU youth mobility scheme A deal granting the UK access to a major EU defence fund could be on the table, according to reports - and Prime Minister Sir Keir Starmer has appeared to signal a youth mobility deal could be possible, telling The Times that while freedom of movement is a \"red line\", youth mobility does not come under this. The European Commission has proposed opening negotiations with the UK on an agreement to facilitate youth mobility between the EU and the UK. The scheme would allow both UK and EU citizens aged between 18 and 30 years old to stay for up to four years in a country of their choosing. Earlier this month, Home Secretary Yvette Cooper told Phillips a youth mobility scheme was not the approach the government wanted to take to bring net migration down.  When this was put to him, Mr Thomas-Symonds insisted any deal on a youth mobility scheme with Europe will have to be \"smart\" and \"controlled\" and will be \"consistent\" with the government's immigration policy. Asked what the government had got in return for a youth mobility scheme - now there had been a change in approach - the minister said: \"It is about an overall balanced package that works for Britain. The government is 100% behind the objective of getting net migration down.\" Phillips said more than a million young people came to the country between 2004 and 2015. \"If there isn't a cap - that's what we are talking about,\" he said. The minister insisted such a scheme would be \"controlled\" - but refused to say whether there would be a cap. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 'It's going to be a bad deal' Shadow cabinet office minister Alex Burghart told Phillips an uncapped youth mobility scheme with the EU would lead to \"much higher immigration\", adding: \"It sounds very much as though it's going to be a bad deal.\" Asked if the Conservatives would scrap any EU deal, he said: \"It depends what the deal is, Trevor. And we still, even at this late stage, we don't know. \"The government can't tell us whether everyone will be able to come. They can't tell us how old the young person is. They can't tell us what benefits they would get. \"So I think when people hear about a youth mobility scheme, they think about an 18-year-old coming over working at a bar. But actually we may well be looking at a scheme which allows 30-year-olds to come over and have access to the NHS on day one, to claim benefits on day one, to bring their extended families.\" He added: \"So there are obviously very considerable disadvantages to the UK if this deal is done in the wrong way.\" Jose Manuel Barroso, former EU Commission president, told Phillips it \"makes sense\" for a stronger relationship to exist between the European Union and the UK, adding: \"We are stronger together.\" He said he understood fishing and youth mobility are the key sticking points for a UK-EU deal. \"Frankly, what is at stake... is much more important than those specific issues,\" he said."
    },
    {
        "title": "Teen arrested after Kayden Moy dies following 'disturbance' at beach in Ayrshire",
        "description": "A teenager has been arrested after a 16-year-old boy died following reports of a \"disturbance\" at a beach in Ayrshire.",
        "url": "https://news.sky.com/story/boy-16-dies-after-disturbance-at-beach-in-ayrshire-13370183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kayden-moy_6920849.jpg?20250518220826",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:07:00",
        "Headline": "The teenager was found seriously hurt at Irvine Beach, with police believing the incident may have been filmed and urging witnesses to come forward.",
        "Content": "A teenager has been arrested after a 16-year-old boy died following reports of a \"disturbance\" at a beach in Ayrshire. Kayden Moy was found seriously injured by officers at Irvine Beach at around 6.45pm on Saturday. The teenager, from East Kilbride, South Lanarkshire, was taken to hospital but died in the early hours. Police Scotland said on Sunday evening that a 17-year-old boy had been arrested and enquires were continuing. Officers believe the incident may have been filmed and have urged witnesses and anyone with information to come forward. Detective Chief Inspector Campbell Jackson said: \"An extensive investigation is under way to establish the full circumstances surrounding this death. \"Our officers are supporting the boy's family at this very difficult and heartbreaking time. \"From our investigation so far, we know there were a number of people on the beach around the time of the disturbance. \"We believe several of them were filming at the time and may have footage of what happened. \"I would urge people to review the footage they have and contact police if they think the footage captured could be of significance to our investigation.\" This can be submitted anonymously, the force said. Read more from Sky News:Vandals target Luke Littler's vanUK's negotiations with EU 'going to the wire'End of an era for English football stadium Superintendent Jim McMillan added: \"We understand this death will be of great concern for the local community, but please be assured that we are doing everything we can to identify those involved. \"There will be additional patrols in the area as we carry out our enquiries and anyone with any concerns can approach these officers.\""
    },
    {
        "title": "Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win",
        "description": "This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government.",
        "url": "https://news.sky.com/story/easing-trade-and-signing-a-defence-pact-would-be-manifesto-promises-delivered-and-starmer-could-use-a-win-13370762",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Sir Keir Starmer promised in his election manifesto that the UK would sign a new security pact with the EU and improve the trading relationship with the continent. Monday is set to be when the PM makes good on those promises.",
        "Content": "\n          Political editor\n              @BethRigby\n  This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government. The Labour leader promised in his 2024 election manifesto that the UK would sign a new security pact with the EU to strengthen cooperation and improve the UK's trading relationship with the continent. Since winning power in July, he has embarked on a charm offensive across European capitals in a bid to secure that better post-Brexit deal. Monday is set to be when the PM makes good on those promises at a historic summit at Lancaster House in London. Read more: What exactly could the UK-EU reset look like?  There, the EU and UK are expected to sign a security and defence partnership, which has taken on a new sense of urgency since the arrival of President Trump in the White House. It is an agreement that will symbolise the post-Brexit reset, with the PM, European Commission president Ursula von der Leyen and European Council president Antonio Costa are also expected to sign off on a communique pledging deeper economic cooperation. \n                  Post-Brexit EU reset negotiations 'going to the wire', says minister\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 But, rather like the torturous Brexit negotiations I covered for years in London and Brussels under Conservative prime ministers, Sir Keir's post-Brexit reset talks are going down to the wire. As of 10.30pm on Sunday, discussions were set to continue overnight, the two sides snared up over details around fisheries, food trade and youth mobility. It's not that both sides don't want the reset: the war in Ukraine and the spectre of the US becoming an unreliable partner have pushed London and Brussels closer together in their common defence interest. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 Fishing and youth mobility - the two snags But the pressure for this deal weighs more heavily on our prime minister than his European colleagues. He's been talking for months about securing a reset and better trading relationship with the EU to bolster the UK economy. His need to demonstrate wins is why, suggests one continental source, the Europeans are letting talks go to the wire, with London and Brussels in a tangle over fishing rights - key demands of France and the Netherlands - and a youth mobility scheme, which is a particular focus for Berlin. \"The British came with 50 asks, we came with two - on fishing and the youth mobility scheme,\" says one European source. The EU is asking for longer-term access to UK fishing grounds - a 10-year deal - which the British government has rebuffed, insisting it will not go beyond a four-year deal. In response, Brussels is saying it will not lift regulatory checks on food, agricultural and animal products unless the UK moves on fishing. This has left the two sides at an impasse. EU sources say Brussels had offered a time-limited deal to lift checks on animal products - replicating London's offer on fisheries - but the UK is reluctant to do this as it leaves too much uncertainty for farmers and supermarkets. Scotland election weighing on talks A deal on food products, known as sanitary and phytosanitary (SPS) goods, would be a boost for the economy, with potentially up to 80% of border checks disappearing, given the breadth of products - paint, fashion goods, leather as well as foods - with an animal component. Any deal would also mean the UK would have to align with rules made in Brussels and make a financial contribution to the EU to fund work on food and animal standards. Both elements will trigger accusations of Brexit \"betrayal\", as the UK signs up as a \"rule taker\" and finds itself paying back into the EU for better access. Government figures had been telling me how they were more than prepared to face down the criticisms likely to be thrown at them from the Conservatives. But sensitivities around fishing, particularly in Scotland, where Labour is facing elections next year, have weighed on talks. Read more from Sky News:UK has not asked about asylum return hubs, other Balkan countries say'Ouch': Starmer condemned for telling MP 'she talks rubbish'Joe Biden diagnosed with 'aggressive' form of prostate cancer The other area of huge tension is over a youth mobility scheme, which would enable young adults from member states to study and work in the UK and vice versa. Government sources familiar with the talks acknowledge some sort of scheme will happen, but want details to be vague - I'm told it might be \"an agreement about a future agreement\", while the EU sees this a one of its two core demands.  In talks late on Sunday night, the UK government appeared to be softening on re-opening the pre-Brexit Erasmus student exchange scheme as perhaps a way to get around the impasse, according to one EU source. The UK rejoining this scheme had been rebuffed by Sir Keir last year, but was raised again last night in talks, according to a source. Common ground on defence and security Wherever the economic horsetrading lands, the two sides have found common ground in recent months is on defence and security, with the UK working in lockstep with European allies over Ukraine and relationships deepening in recent months as Sir Keir Starmer has worked with President Macron and others to try to smooth tensions between Kyiv and Washington and work on a European peace deal for Ukraine. If details on trade, youth mobility and fisheries are fudged on Monday, the expectation is that the two sides will sign a security partnership that will reiterate the UK's commitment to build up the continent's defence capability and stand united against Russian aggression with its partners.  The deal should also mean British arms companies will be able to access the EU's €150bn rearmament programme, which has been set up to create a massive surge in defence spending over the next five years as Europe prepares itself to better repel threats. As I write this, talks are ongoing, but it is clearly in neither side's interest for Monday to go wrong. The EU and UK need to maintain a united front and, more importantly for Keir Starmer domestically, the PM needs to show an increasingly sceptical public he can deliver on his promises. Easing trade barriers with Britain's biggest trading partner and signing an EU defence pact would be two manifesto promises delivered. And with his popularity sinking to a record low in recent days, he could really do with a win."
    },
    {
        "title": "Everton bid farewell to Goodison Park in final men's game",
        "description": "Everton have bid farewell to Goodison Park with a 2-0 over Southampton in their final men's game at the ground.",
        "url": "https://news.sky.com/story/everton-bid-farewell-to-goodison-park-in-final-mens-game-13370207",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-everton-goodison-park_6920451.jpg?20250518154731",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:56:00",
        "Headline": "Goodison Park has been home to the Everton men's team for the past 133 years but they are moving to a new stadium at Bramley-Moore Dock next season.",
        "Content": "Everton have bid farewell to Goodison Park with a 2-0 over Southampton in their final men's game at the ground. Sunday's Premier League fixture was the last at the \"Grand Old Lady\" for the men's side, which is moving to their new Hill Dickinson Stadium at Bramley-Moore Dock next season. It will remain under Everton ownership - after being saved from demolition and earmarked for the women's team from the summer. The streets around the stadium turned blue as fans lit flares ahead of kick-off on Sunday. So many supporters flocked to the ground in the hours before the game that a planned team welcome had to be cancelled. Iliman Ndiaye put the Toffees 1-0 ahead after just six minutes, scoring a second goal in first-half stoppage time. Tears were shed in the stands as the final whistle blew and chants broke out, supporters holding scarves in the air. Players past and present, including Wayne Rooney, joined manager David Moyes to soak up the atmosphere on the pitch. Goodison Park has been the home of the Everton men's side for 133 years. All 39,000 seats were taken for the game - with tickets reportedly being sold on resale sites for as much as £1,000 each."
    },
    {
        "title": "Luke Littler hits out at 'scum of the earth' vandals who targeted his van",
        "description": "Luke Littler's van was vandalised while he took part in a darts exhibition match, the world champion has revealed.",
        "url": "https://news.sky.com/story/luke-littler-vandals-target-darts-stars-van-during-match-13370145",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-luke-litter-van_6920107.jpg?20250518120012",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 09:57:00",
        "Headline": "The darts star reveals his van's rear window was smashed while he was playing an exhibition match in Norwich.",
        "Content": "Luke Littler's van was vandalised while he took part in a darts exhibition match, the world champion has revealed. The 18-year-old posted a photograph on social media on Saturday showing the vehicle's smashed rear view window. \"Just trying to do an exhibition in Norwich and this happens, absolute scum of the earth,\" he wrote on the Instagram story. Littler defeated rival Luke Humphries in the MODUS Icons of Darts event in the city this weekend. Humphries and Littler, currently ranked first and second in the world respectively, were joined by former world champions Phil Taylor and Raymond van Barneveld. Littler returned to his black Mercedes after the event to discover the rear window had been smashed. Sky News has approached Norfolk Constabulary for comment. Read more from Sky News:UK's negotiations with EU 'going to the wire'End of an era for English football stadium Littler became the youngest-ever darts world champion in January, aged 17, when he defeated Michael van Gerwen 7-3 in the final of the PDC's flagship event at Alexandra Palace. He had lost in the final the previous year. Littler first picked up a dart at 18 months old and is credited with supercharging the game's popularity."
    },
    {
        "title": "People do feel like strangers in Britain - but it's not just because of migration, polling finds",
        "description": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled.",
        "url": "https://news.sky.com/story/people-do-feel-like-strangers-in-britain-but-its-not-just-because-of-migration-polling-finds-13369073",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-immigration_6913886.jpg?20250512093918",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Reasons including the cost of living, the pandemic and working from home were all given as reasons why people are feeling more and more isolated, rather than what Sir Keir Starmer said.",
        "Content": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled. Some claimed this was a controversial and dangerous stance - drawing parallels with Enoch Powell's Rivers of Blood speech. But research released today suggests close to half of those in Great Britain feel like \"strangers\" in their own country. Politics latest: Follow live updates The survey, carried out by pollsters at More In Common, asked 13,464 people in Great Britain for their feelings on the matter. And what is even more surprising is that the survey was carried out over a month before Sir Keir's speech. The research is only being released today, and it is understood that Downing Street had not seen it before the prime minister's speech. \n                  UK has not asked about asylum return hubs, other Balkan countries say\n                 \n                  An embarrassment for Starmer on migrant return hubs?\n                 \n                  Sir Keir Starmer in talks with 'a number of countries' over return hubs for failed asylum seekers\n                 However it will likely be welcomed as a justification of a position aimed outside of Westminster.  Isolation linked to wealth The prime minister's concerns about Great Britain being an \"island of strangers\" was inextricably linked to rising immigration. But the research out today shows the isolation felt by many is strongly linked to wealth - with the poorest in the country more likely to feel like strangers. The cost of living was mentioned as a contributory factor by many of those asked. And when it comes to ethnic breakdown of those saying they feel like strangers, Asian or Asian British people were more likely than either white or black British people to say they felt separate. Amy, a teacher from Runcorn, told researchers that when \"your money's all going on your bills and the boring stuff like food and gas and leccy and petrol\" there is nothing left \"to do for ourselves\". Read more:Reform tops polls for first timeReform surge in estimated national vote Who is Starmer targeting?  Those who criticised Sir Keir for his \"strangers\" speech tended to accuse the prime minister of appealing to supporters of Reform or the Conservatives. Suspended Labour MP Zarah Sultana went as far as to claim the speech was a \"foghorn to the far right\". The analysis from More in Common found that people who supported Reform and the Conservatives last year are indeed much more likely to feel like strangers in the UK. While Labour, Lib Dem and Green supporters are all less likely to feel like strangers, around a third of them do still agree with the statement that they \"sometimes feel like a stranger in my own country\". And the polling also found that Reform and Conservative voters are much more likely to think that multiculturalism threatens national identity, while supporters of the other three parties tend to largely believe multiculturalism is a benefit. Across the board, supporters of all parties were more likely than not to think that everyone needs to do more to encourage integration between people of different ethnic backgrounds - and similarly a majority think it is everyone's responsibility to do so. Luke Tryl, the UK director of More in Common, said: \"The prime minister's warning that we risk becoming an 'island of strangers' resonates with millions who say they feel disconnected from those around them. \"But it would be a mistake to say that immigration and lack of integration are the sole causes of our fragmenting social fabric.\" John McDonnell, another former Labour MP, now suspended, told Sky News that having politicians \"exploit\" resentment fuelled by economic circumstance to shift \"the blame onto migrants just exacerbates the problem\". He said the government needs to \"tackle the insecurity of people's lives and you lay the foundations of a cohesive society\". With Reform now leading in the polls and the collapse of support for Sir Keir since becoming prime minister, it is unsurprising that what he says seems to match up with what turquoise voters feel. Work from home alone The post-pandemic shift to working from home and spending more time alone has also been blamed for an increased feeling of isolation. Ruqayyah, a support worker from Peterborough, said the shift to home offices had \"destroyed our young generation\". But there are many other reasons that people feel separate from the rest of their country. Read more:Internet may help older people's mental healthNo evidence of 'two-tier policing' in handling of Southport  Young people are less trusting of strangers, and there is also a deep discontent with the political system. Many think the system is \"rigged\" in favour of the wealthy - although this belief is less common the higher the level of education someone has completed. The tension that exploded during last year's riots are also highlighted, and many people are worried about religious differences - a situation exacerbated by foreign conflicts like in the Middle East and between India and Pakistan. The research was carried out alongside the campaign group Citizens UK and UCL. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Matthew Bolton, executive director of Citizens UK, said: \"We all saw what can happen last summer when anger and mistrust boil over and threaten the fabric of our society. \"The answers to this don't lie in Whitehall. \"By listening to people closest to the ground about what causes division and what builds unity in their neighbourhood, we can build a blueprint for cohesion rooted in local leadership and community power.\""
    },
    {
        "title": "Chelsea beat holders Manchester United 3-0 to win Women's FA Cup Final and complete the treble",
        "description": "Chelsea have beaten holders Manchester United to win the Women's FA Cup final 3-0 and complete a domestic treble.",
        "url": "https://news.sky.com/story/chelsea-beat-holders-manchester-united-3-0-to-win-womens-fa-cup-final-13370263",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chelsea-fa-cup-chelsea_6920534.jpg?20250518161207",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 13:55:00",
        "Headline": "No subtitle found",
        "Content": "Chelsea have beaten holders Manchester United to win the Women's FA Cup final 3-0 and complete a domestic treble. A Sandy Baltimore penalty on the stroke of half-time gave them a first-half lead, before Catarina Macario headed in the second in the 84th minute from a Baltimore free kick. The French player sealed a fantastic performance by lashing the ball home from close range in the first minute of stoppage time. The victory means Sonia Bompastor's side have added the FA Cup to their wins in the WSL and the League Cup. The Blues have had an invincible season, going unbeaten across all three domestic competitions. It completes a memorable first season for the French manager, who took over from Emma Hayes when she went to manage the US national side. Manchester United were still in with a chance of equalising until Brazilian star Macario struck late on. \n                  Gary Lineker to leave BBC next week and will no longer host World Cup coverage in 2026\n                 \n                  Post-Brexit EU reset negotiations 'going to the wire', says minister\n                 \n                  Teen arrested after Kayden Moy dies following 'disturbance' at beach in Ayrshire\n                 Ten minutes of added time meant a miracle comeback was also a distant possibility - but any hope was quickly snuffed out when Baltimore got her third. It was a different story last year, when Manchester United steamrollered Spurs 4-0 to lift the trophy. Read more from Sky News:Everton bid farewell to Goodison ParkBoy, 16, dies after 'disturbance' at beach \"It tops off a brilliant season,\" said Chelsea midfielder Erin Cuthbert. \"I'm so proud of the group. A lot of hard work's gone into this. \"To win in the fashion we did, we were holding on a bit at 1-0 but the second goal puts the game to bed.\""
    },
    {
        "title": "Man, 26, stabbed to death in northwest London",
        "description": "A murder investigation has been launched after a 26-year-old man was stabbed to death in northwest London.",
        "url": "https://news.sky.com/story/man-26-stabbed-to-death-in-northwest-london-13370184",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-police-tape-cordon_6091628.jpg?20230317102817",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:08:00",
        "Headline": "Police were called to reports of an altercation in Kingsbury in the early hours of Sunday and no arrests have made as yet.",
        "Content": "A murder investigation has been launched after a 26-year-old man was stabbed to death in northwest London. Police were called to reports of an altercation in Kingsbury Road, Kingsbury, shortly after 3.30am on Sunday. Officers found a man with a stab wound and he was taken to hospital but was later pronounced dead. His next of kin have been informed, with formal identification and a post-mortem examination still to take place. No arrests have been made, the Metropolitan Police said. Detective Chief Inspector Allam Bhangoo, who is leading the murder investigation, described the incident as \"tragic\". Read more from Sky News:Vandals target Luke Littler's vanUK's negotiations with EU 'going to the wire' \"We understand this incident will cause concern within the Kingsbury community, and we're grateful for their continued patience and cooperation,\" he said. \"Residents can expect to see an increased police presence in the area, along with a crime scene, as we carry out the early stages of our investigation.\""
    },
    {
        "title": "Nicusor Dan beats hard-right favourite George Simion in Romanian election",
        "description": "Pro-Western candidate Nicusor Dan has unexpectedly beaten hard-right populist George Simion in the Romanian election.",
        "url": "https://news.sky.com/story/exit-polls-from-romanian-election-suggest-surprise-win-for-pro-western-candidate-nicusor-dan-13370509",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nicusor-dan-romania_6921063.jpg?20250518203914",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-18 16:01:00",
        "Headline": "The result is a dramatic turnaround from the first round of voting a few weeks ago when Mr Simion was well ahead.",
        "Content": "Pro-Western candidate Nicusor Dan has unexpectedly beaten hard-right populist George Simion in the Romanian election. Mr Simion, 38, and his rival - a centrist who's mayor of Bucharest - faced off in the second round of the contest. According to the official tally, Mr Dan was leading by nearly nine percentage points with more than 98% of the votes counted. There aren't enough votes remaining for Mr Simion to make a comeback. After exit polls suggested he wasn't going to win, Trump-supporting Mr Simion rejected the result and said estimates put him 400,000 votes ahead. Speaking after voting ended, Mr Simion said his election was \"clear\" as he posted on Facebook: \"I won!!! I am the new President of Romania and I am giving back the power to the Romanians!\"  Romania's last election was annulled after its highest court ruled the leading candidate, nationalist Calin Georgescu, should be disqualified due to claims of electoral interference by Russia. The result is surprising because in the first round, 38-year-old Mr Simion, founder of the right-wing Alliance for the Unity of Romanians (AUR), took 40.96% of the vote - almost 20 points ahead. An opinion poll on Friday had it much closer, but still suggested the two men were virtually tied. Mr Dan, a 55-year-old mathematician, is running as an independent and has pledged to clamp down on corruption. He is also staunchly pro-EU and NATO, and has said Romania's support for Ukraine is vital for its own security. When voting closed on Sunday at 9pm local time, 11.6 million people - about 64% of eligible voters - had cast ballots. About 1.64 million Romanians living abroad also took part. Read more from Sky News: British surgeon in Gaza says it's now 'a slaughterhouse'Two die as ship crashes into Brooklyn Bridge The election is being closely watched across Europe amid a rise in support for President Donald Trump. After polls closed, Mr Dan said \"elections are not about politicians\" but about communities and that in the latest vote \"a community of Romanians has won, a community that wants a profound change in Romania\". \"When Romania goes through difficult times, let us remember the strength of this Romanian society,\" he said. \"There is also a community that lost today's elections. A community that is rightly outraged by the way politics has been conducted in Romania up to now.\""
    },
    {
        "title": "Israel to allow 'basic quantity of food' into Gaza to avoid 'starvation crisis'",
        "description": "Israel has said it will allow a \"basic quantity of food\" into the besieged enclave of Gaza to avoid a \"starvation crisis\" following a near three-month blockade.",
        "url": "https://news.sky.com/story/israel-to-allow-basic-quantity-of-food-into-gaza-to-avoid-starvation-crisis-13370724",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-khan-younis-gaza_6900703.jpg?20250429133818",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-18 20:14:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu's office has said some food would be allowed into Gaza, which has been under a complete blockade on humanitarian aid since 2 March, to avoid a \"starvation crisis\".",
        "Content": "Israel has said it will allow a \"basic quantity of food\" into the besieged enclave of Gaza to avoid a \"starvation crisis\" following a near three-month blockade. Israeli Prime Minister Benjamin Netanyahu's office said the decision was \"based on the operational need to enable the expansion of the military operation to defeat Hamas\". Gaza, where local authorities say more than 53,000 people have died in Israel's 19-month campaign, has been under a complete blockade on humanitarian aid since 2 March. It comes as global food security experts warn of famine across the territory and after a UN-backed report from last Monday which warned one in five people in Gaza were facing starvation.  The statement from the prime minister's office said it would \"allow a basic quantity of food to be brought in for the population in order to make certain that no starvation crisis develops in the Gaza Strip\". \"Such a crisis would endanger the continuation of Operation 'Gideon's Chariots' to defeat Hamas,\" it added. \"Israel will act to deny Hamas's ability to take control of the distribution of humanitarian assistance in order to ensure that the assistance does not reach the Hamas terrorists.\" \n                  Gaza at mercy of what comes next as Israel ramps up brutal offensive\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Israel and Hamas resume ceasefire talks after 'extensive strikes' on Gaza\n                  It comes after a British surgeon working in Gaza said in a video to Sky News the enclave is now \"a slaughterhouse\" amid Israeli bombardment. Israel has just ramped up its offensive in Gaza - where it's been conducting a military campaign in retaliation for 1,200 people killed and 251 taken hostage by Hamas on 7 October 2023 - with Palestinian health officials reporting at least 130 people were killed overnight into Sunday. Israel Defence Forces (IDF) confirmed troops had begun \"extensive ground operations throughout the northern and southern Gaza Strip\". The Hamas-run health ministry in Gaza said 464 people had died in Israeli military strikes in the week to Sunday. Read more:Gaza at mercy of what comes next'At least 93 killed' in Israeli strikes on Gaza on Friday In a statement on Sunday, IDF said its air force struck \"over 670 Hamas terror targets throughout the Gaza Strip to disrupt enemy preparations and support ground operations\" over the past week. Israel has launched an escalation to increase pressure on Hamas, seize territory, displace Palestinians to the south and take greater control over the distribution of aid."
    },
    {
        "title": "British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment",
        "description": "A British surgeon working in southern Gaza has compared the region to a \"slaughterhouse\" because of the daily bombardment from Israeli forces.",
        "url": "https://news.sky.com/story/british-surgeon-working-in-gaza-says-it-is-now-a-slaughterhouse-amid-israeli-bombardment-13370212",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-al-shifa_6920184.jpg?20250518124636",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-18 12:59:00",
        "Headline": "Dr Tom Potokar, who is based in southern Gaza, says he is treating \"awful explosive injuries\".",
        "Content": " A British surgeon working in southern Gaza has compared the region to a \"slaughterhouse\" because of the daily bombardment from Israeli forces. Dr Tom Potokar offered his assessment of the military offensive after Palestinian health officials reported at least 130 people were killed overnight into Sunday. Israel Defence Forces (IDF) confirmed troops had begun \"extensive ground operations throughout the northern and southern Gaza Strip\". In a video, Dr Potokar said it was \"another day of devastation here in Gaza\", adding: \"The stories coming from the north... absolutely horrific... particularly around the Indonesian Hospital. \"I mean, it's difficult to describe in words what's happening here... [with the] constant sound of bombardment jets overhead. \"If Cambodia was the killing fields, then Gaza now is the slaughterhouse.\" His reference to Cambodia's killing fields refers to when more than a million people were murdered in mass executions and buried by the extreme communist guerrilla group, the Khmer Rouge, under Pol Pot, between 1975 and 1979. The Hamas-run health ministry in Gaza said 464 people had died in Israeli military strikes in the week to Sunday. In a statement on Sunday, IDF said its air force struck \"over 670 Hamas terror targets throughout the Gaza Strip to disrupt enemy preparations and support ground operations\" over the past week. Dr Potokar described the impact on those on the ground, saying: \"We've been operating all morning so far and [treating] awful explosive injuries... [including] one young woman with leg fracture and shoulder fracture and a large wound on her buttock, who came in yesterday and is not yet aware that everyone in our family was killed in the onslaught.\" Israel has launched an escalation to increase pressure on Hamas, seize territory, displace Palestinians to the south and take greater control over the distribution of aid.  On Sunday, it announced and launched \"extensive\" new ground operations in Gaza. It came after airstrikes killed at least 130 people, including dozens of children, overnight and into Sunday, hospitals and medics said, and forced northern Gaza's main hospital to close. A spokesperson for the Hamas-run health ministry said: \"Complete families were wiped off the civil registration record by Israeli bombardment.\" The ministry also said the attacks had forced the closure of the Indonesian Hospital, the main hospital serving people in northern Gaza. Nasser hospital, in the southern city of Khan Younis, said more than 48 people - mostly women and children - were killed in the area which includes tents sheltering displaced people. In Deir al Balah, in central Gaza, at least 12 people were killed in three separate strikes, according to Al Aqsa Martyrs Hospital and the Nuseirat camp's Awda Hospital. Meanwhile, the Gaza health ministry and the Palestinian Civil Defence - which operates under the Hamas-run government - reported that 19 people were killed in several strikes in Jabalia in northern Gaza. The Israeli military had no immediate comment on the strikes. Read more from Sky News:How Israel has escalated Gaza bombing campaign Ceasefire talks are taking place in Qatar this weekend - with Israel saying they involve discussions on ending the war as well as a truce and hostage deal. A statement from the office of Israeli Prime Minister Benjamin Netanyahu said any lasting truce must include the demilitarisation of Gaza as well as the exile of Hamas militants. But a senior Israeli official added there had been little progress so far during talks in Qatar's capital Doha. Sky News Arabia reported Hamas had proposed freeing about half its Israeli hostages in exchange for a two-month ceasefire and the release of Palestinian prisoners held by Israel. A Palestinian official close to the discussions said: \"Hamas is flexible about the number of hostages it can free, but the problem has always been over Israel's commitment to end the war.\""
    },
    {
        "title": "Gaza at mercy of what comes next as Israel ramps up brutal offensive",
        "description": "It has been a brutal week in Gaza, hundreds have been killed as Israel has carried out waves of \"preliminary\" strikes ahead of a bigger offensive.",
        "url": "https://news.sky.com/story/gaza-at-mercy-of-what-comes-next-as-israel-ramps-up-brutal-offensive-13370380",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-deir-al-balah-gaza_6920171.jpg?20250518122828",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-05-18 15:02:00",
        "Headline": "Forcing two million Gazans into a small area around Rafah will make an already dire humanitarian crisis significantly worse, for which Israel will be blamed.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  It has been a brutal week in Gaza, hundreds have been killed as Israel has carried out waves of \"preliminary\" strikes ahead of a bigger offensive. The ground manoeuvre has now begun. The strategy is to \"conquer\" and then hold territory - some in the Israeli government say permanently. But having repeatedly said the war will continue until \"total victory\", the Israeli government has narrowed its options and set down a path of prolonged fighting. Unless they can agree a ceasefire and hostage deal with Hamas then their only hope to rescue and retrieve the hostages is through military means, a strategy which hasn't produced many results in the past 19 months. But as long as Israel threatens to continue fighting, there is no incentive for Hamas to release the hostages, its only remaining card to play. Conquering and then occupying territory means Israeli soldiers will at some point have to stand still and defend ground: that is always a vulnerable military position to be in. \n                  Israel to allow 'basic quantity of food' into Gaza to avoid 'starvation crisis'\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Israel and Hamas resume ceasefire talks after 'extensive strikes' on Gaza\n                 Hamas might have been destroyed to the point where it no longer poses a real danger to Israel, but there will always be someone ready to fight. Just ask British or American soldiers who served in Iraq or Afghanistan. Only political agreements end insurgencies. Forcing two million Gazans into a small area around Rafah will make an already dire humanitarian crisis significantly worse, for which Israel will be blamed. Read more from Sky News:'At least 93 killed' in Israeli strikes on Gaza on FridayBritish surgeon working in Gaza says it is now 'a slaughterhouse' And there is even scepticism within Israel itself that this is the right strategy. Hostage families fear that this operation will risk the lives of the twenty hostages believed to be still alive and there are multiple reports in Israeli media that IDF commanders don't believe they can achieve what the government is demanding of them. And yet any retreat from the offensive now will be perceived as a failure and even surrender, particularly by far-right politicians who remain vital to the existence of Prime Minister Benjamin Netanyahu's coalition. The routes to a truce are vanishing, and Gaza is at the mercy of what comes next."
    },
    {
        "title": "Russia launches 'heaviest drone attack' on Ukraine since start of war",
        "description": "Russia has launched its heaviest drone attack on Ukraine since the start of the war in 2022, the Ukrainian military has said.",
        "url": "https://news.sky.com/story/russia-launches-heaviest-drone-attack-on-ukraine-since-start-of-war-13370104",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-kyiv_6920050.jpg?20250518090754",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-18 07:51:00",
        "Headline": "A total of 273 exploding drones were fired across the Kyiv, Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning, the Ukrainian air force says.",
        "Content": " Russia has launched its heaviest drone attack on Ukraine since the start of the war in 2022, the Ukrainian military has said. A total of 273 exploding drones were reportedly fired across the Kyiv, Dnipropetrovsk and Donetsk regions between Saturday night and Sunday morning. Some 88 were intercepted and 128 \"lost\", having been electronically jammed, Ukraine's air force said. It passes the previous record of 267 drones on the eve of the war's third anniversary earlier this year. In Kyiv, a 28-year-old woman was killed, and three people, including a four-year-old child were injured, according to regional governor Mykola Kalashnyk. Just outside the city, firefighters fought to control flames at business premises destroyed by drone attacks. Russia has not commented. It comes ahead of a planned phone call between US President Donald Trump and his Russian counterpart Vladimir Putin. Mr Trump has promised to speak to Mr Putin and then President Volodymyr Zelenskyy on Monday about \"ending the war\" after the first direct talks between their two countries failed to yield a ceasefire this week. Mr Putin snubbed Mr Zelenskyy's offer of face-to-face talks in Turkey.  A source from the Ukrainian negotiation team told Sky News that Russia threatened \"eternal war\" during talks between officials. Kremlin representatives are also reported to have threatened that Ukraine may lose \"more than just loved ones\" while at the negotiating table. Talks did bring promise of the largest ever prisoner swap between the two nations - involving 1,000 prisoners of war on each side. Ukraine's military intelligence chief said he hoped it would take place over the next week. Read more from Sky News:Chilling moment in Ukraine-Russia talksMeet the pro-Trumper that could be Romania's presidentEverything you need to know about Poland's elections  Elsewhere in Sumy, northeastern Ukraine, on Saturday, nine people were killed and seven injured after a bus evacuating civilians was hit by a Russian drone in the town of Bilopillia, according to Ukrainian officials. On Sunday, Mr Zelenskyy was in Vatican City attending the inauguration of Pope Leo XIV. He was pictured shaking hands with US Vice President JD Vance after their tense clash at the White House earlier this year."
    },
    {
        "title": "Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win",
        "description": "This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government.",
        "url": "https://news.sky.com/story/easing-trade-and-signing-a-defence-pact-would-be-manifesto-promises-delivered-and-starmer-could-use-a-win-13370762",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Sir Keir Starmer promised in his election manifesto that the UK would sign a new security pact with the EU and improve the trading relationship with the continent. Monday is set to be when the PM makes good on those promises.",
        "Content": "\n          Political editor\n              @BethRigby\n  This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government. The Labour leader promised in his 2024 election manifesto that the UK would sign a new security pact with the EU to strengthen cooperation and improve the UK's trading relationship with the continent. Since winning power in July, he has embarked on a charm offensive across European capitals in a bid to secure that better post-Brexit deal. Monday is set to be when the PM makes good on those promises at a historic summit at Lancaster House in London. Read more: What exactly could the UK-EU reset look like?  There, the EU and UK are expected to sign a security and defence partnership, which has taken on a new sense of urgency since the arrival of President Trump in the White House. It is an agreement that will symbolise the post-Brexit reset, with the PM, European Commission president Ursula von der Leyen and European Council president Antonio Costa are also expected to sign off on a communique pledging deeper economic cooperation. \n                  Post-Brexit EU reset negotiations 'going to the wire', says minister\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 But, rather like the torturous Brexit negotiations I covered for years in London and Brussels under Conservative prime ministers, Sir Keir's post-Brexit reset talks are going down to the wire. As of 10.30pm on Sunday, discussions were set to continue overnight, the two sides snared up over details around fisheries, food trade and youth mobility. It's not that both sides don't want the reset: the war in Ukraine and the spectre of the US becoming an unreliable partner have pushed London and Brussels closer together in their common defence interest. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 Fishing and youth mobility - the two snags But the pressure for this deal weighs more heavily on our prime minister than his European colleagues. He's been talking for months about securing a reset and better trading relationship with the EU to bolster the UK economy. His need to demonstrate wins is why, suggests one continental source, the Europeans are letting talks go to the wire, with London and Brussels in a tangle over fishing rights - key demands of France and the Netherlands - and a youth mobility scheme, which is a particular focus for Berlin. \"The British came with 50 asks, we came with two - on fishing and the youth mobility scheme,\" says one European source. The EU is asking for longer-term access to UK fishing grounds - a 10-year deal - which the British government has rebuffed, insisting it will not go beyond a four-year deal. In response, Brussels is saying it will not lift regulatory checks on food, agricultural and animal products unless the UK moves on fishing. This has left the two sides at an impasse. EU sources say Brussels had offered a time-limited deal to lift checks on animal products - replicating London's offer on fisheries - but the UK is reluctant to do this as it leaves too much uncertainty for farmers and supermarkets. Scotland election weighing on talks A deal on food products, known as sanitary and phytosanitary (SPS) goods, would be a boost for the economy, with potentially up to 80% of border checks disappearing, given the breadth of products - paint, fashion goods, leather as well as foods - with an animal component. Any deal would also mean the UK would have to align with rules made in Brussels and make a financial contribution to the EU to fund work on food and animal standards. Both elements will trigger accusations of Brexit \"betrayal\", as the UK signs up as a \"rule taker\" and finds itself paying back into the EU for better access. Government figures had been telling me how they were more than prepared to face down the criticisms likely to be thrown at them from the Conservatives. But sensitivities around fishing, particularly in Scotland, where Labour is facing elections next year, have weighed on talks. Read more from Sky News:UK has not asked about asylum return hubs, other Balkan countries say'Ouch': Starmer condemned for telling MP 'she talks rubbish'Joe Biden diagnosed with 'aggressive' form of prostate cancer The other area of huge tension is over a youth mobility scheme, which would enable young adults from member states to study and work in the UK and vice versa. Government sources familiar with the talks acknowledge some sort of scheme will happen, but want details to be vague - I'm told it might be \"an agreement about a future agreement\", while the EU sees this a one of its two core demands.  In talks late on Sunday night, the UK government appeared to be softening on re-opening the pre-Brexit Erasmus student exchange scheme as perhaps a way to get around the impasse, according to one EU source. The UK rejoining this scheme had been rebuffed by Sir Keir last year, but was raised again last night in talks, according to a source. Common ground on defence and security Wherever the economic horsetrading lands, the two sides have found common ground in recent months is on defence and security, with the UK working in lockstep with European allies over Ukraine and relationships deepening in recent months as Sir Keir Starmer has worked with President Macron and others to try to smooth tensions between Kyiv and Washington and work on a European peace deal for Ukraine. If details on trade, youth mobility and fisheries are fudged on Monday, the expectation is that the two sides will sign a security partnership that will reiterate the UK's commitment to build up the continent's defence capability and stand united against Russian aggression with its partners.  The deal should also mean British arms companies will be able to access the EU's €150bn rearmament programme, which has been set up to create a massive surge in defence spending over the next five years as Europe prepares itself to better repel threats. As I write this, talks are ongoing, but it is clearly in neither side's interest for Monday to go wrong. The EU and UK need to maintain a united front and, more importantly for Keir Starmer domestically, the PM needs to show an increasingly sceptical public he can deliver on his promises. Easing trade barriers with Britain's biggest trading partner and signing an EU defence pact would be two manifesto promises delivered. And with his popularity sinking to a record low in recent days, he could really do with a win."
    },
    {
        "title": "A hug from the Pope's brother underlined just how much Leo's life has changed",
        "description": "Under the Roman sun, a pope greeted his people.",
        "url": "https://news.sky.com/story/a-hug-from-the-popes-brother-underlined-just-how-much-leos-life-has-changed-13370356",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pope-brother-pope-leo_6920522.jpg?20250518161041",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-05-18 14:51:00",
        "Headline": "Amid all the symbolism and ceremony, it was perhaps the hug with his brother Louis that underlined just how much Pope Leo's life has changed. A cardinal from Chicago is now one of the most powerful leaders in the world.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Under the Roman sun, a pope greeted his people. Through the tens of thousands gathered in St Peter's Square, Leo XIV made his way. Pope Leo's inaugural mass - as it happened Riding in an open-top Popemobile, the 267th pontiff looked relaxed as he smiled and waved at the faithful. Every now and then he would stop to bless babies in the crowd who were passed up to him by their delighted parents. People wearing the flags of countries from every corner of the world held up phones as he passed, desperately hoping to capture the historic moment. The joy and exhilaration were palpable. Then after the excitement, there was a moment of reflection as Leo XIV prayed at the tomb of the first ever pope, St Peter, before retracing the journey of pontiffs past and making his way to the outside altar. In front of princes, presidents, and the public, Leo received the symbols of the papacy: first the pallium was laid around his shoulders and then the fisherman's ring placed on his finger. The person who had that honour was the Filipino cardinal Luis Antonio Tagle, a man who just over a week ago many thought would be standing in Leo's place. It was at this point the enormity of the moment seemed to hit home as the new pontiff stared at the ring on his finger and perhaps pondered the weight of responsibility he had been given as the leader of 1.4 billion Catholics worldwide.  And what type of leader will he be? His inaugural mass gave some hints through the homily of a seemingly humble man. \"I was chosen, without any merit of my own, and now, with fear and trembling, I come to you as a brother, who desires to be the servant of your faith and your joy,\" he told the masses. Again, Leo presented himself as a pontiff pledging to sow peace and unity, and critical of economic systems that marginalise the poor. Read more:Who is Pope Leo XIV?Pope Leo condemns 'religious propaganda'  The Pope then prepared the holy communion, while the crowd shook hands and offered each other the sign of peace. And that message of peace was one he would return to at the end of the mass. \"We cannot forget our brothers and sisters who are suffering because of war. \"In Gaza, the surviving children, families, and elderly are reduced to starvation. In Myanmar, new hostilities have cut short innocent young lives. \"Finally, war-torn Ukraine awaits negotiations for a just and lasting peace,\" the Pope said. Message of peace impressed on VIPs No doubt peace was a point Leo also emphasised to waiting VIPs. Among those he greeted after the mass were US vice president JD Vance and the president of Israel. Ukrainian President Volodymyr Zelenskyy was granted a special private meeting with the pontiff and later posted on X about it. \"We thank the Vatican for its willingness to serve as a platform for direct negotiations between Ukraine and Russia,\" he said. Amid all the symbolism and ceremony, it was perhaps the hug with his brother Louis that underlined just how much Leo's life has changed. A cardinal from Chicago is now one of the most powerful leaders in the world. As the crowd celebrated this historic day, the Pope appeared to be already contemplating the challenges ahead - the daunting task of trying to bring unity to an increasingly divided world."
    },
    {
        "title": "Pope Leo vows to resist 'temptation to be an autocrat' and condemns 'religious propaganda' at inauguration",
        "description": "Pope Leo XIV promised to resist the \"temptation to be an autocrat\" and not to rule by \"religious propaganda\" as he was officially inaugurated at the Vatican.",
        "url": "https://news.sky.com/story/pope-leo-vows-to-resist-temptation-to-be-an-autocrat-and-condemns-religious-propaganda-at-inauguration-13370136",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pope-pope-leo-inauguration_6920100.jpg?20250518104440",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-18 09:26:00",
        "Headline": "The pontiff, 69, greeted leaders from around the world, including Ukraine's President Volodymyr Zelenskyy, as tens of thousands gathered at the Vatican.",
        "Content": " Pope Leo XIV promised to resist the \"temptation to be an autocrat\" and not to rule by \"religious propaganda\" as he was officially inaugurated at the Vatican. Around 200,000 people gathered alongside cardinals and world leaders in St Peter's Square on Sunday to witness the pope's inaugural mass. Follow latest: Pope meets Zelenskyy after inauguration Pontificating across the piazza in Vatican City, the Pope declared that \"we still see too much discord\" and \"too many wounds\" as a result of \"hatred, violence, prejudice\", as well an \"economic paradigm that exploits the Earth's resources and marginalises the poorest\". He paid tribute to his predecessors Pope Francis, who died on 21 April, and Pope Leo XIII, who was head of the Catholic Church from 1878 to 1903.  The American pontiff, 69, said the authority of the Catholic Church should never be a \"question of capturing others by force, by religious propaganda, or by means of power\".  Instead, he said he would seek to govern the world's 1.2 billion Catholics \"without ever yielding to the temptation to be an autocrat\". \"I would like that our first great desire be for a united church, a sign of unity and communion, which becomes a leaven for a reconciled world,\" he said during his homily. Ukraine's President Volodymyr Zelenskyy was among the queue of world leaders invited to shake hands with the Pope after his inaugural address. The pair had a separate meeting in private on Sunday afternoon, with the president posting pictures on X with the caption: \"For millions of people around the world, the Pontiff is a symbol of hope for peace. The authority and voice of the Holy See can play an important role in bringing this war to an end.\" Mr Zelenskyy was also seen shaking hands with US Vice President JD Vance as they took their seats before the proceedings got under way - after their dramatic clash at the White House in February. The UK was represented by Prince Edward, Duke of Edinburgh, Deputy Prime Minister Angela Rayner and Foreign Secretary David Lammy. Peruvian President Dina Boluarte was also given a front-row seat, with Pope Leo a joint US-Peruvian citizen. The pontiff first prayed at the tomb of St Peter, considered to be the first pope, under the basillca's main altar. He was then presented with the two most important symbols of the papacy - the lambswool stole, also known as the pallium, and the fisherman's ring. Read more Sky News:Pope Leo prays at predecessor's tombHow voting for the new pope unfoldedWho is Pope Leo XIV? The pallium was draped across his shoulders and symbolises the pastor carrying his flock as the pope carries the faithful. The ring, which is now the pope's official seal, is a nod to Jesus's call to Peter the apostle to cast his fishing net. Leo began the day by riding through adoring crowds on his \"popemobile\". There were cries of \"Viva Il Papa\" - meaning \"long live the pope\" - as US and Peruvian flags were waved. The Pope stopped to lift a baby passed to him by his family - and placed his hand on the head of another. Vatican City authorities were expecting 250,000 people, with big screens erected at various points to allow worshippers to watch the proceedings."
    },
    {
        "title": "Former US president Joe Biden diagnosed with 'aggressive' form of prostate cancer",
        "description": "Former US president Joe Biden has prostate cancer, his office has said.",
        "url": "https://news.sky.com/story/former-president-joe-biden-diagnosed-with-aggressive-form-of-prostate-cancer-13370723",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-biden-white-house_6800851.jpg?20250116044700",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-18 20:04:00",
        "Headline": "The former president was diagnosed with prostate cancer, characterised by a Gleason score of 9 - which Cancer Research UK says means the cells \"look very abnormal\" and the disease is \"likely to grow quickly\".",
        "Content": " Former US president Joe Biden has prostate cancer, his office has said. Mr Biden, 82, who left the White House in January, was seen by doctors last week for urinary symptoms. He was later diagnosed with prostate cancer, with the cancer cells having spread to the bone. His office said in a statement: \"Last week, President Joe Biden was seen for a new finding of a prostate nodule after experiencing increasing urinary symptoms. \"On Friday, he was diagnosed with prostate cancer, characterised by a Gleason score of 9 (Grade Group 5) with metastasis to the bone. \"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive which allows for effective management. \"The President and his family are reviewing treatment options with his physicians.\" \n                  Weight loss jabs could almost halve risk of obesity-related cancers beyond slimming down, study suggests\n                 \n                  New tech promises faster diagnosis for millions of cancer patients\n                 \n                  Blood test that can detect 12 common cancers to be trialled on NHS\n                 According to Cancer Research UK, a Gleason score of 9 means the cancerous cells \"look very abnormal\" and the disease is \"likely to grow quickly\". Dr Imran Ahmad, professor of urological oncology at the University of Glasgow, told Sky News on Sunday evening that prostate cancer is \"very common\" for men in their 80s. \"If you biopsy 10 men of Joe Biden's age, eight would have prostate cancer,\" he said. \"But I would argue that maybe seven of those men would have low-risk prostate cancer that we could just watch, and that they would die of. \"Whereas Joe Biden's is obviously a very aggressive form that - if he is otherwise fit - will be what he dies of.\" Health correspondent Joe Biden's prostate cancer is one of the most aggressive forms of the disease.  Prostate cancers are rated with a Gleason score. This measures on a scale of one to 10 how the cancerous cells look compared with normal cells. His score is nine. It has been given a Grade Group of 5 - the highest. That means the cancer has poor differentiation from normal cells and will grow rapidly. It has already spread to his bones. Metastasised cancer is harder to treat than cancer that stays in one place because it's spread around the body, making it harder for drugs to reach and destroy all the tumours.  But there is some hope from Biden's medical team. They say his cancer appears to be hormone sensitive. When prostate cancers need hormones to grow, targeted therapy can deprive these tumours of these hormones, making treatment more effective. Prostate cancer is one of the most common cancers in men. In the UK, it accounts for around a quarter of all male cancer cases.  In the US, it's also one of the most common, second only to skin cancer. It mostly affects men over the age of 50 and becomes more common with age. A source familiar with Mr Biden and his family's thinking told Sky's US partner network NBC News that the former president is considering \"multiple treatment options\" - including hormone treatment for the cancer. They added he is at his home in Wilmington, Delaware, and that as of now, it is unclear where the former president will be treated. In a statement on social media, former president Barack Obama said: \"Michelle and I are thinking of the entire Biden family. \"Nobody has done more to find breakthrough treatments for cancer in all its forms than Joe, and I am certain he will fight this challenge with his trademark resolve and grace. We pray for a fast and full recovery.\" President Donald Trump also posted on Truth Social that he was \"saddened\" by the news, adding: \"We extend our warmest and best wishes to Jill and the family, and we wish Joe a fast and successful recovery.\" Mr Biden was the oldest person to ever serve as president, with concerns about his health raised regularly during his campaign for re-election last year. After a poor debate against Mr Trump in June, he withdrew from the 2024 election and endorsed his vice president Kamala Harris. Read more from Sky News:Gary Lineker to leave BBC next weekPro-West candidate wins Romanian election Ms Harris wrote on X: \"We are keeping him, Dr. Biden, and their entire family in our hearts and prayers during this time. \"Joe is a fighter - and I know he will face this challenge with the same strength, resilience, and optimism that have always defined his life and leadership. We are hopeful for a full and speedy recovery.\" Hillary Clinton also posted on social media that she is \"thinking of the Bidens as they take on cancer, a disease they've done so much to try to spare other families from\". Prime Minister Sir Keir Starmer said in a statement: \"I am very sorry to hear President Biden has prostate cancer. \"All the very best to Joe, his wife Jill and their family, and wishing the President swift and successful treatment.\" In February 2023, he had a skin lesion removed from his chest that was a basal cell carcinoma, a common form of skin cancer."
    },
    {
        "title": "Mexican navy ship crashes into New York's Brooklyn Bridge - two dead and others injured",
        "description": "A Mexican navy ship has crashed into New York's Brooklyn Bridge, leaving two crew members dead and at least 17 other people injured.",
        "url": "https://news.sky.com/story/mexican-navy-training-vessel-hits-new-yorks-brooklyn-bridge-13370050",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-brooklyn-bridge-mexican-navy_6919987.jpg?20250518033915",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-18 02:29:00",
        "Headline": "Video showed the Cuauhtemoc, a Mexican navy training vessel, travelling in reverse and masts snapping as they hit the underside of the bridge.",
        "Content": " A Mexican navy ship has crashed into New York's Brooklyn Bridge, leaving two crew members dead and at least 17 other people injured. The Mexican navy said in a post on X that the Cuauhtemoc, an academy training vessel with 277 people on board, was damaged in the collision. Video posted online showed the ship, which was flying a large Mexican flag, travelling in reverse and hitting the underside of the bridge. It sheared the top of its masts and drifted towards the Brooklyn side of the East River as onlookers scrambled away from shore. Naval cadets dressed in white uniforms could be seen dangling from the ship's crossbeams after the crash. New York City mayor Eric Adams said two people had died and 17 others were injured, including two who were in a critical condition. Witnesses said they saw two people removed from the ship on stretchers. No one is thought to have fallen into the water. The 147ft (45m) masts were too tall to clear the arched bridge and toppled when the vessel, named after the last Aztec emperor, sailed in reverse underneath. It was unclear what caused the ship to veer off course. New York police chief Wilson Aramboles said the ship had just left a Manhattan pier and was supposed to have been headed out to sea, not towards the bridge. He said an initial report suggested the vessel lost power due to a mechanical problem. Police commissioner Jessica Tisch said the National Transportation Safety Board would be taking over the investigation. Mr Adams said a \"unified effort\" was under way to \"make sure that we look after all of those who were on the ship\". The bridge, which is a main conduit between Manhattan and Brooklyn, has since reopened with no major damage. The Cuauhtemoc is about 297ft (90m) long and 40ft (12m) wide, according to the Mexican navy. It was built in Spain and sailed for the first time in 1982. Each year, it sets out at the end of classes at the naval military school to finish cadets' training. It left the Mexican port of Acapulco, on the Pacific coast, on 6 April with 277 people onboard, the navy said at the time. Read more:'Mass casualty event' as tornadoes hit parts of USTeenager in 'continuous pain' after 'inappropriate' operations The Mexican consulate said on social media last week that the Cuauhtemoc - also dubbed the \"Ambassador and Knight of the Seas\" - arrived in New York on 13 May. The ship was scheduled to visit 22 ports in 15 countries, including Kingston in Jamaica, Havana in Cuba, Cozumel back in Mexico, and New York. It also had planned to sail to Reykjavik in Iceland, Bordeaux, Saint Malo and Dunkirk in France, Aberdeen in Scotland and other locations for a total of 254 days, 170 of them at sea."
    },
    {
        "title": "Sean 'Diddy' Combs: What it was like to follow 'the Pied Piper of partying'",
        "description": "In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.&#160;",
        "url": "https://news.sky.com/story/sean-diddy-combs-what-it-was-like-to-follow-the-pied-piper-of-partying-13370508",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-diddy-combs-trial_6914836.jpg?20250513093531",
        "type": "US",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Magazine editor Amy DuBois Barnett describes Sean \"Diddy\" Combs as \"the Pied Piper… of the most elite level of partying\" in the 1990s and early 2000s.",
        "Content": "\n          Arts and entertainment correspondent\n        In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.  Now on trial in Manhattan, his hair grey, his beard grown, it's hard to imagine that he was \"the Pied Piper… of the most elite level of partying of that time\" - but that's how Amy DuBois Barnett describes him. She was the first Black-American woman to run a major mainstream magazine in the US, and based in Manhattan at a time when hip hop was at its zenith. \"Urban culture really ran the city,\" she says. \"That's where so much of the money was… you had all the finance bros trying to get into Puffy (Combs) parties, all the fashion executives trying to get into Puffy parties.\" And while he was welcomed by the highest echelons of the arts and entertainment world, she says: \"He was never known for being a calm kind of individual.\" Combs was \"very dismissive\" with her, and she admits: \"Puff never particularly liked me that much.\" But DuBois Barnett would often get invited to his parties because she was able to feature his up-and-coming artists in her magazines. From editor-in-chief of Ebony magazine, she'd go on to become the editor-in-chief of Honey and Teen People magazines, and then deputy editor of Harper's Bazaar. She says the man she met at those parties \"lacked warmth\" and seemed \"complicated\". Read moreCassie finishes her court evidenceNine revelations from Cassie's time in courtWhat we know about the jurors in Diddy's trial \"When he walked in the room, all of the energy changed. Puffy had his trusted individuals around him… immediately the area around him would become kind of crowded with everybody vying for his attention,\" she says. \"I think that was also partially why he didn't particularly like me because I wasn't really vying for his attention. \"He really reserved that attention for the people that he was either attracted to… or the people that he thought were important enough to his business success.\" She says it was common knowledge that he wasn't someone to cross due to \"rumours... of what he could do\". \"There were a lot of people within journalism, within media, within other industries that were afraid of his influence and also afraid of his temper,\" she adds. \"When things at parties would not go his way or somebody didn't bring him something quickly enough, or… the conversation wasn't going his way… he would just kind of snap and he was just not afraid to yell at whoever was there. \"There was not a lot of boundaries in his communication, let's just put it that way.\" But she says it was a time when a tremendous amount of misogyny was running throughout music, things that in today's culture would certainly give pause for thought. \"So many things happened to me, everything from getting groped at parties to getting locked in a limousine with music executives and having him refuse to let me out until I did whatever he thought I was going to do, which I didn't.\" She insists: \"We didn't have the vocabulary to understand the degree to which it was problematic... it was a thread that ran throughout the culture.\" Star-studded parties were the ultimate invite At the time, a ticket to one of Combs's star-studded \"white parties\" was the ultimate invite. She admits: \"It was like nothing you've ever seen before… the dress code was very strict. \"No beige, no ecru, absolutely white, you would literally be turned away if your outfit was wrong. Puffy did not sort of tolerate people in his parties that didn't look 'grown and sexy' as it were.\" She says people would mingle by the poolside listening to the best DJs in the world, while topless models posed dressed as mermaids and waiters handed out weed brownies from silver platters. \"It was every boldface name you could possibly imagine, just this gorgeous crowd.\" Behind the glamour, prosecutors now allege there was a man capable of sexual abuse and violence, and a serious abuse of power. Criminal charges which he's already pleaded not guilty to and strenuously denies. Without question, Combs had the golden touch. Expanding his music career into business enterprises that in 2022 reportedly took his net worth to around £1bn. For decades his success story was celebrated. \"I think that in the black community, there is a feeling that if a black man is successful you don't want to bring him down because there are not that many… these are cultural forces that are rooted in the systemic racism that's present in the United States… but I think that these were part of what potentially protected Puffy against people speaking out.\" Couple became 'isolated and very unhappy' While Combs had amassed a small fortune over the course of two decades which she encountered him, the former magazine editor says his behaviour had markedly changed from the first party she went to, to her last. \"The last was a post-Grammys party, in 2017 or 2018, and just the vibe was very different. He was really kind of isolated in a corner with Cassie, you know, looking very unhappy.\" For around 10 years, Combs had a relationship with the singer Cassie Ventura which ended in 2018. Once over she filed a lawsuit that both parties eventually settled alleging she was trafficked, raped, drugged and beaten by the rapper on many occasions - which he denied. Last week she made similar claims in court. \"Cassie looked very glassy-eyed and there was a sadness about her energy. Whatever was happening between the two of them, I mean, it didn't feel positive,\" says DuBois Barnett. \"They were sort of holed up in the corner for almost the entire night… it did feel very different from the kind of jubilant of energy that he projected in his earlier incarnations.\" For Combs, his freedom depends on how these next few weeks go. His representatives claim he is the victim of \"a reckless media circus\", saying he categorically denies he sexually abused anyone and wants to prove his innocence. In particular, they say, he looks forward to establishing the \"truth... based on evidence, not speculation\"."
    },
    {
        "title": "Music video streamer ROXi lands backing from US broadcasters",
        "description": "A music video-streaming service whose shareholders include the U2 bassist Adam Clayton will this week announce that it has sealed a management buyout after months of talks.",
        "url": "https://news.sky.com/story/music-video-streamer-roxi-lands-backing-from-us-broadcasters-13370155",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-adam-clayton-u2_6920091.jpg?20250518103213",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-18 10:26:00",
        "Headline": "A media company backed by the U2 bassist Adam Clayton has sealed a management buyout with new investment from US broadcasters Sinclair and Gray Media, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A music video-streaming service whose shareholders include the U2 bassist Adam Clayton will this week announce that it has sealed a management buyout after months of talks. Sky News understands that the assets of MagicWorks, which trades as ROXi, have been sold to a new company called FastStream Interactive (FSI), with backing from two major US-based broadcasters. Sources said that Nasdaq-listed Sinclair and New York Stock Exchange-listed Gray Media were among the new shareholders in FSI, with the launch of new interactive TV Channels in the US expected to take place shortly. The deal, which has involved raising millions of pounds of new equity from new and existing investors, has resulted in previous creditors of the business being repaid in full, according to the sources. Its search for funding from the US was seen as vital because of the programme to roll out its FastScreen technology. Founded in 2014, ROXi described itself as the world's first 'made-for-television' service, allowing viewers to stream millions of songs and download hundreds of thousands of karaoke tracks. Its broadcast channels allow viewers to skip through content in which they have no interest. \n                  Money blog: Why gold spike means you need to update your home insurance\n                 \n                  Concierge firm founded by Queen's nephew hunts buyer\n                 \n                  Superstar Adele joins backers of music royalties platform Audoo\n                 Simon Cowell, Kylie Minogue and Robbie Williams were among the prominent music industry figures who had previously been named as ROXi investors. Financiers including Guy Hands and Jim Mellon are said to be part of the new ownership structure. In response to an enquiry from Sky News, Rob Lewis, FSI chief executive, said: \"The new technology, FastStream, will revolutionise broadcast TV. \"For the first time in history, consumers tuning into a normal TV channel will find they automatically start at the beginning of the programme, and that they are able to skip, pause or search, even though they are watching normal broadcast TV\". Begbies Traynor Group, the professional services firm, and Rockefeller Capital Management advised on the process."
    },
    {
        "title": "Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win",
        "description": "This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government.",
        "url": "https://news.sky.com/story/easing-trade-and-signing-a-defence-pact-would-be-manifesto-promises-delivered-and-starmer-could-use-a-win-13370762",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Sir Keir Starmer promised in his election manifesto that the UK would sign a new security pact with the EU and improve the trading relationship with the continent. Monday is set to be when the PM makes good on those promises.",
        "Content": "\n          Political editor\n              @BethRigby\n  This EU-UK summit has for months been openly billed by Sir Keir Starmer's Downing Street as a hugely significant moment for this government. The Labour leader promised in his 2024 election manifesto that the UK would sign a new security pact with the EU to strengthen cooperation and improve the UK's trading relationship with the continent. Since winning power in July, he has embarked on a charm offensive across European capitals in a bid to secure that better post-Brexit deal. Monday is set to be when the PM makes good on those promises at a historic summit at Lancaster House in London. Read more: What exactly could the UK-EU reset look like?  There, the EU and UK are expected to sign a security and defence partnership, which has taken on a new sense of urgency since the arrival of President Trump in the White House. It is an agreement that will symbolise the post-Brexit reset, with the PM, European Commission president Ursula von der Leyen and European Council president Antonio Costa are also expected to sign off on a communique pledging deeper economic cooperation. \n                  Post-Brexit EU reset negotiations 'going to the wire', says minister\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 But, rather like the torturous Brexit negotiations I covered for years in London and Brussels under Conservative prime ministers, Sir Keir's post-Brexit reset talks are going down to the wire. As of 10.30pm on Sunday, discussions were set to continue overnight, the two sides snared up over details around fisheries, food trade and youth mobility. It's not that both sides don't want the reset: the war in Ukraine and the spectre of the US becoming an unreliable partner have pushed London and Brussels closer together in their common defence interest. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 Fishing and youth mobility - the two snags But the pressure for this deal weighs more heavily on our prime minister than his European colleagues. He's been talking for months about securing a reset and better trading relationship with the EU to bolster the UK economy. His need to demonstrate wins is why, suggests one continental source, the Europeans are letting talks go to the wire, with London and Brussels in a tangle over fishing rights - key demands of France and the Netherlands - and a youth mobility scheme, which is a particular focus for Berlin. \"The British came with 50 asks, we came with two - on fishing and the youth mobility scheme,\" says one European source. The EU is asking for longer-term access to UK fishing grounds - a 10-year deal - which the British government has rebuffed, insisting it will not go beyond a four-year deal. In response, Brussels is saying it will not lift regulatory checks on food, agricultural and animal products unless the UK moves on fishing. This has left the two sides at an impasse. EU sources say Brussels had offered a time-limited deal to lift checks on animal products - replicating London's offer on fisheries - but the UK is reluctant to do this as it leaves too much uncertainty for farmers and supermarkets. Scotland election weighing on talks A deal on food products, known as sanitary and phytosanitary (SPS) goods, would be a boost for the economy, with potentially up to 80% of border checks disappearing, given the breadth of products - paint, fashion goods, leather as well as foods - with an animal component. Any deal would also mean the UK would have to align with rules made in Brussels and make a financial contribution to the EU to fund work on food and animal standards. Both elements will trigger accusations of Brexit \"betrayal\", as the UK signs up as a \"rule taker\" and finds itself paying back into the EU for better access. Government figures had been telling me how they were more than prepared to face down the criticisms likely to be thrown at them from the Conservatives. But sensitivities around fishing, particularly in Scotland, where Labour is facing elections next year, have weighed on talks. Read more from Sky News:UK has not asked about asylum return hubs, other Balkan countries say'Ouch': Starmer condemned for telling MP 'she talks rubbish'Joe Biden diagnosed with 'aggressive' form of prostate cancer The other area of huge tension is over a youth mobility scheme, which would enable young adults from member states to study and work in the UK and vice versa. Government sources familiar with the talks acknowledge some sort of scheme will happen, but want details to be vague - I'm told it might be \"an agreement about a future agreement\", while the EU sees this a one of its two core demands.  In talks late on Sunday night, the UK government appeared to be softening on re-opening the pre-Brexit Erasmus student exchange scheme as perhaps a way to get around the impasse, according to one EU source. The UK rejoining this scheme had been rebuffed by Sir Keir last year, but was raised again last night in talks, according to a source. Common ground on defence and security Wherever the economic horsetrading lands, the two sides have found common ground in recent months is on defence and security, with the UK working in lockstep with European allies over Ukraine and relationships deepening in recent months as Sir Keir Starmer has worked with President Macron and others to try to smooth tensions between Kyiv and Washington and work on a European peace deal for Ukraine. If details on trade, youth mobility and fisheries are fudged on Monday, the expectation is that the two sides will sign a security partnership that will reiterate the UK's commitment to build up the continent's defence capability and stand united against Russian aggression with its partners.  The deal should also mean British arms companies will be able to access the EU's €150bn rearmament programme, which has been set up to create a massive surge in defence spending over the next five years as Europe prepares itself to better repel threats. As I write this, talks are ongoing, but it is clearly in neither side's interest for Monday to go wrong. The EU and UK need to maintain a united front and, more importantly for Keir Starmer domestically, the PM needs to show an increasingly sceptical public he can deliver on his promises. Easing trade barriers with Britain's biggest trading partner and signing an EU defence pact would be two manifesto promises delivered. And with his popularity sinking to a record low in recent days, he could really do with a win."
    },
    {
        "title": "Post-Brexit EU reset negotiations 'going to the wire', says minister",
        "description": "Negotiations to reset the UK's post-Brexit relationship with the EU are going \"to the wire\", a Cabinet Office minister has said.",
        "url": "https://news.sky.com/story/post-brexit-eu-reset-negotiations-going-to-the-wire-says-minister-13370100",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-eu-uk-reset_6819338.jpg?20250204121024",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-18 07:47:00",
        "Headline": "The UK's lead negotiator Nick Thomas-Symonds tells Sky News he is \"confident\"  a deal can be reached \"that makes our borders more secure, is good for jobs and growth, and brings people's household bills down\".",
        "Content": " Negotiations to reset the UK's post-Brexit relationship with the EU are going \"to the wire\", a Cabinet Office minister has said. \"There is no final deal as yet. We are in the very final hours,\" the UK's lead negotiator Nick Thomas-Symonds told Sky's Sunday Morning with Trevor Phillips. On the possibility of a youth mobility scheme with the EU, he insisted \"nothing is agreed until everything is\". \"We would be open to a smart, controlled youth mobility scheme,\" he said. \"But I should set out, we will not return to freedom of movement.\" Politics latest: PM outlines 'benefits' for UK from closer EU ties The government is set to host EU leaders in London on Monday. Put to the minister that the government could not guarantee there will be a deal by tomorrow afternoon, Mr Thomas-Symonds said: \"Nobody can guarantee anything when you have two parties in a negotiation.\" But the minister said he remained \"confident\" a deal could be reached \"that makes our borders more secure, is good for jobs and growth, and brings people's household bills down\". \"That is what is in our national interest and that's what we will continue to do over these final hours,\" he said. \"We have certainly been taking what I have called a ruthlessly pragmatic approach.\" On agricultural products, food and drink, Mr Thomas-Symonds said supermarkets were crying out for a deal because the status quo \"isn't working\", with \"lorries stuck for 16 hours and food rotting\" and producers and farmers unable to export goods because of the amount of \"red tape\". Asked how much people could expect to save on shopping as a result of the deal the government was hoping to negotiate, the minister was unable to give a figure. Read more:What could a UK-EU reset look like?Starmer's stance on immigration criticised On the issue of fishing, asked if a deal would mean allowing French boats into British waters, the minister said the Brexit deal which reduced EU fishing in UK waters by a quarter over five years comes to an end next year. He said the objectives now included \"an overall deal in the interest of our fishers, easier access to markets to sell our fish and looking after our oceans\". Turning to borders, the minister was asked if people would be able to move through queues at airports faster. Again, he could not give a definitive answer, but said it was \"certainly something we have been pushing with the EU... we want British people who are going on holiday to be able to go and enjoy their holiday, and not be stuck in queues\". PM opens door to EU youth mobility scheme A deal granting the UK access to a major EU defence fund could be on the table, according to reports - and Prime Minister Sir Keir Starmer has appeared to signal a youth mobility deal could be possible, telling The Times that while freedom of movement is a \"red line\", youth mobility does not come under this. The European Commission has proposed opening negotiations with the UK on an agreement to facilitate youth mobility between the EU and the UK. The scheme would allow both UK and EU citizens aged between 18 and 30 years old to stay for up to four years in a country of their choosing. Earlier this month, Home Secretary Yvette Cooper told Phillips a youth mobility scheme was not the approach the government wanted to take to bring net migration down.  When this was put to him, Mr Thomas-Symonds insisted any deal on a youth mobility scheme with Europe will have to be \"smart\" and \"controlled\" and will be \"consistent\" with the government's immigration policy. Asked what the government had got in return for a youth mobility scheme - now there had been a change in approach - the minister said: \"It is about an overall balanced package that works for Britain. The government is 100% behind the objective of getting net migration down.\" Phillips said more than a million young people came to the country between 2004 and 2015. \"If there isn't a cap - that's what we are talking about,\" he said. The minister insisted such a scheme would be \"controlled\" - but refused to say whether there would be a cap. 👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈 'It's going to be a bad deal' Shadow cabinet office minister Alex Burghart told Phillips an uncapped youth mobility scheme with the EU would lead to \"much higher immigration\", adding: \"It sounds very much as though it's going to be a bad deal.\" Asked if the Conservatives would scrap any EU deal, he said: \"It depends what the deal is, Trevor. And we still, even at this late stage, we don't know. \"The government can't tell us whether everyone will be able to come. They can't tell us how old the young person is. They can't tell us what benefits they would get. \"So I think when people hear about a youth mobility scheme, they think about an 18-year-old coming over working at a bar. But actually we may well be looking at a scheme which allows 30-year-olds to come over and have access to the NHS on day one, to claim benefits on day one, to bring their extended families.\" He added: \"So there are obviously very considerable disadvantages to the UK if this deal is done in the wrong way.\" Jose Manuel Barroso, former EU Commission president, told Phillips it \"makes sense\" for a stronger relationship to exist between the European Union and the UK, adding: \"We are stronger together.\" He said he understood fishing and youth mobility are the key sticking points for a UK-EU deal. \"Frankly, what is at stake... is much more important than those specific issues,\" he said."
    },
    {
        "title": "People do feel like strangers in Britain - but it's not just because of migration, polling finds",
        "description": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled.",
        "url": "https://news.sky.com/story/people-do-feel-like-strangers-in-britain-but-its-not-just-because-of-migration-polling-finds-13369073",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-immigration_6913886.jpg?20250512093918",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Reasons including the cost of living, the pandemic and working from home were all given as reasons why people are feeling more and more isolated, rather than what Sir Keir Starmer said.",
        "Content": "Last week, Sir Keir Starmer voiced his worry Britain could become an \"island of strangers\" if immigration was not tackled. Some claimed this was a controversial and dangerous stance - drawing parallels with Enoch Powell's Rivers of Blood speech. But research released today suggests close to half of those in Great Britain feel like \"strangers\" in their own country. Politics latest: Follow live updates The survey, carried out by pollsters at More In Common, asked 13,464 people in Great Britain for their feelings on the matter. And what is even more surprising is that the survey was carried out over a month before Sir Keir's speech. The research is only being released today, and it is understood that Downing Street had not seen it before the prime minister's speech. \n                  UK has not asked about asylum return hubs, other Balkan countries say\n                 \n                  An embarrassment for Starmer on migrant return hubs?\n                 \n                  Sir Keir Starmer in talks with 'a number of countries' over return hubs for failed asylum seekers\n                 However it will likely be welcomed as a justification of a position aimed outside of Westminster.  Isolation linked to wealth The prime minister's concerns about Great Britain being an \"island of strangers\" was inextricably linked to rising immigration. But the research out today shows the isolation felt by many is strongly linked to wealth - with the poorest in the country more likely to feel like strangers. The cost of living was mentioned as a contributory factor by many of those asked. And when it comes to ethnic breakdown of those saying they feel like strangers, Asian or Asian British people were more likely than either white or black British people to say they felt separate. Amy, a teacher from Runcorn, told researchers that when \"your money's all going on your bills and the boring stuff like food and gas and leccy and petrol\" there is nothing left \"to do for ourselves\". Read more:Reform tops polls for first timeReform surge in estimated national vote Who is Starmer targeting?  Those who criticised Sir Keir for his \"strangers\" speech tended to accuse the prime minister of appealing to supporters of Reform or the Conservatives. Suspended Labour MP Zarah Sultana went as far as to claim the speech was a \"foghorn to the far right\". The analysis from More in Common found that people who supported Reform and the Conservatives last year are indeed much more likely to feel like strangers in the UK. While Labour, Lib Dem and Green supporters are all less likely to feel like strangers, around a third of them do still agree with the statement that they \"sometimes feel like a stranger in my own country\". And the polling also found that Reform and Conservative voters are much more likely to think that multiculturalism threatens national identity, while supporters of the other three parties tend to largely believe multiculturalism is a benefit. Across the board, supporters of all parties were more likely than not to think that everyone needs to do more to encourage integration between people of different ethnic backgrounds - and similarly a majority think it is everyone's responsibility to do so. Luke Tryl, the UK director of More in Common, said: \"The prime minister's warning that we risk becoming an 'island of strangers' resonates with millions who say they feel disconnected from those around them. \"But it would be a mistake to say that immigration and lack of integration are the sole causes of our fragmenting social fabric.\" John McDonnell, another former Labour MP, now suspended, told Sky News that having politicians \"exploit\" resentment fuelled by economic circumstance to shift \"the blame onto migrants just exacerbates the problem\". He said the government needs to \"tackle the insecurity of people's lives and you lay the foundations of a cohesive society\". With Reform now leading in the polls and the collapse of support for Sir Keir since becoming prime minister, it is unsurprising that what he says seems to match up with what turquoise voters feel. Work from home alone The post-pandemic shift to working from home and spending more time alone has also been blamed for an increased feeling of isolation. Ruqayyah, a support worker from Peterborough, said the shift to home offices had \"destroyed our young generation\". But there are many other reasons that people feel separate from the rest of their country. Read more:Internet may help older people's mental healthNo evidence of 'two-tier policing' in handling of Southport  Young people are less trusting of strangers, and there is also a deep discontent with the political system. Many think the system is \"rigged\" in favour of the wealthy - although this belief is less common the higher the level of education someone has completed. The tension that exploded during last year's riots are also highlighted, and many people are worried about religious differences - a situation exacerbated by foreign conflicts like in the Middle East and between India and Pakistan. The research was carried out alongside the campaign group Citizens UK and UCL. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Matthew Bolton, executive director of Citizens UK, said: \"We all saw what can happen last summer when anger and mistrust boil over and threaten the fabric of our society. \"The answers to this don't lie in Whitehall. \"By listening to people closest to the ground about what causes division and what builds unity in their neighbourhood, we can build a blueprint for cohesion rooted in local leadership and community power.\""
    },
    {
        "title": "Sean 'Diddy' Combs: What it was like to follow 'the Pied Piper of partying'",
        "description": "In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.&#160;",
        "url": "https://news.sky.com/story/sean-diddy-combs-what-it-was-like-to-follow-the-pied-piper-of-partying-13370508",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-diddy-combs-trial_6914836.jpg?20250513093531",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-18 23:01:00",
        "Headline": "Magazine editor Amy DuBois Barnett describes Sean \"Diddy\" Combs as \"the Pied Piper… of the most elite level of partying\" in the 1990s and early 2000s.",
        "Content": "\n          Arts and entertainment correspondent\n        In 1990s and early 2000s New York, Sean \"Diddy\" Combs was the person to be seen with.  Now on trial in Manhattan, his hair grey, his beard grown, it's hard to imagine that he was \"the Pied Piper… of the most elite level of partying of that time\" - but that's how Amy DuBois Barnett describes him. She was the first Black-American woman to run a major mainstream magazine in the US, and based in Manhattan at a time when hip hop was at its zenith. \"Urban culture really ran the city,\" she says. \"That's where so much of the money was… you had all the finance bros trying to get into Puffy (Combs) parties, all the fashion executives trying to get into Puffy parties.\" And while he was welcomed by the highest echelons of the arts and entertainment world, she says: \"He was never known for being a calm kind of individual.\" Combs was \"very dismissive\" with her, and she admits: \"Puff never particularly liked me that much.\" But DuBois Barnett would often get invited to his parties because she was able to feature his up-and-coming artists in her magazines. From editor-in-chief of Ebony magazine, she'd go on to become the editor-in-chief of Honey and Teen People magazines, and then deputy editor of Harper's Bazaar. She says the man she met at those parties \"lacked warmth\" and seemed \"complicated\". Read moreCassie finishes her court evidenceNine revelations from Cassie's time in courtWhat we know about the jurors in Diddy's trial \"When he walked in the room, all of the energy changed. Puffy had his trusted individuals around him… immediately the area around him would become kind of crowded with everybody vying for his attention,\" she says. \"I think that was also partially why he didn't particularly like me because I wasn't really vying for his attention. \"He really reserved that attention for the people that he was either attracted to… or the people that he thought were important enough to his business success.\" She says it was common knowledge that he wasn't someone to cross due to \"rumours... of what he could do\". \"There were a lot of people within journalism, within media, within other industries that were afraid of his influence and also afraid of his temper,\" she adds. \"When things at parties would not go his way or somebody didn't bring him something quickly enough, or… the conversation wasn't going his way… he would just kind of snap and he was just not afraid to yell at whoever was there. \"There was not a lot of boundaries in his communication, let's just put it that way.\" But she says it was a time when a tremendous amount of misogyny was running throughout music, things that in today's culture would certainly give pause for thought. \"So many things happened to me, everything from getting groped at parties to getting locked in a limousine with music executives and having him refuse to let me out until I did whatever he thought I was going to do, which I didn't.\" She insists: \"We didn't have the vocabulary to understand the degree to which it was problematic... it was a thread that ran throughout the culture.\" Star-studded parties were the ultimate invite At the time, a ticket to one of Combs's star-studded \"white parties\" was the ultimate invite. She admits: \"It was like nothing you've ever seen before… the dress code was very strict. \"No beige, no ecru, absolutely white, you would literally be turned away if your outfit was wrong. Puffy did not sort of tolerate people in his parties that didn't look 'grown and sexy' as it were.\" She says people would mingle by the poolside listening to the best DJs in the world, while topless models posed dressed as mermaids and waiters handed out weed brownies from silver platters. \"It was every boldface name you could possibly imagine, just this gorgeous crowd.\" Behind the glamour, prosecutors now allege there was a man capable of sexual abuse and violence, and a serious abuse of power. Criminal charges which he's already pleaded not guilty to and strenuously denies. Without question, Combs had the golden touch. Expanding his music career into business enterprises that in 2022 reportedly took his net worth to around £1bn. For decades his success story was celebrated. \"I think that in the black community, there is a feeling that if a black man is successful you don't want to bring him down because there are not that many… these are cultural forces that are rooted in the systemic racism that's present in the United States… but I think that these were part of what potentially protected Puffy against people speaking out.\" Couple became 'isolated and very unhappy' While Combs had amassed a small fortune over the course of two decades which she encountered him, the former magazine editor says his behaviour had markedly changed from the first party she went to, to her last. \"The last was a post-Grammys party, in 2017 or 2018, and just the vibe was very different. He was really kind of isolated in a corner with Cassie, you know, looking very unhappy.\" For around 10 years, Combs had a relationship with the singer Cassie Ventura which ended in 2018. Once over she filed a lawsuit that both parties eventually settled alleging she was trafficked, raped, drugged and beaten by the rapper on many occasions - which he denied. Last week she made similar claims in court. \"Cassie looked very glassy-eyed and there was a sadness about her energy. Whatever was happening between the two of them, I mean, it didn't feel positive,\" says DuBois Barnett. \"They were sort of holed up in the corner for almost the entire night… it did feel very different from the kind of jubilant of energy that he projected in his earlier incarnations.\" For Combs, his freedom depends on how these next few weeks go. His representatives claim he is the victim of \"a reckless media circus\", saying he categorically denies he sexually abused anyone and wants to prove his innocence. In particular, they say, he looks forward to establishing the \"truth... based on evidence, not speculation\"."
    },
    {
        "title": "Music video streamer ROXi lands backing from US broadcasters",
        "description": "A music video-streaming service whose shareholders include the U2 bassist Adam Clayton will this week announce that it has sealed a management buyout after months of talks.",
        "url": "https://news.sky.com/story/music-video-streamer-roxi-lands-backing-from-us-broadcasters-13370155",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-adam-clayton-u2_6920091.jpg?20250518103213",
        "type": "Entertainment",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-18 10:26:00",
        "Headline": "A media company backed by the U2 bassist Adam Clayton has sealed a management buyout with new investment from US broadcasters Sinclair and Gray Media, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A music video-streaming service whose shareholders include the U2 bassist Adam Clayton will this week announce that it has sealed a management buyout after months of talks. Sky News understands that the assets of MagicWorks, which trades as ROXi, have been sold to a new company called FastStream Interactive (FSI), with backing from two major US-based broadcasters. Sources said that Nasdaq-listed Sinclair and New York Stock Exchange-listed Gray Media were among the new shareholders in FSI, with the launch of new interactive TV Channels in the US expected to take place shortly. The deal, which has involved raising millions of pounds of new equity from new and existing investors, has resulted in previous creditors of the business being repaid in full, according to the sources. Its search for funding from the US was seen as vital because of the programme to roll out its FastScreen technology. Founded in 2014, ROXi described itself as the world's first 'made-for-television' service, allowing viewers to stream millions of songs and download hundreds of thousands of karaoke tracks. Its broadcast channels allow viewers to skip through content in which they have no interest. \n                  Money blog: Why gold spike means you need to update your home insurance\n                 \n                  Concierge firm founded by Queen's nephew hunts buyer\n                 \n                  Superstar Adele joins backers of music royalties platform Audoo\n                 Simon Cowell, Kylie Minogue and Robbie Williams were among the prominent music industry figures who had previously been named as ROXi investors. Financiers including Guy Hands and Jim Mellon are said to be part of the new ownership structure. In response to an enquiry from Sky News, Rob Lewis, FSI chief executive, said: \"The new technology, FastStream, will revolutionise broadcast TV. \"For the first time in history, consumers tuning into a normal TV channel will find they automatically start at the beginning of the programme, and that they are able to skip, pause or search, even though they are watching normal broadcast TV\". Begbies Traynor Group, the professional services firm, and Rockefeller Capital Management advised on the process."
    }
]