[
    {
        "title": "Trump accuses Zelenskyy of harming peace talks on Ukraine war and tells him to 'get it done'",
        "description": "Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\".",
        "url": "https://news.sky.com/story/trump-tells-zelenskyy-get-it-done-as-peace-talks-on-ukraine-war-downgraded-13354513",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6895024.jpg?20250423215718",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-23 19:10:00",
        "Headline": "Reports said Donald Trump is proposing the US would formally recognise Russia's occupation of Crimea - a red line for Ukraine and previously rejected by Volodymyr Zelenskyy.",
        "Content": " Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London on ending the conflict, the American president appeared to vent frustration about Mr Zelenskyy on his Truth Social platform. \"We are very close to a deal, but the man with 'no cards to play' should now, finally, GET IT DONE,\" Mr Trump said. \"I look forward to being able to help Ukraine, and Russia, get out of this complete and total MESS, that would have never started if I were president!\" Ukraine war latest: 'We are very close to deal', Trump claims Mr Trump also criticised Mr Zelenskyy for telling the Wall Street Journal that Ukraine would not accept giving up Crimea as part of a peace deal with Russia. And he accused the Ukrainian president of harming peace negotiations with \"inflammatory statements\". \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 \n                  Depth of Trump's frustration revealed in comments on Zelenskyy - and there was one notable absence in his Truth Social post\n                 \n                  Day 94: Why is Trump targeting students?  \n                 Reports say that the US president's seven-point peace plan to end the war includes a proposal that America would formally recognise Russian sovereignty over Crimea - which was annexed in 2014 and which Ukraine maintains is its territory. \"It's inflammatory statements like Zelenskyy's that makes it so difficult to settle this war,\" Mr Trump added. \"He has nothing to boast about! \"The situation for Ukraine is dire - He can have peace or, he can fight for another three years before losing the whole country.\" 👉 Listen to Sky News Daily on your podcast app 👈 Speaking later at the White House on Wednesday, Mr Trump said: \"I think we have a deal with Russia. We have to get a deal with Zelenskyy. \"I thought Zelenskyy would be easier to deal with, but so far it's harder. I think we have a deal with both.\" Asked if he was planning to meet Mr Putin soon in Saudi Arabia, he said \"probably not, but I hope to meet with him soon thereafter\". The peace plan, reported by US media over the weekend, would freeze the frontlines in Ukraine as part of the agreement. London talks on ending war downgraded It comes after Mr Rubio withdrew from a planned meeting in London on Wednesday, which the UK's Foreign Secretary David Lammy and Defence Secretary John Healey did attend. The downgraded talks were also attended by Keith Kellogg, the US envoy for Ukraine, along with other officials from France, Germany and Ukraine. Mr Rubio said last week that the US may \"walk away\" from negotiations due to a lack of progress with Russia and Ukraine - a warning now repeated by vice president JD Vance.  The UK Foreign Office said in a statement that there had been significant progress at the talks on Wednesday, and added: \"All parties reiterated their strong support for President Trump's commitment to stopping the killing and achieving a just and lasting peace.\" Read more:One notable absence in Trump's post on Zelenskyy - analysis'Trump will walk away from peace talks in two weeks' | Michael Clarke Q&A 'Emotions have run high' - Zelenskyy On Wednesday evening, the Ukrainian president said \"emotions have run high today\" but stressed all sides \"expressed their views and respectfully received each other's positions\" during the London talks. Mr Zelenskyy said on social media: \"The American side shared its vision. Ukraine and other Europeans presented their inputs. \"And we hope that it is exactly such joint work that will lead to lasting peace.\" He also said, however, that \"Ukraine will always act in accordance with its constitution,\". And he posted a screenshot of the Crimea Declaration - which says the US refuses to recognise Russia's claim to Crimea - made by former US secretary of state Mike Pompeo in 2018, during Mr Trump's first term as president. It also comes after Ukrainian officials said nine people were killed and almost 50 injured in the city of Marhanets after a Russian drone hit a bus carrying workers on Wednesday morning. Russia also launched \"a massive\" drone attack on the central Ukrainian region of Poltava, injuring at least six people, the emergency service said in a post on the Telegram messaging app."
    },
    {
        "title": "Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says",
        "description": "Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said.",
        "url": "https://news.sky.com/story/trump-wants-to-emulate-putin-and-govern-us-in-a-similar-fashion-his-former-national-security-adviser-says-13354554",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-23 20:40:00",
        "Headline": "Fiona Hill told The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\".",
        "Content": " Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said. Fiona Hill told Sky News' The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\". She said the two leaders \"have shockingly similar world views\". Ukraine war latest: Trump hits out at Zelenskyy \"This is the first time we've had a US president who wants to emulate the Russian leader in some way, who wants to create a hyper-personalised presidency, who wants to basically govern his own country in a very similar fashion, very top down without any checks and balances,\" she said. Ms Hill added Mr Trump wants to \"regularise, normalise and reset\" the relationship between the US and Russia. \"That's very clear, it's been clear since the first presidency of Trump,\" she said. \"He's always wanted to sit down with Vladimir Putin and sort out all of the difficulties in the bilateral relationship, everything from nuclear issues and nuclear arms reduction - there's all kinds of economic and business deals that Trump himself and his immediate circle are very interested in. \"That was not the direction of travel of other US presidents. So in actual fact there's probably more chance under Trump of a close relationship between the US and Putin.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' Ms Hill said Mr Trump has an interest in forging a \"personal relationship\" beyond what he already has with Mr Putin. \"He wants to extricate the United States from its support for Ukraine, he's said that very clearly,\" she said. \"He also wants to pull back from the underpinning of European security and get the Europeans to pick up not just support for Ukraine, but also much more involvement and much more in-depth payment for all of their own security, that's also very clear. \"So there is a strategic perspective there and I think part of the US strategy and the Trump administration strategy is to push the Europeans to go off essentially on their owns in terms of framing what they want in European security and making it very clear to the Ukrainians that they can't expect much more future support from the United States.\" It comes as Mr Trump claimed a deal to end Russia's war in Ukraine is \"very close\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London aimed at ending the conflict, the American president heaped pressure on Volodymyr Zelenskyy to \"get it done\"."
    },
    {
        "title": "What it was like seeing the open coffin of Pope Francis",
        "description": "How to describe the moment when you see the open coffin of Pope Francis?&#160;",
        "url": "https://news.sky.com/story/what-it-was-like-seeing-the-open-coffin-of-pope-francis-13354466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-rome-italy_6894920.jpg?20250423184140",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-04-23 17:23:00",
        "Headline": "Thousands of Catholic faithful, including cardinals and nuns, have already taken the chance to view the Pope's casket, despite the seemingly endless queue, and, given the importance of the moment, they can't be blamed for using their phones to capture it.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  How to describe the moment when you see the open coffin of Pope Francis?  How to sum up an experience that was shared with many, but which felt so intimate? Fortunate, memorable, touching, and emotional. Above all, unique. Well, let's start at the beginning. We, along with other members of the global media, were invited into the basilica by the Vatican in order to see the lines of people filing past the coffin; to bear witness to the emotions, the sounds. To this demonstration of faith. As we start to walk over, we know we are the lucky ones. The queue to get into the basilica stretches into the distance - there are people waiting eight hours for the chance to see the coffin. By contrast, we are ushered in through a side door. We round a corner, walking against a tide of people, until we enter the huge, soaring chamber in which the Pope's coffin lies in state. A beam of sunshine is lighting up an imposing statue, created by the genius of Bernini and now looking down upon the Pope. I can see Francis's hands crossed on his chest. His coffin is large, resting on the floor, but it is not ostentatious. You can see the red cloth of his vestments.  It is one thing to be told that the Pope has died, but quite another to witness the proof. Perhaps that is why so many are queuing for this moment - to bring closure, as much as to offer thanks. Setting glistens with gold The setting is extraordinary. St Peter's Basilica is a simply astonishing building that glistens with gold and whose domed ceiling rises to the sky. Francis wanted to eschew the extravagance of previous papal funerals, but there is no avoiding the splendour of his surroundings. By his coffin, soaring up, is the huge canopy known as St Peter's Baldachin, which covers the altar. Beneath it, so Christians believe, is the tomb of St Peter. This is one of the holiest places in Christianity, and the Pope lies alongside it. Around his coffin are four soldiers from the Swiss Guard, dressed in their familiar red, blue, and yellow uniforms.  No sense of rush A rope runs around the coffin, marking off the area. There are a few seats on one side for notable dignitaries to use when paying their respects. On the other side is a space for senior members of the Catholic church to pray and give thanks. As we watch, there are two cardinals using this space, including the Italian Matteo Zuppi, a contender to be the next pope. I can see his mouth moving in prayer, his head bowed. The chamber is thronged with people, but there is no sense of rush. The queue of people runs round the edge of half the room, but it is orderly, shuffling ever forward. And there is such a blend of people - nuns and priests, but also families dressed for a day in the sun, teenagers in football shirts, grandparents in their finery. Some come in black, others in suits, some in scruffy old T-shirts. I see three nuns come past, followed by a young woman in jeans and a T-shirt. The nuns are smiling; the woman is sobbing. We learn it's impossible to predict who will be affected most. You do not get to linger long at the front - maybe a few seconds - but it is an opportunity that divides. Phones are a constant sight Some make a cross; some offer a prayer; some take a selfie. Mobile phones are a constant sight. At any given moment, I can see dozens of them held in the air, capturing photos of the scene. It's hard to say whether these phones damage the mood, bruising the sombre sense of intimacy, or whether they add to the idea that this is as much about celebrating life as it is about bemoaning death. Maybe both can be true. It is an emotional experience, whether you have faith or not. What is remarkable here is not the sight of Pope Francis's coffin, not the hands arranged on his chest, nor the ceremony around St Peter's. Read more:Inside Vatican City at moment of high tensionWho will be at the Pope's funeral - and who won't be What is extraordinary - and what will live with me - is that so many people are prepared to queue for hour after hour in the beating sun to quietly offer thanks to a man that hardly any of them had ever met, but many felt they knew. Like the Queen before, what really matters is not the scene that people will see, but rather the fact that they are so desperate to come."
    },
    {
        "title": "Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'",
        "description": "Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey...",
        "url": "https://news.sky.com/story/sky-news-political-editor-beth-rigby-running-london-marathon-in-honour-of-dearest-friend-13354228",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-beth-rigby-marathon_6894439.jpg?20250423110315",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-04-23 10:15:00",
        "Headline": "Last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart.",
        "Content": "\n          Political editor\n              @BethRigby\n Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey... I used to say I was never going to attempt to run a marathon: too hard, too long, too much training. But later this week, I am going to join 56,000 others and run the London Marathon. It is honestly something I never thought I would do. I took up running in my 30s, somewhere between quitting smoking and having my children. I am not a natural long-distance runner. I am neither long nor lean. At school, I was better in a sprint than cross country. But struggling to breathe as you try to run a couple of kilometres is a great motivator not to pick up a Marlboro light again. So, I persevered and in 2017 ran my first half marathon. Since then, I have run another five half marathons. Every time I crossed the finish line, I did so in wonderment that I'd run that far and completed the race, followed by utter bafflement as to why anyone would want to put themselves through running that distance all over again. I was never going to run a marathon. But then last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart. Her death was absolutely devastating for her husband and her two sons, her family and friends. She died on June 17 in the middle of the general election campaign. I was in between presenting the Sky News Battle for No 10 election show - it was the last thing Laura watched on television - and preparing for the overnight election results show. Laura had been seriously ill for a number of weeks, but her death was quite sudden. I found myself reeling with grief, but I had to keep going, so that's what I did. When I came out of the other side of that election and contemplated life without Laura, well, it was like staring into a massive black hole. We called Laura our North Star because she was the doer and the leader. There was no one in my life as full of life and energy as Laura. She was irrepressible, infectious and very funny. She filled every room she entered, every conversation she joined, every endeavour she began. I'm sure there will be many of you out there who have lost someone you deeply love who can relate to this - the desolation and loneliness you feel in those days and months afterwards as you try to come to terms with their absence from your daily life. I know what Laura would have said, she'd have told me to get on with it and soon after her funeral, I quietly decided to run the London Marathon. It was my attempt to \"get on with it\" and in the process do something positive in Laura's memory by raising money for the North London Hospice, who cared for her with such attention and empathy during the final stages of her life.  So this is how I went from never ever running a marathon to attempting the world's biggest race this week and I am not doing it alone: when I told my friend Esme Wren about it - we did our first half marathon together back in 2017 - she signed up too, so we've been on the journey together, which has make it all a little less daunting and a little more doable. Because marathon training - and the prospect of running for 26.2 miles - is full on, physically and mentally. For me it has involved running three times a week for 16 weeks, I have managed most of them running over 220 miles (that's over 350km) in that time. One is an interval run, in which you run very fast in short bursts, an easy run and then a long run. Between trying to fit in the runs, the family and being Sky News' political editor with a very unpredictable schedule and frequent trips abroad, I have been - forgive the pun - run ragged. Marathon training is just really time-intensive and, as BBC news presenter and runner extraordinaire Sophie Raworth told me - one massive upside of marathon training is the gang you become part of - there are no short-cuts when it comes to marathon training. You have to put in the miles, when it's cold and dark and raining and you'd rather be doing anything else. There was one occasion in early February when the only time I could do my long run - at this point an 8-miler - was on a Friday afternoon at 4pm. I ran down the canal path, first towards the Olympic Park in Stratford, before turning off to pick up Regents Canal towards Islington, went the wrong way and found myself lost on a deserted canal path, in the dark, being lashed by the driving rain. I decided that this was a very bad idea and came off the canal to find I'd somehow got myself to Stepney Green Tube station. Like a modern-day Dick Whittington, I followed the City of London's skyline to make my way home, picking up the train home from Liverpool Street (and a bottle of wine to celebrate my survival). There is also the camaraderie. Tom Larkin, one of our brilliant producers at Sky News and a super runner, has offered all sorts of advice, from which gels to use - you take a gel every few miles into the race to refuel - to carb loading before the race. He also pointed out to me when I was pondering why I got stomach cramping on my first 16 miler, that trying to run that far on an empty stomach lined by just an espresso was, well, suboptimal to say the least. Sophie Raworth has been absolutely lovely and given me tonnes of advice too, from showing me great canal loops (and helping me not get lost) to giving me advice on which trainers to try. One famous actor explained to me why I should absolutely keep to my pace and resist the adrenaline urge to go too fast at the start (his horror story about crippling lactic acid build-up in his legs at mile 20 was truly terrifying). There is also the sheer admiration you develop for those people you know who run marathons. One former senior Labour adviser revealed to me he had run a dozen marathons when I told him of my own attempt. I was so impressed by this that I told everyone I could about it whenever he was in my vicinity. Eventually, realising he was probably finding it a bit embarrassing, I stopped going on about it. But 12 marathons! There are also politicians who have shared funny stories. Lord Vaizey, who raised £18,000 for charity when he ran the London Marathon in 2021, recounted how, somewhere in the depths of the race as he struggled on with an injury and a big dose of fatigue, he saw a small child pointing at him and shouting Mr Potato Head. Ed Vaizey was rather put out by it: \"I thought, who's he calling Mr Potato Head? I don't look like Mr Potato Head.\" Shortly afterwards, Ed was overtaken by a runner dressed up as Mr Potato Head. Read more:Four mistakes to avoid if you're running the London MarathonHow the London Marathon is seeking to 'change the face of running' Then there's the incredible generosity. I have been blown away by family, friends, colleagues, and complete strangers who have donated to the North London Hospice in Laura's memory. Hospice care is only partially funded by the government and the sector relies on charitable donations to keep it going, with a third of its funding coming from the NHS, while the rest is made up of donations and the hospice's 17 charity shops. Over 200 people have donated more than £11,500 to our marathon efforts. It has literally been rocket fuel in my trainers. Too long, too hard, too much training: preparing for the marathon has felt like all of these things at different points in the past four months. But it has also been rewarding and enriching, as I achieved things I didn't think I could and found a lovely camaraderie with fellow runners along the way. And as for the grief, this marathon has become more than just a just a way of getting on with it, by literally putting one foot in front of the other: It has also become, through pounding the canal paths where Laura and I once walked, to the fundraising and conversations I've had with her family and friends about it, a way of celebrating and remembering Laura. So, wish me luck on Sunday and if you see me running/shuffling past, give me a wave. To follow Beth's journey to the finish line, visit her Instagram page: https://www.instagram.com/bethrigbysky/"
    },
    {
        "title": "Could the local elections reshape British politics?",
        "description": "Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May.",
        "url": "https://news.sky.com/story/could-the-local-elections-reshape-british-politics-13354168",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-bedenoch_6894706.jpg?20250423151711",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-04-23 09:13:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all happening on 1 May.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May. Next Thursday will see three types of elections A total of 23 councils are up for grabs - most in places we once called Tory shires, until last year's general election. This includes 14 county councils, all but two of which have been Conservative-controlled, as well as eight unitary authorities, all but one of which are Tory. Then finally, there is Doncaster council, a Labour-held borough. Kemi Badenoch claims they could lose all the councils they are contesting, setting expectations as low as possible. Then there are mayoral elections - four of them powerful metro mayors for the combined authorities, two of which are being elected for the first time. That's on top of two directly elected borough mayors. Read more: Where are the local elections and how can you vote? \n                  Robert Jenrick vows to 'bring coalition together' to end Tory-Reform fight\n                 \n                  'Stop Brexit Man' cleared of flouting police ban with anti-Brexit edits of Muppet Show and Darth Vader\n                 \n                  Rishi Sunak's former aide among 15 people charged with election betting offences\n                 Thirdly, there's a by-election triggered after the Labour MP Mike Amesbury resigned in March. He was found guilty of assault after being filmed repeatedly punching a man late at night. For the council elections, this is what happened in 2021 when these councils were last up. The baseline we'll measure the results against. Notice the Tories are defending so many, so they're the ones facing the biggest losses - \"well into the hundreds\", says Sky News' election analyst Michael Thrasher. But look at Reform too - it barely existed back in 2021, so that's on zero. This is why this set of elections is going to be so interesting. 2021, when these councils were last up, the Tories were riding high - their best night for 13 years on the National Equivalent Vote, which works out the national picture based on the local results. Labour did so badly Sir Keir Starmer considered resigning. Since then, the Tories have plummeted - halved in vote share if you look at polls. Labour down too. Lib Dems the same and Greens strong in places. But jockeying for joint first place: Reform UK - who are putting up the most candidates of any party - now contesting 99% of the seats. However, as Reform leader Nigel Farage knows only too well, votes don't always mean seats. Look at this snapshot from the past - 2013. The same set of elections. Labour got 21% of the votes and 21% of the seats. But Farage's UKIP got 21% of the vote and 8% of the seats. Then there are the mayors. Labour won all four that were contested last time, although one stepped down. Could Reform get its first taste of power in Lincolnshire? Or could it even be the Runcorn by-election? A massive long-shot - it's Labour's 49th safest seat. But will this northwest seat be the most important moment of the night? Labour insiders say they're still hopeful. There are signs our politics could be changing profoundly - 1 May could point to a new future."
    },
    {
        "title": "The Magic Circle's first female member fooled them into believing she was a man - how did she do it?",
        "description": "How did one woman fool the most famous magic society on the planet? ",
        "url": "https://news.sky.com/story/the-magic-circles-first-female-member-fooled-them-into-believing-she-was-a-man-how-did-she-do-it-13354578",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-magic-circle-sophie-lloyd_6895122.jpg?20250424000455",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-23 21:11:00",
        "Headline": "Over 30 years after being unceremoniously kicked out, the Magic Circle has tracked down Sophie Lloyd to apologise and reinstate her membership. But how did she fool the famous society? ",
        "Content": "\n          Arts and entertainment correspondent\n        How did one woman fool the most famous magic society on the planet?  Back in 1991, Sophie Lloyd pulled off the ultimate illusion, tricking the Magic Circle into thinking she was a man. But over 30 years after being unceremoniously kicked out, the Circle has tracked down the former actress to apologise and reinstate her membership. She told Sky News how returning feels like the society has \"made good on something that was wrong\". How did she infiltrate that exclusive group that nowadays counts the likes of David Copperfield and Dynamo as members? In March of that year, she took her entry exam posing as a teenage boy, creating an alter-ego called Raymond Lloyd. \"I'd played a boy before,\" she explained, but \"it took months of preparation\" to secretly infiltrate the Circle's ranks half a year before it would officially vote to let women in. \n                  Counter terror police assessing Kneecap concert video\n                 \n                  Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin\n                 \n                  Charli XCX, Lola Young, Raye and JADE among artists nominated for Ivor Novello Awards\n                 \"Really, going back 30 years, men's clubs were like, you know, just something you accepted.\" The men-only rule had been in place since the Circle was formed in 1905. The thinking behind it being that women just couldn't keep secrets. Aware of the frustration of female magicians at the time, Lloyd felt she was up for the challenge of proving women could be as good at magic as the men. The idea was, in fact, born out of a double act, thought up by a successful magician called Jenny Winstanley who'd wanted to join herself but wasn't allowed. She recognised the hoax would probably only work with a much younger woman posing as a teenage boy, and met Lloyd through an acting class. Lloyd said: \"We had to have a wig made... the main thing was my face, I had plumpers made on a brace to bring his jawline down.\" To hide her feminine hands, she did the magic in gloves, which she says \"was so hard to do, especially sleight of hand.\" The biggest test came when she was invited for a drink with her examiner, where she had to fake having laryngitis. \"After the exam, which was 20 minutes, he invited Jenny and I - she played my manager - and I sat there for one hour and three quarters and had to say 'sorry, I've got a bad voice'.\" Raymond Lloyd passed the test, and his membership certificate was sent through to Sophie. Then, in October of the same year, when whispers started circulating that the society was going to open its membership to both sexes, she and Jenny decided to reveal all. It didn't go down well. Read more:Jelly Roll seeks pardon from criminal pastHarvey Weinstein retrial begins in New York Rather than praise her performance, members were incandescent about the deception and, somewhat ironically, Raymond Lloyd was kicked out just before women members were let in. Lloyd said: \"We got a letter... Jenny was hurt... she was snubbed by people she actually knew, that was hurtful. However, things have really changed now...\" Three decades later the Magic Circle put out a nationwide appeal stating they wanted to apologise and Lloyd was recently tracked down in Spain. While Jenny Winstanley died 20 years ago in a car crash, as well as Sophie receiving her certificate on Thursday, her mentor's contribution to magic is being recognised at the special show that's being held in both their honour at the Magic Circle. Lloyd says: \"Jenny was a wonderful, passionate person. She would have loved to be here. It's for her really.\""
    },
    {
        "title": "Bite marks found on skeleton prove gladiators fought lions, experts say",
        "description": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said.",
        "url": "https://news.sky.com/story/bite-marks-found-on-skeleton-prove-gladiators-fought-lions-experts-say-13354591",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gladiator-lion_6895118.jpg?20250423234233",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-23 22:02:00",
        "Headline": "Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found.",
        "Content": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said. Teeth imprints from a large cat were found on the pelvis of a man buried in a cemetery believed to contain the remains of gladiators. Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found. Academics said the bones showed distinct lesions and were identified as coming from a large cat, probably a lion, after being compared with modern zoological teeth marks. The man is estimated to have been aged between 26 and 36 years old when he died and appears to have lived during the 3rd century AD, when York was known as Eboracum and was a town and military base in the Roman province of Britannia. Professor Becky Gowland, from Durham University's Department of Archaeology, said: \"This is an exciting new analysis and the first direct evidence of human-animal spectacle in Roman Britain and beyond. \"It also raises important questions about the importance and transport of exotic animals across the Roman Empire.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' The researchers want to find out how lions came to be kept in Britain and the lives of gladiators on the edge of the Roman Empire. 'First direct, physical evidence' The study, published in the journal PLOS One, was led by Tim Thompson, professor of anthropology and vice president for students and learning at Maynooth University, Ireland, who said: \"For years, our understanding of Roman gladiatorial combat and animal spectacles has relied heavily on historical texts and artistic depictions. \"This discovery provides the first direct, physical evidence that such events took place in this period, reshaping our perception of Roman entertainment culture in the region.\""
    },
    {
        "title": "Women in Iran increasingly deciding not to wear headscarves in public",
        "description": "Women in Iran are increasingly deciding not to wear the veil in public, a senior journalist who visited Tehran has said.",
        "url": "https://news.sky.com/story/women-in-iran-increasingly-deciding-not-to-wear-headscarves-in-public-13354450",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-tehran_6894932.jpg?20250423185332",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-23 16:44:00",
        "Headline": "NBC News chief foreign correspondent Richard Engel said women's issues are \"one of the most sensitive issues and one of the issues that's really at the cultural and political heart of the regime\".",
        "Content": "Women in Iran are increasingly deciding not to wear the veil in public, a senior journalist who visited Tehran has said. Speaking on Sky News podcast The World with Richard Engel and Yalda Hakim, NBC News's chief foreign correspondent Richard Engel said women's issues are \"one of the most sensitive issues and one of the issues that's really at the cultural and political heart of the regime\". Women in Iran are required to cover their hair and wear long, loose-fitting clothes to disguise their hair in public under Iran's Sharia law. Mr Engel said although there are signs in restaurants, cafes and hotels telling them they have to wear Islamic dress according to the law, women are \"brazenly\" not listening to them anymore. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 \"You walk down the street and I would say just by observation, maybe 30-40% of women are not wearing headscarves anymore,\" he said. Instead, the women would wear a little scarf around their necks \"in case there's an issue\", allowing them to \"quickly just pull it over their hair\". \n                  Inside Iran special - how close is a nuclear deal?\n                 \n                  'Goalposts being moved' as Iran hits out at change of location for nuclear talks with US\n                 \n                  US-Iran talks exceeded expectations - but the first round was the easy bit\n                 \"They're walking by the police stations, they're walking by government ministries. I've seen people walking with the women with their hair out, walking right past groups of what you would consider the morality police, and they don't say anything. \"They have stopped enforcing it on a daily basis and that is a significant change.\"  'I'm not sure this is the end of the road' But he added: \"I don't think they have given up. I'm not sure that this is the end of the road.\" Mr Engel said protests across the country following the death of 22-year-old Mahsa Amini in September 2023, which were countered with a \"brutal\" crackdown, \"seem to have made a difference\". \"The government, at least right now, has decided it doesn't want to fight that fight and it is not picking that fight. And people here are hoping that that is the start of significant changes.\" 'People are talking about it' The reprieve could be temporary, he added, explaining: \"It could be that the government has other priorities right now and therefore has put this one on the back burner, but it is happening and it's obvious and people are talking about it.\" He said one woman had done a TV interview without her headscarf on with her \"long hair down to below her shoulders\" - something that would have been \"unthinkable\" a few years ago. \"Even in north Tehran years ago, people may not have been wearing them, or they were barely wearing them, but if we interviewed them on camera, they would quickly wrap themselves up so they wouldn't get in trouble, even if they found it personally annoying. \"Now she said 'let's do it' and didn't care. That's a sense of confidence that I've never seen in this country.\" 'Incredibly brave' Yalda Hakim, Sky News's lead world news presenter, said it was \"incredibly brave\". \"We can't overstate how brave it is because it was a death sentence before for these women. It was unthinkable for them not to have their headscarves on,\" she said."
    },
    {
        "title": "Chancellor Rachel Reeves outlines red lines for US trade deal",
        "description": "Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed.",
        "url": "https://news.sky.com/story/chancellor-outlines-red-lines-for-us-trade-deal-13354411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6894889.jpg?20250423175938",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-23 15:50:00",
        "Headline": "Compromise on the Online Safety Act has been ruled out by Rachel Reeves as she said the safety of children is non-negotiable.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed. Rachel Reeves was speaking ahead of a pivotal meeting with her American counterpart in Washington DC. In an interview with Sky News, Ms Reeves said she was \"confident\" that a deal would be reached but said she had red lines on food and car standards, adding that changes to online safety were \"non-negotiable for the British government\". The comments mark the firmest commitment to a slew of rules and regulations that have long been a gripe for the Americans. Money blog: Private UK island loved by Rihanna and Stormzy for sale The US administration is pushing for the UK to relax rules on agricultural exports, including hormone-treated beef. While Britain could lower tariffs on some agricultural products that meet regulations, ministers have been clear that it will not lower its standards. \n                  Government borrows almost £15bn more than expected\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 However, the government has been less firm with its stance on online safety. A tech red line The US tech industry has fiercely opposed Britain's Online Safety Act, which was introduced in 2023 and requires tech companies to shield children from harmful content online. In an earlier draft UK-US trade deal, the British government was considering a review of the bill in the hope of swerving US tariffs. However, the chancellor suggested that this was no longer on the table. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" she said. She added that Britain was \"not going to water down areas of road safety\", a move that could pave the way for American SUVs that have been engineered to protect passengers but not pedestrians. While non-tariff barriers will remain intact, it was reported on Tuesday night that the UK could lower its automotive tariff from 10% to 2.5%. Business and economics correspondent What can Britain offer the Americans if it's not prepared to lower its standards? Donald Trump has previously described non-tariff barriers that block US exporters as \"cheating\". Britain does have some scope to bring down tariff rates - and Rachel Reeves suggested that this was her focus - but ours is already a highly open economy, we don't have huge scope to cut tariff rates. The real prize for the Americans is in the realm of these non-tariff barriers. There has been much speculation about what the UK could offer up, but the chancellor on Wednesday gave a comprehensive commitment that she would not dilute standards. There are many who will breathe a collective sigh of relief - from UK farmers to road safety campaigners and parents of young children. While the government is sensitive to any potential public backlash, it also has another factor to think about. When Ms Reeves arrives back home, she will begin preparations for a UK-EU summit in London next month.  The UK's food and road safety standards are, in many areas,  in sync with Europe, and Britain is seeking even deeper integration. Lowering standards for the Americans would make that deeper alignment with the Europeans impossible. The chancellor has to decide which market is more valuable to Britain. The answer is Europe. Back at home, the chancellor suggested that she was still open to relaxing rules on the City of London, even though global financial markets have endured a period of turmoil, triggered by President Trump's trade war. Reforms at home? In her Mansion House speech last November, the chancellor said post-2008 reforms had \"gone too far\" and set the course for deregulating the City. Asked if that was a wise move in light of the recent sharp swings in the financial markets, Ms Reeves said: \"I want regulators to regulate not just for risk but also for growth. \"We are making reforms and we have set out new remit letters to our financial services regulators.\" Britain's borrowing costs hit their highest level in almost 30 years after Mr Trump's Liberation Day tariffs announcements, a stark reminder that policy decisions in the US have the power to raise UK bond yields and in turn, affect the chancellor's budget, dent her already small fiscal headroom and derail her plans for tax and spend. However, the chancellor said she would not consider adapting her fiscal rules, which include a promise to cover day-to-day spending with tax receipts, even if it gives her more room to manoeuvre in the face of volatility. \"Fiscal rules are non-negotiable for a simple reason, that Britain must offer under this government fiscal and financial stability, which is so important in a world of global uncertainty,\" she said."
    },
    {
        "title": "UK vision for clean energy to collide with Trump's fossil fuel frenzy",
        "description": "Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security.",
        "url": "https://news.sky.com/story/uk-vision-for-clean-energy-to-collide-with-trumps-fossil-fuel-frenzy-13354414",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-donald-trump_6895043.png?20250423214456",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-23 15:57:00",
        "Headline": "The stakes are high for the UK's energy security summit, but hopes are modest. It has to contend with Trump's fossil fuel frenzy, while tariffs and trade wars disrupt the energy system.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security. Labour will tell ministers from 60 countries gathered for its Energy Security Summit that the transition from fossil fuels to clean power will make energy more secure because it's produced at home - as well as being a win for the climate. The stakes are high: just the small matter of stabilising the climate for years to come, as well as our energy bills. But hopes for the summit are modest, due to, unsurprisingly, Donald Trump. Trump turns up the heat with gas The US president peddles a very different view of energy security: he wants to \"drill baby drill\" for as much oil and gas as possible and pull America out of the global climate fight. He isn't sending his energy secretary Chris Wright to attend, but acting assistant secretary Tommy Joyce. \n                  'I was ready to stab whoever tried to stab me': The ex-gang members waging a war on knife crime\n                 \n                  The Magic Circle's first female member fooled them into believing she was a man - how did she do it?\n                 \n                  Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'\n                 The more junior official will still espouse Trump's vision to \"unleash US energy dominance\", which basically means keeping the world hooked on US fossil fuels - good news for the world's biggest oil and gas producer. This idea that the energy transition threatens energy security is taking root in the UK's Reform party, but is at odds with the view of the Prime Minister Sir Keir Starmer, EU chief Ursula von der Leyen, who is also attending, and the United Nations. One report by RMI found solar and wind are the cheapest option for new electricity in more than 80% of the world.  No China The UK government wants to work with America on a trade deal and some parts of the energy industry, like nuclear power. But underneath it will be hoping that the 60 other countries attending the summit will hold the line on ditching fossil fuels as fast as possible and boosting clean tech supply. That's even more urgent as the UK tries to reduce its reliance on China, which currently dominates manufacturing of clean power infrastructure like solar panels and critical minerals. That's also why the prime minister is today announcing £300m to help build wind turbines in the UK to reduce imports. But China itself is not attending - good news for rival America but a setback for the summit, given China's outsized role in the clean industries of the future. The elephant in the room Then there's the real elephant in the room, which is Trump's erratic tariffs and trade wars. No one knows how this will play out in the extremely complicated energy sector. Trump has ordered Europe to buy more of its liquefied natural gas as a way to avoid tariffs. Europe needs it: it's running low on storage and Russian pipeline supplies are dwindling. But on the flipside, his policies could paradoxically hurt both Europe's gas demand and America's gas producers, caught between fears of a recession and shaky global demand. The UK's reputation as a climate saint is not unblemished though, as it expands airports and moots further North Sea oil and gas after all. All this complexity and uncertainty forms the backdrop for the summit. Little concrete is expected to come from it - though the UK may use it to court investment. Other than that, we can expect little more than a paper summary on what energy security really means. But this is all about a fight for the narrative. And so if the IEA and other countries hold the line on clean power meaning energy security, the UK government will count that as a win."
    },
    {
        "title": "The Magic Circle's first female member fooled them into believing she was a man - how did she do it?",
        "description": "How did one woman fool the most famous magic society on the planet? ",
        "url": "https://news.sky.com/story/the-magic-circles-first-female-member-fooled-them-into-believing-she-was-a-man-how-did-she-do-it-13354578",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-magic-circle-sophie-lloyd_6895122.jpg?20250424000455",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-23 21:11:00",
        "Headline": "Over 30 years after being unceremoniously kicked out, the Magic Circle has tracked down Sophie Lloyd to apologise and reinstate her membership. But how did she fool the famous society? ",
        "Content": "\n          Arts and entertainment correspondent\n        How did one woman fool the most famous magic society on the planet?  Back in 1991, Sophie Lloyd pulled off the ultimate illusion, tricking the Magic Circle into thinking she was a man. But over 30 years after being unceremoniously kicked out, the Circle has tracked down the former actress to apologise and reinstate her membership. She told Sky News how returning feels like the society has \"made good on something that was wrong\". How did she infiltrate that exclusive group that nowadays counts the likes of David Copperfield and Dynamo as members? In March of that year, she took her entry exam posing as a teenage boy, creating an alter-ego called Raymond Lloyd. \"I'd played a boy before,\" she explained, but \"it took months of preparation\" to secretly infiltrate the Circle's ranks half a year before it would officially vote to let women in. \n                  Counter terror police assessing Kneecap concert video\n                 \n                  Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin\n                 \n                  Charli XCX, Lola Young, Raye and JADE among artists nominated for Ivor Novello Awards\n                 \"Really, going back 30 years, men's clubs were like, you know, just something you accepted.\" The men-only rule had been in place since the Circle was formed in 1905. The thinking behind it being that women just couldn't keep secrets. Aware of the frustration of female magicians at the time, Lloyd felt she was up for the challenge of proving women could be as good at magic as the men. The idea was, in fact, born out of a double act, thought up by a successful magician called Jenny Winstanley who'd wanted to join herself but wasn't allowed. She recognised the hoax would probably only work with a much younger woman posing as a teenage boy, and met Lloyd through an acting class. Lloyd said: \"We had to have a wig made... the main thing was my face, I had plumpers made on a brace to bring his jawline down.\" To hide her feminine hands, she did the magic in gloves, which she says \"was so hard to do, especially sleight of hand.\" The biggest test came when she was invited for a drink with her examiner, where she had to fake having laryngitis. \"After the exam, which was 20 minutes, he invited Jenny and I - she played my manager - and I sat there for one hour and three quarters and had to say 'sorry, I've got a bad voice'.\" Raymond Lloyd passed the test, and his membership certificate was sent through to Sophie. Then, in October of the same year, when whispers started circulating that the society was going to open its membership to both sexes, she and Jenny decided to reveal all. It didn't go down well. Read more:Jelly Roll seeks pardon from criminal pastHarvey Weinstein retrial begins in New York Rather than praise her performance, members were incandescent about the deception and, somewhat ironically, Raymond Lloyd was kicked out just before women members were let in. Lloyd said: \"We got a letter... Jenny was hurt... she was snubbed by people she actually knew, that was hurtful. However, things have really changed now...\" Three decades later the Magic Circle put out a nationwide appeal stating they wanted to apologise and Lloyd was recently tracked down in Spain. While Jenny Winstanley died 20 years ago in a car crash, as well as Sophie receiving her certificate on Thursday, her mentor's contribution to magic is being recognised at the special show that's being held in both their honour at the Magic Circle. Lloyd says: \"Jenny was a wonderful, passionate person. She would have loved to be here. It's for her really.\""
    },
    {
        "title": "Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'",
        "description": "Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey...",
        "url": "https://news.sky.com/story/sky-news-political-editor-beth-rigby-running-london-marathon-in-honour-of-dearest-friend-13354228",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-beth-rigby-marathon_6894439.jpg?20250423110315",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-04-23 10:15:00",
        "Headline": "Last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart.",
        "Content": "\n          Political editor\n              @BethRigby\n Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey... I used to say I was never going to attempt to run a marathon: too hard, too long, too much training. But later this week, I am going to join 56,000 others and run the London Marathon. It is honestly something I never thought I would do. I took up running in my 30s, somewhere between quitting smoking and having my children. I am not a natural long-distance runner. I am neither long nor lean. At school, I was better in a sprint than cross country. But struggling to breathe as you try to run a couple of kilometres is a great motivator not to pick up a Marlboro light again. So, I persevered and in 2017 ran my first half marathon. Since then, I have run another five half marathons. Every time I crossed the finish line, I did so in wonderment that I'd run that far and completed the race, followed by utter bafflement as to why anyone would want to put themselves through running that distance all over again. I was never going to run a marathon. But then last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart. Her death was absolutely devastating for her husband and her two sons, her family and friends. She died on June 17 in the middle of the general election campaign. I was in between presenting the Sky News Battle for No 10 election show - it was the last thing Laura watched on television - and preparing for the overnight election results show. Laura had been seriously ill for a number of weeks, but her death was quite sudden. I found myself reeling with grief, but I had to keep going, so that's what I did. When I came out of the other side of that election and contemplated life without Laura, well, it was like staring into a massive black hole. We called Laura our North Star because she was the doer and the leader. There was no one in my life as full of life and energy as Laura. She was irrepressible, infectious and very funny. She filled every room she entered, every conversation she joined, every endeavour she began. I'm sure there will be many of you out there who have lost someone you deeply love who can relate to this - the desolation and loneliness you feel in those days and months afterwards as you try to come to terms with their absence from your daily life. I know what Laura would have said, she'd have told me to get on with it and soon after her funeral, I quietly decided to run the London Marathon. It was my attempt to \"get on with it\" and in the process do something positive in Laura's memory by raising money for the North London Hospice, who cared for her with such attention and empathy during the final stages of her life.  So this is how I went from never ever running a marathon to attempting the world's biggest race this week and I am not doing it alone: when I told my friend Esme Wren about it - we did our first half marathon together back in 2017 - she signed up too, so we've been on the journey together, which has make it all a little less daunting and a little more doable. Because marathon training - and the prospect of running for 26.2 miles - is full on, physically and mentally. For me it has involved running three times a week for 16 weeks, I have managed most of them running over 220 miles (that's over 350km) in that time. One is an interval run, in which you run very fast in short bursts, an easy run and then a long run. Between trying to fit in the runs, the family and being Sky News' political editor with a very unpredictable schedule and frequent trips abroad, I have been - forgive the pun - run ragged. Marathon training is just really time-intensive and, as BBC news presenter and runner extraordinaire Sophie Raworth told me - one massive upside of marathon training is the gang you become part of - there are no short-cuts when it comes to marathon training. You have to put in the miles, when it's cold and dark and raining and you'd rather be doing anything else. There was one occasion in early February when the only time I could do my long run - at this point an 8-miler - was on a Friday afternoon at 4pm. I ran down the canal path, first towards the Olympic Park in Stratford, before turning off to pick up Regents Canal towards Islington, went the wrong way and found myself lost on a deserted canal path, in the dark, being lashed by the driving rain. I decided that this was a very bad idea and came off the canal to find I'd somehow got myself to Stepney Green Tube station. Like a modern-day Dick Whittington, I followed the City of London's skyline to make my way home, picking up the train home from Liverpool Street (and a bottle of wine to celebrate my survival). There is also the camaraderie. Tom Larkin, one of our brilliant producers at Sky News and a super runner, has offered all sorts of advice, from which gels to use - you take a gel every few miles into the race to refuel - to carb loading before the race. He also pointed out to me when I was pondering why I got stomach cramping on my first 16 miler, that trying to run that far on an empty stomach lined by just an espresso was, well, suboptimal to say the least. Sophie Raworth has been absolutely lovely and given me tonnes of advice too, from showing me great canal loops (and helping me not get lost) to giving me advice on which trainers to try. One famous actor explained to me why I should absolutely keep to my pace and resist the adrenaline urge to go too fast at the start (his horror story about crippling lactic acid build-up in his legs at mile 20 was truly terrifying). There is also the sheer admiration you develop for those people you know who run marathons. One former senior Labour adviser revealed to me he had run a dozen marathons when I told him of my own attempt. I was so impressed by this that I told everyone I could about it whenever he was in my vicinity. Eventually, realising he was probably finding it a bit embarrassing, I stopped going on about it. But 12 marathons! There are also politicians who have shared funny stories. Lord Vaizey, who raised £18,000 for charity when he ran the London Marathon in 2021, recounted how, somewhere in the depths of the race as he struggled on with an injury and a big dose of fatigue, he saw a small child pointing at him and shouting Mr Potato Head. Ed Vaizey was rather put out by it: \"I thought, who's he calling Mr Potato Head? I don't look like Mr Potato Head.\" Shortly afterwards, Ed was overtaken by a runner dressed up as Mr Potato Head. Read more:Four mistakes to avoid if you're running the London MarathonHow the London Marathon is seeking to 'change the face of running' Then there's the incredible generosity. I have been blown away by family, friends, colleagues, and complete strangers who have donated to the North London Hospice in Laura's memory. Hospice care is only partially funded by the government and the sector relies on charitable donations to keep it going, with a third of its funding coming from the NHS, while the rest is made up of donations and the hospice's 17 charity shops. Over 200 people have donated more than £11,500 to our marathon efforts. It has literally been rocket fuel in my trainers. Too long, too hard, too much training: preparing for the marathon has felt like all of these things at different points in the past four months. But it has also been rewarding and enriching, as I achieved things I didn't think I could and found a lovely camaraderie with fellow runners along the way. And as for the grief, this marathon has become more than just a just a way of getting on with it, by literally putting one foot in front of the other: It has also become, through pounding the canal paths where Laura and I once walked, to the fundraising and conversations I've had with her family and friends about it, a way of celebrating and remembering Laura. So, wish me luck on Sunday and if you see me running/shuffling past, give me a wave. To follow Beth's journey to the finish line, visit her Instagram page: https://www.instagram.com/bethrigbysky/"
    },
    {
        "title": "Could the local elections reshape British politics?",
        "description": "Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May.",
        "url": "https://news.sky.com/story/could-the-local-elections-reshape-british-politics-13354168",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-bedenoch_6894706.jpg?20250423151711",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-04-23 09:13:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all happening on 1 May.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May. Next Thursday will see three types of elections A total of 23 councils are up for grabs - most in places we once called Tory shires, until last year's general election. This includes 14 county councils, all but two of which have been Conservative-controlled, as well as eight unitary authorities, all but one of which are Tory. Then finally, there is Doncaster council, a Labour-held borough. Kemi Badenoch claims they could lose all the councils they are contesting, setting expectations as low as possible. Then there are mayoral elections - four of them powerful metro mayors for the combined authorities, two of which are being elected for the first time. That's on top of two directly elected borough mayors. Read more: Where are the local elections and how can you vote? \n                  Robert Jenrick vows to 'bring coalition together' to end Tory-Reform fight\n                 \n                  'Stop Brexit Man' cleared of flouting police ban with anti-Brexit edits of Muppet Show and Darth Vader\n                 \n                  Rishi Sunak's former aide among 15 people charged with election betting offences\n                 Thirdly, there's a by-election triggered after the Labour MP Mike Amesbury resigned in March. He was found guilty of assault after being filmed repeatedly punching a man late at night. For the council elections, this is what happened in 2021 when these councils were last up. The baseline we'll measure the results against. Notice the Tories are defending so many, so they're the ones facing the biggest losses - \"well into the hundreds\", says Sky News' election analyst Michael Thrasher. But look at Reform too - it barely existed back in 2021, so that's on zero. This is why this set of elections is going to be so interesting. 2021, when these councils were last up, the Tories were riding high - their best night for 13 years on the National Equivalent Vote, which works out the national picture based on the local results. Labour did so badly Sir Keir Starmer considered resigning. Since then, the Tories have plummeted - halved in vote share if you look at polls. Labour down too. Lib Dems the same and Greens strong in places. But jockeying for joint first place: Reform UK - who are putting up the most candidates of any party - now contesting 99% of the seats. However, as Reform leader Nigel Farage knows only too well, votes don't always mean seats. Look at this snapshot from the past - 2013. The same set of elections. Labour got 21% of the votes and 21% of the seats. But Farage's UKIP got 21% of the vote and 8% of the seats. Then there are the mayors. Labour won all four that were contested last time, although one stepped down. Could Reform get its first taste of power in Lincolnshire? Or could it even be the Runcorn by-election? A massive long-shot - it's Labour's 49th safest seat. But will this northwest seat be the most important moment of the night? Labour insiders say they're still hopeful. There are signs our politics could be changing profoundly - 1 May could point to a new future."
    },
    {
        "title": "Bite marks found on skeleton prove gladiators fought lions, experts say",
        "description": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said.",
        "url": "https://news.sky.com/story/bite-marks-found-on-skeleton-prove-gladiators-fought-lions-experts-say-13354591",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gladiator-lion_6895118.jpg?20250423234233",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-23 22:02:00",
        "Headline": "Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found.",
        "Content": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said. Teeth imprints from a large cat were found on the pelvis of a man buried in a cemetery believed to contain the remains of gladiators. Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found. Academics said the bones showed distinct lesions and were identified as coming from a large cat, probably a lion, after being compared with modern zoological teeth marks. The man is estimated to have been aged between 26 and 36 years old when he died and appears to have lived during the 3rd century AD, when York was known as Eboracum and was a town and military base in the Roman province of Britannia. Professor Becky Gowland, from Durham University's Department of Archaeology, said: \"This is an exciting new analysis and the first direct evidence of human-animal spectacle in Roman Britain and beyond. \"It also raises important questions about the importance and transport of exotic animals across the Roman Empire.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' The researchers want to find out how lions came to be kept in Britain and the lives of gladiators on the edge of the Roman Empire. 'First direct, physical evidence' The study, published in the journal PLOS One, was led by Tim Thompson, professor of anthropology and vice president for students and learning at Maynooth University, Ireland, who said: \"For years, our understanding of Roman gladiatorial combat and animal spectacles has relied heavily on historical texts and artistic depictions. \"This discovery provides the first direct, physical evidence that such events took place in this period, reshaping our perception of Roman entertainment culture in the region.\""
    },
    {
        "title": "Chancellor Rachel Reeves outlines red lines for US trade deal",
        "description": "Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed.",
        "url": "https://news.sky.com/story/chancellor-outlines-red-lines-for-us-trade-deal-13354411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6894889.jpg?20250423175938",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-23 15:50:00",
        "Headline": "Compromise on the Online Safety Act has been ruled out by Rachel Reeves as she said the safety of children is non-negotiable.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed. Rachel Reeves was speaking ahead of a pivotal meeting with her American counterpart in Washington DC. In an interview with Sky News, Ms Reeves said she was \"confident\" that a deal would be reached but said she had red lines on food and car standards, adding that changes to online safety were \"non-negotiable for the British government\". The comments mark the firmest commitment to a slew of rules and regulations that have long been a gripe for the Americans. Money blog: Private UK island loved by Rihanna and Stormzy for sale The US administration is pushing for the UK to relax rules on agricultural exports, including hormone-treated beef. While Britain could lower tariffs on some agricultural products that meet regulations, ministers have been clear that it will not lower its standards. \n                  Government borrows almost £15bn more than expected\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 However, the government has been less firm with its stance on online safety. A tech red line The US tech industry has fiercely opposed Britain's Online Safety Act, which was introduced in 2023 and requires tech companies to shield children from harmful content online. In an earlier draft UK-US trade deal, the British government was considering a review of the bill in the hope of swerving US tariffs. However, the chancellor suggested that this was no longer on the table. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" she said. She added that Britain was \"not going to water down areas of road safety\", a move that could pave the way for American SUVs that have been engineered to protect passengers but not pedestrians. While non-tariff barriers will remain intact, it was reported on Tuesday night that the UK could lower its automotive tariff from 10% to 2.5%. Business and economics correspondent What can Britain offer the Americans if it's not prepared to lower its standards? Donald Trump has previously described non-tariff barriers that block US exporters as \"cheating\". Britain does have some scope to bring down tariff rates - and Rachel Reeves suggested that this was her focus - but ours is already a highly open economy, we don't have huge scope to cut tariff rates. The real prize for the Americans is in the realm of these non-tariff barriers. There has been much speculation about what the UK could offer up, but the chancellor on Wednesday gave a comprehensive commitment that she would not dilute standards. There are many who will breathe a collective sigh of relief - from UK farmers to road safety campaigners and parents of young children. While the government is sensitive to any potential public backlash, it also has another factor to think about. When Ms Reeves arrives back home, she will begin preparations for a UK-EU summit in London next month.  The UK's food and road safety standards are, in many areas,  in sync with Europe, and Britain is seeking even deeper integration. Lowering standards for the Americans would make that deeper alignment with the Europeans impossible. The chancellor has to decide which market is more valuable to Britain. The answer is Europe. Back at home, the chancellor suggested that she was still open to relaxing rules on the City of London, even though global financial markets have endured a period of turmoil, triggered by President Trump's trade war. Reforms at home? In her Mansion House speech last November, the chancellor said post-2008 reforms had \"gone too far\" and set the course for deregulating the City. Asked if that was a wise move in light of the recent sharp swings in the financial markets, Ms Reeves said: \"I want regulators to regulate not just for risk but also for growth. \"We are making reforms and we have set out new remit letters to our financial services regulators.\" Britain's borrowing costs hit their highest level in almost 30 years after Mr Trump's Liberation Day tariffs announcements, a stark reminder that policy decisions in the US have the power to raise UK bond yields and in turn, affect the chancellor's budget, dent her already small fiscal headroom and derail her plans for tax and spend. However, the chancellor said she would not consider adapting her fiscal rules, which include a promise to cover day-to-day spending with tax receipts, even if it gives her more room to manoeuvre in the face of volatility. \"Fiscal rules are non-negotiable for a simple reason, that Britain must offer under this government fiscal and financial stability, which is so important in a world of global uncertainty,\" she said."
    },
    {
        "title": "Owner of paddleboarding company jailed over deaths of four people in Pembrokeshire",
        "description": "A woman has been jailed for 10 years and six months over the deaths of four paddleboarders in West Wales.",
        "url": "https://news.sky.com/story/owner-of-paddleboarding-company-jailed-over-deaths-of-four-people-in-pembrokeshire-13345862",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wales-pembrokeshire_6706014.jpg?20241004141502",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-04-23 11:00:00",
        "Headline": "Paul O'Dwyer, 42, Andrea Powell, 41, Morgan Rogers, 24, and Nicola Wheatley, 40, died after they got into difficulty while paddleboarding over a weir in the River Cleddau in October 2021.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  A woman has been jailed for 10 years and six months over the deaths of four paddleboarders in West Wales. Nerys Bethan Lloyd - a former police officer - pleaded guilty last month to four counts of gross negligence manslaughter and one offence under the Health and Safety at Work Act. Paul O'Dwyer, 42, Andrea Powell, 41, Morgan Rogers, 24, and Nicola Wheatley, 40, died after they got into difficulty in the River Cleddau, Pembrokeshire, on 30 October 2021. The four had been part of a stand-up paddleboarding tour when their paddleboards went over a weir in Haverfordwest, during \"extremely hazardous conditions\". Co-instructor Mr O'Dwyer initially exited the water but re-entered the river in an unsuccessful attempt to rescue the others. Ms Powell was taken to Withybush Hospital where she died of her injuries six days later. 'Blatant disregard' for the risk of loss of life The tour had been organised by Lloyd, owner and sole director of Salty Dog Co Ltd. The Crown Prosecution Service (CPS) said an expert had concluded the tour \"should not have taken place\". Paddleboarding expert Andrew Gratwick said in his written evidence that he considered the weir to be \"an extremely serious risk which should have been very obvious to any competent instructor\". Sentencing Lloyd at Swansea Crown Court on Wednesday, Mrs Justice Stacey told Lloyd the weir presented an \"obvious and extreme danger\" and that she \"showed a blatant disregard\" for the risk of loss of life. \"This was not a momentary lapse, your whole approach to health and safety was lax,\" she said. The judge said there were Met Office weather warnings in place at that time, as well as a flood alert issued through Natural Resources Wales. She said the footage of the incident was \"too distressing to be shown in court\". \"Having studied it, I am sure that you made no attempt to investigate or paddle to the steps which were visible from the river,\" she said. The judge said she was certain that neither Lloyd nor Mr O'Dwyer intended \"any harm to any of the participants\" but that the defendant's \"whole approach to basic health and safety was abysmal\". The court heard neither had a \"suitable qualification for this kind of activity\" and that the \"final decisions to take part\" were hers. 'Extremely dangerous' Prosecuting, Mark Watson KC said he accepted Mr O'Dwyer \"bears a share of the responsibility\" but that the defendant was \"primarily responsible for the needless loss of life\". During periods of high water levels, Haverfordwest's weir \"becomes extremely dangerous with high potential for loss of life\", according to evidence submitted by the local kayak club's health and safety officer. One bystander, who had lived near the River Cleddau for around 35 years, said \"he could not recall seeing the river ever flowing so strongly\". Mr Watson added: \"All seven participants had been completely taken by surprise by the presence of the weir and in a chaotic episode of some 20 seconds, they were all carried over the weir crest by the strong current.\" A voice message service on the day of the incident recorded Lloyd as having said: \"It's my fault 100%. I probably shouldn't have gone on the water.\" In the back of the ambulance, she was overheard telling friends that she was \"going to jail for this\". In mitigation, David Elias KC told the court that Lloyd had accepted \"full blame\" for the incident. He said she had no previous convictions, was of good character, had attempted to assist the victims at the scene and had expressed remorse. In her sentencing remarks, the judge paid tribute to the victims and their families. \"We've heard such moving accounts from the family members of those who died. Statements, which I fear, barely scratch the surface,\" she said. Mrs Justice Stacey also commended Joel Williams, a member of the public who recovered Andrea Powell from the river and commenced CPR, for his \"incredible bravery\". Speaking outside Swansea Crown Court, Ms Rogers' mother, Theresa Hall, said she lost her \"best friend\" when her daughter died on the trip. \"It's been three long years and seven months since I lost my only daughter, Morgan, my best friend. Over three years since I laid eyes on her, over three years since I heard her infectious laugh,\" she said. Ms Hall said Lloyd's failure to get next of kin details meant it took more than 12 hours for her to be informed of her daughter's death. \"My precious girl was not important to Nerys Lloyd. She couldn't give police Morgan's details, as she hadn't even bothered to get Morgan's emergency contact details in case of an accident. That was despicable,\" she added. Ms Wheatley's husband, Darren Wheatley, said the loss of his wife has \"devastated\" the family. In a statement read outside court he said: \"Losing Nicola has devastated our family and two young children lost their mammy.\" \"Any sentence served by Nerys in prison will never ease the pain of losing Nicola, and our lives will never be the same again,\" he added."
    },
    {
        "title": "Man who researched Southport killings jailed for 30 years for attempted murder of nine-year-old girl",
        "description": "A man who researched the Southport stabbings has been jailed for 30 years for the attempted murder of a nine-year-old girl.",
        "url": "https://news.sky.com/story/man-who-researched-southport-killings-jailed-for-30-years-for-attempted-murder-of-nine-year-old-girl-13354067",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jordan-wilkes-christchurch_6894673.jpg?20250423144128",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-23 14:00:00",
        "Headline": "Jordan Wilkes, 29, was convicted following the attack on 20 August last year - three weeks after the Southport stabbings.",
        "Content": " A man who researched the Southport stabbings has been jailed for 30 years for the attempted murder of a nine-year-old girl. Jordan Wilkes was convicted following the attack on 20 August last year - three weeks after the Southport stabbings. The 29-year-old stabbed the girl three times as she was playing in the stairwell of the flats where he lived with his mother in Glider Close, Christchurch, Dorset. Berenice Mulvanny, prosecuting, told Bournemouth Crown Court the victim and her friend had been playing on the stairs when Wilkes came out of his flat and approached the two youngsters while concealing a folding pocket knife. He then stabbed the victim in the neck, chest and knee while grabbing her by the arm and hair. The youngster was said to have suffered non-life-threatening injuries. Ms Mulvanny said Wilkes tore a clump of hair out from the girl which she suggested he kept as a \"trophy\" until he was told to throw it away by his mother. The girls managed to run away and get help until the emergency services arrived. Ms Mulvanny said a search of the defendant's home found a number of knives, several of which had been hidden around the premises. Analysis of his mobile phone revealed 69 files relating to YouTube videos, news articles and podcasts focused on murders and child killings. This included the so-called \"Valentine's Day massacre\" at a high school in Parkland, Florida, in 2018 in which 17 people were killed. And a day after the Southport killings, he had clicked on a link for a local dance class, the court heard. Judge William Mousley KC sentenced Wilkes to 30 years in custody with an extended five-year period on licence for attempted murder and possession of a knife, telling him: \"You are a dangerous offender, there is a significant risk of you causing serious harm to others in the future. \"This was a very serious offence, as an attempt to kill a nine-year-old child it was short-lived and not premeditated, you lost your temper. \"You had an interest in child-killing and you decided to try it out for yourself.\" The victim's family said \"justice had been delivered\" in a statement after the hearing. They said: \"We are extremely fortunate, beyond words and feelings to still have our little girl with us today, given the severity of her injuries our little girl is currently and undoubtedly will experience further challenges and difficulties for the rest her life, of which we are uncertain of the impact on her.\""
    },
    {
        "title": "New photo of Prince Louis released to mark his seventh birthday",
        "description": "Kensington Palace has released a new photograph of Prince Louis to mark his seventh birthday.",
        "url": "https://news.sky.com/story/new-photo-of-prince-louis-released-to-mark-his-seventh-birthday-13354123",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-royal-family-prince-louis_6894421.png?20250423101722",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-23 08:40:00",
        "Headline": "The picture was released on the Prince and Princess of Wales's social media accounts, showing Louis sitting on a tree trunk.",
        "Content": " Kensington Palace has released a new photograph of Prince Louis to mark his seventh birthday. Louis is pictured sitting on a tree trunk, smiling and missing his two front teeth, in the image released on the Prince and Princess of Wales's social media accounts. The photograph was accompanied by the message: \"Wishing Prince Louis a very Happy 7th Birthday!\" The young prince is dressed in an open-necked checked shirt, dark green jumper and blue jeans, with the woodland backdrop showing a carpet of bluebells. Later on Wednesday, the palace published behind the scenes footage of the photoshoot on its social media accounts. Louis is seen posing for the camera in the sunshine and playfully running up close to the lens. The prince points as he says: \"I can jump down from here\" before walking along and making a large jump off a log. The palace said the video, set to music and filmed in the style of an archive home movie, was shot by its in-house social media team. The photo was taken earlier this month in Norfolk by Yorkshire-born photographer Josh Shinner. It is not the first time he has photographed the young royal. He also took a black and white image of William, Kate, Prince George, Princess Charlotte, and Prince Louis as the family's official Christmas card photo in December 2023. Read more from Sky News:What are the chances of a British pope?How accurate is the movie Conclave?Government borrows almost £15bn more than expected The Royal Family's own X account also posted the new image of the young royal with a message, saying: \"Happy Birthday to Prince Louis!\". It was followed by balloon and celebrations emojis. The third and youngest child of the Prince and Princess of Wales, Louis is well known for his cheeky antics, from dancing at the Platinum Jubilee concert to pulling faces on the Buckingham Palace balcony. He was born on St George's Day, 23 April in 2018, at the private Lindo Wing of St Mary's Hospital in Paddington, central London, weighing 8lb 7oz."
    },
    {
        "title": "Trump accuses Zelenskyy of harming peace talks on Ukraine war and tells him to 'get it done'",
        "description": "Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\".",
        "url": "https://news.sky.com/story/trump-tells-zelenskyy-get-it-done-as-peace-talks-on-ukraine-war-downgraded-13354513",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6895024.jpg?20250423215718",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-23 19:10:00",
        "Headline": "Reports said Donald Trump is proposing the US would formally recognise Russia's occupation of Crimea - a red line for Ukraine and previously rejected by Volodymyr Zelenskyy.",
        "Content": " Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London on ending the conflict, the American president appeared to vent frustration about Mr Zelenskyy on his Truth Social platform. \"We are very close to a deal, but the man with 'no cards to play' should now, finally, GET IT DONE,\" Mr Trump said. \"I look forward to being able to help Ukraine, and Russia, get out of this complete and total MESS, that would have never started if I were president!\" Ukraine war latest: 'We are very close to deal', Trump claims Mr Trump also criticised Mr Zelenskyy for telling the Wall Street Journal that Ukraine would not accept giving up Crimea as part of a peace deal with Russia. And he accused the Ukrainian president of harming peace negotiations with \"inflammatory statements\". \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 \n                  Depth of Trump's frustration revealed in comments on Zelenskyy - and there was one notable absence in his Truth Social post\n                 \n                  Day 94: Why is Trump targeting students?  \n                 Reports say that the US president's seven-point peace plan to end the war includes a proposal that America would formally recognise Russian sovereignty over Crimea - which was annexed in 2014 and which Ukraine maintains is its territory. \"It's inflammatory statements like Zelenskyy's that makes it so difficult to settle this war,\" Mr Trump added. \"He has nothing to boast about! \"The situation for Ukraine is dire - He can have peace or, he can fight for another three years before losing the whole country.\" 👉 Listen to Sky News Daily on your podcast app 👈 Speaking later at the White House on Wednesday, Mr Trump said: \"I think we have a deal with Russia. We have to get a deal with Zelenskyy. \"I thought Zelenskyy would be easier to deal with, but so far it's harder. I think we have a deal with both.\" Asked if he was planning to meet Mr Putin soon in Saudi Arabia, he said \"probably not, but I hope to meet with him soon thereafter\". The peace plan, reported by US media over the weekend, would freeze the frontlines in Ukraine as part of the agreement. London talks on ending war downgraded It comes after Mr Rubio withdrew from a planned meeting in London on Wednesday, which the UK's Foreign Secretary David Lammy and Defence Secretary John Healey did attend. The downgraded talks were also attended by Keith Kellogg, the US envoy for Ukraine, along with other officials from France, Germany and Ukraine. Mr Rubio said last week that the US may \"walk away\" from negotiations due to a lack of progress with Russia and Ukraine - a warning now repeated by vice president JD Vance.  The UK Foreign Office said in a statement that there had been significant progress at the talks on Wednesday, and added: \"All parties reiterated their strong support for President Trump's commitment to stopping the killing and achieving a just and lasting peace.\" Read more:One notable absence in Trump's post on Zelenskyy - analysis'Trump will walk away from peace talks in two weeks' | Michael Clarke Q&A 'Emotions have run high' - Zelenskyy On Wednesday evening, the Ukrainian president said \"emotions have run high today\" but stressed all sides \"expressed their views and respectfully received each other's positions\" during the London talks. Mr Zelenskyy said on social media: \"The American side shared its vision. Ukraine and other Europeans presented their inputs. \"And we hope that it is exactly such joint work that will lead to lasting peace.\" He also said, however, that \"Ukraine will always act in accordance with its constitution,\". And he posted a screenshot of the Crimea Declaration - which says the US refuses to recognise Russia's claim to Crimea - made by former US secretary of state Mike Pompeo in 2018, during Mr Trump's first term as president. It also comes after Ukrainian officials said nine people were killed and almost 50 injured in the city of Marhanets after a Russian drone hit a bus carrying workers on Wednesday morning. Russia also launched \"a massive\" drone attack on the central Ukrainian region of Poltava, injuring at least six people, the emergency service said in a post on the Telegram messaging app."
    },
    {
        "title": "Depth of Trump's frustration revealed in comments on Zelenskyy - and there was one notable absence in his Truth Social post",
        "description": "The White House is desperate for a breakthrough.",
        "url": "https://news.sky.com/story/russia-ukraine-war-trump-very-close-to-a-deal-or-very-close-to-blaming-zelenskyy-for-the-lack-of-one-13354479",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6894945.jpg?20250423194802",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-04-23 17:58:00",
        "Headline": "Donald Trump vowed to end Russia's war on Ukraine within 24 hours of returning to the White House. It's now day 94 of his presidency, and his officials say the US is ready to \"move on\".",
        "Content": "\n          News correspondent\n              @skydavidblevins\n The White House is desperate for a breakthrough. Donald Trump vowed to end the Russia-Ukraine war within 24 hours of assuming office. This is day 94 of his second presidency. Ukraine war latest: 'We are very close to deal', Trump claims  Last Friday, US secretary of state Marco Rubio warned that America was ready to \"move on\" if there wasn't a deal soon. If that comment, reinforced by President Trump, was designed to put pressure on Ukraine, it didn't have the desired effect. That became clear when Rubio pulled out of peace negotiations in London, a summit downgraded to technical talks. \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 \n                  Trump accuses Zelenskyy of harming peace talks on Ukraine war and tells him to 'get it done'\n                 \n                  Day 94: Why is Trump targeting students?  \n                 It's not that Ukraine's President Volodymyr Zelenskyy won't back down, it's that he can't. The US plan to recognise Russia's claim to Ukrainian territory it has seized effectively legitimises Moscow's decision to invade. To concede that would be a breach of Ukraine's constitution.  The country's economy minister Yuliia Svyrydenko says they're \"ready to negotiate, not ready to surrender\". US vice president JD Vance has now stepped into Marco Rubio's shoes, warning that America will \"walk away\" if there isn't a \"yes\" from both sides. But President Trump is only talking about one side: Ukraine. The absence of any reference to Russian President Vladimir Putin in his lengthy post online will not have gone unnoticed. He claimed no one was asking Zelenskyy to recognise Crimea as Russian, but contradicted that by asking why Ukraine hadn't fought for Crimea 11 years ago. Read more from Sky News:Istanbul hit by 6.2 magnitude earthquakeChancellor outlines red lines for US trade deal President Trump blamed the loss of Crimea on one of his predecessors, his reference to \"President Barack Hussein Obama\" revealing the depth of his frustration. He claims he is \"very close\" to a deal, but the signals from Washington, London, Moscow and Kyiv suggest otherwise. Right now, it feels like he's much closer to throwing in the towel and throwing Zelenskyy under the bus. Again."
    },
    {
        "title": "Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says",
        "description": "Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said.",
        "url": "https://news.sky.com/story/trump-wants-to-emulate-putin-and-govern-us-in-a-similar-fashion-his-former-national-security-adviser-says-13354554",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-23 20:40:00",
        "Headline": "Fiona Hill told The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\".",
        "Content": " Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said. Fiona Hill told Sky News' The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\". She said the two leaders \"have shockingly similar world views\". Ukraine war latest: Trump hits out at Zelenskyy \"This is the first time we've had a US president who wants to emulate the Russian leader in some way, who wants to create a hyper-personalised presidency, who wants to basically govern his own country in a very similar fashion, very top down without any checks and balances,\" she said. Ms Hill added Mr Trump wants to \"regularise, normalise and reset\" the relationship between the US and Russia. \"That's very clear, it's been clear since the first presidency of Trump,\" she said. \"He's always wanted to sit down with Vladimir Putin and sort out all of the difficulties in the bilateral relationship, everything from nuclear issues and nuclear arms reduction - there's all kinds of economic and business deals that Trump himself and his immediate circle are very interested in. \"That was not the direction of travel of other US presidents. So in actual fact there's probably more chance under Trump of a close relationship between the US and Putin.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' Ms Hill said Mr Trump has an interest in forging a \"personal relationship\" beyond what he already has with Mr Putin. \"He wants to extricate the United States from its support for Ukraine, he's said that very clearly,\" she said. \"He also wants to pull back from the underpinning of European security and get the Europeans to pick up not just support for Ukraine, but also much more involvement and much more in-depth payment for all of their own security, that's also very clear. \"So there is a strategic perspective there and I think part of the US strategy and the Trump administration strategy is to push the Europeans to go off essentially on their owns in terms of framing what they want in European security and making it very clear to the Ukrainians that they can't expect much more future support from the United States.\" It comes as Mr Trump claimed a deal to end Russia's war in Ukraine is \"very close\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London aimed at ending the conflict, the American president heaped pressure on Volodymyr Zelenskyy to \"get it done\"."
    },
    {
        "title": "What it was like seeing the open coffin of Pope Francis",
        "description": "How to describe the moment when you see the open coffin of Pope Francis?&#160;",
        "url": "https://news.sky.com/story/what-it-was-like-seeing-the-open-coffin-of-pope-francis-13354466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-rome-italy_6894920.jpg?20250423184140",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-04-23 17:23:00",
        "Headline": "Thousands of Catholic faithful, including cardinals and nuns, have already taken the chance to view the Pope's casket, despite the seemingly endless queue, and, given the importance of the moment, they can't be blamed for using their phones to capture it.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  How to describe the moment when you see the open coffin of Pope Francis?  How to sum up an experience that was shared with many, but which felt so intimate? Fortunate, memorable, touching, and emotional. Above all, unique. Well, let's start at the beginning. We, along with other members of the global media, were invited into the basilica by the Vatican in order to see the lines of people filing past the coffin; to bear witness to the emotions, the sounds. To this demonstration of faith. As we start to walk over, we know we are the lucky ones. The queue to get into the basilica stretches into the distance - there are people waiting eight hours for the chance to see the coffin. By contrast, we are ushered in through a side door. We round a corner, walking against a tide of people, until we enter the huge, soaring chamber in which the Pope's coffin lies in state. A beam of sunshine is lighting up an imposing statue, created by the genius of Bernini and now looking down upon the Pope. I can see Francis's hands crossed on his chest. His coffin is large, resting on the floor, but it is not ostentatious. You can see the red cloth of his vestments.  It is one thing to be told that the Pope has died, but quite another to witness the proof. Perhaps that is why so many are queuing for this moment - to bring closure, as much as to offer thanks. Setting glistens with gold The setting is extraordinary. St Peter's Basilica is a simply astonishing building that glistens with gold and whose domed ceiling rises to the sky. Francis wanted to eschew the extravagance of previous papal funerals, but there is no avoiding the splendour of his surroundings. By his coffin, soaring up, is the huge canopy known as St Peter's Baldachin, which covers the altar. Beneath it, so Christians believe, is the tomb of St Peter. This is one of the holiest places in Christianity, and the Pope lies alongside it. Around his coffin are four soldiers from the Swiss Guard, dressed in their familiar red, blue, and yellow uniforms.  No sense of rush A rope runs around the coffin, marking off the area. There are a few seats on one side for notable dignitaries to use when paying their respects. On the other side is a space for senior members of the Catholic church to pray and give thanks. As we watch, there are two cardinals using this space, including the Italian Matteo Zuppi, a contender to be the next pope. I can see his mouth moving in prayer, his head bowed. The chamber is thronged with people, but there is no sense of rush. The queue of people runs round the edge of half the room, but it is orderly, shuffling ever forward. And there is such a blend of people - nuns and priests, but also families dressed for a day in the sun, teenagers in football shirts, grandparents in their finery. Some come in black, others in suits, some in scruffy old T-shirts. I see three nuns come past, followed by a young woman in jeans and a T-shirt. The nuns are smiling; the woman is sobbing. We learn it's impossible to predict who will be affected most. You do not get to linger long at the front - maybe a few seconds - but it is an opportunity that divides. Phones are a constant sight Some make a cross; some offer a prayer; some take a selfie. Mobile phones are a constant sight. At any given moment, I can see dozens of them held in the air, capturing photos of the scene. It's hard to say whether these phones damage the mood, bruising the sombre sense of intimacy, or whether they add to the idea that this is as much about celebrating life as it is about bemoaning death. Maybe both can be true. It is an emotional experience, whether you have faith or not. What is remarkable here is not the sight of Pope Francis's coffin, not the hands arranged on his chest, nor the ceremony around St Peter's. Read more:Inside Vatican City at moment of high tensionWho will be at the Pope's funeral - and who won't be What is extraordinary - and what will live with me - is that so many people are prepared to queue for hour after hour in the beating sun to quietly offer thanks to a man that hardly any of them had ever met, but many felt they knew. Like the Queen before, what really matters is not the scene that people will see, but rather the fact that they are so desperate to come."
    },
    {
        "title": "India closes Pakistan border and expels diplomats over Kashmir 'terror attack' ",
        "description": "India has closed a border crossing, suspended a water-sharing treaty and downgraded diplomatic ties with Pakistan, a day after a militant attack in Kashmir that left at least 26 people dead and 17 others wounded.",
        "url": "https://news.sky.com/story/india-closes-pakistan-border-and-expels-diplomats-over-kashmir-terror-attack-13354538",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kashmir-india-pakistan_6895027.jpg?20250423211307",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-23 20:00:00",
        "Headline": "India blames Pakistan for the attack in which 26 people, mostly Indian tourists, were killed in a scenic area popular with visitors, but Islamabad has denied involvement and a previously unknown militant group has claimed responsibility.",
        "Content": " India has closed a border crossing, suspended a water-sharing treaty and downgraded diplomatic ties with Pakistan, a day after a militant attack in Kashmir that left at least 26 people dead and 17 others wounded. India blames its neighbour for Tuesday's assault in Pahalgam, a popular tourist destination in the Indian-held part of the territory, which both nuclear-armed nations claim as their own. Pakistan, which said it was \"concerned at the loss of tourists' lives\", has denied involvement.  Officials said 24 of the people killed were Indian tourists. One was from Nepal, and another was a local tourist guide. It was the worst attack in years targeting civilians, and many shops and businesses in Kashmir closed to protest the killings. India's foreign secretary, Vikram Misri, told reporters on Wednesday that a special cabinet meeting called by Prime Minister Narendra Modi decided that the attack had \"cross-border\" links to Pakistan, without providing evidence. Mr Misri said the main land border crossing between the countries would be closed and that the 1960 Indus Water Treaty, under which the countries share a river system vital to both, would be suspended until Pakistan stopped supporting \"cross-border terrorism\". A number of Pakistani diplomats in New Delhi had been asked to leave, and Indian diplomats were recalled from Pakistan. Islamabad would respond on Thursday, Pakistan's foreign minister Ishaq Dar said. Tens of thousands of Indian police and soldiers have been deployed to hunt the attackers, stopping vehicles, and using helicopters, while former militants were questioned at police stations, reports said. Police called the assault a \"terror attack\" and blamed militants fighting against Indian rule. Kashmir Resistance, a previously unknown militant group, claimed responsibility for the attack on social media, protesting the settlement of more than 85,000 \"outsiders\" in the region. Those targeted were not \"ordinary tourists\" but \"were linked to and affiliated with Indian security agencies\", it said, in messages that could not be independently verified. Kashmir has seen a spate of deadly attacks on Hindus since New Delhi ended the region's semi-autonomy in 2019 and drastically curbed dissent, civil liberties and media freedoms, but Tuesday's deadly attack was the first time tourists have been targeted. Despite the frequency of violence, millions of visitors have been lured to the region's Himalayan foothills, encouraged by India's promotion of the scenic area. Read more:What it was like to see the Pope's coffinTrump blames Ukraine - againDramatic arrest video of man who attempted to murder girl Following the attack, panicked tourists started to leave Kashmir. Monojit Debnath, from Kolkata, told the Press Trust of India Kashmir was beautiful, but he and his family were leaving as \"we should think about what safety we have here for us\"."
    },
    {
        "title": "Women in Iran increasingly deciding not to wear headscarves in public",
        "description": "Women in Iran are increasingly deciding not to wear the veil in public, a senior journalist who visited Tehran has said.",
        "url": "https://news.sky.com/story/women-in-iran-increasingly-deciding-not-to-wear-headscarves-in-public-13354450",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-tehran_6894932.jpg?20250423185332",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-23 16:44:00",
        "Headline": "NBC News chief foreign correspondent Richard Engel said women's issues are \"one of the most sensitive issues and one of the issues that's really at the cultural and political heart of the regime\".",
        "Content": "Women in Iran are increasingly deciding not to wear the veil in public, a senior journalist who visited Tehran has said. Speaking on Sky News podcast The World with Richard Engel and Yalda Hakim, NBC News's chief foreign correspondent Richard Engel said women's issues are \"one of the most sensitive issues and one of the issues that's really at the cultural and political heart of the regime\". Women in Iran are required to cover their hair and wear long, loose-fitting clothes to disguise their hair in public under Iran's Sharia law. Mr Engel said although there are signs in restaurants, cafes and hotels telling them they have to wear Islamic dress according to the law, women are \"brazenly\" not listening to them anymore. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 \"You walk down the street and I would say just by observation, maybe 30-40% of women are not wearing headscarves anymore,\" he said. Instead, the women would wear a little scarf around their necks \"in case there's an issue\", allowing them to \"quickly just pull it over their hair\". \n                  Inside Iran special - how close is a nuclear deal?\n                 \n                  'Goalposts being moved' as Iran hits out at change of location for nuclear talks with US\n                 \n                  US-Iran talks exceeded expectations - but the first round was the easy bit\n                 \"They're walking by the police stations, they're walking by government ministries. I've seen people walking with the women with their hair out, walking right past groups of what you would consider the morality police, and they don't say anything. \"They have stopped enforcing it on a daily basis and that is a significant change.\"  'I'm not sure this is the end of the road' But he added: \"I don't think they have given up. I'm not sure that this is the end of the road.\" Mr Engel said protests across the country following the death of 22-year-old Mahsa Amini in September 2023, which were countered with a \"brutal\" crackdown, \"seem to have made a difference\". \"The government, at least right now, has decided it doesn't want to fight that fight and it is not picking that fight. And people here are hoping that that is the start of significant changes.\" 'People are talking about it' The reprieve could be temporary, he added, explaining: \"It could be that the government has other priorities right now and therefore has put this one on the back burner, but it is happening and it's obvious and people are talking about it.\" He said one woman had done a TV interview without her headscarf on with her \"long hair down to below her shoulders\" - something that would have been \"unthinkable\" a few years ago. \"Even in north Tehran years ago, people may not have been wearing them, or they were barely wearing them, but if we interviewed them on camera, they would quickly wrap themselves up so they wouldn't get in trouble, even if they found it personally annoying. \"Now she said 'let's do it' and didn't care. That's a sense of confidence that I've never seen in this country.\" 'Incredibly brave' Yalda Hakim, Sky News's lead world news presenter, said it was \"incredibly brave\". \"We can't overstate how brave it is because it was a death sentence before for these women. It was unthinkable for them not to have their headscarves on,\" she said."
    },
    {
        "title": "Israeli troops shot at Gaza aid workers from 'point-blank range', leaked documents reportedly show",
        "description": "New details from the Israeli military's investigation into the killings of 15 aid workers in Gaza on 23 March directly contradict the IDF's official narrative.",
        "url": "https://news.sky.com/story/israeli-troops-shot-at-gaza-aid-workers-from-point-blank-range-leaked-documents-reportedly-show-13354441",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dandf-teaser-rafah_6894864.png?20250423173725",
        "type": "World",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-04-23 16:33:00",
        "Headline": "Documents reviewed by Israeli newspaper Haaretz show that IDF investigators were \"not convinced\" by a deputy commander's claim that he misidentified aid vehicles as Hamas.",
        "Content": "By Ben van der Merwe, digital investigations journalist  New details from the Israeli military's investigation into the killings of 15 aid workers in Gaza on 23 March directly contradict the IDF's official narrative. Among the findings reported by Israeli newspaper Haaretz is the revelation that materials gathered by the IDF show soldiers fired at the aid workers from \"point-blank\" range during the attack. The IDF has said there was \"no shooting from close distance\" during the attack, but Sky News previously revealed that some shots were fired from as close as 12 metres away from one of the medics. The revelations by Haaretz - contained in IDF documents leaked to the publication - come just days after Sky News released its investigation into the killings, which found major gaps and inconsistencies in the IDF's version of events. On Sunday, two days after Sky News' investigation was published, the IDF put out a summary of the findings from its official investigation into the 23 March killing of 15 aid workers.  The new statement backtracked on several key claims which Sky News had proven false, including that the vehicles lacked necessary travel permissions and that they were crushed accidentally while being removed from the road. The report by Haaretz now calls into question central aspects of the IDF's latest official version of events. The new revelations contradict the IDF's account Among the new findings by Haaretz is that the medical rescue convoy was judged to be Hamas based on an interview with one Palestinian medic that was conducted by a soldier who did not speak Arabic. The IDF has said that it was on the basis of this interview, in which the survivor reportedly falsely confessed to being a Hamas member, that the soldiers were on high alert when a rescue convoy subsequently arrived at the scene. The Israeli military told Sky News on 22 April that the interview was conducted by an \"Arabic-speaking person from the team\". Haaretz also reports that the rescue convoy was driving \"slowly\" as it approached the scene, contradicting previous IDF claims that the convoy approached \"rapidly\". This backs up Sky News' analysis of a video shot from one of the convoy's ambulances, which shows it was moving at around 25 miles per hour in the moments before it arrived. IDF investigators 'not convinced' by soldier's testimony The new documents allegedly show that the IDF investigators were \"not convinced\" by the deputy commander's claims that he misidentified the rescue convoy as Hamas. \"A scenario in which Hamas operatives travel in marked rescue vehicles to a location where they know IDF troops are present is one that the army had not encountered during the fighting in Gaza,\" Haaretz reports. \"As such, neither the investigation team nor the brigade command accepted the deputy battalion commander's version.\" The IDF previously told Sky News that the commander said he was unable to see the lights on the fire truck because of his night-vision goggles, and said that investigators found this claim to be \"arguable\". The documents viewed by Haaretz also reportedly show that the IDF found the troops, when charging towards the convoy, moved in an undisciplined fashion. This contradicts previous statements by the IDF that the troops moved in a standard military formation for addressing hostile threats. Haaretz also reports that the soldiers \"kept shooting even after it was clear that no return fire was coming from the other side - and despite the cries of the aid workers who tried to identify themselves\". Burying the vehicles Among the other revelations in the Haaretz report is that soldiers were ordered to crush the medics' vehicles by their brigade commander. The IDF had previously claimed that the vehicles were crushed by accident while being removed from the road, a claim that Sky News previously proved to be false.  In its statement on Sunday, the IDF admitted that there was a \"decision\" to crush the vehicles, but did not explain the reasons behind this decision. \"Why did they have to squish them, we don't know,\" a spokesperson told Sky News. Haaretz reports that the vehicles were crushed to prevent attention being drawn to the IDF's presence in the area, in anticipation of a planned ambush. When contacted for comment, the IDF did not address any of the information contained in the new Haaretz report or Sky News' specific questions. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Istanbul hit by 6.2 magnitude earthquake - more than 150 people injured",
        "description": "More than 150 people have been injured after a powerful 6.2 magnitude earthquake shook Istanbul, one of the strongest to strike the city in recent years, Turkish officials have said.",
        "url": "https://news.sky.com/story/istanbul-hit-by-62-magnitude-earthquake-turkeys-emergency-management-agency-says-13354239",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-earthquake-turkey-istanbul_6894543.jpg?20250423125214",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-23 10:34:00",
        "Headline": "The epicentre was 25 miles (40km) southwest of Istanbul in the Sea of Marmara. So far, local authorities have said there were \"no serious cases\", but several aftershocks have been felt.",
        "Content": " More than 150 people have been injured after a powerful 6.2 magnitude earthquake shook Istanbul, one of the strongest to strike the city in recent years, Turkish officials have said. There were no immediate reports of serious damage in the city, where 16 million people live. Residents were seen running out of buildings as the quake shook the area, and 151 people were admitted to hospital after suffering injuries while \"jumping from heights\", the Istanbul governor's office said in a statement, blaming \"panic\". Pope latest - thousands queue to see Francis's body No one is in a life-threatening condition, the office said. The earthquake, which struck at 12.49pm local time (10.49am UK time), had a shallow depth of about six miles (10km), according to the United States Geological Survey. The epicentre was 25 miles (40km) southwest of Istanbul in the Sea of Marmara. \n                  Turkey protests: 1,133 detained amid unrest over president's main rival being jailed\n                 \n                  Protests sweep Turkey as Istanbul mayor - key challenger to Erdogan - appears in court \n                 \n                  Baby gorilla recovering after rescue from hold of Turkish Airlines plane\n                 It was preceded by a 3.9 magnitude earthquake at 12.13pm, according to Turkey's disaster and emergency management agency (AFAD), and followed by several aftershocks, including one measuring 5.3. Wednesday is a public holiday in Turkey, meaning many children were out of school and celebrating in the streets, when the quake hit, causing widespread panic. People were urged to stay away from buildings and reports said the earthquake was felt in several neighbouring provinces - and in the city of Izmir, 340 miles (550km) south of Istanbul. The Istanbul Metropolitan Municipality said there were \"no serious cases\" after the earthquake in a statement on social media. Many residents flocked to parks, school yards and other open areas to avoid being near buildings in case of collapse or subsequent earthquakes. Some people pitched tents in parks. Turkey's President Recep Tayyip Erdogan, at an event marking the National Sovereignty and Children's Day holiday, said: \"Thank God, there does not seem to be any problems for now. \"May God protect our country and our people from all kinds of calamities, disasters, accidents and troubles.\" Kemal Cebi, the mayor of Kucukcekmece district in western Istanbul, told local broadcaster NTV that there were \"no negative developments yet\", but he said there were traffic jams and that many buildings were already at risk due to the density of the area. Broadcaster TGRT reported that one person had been injured after they jumped off a balcony during the earthquake. Transport minister Abdulkadir Uraloglu said initial inspections showed no damage to highways, airports, trains or subways. Earthquakes are frequent in Turkey, as it is crossed by two major fault lines. In February 2023, a 7.8 magnitude earthquake, and a second powerful tremor, left more than 53,000 dead and destroyed or damaged hundreds of thousands of buildings across southern and southeastern Turkey. A further 6,000 people were killed in the northern parts of neighbouring Syria. Read more from Sky News:Apple and Meta fined hundreds of millions by EUNew photo of Prince Louis releasedWhat are the chances of a British pope? While Istanbul largely avoided the devastation wrought by that quake, it heightened fears of a similar, equally destructive episode in the future."
    },
    {
        "title": "UK vision for clean energy to collide with Trump's fossil fuel frenzy",
        "description": "Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security.",
        "url": "https://news.sky.com/story/uk-vision-for-clean-energy-to-collide-with-trumps-fossil-fuel-frenzy-13354414",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-donald-trump_6895043.png?20250423214456",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-23 15:57:00",
        "Headline": "The stakes are high for the UK's energy security summit, but hopes are modest. It has to contend with Trump's fossil fuel frenzy, while tariffs and trade wars disrupt the energy system.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security. Labour will tell ministers from 60 countries gathered for its Energy Security Summit that the transition from fossil fuels to clean power will make energy more secure because it's produced at home - as well as being a win for the climate. The stakes are high: just the small matter of stabilising the climate for years to come, as well as our energy bills. But hopes for the summit are modest, due to, unsurprisingly, Donald Trump. Trump turns up the heat with gas The US president peddles a very different view of energy security: he wants to \"drill baby drill\" for as much oil and gas as possible and pull America out of the global climate fight. He isn't sending his energy secretary Chris Wright to attend, but acting assistant secretary Tommy Joyce. \n                  'I was ready to stab whoever tried to stab me': The ex-gang members waging a war on knife crime\n                 \n                  The Magic Circle's first female member fooled them into believing she was a man - how did she do it?\n                 \n                  Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'\n                 The more junior official will still espouse Trump's vision to \"unleash US energy dominance\", which basically means keeping the world hooked on US fossil fuels - good news for the world's biggest oil and gas producer. This idea that the energy transition threatens energy security is taking root in the UK's Reform party, but is at odds with the view of the Prime Minister Sir Keir Starmer, EU chief Ursula von der Leyen, who is also attending, and the United Nations. One report by RMI found solar and wind are the cheapest option for new electricity in more than 80% of the world.  No China The UK government wants to work with America on a trade deal and some parts of the energy industry, like nuclear power. But underneath it will be hoping that the 60 other countries attending the summit will hold the line on ditching fossil fuels as fast as possible and boosting clean tech supply. That's even more urgent as the UK tries to reduce its reliance on China, which currently dominates manufacturing of clean power infrastructure like solar panels and critical minerals. That's also why the prime minister is today announcing £300m to help build wind turbines in the UK to reduce imports. But China itself is not attending - good news for rival America but a setback for the summit, given China's outsized role in the clean industries of the future. The elephant in the room Then there's the real elephant in the room, which is Trump's erratic tariffs and trade wars. No one knows how this will play out in the extremely complicated energy sector. Trump has ordered Europe to buy more of its liquefied natural gas as a way to avoid tariffs. Europe needs it: it's running low on storage and Russian pipeline supplies are dwindling. But on the flipside, his policies could paradoxically hurt both Europe's gas demand and America's gas producers, caught between fears of a recession and shaky global demand. The UK's reputation as a climate saint is not unblemished though, as it expands airports and moots further North Sea oil and gas after all. All this complexity and uncertainty forms the backdrop for the summit. Little concrete is expected to come from it - though the UK may use it to court investment. Other than that, we can expect little more than a paper summary on what energy security really means. But this is all about a fight for the narrative. And so if the IEA and other countries hold the line on clean power meaning energy security, the UK government will count that as a win."
    },
    {
        "title": "Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says",
        "description": "Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said.",
        "url": "https://news.sky.com/story/trump-wants-to-emulate-putin-and-govern-us-in-a-similar-fashion-his-former-national-security-adviser-says-13354554",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-23 20:40:00",
        "Headline": "Fiona Hill told The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\".",
        "Content": " Donald Trump wants to emulate Vladimir Putin and \"govern his own country in a similar fashion\", his former national security adviser has said. Fiona Hill told Sky News' The World with Yalda Hakim that the US and Russian presidents both share the same view of the world as being \"divided up among three major powers; Russia, the US and China, with very clear spheres of influence\". She said the two leaders \"have shockingly similar world views\". Ukraine war latest: Trump hits out at Zelenskyy \"This is the first time we've had a US president who wants to emulate the Russian leader in some way, who wants to create a hyper-personalised presidency, who wants to basically govern his own country in a very similar fashion, very top down without any checks and balances,\" she said. Ms Hill added Mr Trump wants to \"regularise, normalise and reset\" the relationship between the US and Russia. \"That's very clear, it's been clear since the first presidency of Trump,\" she said. \"He's always wanted to sit down with Vladimir Putin and sort out all of the difficulties in the bilateral relationship, everything from nuclear issues and nuclear arms reduction - there's all kinds of economic and business deals that Trump himself and his immediate circle are very interested in. \"That was not the direction of travel of other US presidents. So in actual fact there's probably more chance under Trump of a close relationship between the US and Putin.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' Ms Hill said Mr Trump has an interest in forging a \"personal relationship\" beyond what he already has with Mr Putin. \"He wants to extricate the United States from its support for Ukraine, he's said that very clearly,\" she said. \"He also wants to pull back from the underpinning of European security and get the Europeans to pick up not just support for Ukraine, but also much more involvement and much more in-depth payment for all of their own security, that's also very clear. \"So there is a strategic perspective there and I think part of the US strategy and the Trump administration strategy is to push the Europeans to go off essentially on their owns in terms of framing what they want in European security and making it very clear to the Ukrainians that they can't expect much more future support from the United States.\" It comes as Mr Trump claimed a deal to end Russia's war in Ukraine is \"very close\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London aimed at ending the conflict, the American president heaped pressure on Volodymyr Zelenskyy to \"get it done\"."
    },
    {
        "title": "Depth of Trump's frustration revealed in comments on Zelenskyy - and there was one notable absence in his Truth Social post",
        "description": "The White House is desperate for a breakthrough.",
        "url": "https://news.sky.com/story/russia-ukraine-war-trump-very-close-to-a-deal-or-very-close-to-blaming-zelenskyy-for-the-lack-of-one-13354479",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6894945.jpg?20250423194802",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-04-23 17:58:00",
        "Headline": "Donald Trump vowed to end Russia's war on Ukraine within 24 hours of returning to the White House. It's now day 94 of his presidency, and his officials say the US is ready to \"move on\".",
        "Content": "\n          News correspondent\n              @skydavidblevins\n The White House is desperate for a breakthrough. Donald Trump vowed to end the Russia-Ukraine war within 24 hours of assuming office. This is day 94 of his second presidency. Ukraine war latest: 'We are very close to deal', Trump claims  Last Friday, US secretary of state Marco Rubio warned that America was ready to \"move on\" if there wasn't a deal soon. If that comment, reinforced by President Trump, was designed to put pressure on Ukraine, it didn't have the desired effect. That became clear when Rubio pulled out of peace negotiations in London, a summit downgraded to technical talks. \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 \n                  Trump accuses Zelenskyy of harming peace talks on Ukraine war and tells him to 'get it done'\n                 \n                  Day 94: Why is Trump targeting students?  \n                 It's not that Ukraine's President Volodymyr Zelenskyy won't back down, it's that he can't. The US plan to recognise Russia's claim to Ukrainian territory it has seized effectively legitimises Moscow's decision to invade. To concede that would be a breach of Ukraine's constitution.  The country's economy minister Yuliia Svyrydenko says they're \"ready to negotiate, not ready to surrender\". US vice president JD Vance has now stepped into Marco Rubio's shoes, warning that America will \"walk away\" if there isn't a \"yes\" from both sides. But President Trump is only talking about one side: Ukraine. The absence of any reference to Russian President Vladimir Putin in his lengthy post online will not have gone unnoticed. He claimed no one was asking Zelenskyy to recognise Crimea as Russian, but contradicted that by asking why Ukraine hadn't fought for Crimea 11 years ago. Read more from Sky News:Istanbul hit by 6.2 magnitude earthquakeChancellor outlines red lines for US trade deal President Trump blamed the loss of Crimea on one of his predecessors, his reference to \"President Barack Hussein Obama\" revealing the depth of his frustration. He claims he is \"very close\" to a deal, but the signals from Washington, London, Moscow and Kyiv suggest otherwise. Right now, it feels like he's much closer to throwing in the towel and throwing Zelenskyy under the bus. Again."
    },
    {
        "title": "Trump accuses Zelenskyy of harming peace talks on Ukraine war and tells him to 'get it done'",
        "description": "Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\".",
        "url": "https://news.sky.com/story/trump-tells-zelenskyy-get-it-done-as-peace-talks-on-ukraine-war-downgraded-13354513",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6895024.jpg?20250423215718",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-23 19:10:00",
        "Headline": "Reports said Donald Trump is proposing the US would formally recognise Russia's occupation of Crimea - a red line for Ukraine and previously rejected by Volodymyr Zelenskyy.",
        "Content": " Donald Trump has claimed a deal to end Russia's war on Ukraine is \"very close\" as he heaped pressure on Volodymyr Zelenskyy to \"get it done\". Hours after US secretary of state Marco Rubio withdrew from high-level talks in London on ending the conflict, the American president appeared to vent frustration about Mr Zelenskyy on his Truth Social platform. \"We are very close to a deal, but the man with 'no cards to play' should now, finally, GET IT DONE,\" Mr Trump said. \"I look forward to being able to help Ukraine, and Russia, get out of this complete and total MESS, that would have never started if I were president!\" Ukraine war latest: 'We are very close to deal', Trump claims Mr Trump also criticised Mr Zelenskyy for telling the Wall Street Journal that Ukraine would not accept giving up Crimea as part of a peace deal with Russia. And he accused the Ukrainian president of harming peace negotiations with \"inflammatory statements\". \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 \n                  Depth of Trump's frustration revealed in comments on Zelenskyy - and there was one notable absence in his Truth Social post\n                 \n                  Day 94: Why is Trump targeting students?  \n                 Reports say that the US president's seven-point peace plan to end the war includes a proposal that America would formally recognise Russian sovereignty over Crimea - which was annexed in 2014 and which Ukraine maintains is its territory. \"It's inflammatory statements like Zelenskyy's that makes it so difficult to settle this war,\" Mr Trump added. \"He has nothing to boast about! \"The situation for Ukraine is dire - He can have peace or, he can fight for another three years before losing the whole country.\" 👉 Listen to Sky News Daily on your podcast app 👈 Speaking later at the White House on Wednesday, Mr Trump said: \"I think we have a deal with Russia. We have to get a deal with Zelenskyy. \"I thought Zelenskyy would be easier to deal with, but so far it's harder. I think we have a deal with both.\" Asked if he was planning to meet Mr Putin soon in Saudi Arabia, he said \"probably not, but I hope to meet with him soon thereafter\". The peace plan, reported by US media over the weekend, would freeze the frontlines in Ukraine as part of the agreement. London talks on ending war downgraded It comes after Mr Rubio withdrew from a planned meeting in London on Wednesday, which the UK's Foreign Secretary David Lammy and Defence Secretary John Healey did attend. The downgraded talks were also attended by Keith Kellogg, the US envoy for Ukraine, along with other officials from France, Germany and Ukraine. Mr Rubio said last week that the US may \"walk away\" from negotiations due to a lack of progress with Russia and Ukraine - a warning now repeated by vice president JD Vance.  The UK Foreign Office said in a statement that there had been significant progress at the talks on Wednesday, and added: \"All parties reiterated their strong support for President Trump's commitment to stopping the killing and achieving a just and lasting peace.\" Read more:One notable absence in Trump's post on Zelenskyy - analysis'Trump will walk away from peace talks in two weeks' | Michael Clarke Q&A 'Emotions have run high' - Zelenskyy On Wednesday evening, the Ukrainian president said \"emotions have run high today\" but stressed all sides \"expressed their views and respectfully received each other's positions\" during the London talks. Mr Zelenskyy said on social media: \"The American side shared its vision. Ukraine and other Europeans presented their inputs. \"And we hope that it is exactly such joint work that will lead to lasting peace.\" He also said, however, that \"Ukraine will always act in accordance with its constitution,\". And he posted a screenshot of the Crimea Declaration - which says the US refuses to recognise Russia's claim to Crimea - made by former US secretary of state Mike Pompeo in 2018, during Mr Trump's first term as president. It also comes after Ukrainian officials said nine people were killed and almost 50 injured in the city of Marhanets after a Russian drone hit a bus carrying workers on Wednesday morning. Russia also launched \"a massive\" drone attack on the central Ukrainian region of Poltava, injuring at least six people, the emergency service said in a post on the Telegram messaging app."
    },
    {
        "title": "Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin",
        "description": "The retrial of Harvey Weinstein has begun in New York - with a prosecutor telling the court the former Hollywood mogul used \"dream opportunities as weapons\" to prey on the three women accusing him of sexual abuse.",
        "url": "https://news.sky.com/story/harvey-weinstein-retrial-he-had-all-the-power-prosecutor-tells-court-as-opening-statements-begin-13354308",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-harvey-weinstein-court_6894833.jpg?20250423170632",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-23 12:28:00",
        "Headline": "Former Hollywood studio boss and producer Harvey Weinstein, who is now 73, is charged with raping one woman and forcing oral sex on two others. He has strenuously denied the allegations.",
        "Content": "The retrial of Harvey Weinstein has begun in New York - with a prosecutor telling the court the former Hollywood mogul used \"dream opportunities as weapons\" to prey on the three women accusing him of sexual abuse. The case is being retried five years after the landmark #MeToo case against the producer, who was once one of the industry's most powerful figures, after the appeals court last year overturned his conviction. Weinstein, who is now 73, is charged with raping one woman and forcing oral sex on two others. He has strenuously denied the allegations. Following a lengthy jury selection process due to the high-profile nature of the retrial, the prosecution has now opened its case at the same courthouse in Manhattan.  Attorney Shannon Lucey told the court the Oscar-winning producer and studio boss used \"dream opportunities as weapons\" against the female accusers. \"The defendant wanted their bodies, and the more they resisted, the more forceful he got,\" she said. Weinstein had \"enormous control over those working in TV and film because he decided who was in and who was out,\" the court heard. \"He had all the power. They had none.\" Dressed in a dark suit and navy tie, Weinstein listened to the prosecution's statement after arriving in court in a wheelchair, as he has done for his recent appearances. His lawyers are expected to outline their case later on Wednesday. The opening statements got under way after the last jurors were finally picked on Tuesday, more than a week after the selection process began. Prospective jurors were questioned about their backgrounds, life experiences and various other points that could potentially impact their ability to be fair and impartial about a case that has been so highly publicised. They have also been asked privately about their knowledge of the case and opinions on Weinstein. Seven men and five women have been chosen to hear the trial. Why is there a retrial? In 2020, Weinstein was sentenced to 23 years in prison after being found guilty of charges of sexual assault in 2006 and rape in 2013, relating to two women. But in April 2024, New York's highest court overturned the convictions due to concerns of prejudicial testimony and that the judge in the original trial had made improper rulings. Prosecutors announced a retrial last year and a separate charge concerning a third woman, who was not part of the original trial, has since been added to the case. She alleges the producer forced oral sex on her at a hotel in 2006. Weinstein has pleaded not guilty to all charges and denies raping or sexually assaulting anyone. Read more:What has happened to the #MeToo movement?Harvey Weinstein sues his brother Bob At a preliminary court hearing in January, he begged for the retrial to be held as quickly as possible due to his deteriorating health, telling the judge: \"I don't know how much longer I can hold on.\" Weinstein was also sentenced in February 2023 after being convicted of rape during a separate trial in LA - which means that even if the retrial ends in not guilty verdicts on all three counts, he will remain behind bars. His lawyers are also appealing this sentence."
    },
    {
        "title": "Thousands evacuated as wildfire sweeps through New Jersey",
        "description": "Thousands of people were evacuated as a fast-moving wildfire swept through a part of New Jersey.",
        "url": "https://news.sky.com/story/thousands-evacuated-as-wildfire-sweeps-through-new-jersey-13354162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-jersey-wildfire_6894495.jpg?20250423120843",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-23 09:06:00",
        "Headline": "Officials said no injuries had been reported while confirming the cause of the blaze is still being investigated.",
        "Content": " Thousands of people were evacuated as a fast-moving wildfire swept through a part of New Jersey. Around 3,000 residents were advised to leave their homes on Tuesday after more than 1,300 structures were identified as being at risk, the New Jersey Fire Service said. Officials said on Wednesday the evacuation orders had been lifted, but shelters had been set up at two schools. The blaze in Ocean and Lacey Townships in Ocean County had only been about 10% contained by Tuesday night, officials added. Power to about 25,000 customers was cut at the request of fire officials \"for the safety of crews\" working to tackle the dangerous conditions. The cause of the fire is being investigated. There have been no reports of injuries. A seven-mile stretch of the Garden State Parkway, one of the state's busiest routes, was forced to close due to the conditions but has since been reopened. The fire in the Greenwood Forest Wildlife Management Area started on Tuesday and has burned through more than 13.2 square miles (8,450 acres) of land, fire officials said. Read more from Sky News:Apple and Meta fined hundreds of millions by EUNew photo of Prince Louis releasedWhat are the chances of a British pope? Debi Schaffer was caught in gridlocked traffic after evacuating with her two dogs - while her husband had stayed behind with their 22 chickens, The Press Of Atlantic City reported. \"I wanted to take them in the car with me - can you imagine 22 chickens in a car?\" she told the newspaper. She said the conditions around her home had become something \"like a war zone\" and described the smoke, sirens and the sound of helicopters."
    },
    {
        "title": "Apple and Meta fined millions by EU over competition law",
        "description": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules.",
        "url": "https://news.sky.com/story/apple-and-meta-fined-millions-by-eu-over-competition-law-13354190",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-23 09:54:00",
        "Headline": "Apple is fined for stopping app makers from pointing to cheaper options outside the App Store, and Meta for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them.",
        "Content": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules. They are the first companies to be fined for breaching a new law designed to increase competition in the EU's digital economy. Apple was fined €500m (£428m) for stopping app makers from pointing to cheaper options outside the App Store - and Meta fined €200m (£171m) for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them. The fines were issued under the EU's Digital Markets Act (DMA), a series of rules designed to give consumers and businesses more choice and to prevent big tech from cornering digital markets. The EU's decisions were expected to be announced in March but officials reportedly held off because of the escalating trade war with US President Donald Trump. Mr Trump has repeatedly complained about regulations from Brussels affecting American companies. In February, the White House issued a statement saying it would \"consider responsive actions like tariffs\" in the face of fines and policies that foreign governments levy on American firms. Read more:UK 'will be among hardest hit' by trade warHow Trump changed his mind on tariffs  Both companies have issued complaints about the EU penalties. Apple accused the commission of \"unfairly targeting\" the iPhone maker, saying it has \"spent hundreds of thousands of engineering hours and made dozens of changes to comply with this law\". Meta's chief global affairs officer Joel Kaplan said in a statement: \"The Commission is attempting to handicap successful American businesses while allowing Chinese and European companies to operate under different standards.\" The DMA is designed to ensure \"citizens have full control over when and how their data is used online, and businesses can freely communicate with their own customers,\" said Henna Virkkunen, the commission's executive vice president for tech sovereignty. \"The decisions adopted today find that both Apple and Meta have taken away this free choice from their users and are required to change their behaviour,\" she said."
    },
    {
        "title": "Trade war: Stock markets rally as Trump rows back on Fed and China threats",
        "description": "Global stock markets and the dollar have rallied on hopes of two significant climbdowns by the Trump administration on issues blamed for a slump in values.",
        "url": "https://news.sky.com/story/trade-war-stock-markets-rally-as-trump-rows-back-on-fed-and-china-threats-13354024",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6889533.jpg?20250417232617",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-04-23 04:44:00",
        "Headline": "There is something resembling a relief rally under way across the world - but market analysts caution there is a long way to go before confidence can be fully restored.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Global stock markets and the dollar have rallied on hopes of two significant climbdowns by the Trump administration on issues blamed for a slump in values. Remarks by the US Treasury secretary on punitive tariffs against China lifted the mood on Wall Street initially before the president himself moved to calm market trade war worries and also end speculation he could fire the head of the country's central bank. The Dow Jones Industrial Average and tech-focused Nasdaq Composite both ended Tuesday trading 2.7% up, erasing losses of the previous day. Money latest: Are Treasury-backed savings now the best place for your cash? Asian markets later followed that lead, with the Hang Seng in Hong Kong gaining 2.4%. European indices also saw a strong opening, with the FTSE 100 up by more than 1.2%. It was led higher by Asia-focused banks HSBC and Standard Chartered. US futures suggested Wall Street would pick up where it left off, with further strong gains expected. \n                  'Now is our  time': Despite tariffs, China's Silicon Valley is ready to make its mark on the world\n                 \n                  100% chance that Bank of England will cut interest rates next month, markets predict\n                 \n                  UK economy will be among hardest hit by global trade war, IMF warns\n                 The US dollar - badly hit by trade war implications in recent weeks - was at least a cent higher than a day earlier against many rival currencies including the pound. The rally gathered steam on Tuesday evening when US Treasury secretary Scott Bessent told a private JPMorgan event that he expected a \"de-escalation\" in the spiralling spat with China. It's a fight that has seen US tariffs hit 145% and China responding with duties of 125%.  According to a transcript obtained by the Associated Press news agency, he told the audience: \"Neither side thinks the status quo is sustainable\", but he added that peace talks were yet to start in earnest and could take time to bear fruit. His boss later struck a similar tone in remarks to reporters when he said the final tariff rate with China would come down \"substantially\" from the current 145%. \"It won't be that high, not going to be that high,\" Mr Trump said, adding: \"We're doing fine with China... we're going to live together very happily and ideally work together.\" He gave no hint that he plans to ease wider tariffs on trading partners, including the UK which is currently subject to 25% tariffs on car, steel and aluminium imports and a wider 10% \"baseline\" tariff. But the president did row back on an apparent threat, made last week, to sack the chair of the Federal Reserve Jerome Powell in revenge for the US central bank holding off on interest rate cuts that could provide some stimulus to the tariff-hit economy. Mr Powell has said the Trump administration's protectionist policies have created uncertainty over growth and the threat of higher inflation. The president has dismissed those arguments but told reporters: \"I have no intention of firing him\". His comments were widely seen as an attempt to calm financial market concerns that the independence of the country's central bank was under threat. Analysts cautioned there was a long way to go to recover values seen before the start of the trade war, with the Nasdaq remaining almost 16% down in the year to date alone. US government borrowing costs also remain elevated.  Not helping sentiment were big downgrades to global growth forecasts by the International Monetary Fund on Tuesday. Michael Brown, senior research strategist at Pepperstone, said of the investor mood: \"Participants understandably remain jittery, not only as the haven value of both Treasuries and the USD (US dollar) continue to be called into question, but also as a huge degree of trade uncertainty continues to linger. \"As a reminder, the whole concept of '90 deals in 90 days' is currently running at '0 deals in 14 days' which, to be frank, doesn't quite have the same ring to it.\""
    },
    {
        "title": "Chancellor Rachel Reeves outlines red lines for US trade deal",
        "description": "Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed.",
        "url": "https://news.sky.com/story/chancellor-outlines-red-lines-for-us-trade-deal-13354411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6894889.jpg?20250423175938",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-23 15:50:00",
        "Headline": "Compromise on the Online Safety Act has been ruled out by Rachel Reeves as she said the safety of children is non-negotiable.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed. Rachel Reeves was speaking ahead of a pivotal meeting with her American counterpart in Washington DC. In an interview with Sky News, Ms Reeves said she was \"confident\" that a deal would be reached but said she had red lines on food and car standards, adding that changes to online safety were \"non-negotiable for the British government\". The comments mark the firmest commitment to a slew of rules and regulations that have long been a gripe for the Americans. Money blog: Private UK island loved by Rihanna and Stormzy for sale The US administration is pushing for the UK to relax rules on agricultural exports, including hormone-treated beef. While Britain could lower tariffs on some agricultural products that meet regulations, ministers have been clear that it will not lower its standards. \n                  Government borrows almost £15bn more than expected\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 However, the government has been less firm with its stance on online safety. A tech red line The US tech industry has fiercely opposed Britain's Online Safety Act, which was introduced in 2023 and requires tech companies to shield children from harmful content online. In an earlier draft UK-US trade deal, the British government was considering a review of the bill in the hope of swerving US tariffs. However, the chancellor suggested that this was no longer on the table. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" she said. She added that Britain was \"not going to water down areas of road safety\", a move that could pave the way for American SUVs that have been engineered to protect passengers but not pedestrians. While non-tariff barriers will remain intact, it was reported on Tuesday night that the UK could lower its automotive tariff from 10% to 2.5%. Business and economics correspondent What can Britain offer the Americans if it's not prepared to lower its standards? Donald Trump has previously described non-tariff barriers that block US exporters as \"cheating\". Britain does have some scope to bring down tariff rates - and Rachel Reeves suggested that this was her focus - but ours is already a highly open economy, we don't have huge scope to cut tariff rates. The real prize for the Americans is in the realm of these non-tariff barriers. There has been much speculation about what the UK could offer up, but the chancellor on Wednesday gave a comprehensive commitment that she would not dilute standards. There are many who will breathe a collective sigh of relief - from UK farmers to road safety campaigners and parents of young children. While the government is sensitive to any potential public backlash, it also has another factor to think about. When Ms Reeves arrives back home, she will begin preparations for a UK-EU summit in London next month.  The UK's food and road safety standards are, in many areas,  in sync with Europe, and Britain is seeking even deeper integration. Lowering standards for the Americans would make that deeper alignment with the Europeans impossible. The chancellor has to decide which market is more valuable to Britain. The answer is Europe. Back at home, the chancellor suggested that she was still open to relaxing rules on the City of London, even though global financial markets have endured a period of turmoil, triggered by President Trump's trade war. Reforms at home? In her Mansion House speech last November, the chancellor said post-2008 reforms had \"gone too far\" and set the course for deregulating the City. Asked if that was a wise move in light of the recent sharp swings in the financial markets, Ms Reeves said: \"I want regulators to regulate not just for risk but also for growth. \"We are making reforms and we have set out new remit letters to our financial services regulators.\" Britain's borrowing costs hit their highest level in almost 30 years after Mr Trump's Liberation Day tariffs announcements, a stark reminder that policy decisions in the US have the power to raise UK bond yields and in turn, affect the chancellor's budget, dent her already small fiscal headroom and derail her plans for tax and spend. However, the chancellor said she would not consider adapting her fiscal rules, which include a promise to cover day-to-day spending with tax receipts, even if it gives her more room to manoeuvre in the face of volatility. \"Fiscal rules are non-negotiable for a simple reason, that Britain must offer under this government fiscal and financial stability, which is so important in a world of global uncertainty,\" she said."
    },
    {
        "title": "Government borrows almost £15bn more than expected",
        "description": "The UK government borrowed almost &#163;15bn more than forecast in the last financial year, according to official figures highlighting contributions from inflation-related costs, including pay awards.",
        "url": "https://news.sky.com/story/government-borrows-almost-16315bn-more-than-expected-13354050",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-spring-statement_6868767.jpg?20250327182507",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-23 06:12:00",
        "Headline": "The borrowing figure for the last financial year comes in far higher than the Office for Budget Responsibility had expected in its updated forecasts issued just last month.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK government borrowed almost £15bn more than forecast in the last financial year, according to official figures highlighting contributions from inflation-related costs, including pay awards. The Office for National Statistics (ONS) reported that borrowing - the difference between total public sector spending and income - over the 12 months to the end of March came in at £151.9bn. That provisional sum was £20.7bn more than in the same twelve-month period a year earlier and £14.6bn more than the £137.3bn forecast by the Office for Budget Responsibility (OBR) at the spring statement just a month ago, the body said. Money latest: Are Treasury-backed savings now the best place for your cash? It added that the figure represented 5.3% of the UK's gross domestic product (GDP), 0.5 percentage points more than in 2023/24. It was partly driven by £16.4bn of borrowing in March - the third-highest March borrowing since monthly records began in 1993. The provisional data left public sector net debt at 95.8% of GDP at the end of March. That is 0.2 percentage points higher than at the end of March 2024. \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 Higher borrowing is partly a consequence of government investment and spending decisions announced in the chancellor's autumn budget last year. But it is also a result of higher costs to service government debt, with the ONS data showing a bill of £4.3bn for March alone. Elevated bond yields, which reflect a higher risk premium demanded by investors in return for holding UK government debt, are a result of greater turmoil in the global economy and unease over domestically generated inflation and weak growth at a time of continued strain for the public purse.  Rachel Reeves was forced to use her spring statement in March to restore a £10bn buffer to the public finances to avoid breaking her own fiscal rules. ONS chief economist Grant Fitzner said of the data: \"Our initial estimates suggest public sector borrowing rose almost £21bn in the financial year just ended as, despite a substantial boost in income, expenditure rose by more, largely due to inflation-related costs, including higher pay and benefit increases. \"At the end of the financial year, debt remained close to the annual value of the output of the economy, at levels last seen in the early 1960s.\"  The government's efforts to bring down costs include a crackdown on the welfare bill and a renewed focus on securing growth in the economy. However, business groups say the chancellor's decision to impose an additional tax burden on employment from this month, mainly through higher minimum wage and employer national insurance contributions, will backfire and harm both employment and investment. Household spending power is also set to face further strain as inflation is tipped to rise beyond 3% due to a slew of rising costs in the economy, including bills for energy and water. Read more from Sky News:Stock markets rally as Trump rows back on Fed and China threatsMusk says his time working for Trump to 'drop significantly' The impact of the US trade war is also starting to be felt. A closely watched index of activity in the service and manufacturing sectors fell into negative territory, with its weakest reading since November 2022. The survey of purchasing managers by S&P Global found export orders falling at their fastest pace since early 2020. AJ Bell head of financial analysis, Danni Hewson, said of the data: \"Many of the challenges facing the UK economy are beyond the chancellor's control and she is currently in Washington trying to strike a deal with the US administration on tariffs that will cushion the UK without selling off the family silver. \"One of the big questions is how those changes to employer National Insurance will impact next month's numbers, especially with inflation linked benefits and the state pension rising at the same time. \"Many people will now be eyeing that headroom created back in March which had always seemed rather insubstantial, and wondering how much will be left by the autumn.\" Responding to the figures, Chief Secretary to the Treasury Darren Jones said the government would always be responsible when it came to the public finances. He added: \"We are laser-focused on making sure taxpayer money is delivering our Plan for Change missions to put more money in people's pockets, rebuild the NHS and strengthen our borders.\" But shadow chancellor Mel Stride said: \"By fiddling the fiscal rules, increasing borrowing by £30bn a year and piling up debt - these figures are alarming but not surprising.\""
    },
    {
        "title": "Shawbrook weighs alternative to float with £5bn Starling merger approach",
        "description": "Shawbrook Group, the mid-sized British lender, has made a tentative approach to Starling Bank about a &#163;5bn merger as its owners try to avoid relying on a moribund backdrop for UK stock market listings.",
        "url": "https://news.sky.com/story/shawbrook-weighs-alternative-to-float-with-1635bn-starling-merger-approach-13354405",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-starling-bank-money-blog_6704126.jpg?20241002134035",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-23 15:34:00",
        "Headline": "Shawbrook Group has approached Starling Bank about a possible combination, although it has not yet tabled a detailed proposal about the terms of any deal, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Shawbrook Group, the mid-sized British lender, has made a tentative approach to Starling Bank about a £5bn merger as its owners try to avoid relying on a moribund backdrop for UK stock market listings. Sky News has learnt that Shawbrook reached out to Starling in the last two months to gauge its interest in a deal. City sources said on Wednesday that the approach was \"highly preliminary\" and did not involve any detail about the proposed terms of a transaction. There are not understood to be any live discussions between the two sides, although the door has been left ajar for Shawbrook to return with a formal offer, the sources added. Money blog: Private UK island loved by Rihanna and Stormzy up for sale It is not the first time that Shawbrook has informally contacted Starling about a deal, and insiders said there was little visibility about whether a combination of the two banks would progress further. Nevertheless, the disclosure that Shawbrook, which is controlled by the private equity firms BC Partners and Pollen Street Capital, has broadened its sights beyond a public listing of its shares will fuel expectations of a new round of consolidation among Britain's mid-tier lenders. \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  Government borrows almost £15bn more than expected\n                 \n                  Money blog: M&S says sorry to customers amid contactless meltdown - and warns of coming changes\n                 It also underlines the difficulty of taking banks public at a valuation which is attractive to their existing shareholders, given the ratings of existing listed peers. Shawbrook and its owners have examined a number of merger opportunities in the past, including exploring a merger with Metro Bank when the latter was in serious financial distress in 2023. Just weeks earlier, Shawbrook sounded out the Co-operative Bank about a £3.5bn all-share merger in an attempt to pre-empt a wider auction of the former mutually owned lender. That was also rebuffed, with the Co-operative Bank completing its sale to the Coventry Building Society earlier this year. Sky News revealed in January that Shawbrook's owners had hired bankers to prepare for an initial public offering in the first half of the year. That timetable has slipped in recent months, and people close to the company dismissed recent reports that the change in the timing of an IPO was in any way connected to the market turmoil triggered by President Donald Trump's tariffs policy. One obstacle to a merger between Shawbrook and Starling would be the valuation ascribed to the latter business by its shareholders. Many Starling investors believe the company is worth at least £3bn and would prefer to hold out for a higher valuation as its technology platform, Engine, continues to grow. There would, however, be logic to a combination of the two banks, with both having a meaningful presence in the business lending market. BC Partners and Pollen Street Capital took Shawbrook private in 2017 after a stint on the London stock market. Starling Bank has also been repeatedly tipped as a listing candidate, although any significant merger would inevitably delay such plans. London has been fighting to overturn the impression that its public markets have become a troubled arena for public companies, afflicted by a lack of liquidity and weaker valuations than they might attract in the US. Shawbrook, which employs close to 1,600 people, has more than 550,000 customers. Founded in 2011, it was established as a specialist savings and lending institution, providing loans for home improvement projects and weddings, as well as business and real estate lending. It is among a crop of mid-tier lenders, including OneSavings Bank, Aldermore Bank and Paragon Bank, which have collectively become a significant part of Britain's banking landscape since the last financial crisis. Starling Bank, meanwhile, has grown rapidly as part of a crop of digital banks which also includes Monzo. Shawbrook declined to comment on Wednesday, while Starling Bank has been contacted for comment."
    },
    {
        "title": "Birmingham bin strike resolution 'could be in touching distance' - as conciliation service drafted in",
        "description": "A deal to resolve the Birmingham bin strike could be \"in touching distance\", the Unite union has announced. ",
        "url": "https://news.sky.com/story/birmingham-bin-strike-resolution-could-be-in-touching-distance-as-conciliation-service-drafted-in-13354350",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-birmingham-bins_6880107.jpg?20250408185239",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-23 14:06:00",
        "Headline": "Industrial action by members of Unite has seen thousands of tonnes of rubbish go uncollected and warnings of a public health emergency in Birmingham.",
        "Content": "A deal to resolve the Birmingham bin strike could be \"in touching distance\", the Unite union has announced.  The action by members of Unite, which began on 11 March as part of a dispute over pay, has seen thousands of tonnes of rubbish go uncollected and warnings of a public health emergency in the city. Talks to end the strike are to involve the conciliation service Acas for the first time, signalling that an agreement could be close. Unite secretary general Sharon Graham said that while a deal is close, \"Birmingham City Council is again guilty of saying one thing in public and another in the negotiations\". Read more: All you need to know about the bin strike dispute \"This flip flopping needs to be sorted prior to the Acas negotiations next week, so the dispute can be resolved and end the uncertainty for workers and the misery for Birmingham residents,\" she added. \"The threats of savage pay cuts must also now cease for drivers. Unite has put forward workable proposals. The ball is now in the council's court.\" \n                  How long have Birmingham bin strikes been going on - and why is it taking so long to settle dispute?\n                 \n                  Birmingham bin strikes: How residents are taking action to avoid 'drowning in rubbish'\n                 \n                  UB40 say striking Birmingham bin workers 'shouldn't give up'\n                 More than 350 Unite union workers staged walkouts in January, before deciding to escalate into indefinite strike action in March, citing fear over further attacks on their jobs, pay and conditions.  As a result, rubbish was left piled on pavements and residents complained of a risk to public health, as rotting food attracted foxes, cockroaches and rats. In response, the government called in military planners to help provide logistical support to Birmingham's council. Communities minister Jim McMahon said on Tuesday that \"significant progress\" had been made in dealing with the remaining tonnes of rubbish through \"a concerted effort\" and with the assistance of other councils, private operators and workers. He added that 26,000 tonnes of excess waste had been removed, and the levels were \"approaching normal\". Read more from Sky News:Woman jailed over deaths of four paddleboardersMeta 'too slow' to deal with violent posts during UK riots Before the latest round of talks today, members rejected the council's latest offer on 14 April by 97% on 60% turnout, saying it was \"totally inadequate\" and did not address potential pay cuts for 200 drivers. Deputy Prime Minister Angela Rayner visited Birmingham earlier this month and called on the union to accept a \"significantly improved\" deal for workers."
    },
    {
        "title": "Trade war: Stock markets rally as Trump rows back on Fed and China threats",
        "description": "Global stock markets and the dollar have rallied on hopes of two significant climbdowns by the Trump administration on issues blamed for a slump in values.",
        "url": "https://news.sky.com/story/trade-war-stock-markets-rally-as-trump-rows-back-on-fed-and-china-threats-13354024",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6889533.jpg?20250417232617",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-23 04:44:00",
        "Headline": "There is something resembling a relief rally under way across the world - but market analysts caution there is a long way to go before confidence can be fully restored.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Global stock markets and the dollar have rallied on hopes of two significant climbdowns by the Trump administration on issues blamed for a slump in values. Remarks by the US Treasury secretary on punitive tariffs against China lifted the mood on Wall Street initially before the president himself moved to calm market trade war worries and also end speculation he could fire the head of the country's central bank. The Dow Jones Industrial Average and tech-focused Nasdaq Composite both ended Tuesday trading 2.7% up, erasing losses of the previous day. Money latest: Are Treasury-backed savings now the best place for your cash? Asian markets later followed that lead, with the Hang Seng in Hong Kong gaining 2.4%. European indices also saw a strong opening, with the FTSE 100 up by more than 1.2%. It was led higher by Asia-focused banks HSBC and Standard Chartered. US futures suggested Wall Street would pick up where it left off, with further strong gains expected. \n                  'Now is our  time': Despite tariffs, China's Silicon Valley is ready to make its mark on the world\n                 \n                  100% chance that Bank of England will cut interest rates next month, markets predict\n                 \n                  UK economy will be among hardest hit by global trade war, IMF warns\n                 The US dollar - badly hit by trade war implications in recent weeks - was at least a cent higher than a day earlier against many rival currencies including the pound. The rally gathered steam on Tuesday evening when US Treasury secretary Scott Bessent told a private JPMorgan event that he expected a \"de-escalation\" in the spiralling spat with China. It's a fight that has seen US tariffs hit 145% and China responding with duties of 125%.  According to a transcript obtained by the Associated Press news agency, he told the audience: \"Neither side thinks the status quo is sustainable\", but he added that peace talks were yet to start in earnest and could take time to bear fruit. His boss later struck a similar tone in remarks to reporters when he said the final tariff rate with China would come down \"substantially\" from the current 145%. \"It won't be that high, not going to be that high,\" Mr Trump said, adding: \"We're doing fine with China... we're going to live together very happily and ideally work together.\" He gave no hint that he plans to ease wider tariffs on trading partners, including the UK which is currently subject to 25% tariffs on car, steel and aluminium imports and a wider 10% \"baseline\" tariff. But the president did row back on an apparent threat, made last week, to sack the chair of the Federal Reserve Jerome Powell in revenge for the US central bank holding off on interest rate cuts that could provide some stimulus to the tariff-hit economy. Mr Powell has said the Trump administration's protectionist policies have created uncertainty over growth and the threat of higher inflation. The president has dismissed those arguments but told reporters: \"I have no intention of firing him\". His comments were widely seen as an attempt to calm financial market concerns that the independence of the country's central bank was under threat. Analysts cautioned there was a long way to go to recover values seen before the start of the trade war, with the Nasdaq remaining almost 16% down in the year to date alone. US government borrowing costs also remain elevated.  Not helping sentiment were big downgrades to global growth forecasts by the International Monetary Fund on Tuesday. Michael Brown, senior research strategist at Pepperstone, said of the investor mood: \"Participants understandably remain jittery, not only as the haven value of both Treasuries and the USD (US dollar) continue to be called into question, but also as a huge degree of trade uncertainty continues to linger. \"As a reminder, the whole concept of '90 deals in 90 days' is currently running at '0 deals in 14 days' which, to be frank, doesn't quite have the same ring to it.\""
    },
    {
        "title": "Apple and Meta fined millions by EU over competition law",
        "description": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules.",
        "url": "https://news.sky.com/story/apple-and-meta-fined-millions-by-eu-over-competition-law-13354190",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-23 09:54:00",
        "Headline": "Apple is fined for stopping app makers from pointing to cheaper options outside the App Store, and Meta for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them.",
        "Content": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules. They are the first companies to be fined for breaching a new law designed to increase competition in the EU's digital economy. Apple was fined €500m (£428m) for stopping app makers from pointing to cheaper options outside the App Store - and Meta fined €200m (£171m) for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them. The fines were issued under the EU's Digital Markets Act (DMA), a series of rules designed to give consumers and businesses more choice and to prevent big tech from cornering digital markets. The EU's decisions were expected to be announced in March but officials reportedly held off because of the escalating trade war with US President Donald Trump. Mr Trump has repeatedly complained about regulations from Brussels affecting American companies. In February, the White House issued a statement saying it would \"consider responsive actions like tariffs\" in the face of fines and policies that foreign governments levy on American firms. Read more:UK 'will be among hardest hit' by trade warHow Trump changed his mind on tariffs  Both companies have issued complaints about the EU penalties. Apple accused the commission of \"unfairly targeting\" the iPhone maker, saying it has \"spent hundreds of thousands of engineering hours and made dozens of changes to comply with this law\". Meta's chief global affairs officer Joel Kaplan said in a statement: \"The Commission is attempting to handicap successful American businesses while allowing Chinese and European companies to operate under different standards.\" The DMA is designed to ensure \"citizens have full control over when and how their data is used online, and businesses can freely communicate with their own customers,\" said Henna Virkkunen, the commission's executive vice president for tech sovereignty. \"The decisions adopted today find that both Apple and Meta have taken away this free choice from their users and are required to change their behaviour,\" she said."
    },
    {
        "title": "Ladbrokes-owner Entain gambles on search for new chair",
        "description": "Entain, the FTSE 100 gambling group which owns Ladbrokes, has kicked off a secret search for a new chairman, deepening the protracted uncertainty over the company's leadership.",
        "url": "https://news.sky.com/story/ladbrokes-owner-entain-gambles-on-search-for-new-chair-13354071",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-ladbrokes-entain-rank_6550010.jpg?20240511111456",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-23 07:23:00",
        "Headline": "The gambling group has asked headhunters to identify a successor to Stella David even as she fills the role of interim CEO for a second time, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Entain, the FTSE 100 gambling group which owns Ladbrokes, has kicked off a secret search for a new chairman, deepening the protracted uncertainty over the company's leadership. Sky News has learnt that Entain, which has a market value of about £3.65bn, has instructed headhunters to identify a successor to chair Stella David, who is currently in her second stint as its interim chief executive. City sources said a number of candidates had been approached about replacing Ms David in recent weeks. Money latest: Are Treasury-backed savings now the best place for your cash? The search implies either Ms David will herself become CEO on a permanent basis, or that she will leave the company altogether soon after a new CEO is recruited from elsewhere. One insider suggested that if she remained in the interim CEO role for a sustained period, she risked being deemed not to be independent if she sought to return to the chairmanship of the group. The latest uncertainty over Entain's management risks fuelling unrest among investors battered by a string of governance and performance mishaps. \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  Government borrows almost £15bn more than expected\n                 \n                  Money blog: M&S says sorry to customers amid contactless meltdown - and warns of coming changes\n                 Entain is scheduled to stage its annual general meeting on Wednesday morning, where it may be quizzed about the leadership hiatus. Read more from Sky News:Stock markets rally as Trump rows back on Fed and China threatsGovernment borrows almost £15bn more than expectedMusk says his time working for Trump to 'drop significantly' Gavin Isaacs stepped down as chief executive in February after just five months in the job, with the company saying his departure was \"by mutual agreement\". It failed to offer a more detailed reason for his exit, although industry rumours suggested the and Ms David had failed to build a viable working relationship. Entain declined to comment."
    },
    {
        "title": "Could the local elections reshape British politics?",
        "description": "Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May.",
        "url": "https://news.sky.com/story/could-the-local-elections-reshape-british-politics-13354168",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-bedenoch_6894706.jpg?20250423151711",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-04-23 09:13:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all happening on 1 May.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Can Reform UK turn votes into seats - and from there into power? How far do the Tories have to fall? How unpopular is Labour now that it's in government? We find out on local election day on 1 May. Next Thursday will see three types of elections A total of 23 councils are up for grabs - most in places we once called Tory shires, until last year's general election. This includes 14 county councils, all but two of which have been Conservative-controlled, as well as eight unitary authorities, all but one of which are Tory. Then finally, there is Doncaster council, a Labour-held borough. Kemi Badenoch claims they could lose all the councils they are contesting, setting expectations as low as possible. Then there are mayoral elections - four of them powerful metro mayors for the combined authorities, two of which are being elected for the first time. That's on top of two directly elected borough mayors. Read more: Where are the local elections and how can you vote? \n                  Robert Jenrick vows to 'bring coalition together' to end Tory-Reform fight\n                 \n                  'Stop Brexit Man' cleared of flouting police ban with anti-Brexit edits of Muppet Show and Darth Vader\n                 \n                  Rishi Sunak's former aide among 15 people charged with election betting offences\n                 Thirdly, there's a by-election triggered after the Labour MP Mike Amesbury resigned in March. He was found guilty of assault after being filmed repeatedly punching a man late at night. For the council elections, this is what happened in 2021 when these councils were last up. The baseline we'll measure the results against. Notice the Tories are defending so many, so they're the ones facing the biggest losses - \"well into the hundreds\", says Sky News' election analyst Michael Thrasher. But look at Reform too - it barely existed back in 2021, so that's on zero. This is why this set of elections is going to be so interesting. 2021, when these councils were last up, the Tories were riding high - their best night for 13 years on the National Equivalent Vote, which works out the national picture based on the local results. Labour did so badly Sir Keir Starmer considered resigning. Since then, the Tories have plummeted - halved in vote share if you look at polls. Labour down too. Lib Dems the same and Greens strong in places. But jockeying for joint first place: Reform UK - who are putting up the most candidates of any party - now contesting 99% of the seats. However, as Reform leader Nigel Farage knows only too well, votes don't always mean seats. Look at this snapshot from the past - 2013. The same set of elections. Labour got 21% of the votes and 21% of the seats. But Farage's UKIP got 21% of the vote and 8% of the seats. Then there are the mayors. Labour won all four that were contested last time, although one stepped down. Could Reform get its first taste of power in Lincolnshire? Or could it even be the Runcorn by-election? A massive long-shot - it's Labour's 49th safest seat. But will this northwest seat be the most important moment of the night? Labour insiders say they're still hopeful. There are signs our politics could be changing profoundly - 1 May could point to a new future."
    },
    {
        "title": "Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'",
        "description": "Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey...",
        "url": "https://news.sky.com/story/sky-news-political-editor-beth-rigby-running-london-marathon-in-honour-of-dearest-friend-13354228",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-beth-rigby-marathon_6894439.jpg?20250423110315",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-04-23 10:15:00",
        "Headline": "Last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart.",
        "Content": "\n          Political editor\n              @BethRigby\n Sky News political editor and host of the Electoral Dysfunction podcast Beth Rigby shares her London Marathon journey... I used to say I was never going to attempt to run a marathon: too hard, too long, too much training. But later this week, I am going to join 56,000 others and run the London Marathon. It is honestly something I never thought I would do. I took up running in my 30s, somewhere between quitting smoking and having my children. I am not a natural long-distance runner. I am neither long nor lean. At school, I was better in a sprint than cross country. But struggling to breathe as you try to run a couple of kilometres is a great motivator not to pick up a Marlboro light again. So, I persevered and in 2017 ran my first half marathon. Since then, I have run another five half marathons. Every time I crossed the finish line, I did so in wonderment that I'd run that far and completed the race, followed by utter bafflement as to why anyone would want to put themselves through running that distance all over again. I was never going to run a marathon. But then last summer, my dearest friend Laura died from ovarian cancer after a two-year illness. She was just 48 years old, our birthdays just six days apart. Her death was absolutely devastating for her husband and her two sons, her family and friends. She died on June 17 in the middle of the general election campaign. I was in between presenting the Sky News Battle for No 10 election show - it was the last thing Laura watched on television - and preparing for the overnight election results show. Laura had been seriously ill for a number of weeks, but her death was quite sudden. I found myself reeling with grief, but I had to keep going, so that's what I did. When I came out of the other side of that election and contemplated life without Laura, well, it was like staring into a massive black hole. We called Laura our North Star because she was the doer and the leader. There was no one in my life as full of life and energy as Laura. She was irrepressible, infectious and very funny. She filled every room she entered, every conversation she joined, every endeavour she began. I'm sure there will be many of you out there who have lost someone you deeply love who can relate to this - the desolation and loneliness you feel in those days and months afterwards as you try to come to terms with their absence from your daily life. I know what Laura would have said, she'd have told me to get on with it and soon after her funeral, I quietly decided to run the London Marathon. It was my attempt to \"get on with it\" and in the process do something positive in Laura's memory by raising money for the North London Hospice, who cared for her with such attention and empathy during the final stages of her life.  So this is how I went from never ever running a marathon to attempting the world's biggest race this week and I am not doing it alone: when I told my friend Esme Wren about it - we did our first half marathon together back in 2017 - she signed up too, so we've been on the journey together, which has make it all a little less daunting and a little more doable. Because marathon training - and the prospect of running for 26.2 miles - is full on, physically and mentally. For me it has involved running three times a week for 16 weeks, I have managed most of them running over 220 miles (that's over 350km) in that time. One is an interval run, in which you run very fast in short bursts, an easy run and then a long run. Between trying to fit in the runs, the family and being Sky News' political editor with a very unpredictable schedule and frequent trips abroad, I have been - forgive the pun - run ragged. Marathon training is just really time-intensive and, as BBC news presenter and runner extraordinaire Sophie Raworth told me - one massive upside of marathon training is the gang you become part of - there are no short-cuts when it comes to marathon training. You have to put in the miles, when it's cold and dark and raining and you'd rather be doing anything else. There was one occasion in early February when the only time I could do my long run - at this point an 8-miler - was on a Friday afternoon at 4pm. I ran down the canal path, first towards the Olympic Park in Stratford, before turning off to pick up Regents Canal towards Islington, went the wrong way and found myself lost on a deserted canal path, in the dark, being lashed by the driving rain. I decided that this was a very bad idea and came off the canal to find I'd somehow got myself to Stepney Green Tube station. Like a modern-day Dick Whittington, I followed the City of London's skyline to make my way home, picking up the train home from Liverpool Street (and a bottle of wine to celebrate my survival). There is also the camaraderie. Tom Larkin, one of our brilliant producers at Sky News and a super runner, has offered all sorts of advice, from which gels to use - you take a gel every few miles into the race to refuel - to carb loading before the race. He also pointed out to me when I was pondering why I got stomach cramping on my first 16 miler, that trying to run that far on an empty stomach lined by just an espresso was, well, suboptimal to say the least. Sophie Raworth has been absolutely lovely and given me tonnes of advice too, from showing me great canal loops (and helping me not get lost) to giving me advice on which trainers to try. One famous actor explained to me why I should absolutely keep to my pace and resist the adrenaline urge to go too fast at the start (his horror story about crippling lactic acid build-up in his legs at mile 20 was truly terrifying). There is also the sheer admiration you develop for those people you know who run marathons. One former senior Labour adviser revealed to me he had run a dozen marathons when I told him of my own attempt. I was so impressed by this that I told everyone I could about it whenever he was in my vicinity. Eventually, realising he was probably finding it a bit embarrassing, I stopped going on about it. But 12 marathons! There are also politicians who have shared funny stories. Lord Vaizey, who raised £18,000 for charity when he ran the London Marathon in 2021, recounted how, somewhere in the depths of the race as he struggled on with an injury and a big dose of fatigue, he saw a small child pointing at him and shouting Mr Potato Head. Ed Vaizey was rather put out by it: \"I thought, who's he calling Mr Potato Head? I don't look like Mr Potato Head.\" Shortly afterwards, Ed was overtaken by a runner dressed up as Mr Potato Head. Read more:Four mistakes to avoid if you're running the London MarathonHow the London Marathon is seeking to 'change the face of running' Then there's the incredible generosity. I have been blown away by family, friends, colleagues, and complete strangers who have donated to the North London Hospice in Laura's memory. Hospice care is only partially funded by the government and the sector relies on charitable donations to keep it going, with a third of its funding coming from the NHS, while the rest is made up of donations and the hospice's 17 charity shops. Over 200 people have donated more than £11,500 to our marathon efforts. It has literally been rocket fuel in my trainers. Too long, too hard, too much training: preparing for the marathon has felt like all of these things at different points in the past four months. But it has also been rewarding and enriching, as I achieved things I didn't think I could and found a lovely camaraderie with fellow runners along the way. And as for the grief, this marathon has become more than just a just a way of getting on with it, by literally putting one foot in front of the other: It has also become, through pounding the canal paths where Laura and I once walked, to the fundraising and conversations I've had with her family and friends about it, a way of celebrating and remembering Laura. So, wish me luck on Sunday and if you see me running/shuffling past, give me a wave. To follow Beth's journey to the finish line, visit her Instagram page: https://www.instagram.com/bethrigbysky/"
    },
    {
        "title": "Chancellor Rachel Reeves outlines red lines for US trade deal",
        "description": "Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed.",
        "url": "https://news.sky.com/story/chancellor-outlines-red-lines-for-us-trade-deal-13354411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6894889.jpg?20250423175938",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-23 15:50:00",
        "Headline": "Compromise on the Online Safety Act has been ruled out by Rachel Reeves as she said the safety of children is non-negotiable.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Britain will not lower its standards or water down regulation in exchange for a trade deal with the US, the chancellor has confirmed. Rachel Reeves was speaking ahead of a pivotal meeting with her American counterpart in Washington DC. In an interview with Sky News, Ms Reeves said she was \"confident\" that a deal would be reached but said she had red lines on food and car standards, adding that changes to online safety were \"non-negotiable for the British government\". The comments mark the firmest commitment to a slew of rules and regulations that have long been a gripe for the Americans. Money blog: Private UK island loved by Rihanna and Stormzy for sale The US administration is pushing for the UK to relax rules on agricultural exports, including hormone-treated beef. While Britain could lower tariffs on some agricultural products that meet regulations, ministers have been clear that it will not lower its standards. \n                  Government borrows almost £15bn more than expected\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 However, the government has been less firm with its stance on online safety. A tech red line The US tech industry has fiercely opposed Britain's Online Safety Act, which was introduced in 2023 and requires tech companies to shield children from harmful content online. In an earlier draft UK-US trade deal, the British government was considering a review of the bill in the hope of swerving US tariffs. However, the chancellor suggested that this was no longer on the table. \"On food standards, we've always been really clear that we're not going to be watering down standards in the UK and similarly, we've just passed the Online Safety Act and the safety, particularly of our children, is non-negotiable for the British government,\" she said. She added that Britain was \"not going to water down areas of road safety\", a move that could pave the way for American SUVs that have been engineered to protect passengers but not pedestrians. While non-tariff barriers will remain intact, it was reported on Tuesday night that the UK could lower its automotive tariff from 10% to 2.5%. Business and economics correspondent What can Britain offer the Americans if it's not prepared to lower its standards? Donald Trump has previously described non-tariff barriers that block US exporters as \"cheating\". Britain does have some scope to bring down tariff rates - and Rachel Reeves suggested that this was her focus - but ours is already a highly open economy, we don't have huge scope to cut tariff rates. The real prize for the Americans is in the realm of these non-tariff barriers. There has been much speculation about what the UK could offer up, but the chancellor on Wednesday gave a comprehensive commitment that she would not dilute standards. There are many who will breathe a collective sigh of relief - from UK farmers to road safety campaigners and parents of young children. While the government is sensitive to any potential public backlash, it also has another factor to think about. When Ms Reeves arrives back home, she will begin preparations for a UK-EU summit in London next month.  The UK's food and road safety standards are, in many areas,  in sync with Europe, and Britain is seeking even deeper integration. Lowering standards for the Americans would make that deeper alignment with the Europeans impossible. The chancellor has to decide which market is more valuable to Britain. The answer is Europe. Back at home, the chancellor suggested that she was still open to relaxing rules on the City of London, even though global financial markets have endured a period of turmoil, triggered by President Trump's trade war. Reforms at home? In her Mansion House speech last November, the chancellor said post-2008 reforms had \"gone too far\" and set the course for deregulating the City. Asked if that was a wise move in light of the recent sharp swings in the financial markets, Ms Reeves said: \"I want regulators to regulate not just for risk but also for growth. \"We are making reforms and we have set out new remit letters to our financial services regulators.\" Britain's borrowing costs hit their highest level in almost 30 years after Mr Trump's Liberation Day tariffs announcements, a stark reminder that policy decisions in the US have the power to raise UK bond yields and in turn, affect the chancellor's budget, dent her already small fiscal headroom and derail her plans for tax and spend. However, the chancellor said she would not consider adapting her fiscal rules, which include a promise to cover day-to-day spending with tax receipts, even if it gives her more room to manoeuvre in the face of volatility. \"Fiscal rules are non-negotiable for a simple reason, that Britain must offer under this government fiscal and financial stability, which is so important in a world of global uncertainty,\" she said."
    },
    {
        "title": "Robert Jenrick vows to 'bring coalition together' to end Tory-Reform fight",
        "description": "Robert Jenrick has vowed to \"bring this coalition together\" to ensure that Conservatives and Reform UK are no longer fighting each other for votes by the time of the next election, according to a leaked recording obtained by Sky News.",
        "url": "https://news.sky.com/story/robert-jenrick-vows-to-bring-coalition-together-to-end-tory-reform-fight-13354004",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-conservative-robert-jenrick_6703995.jpg?20241002121255",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-04-23 05:50:00",
        "Headline": "The senior Tory can be heard telling students he would try \"one way or another\" to make sure Reform UK and the Tories do not compete at another general election.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Robert Jenrick has vowed to \"bring this coalition together\" to ensure that Conservatives and Reform UK are no longer fighting each other for votes by the time of the next election, according to a leaked recording obtained by Sky News. The shadow justice secretary told an event with students last month he would try \"one way or another\" to make sure Reform UK and the Tories do not compete at another general election and hand a second term in office to Sir Keir Starmer in the process. In the exclusive audio, Mr Jenrick can be heard telling the students he is still working hard to put Reform UK out of business - the position of the Tory leader Kemi Badenoch. However, more controversially, the comments also suggest he can envisage a time when that position may no longer be viable and has to change. He denies any suggestion this means he is advocating a Tory-Reform UK pact. Follow the latest politics news here The shadow justice secretary came second to Mrs Badenoch in the last leadership contest and is the bookies' favourite to replace her as the next Conservative leader. Speaking to the UCL Conservative association dinner in late March, he can be heard saying: \"[Reform UK] continues to do well in the polls. And my worry is that they become a kind of permanent or semi-permanent fixture on the British political scene. And if that is the case, and I say, I am trying to do everything I can to stop that being the case, then life becomes a lot harder for us, because the right is not united. \"And then you head towards the general election, where the nightmare scenario is that Keir Starmer sails in through the middle as a result of the two parties being disunited. I don't know about you, but I'm not prepared for that to happen. \"I want the right to be united. And so, one way or another, I'm determined to do that and to bring this coalition together and make sure we unite as a nation as well.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 This is the furthest a member of the shadow cabinet has gone in suggesting that they think the approach to Reform UK may evolve before the next general election. Last night, Mr Jenrick denied this meant he was advocating a pact with Reform UK. Sir Keir used Prime Minister's Questions on Wednesday to accuse Ms Badenoch of having \"lost control of her party\" and said Mr Jenrick and Reform leader Nigel Farage are \"cooking up their joint manifesto\". \"The member for Clacton (Mr Farage) is going to do what he always does - eat the Tory party for breakfast,\" he added. Read more:Badenoch dismisses 'threat' from JenrickYour ultimate guide to the local elections  A source close to Mr Jenrick said: \"Rob's comments are about voters and not parties. He's clear we have to put Reform out of business and make the Conservatives the natural home for all those on the right, rebuilding the coalition of voters we had in 2019 and can have again. But he's under no illusions how difficult that is - we have to prove over time we've changed and can be trusted again.\" Mrs Badenoch has said in interviews that she cannot see any circumstances in which the Tories under her leadership would do a deal with Reform UK. Richard Fuller, the Conservative's shadow chief secretary to the Treasury, insisted to Sky News Mr Jenrick was not talking about a coalition, but meant if you divide up \"the right\" then \"you end up with a far left government\" and \"we want to make sure we don't repeat that mistake\". Reform UK's deputy leader Richard Tice told Sky News \"competition is a good thing\" and for people who do not want to vote for Labour, \"they've got to vote for common sense, courage and leadership, and you only get that from Reform UK\". \"Frankly, they [the Conservatives] should disappear into sort of yester-year,\" he said. \"And we are at a once in a century moment where a new party is taking over from the Conservatives.\" Mr Tice added: \"Robert, you're saying some good things on justice. But you're in the wrong party, chap.\" Chair of the Labour Party, Ellie Reeves, said: \"I think people have the right to know what they're voting for when they go to the polls, are they voting for a coalition of chaos or voting Conservative, getting Reform, voting Reform, getting Conservative? \"These grubby backroom deals Jenrick seems to be talking about, they need to come clean about it, Badenoch needs to come clean about it.\" In next week's local elections, Reform UK will compete directly against the Tories in a series of contests from Kent to Lincolnshire. At last year's general election, in more than 170 of the 251 constituencies lost by the Conservatives the Reform vote was greater than the margin of the Tories' defeat. Today's YouGov/Sky voting intention figures put Reform UK in front on 25%, Labour on 23% and the Conservatives on 20%, with the Lib Dems on 16% and Greens on 10%."
    },
    {
        "title": "Robert Jenrick's leaked plan for Reform",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/robert-jenricks-plan-for-reform-13354029",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-23 05:10:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈"
    },
    {
        "title": "NEU teaching union executives meet to draw up plans for strike action",
        "description": "Plans for strike action were set to be drawn up by the UK's largest teaching union when its executive met on Wednesday evening, Sky News has learnt.",
        "url": "https://news.sky.com/story/top-brass-of-neu-teaching-union-meets-to-draw-up-plans-for-strike-action-13354258",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-daniel-kebede-ational-education-union_6774877.jpg?20241213130641",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-04-23 11:08:00",
        "Headline": "The special executive of the National Education Union were meeting on Wednesday evening to discuss plans for industrial action while it waits for a final pay offer from the government.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Plans for strike action were set to be drawn up by the UK's largest teaching union when its executive met on Wednesday evening, Sky News has learnt. The special executive of the National Education Union (NEU) were expected to map out a number of scenarios in a full ballot for industrial action while it waits for a final pay offer from the government. The Department for Education (DfE) has proposed a 2.8% pay rise for the 2025/26 financial year, saying it was an \"appropriate\" offer that would \"maintain the competitiveness\" of teachers' pay despite a \"challenging financial backdrop\". It comes on top of the 5.5% pay rise accepted by teachers last year for 2024/25, which followed eight days of strikes in England in 2023. However, the NEU, led by general secretary Daniel Kebede, has rejected the 2.8% offer as \"unacceptable\" and \"unfunded\". Instead, the union is calling for a fully funded, above-inflation pay rise - although it has not put a figure on the proposal it would like to receive. Mr Kebede has also criticised the government for suggesting schools could pay for it by making \"efficiencies\" in their budgets, saying schools have already faced years of cuts. \n                  Free breakfast clubs set to open at hundreds of schools in England - but teachers voice fears over funding\n                 \n                  Upskirted teacher says women being 'targeted' by misogynistic attitudes in classroom\n                 \n                  'Andrew Tate phenomena' surges in schools - with boys refusing to talk to female teacher\n                 'Anger and fear about what is happening in education' The government will only finalise its offer once it has received the recommendations of the School Teachers' Review Body (STRB), which makes recommendations on the pay of school teachers in England. The DfE has not yet published the STRB recommendations or its decision on whether to accept them - but it is expected that this will happen imminently. A source on the executive told Sky News there was \"real clarity about the impact of an unfunded pay award\", adding: \"There is a lot of anger and fear about what is happening in education.\" They said any potential strike action, if approved, would be targeted at the first half of the autumn term and so would be unlikely to affect student exams. In an indicative electronic ballot that was launched at the beginning of March, 93.7% of NEU respondents turned down the proposed 2.8% pay rise, while 83% of teachers said they would be willing to take industrial action to secure a better deal. However, the result was achieved on a turnout of 47.2% - lower than what would be needed if the union's formal ballot is to be successful. Under trade union legislation, the NEU must achieve a turnout of 50% in both the teacher and support staff ballots. Some 40% of those eligible to vote must back strike action for it to go ahead. The government has promised to repeal the 2016 Trade Union Act but has delayed the process until after electronic balloting has been introduced. Read more:Teaching unions gear up for fight over AI job-loss fears'Andrew Tate phenomena' surges in schools The source on the NEU executive said: \"The decision of the NEU conference was that schools can't afford an unfunded pay rise - we are already seeing redundancies in London and that situation is going to be dire next year. \"Schools are suffering an improvement and retention crisis, morale is bad and teaching is not high on the list of well-paid graduate jobs.\" They said that as well as pay, teachers were also concerned about the new Ofsted inspection system and the impact AI could have on de-skilling the profession and job losses. Education Secretary Bridget Phillipson said: \"With school staff, parents and young people working so hard to turn the tide on school attendance, any move towards industrial action by teaching unions would be indefensible. \"Following a 5.5% pay award in hugely challenging fiscal context, I would urge NEU to put children first.\" The NEU has been approached for comment."
    },
    {
        "title": "Birmingham bin strike resolution 'could be in touching distance' - as conciliation service drafted in",
        "description": "A deal to resolve the Birmingham bin strike could be \"in touching distance\", the Unite union has announced. ",
        "url": "https://news.sky.com/story/birmingham-bin-strike-resolution-could-be-in-touching-distance-as-conciliation-service-drafted-in-13354350",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-birmingham-bins_6880107.jpg?20250408185239",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-23 14:06:00",
        "Headline": "Industrial action by members of Unite has seen thousands of tonnes of rubbish go uncollected and warnings of a public health emergency in Birmingham.",
        "Content": "A deal to resolve the Birmingham bin strike could be \"in touching distance\", the Unite union has announced.  The action by members of Unite, which began on 11 March as part of a dispute over pay, has seen thousands of tonnes of rubbish go uncollected and warnings of a public health emergency in the city. Talks to end the strike are to involve the conciliation service Acas for the first time, signalling that an agreement could be close. Unite secretary general Sharon Graham said that while a deal is close, \"Birmingham City Council is again guilty of saying one thing in public and another in the negotiations\". Read more: All you need to know about the bin strike dispute \"This flip flopping needs to be sorted prior to the Acas negotiations next week, so the dispute can be resolved and end the uncertainty for workers and the misery for Birmingham residents,\" she added. \"The threats of savage pay cuts must also now cease for drivers. Unite has put forward workable proposals. The ball is now in the council's court.\" \n                  How long have Birmingham bin strikes been going on - and why is it taking so long to settle dispute?\n                 \n                  Birmingham bin strikes: How residents are taking action to avoid 'drowning in rubbish'\n                 \n                  UB40 say striking Birmingham bin workers 'shouldn't give up'\n                 More than 350 Unite union workers staged walkouts in January, before deciding to escalate into indefinite strike action in March, citing fear over further attacks on their jobs, pay and conditions.  As a result, rubbish was left piled on pavements and residents complained of a risk to public health, as rotting food attracted foxes, cockroaches and rats. In response, the government called in military planners to help provide logistical support to Birmingham's council. Communities minister Jim McMahon said on Tuesday that \"significant progress\" had been made in dealing with the remaining tonnes of rubbish through \"a concerted effort\" and with the assistance of other councils, private operators and workers. He added that 26,000 tonnes of excess waste had been removed, and the levels were \"approaching normal\". Read more from Sky News:Woman jailed over deaths of four paddleboardersMeta 'too slow' to deal with violent posts during UK riots Before the latest round of talks today, members rejected the council's latest offer on 14 April by 97% on 60% turnout, saying it was \"totally inadequate\" and did not address potential pay cuts for 200 drivers. Deputy Prime Minister Angela Rayner visited Birmingham earlier this month and called on the union to accept a \"significantly improved\" deal for workers."
    },
    {
        "title": "Starmer urges MPs to 'lower temperature' of trans debate - and refuses to accept he's changed his stance",
        "description": "Sir Keir Starmer has urged MPs to \"lower the temperature\" of the transgender debate as he refused to accept he had changed his stance.",
        "url": "https://news.sky.com/story/starmer-urges-mps-to-lower-temperature-of-trans-debate-and-refuses-to-accept-hes-changed-his-stance-13354298",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-badenoch-starmer_6894532.jpg?20250423123616",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-23 12:25:00",
        "Headline": "Kemi Badenoch accused the prime minister of not \"having the balls\" to express his views after the Supreme Court ruling on the definition of a woman.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has urged MPs to \"lower the temperature\" of the transgender debate as he refused to accept he had changed his stance. Conservative leader Kemi Badenoch used Prime Minister's Questions to press Sir Keir on previous comments he has made about transgender women. The prime minister has previously said \"transwomen are women\", but after the Supreme Court ruled last week the definition of a \"woman\" is a \"biological woman\", he said on Tuesday that \"a woman is an adult female\". Politics latest: Starmer says Farage will 'eat Tory party for breakfast' Ms Badenoch asked if the PM now accepts his previous comments were \"wrong\" to which Sir Keir repeated he welcomes the ruling as \"it brings clarity\". He said his and the government's approach is \"to support and implement the Supreme Court ruling\" and said they will \"continue to protect single-sex spaces\" but will also ensure trans people \"are treated with respect\". \"I do think this is the time now to lower the temperature, to move forward, and to conduct this debate with the care and compassion that it deserves,\" he said. \n                  Badenoch dismisses 'threat' from Jenrick after WhatsApp group mix-up\n                 \n                  Kemi Badenoch denies supporting local coalitions but says leaders must 'do what they need to do'\n                 \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \"And I think that should unite the whole House.\" Sir Keir also refused to apologise to Rosie Duffield, a former Labour MP who left the party to become an independent and who Sir Keir said was \"not right\" in 2021 to say only women have a cervix. Ms Duffield was in the chamber when Sir Keir said he \"always\" approaches the trans/women issue \"on the basis that we should treat everyone with dignity and respect, whatever their different views\". The Tory leader had asked him to apologise to Ms Duffield, \"the very brave member for Canterbury, for hounding her out of the Labour Party simply for telling the truth\". Read more:Starmer's comments for first time after Supreme Court ruling  Ms Badenoch said Sir Keir \"doesn't have the balls\" to express his views on the issue, hitting out at him for taking six days to react to it. But the PM dismissed her, saying the line \"sounded better when she did it in the mirror earlier\" and said it does not matter what she says \"because nobody believes she's going to lead them into the next election anyway\". Just before PMQs, Health Secretary Wes Streeting insisted Sir Keir's cabinet is \"united in our position of the Equalities Act on the Supreme Court ruling and on making sure that the law is upheld\". He also told The Sun that trans women are \"not the same as biological women\" but he would \"always respect people's identities and I have no trouble whatsoever referring to trans women by their names, referring to them as women as shorthand, or using pronouns like she and her\". The health secretary said he \"takes criticism on the chin\" for previously arguing that people should \"get over\" concerns, admitting \"there are lots of complexities\"."
    },
    {
        "title": "Police officers who fail background checks to be automatically sacked",
        "description": "Police officers who fail background checks will be automatically sacked from next month to close a \"glaring gap\" in the law.",
        "url": "https://news.sky.com/story/police-officers-who-fail-background-checks-to-be-automatically-sacked-13354074",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-metropolitan-police_6750963.jpg?20241118102419",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-23 07:31:00",
        "Headline": "Met Police chief Sir Mark Rowley said the change closes a \"glaring gap\" currently allowing officers who fail the vetting process to continue working.",
        "Content": "Police officers who fail background checks will be automatically sacked from next month to close a \"glaring gap\" in the law. Measures will be introduced to parliament on Wednesday to make it a legal requirement for serving officers to pass vetting procedures. From 14 May, any officer who fails the vetting process will be sacked straight away. Politics latest: Badenoch urged to sack Jenrick over Reform coalition comments Head of the Metropolitan Police, Sir Mark Rowley, had accused officials of dragging their feet on the issue and said it is \"absurd\" officers who were not fit to pass vetting cannot legally be sacked. Currently, officers can fail vetting for a number of reasons, including for domestic and sexual abuse, and in some circumstances can stay on full pay. Policing minister Dame Diana Johnson told Sky News she thinks the public will be \"quite shocked\" to discover there is currently no way to remove officers \"who are a risk to the public and to their colleagues\". \n                  Metropolitan Police reveals new charter for stop and search powers\n                 \n                  Metropolitan Police faces 'eye-watering' cuts to spending, boss warns\n                 \n                  Sir Mark Rowley: UK's top cop says two police officers 'seriously injured' weekly, amid falling trust and rising criticism\n                 She added: \"This is about a bespoke way of identifying those officers who can't hold the vetting because of the background checks that are made and making sure that there is a swift, easy, but fair way of removing them from the police service.\" In February, Met Police officer Sergeant Lino Di Maria, who was accused of sexual offences, successfully mounted a legal challenge after having his vetting removed over the allegations, which he denies. The High Court found he had no case to answer in respect of the misconduct allegations after he argued having his vetting removed without the accusations being proved was a breach of his right to a fair trial. The Met Police said it has now been granted leave to appeal against the judgment on Thursday after it was deemed a matter of public importance. Sir Mark said: \"The ability to hold a vetting clearance is the most basic indication of whether someone can be trusted to hold the extensive and often intrusive powers that police officers are given. \"It was never right that an officer could lose their vetting, but not lose their job. \"These reforms close that glaring gap in the law and will allow us to move swiftly to remove those who have no place in policing. \"This matters not just for the public we serve but for the vast majority of hardworking officers who should be able to feel safe, have full trust in those they work alongside and have the confidence of the public.\" Read more:Senior officer sacked for sexual contact with woman while on dutyTrans women to be searched by male officers after court ruling  Home Secretary Yvette Cooper said serious cases in recent years have \"badly failed all proper policing standards\" and \"damaged public trust in the officers who are supposed to protect them\", undermining most officers. \"It is simply not acceptable that officers who are clearly unfit to serve or pose a risk to their colleagues cannot be removed,\" she said. \"That's why these new rules are essential and it is why this government has been working closely with forces to overcome these barriers to restore confidence in policing.\" The Home Office also plans to introduce further safeguards to improve vetting national standards later this year, including stronger requirements to suspend officers under investigation for violence against women and girls. Officers convicted of certain criminal offences will also be automatically found guilty of gross misconduct."
    },
    {
        "title": "Government borrows almost £15bn more than expected",
        "description": "The UK government borrowed almost &#163;15bn more than forecast in the last financial year, according to official figures highlighting contributions from inflation-related costs, including pay awards.",
        "url": "https://news.sky.com/story/government-borrows-almost-16315bn-more-than-expected-13354050",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-spring-statement_6868767.jpg?20250327182507",
        "type": "Politics",
        "Author": "James Sillars",
        "Date Published": "2025-04-23 06:12:00",
        "Headline": "The borrowing figure for the last financial year comes in far higher than the Office for Budget Responsibility had expected in its updated forecasts issued just last month.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK government borrowed almost £15bn more than forecast in the last financial year, according to official figures highlighting contributions from inflation-related costs, including pay awards. The Office for National Statistics (ONS) reported that borrowing - the difference between total public sector spending and income - over the 12 months to the end of March came in at £151.9bn. That provisional sum was £20.7bn more than in the same twelve-month period a year earlier and £14.6bn more than the £137.3bn forecast by the Office for Budget Responsibility (OBR) at the spring statement just a month ago, the body said. Money latest: Are Treasury-backed savings now the best place for your cash? It added that the figure represented 5.3% of the UK's gross domestic product (GDP), 0.5 percentage points more than in 2023/24. It was partly driven by £16.4bn of borrowing in March - the third-highest March borrowing since monthly records began in 1993. The provisional data left public sector net debt at 95.8% of GDP at the end of March. That is 0.2 percentage points higher than at the end of March 2024. \n                  Chancellor Rachel Reeves outlines red lines for US trade deal\n                 \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 Higher borrowing is partly a consequence of government investment and spending decisions announced in the chancellor's autumn budget last year. But it is also a result of higher costs to service government debt, with the ONS data showing a bill of £4.3bn for March alone. Elevated bond yields, which reflect a higher risk premium demanded by investors in return for holding UK government debt, are a result of greater turmoil in the global economy and unease over domestically generated inflation and weak growth at a time of continued strain for the public purse.  Rachel Reeves was forced to use her spring statement in March to restore a £10bn buffer to the public finances to avoid breaking her own fiscal rules. ONS chief economist Grant Fitzner said of the data: \"Our initial estimates suggest public sector borrowing rose almost £21bn in the financial year just ended as, despite a substantial boost in income, expenditure rose by more, largely due to inflation-related costs, including higher pay and benefit increases. \"At the end of the financial year, debt remained close to the annual value of the output of the economy, at levels last seen in the early 1960s.\"  The government's efforts to bring down costs include a crackdown on the welfare bill and a renewed focus on securing growth in the economy. However, business groups say the chancellor's decision to impose an additional tax burden on employment from this month, mainly through higher minimum wage and employer national insurance contributions, will backfire and harm both employment and investment. Household spending power is also set to face further strain as inflation is tipped to rise beyond 3% due to a slew of rising costs in the economy, including bills for energy and water. Read more from Sky News:Stock markets rally as Trump rows back on Fed and China threatsMusk says his time working for Trump to 'drop significantly' The impact of the US trade war is also starting to be felt. A closely watched index of activity in the service and manufacturing sectors fell into negative territory, with its weakest reading since November 2022. The survey of purchasing managers by S&P Global found export orders falling at their fastest pace since early 2020. AJ Bell head of financial analysis, Danni Hewson, said of the data: \"Many of the challenges facing the UK economy are beyond the chancellor's control and she is currently in Washington trying to strike a deal with the US administration on tariffs that will cushion the UK without selling off the family silver. \"One of the big questions is how those changes to employer National Insurance will impact next month's numbers, especially with inflation linked benefits and the state pension rising at the same time. \"Many people will now be eyeing that headroom created back in March which had always seemed rather insubstantial, and wondering how much will be left by the autumn.\" Responding to the figures, Chief Secretary to the Treasury Darren Jones said the government would always be responsible when it came to the public finances. He added: \"We are laser-focused on making sure taxpayer money is delivering our Plan for Change missions to put more money in people's pockets, rebuild the NHS and strengthen our borders.\" But shadow chancellor Mel Stride said: \"By fiddling the fiscal rules, increasing borrowing by £30bn a year and piling up debt - these figures are alarming but not surprising.\""
    },
    {
        "title": "UK vision for clean energy to collide with Trump's fossil fuel frenzy",
        "description": "Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security.",
        "url": "https://news.sky.com/story/uk-vision-for-clean-energy-to-collide-with-trumps-fossil-fuel-frenzy-13354414",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-donald-trump_6895043.png?20250423214456",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-23 15:57:00",
        "Headline": "The stakes are high for the UK's energy security summit, but hopes are modest. It has to contend with Trump's fossil fuel frenzy, while tariffs and trade wars disrupt the energy system.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Two worlds will collide in London today as the UK and the US lobby other countries with very different visions for the future of energy security. Labour will tell ministers from 60 countries gathered for its Energy Security Summit that the transition from fossil fuels to clean power will make energy more secure because it's produced at home - as well as being a win for the climate. The stakes are high: just the small matter of stabilising the climate for years to come, as well as our energy bills. But hopes for the summit are modest, due to, unsurprisingly, Donald Trump. Trump turns up the heat with gas The US president peddles a very different view of energy security: he wants to \"drill baby drill\" for as much oil and gas as possible and pull America out of the global climate fight. He isn't sending his energy secretary Chris Wright to attend, but acting assistant secretary Tommy Joyce. \n                  'I was ready to stab whoever tried to stab me': The ex-gang members waging a war on knife crime\n                 \n                  The Magic Circle's first female member fooled them into believing she was a man - how did she do it?\n                 \n                  Sky News political editor Beth Rigby running London marathon in honour of 'dearest friend'\n                 The more junior official will still espouse Trump's vision to \"unleash US energy dominance\", which basically means keeping the world hooked on US fossil fuels - good news for the world's biggest oil and gas producer. This idea that the energy transition threatens energy security is taking root in the UK's Reform party, but is at odds with the view of the Prime Minister Sir Keir Starmer, EU chief Ursula von der Leyen, who is also attending, and the United Nations. One report by RMI found solar and wind are the cheapest option for new electricity in more than 80% of the world.  No China The UK government wants to work with America on a trade deal and some parts of the energy industry, like nuclear power. But underneath it will be hoping that the 60 other countries attending the summit will hold the line on ditching fossil fuels as fast as possible and boosting clean tech supply. That's even more urgent as the UK tries to reduce its reliance on China, which currently dominates manufacturing of clean power infrastructure like solar panels and critical minerals. That's also why the prime minister is today announcing £300m to help build wind turbines in the UK to reduce imports. But China itself is not attending - good news for rival America but a setback for the summit, given China's outsized role in the clean industries of the future. The elephant in the room Then there's the real elephant in the room, which is Trump's erratic tariffs and trade wars. No one knows how this will play out in the extremely complicated energy sector. Trump has ordered Europe to buy more of its liquefied natural gas as a way to avoid tariffs. Europe needs it: it's running low on storage and Russian pipeline supplies are dwindling. But on the flipside, his policies could paradoxically hurt both Europe's gas demand and America's gas producers, caught between fears of a recession and shaky global demand. The UK's reputation as a climate saint is not unblemished though, as it expands airports and moots further North Sea oil and gas after all. All this complexity and uncertainty forms the backdrop for the summit. Little concrete is expected to come from it - though the UK may use it to court investment. Other than that, we can expect little more than a paper summary on what energy security really means. But this is all about a fight for the narrative. And so if the IEA and other countries hold the line on clean power meaning energy security, the UK government will count that as a win."
    },
    {
        "title": "Bite marks found on skeleton prove gladiators fought lions, experts say",
        "description": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said.",
        "url": "https://news.sky.com/story/bite-marks-found-on-skeleton-prove-gladiators-fought-lions-experts-say-13354591",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gladiator-lion_6895118.jpg?20250423234233",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-23 22:02:00",
        "Headline": "Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found.",
        "Content": "Bite marks on a Roman-era skeleton found in York are the first physical evidence gladiators fought animals, experts have said. Teeth imprints from a large cat were found on the pelvis of a man buried in a cemetery believed to contain the remains of gladiators. Images of gladiators being mauled by lions have been featured on mosaics and pottery, but this is the first time skeletal evidence of the fighting has been found. Academics said the bones showed distinct lesions and were identified as coming from a large cat, probably a lion, after being compared with modern zoological teeth marks. The man is estimated to have been aged between 26 and 36 years old when he died and appears to have lived during the 3rd century AD, when York was known as Eboracum and was a town and military base in the Roman province of Britannia. Professor Becky Gowland, from Durham University's Department of Archaeology, said: \"This is an exciting new analysis and the first direct evidence of human-animal spectacle in Roman Britain and beyond. \"It also raises important questions about the importance and transport of exotic animals across the Roman Empire.\" Read more from Sky News:Chancellor outlines red lines for US trade dealWatch dramatic arrest of man who repeatedly stabbed girlIsraeli troops shot at Gaza aid workers from 'point-blank range' The researchers want to find out how lions came to be kept in Britain and the lives of gladiators on the edge of the Roman Empire. 'First direct, physical evidence' The study, published in the journal PLOS One, was led by Tim Thompson, professor of anthropology and vice president for students and learning at Maynooth University, Ireland, who said: \"For years, our understanding of Roman gladiatorial combat and animal spectacles has relied heavily on historical texts and artistic depictions. \"This discovery provides the first direct, physical evidence that such events took place in this period, reshaping our perception of Roman entertainment culture in the region.\""
    },
    {
        "title": "Meta 'too slow' during UK riots to deal with violent posts online, says independent review",
        "description": "Meta was too slow to act during the UK's riots last summer, according to the US tech giant's independent review body.",
        "url": "https://news.sky.com/story/meta-too-slow-during-uk-riots-to-deal-with-violent-posts-online-says-independent-review-13354324",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-middlesbrough-riots_6649568.jpg?20240807093753",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-04-23 13:07:00",
        "Headline": "Meta's oversight board says it had \"strong concerns\" about the tech giant's ability to moderate hateful and violent imagery in a new report.",
        "Content": "\n          Science and Technology reporter\n       Meta was too slow to act during the UK's riots last summer, according to the US tech giant's independent review body. After three young girls were murdered in Southport at a dance class on 29 July 2024, misinformation and disinformation spread on social media falsely suggesting the perpetrator was a Muslim and an asylum seeker, said the new report. People on online platforms encouraged violence and rioting across the country and the disorder lasted for nine days between 30 July and 7 August. Police arrested more than 1,280 people for their involvement in the unrest, according to the National Police Chiefs' Council.  Now, Meta's oversight board says it had \"strong concerns\" about the company's ability to moderate hateful and violent imagery in the report. It said the social media giant, which owns Facebook, Instagram and WhatsApp, was \"too slow\" to implement an emergency crisis protocol to help with moderation, and raised concerns about Meta chief executive Mark Zuckerberg's \"hastily announced\" policy changes that saw the company move away from using third-party fact-checkers in January.  \"We don't know enough,\" Paolo Carozza, co-chair of the oversight board, told Sky News. \n                  Apple and Meta fined millions by EU over competition law\n                 \n                  Could Meta be forced to sell Instagram and WhatsApp - and would it matter?\n                 \n                  Instagram owner announces new restrictions for teenage users\n                 \"Meta needs to be very careful and deliberate about studying and verifying the effectiveness of a [community notes system].\" The oversight board reviewed three posts shared during the UK riots, all of which were left up by Meta's automatic moderation systems despite being flagged by users.  The first called for mosques to be smashed and buildings where \"migrants\", \"terrorists\" and \"scum\" live to be set on fire, which the oversight board said was a serious violation of Meta's policies. \"There is no way to interpret this post as a casual or non-serious statement,\" said the report. The second post showed an AI-generated image of a giant man in a Union Jack t-shirt chasing smaller Muslim men, with text over the image giving details of a protest to attend during the riots. It was accompanied by the hashtag \"EnoughisEnough\". \"[The post] is a clear call for people to gather and carry out acts of discriminatory violence,\" concluded the report. It added Meta's conclusion that the post contained no target or a threat \"strains credibility\". Read more from Sky News:Country star seeks pardon from criminal pastWhat are the chances of a British pope? The third post showed an AI-generated image of four Muslim men running through Westminster after a crying blond-haired toddler. In the image, one of the men waves a knife and a plane flies towards Big Ben. Meta didn't remove this image as it said it referred to the specific Muslim man who was incorrectly accused of the children's murders in Stockport. Referring to the incorrectly identified man was allowed under Meta's policies. The oversight board said it \"does not depict the Southport stabbing in any form\" and ruled it should have been removed. \"In response to these events last summer, we immediately set up a dedicated task force that worked in real time to identify and remove thousands of pieces of content that broke our rules - including threats of violence and links to external sites being used to coordinate rioting,\" a Meta spokesperson told Sky News. They said Meta \"will act to comply with the board's decision\".  Read more from Sky News:Blood test that can detect 12 common cancers to be trialled on NHSMMA fighter jailed for 15 years The UK riot posts were part of a number of posts examined by the oversight board to assess Meta's content moderation. In contrast to the three Southport-related posts, which it recommended be removed, the board recommended Meta keep online two posts that may have been \"highly offensive\" to the trans community. \"Protection of freedom of expression doesn't protect an immediate incitement to violence, but it does protect controversial and even offensive speech,\" said Mr Carozza. \"A lot of what needs to be done, both by the oversight board and Meta, is weigh where we are most willing to allow the errors to fall. We want to err on the side of more inclusivity of speech.\""
    },
    {
        "title": "Blood test that can detect 12 common cancers to be trialled on NHS",
        "description": "A new blood test that uses AI to detect signs of a dozen cancers long before symptoms develop is to be tested on NHS patients.",
        "url": "https://news.sky.com/story/blood-test-that-can-detect-12-common-cancers-to-be-trialled-on-nhs-13354165",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-prostate-cancer-generic_6539185.jpg?20240501075842",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-04-23 09:12:00",
        "Headline": "Tests so far on 20,000 patients show the miONCO-Dx test is 99% accurate in detecting cancer and pinpointing where it is located.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A new blood test that uses AI to detect signs of a dozen cancers long before symptoms develop is to be tested on NHS patients. The trial on 8,000 patients will analyse blood samples for tiny fragments of genetic material released by tumours. Tests so far on 20,000 patients show the miONCO-Dx test is 99% accurate in detecting cancer and pinpointing where it is located, allowing a diagnosis to be made when the disease is at a far earlier, treatable stage. As little as 10 drops of blood are all that's needed to detect up to 12 common cancers - including lung, gastric, prostate, oesophageal, liver, bladder, ovarian, bowel, pancreatic and breast cancers - as well as bone and soft tissue sarcoma and a type of brain tumour. The Department of Health said the test was now ready for the \"validation and verification\" stage. Announcement of the trial came as a laboratory was renamed in memory of bowel cancer campaigner Dame Deborah James, who died from the disease aged 40 three years ago. The Bowelbabe lab, which is funded by Cancer Research UK, will bring together scientists to focus on the second most common cause of cancer deaths in the country. Visiting the lab, her mum, Heather, said: \"Deborah was quite a science geek really. \"Having known how much research she would go into for her own self and for other people, I think she would be so chuffed to see what her fundraising for the Babefund has gone towards. \"I am proud of that as well and pleased to see. Things are coming to life that we could only wish happened and it will save more lives, I'm sure.\" The government has awarded £2.4m to run the trial of the genetic test, which was developed by the University of Southampton and the biotech startup Xgenera. Professor Sir Stephen Powis, NHS England's national medical director, said: \"This blood test has the potential to help us detect bowel cancer earlier and reduce the need for invasive tests, and the next step in this trial will now be vital in gathering further evidence on its effectiveness and how it could work in practice. \"Dame Deborah James was a tireless and inspirational campaigner who helped change the national conversation on bowel cancer - it's fitting that this lab in her name will drive forward research that could help thousands more people survive the disease.\" Read more from Sky News:MMA fighter jailed for 15 yearsCountry star seeks pardon from criminal pastWhat are the chances of a British pope? There are 44,000 new cases of bowel cancer in the UK each year, with 17,000 deaths. If caught early about nine in 10 patients survive, but survival drops to just one in 10 if the diagnosis is made at a late stage."
    },
    {
        "title": "Apple and Meta fined millions by EU over competition law",
        "description": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules.",
        "url": "https://news.sky.com/story/apple-and-meta-fined-millions-by-eu-over-competition-law-13354190",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-23 09:54:00",
        "Headline": "Apple is fined for stopping app makers from pointing to cheaper options outside the App Store, and Meta for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them.",
        "Content": "Apple and Meta have been fined millions of euros by the EU for breaking digital competition rules. They are the first companies to be fined for breaching a new law designed to increase competition in the EU's digital economy. Apple was fined €500m (£428m) for stopping app makers from pointing to cheaper options outside the App Store - and Meta fined €200m (£171m) for forcing Instagram and Facebook users to choose between seeing ads or paying to avoid them. The fines were issued under the EU's Digital Markets Act (DMA), a series of rules designed to give consumers and businesses more choice and to prevent big tech from cornering digital markets. The EU's decisions were expected to be announced in March but officials reportedly held off because of the escalating trade war with US President Donald Trump. Mr Trump has repeatedly complained about regulations from Brussels affecting American companies. In February, the White House issued a statement saying it would \"consider responsive actions like tariffs\" in the face of fines and policies that foreign governments levy on American firms. Read more:UK 'will be among hardest hit' by trade warHow Trump changed his mind on tariffs  Both companies have issued complaints about the EU penalties. Apple accused the commission of \"unfairly targeting\" the iPhone maker, saying it has \"spent hundreds of thousands of engineering hours and made dozens of changes to comply with this law\". Meta's chief global affairs officer Joel Kaplan said in a statement: \"The Commission is attempting to handicap successful American businesses while allowing Chinese and European companies to operate under different standards.\" The DMA is designed to ensure \"citizens have full control over when and how their data is used online, and businesses can freely communicate with their own customers,\" said Henna Virkkunen, the commission's executive vice president for tech sovereignty. \"The decisions adopted today find that both Apple and Meta have taken away this free choice from their users and are required to change their behaviour,\" she said."
    },
    {
        "title": "The Magic Circle's first female member fooled them into believing she was a man - how did she do it?",
        "description": "How did one woman fool the most famous magic society on the planet? ",
        "url": "https://news.sky.com/story/the-magic-circles-first-female-member-fooled-them-into-believing-she-was-a-man-how-did-she-do-it-13354578",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-magic-circle-sophie-lloyd_6895122.jpg?20250424000455",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-23 21:11:00",
        "Headline": "Over 30 years after being unceremoniously kicked out, the Magic Circle has tracked down Sophie Lloyd to apologise and reinstate her membership. But how did she fool the famous society? ",
        "Content": "\n          Arts and entertainment correspondent\n        How did one woman fool the most famous magic society on the planet?  Back in 1991, Sophie Lloyd pulled off the ultimate illusion, tricking the Magic Circle into thinking she was a man. But over 30 years after being unceremoniously kicked out, the Circle has tracked down the former actress to apologise and reinstate her membership. She told Sky News how returning feels like the society has \"made good on something that was wrong\". How did she infiltrate that exclusive group that nowadays counts the likes of David Copperfield and Dynamo as members? In March of that year, she took her entry exam posing as a teenage boy, creating an alter-ego called Raymond Lloyd. \"I'd played a boy before,\" she explained, but \"it took months of preparation\" to secretly infiltrate the Circle's ranks half a year before it would officially vote to let women in. \n                  Counter terror police assessing Kneecap concert video\n                 \n                  Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin\n                 \n                  Charli XCX, Lola Young, Raye and JADE among artists nominated for Ivor Novello Awards\n                 \"Really, going back 30 years, men's clubs were like, you know, just something you accepted.\" The men-only rule had been in place since the Circle was formed in 1905. The thinking behind it being that women just couldn't keep secrets. Aware of the frustration of female magicians at the time, Lloyd felt she was up for the challenge of proving women could be as good at magic as the men. The idea was, in fact, born out of a double act, thought up by a successful magician called Jenny Winstanley who'd wanted to join herself but wasn't allowed. She recognised the hoax would probably only work with a much younger woman posing as a teenage boy, and met Lloyd through an acting class. Lloyd said: \"We had to have a wig made... the main thing was my face, I had plumpers made on a brace to bring his jawline down.\" To hide her feminine hands, she did the magic in gloves, which she says \"was so hard to do, especially sleight of hand.\" The biggest test came when she was invited for a drink with her examiner, where she had to fake having laryngitis. \"After the exam, which was 20 minutes, he invited Jenny and I - she played my manager - and I sat there for one hour and three quarters and had to say 'sorry, I've got a bad voice'.\" Raymond Lloyd passed the test, and his membership certificate was sent through to Sophie. Then, in October of the same year, when whispers started circulating that the society was going to open its membership to both sexes, she and Jenny decided to reveal all. It didn't go down well. Read more:Jelly Roll seeks pardon from criminal pastHarvey Weinstein retrial begins in New York Rather than praise her performance, members were incandescent about the deception and, somewhat ironically, Raymond Lloyd was kicked out just before women members were let in. Lloyd said: \"We got a letter... Jenny was hurt... she was snubbed by people she actually knew, that was hurtful. However, things have really changed now...\" Three decades later the Magic Circle put out a nationwide appeal stating they wanted to apologise and Lloyd was recently tracked down in Spain. While Jenny Winstanley died 20 years ago in a car crash, as well as Sophie receiving her certificate on Thursday, her mentor's contribution to magic is being recognised at the special show that's being held in both their honour at the Magic Circle. Lloyd says: \"Jenny was a wonderful, passionate person. She would have loved to be here. It's for her really.\""
    },
    {
        "title": "Counter terror police assessing Kneecap concert video",
        "description": "Counter terror police are assessing a video reported to be from a concert by Irish-language rappers Kneecap.",
        "url": "https://news.sky.com/story/counter-terror-police-assessing-kneecap-concert-video-13354451",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-belfast_6894896.jpg?20250423181336",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-23 16:47:00",
        "Headline": "The Metropolitan Police said it was made aware of the video, which has been \"referred to the counter terrorism internet referral unit for assessment\".",
        "Content": "Counter terror police are assessing a video reported to be from a concert by Irish-language rappers Kneecap. A social media clip of the hip hop trio on stage appeared to show one member of the group shout \"up Hamas, up Hezbollah\". The footage was posted online by Danny Morris from the Jewish security charity, the Community Security Trust. He said it was from a gig last November at London's Kentish Town Forum. A Metropolitan Police spokesperson said: \"We have been made aware of the video and it has been referred to the counter terrorism internet referral unit for assessment and to determine whether any further police investigation may be required.\" Hamas and Hezbollah are both proscribed as terrorist groups in the UK. Under Section 12 of the Terrorism Act 2000, it is an offence to express \"an opinion or belief that is supportive of a proscribed organisation\". Sky News has contacted Kneecap's management for comment. Read more:Kneecap draw 'headline-worthy' Glastonbury crowdIrish-language rappers on their unlikely big-screen stardom It comes after TV personality Sharon Osbourne called for Kneecap's US work visas to be revoked after accusing them of making \"aggressive political statements\" including \"projections of anti-Israel messages and hate speech\" at Coachella Music and Arts Festival. Speaking to Rolling Stone, Kneecap member Mo Chara said in response: \"Her rant has so many holes in it that it hardly warrants a reply, but she should listen to War Pigs that was written by Black Sabbath (led by Ozzy Osbourne, her husband).\" He also told the outlet: \"We believe we have an obligation to use our platform when we can to raise the issue of Palestine, and it was important for us to speak out at Coachella as the USA is the main funder and supplier of weapons to Israel as they commit genocide in Gaza.\" In November last year, Kneecap won a discrimination case against the UK government after former business secretary Kemi Badenoch refused them funding."
    },
    {
        "title": "Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin",
        "description": "The retrial of Harvey Weinstein has begun in New York - with a prosecutor telling the court the former Hollywood mogul used \"dream opportunities as weapons\" to prey on the three women accusing him of sexual abuse.",
        "url": "https://news.sky.com/story/harvey-weinstein-retrial-he-had-all-the-power-prosecutor-tells-court-as-opening-statements-begin-13354308",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-harvey-weinstein-court_6894833.jpg?20250423170632",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-23 12:28:00",
        "Headline": "Former Hollywood studio boss and producer Harvey Weinstein, who is now 73, is charged with raping one woman and forcing oral sex on two others. He has strenuously denied the allegations.",
        "Content": "The retrial of Harvey Weinstein has begun in New York - with a prosecutor telling the court the former Hollywood mogul used \"dream opportunities as weapons\" to prey on the three women accusing him of sexual abuse. The case is being retried five years after the landmark #MeToo case against the producer, who was once one of the industry's most powerful figures, after the appeals court last year overturned his conviction. Weinstein, who is now 73, is charged with raping one woman and forcing oral sex on two others. He has strenuously denied the allegations. Following a lengthy jury selection process due to the high-profile nature of the retrial, the prosecution has now opened its case at the same courthouse in Manhattan.  Attorney Shannon Lucey told the court the Oscar-winning producer and studio boss used \"dream opportunities as weapons\" against the female accusers. \"The defendant wanted their bodies, and the more they resisted, the more forceful he got,\" she said. Weinstein had \"enormous control over those working in TV and film because he decided who was in and who was out,\" the court heard. \"He had all the power. They had none.\" Dressed in a dark suit and navy tie, Weinstein listened to the prosecution's statement after arriving in court in a wheelchair, as he has done for his recent appearances. His lawyers are expected to outline their case later on Wednesday. The opening statements got under way after the last jurors were finally picked on Tuesday, more than a week after the selection process began. Prospective jurors were questioned about their backgrounds, life experiences and various other points that could potentially impact their ability to be fair and impartial about a case that has been so highly publicised. They have also been asked privately about their knowledge of the case and opinions on Weinstein. Seven men and five women have been chosen to hear the trial. Why is there a retrial? In 2020, Weinstein was sentenced to 23 years in prison after being found guilty of charges of sexual assault in 2006 and rape in 2013, relating to two women. But in April 2024, New York's highest court overturned the convictions due to concerns of prejudicial testimony and that the judge in the original trial had made improper rulings. Prosecutors announced a retrial last year and a separate charge concerning a third woman, who was not part of the original trial, has since been added to the case. She alleges the producer forced oral sex on her at a hotel in 2006. Weinstein has pleaded not guilty to all charges and denies raping or sexually assaulting anyone. Read more:What has happened to the #MeToo movement?Harvey Weinstein sues his brother Bob At a preliminary court hearing in January, he begged for the retrial to be held as quickly as possible due to his deteriorating health, telling the judge: \"I don't know how much longer I can hold on.\" Weinstein was also sentenced in February 2023 after being convicted of rape during a separate trial in LA - which means that even if the retrial ends in not guilty verdicts on all three counts, he will remain behind bars. His lawyers are also appealing this sentence."
    },
    {
        "title": "Charli XCX, Lola Young, Raye and JADE among artists nominated for Ivor Novello Awards",
        "description": "Charli XCX, Dua Lipa, Raye and Ghetts are among the artists nominated for this year's Ivor Novello Awards for songwriting, along with a nod for Wham!'s Last Christmas.",
        "url": "https://news.sky.com/story/charli-xcx-lola-young-raye-and-jade-among-artists-nominated-for-ivor-novello-awards-13354163",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lola-young-coachella_6894523.jpg?20250423122825",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-04-23 16:00:00",
        "Headline": "More than 70 songwriters have been nominated for Ivor Novello Awards this year, with two-thirds - including Lola Young, who leads with three nods - shortlisted for the first time. Other artists in the running include Fontaines DC, Bashy, Ghetts, Myles Smith, Laura Marling and BERWYN.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Charli XCX, Dua Lipa, Raye and Ghetts are among the artists nominated for this year's Ivor Novello Awards for songwriting, along with a nod for Wham!'s Last Christmas. Lola Young, whose single Messy was a huge hit in 2024, leads with three nominations, for best album, best song musically and lyrically, and the rising star award. Other acts in the running for Ivors include Fontaines DC, BERWYN, Myles Smith, Laura Marling, JADE, Bashy, Conor Dickinson and Jordan Rakei. Nominated composers also include writers for Oscar nominees including The Substance and The Zone Of Interest, hit shows such as Black Doves and Rivals, and games including Senua's Saga: Hellblade II and Farewell North. And Wham! receive their nomination for Last Christmas as one of PRS for Music's top five most performed songs of 2024 - a posthumous nod for George Michael, almost 30 years after his last win in 1997, for the single Fastlove. Despite never making it to number one when it was released in 1984, Last Christmas has topped the charts at Christmas for the last two years. The festive track is up against Harry Styles' 2022 hit As It Was, which is in contention for the third year running, Dua Lipa's Houdini, Stargazing by Myles Smith, and Prada by Casso, RAYE and D-Block Europe. Speaking to Sky News after the announcement, Bashy said it felt \"special\" to receive a nomination, especially \"as someone who writes all of their own music and really speaks from their sort of heart and experience, and from my community's experience\". The actor and rapper is nominated for the best contemporary song award for his single How Black Men Lose Their Smile. He highighted a line from the track, \"still I rise\", inspired by the Maya Angelou poem, as one he is proud of. \"For me, that really speaks to people who look like me, but also just people who are where I'm from,\" he said. \"Working class people who wake up every day in a challenging environment but find magic within that environment and yeah, continue on. Real, resilient people. So I think it's not about me, the song's bigger than me. It's my community song and it's really resonating and that's what's most important to me more than anything else.\" Bashy also revealed he will be releasing a live version of his 2024 album, Being Poor Is Expensive, recorded at Bush Hall in west London, later this year. The Ivors recognise creative musical achievement in songwriting and composition, and also celebrate a number of singer-songwriters and groups for their wider contribution to UK music. This year's ceremony marks the 70th anniversary of the awards, and will take place on 22 May in London. Some 74 composers and songwriters have been nominated this year, with two-thirds - including Young - up for awards for the first time. It has already been announced that U2 will be inducted into the Academy Fellowship \"in recognition of their enduring influence and impact on the craft of songwriting\". The bandmates - Bono, The Edge, Adam Clayton and Larry Mullen Jr - will become the first Irish songwriters to be inducted, following in the footsteps of artists including Sir Paul McCartney, Sir Elton John, Kate Bush and last year's recipient, Bruce Springsteen. Artists including Raye, Lana Del Rey, Skepta and KT Tunstall were also among last year's winners. Tom Gray, chair of The Ivors Academy, described the event as \"the most joyful celebration of music making in the calendar\". Congratulating the 2025 nominees, he added: \"It's a huge privilege for the Ivors Academy to champion music creation in all its forms.\" Here are this year's nominees. BEST ALBUMBrat - Charli XCX, AG Cook and Finn KeaneOn Purpose, With Purpose - Ghetts and TenBillion DreamsThe Loop - Jordan RakeiThis Wasn't Meant For You Anyway - William Brown, Conor Dickinson, Jared Solomon and Lola YoungWho Am I - BerwynBEST CONTEMPORARY SONGAllergy - Felix Joseph, Alastair O'Donnell and Pa SalieuAngel Of My Dreams - Pablo Bowman, JADE, Steph Jones and Mike SabathCircumnavigating Georgia - Sans SoucisDouble Standards - Ghetts, EMIL, Sampha Sisay and R-KayHow Black Men Lose Their Smile - Bashy, Toddla T and Linton Kwesi JohnsonBEST SONG MUSICALLY AND LYRICALLYChild Of Mine - Laura MarlingGenesis - Rodney Jerkins, RAYE and ToneworldIn The Modern World - Grian Chatten, Conor Curley, Conor Deegan, Thomas Coll and Carlos O'Connell (Fontaines DC)Messy - Conor Dickinson and Lola YoungMine - Orla GartlandPRS FOR MUSIC MOST PERFORMED WORKAs It Was - Kid Harpoon, Tyler Johnson and Harry StylesHoudini - Caroline Ailin, Danny L Harle, Tobias Jesso Jnr, Dua Lipa and Kevin ParkerLast Christmas - George MichaelPrada - D-Block Europe, Obi Ebele (Da Beatfreakz), Uche Ebele (Da Beatfreakz), Jahmori \"Jaymo\" Simmons and RAYEStargazing - Peter Fenn, Jesse Fink and Myles Smith RISING STAR AWARDBea And Her BusinessLiang LawrenceLola YoungLULU.Nia Smith BEST ORIGINAL FILM SCOREFly Me To The Moon - Daniel PembertonHard Truths - Gary YershonKneecap - Michael \"Mickey J\" AsanteThe Substance - composed by RaffertieThe Zone Of Interest - Mica Levi BEST ORIGINAL VIDEO GAME SCOREEmpire Of The Ants - Mathieu Alvado and Mark ChoiFarewell North - John KonsolakisFlock - Eli RainsberrySenua's Saga: Hellblade II - David Garcia DiazThe Casting Of Frank Stone - Boxed Ape BEST TV SOUNDTRACKBlack Doves - Martin PhippsMary & George - Oliver CoatesRivals - Jack Halama and Natalie HoltTrue Detective: Night Country - Vince PopeUntil I Kill You - Carly Paradis"
    },
    {
        "title": "Country star Jelly Roll seeks pardon from criminal past",
        "description": "US country music star Jelly Roll is seeking a pardon to wipe his criminal convictions from the record, after spending time behind bars as a teenager.",
        "url": "https://news.sky.com/story/country-star-jelly-roll-seeks-pardon-from-criminal-past-13354015",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-invictus-games-jelly-roll_6894204.jpg?20250423042218",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-23 03:21:00",
        "Headline": "The singer says he wants to be an \"inspiration\" to people and let them know that \"change is truly possible\" after turning his life around.",
        "Content": "US country music star Jelly Roll is seeking a pardon to wipe his criminal convictions from the record, after spending time behind bars as a teenager. He told the Tennessee Board of Parole that while in detention, he fell in love with songwriting which he says changed his life in ways he \"never dreamed imaginable\". Now aged 40, the rapper-turned-country singer, real name Jason DeFord, wants to be able to travel internationally to perform, but his criminal past currently makes that difficult. \"I want to be an inspiration for people who are now where I used to be - to let them know that change is truly possible,\" Jelly Roll told the board, which has recommended a pardon. The final decision rests with the state's Republican Governor Bill Lee. The singer broke into country music with the 2023 album \"Whitsitt Chapel\" and crossover songs like \"Need a Favor\". He has been recognised at both the CMT Music Awards and Country Music Association (CMA) Awards and earned four Grammy nominations, including for new artist of the year. As a part of the pardon application, friends and local leaders wrote to the board about Jelly Roll's transformation and generosity. Nashville Sheriff Daron Hall described how the star had an awakening in one of the jails he managed, while Live Nation Entertainment CEO and President Michael Rapino pointed out his charity work. \n                  The Magic Circle's first female member fooled them into believing she was a man - how did she do it?\n                 \n                  Counter terror police assessing Kneecap concert video\n                 \n                  Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin\n                 Read more from Sky News:Explainer: Sean Combs trialThe Who drummer rejoins band Jelly Roll has spoken openly about his criminal record and what it has taken to overcome it. He often visits jails before performing concerts and helps feed people who are homeless. Due to his criminal record, which includes a robbery at age 17 and drug charges at 23, he says it \"takes a team of lawyers and a mountain of paperwork\" to perform internationally, sometimes requiring special permits. Last year, he gave evidence before a Senate committee about his own drug addiction and called for stronger legislation against the fentanyl crisis, saying he has \"attended more funerals than I care to share\". He was recently able to make his first international tour, taking in Canada and the UK, where he spoke about a rehabilitation programme. Governor Lee said every case seeking clemency, such as pardons, is equally important and goes through a thorough process. \"The reporting on Jelly Roll, that's encouraging for his situation, but there are steps yet to happen in that case,\" he told reporters."
    },
    {
        "title": "The Magic Circle's first female member fooled them into believing she was a man - how did she do it?",
        "description": "How did one woman fool the most famous magic society on the planet? ",
        "url": "https://news.sky.com/story/the-magic-circles-first-female-member-fooled-them-into-believing-she-was-a-man-how-did-she-do-it-13354578",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-magic-circle-sophie-lloyd_6895122.jpg?20250424000455",
        "type": "Strange",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-23 21:11:00",
        "Headline": "Over 30 years after being unceremoniously kicked out, the Magic Circle has tracked down Sophie Lloyd to apologise and reinstate her membership. But how did she fool the famous society? ",
        "Content": "\n          Arts and entertainment correspondent\n        How did one woman fool the most famous magic society on the planet?  Back in 1991, Sophie Lloyd pulled off the ultimate illusion, tricking the Magic Circle into thinking she was a man. But over 30 years after being unceremoniously kicked out, the Circle has tracked down the former actress to apologise and reinstate her membership. She told Sky News how returning feels like the society has \"made good on something that was wrong\". How did she infiltrate that exclusive group that nowadays counts the likes of David Copperfield and Dynamo as members? In March of that year, she took her entry exam posing as a teenage boy, creating an alter-ego called Raymond Lloyd. \"I'd played a boy before,\" she explained, but \"it took months of preparation\" to secretly infiltrate the Circle's ranks half a year before it would officially vote to let women in. \n                  Counter terror police assessing Kneecap concert video\n                 \n                  Harvey Weinstein retrial: 'He had all the power,' prosecutor tells court as opening statements begin\n                 \n                  Charli XCX, Lola Young, Raye and JADE among artists nominated for Ivor Novello Awards\n                 \"Really, going back 30 years, men's clubs were like, you know, just something you accepted.\" The men-only rule had been in place since the Circle was formed in 1905. The thinking behind it being that women just couldn't keep secrets. Aware of the frustration of female magicians at the time, Lloyd felt she was up for the challenge of proving women could be as good at magic as the men. The idea was, in fact, born out of a double act, thought up by a successful magician called Jenny Winstanley who'd wanted to join herself but wasn't allowed. She recognised the hoax would probably only work with a much younger woman posing as a teenage boy, and met Lloyd through an acting class. Lloyd said: \"We had to have a wig made... the main thing was my face, I had plumpers made on a brace to bring his jawline down.\" To hide her feminine hands, she did the magic in gloves, which she says \"was so hard to do, especially sleight of hand.\" The biggest test came when she was invited for a drink with her examiner, where she had to fake having laryngitis. \"After the exam, which was 20 minutes, he invited Jenny and I - she played my manager - and I sat there for one hour and three quarters and had to say 'sorry, I've got a bad voice'.\" Raymond Lloyd passed the test, and his membership certificate was sent through to Sophie. Then, in October of the same year, when whispers started circulating that the society was going to open its membership to both sexes, she and Jenny decided to reveal all. It didn't go down well. Read more:Jelly Roll seeks pardon from criminal pastHarvey Weinstein retrial begins in New York Rather than praise her performance, members were incandescent about the deception and, somewhat ironically, Raymond Lloyd was kicked out just before women members were let in. Lloyd said: \"We got a letter... Jenny was hurt... she was snubbed by people she actually knew, that was hurtful. However, things have really changed now...\" Three decades later the Magic Circle put out a nationwide appeal stating they wanted to apologise and Lloyd was recently tracked down in Spain. While Jenny Winstanley died 20 years ago in a car crash, as well as Sophie receiving her certificate on Thursday, her mentor's contribution to magic is being recognised at the special show that's being held in both their honour at the Magic Circle. Lloyd says: \"Jenny was a wonderful, passionate person. She would have loved to be here. It's for her really.\""
    },
    {
        "title": "Letter sheds possible new light on Shakespeare's marriage",
        "description": "New analysis of a letter fragment has possibly shed light on William Shakespeare's marriage - suggesting it may have been less fractious than previously suggested.",
        "url": "https://news.sky.com/story/letter-sheds-possible-new-light-on-shakespeares-marriage-13354329",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-william-shakespeare_6894660.jpg?20250423142442",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-04-23 13:15:00",
        "Headline": "Some scholars have long assumed that William Shakespeare had an unhappy marriage with his wife Anne Hathaway. But fresh analysis of a 17th-century letter suggests otherwise.",
        "Content": "New analysis of a letter fragment has possibly shed light on William Shakespeare's marriage - suggesting it may have been less fractious than previously suggested. The wordsmith, it has long been assumed by some scholars, had a largely unhappy marriage with his wife, Anne Hathaway. It was said that he left her in Stratford-upon-Avon while he spent his time in London. However, new analysis of a 17th-century letter fragment by the University of Bristol has questioned that narrative. The letter was preserved by accident in the binding of a book in Hereford, and is addressed to \"good Mrs Shakespeare\" and appears to show both husband and wife living together in central London at some point between 1600 and 1610. Prior to this work by Professor Matthew Steggle, the university said there was no evidence putting Mrs Shakespeare in the capital with her husband. Professor Steggle said: \"First discovered in 1978, the letter's been known for a while, but no one could identify the names or places involved or see any reason to think that the Mr Shakespeare in the letter was necessarily William rather than anyone else of the same name in the general period. \n                  Olivia Hussey, star of 1968 film Romeo and Juliet, dies at 73\n                 \n                  Artist behind 'disturbing' sculpture says it's not intended to cause upset\n                 \n                  Children today 'demonised' for doing as Shakespeare did 400 years ago, director says\n                 \"So, it's a story about the Shakespeares' marriage, really, as well as about Shakespeare's London contacts. \"And if the writing on the back of the letter is a reply, then it's also a story about the first ever bit of writing which can be attributed to Anne Hathaway.\" The letter explains a tale in which Shakespeare is allegedly witholding money from an orphan boy named John Butts. Someone writes to Mrs Shakespeare asking her for the money, but she stands by her husband, the university said, telling the letter writer it was their own problem.\" Read more from Sky News:Apple and Meta fined millions by EUIstanbul hit by 6.2 magnitude earthquakeAt least 26 tourists killed in Kashmir attack Professor Steggle added: \"[The letter] also shows a side of Shakespeare's London life that's not been known before, giving him a new address in Trinity Lane and a whole new sphere of activity for him. \"It seems to show her being involved with her husband's money affairs and social networks. \"So, it's a game-changer in terms of thinking about the Shakespeares' marriage. \"And, if the material on the back is (as it may well be) a fragment of a reply from Mrs Shakspaire, then these would be the first recorded words ever to have come from Shakespeare's wife.\""
    }
]