[
    {
        "title": "Trump under fire for claiming NATO allies avoided Afghanistan frontline",
        "description": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan.",
        "url": "https://news.sky.com/story/trump-under-fire-for-claiming-nato-allies-avoided-afghanistan-frontline-13497843",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afghanistan-british_7143138.jpg?20260122232937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:31:00",
        "Headline": "In an interview with Fox News, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". America is the only country to have invoked the alliance's collective defence provision.",
        "Content": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan. In an interview with Fox News in Davos, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". He added: \"We've never needed them. \"They'll say they sent some troops to Afghanistan … and they did, they stayed a little back, a little off the front lines.\" Sky News US correspondent David Blevins said the comments would be deemed \"grossly offensive\" by allies who fought alongside the US. America is the only NATO member to have invoked the collective security provisions of its Article 5 clause - that an attack against one member is an attack on all. That came after the 9/11 terror attacks of 2001, which led to a US-led invasion of Afghanistan. The UK suffered the second-highest number of military deaths in the Afghanistan conflict at 457. The US saw 2,461 deaths. America's allies suffered 1,160 deaths during the conflict - around a third of the total coalition deaths. 'We have always been there' Dame Emily Thornberry MP, chair of the Commons Foreign Affairs Select Committee, said Mr Trump's comments were \"an insult\" to the families of those who died and \"so much more than a mistake\". Speaking on the BBC's Question Time, Dame Emily said: \"How dare he say we weren't on the frontline, how dare he. \"We have always been there whenever the Americans have wanted us, we have always been there.\" In a social media post, Liberal Democrat leader Sir Ed Davey MP said: \"Trump avoided military service five times. \"How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.\" Trump's words 'a disservice' to troops Tory MP Ben Obese-Jecty, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". He said: \"I saw first hand the sacrifices made by British soldiers I served alongside in Sangin where we suffered horrific casualties, as did the US Marines the following year. \"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\" Read more from Sky News:Trump promises Greenland 'deal' will be 'amazing' for USIs president's peace board a new UN or a gang of friends? Last year, US vice president JD Vance hit back at claims of \"disrespecting\" British troops who served in Iraq and Afghanistan, after suggesting a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". At the time, only the UK and France had pledged troops to a potential peacekeeping force."
    },
    {
        "title": "Police forces to be slashed in sweeping reforms",
        "description": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades.",
        "url": "https://news.sky.com/story/number-of-police-forces-to-be-slashed-in-largest-reform-in-decades-13497814",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shabana-mahmood_7084641.jpg?20251118060407",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 21:02:00",
        "Headline": "Tory opposition warn the plan risks \"undermining efforts to fight crime\".",
        "Content": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades. Home Secretary Shabana Mahmood will reveal plans next week for reform that will significantly cut the number of forces down from 43. Critics have long argued the current model is bureaucratic and wastes too much money - and some inside government believe smaller forces are not equipped to deal with serious crimes.   It is understood the reforms would involve merging back-office functions to free up resources to be invested in more police officers. Ministers will also reveal plans for Local Policing Areas - which allow officers to focus on neighbourhood policing. These will be set up across the country to deal with lower level \"local crime\" such as shoplifting and anti-social behaviour. The plans - which the Conservatives say risk \"undermining efforts to fight crime\" - will not come into place until around 2034, insiders have warned. The shift in strategy marks the latest development in ongoing tensions between the police and the home secretary - who last week welcomed plans to allow her to force the resignation of chief constables. Earlier, a government source pointed to Wiltshire Police, which needed support from 40 other forces to respond to the Salisbury poisonings in 2018, as well as vast differences in charge rates for some offences. They said: \"Under this new structure, all forces - regardless of where they are - will have the tools and resources they need to fight serious crime. \"Where you live will no longer determine the outcomes you get from your force.\" It is unclear exactly how many forces will operate under the new framework but an independent review will be announced to look at precise details. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post Similar cuts have been proposed as long as 20 years ago, when then home secretary Charles Clarke suggested cutting the number of forces to 12. But the plans were scrapped by his successor John Reid just four months later after the proposed merger of Lancashire and Cumbria police forces collapsed and senior officers turned against the idea. Allies of Ms Mahmood stressed her commitment to the reforms, but Conservative shadow home secretary Chris Philp said there was \"no evidence\" that merging police forces would cut crime or improve performance. He said: \"Top-down reorganisation risks undermining efforts to fight crime, inevitably leading to centralised control that will hit towns and villages across the country hardest. \"The biggest force, the Met, has the lowest crime solving rates and falling police numbers. Big is not necessarily better.\""
    },
    {
        "title": "Zelenskyy drops brutal truth bombs upon European allies",
        "description": "Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-europe-cant-act-without-us-leadership-and-is-stuck-in-a-groundhog-day-style-doom-loop-ukrainian-president-says-13497797",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-volodymyr-zelenskyy_7143087.jpg?20260122214919",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-22 19:44:00",
        "Headline": "Comparing its preference for talk over action to Bill Murray's comedy classic, Mr Zelenskyy says Europe is a \"fragmented kaleidoscope of small and middle powers\", endlessly talking about what needs to be done, without doing it.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump. Invoking the spectacle of Bill Murray's classic comedy, Groundhog Day, at a speech in Davos, the Ukrainian president said the UK and Europe are stuck in a doom loop, repeating rhetoric about what needs to be done - without taking the action required to make things change. This, he said, meant they were left scrambling to respond to world events instead of standing united as a great power with the ability to shape their collective destiny. Latest - Trump envoy in Moscow Only from such a position of strength could Europe hope to influence supposed friends such as Trump and foes like Putin. Addressing the World Economic Forum following a face-to-face meeting with Trump, Zelenskyy said Europe \"remains a beautiful but fragmented kaleidoscope of small and middle powers\". \"Instead of taking the lead in defending freedom worldwide, especially when America's focus shifts elsewhere, Europe looks lost, trying to convince the US president to change,\" he said. \"But he will not change. President Trump loves who he is, and he says he loves Europe, but he will not listen to this kind of Europe.\" The remarks over progress on peace talks come ahead of what Zelenskyy calls the \"first trilateral meeting\" between Ukraine, the US, and Russia in the UAE. The talks were first mentioned by US envoy Steve Witkoff at an event in Davos on Thursday morning.  He said he and Jared Kushner would travel to the UAE directly from Moscow on Thursday night for meetings with working groups from both sides on specific aspects of the peace plan, including \"military to military\" issues. Zelenskyy then mentioned the talks in his speech.  He said they'd be at a \"technical level\", but afterwards, Kyiv announced it'll be sending its top team, including lead negotiator Rustem Umerov as well as Zelenskyy's chief of staff Kyrylo Budanov. The attendance of such senior figures could indicate that the meeting has taken greater significance than originally planned. Perhaps something changed over the course of the day, maybe in the meeting with Zelenskyy and Trump. On the other hand, it could just be signalling from Kyiv - an attempt to show the White House how willing they are to reach a settlement, while also trying to show up Putin. The Kremlin has since said it will send admiral Igor Kostyukov, but reiterated there is no chance of a long-term settlement without solving the \"territorial issue\" agreed upon at the Trump-Putin Alaska summit. Making no effort to mask his frustration, Ukraine's wartime leader listed failure after failure by London, Berlin, Paris, and the rest of Europe's NATO capitals to adopt a united front in the face of rapidly evolving challenges. In particular, Zelenskyy pointed to the row with Washington over Greenland, which was started and ended by Trump after he threatened to seize the territory, only to back down, but not before plunging the rest of the alliance into crisis and taking attention away from Russia's war in Ukraine. He also slammed the Europeans for standing on the sidelines while Iran killed thousands of protesters earlier this month, asking: \"What will Iran become after this bloodshed? If the regime survives, it sends a clear signal to every bully - kill enough people, and you stay in power. Who in Europe needs that message to become a reality?\" But his strongest condemnation was for the continued weakness of European allies in the face of Russia's full-scale invasion of his country, which is about to enter its fifth year. Zelenskyy's pointed question Zelenskyy noted how Trump had moved quickly to capture Venezuela's former president Nicolas Maduro and put him on trial, while Putin remains at large despite European desires to establish a special tribunal to try him for war crimes. \"What's missing - time or political will?\" he asked. \"Too often in Europe, something else is always more urgent than justice.\" He was similarly scathing about efforts to bring about a ceasefire in Ukraine, signalling that work led by the UK and France to establish a \"coalition of the willing\" - while \"positive\" - was an empty gesture without US involvement. And pointless unless the fighting stops. \"What about the ceasefire itself? Who can help make it happen?\" he asked. \"Europe loves to discuss the future, but avoids taking action today. Action that defines what kind of future we will have. That's the problem.\" Finally - and this was a point Zelenskyy first made a year ago, so it is hardly surprisingly he is exasperated at having to make it again - the president called on nations across Europe to create a united armed forces to defend their continent. This would be instead of relying on an increasingly unpredictable US as part of the NATO alliance - an idea that has in the past been rejected by countries like the UK that put operating with US forces as a central part of their security planning. Zelenskyy warned that world events right now - from Trump's social media posts to Putin's next bout of hostilities - were moving faster than Europe could cope with. Read more on Sky News:Davos trip 'incredible' - TrumpWho's on Trump's Board of Peace?'Penny dropped' over Greenland \"We should not accept that Europe is just a salad of small and middle powers seasoned with enemies of Europe,\" he said. \"When united, we are truly invincible. \"Europe can and must be a global force, not one that reacts late, but one that defines the future.\""
    },
    {
        "title": "How woman's 'fairytale' home upgrade turned into a nightmare",
        "description": "When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\".",
        "url": "https://news.sky.com/story/how-home-upgrade-scheme-went-from-fairytale-to-worst-experience-of-my-life-13497801",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jane-eco-seabrook_7143140.jpg?20260123013438",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-22 20:11:00",
        "Headline": "A new report by MPs warns the Energy Company Obligation scheme, which left more than 30,000 homes flooded, mouldy or cold, was so \"catastrophic\" it ought to be referred to the Serious Fraud Office.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\". \"Bills have become astronomically expensive in the last few years,\" said Jane, a support worker for people with learning needs. Then she qualified for internal wall insulation, smart radiator sensors and an extractor fan under the ECO (Energy Company Obligation) scheme, designed to upgrade homes for those in fuel poverty and make them greener. It is paid for by energy-bill payers and overseen by a patchwork of energy companies, the government and other agencies. \"I almost felt special, like I could cut energy bills and have a bit left each month,\" said Jane, a single mum of two, who works full-time but receives some universal credit. But she ended up without heating for three weeks, a home flooded from top to bottom, mouldy floors, holes in the walls, doubled heating bills and asthma attacks. \"It's been the worst experience of my life, and it just feels never-ending,\" Jane told Sky News. \"I'm just exhausted, truly, truly exhausted. I have spent every moment I have, between work and kids, pulling furniture around.\" Her home is one of at least 30,000 left with defects by the ECO scheme. The technologies on offer are well evidenced to improve homes, and many installations were done well under ECO. But experts say the poor oversight and money available incentivised \"cowboy\" installers to do the upgrades even in homes that weren't suitable, or to shoddy standards. Damning report shines fresh light on problem Sky News reported some of these problems previously, and the bodies involved have been working since 2024 to fix some of the issues. But a scathing new report today revealed that fewer than 10% of the thousands of homes installed with dodgy wall insulation have been fixed. In the meantime, further bad installations have continued to take place, such as in Jane's rented home in south Wales last autumn. What's more, the remedy has so far focused only on the 30,000 homes with faulty insulation. But Sky News has received reports of scores more issues, from roofs damaged by solar panels, heating systems that couldn't accommodate the heat pumps, or insulation that got wet and spread mould. The common thread is a sense of stress and helplessness. Today's new report found that after a year of trying to resolve the issues, the quality scheme Trustmark had only identified and remedied 3,000 of the at least 30,000 affected by poor insulation. Fraud, failings and financial risk In fact, the Public Account Committee (PAC) of MPs said the whole thing ought to be referred to the Serious Fraud Office for the \"sheer levels of non-compliance\". They described \"a system with serious failings at every level\" that has left already vulnerable recipients financially exposed. Original installers are only liable to cover the remediation costs of up to £20,000, but some properties suffered £250,000 of damage. PAC chair Sir Geoffrey Clifton-Brown MP said: \"Potentially thousands of people are now living with health and safety risks in their homes, and despite government's protestations we have nowhere near enough assurance that they are not financially exposed to unaffordable bills to repair the defective works.\" Read more from Sky News:Police forces to be slashedZelenskyy drops truth bombs on Europe Minister for energy consumers Martin McCluskey said \"we inherited a broken system from the previous government\" and \"are cleaning up this mess\". He said all homes with external wall insulation are being audited, and \"no household should be asked to pay any money to put things right\". Ministers have also decided to replace the ECO with schemes run by local authorities, which have a \"significantly better record of delivery\", and to set up the new Warm Homes Agency, a single system for retrofit \"to provide stronger, formal government oversight and driving up quality\". Concerns mistakes could be repeated The report also raises difficult questions about the government's new Warm Homes plan, which is putting up £15bn to help more homes get onto solar panels, heat pumps and other green technology. Ministers say this has been designed with better oversight to avoid the same mistakes and is also moving away from insulation, given the previous problems. But Sir Geoffrey said the \"public's confidence will have rightly been shaken in retrofit schemes\" and government now has a \"self-inflicted job of work on its hands to restore faith in the action required to bring down bills and reduce emissions\". Simon Francis, coordinator of the End Fuel Poverty Coalition, said: \"Done properly, home upgrades and insulation are among the safest ways to bring down energy bills. Done badly, as we've seen, they can cause real harm.\" He added: \"What's shocking is not just the scale of the damage, but how long it was allowed to happen without effective intervention.\""
    },
    {
        "title": "Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban",
        "description": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said.",
        "url": "https://news.sky.com/story/harriet-harman-why-labours-shambles-social-media-plan-wont-be-fixed-by-ban-13497710",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-harriet-harman-electoral-dysfunction_7142840.png?20260122171126",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 16:39:00",
        "Headline": "Harriet Harman tells the Electoral Dysfunction podcast the government's social media plans are a \"shambles\", warning a ban on under-16s is unworkable and creates a \"cliff edge\" for teenagers.",
        "Content": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said. Speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, the Labour peer cast doubt upon whether a ban on under-16s using social media - as supported by the House of Lords - is workable. The proposals passed by the Lords still need to be agreed by MPs before they become law. The government wants to hold a consultation before committing to a ban. Harman pointed to existing legislation like the Online Harms Bill, Crime and Policing Bill, Data Use and Access Bill, before even considering the Children's Wellbeing and Schools Bill under which peers and some MPs want a social media ban to be legislated. 👉Tap here to listen to Electoral Dysfunction on your podcast app👈 \"It's kind of a shambles, it's not coherent,\" Harman said. \"I really think what we need is a committee in the House of Commons of MPs.\" Without sorting out a \"process\", Harman said the government risked leaping on a ban only to \"discover the ban doesn't work\" and have to try something else, \"which is tougher regulation of social media companies\". \"Meanwhile, people will think we've got this problem and the government is being ineffective, they're not acting appropriately. And that's because the process just does not fit the problem that we've got today,\" she said. 'Cliff edge' warning Another issue raised by Harman was a potential \"cliff edge\" for children when they turn 16. \"You haven't had any sort of education through experience of how to use social media, and you're suddenly exposed to the big wide world with a cliff edge,\" she warned. \"[Another issue] is that for a lot of kids, social media can combat isolation and can help them find their community if they've got a particular problem, and therefore it can have a beneficial effect of linking kids up together.\" Read more from Sky News:How quickly could UK ban teens from social media?What UK social media ban on children could look like In the House of Lords debate about the ban this week, both these points were raised by some peers. Lord Nash, the Conservative peer who proposed the ban, argued against the idea of \"cliff edge\", saying instead the proposal \"seeks merely to give teenagers a few more years to mature so that they can deal more effectively with social media, distinguish fact from fiction and exercise better judgement\". And on access to like-minded communities, he said: \"The police who specialise in child sexual abuse material and radicalisation say that it is precisely the help forums for groups such as LGBTQ+, those with eating disorders, those with ADHD, etc, where the worst abusers hang out and target children.\""
    },
    {
        "title": "Oscar nominations: The biggest snubs and surprises",
        "description": "While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow.",
        "url": "https://news.sky.com/story/the-biggest-snubs-and-surprises-of-this-years-oscar-nominations-13497715",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wicked-for-good-awards-season_7127357.jpg?20260105164713",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2026-01-22 17:36:00",
        "Headline": "As Sinners stars celebrate, Paul Mescal, Ariana Grande and Cynthia Erivo have been left crying into their popcorn. Here are some of the movies and stars that failed to make the cut.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow. Wicked: For Good may have done fairly swift business at the box office, but that simply did not translate into Oscar votes. Read more: Oscar nominations 2026 as it happened After the first instalment of the movie got 10 nods last year, the second part did not receive a single nomination. While its two stars - Cynthia Erivo and Ariana Grande - failed to make it into the best actress and best supporting actress categories, the biggest blow will be missing out on the coveted best picture category. Meanwhile, Paul Mescal was overlooked in the best supporting actor category for his performance as playwright William Shakespeare in the big-screen adaptation of Maggie O'Farrell's award-winning novel Hamnet. While that's the category he campaigned in, some felt he would have been placed in the best actor category, raising the possibility that the Irish star split some of his votes if some people put his name in the latter. Another acting omission was that of Chase Infiniti - breakout star of One Battle After Another, playing the daughter of Leonardo DiCaprio's washed-up revolutionary. Read more: Oscar nominations 2026: The full list After her nomination in the best actress category at the Golden Globes earlier this month, she had been widely expected to appear in the Oscar nominations line-up too. Her four co-stars - Leonardo DiCaprio, Benicio Del Toro, Sean Penn and Teyana Taylor - all made it into the mix. In a tight race, while Infiniti failed to make the best actress cut, Kate Hudson did make it in for her performance in musical drama Song Sung Blue, which was far from guaranteed. A recent publicity event at which she was interviewed by her mother, veteran Hollywood star Goldie Hawn, may well have given her the voter boost she needed to get her over the line. While Mescal and Infiniti missed out, it was a different story for British stars Delroy Lindo, 74, and Wunmi Mosaku, 39, who both got nods for Sinners. RADA-trained British Nigerian actress Mosaku had made her way into the awards conversation in recent days, but Lindo's nod for his portrayal of musician Delta Slim was out of the blue. The London-born actor was critically acclaimed for his performance, but most pundits expected him to be left out in favour of Mescal or Adam Sandler for Jay Kelly. While Norwegian family drama Sentimental Value got an impressive nine nods overall, it got nothing in the new category, best achievement in casting. It's a slightly strange omission, considering it got four nods in the acting categories - Renate Reinsve in best actress in a leading role, both Elle Fanning and Inga Ibsdotter Lilleaas in best supporting actress and Stellan Skarsgard in best supporting actor. And while gothic horror Frankenstein got nine nods - including best picture - Mexican filmmaker Guillermo del Toro missed out in the best director category. Formula One blockbuster F1, starring Damson Idris and Brad Pitt, while expected to do well in the technical categories, also managed to nudge its way into the best picture race. A summer hit, it remains to be seen if it will have the backing to win pole position at this year's Academy Awards in LA on Sunday, 15 March."
    },
    {
        "title": "Andy Burnham, next PM? The big hurdle facing popular mayor",
        "description": "Could Andy Burnham be on the brink of becoming a member of parliament?",
        "url": "https://news.sky.com/story/andy-burnham-next-pm-the-big-hurdle-facing-popular-mayor-13497844",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-burnham-starmer_7031541.jpg?20250925164026",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2026-01-22 22:56:00",
        "Headline": "Ex-Labour health minister Andrew Gwynne has confirmed he is to step down from parliament. The by-election could pave the way for Andy Burnham to return to Westminster, but reports suggest Sir Keir Starmer's allies want to stop him.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Could Andy Burnham be on the brink of becoming a member of parliament? After former minister Andrew Gwynne stepped down as a Labour MP, his Gorton and Denton constituency has been touted as a potential seat for the mayor of Greater Manchester. Starmer responds to leadership speculation - politics latest Well, he faces a BIG hurdle. There is a new rule - introduced in the 2026 Labour rule book - about mayors wanting to become an MP. It says: \"Directly Elected Mayors and Police and Crime Commissioners must seek the express permission of the NEC/SEC/WEC (as applicable) before seeking nomination as Labour candidates for the Westminster Parliament. \"The NEC/SEC/WEC's decision shall be final.\" Burnham would have to stand down as Manchester mayor, triggering an election for that post - which Labour are not guaranteed to win and will cost hundreds of thousands of pounds. So, these are the grounds that could be used to block Burnham by Labour's National Executive Committee (NEC). I'm told Sir Keir Starmer's chief-of-staff Morgan McSweeney thinks he's got the NEC sewn up to block Burnham. But you never quite know. Read more from Sky News:Zelenskyy lashes out at EuropeSnubs and surprises in Oscar nominations If Burnham is granted permission to apply for the seat, the NEC creates a long and a shortlist. NEC member Cat Arnold told Sky News there must be a \"free and fair selection, at long list and shortlist stage\". \"It would be completely unacceptable to gerrymander or unduly narrow the list of potential candidates,\" she said. Political editor A cabinet minister told me last week about a leadership challenge: \"Changing leader is a bit Tory for me.\" \"If we try to change leader, the party will end up tacking to the left and that's not Labour's problem with the country, so it won't be the solution,\" they said. \"It's probably better to try to work on making Starmer better.\" The long list is done over email, then the shortlisting is done by a panel. The panel has three members of the NEC, one member of the board and a local constituency representative. The panel is chosen by the office of the general secretary, Hollie Ridley, who is close to McSweeney. So it's far from clear Burnham wins this."
    },
    {
        "title": "Paul John Lumber: Bristol man died after falling from ladder while tying Union flags to lamp posts at night",
        "description": "A man in his 60s suffered fatal head injuries after he fell from a ladder while tying a Union flag to a lamp post, an inquest has heard.",
        "url": "https://news.sky.com/story/paul-john-lumber-bristol-man-died-after-falling-from-ladder-while-tying-union-flags-to-lampposts-at-night-13497738",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-paul-john-lumber-bristol_7142945.jpg?20260122182137",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 19:10:00",
        "Headline": "Paul John Lumber, a married painter and decorator from Bristol, had been drinking alcohol while watching his football team, Bristol City, last November.",
        "Content": "A man in his 60s suffered fatal head injuries after he fell from a ladder while tying a Union flag to a lamp post, an inquest has heard. Paul John Lumber, 61, a married painter and decorator from Bristol, had been drinking alcohol while at a football match on 22 November. After arriving home at 7.30pm, he took his ladder from his van and went out to put flags on lamp posts near his home in Duckmoor Road, Avon Coroner's Court heard. Neighbours called emergency services after hearing a loud bang and finding Mr Lumber on the ground, with his ladder nearby. He was taken to Southmead Hospital, where he had surgery, but his condition deteriorated, and he died on 6 December. Dr Simon Fox KC, assistant coroner for Avon, reached a conclusion of accidental death following a short hearing on Thursday. He said Mr Lumber \"fell from a ladder while tying a Union Jack flag to a lamp post at night after consuming alcohol\". A well-known fan of Bristol City, Mr Lumber had written two books based on his experiences, titled It All Kicked Off In Bristol, which explored football hooliganism. Dr Richard Moon, who works in the neurosurgery department at Southmead Hospital, said Mr Lumber was reported to have fallen from a ladder on 22 November. A CT scan showed extensive head injuries, including a skull fracture, and, despite having two operations, he later died. His cause of death was recorded as traumatic brain injury and a fall. Coroner's officer Andrew Eastwood said in a statement he had spoken to Mr Lumber's wife Michelle, who told him her husband had \"been to watch Bristol City play football and had consumed several alcoholic drinks\". After returning home, he took the key to his van - where he kept his work ladder - and went out again. Mrs Lumber later heard sirens across the road and went out to find her husband being treated by paramedics, with his ladder nearby and a Union flag on a lamp post. Neighbours had called 999 after hearing a loud bang and discovering Mr Lumber on the ground with a head injury. He had left his home \"to put up flags around the neighbourhood\", paramedics noted. Read more on Sky News:Liz Hurley takes the standPensioner 'failed on every level'Asylum seekers move into barracks Following his death, a close friend, quoted by BristolLive, said friends described him as \"a man whose world revolved around those he loved\". A GoFundMe page set up by a friend, Stephen Gardiner, has raised more than £5,700."
    },
    {
        "title": "Man accused of rape answered Barron Trump video call during altercation, court hears",
        "description": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard.",
        "url": "https://news.sky.com/story/man-accused-of-rape-answered-barron-trump-video-call-during-altercation-court-hears-13497804",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-barron-trump_7143060.jpg?20260122210546",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 20:12:00",
        "Headline": "The son of US President Donald Trump  ended up calling UK police from across the Atlantic after the exchange.",
        "Content": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard. Donald Trump's son called his female friend only for Matvei Rumiantsev, 22, to answer instead. He pointed the camera at Mr Trump's female friend - who was \"hysterical crying, screaming, shouting\", Snaresbrook Crown Court heard on Thursday. The exchange prompted Mr Trump - who was in the US - to call British police and alert them. Rumiantsev now stands trial accused of assault and two counts of rape, among other charges, against the alleged victim. Jurors heard Rumiantsev and the woman had been drinking together on the evening of 17 January last year and into the early hours of the next day. Giving evidence on Thursday, the defendant told jurors that before he answered a call from the US president's son on the alleged victim's phone, the woman had been \"in a stage of complete breakdown\", partly because she had been drinking. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post  \"She was just completely hysterical crying, screaming, shouting at me,\" he added. \"I noticed her phone next to me on the sofa and it was ringing with a Barron Trump face call. \"I don't know what went through my head but I answered yes. \"At that point I was standing up, I stepped away from her maybe for a couple metres… I answered the call and I immediately put the camera towards her. \"I don't know why I did that. \"Maybe I thought she would realise that her behaviour was unreasonable, that she wouldn't behave like this in front of someone else.\" Prosecutors allege Rumiantsev strangled the woman that evening. He was arrested on the morning of 18 January 2025 and taken into custody. In a transcript of the call he made to the emergency services, Mr Trump said: \"Oh I'm calling from the US, uh, I just got a call from a girl, you know, she's getting beat up.\" Mr Trump replied to investigating police in May in an email which said \"what I saw was very brief indeed but indeed prevalent\", the court heard. \"I didn't expect her to pick up due to the difference in the time zone to the fact I am in the USA, the phone was answered but not by her, to my dismay,\" the email continued. \"The individual who picked up the phone was a shirtless man with darkish hair, although I didn't get a good look, this view lasted maybe one second and I was racing with adrenaline. \"The camera was then flipped to the victim getting hit while crying, stating something in Russian. The guy had hung up. This whole interaction had lasted five to seven seconds.\" Rumiantsev, who is Russian, had been working as a receptionist at the time. He stands accused of one count of rape between 17 and 18 January 2025 and another count between 1 and 30 November 2024. He said he has experience in freestyle wrestling and accepted the alleged victim is a lot smaller than him but denied ever strangling, hitting or kicking her. He insisted he had only grabbed the woman's arms on 18 January to prevent her from hitting him. Earlier on Thursday, the court heard Rumiantsev became aware of the alleged victim's friendship with Mr Trump in October 2024. The defendant told the jury that on 3 November 2024, he and the alleged victim had a disagreement. Rumiantsev said: \"I started to explain that I felt upset as well about her talking to Barron Trump. \"I was in no way controlling but I was trying to make her know that if she feels unwell seeing messages I had with girls 10 years ago, she could maybe understand how I felt when she was sat there this moment texting someone else.\" Rumiantsev denies assault, actual bodily harm, intentional strangulation, perverting the course of justice and two counts of rape, in charges dating between 1 November 2024 and 23 January 2025. The trial continues."
    },
    {
        "title": "Zelenskyy lashes out at Europe ahead of first trilateral peace talks",
        "description": "Volodymyr Zelenskyy has lashed out at Europe during his Davos speech ahead of a trilateral meeting between Ukraine, the US and Russia on Friday.",
        "url": "https://news.sky.com/story/zelenskyy-lashes-out-at-europe-ahead-of-first-trilateral-peace-talks-13497839",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ukraine-volodymyr-zelenskyy_7143033.jpg?20260122202247",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:30:00",
        "Headline": "Zelenskyy's speech came after a \"positive\" meeting with Donald Trump, with the Ukraine leader saying a peace plan was \"nearly ready, and that really matters\".",
        "Content": "Volodymyr Zelenskyy has lashed out at Europe during his Davos speech ahead of a trilateral meeting between Ukraine, the US and Russia on Friday. In a speech that at times seemed reminiscent of Donald Trump's attitude towards Europe, the Ukrainian president warned the continent about a never-ending \"groundhog day\", and accused European countries of a lack of action. \"Just last year here in Davos, I ended my speech with the words 'Europe needs to know how to defend itself'. A year has passed and nothing has changed,\" he said. \"We are still in a situation where I must say the same words,\" he lamented. In his speech, Zelenskyy also called for a \"united armed forces\" for Europe while emphasising how reliant Europe is on US military support. Zelenskyy's speech came after a \"positive\" meeting with Trump, with the leader saying a peace plan was \"nearly ready, and that really matters\". The remarks over progress on peace talks come ahead of what Zelenskyy calls the \"first trilateral meeting\" between Ukraine, the US and Russia in the UAE. \n                  Eight skiers killed in Austrian avalanches\n                 \n                  Trump gives withering verdict on America's traditional allies\n                 \n                  Young Germans react to voluntary military service plans\n                 Moscow correspondent On the face of it, a trilateral meeting in Abu Dhabi tomorrow would be a significant development. It would be the first time the Russians, Ukrainians and Americans are in the same room. But we still don't know what will be discussed, or at what level. And we still don’t know if it'll even happen. Here's what we do know… The talks were first mentioned by US envoy Steve Witkoff at an event in Davos this morning. He said that he and Jared Kushner would travel to the UAE directly from Moscow tonight for meetings with working groups from both sides on specific aspects of the peace plan, including \"military to military\" issues. President Zelenskyy then mentioned the talks in his speech. He said they'd be at a \"technical level\". But afterwards, Kyiv announced it'll be sending its top team, including lead negotiator Rustem Umerov as well as Zelenskyy's chief of staff Kyrylo Budanov. The attendance of such senior figures could indicate that the meeting has taken greater significance than originally planned. Perhaps something changed over the course of the day, maybe in the meeting with Zelenskyy and Trump. On the other hand, it could just be signalling from Kyiv - an attempt to show the White House how willing they are to reach a settlement, while also trying to show up Vladimir Putin. At the moment, there's no response from Moscow, so it's unclear if the Russians have agreed to the trilateral meeting. Vladimir Putin doesn't like to be bullied, though. He never responds to others' demands. Everything is on his terms. So don't expect any confirmation or otherwise from the Kremlin until after his meeting with Trump's envoys Steve Witkoff and Jared Kushner later tonight. Pulling out of the meeting at the 11th hour wouldn't look good, though, especially after the US side has hyped it. So I expect the Russians will show up in Abu Dhabi, but it might not be their top team. The Ukrainian leader appeared to suggest the trilateral meeting was an idea from Washington that was sprung upon him at the last moment. \"I hope that the Emirates know about it. Yes. Sometimes we have such surprises from our American side,\" Zelenskyy said. Donald Trump's envoy Steve Witkoff and his son-in-law Jared Kushner were photographed meeting Russian President Vladimir Putin in Moscow on Thursday night ahead of the trilateral meeting. Zelenskyy left Davos saying his country had clinched agreements on a new air defence package during meetings at the World Economic Forum. He also claimed that Ukraine had managed to stop the size of the Russian army from increasing, saying that Russia was suffering losses of 45,000 troops a month."
    },
    {
        "title": "Trump under fire for claiming NATO allies avoided Afghanistan frontline",
        "description": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan.",
        "url": "https://news.sky.com/story/trump-under-fire-for-claiming-nato-allies-avoided-afghanistan-frontline-13497843",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afghanistan-british_7143138.jpg?20260122232937",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:31:00",
        "Headline": "In an interview with Fox News, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". America is the only country to have invoked the alliance's collective defence provision.",
        "Content": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan. In an interview with Fox News in Davos, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". He added: \"We've never needed them. \"They'll say they sent some troops to Afghanistan … and they did, they stayed a little back, a little off the front lines.\" Sky News US correspondent David Blevins said the comments would be deemed \"grossly offensive\" by allies who fought alongside the US. America is the only NATO member to have invoked the collective security provisions of its Article 5 clause - that an attack against one member is an attack on all. That came after the 9/11 terror attacks of 2001, which led to a US-led invasion of Afghanistan. The UK suffered the second-highest number of military deaths in the Afghanistan conflict at 457. The US saw 2,461 deaths. America's allies suffered 1,160 deaths during the conflict - around a third of the total coalition deaths. 'We have always been there' Dame Emily Thornberry MP, chair of the Commons Foreign Affairs Select Committee, said Mr Trump's comments were \"an insult\" to the families of those who died and \"so much more than a mistake\". Speaking on the BBC's Question Time, Dame Emily said: \"How dare he say we weren't on the frontline, how dare he. \"We have always been there whenever the Americans have wanted us, we have always been there.\" In a social media post, Liberal Democrat leader Sir Ed Davey MP said: \"Trump avoided military service five times. \"How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.\" Trump's words 'a disservice' to troops Tory MP Ben Obese-Jecty, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". He said: \"I saw first hand the sacrifices made by British soldiers I served alongside in Sangin where we suffered horrific casualties, as did the US Marines the following year. \"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\" Read more from Sky News:Trump promises Greenland 'deal' will be 'amazing' for USIs president's peace board a new UN or a gang of friends? Last year, US vice president JD Vance hit back at claims of \"disrespecting\" British troops who served in Iraq and Afghanistan, after suggesting a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". At the time, only the UK and France had pledged troops to a potential peacekeeping force."
    },
    {
        "title": "Police forces to be slashed in sweeping reforms",
        "description": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades.",
        "url": "https://news.sky.com/story/number-of-police-forces-to-be-slashed-in-largest-reform-in-decades-13497814",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shabana-mahmood_7084641.jpg?20251118060407",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 21:02:00",
        "Headline": "Tory opposition warn the plan risks \"undermining efforts to fight crime\".",
        "Content": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades. Home Secretary Shabana Mahmood will reveal plans next week for reform that will significantly cut the number of forces down from 43. Critics have long argued the current model is bureaucratic and wastes too much money - and some inside government believe smaller forces are not equipped to deal with serious crimes.   It is understood the reforms would involve merging back-office functions to free up resources to be invested in more police officers. Ministers will also reveal plans for Local Policing Areas - which allow officers to focus on neighbourhood policing. These will be set up across the country to deal with lower level \"local crime\" such as shoplifting and anti-social behaviour. The plans - which the Conservatives say risk \"undermining efforts to fight crime\" - will not come into place until around 2034, insiders have warned. The shift in strategy marks the latest development in ongoing tensions between the police and the home secretary - who last week welcomed plans to allow her to force the resignation of chief constables. Earlier, a government source pointed to Wiltshire Police, which needed support from 40 other forces to respond to the Salisbury poisonings in 2018, as well as vast differences in charge rates for some offences. They said: \"Under this new structure, all forces - regardless of where they are - will have the tools and resources they need to fight serious crime. \"Where you live will no longer determine the outcomes you get from your force.\" It is unclear exactly how many forces will operate under the new framework but an independent review will be announced to look at precise details. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post Similar cuts have been proposed as long as 20 years ago, when then home secretary Charles Clarke suggested cutting the number of forces to 12. But the plans were scrapped by his successor John Reid just four months later after the proposed merger of Lancashire and Cumbria police forces collapsed and senior officers turned against the idea. Allies of Ms Mahmood stressed her commitment to the reforms, but Conservative shadow home secretary Chris Philp said there was \"no evidence\" that merging police forces would cut crime or improve performance. He said: \"Top-down reorganisation risks undermining efforts to fight crime, inevitably leading to centralised control that will hit towns and villages across the country hardest. \"The biggest force, the Met, has the lowest crime solving rates and falling police numbers. Big is not necessarily better.\""
    },
    {
        "title": "Paul John Lumber: Bristol man died after falling from ladder while tying Union flags to lamp posts at night",
        "description": "A man in his 60s suffered fatal head injuries after he fell from a ladder while tying a Union flag to a lamp post, an inquest has heard.",
        "url": "https://news.sky.com/story/paul-john-lumber-bristol-man-died-after-falling-from-ladder-while-tying-union-flags-to-lampposts-at-night-13497738",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-paul-john-lumber-bristol_7142945.jpg?20260122182137",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 19:10:00",
        "Headline": "Paul John Lumber, a married painter and decorator from Bristol, had been drinking alcohol while watching his football team, Bristol City, last November.",
        "Content": "A man in his 60s suffered fatal head injuries after he fell from a ladder while tying a Union flag to a lamp post, an inquest has heard. Paul John Lumber, 61, a married painter and decorator from Bristol, had been drinking alcohol while at a football match on 22 November. After arriving home at 7.30pm, he took his ladder from his van and went out to put flags on lamp posts near his home in Duckmoor Road, Avon Coroner's Court heard. Neighbours called emergency services after hearing a loud bang and finding Mr Lumber on the ground, with his ladder nearby. He was taken to Southmead Hospital, where he had surgery, but his condition deteriorated, and he died on 6 December. Dr Simon Fox KC, assistant coroner for Avon, reached a conclusion of accidental death following a short hearing on Thursday. He said Mr Lumber \"fell from a ladder while tying a Union Jack flag to a lamp post at night after consuming alcohol\". A well-known fan of Bristol City, Mr Lumber had written two books based on his experiences, titled It All Kicked Off In Bristol, which explored football hooliganism. Dr Richard Moon, who works in the neurosurgery department at Southmead Hospital, said Mr Lumber was reported to have fallen from a ladder on 22 November. A CT scan showed extensive head injuries, including a skull fracture, and, despite having two operations, he later died. His cause of death was recorded as traumatic brain injury and a fall. Coroner's officer Andrew Eastwood said in a statement he had spoken to Mr Lumber's wife Michelle, who told him her husband had \"been to watch Bristol City play football and had consumed several alcoholic drinks\". After returning home, he took the key to his van - where he kept his work ladder - and went out again. Mrs Lumber later heard sirens across the road and went out to find her husband being treated by paramedics, with his ladder nearby and a Union flag on a lamp post. Neighbours had called 999 after hearing a loud bang and discovering Mr Lumber on the ground with a head injury. He had left his home \"to put up flags around the neighbourhood\", paramedics noted. Read more on Sky News:Liz Hurley takes the standPensioner 'failed on every level'Asylum seekers move into barracks Following his death, a close friend, quoted by BristolLive, said friends described him as \"a man whose world revolved around those he loved\". A GoFundMe page set up by a friend, Stephen Gardiner, has raised more than £5,700."
    },
    {
        "title": "Andy Burnham, next PM? The big hurdle facing popular mayor",
        "description": "Could Andy Burnham be on the brink of becoming a member of parliament?",
        "url": "https://news.sky.com/story/andy-burnham-next-pm-the-big-hurdle-facing-popular-mayor-13497844",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-burnham-starmer_7031541.jpg?20250925164026",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2026-01-22 22:56:00",
        "Headline": "Ex-Labour health minister Andrew Gwynne has confirmed he is to step down from parliament. The by-election could pave the way for Andy Burnham to return to Westminster, but reports suggest Sir Keir Starmer's allies want to stop him.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Could Andy Burnham be on the brink of becoming a member of parliament? After former minister Andrew Gwynne stepped down as a Labour MP, his Gorton and Denton constituency has been touted as a potential seat for the mayor of Greater Manchester. Starmer responds to leadership speculation - politics latest Well, he faces a BIG hurdle. There is a new rule - introduced in the 2026 Labour rule book - about mayors wanting to become an MP. It says: \"Directly Elected Mayors and Police and Crime Commissioners must seek the express permission of the NEC/SEC/WEC (as applicable) before seeking nomination as Labour candidates for the Westminster Parliament. \"The NEC/SEC/WEC's decision shall be final.\" Burnham would have to stand down as Manchester mayor, triggering an election for that post - which Labour are not guaranteed to win and will cost hundreds of thousands of pounds. So, these are the grounds that could be used to block Burnham by Labour's National Executive Committee (NEC). I'm told Sir Keir Starmer's chief-of-staff Morgan McSweeney thinks he's got the NEC sewn up to block Burnham. But you never quite know. Read more from Sky News:Zelenskyy lashes out at EuropeSnubs and surprises in Oscar nominations If Burnham is granted permission to apply for the seat, the NEC creates a long and a shortlist. NEC member Cat Arnold told Sky News there must be a \"free and fair selection, at long list and shortlist stage\". \"It would be completely unacceptable to gerrymander or unduly narrow the list of potential candidates,\" she said. Political editor A cabinet minister told me last week about a leadership challenge: \"Changing leader is a bit Tory for me.\" \"If we try to change leader, the party will end up tacking to the left and that's not Labour's problem with the country, so it won't be the solution,\" they said. \"It's probably better to try to work on making Starmer better.\" The long list is done over email, then the shortlisting is done by a panel. The panel has three members of the NEC, one member of the board and a local constituency representative. The panel is chosen by the office of the general secretary, Hollie Ridley, who is close to McSweeney. So it's far from clear Burnham wins this."
    },
    {
        "title": "How woman's 'fairytale' home upgrade turned into a nightmare",
        "description": "When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\".",
        "url": "https://news.sky.com/story/how-home-upgrade-scheme-went-from-fairytale-to-worst-experience-of-my-life-13497801",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jane-eco-seabrook_7143140.jpg?20260123013438",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-22 20:11:00",
        "Headline": "A new report by MPs warns the Energy Company Obligation scheme, which left more than 30,000 homes flooded, mouldy or cold, was so \"catastrophic\" it ought to be referred to the Serious Fraud Office.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\". \"Bills have become astronomically expensive in the last few years,\" said Jane, a support worker for people with learning needs. Then she qualified for internal wall insulation, smart radiator sensors and an extractor fan under the ECO (Energy Company Obligation) scheme, designed to upgrade homes for those in fuel poverty and make them greener. It is paid for by energy-bill payers and overseen by a patchwork of energy companies, the government and other agencies. \"I almost felt special, like I could cut energy bills and have a bit left each month,\" said Jane, a single mum of two, who works full-time but receives some universal credit. But she ended up without heating for three weeks, a home flooded from top to bottom, mouldy floors, holes in the walls, doubled heating bills and asthma attacks. \"It's been the worst experience of my life, and it just feels never-ending,\" Jane told Sky News. \"I'm just exhausted, truly, truly exhausted. I have spent every moment I have, between work and kids, pulling furniture around.\" Her home is one of at least 30,000 left with defects by the ECO scheme. The technologies on offer are well evidenced to improve homes, and many installations were done well under ECO. But experts say the poor oversight and money available incentivised \"cowboy\" installers to do the upgrades even in homes that weren't suitable, or to shoddy standards. Damning report shines fresh light on problem Sky News reported some of these problems previously, and the bodies involved have been working since 2024 to fix some of the issues. But a scathing new report today revealed that fewer than 10% of the thousands of homes installed with dodgy wall insulation have been fixed. In the meantime, further bad installations have continued to take place, such as in Jane's rented home in south Wales last autumn. What's more, the remedy has so far focused only on the 30,000 homes with faulty insulation. But Sky News has received reports of scores more issues, from roofs damaged by solar panels, heating systems that couldn't accommodate the heat pumps, or insulation that got wet and spread mould. The common thread is a sense of stress and helplessness. Today's new report found that after a year of trying to resolve the issues, the quality scheme Trustmark had only identified and remedied 3,000 of the at least 30,000 affected by poor insulation. Fraud, failings and financial risk In fact, the Public Account Committee (PAC) of MPs said the whole thing ought to be referred to the Serious Fraud Office for the \"sheer levels of non-compliance\". They described \"a system with serious failings at every level\" that has left already vulnerable recipients financially exposed. Original installers are only liable to cover the remediation costs of up to £20,000, but some properties suffered £250,000 of damage. PAC chair Sir Geoffrey Clifton-Brown MP said: \"Potentially thousands of people are now living with health and safety risks in their homes, and despite government's protestations we have nowhere near enough assurance that they are not financially exposed to unaffordable bills to repair the defective works.\" Read more from Sky News:Police forces to be slashedZelenskyy drops truth bombs on Europe Minister for energy consumers Martin McCluskey said \"we inherited a broken system from the previous government\" and \"are cleaning up this mess\". He said all homes with external wall insulation are being audited, and \"no household should be asked to pay any money to put things right\". Ministers have also decided to replace the ECO with schemes run by local authorities, which have a \"significantly better record of delivery\", and to set up the new Warm Homes Agency, a single system for retrofit \"to provide stronger, formal government oversight and driving up quality\". Concerns mistakes could be repeated The report also raises difficult questions about the government's new Warm Homes plan, which is putting up £15bn to help more homes get onto solar panels, heat pumps and other green technology. Ministers say this has been designed with better oversight to avoid the same mistakes and is also moving away from insulation, given the previous problems. But Sir Geoffrey said the \"public's confidence will have rightly been shaken in retrofit schemes\" and government now has a \"self-inflicted job of work on its hands to restore faith in the action required to bring down bills and reduce emissions\". Simon Francis, coordinator of the End Fuel Poverty Coalition, said: \"Done properly, home upgrades and insulation are among the safest ways to bring down energy bills. Done badly, as we've seen, they can cause real harm.\" He added: \"What's shocking is not just the scale of the damage, but how long it was allowed to happen without effective intervention.\""
    },
    {
        "title": "Man accused of rape answered Barron Trump video call during altercation, court hears",
        "description": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard.",
        "url": "https://news.sky.com/story/man-accused-of-rape-answered-barron-trump-video-call-during-altercation-court-hears-13497804",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-barron-trump_7143060.jpg?20260122210546",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 20:12:00",
        "Headline": "The son of US President Donald Trump  ended up calling UK police from across the Atlantic after the exchange.",
        "Content": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard. Donald Trump's son called his female friend only for Matvei Rumiantsev, 22, to answer instead. He pointed the camera at Mr Trump's female friend - who was \"hysterical crying, screaming, shouting\", Snaresbrook Crown Court heard on Thursday. The exchange prompted Mr Trump - who was in the US - to call British police and alert them. Rumiantsev now stands trial accused of assault and two counts of rape, among other charges, against the alleged victim. Jurors heard Rumiantsev and the woman had been drinking together on the evening of 17 January last year and into the early hours of the next day. Giving evidence on Thursday, the defendant told jurors that before he answered a call from the US president's son on the alleged victim's phone, the woman had been \"in a stage of complete breakdown\", partly because she had been drinking. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post  \"She was just completely hysterical crying, screaming, shouting at me,\" he added. \"I noticed her phone next to me on the sofa and it was ringing with a Barron Trump face call. \"I don't know what went through my head but I answered yes. \"At that point I was standing up, I stepped away from her maybe for a couple metres… I answered the call and I immediately put the camera towards her. \"I don't know why I did that. \"Maybe I thought she would realise that her behaviour was unreasonable, that she wouldn't behave like this in front of someone else.\" Prosecutors allege Rumiantsev strangled the woman that evening. He was arrested on the morning of 18 January 2025 and taken into custody. In a transcript of the call he made to the emergency services, Mr Trump said: \"Oh I'm calling from the US, uh, I just got a call from a girl, you know, she's getting beat up.\" Mr Trump replied to investigating police in May in an email which said \"what I saw was very brief indeed but indeed prevalent\", the court heard. \"I didn't expect her to pick up due to the difference in the time zone to the fact I am in the USA, the phone was answered but not by her, to my dismay,\" the email continued. \"The individual who picked up the phone was a shirtless man with darkish hair, although I didn't get a good look, this view lasted maybe one second and I was racing with adrenaline. \"The camera was then flipped to the victim getting hit while crying, stating something in Russian. The guy had hung up. This whole interaction had lasted five to seven seconds.\" Rumiantsev, who is Russian, had been working as a receptionist at the time. He stands accused of one count of rape between 17 and 18 January 2025 and another count between 1 and 30 November 2024. He said he has experience in freestyle wrestling and accepted the alleged victim is a lot smaller than him but denied ever strangling, hitting or kicking her. He insisted he had only grabbed the woman's arms on 18 January to prevent her from hitting him. Earlier on Thursday, the court heard Rumiantsev became aware of the alleged victim's friendship with Mr Trump in October 2024. The defendant told the jury that on 3 November 2024, he and the alleged victim had a disagreement. Rumiantsev said: \"I started to explain that I felt upset as well about her talking to Barron Trump. \"I was in no way controlling but I was trying to make her know that if she feels unwell seeing messages I had with girls 10 years ago, she could maybe understand how I felt when she was sat there this moment texting someone else.\" Rumiantsev denies assault, actual bodily harm, intentional strangulation, perverting the course of justice and two counts of rape, in charges dating between 1 November 2024 and 23 January 2025. The trial continues."
    },
    {
        "title": "Warning issued after three deaths in 18 months at popular waterfall spot in Wales",
        "description": "The death of three people at a waterfall spot in Wales over an 18-month period has prompted a warning about the safety of the popular location.&#160;",
        "url": "https://news.sky.com/story/warning-issued-after-three-deaths-in-18-months-at-popular-waterfall-spot-in-wales-13497780",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wales-coroner_7142993.jpg?20260122191726",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 19:53:00",
        "Headline": "A coroner has called for additional safety measures to be put in place to prevent future deaths. ",
        "Content": "The death of three people at a waterfall spot in Wales over an 18-month period has prompted a warning about the safety of the popular location.  Rachael Patching, 33, and Helen Patching, 52, drowned while visiting the Ystradfellte waterfalls in Powys in January 2023, while Corey Longdon, 26, died during a trip to the same location in June 2024, a joint inquest heard. At Pontypridd Coroner's Court on Thursday, assistant coroner Rachel Knight expressed concerns about the area's \"non-existent\" phone signal and confusing signposting and called for additional safety measures to be put in place to prevent future deaths. Located in Bannau Brycheiniog National Park - formerly the Brecon Beacons - the waterfalls form part of a scenic walking trail that attracts thousands of visitors each year. The inquest heard the Patchings, a married couple from Kent who had travelled to Wales for a walking holiday, drowned at Sgwd y Pannwr after one of the women slipped and the other entered the water in a bid to save her. Their bodies were discovered in the water by a member of the public, who alerted the emergency services. A statement from Rachael's family said the deaths had been \"devastating to our family and friends\" and insisted they do not want \"another tragic accident at this location, leaving another family to face what we have been through\". Mr Longdon had been walking the trail with his aunt, Lisa Lane, when it is believed he fell while trying to find a shortcut to the waterfall, the inquest heard. Ms Lane said in a statement that she heard a \"loud splash\" and \"someone screaming for help\" after her nephew disappeared from view. Mr Longdon, from Gloucester, was airlifted to hospital but had suffered \"unsurvivable\" injuries. The families of Rachael and Mr Longdon have both raised concerns about insufficient warning signs at the waterfall. However, chief executive of Bannau Brycheiniog National Park Authority, Catherine Mealing-Jones, said she was \"satisfied\" that the trail's most common access points have adequate signage and warned that other measures, such as lifebuoy rings, could cause additional dangers in the water or encourage people to swim. Read more from Sky News:Pensioner killed in 'ritual sacrifice' was 'failed on every level'Warning issued after first Asian hornet nest discovered in Wales Samuel Jones, representing Natural Resources Wales, said there had been \"significant investment, new routes and fencing\" put in place near the site of Mr Longdon's fall in an effort to improve safety. Mr Jones said: \"These organisations do take their responsibilities very seriously and they have to balance their responsibilities with the need to preserve the environment in these locations. \"The ultimate reality of a place like this is that people can go where they choose to go and understand the risk in doing so.\" Ms Knight claimed the paths are not clearly explained for those with minimal hiking experience, and that signs informing people of closures are in \"suboptimal positions\". She added: \"I am concerned that the phone signal is poor to non-existent at many of the busiest and most remote locations, where most serious incidents occur. \"A solution to this issue should be considered.\""
    },
    {
        "title": "Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban",
        "description": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said.",
        "url": "https://news.sky.com/story/harriet-harman-why-labours-shambles-social-media-plan-wont-be-fixed-by-ban-13497710",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-harriet-harman-electoral-dysfunction_7142840.png?20260122171126",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 16:39:00",
        "Headline": "Harriet Harman tells the Electoral Dysfunction podcast the government's social media plans are a \"shambles\", warning a ban on under-16s is unworkable and creates a \"cliff edge\" for teenagers.",
        "Content": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said. Speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, the Labour peer cast doubt upon whether a ban on under-16s using social media - as supported by the House of Lords - is workable. The proposals passed by the Lords still need to be agreed by MPs before they become law. The government wants to hold a consultation before committing to a ban. Harman pointed to existing legislation like the Online Harms Bill, Crime and Policing Bill, Data Use and Access Bill, before even considering the Children's Wellbeing and Schools Bill under which peers and some MPs want a social media ban to be legislated. 👉Tap here to listen to Electoral Dysfunction on your podcast app👈 \"It's kind of a shambles, it's not coherent,\" Harman said. \"I really think what we need is a committee in the House of Commons of MPs.\" Without sorting out a \"process\", Harman said the government risked leaping on a ban only to \"discover the ban doesn't work\" and have to try something else, \"which is tougher regulation of social media companies\". \"Meanwhile, people will think we've got this problem and the government is being ineffective, they're not acting appropriately. And that's because the process just does not fit the problem that we've got today,\" she said. 'Cliff edge' warning Another issue raised by Harman was a potential \"cliff edge\" for children when they turn 16. \"You haven't had any sort of education through experience of how to use social media, and you're suddenly exposed to the big wide world with a cliff edge,\" she warned. \"[Another issue] is that for a lot of kids, social media can combat isolation and can help them find their community if they've got a particular problem, and therefore it can have a beneficial effect of linking kids up together.\" Read more from Sky News:How quickly could UK ban teens from social media?What UK social media ban on children could look like In the House of Lords debate about the ban this week, both these points were raised by some peers. Lord Nash, the Conservative peer who proposed the ban, argued against the idea of \"cliff edge\", saying instead the proposal \"seeks merely to give teenagers a few more years to mature so that they can deal more effectively with social media, distinguish fact from fiction and exercise better judgement\". And on access to like-minded communities, he said: \"The police who specialise in child sexual abuse material and radicalisation say that it is precisely the help forums for groups such as LGBTQ+, those with eating disorders, those with ADHD, etc, where the worst abusers hang out and target children.\""
    },
    {
        "title": "Liz Hurley hits back at 'leak' suggestions and claims phone was bugged, during intense day at High Court",
        "description": "Elizabeth Hurley hit back at suggestions of \"leaks\" among her friends as she gave evidence in the privacy trial against the publisher of the Daily Mail - and became tearful as she spoke about the impact of articles written about her private life.",
        "url": "https://news.sky.com/story/liz-hurley-hits-back-at-leak-suggestions-and-claims-phone-was-bugged-during-intense-day-at-high-court-13497701",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-liz-hurley-court-daily-mail_7142699.jpg?20260122145450",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2026-01-22 16:19:00",
        "Headline": "The actress and model was supported by her son, Damian, as well as her fellow claimant, Prince Harry, as she gave evidence in the High Court. Associated Newspapers, publisher of the Daily Mail, has strenously denied wrongdoing.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Elizabeth Hurley hit back at suggestions of \"leaks\" among her friends as she gave evidence in the privacy trial against the publisher of the Daily Mail - and became tearful as she spoke about the impact of articles written about her private life. The actress and model spent about three hours in the witness box at the High Court, where she and six others, including Prince Harry and Sir Elton John, are suing Associated Newspapers Limited (ANL) over allegations of unlawful information gathering. ANL strenuously denies wrongdoing and also argues the claims have been brought too late. The allegations in Hurley's case relate to 15 articles published between 2002 and 2011. In a written witness statement submitted to the court, Hurley, 60, said the Daily Mail's alleged unlawful acts involved \"tapping my phones and recording my live telephone conversations, placing surreptitious mics on my home windows\" and \"other monstrous, staggering things\". She said the alleged tapping of her landline was a \"brutal invasion of privacy\" that left her feeling \"crushed\". In court, she explained in front of Judge Nicklin how there had been an \"avalanche\" of articles written about her in the 2000s, and particularly after the birth of her son, Damian. Many were \"unpleasant\", she told the court. Hurley became tearful and wiped her eyes several times during her evidence, but each time said she wanted to carry on rather than taking a break. \"I felt really mortified that my son would be able to read all this stuff one day, and I feel really bad that that day is today when all this stuff is being regurgitated again,\" Hurley said. \"Yet again, everyone's privacy is being invaded in this terrible way, and I feel very helpless about that.\" Damian Hurley sat in court to support his mother - joined in the morning by Prince Harry, following his own evidence yesterday. As he arrived at court, Sky News asked the duke how he was feeling - to which he turned and smiled, replying: \"Great, thank you.\" 'I believe people were listening to me' During questioning by Antony White KC, representing ANL, Hurley hit back at his suggestion of \"leaks\" among her friends. Asked why she did not complain about the articles in her claim at the time they were published, Hurley said she had always thought \"complaints were for libel\" - and these stories \"were in essence true\". She continued: \"I believe that is because people were listening to me speak.\" There were \"microphones on the windowsill of my dining room\" and her rooms and landlines were \"bugged\", Hurley told the court. \"Yes, there were leaks, but they were not from my friends,\" she said. Hurley was also questioned about her friendship with her ex-boyfriend Hugh Grant, and the extent of her involvement with Hacked Off, the press reform group he campaigns for. The actress told the court she had donated £350,000 damages awarded to her after a settlement with Mirror Group Newspapers, but was not involved with the group - pushing back on that suggestion from White several times. At the end of her evidence, David Sherborne, who is representing Hurley and the other claimants, asked her how she felt about having to come to court \"as a result of Associated denying the claims\". Hurley responded: \"I don't really want to be here, didn't want to come. \"I find it intimidating. I find it quite traumatic. I don't really like talking about things that happened to me in the past.\" Becoming emotional, she added: \"I find it very painful.\" Read more:The latest updates from courtAnalysis: Harry's short time in the witness box What has ANL said? During his opening statement to the trial earlier this week, Mr White described the allegations against the publisher as \"threadbare\", and said ANL journalists have a \"compelling account of a pattern of legitimate sourcing\" of the articles in question. In a written submission for the trial, the lawyer said allegations of unlawful information gathering (UIG) against ANL, \"including of phone hacking and phone tapping, in connection with Ms Hurley or her 10 named associates\", are \"unsupported by the evidence before the court\". The claims are \"entirely baseless\", he went on, and \"borne of an attempt by members of the claimants' research team, adopted by Ms Hurley and her legal representatives, to present a case of UIG against Associated based entirely on spurious and, or, discredited information.\" Further witnesses for the claimants are due to give evidence next week, before witnesses for ANL are called later on. The trial is set to last about nine weeks, with a decision expected at a later date."
    },
    {
        "title": "Pensioner killed in 'ritual sacrifice' was 'failed on every level', family says",
        "description": "The family of a pensioner killed in a \"ritual sacrifice\" by a woman who escaped from a mental health unit said authorities \"failed on every level\" to protect him.",
        "url": "https://news.sky.com/story/pensioner-killed-in-ritual-sacrifice-was-failed-on-every-level-family-says-13497640",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-roger-leadbeater-sheffield_7142854.jpg?20260122171945",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-22 14:25:00",
        "Headline": "Roger Leadbeater, 74, was stabbed multiple times by a woman who escaped from a mental health unit in what has been described as a \"barbaric\" attack.",
        "Content": "The family of a pensioner killed in a \"ritual sacrifice\" by a woman who escaped from a mental health unit said authorities \"failed on every level\" to protect him. Roger Leadbeater, 74, was stabbed multiple times by Emma Borowy, 32, while walking his dog in a Sheffield park in August 2023. The attack occurred after Borowy absconded while on leave from her unit, an inquest into Mr Leaderbeater's death heard. On Thursday, Sheffield coroner Tanyka Rawden concluded that Borowy's leave request would probably have been rejected if procedures had been followed. Borowy, who had paranoid schizophrenia, told police and psychiatrists she was \"tricked by the devil\" into killing Mr Leadbeater in a \"ritual sacrifice\". She died in prison four months after the attack. She had absconded from her ward nine times, attempted to abscond 15 times and failed to return from leave three times, the inquest heard. The coroner outlined how Borowy was still granted permission for escorted leave two days before she attacked Mr Leadbeater. Borowy's care was transferred to a new consultant who approved more leave \"without clear documentation of the reasons for the decision, without consideration of a detailed risk assessment, and outside of the policies which stated that leave after a suspension should be reviewed face-to-face\". Ms Rawden concluded \"it is likely the risk factors would have been too high and leave would not have been granted\" if the procedures at Greater Manchester Mental Health NHS Foundation Trust had been followed. Borowy was first sectioned in October 2022 after being arrested for killing two goats with a knife. Ms Rawden also criticised both Greater Manchester and South Yorkshire police forces for how they dealt with handovers of vulnerable missing people. Outside the coroner's court, Mr Leadbeater's niece Angela Hector criticised Greater Manchester Mental Health, Greater Manchester Police and South Yorkshire Police. \"Emma Borowy put her trust in you to keep her safe and well,\" she said. \"The public put their trust in you to protect us. You all failed on every level.\" Read more from Sky News:£20,000 reward offered to catch 'Beast of Birkenhead' Mother-of-10 kept woman as 'house slave' Ms Hector urged the responsible authorities to \"feel what it's like to live with the consequences of your decisions\", adding: \"I am certain you would think twice before granting leave, before withholding vital information, before ignoring clear warnings.\" She described how her uncle had suffered 124 injuries, in an attack that \"was not just violence, it was barbaric beyond comprehension\". \"This is like a horror film you cannot switch off, except this is real,\" she said. The coroner will now send prevention of future death (PFD) reports to both police forces, the Home Office, the College of Policing and the National Police Chief's Council, in relation to the handover of missing vulnerable people. Ms Rawden said she would wait until August before deciding to issue one for the hospital trust - which said it \"learned lessons\" and intended to implement a range of measures to improve procedures. Greater Manchester Assistant Chief Constable Steph Parker said: \"On behalf of GMP I want to apologise to Roger's family for our failure to properly pass key information to other partners before and after he was killed. \"It is to our great regret that this tragic incident could ever have happened.\" South Yorkshire Police's Detective Chief Superintendent Laura Koscikiewicz said: \"We fully accept the learning opportunities highlighted during the inquest and that changes should have been made sooner around the handover of missing people to other agencies, to ensure key information is passed on. \"We are sorry that these processes were not in place at the time.\""
    },
    {
        "title": "Trump under fire for claiming NATO allies avoided Afghanistan frontline",
        "description": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan.",
        "url": "https://news.sky.com/story/trump-under-fire-for-claiming-nato-allies-avoided-afghanistan-frontline-13497843",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afghanistan-british_7143138.jpg?20260122232937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:31:00",
        "Headline": "In an interview with Fox News, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". America is the only country to have invoked the alliance's collective defence provision.",
        "Content": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan. In an interview with Fox News in Davos, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". He added: \"We've never needed them. \"They'll say they sent some troops to Afghanistan … and they did, they stayed a little back, a little off the front lines.\" Sky News US correspondent David Blevins said the comments would be deemed \"grossly offensive\" by allies who fought alongside the US. America is the only NATO member to have invoked the collective security provisions of its Article 5 clause - that an attack against one member is an attack on all. That came after the 9/11 terror attacks of 2001, which led to a US-led invasion of Afghanistan. The UK suffered the second-highest number of military deaths in the Afghanistan conflict at 457. The US saw 2,461 deaths. America's allies suffered 1,160 deaths during the conflict - around a third of the total coalition deaths. 'We have always been there' Dame Emily Thornberry MP, chair of the Commons Foreign Affairs Select Committee, said Mr Trump's comments were \"an insult\" to the families of those who died and \"so much more than a mistake\". Speaking on the BBC's Question Time, Dame Emily said: \"How dare he say we weren't on the frontline, how dare he. \"We have always been there whenever the Americans have wanted us, we have always been there.\" In a social media post, Liberal Democrat leader Sir Ed Davey MP said: \"Trump avoided military service five times. \"How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.\" Trump's words 'a disservice' to troops Tory MP Ben Obese-Jecty, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". He said: \"I saw first hand the sacrifices made by British soldiers I served alongside in Sangin where we suffered horrific casualties, as did the US Marines the following year. \"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\" Read more from Sky News:Trump promises Greenland 'deal' will be 'amazing' for USIs president's peace board a new UN or a gang of friends? Last year, US vice president JD Vance hit back at claims of \"disrespecting\" British troops who served in Iraq and Afghanistan, after suggesting a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". At the time, only the UK and France had pledged troops to a potential peacekeeping force."
    },
    {
        "title": "Zelenskyy lashes out at Europe ahead of first trilateral peace talks",
        "description": "Volodymyr Zelenskyy has lashed out at Europe during his Davos speech ahead of a trilateral meeting between Ukraine, the US and Russia on Friday.",
        "url": "https://news.sky.com/story/zelenskyy-lashes-out-at-europe-ahead-of-first-trilateral-peace-talks-13497839",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ukraine-volodymyr-zelenskyy_7143033.jpg?20260122202247",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:30:00",
        "Headline": "Zelenskyy's speech came after a \"positive\" meeting with Donald Trump, with the Ukraine leader saying a peace plan was \"nearly ready, and that really matters\".",
        "Content": "Volodymyr Zelenskyy has lashed out at Europe during his Davos speech ahead of a trilateral meeting between Ukraine, the US and Russia on Friday. In a speech that at times seemed reminiscent of Donald Trump's attitude towards Europe, the Ukrainian president warned the continent about a never-ending \"groundhog day\", and accused European countries of a lack of action. \"Just last year here in Davos, I ended my speech with the words 'Europe needs to know how to defend itself'. A year has passed and nothing has changed,\" he said. \"We are still in a situation where I must say the same words,\" he lamented. In his speech, Zelenskyy also called for a \"united armed forces\" for Europe while emphasising how reliant Europe is on US military support. Zelenskyy's speech came after a \"positive\" meeting with Trump, with the leader saying a peace plan was \"nearly ready, and that really matters\". The remarks over progress on peace talks come ahead of what Zelenskyy calls the \"first trilateral meeting\" between Ukraine, the US and Russia in the UAE. \n                  Eight skiers killed in Austrian avalanches\n                 \n                  Trump gives withering verdict on America's traditional allies\n                 \n                  Young Germans react to voluntary military service plans\n                 Moscow correspondent On the face of it, a trilateral meeting in Abu Dhabi tomorrow would be a significant development. It would be the first time the Russians, Ukrainians and Americans are in the same room. But we still don't know what will be discussed, or at what level. And we still don’t know if it'll even happen. Here's what we do know… The talks were first mentioned by US envoy Steve Witkoff at an event in Davos this morning. He said that he and Jared Kushner would travel to the UAE directly from Moscow tonight for meetings with working groups from both sides on specific aspects of the peace plan, including \"military to military\" issues. President Zelenskyy then mentioned the talks in his speech. He said they'd be at a \"technical level\". But afterwards, Kyiv announced it'll be sending its top team, including lead negotiator Rustem Umerov as well as Zelenskyy's chief of staff Kyrylo Budanov. The attendance of such senior figures could indicate that the meeting has taken greater significance than originally planned. Perhaps something changed over the course of the day, maybe in the meeting with Zelenskyy and Trump. On the other hand, it could just be signalling from Kyiv - an attempt to show the White House how willing they are to reach a settlement, while also trying to show up Vladimir Putin. At the moment, there's no response from Moscow, so it's unclear if the Russians have agreed to the trilateral meeting. Vladimir Putin doesn't like to be bullied, though. He never responds to others' demands. Everything is on his terms. So don't expect any confirmation or otherwise from the Kremlin until after his meeting with Trump's envoys Steve Witkoff and Jared Kushner later tonight. Pulling out of the meeting at the 11th hour wouldn't look good, though, especially after the US side has hyped it. So I expect the Russians will show up in Abu Dhabi, but it might not be their top team. The Ukrainian leader appeared to suggest the trilateral meeting was an idea from Washington that was sprung upon him at the last moment. \"I hope that the Emirates know about it. Yes. Sometimes we have such surprises from our American side,\" Zelenskyy said. Donald Trump's envoy Steve Witkoff and his son-in-law Jared Kushner were photographed meeting Russian President Vladimir Putin in Moscow on Thursday night ahead of the trilateral meeting. Zelenskyy left Davos saying his country had clinched agreements on a new air defence package during meetings at the World Economic Forum. He also claimed that Ukraine had managed to stop the size of the Russian army from increasing, saying that Russia was suffering losses of 45,000 troops a month."
    },
    {
        "title": "Zelenskyy drops brutal truth bombs upon European allies",
        "description": "Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-europe-cant-act-without-us-leadership-and-is-stuck-in-a-groundhog-day-style-doom-loop-ukrainian-president-says-13497797",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-volodymyr-zelenskyy_7143087.jpg?20260122214919",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-22 19:44:00",
        "Headline": "Comparing its preference for talk over action to Bill Murray's comedy classic, Mr Zelenskyy says Europe is a \"fragmented kaleidoscope of small and middle powers\", endlessly talking about what needs to be done, without doing it.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Volodymyr Zelenskyy dropped a barrage of truth bombs on his European allies about their collective failure to stand up to Russian President Vladimir Putin and be respected by his US counterpart, Donald Trump. Invoking the spectacle of Bill Murray's classic comedy, Groundhog Day, at a speech in Davos, the Ukrainian president said the UK and Europe are stuck in a doom loop, repeating rhetoric about what needs to be done - without taking the action required to make things change. This, he said, meant they were left scrambling to respond to world events instead of standing united as a great power with the ability to shape their collective destiny. Latest - Trump envoy in Moscow Only from such a position of strength could Europe hope to influence supposed friends such as Trump and foes like Putin. Addressing the World Economic Forum following a face-to-face meeting with Trump, Zelenskyy said Europe \"remains a beautiful but fragmented kaleidoscope of small and middle powers\". \"Instead of taking the lead in defending freedom worldwide, especially when America's focus shifts elsewhere, Europe looks lost, trying to convince the US president to change,\" he said. \"But he will not change. President Trump loves who he is, and he says he loves Europe, but he will not listen to this kind of Europe.\" The remarks over progress on peace talks come ahead of what Zelenskyy calls the \"first trilateral meeting\" between Ukraine, the US, and Russia in the UAE. The talks were first mentioned by US envoy Steve Witkoff at an event in Davos on Thursday morning.  He said he and Jared Kushner would travel to the UAE directly from Moscow on Thursday night for meetings with working groups from both sides on specific aspects of the peace plan, including \"military to military\" issues. Zelenskyy then mentioned the talks in his speech.  He said they'd be at a \"technical level\", but afterwards, Kyiv announced it'll be sending its top team, including lead negotiator Rustem Umerov as well as Zelenskyy's chief of staff Kyrylo Budanov. The attendance of such senior figures could indicate that the meeting has taken greater significance than originally planned. Perhaps something changed over the course of the day, maybe in the meeting with Zelenskyy and Trump. On the other hand, it could just be signalling from Kyiv - an attempt to show the White House how willing they are to reach a settlement, while also trying to show up Putin. The Kremlin has since said it will send admiral Igor Kostyukov, but reiterated there is no chance of a long-term settlement without solving the \"territorial issue\" agreed upon at the Trump-Putin Alaska summit. Making no effort to mask his frustration, Ukraine's wartime leader listed failure after failure by London, Berlin, Paris, and the rest of Europe's NATO capitals to adopt a united front in the face of rapidly evolving challenges. In particular, Zelenskyy pointed to the row with Washington over Greenland, which was started and ended by Trump after he threatened to seize the territory, only to back down, but not before plunging the rest of the alliance into crisis and taking attention away from Russia's war in Ukraine. He also slammed the Europeans for standing on the sidelines while Iran killed thousands of protesters earlier this month, asking: \"What will Iran become after this bloodshed? If the regime survives, it sends a clear signal to every bully - kill enough people, and you stay in power. Who in Europe needs that message to become a reality?\" But his strongest condemnation was for the continued weakness of European allies in the face of Russia's full-scale invasion of his country, which is about to enter its fifth year. Zelenskyy's pointed question Zelenskyy noted how Trump had moved quickly to capture Venezuela's former president Nicolas Maduro and put him on trial, while Putin remains at large despite European desires to establish a special tribunal to try him for war crimes. \"What's missing - time or political will?\" he asked. \"Too often in Europe, something else is always more urgent than justice.\" He was similarly scathing about efforts to bring about a ceasefire in Ukraine, signalling that work led by the UK and France to establish a \"coalition of the willing\" - while \"positive\" - was an empty gesture without US involvement. And pointless unless the fighting stops. \"What about the ceasefire itself? Who can help make it happen?\" he asked. \"Europe loves to discuss the future, but avoids taking action today. Action that defines what kind of future we will have. That's the problem.\" Finally - and this was a point Zelenskyy first made a year ago, so it is hardly surprisingly he is exasperated at having to make it again - the president called on nations across Europe to create a united armed forces to defend their continent. This would be instead of relying on an increasingly unpredictable US as part of the NATO alliance - an idea that has in the past been rejected by countries like the UK that put operating with US forces as a central part of their security planning. Zelenskyy warned that world events right now - from Trump's social media posts to Putin's next bout of hostilities - were moving faster than Europe could cope with. Read more on Sky News:Davos trip 'incredible' - TrumpWho's on Trump's Board of Peace?'Penny dropped' over Greenland \"We should not accept that Europe is just a salad of small and middle powers seasoned with enemies of Europe,\" he said. \"When united, we are truly invincible. \"Europe can and must be a global force, not one that reacts late, but one that defines the future.\""
    },
    {
        "title": "Who's on Trump's Board of Peace - and who said no",
        "description": "Donald Trump says \"a lot of great people\" want to join his Board of Peace - but some world leaders are clearly worried the controversial initiative could undermine the United Nations.",
        "url": "https://news.sky.com/story/what-is-trumps-board-of-peace-and-is-it-going-to-replace-the-un-13497460",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-board-of-peace_7142415.jpg?20260122105300",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2026-01-22 08:22:00",
        "Headline": "Originally planned as a small group to oversee the Gaza ceasefire, the board has morphed into something far more ambitious - and Trump could be chairman for life.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n Donald Trump says \"a lot of great people\" want to join his Board of Peace - but some world leaders are clearly worried the controversial initiative could undermine the United Nations. Originally envisioned as a small group that would oversee the ceasefire in Gaza, it has morphed into something far more ambitious. On a stage in Davos on Thursday, Mr Trump hailed a \"very exciting day, long in the making\" as he invited leaders to sign the organisation's charter. Some 60 nations have been invited to join the board - at a cost of a billion dollars each if they want to be permanent members. Mr Trump will be the inaugural chairman of the board - a position he can hold for life, under the plans. The new body is taking shape in the aftermath of US military strikes on Venezuela and the president's threats to take control of Greenland and intervene in Iran. What is the Board of Peace? \n                  Trump under fire for claiming NATO allies avoided Afghanistan frontline\n                 \n                  Zelenskyy lashes out at Europe ahead of first trilateral peace talks\n                 \n                  Zelenskyy drops brutal truth bombs upon European allies\n                 Mr Trump first proposed the idea in September when he announced his plan to end the war in Gaza. He has since said that its remit will be expanded beyond Gaza to tackle other global conflicts and promote peace around the world. The Board of Peace's charter reportedly says its chairman, Mr Trump, will have extensive executive power, including the ability to veto decisions and remove members, subject to some constraints. The White House has picked Secretary of State Marco Rubio, special envoy Steve Witkoff and Mr Trump's son-in-law Jared Kushner, as well as former British prime minister Tony Blair, as members of the initiative's founding executive board. Questions about what the Board of Peace's remit will be, and how it will work, remain - causing some nations to hesitate in responding to invitations. Others have raised questions about why Russia's President Vladimir Putin and other authoritarian leaders had even been invited to join. What is its role in Gaza? The Board of Peace was originally set up to help secure peace in Gaza, where a fragile ceasefire came into effect in October last year. For this, it was given a mandate by the United Nations Security Council, which also authorised it to deploy a temporary International Stabilisation Force in Gaza. Earlier this month, the Trump administration announced that phase two of the Gaza peace plan was underway, which it said \"begins the full demilitarisation and reconstruction of Gaza\". Under the plan, a body comprised of 15 Palestinian leaders will be given the huge task of governing Gaza day-to-day, ultimately reporting to the Board of Peace. Despite the ceasefire, Gaza continues to see episodes of deadly violence, with Israel and Hamas accusing each other of violating the peace deal. Who is going to be on the Board of Peace? Around 60 nations have been invited to join the Board of Peace, with some 35 agreeing to join so far, a senior Trump administration official said. \"We have a lot of great people that want to join,\" Mr Trump on Wednesday as he stood next to Egyptian President Abdel-Fattah el Sissi. \"It's going to be the most prestigious board ever formed.\" Those signed up include Middle East allies such as Israel, Saudi Arabia, the United Arab Emirates, Bahrain, Jordan, Qatar and Egypt. Others include NATO members Turkey and Hungary, whose leaders have good ties with Mr Trump; as well as Armenia and Azerbaijan, which reached a US-brokered peace agreement last year. Morocco, Pakistan, Indonesia, Kosovo, Uzbekistan, Kazakhstan, Paraguay, and Vietnam have also agreed to take part. More controversially, Belarusian President Alexander Lukashenko has accepted an invitation. Read more:Analysis: US allies need to learn key lesson from GreenlandHow Greenland 'misunderstanding' may have sparked diplomatic chaos Who's said no? A number of European countries have declined their invitations. Norway, Sweden and France have all declined their invitations, while Italy's economy minister Giancarlo Giorgetti said joining a group led by one country's leader would violate Italy's constitution.In the UK Foreign Secretary Yvette Cooper has said the government has concerns that Russia's Putin has been invited to join and the UK will not take part in the signing ceremony. Neither Russia nor China have said if they will accept their invitations. What about the United Nations? This is a sticking point for a lot of world leaders. Despite concerns and criticisms about the United Nations' effectiveness in recent years, there is not a unanimous appetite to create a body that could undermine it. Mr Trump has spoken about the board replacing some of the functions of the United Nations and perhaps even making it eventually obsolete. In his view, the UN \"hasn't been very helpful\" and \"has never lived up to its potential\". But he has also said it should continue \"because the potential is so great\"."
    },
    {
        "title": "Is Trump's peace board a new UN or a gang of friends?",
        "description": "When it was announced, four months ago, the idea of a Board of Peace seemed wholly entwined with the future of Gaza.",
        "url": "https://news.sky.com/story/is-trumps-peace-board-a-new-un-or-a-gang-of-friends-13497816",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-board-of-peace_7142376.jpg?20260122102742",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-22 21:07:00",
        "Headline": "No subtitle found",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n When it was announced, four months ago, the idea of a Board of Peace seemed wholly entwined with the future of Gaza. Since then, things have changed. Now, the board has taken on a more expansive view. Perhaps it was always planned like that, but in Davos its ambitions became more overt, its scope much wider and its pace more pressing. The message: yes, Gaza, but also yes, everything else. On Gaza, the tentacles of the Trump peace plan are certainly spreading. As the board members gathered for the first time, Jared Kushner, the son-in-law who doubles as Trump's roving deal-making diplomat, delivered a short PowerPoint presentation that showed his vision for how Gaza could be redesigned and rethought as a paradise of free market economics. His message was quite evident - that Gaza should not be considered as a warzone, but as an investment opportunity, and a chance for a new economic model. Instead of allowing people to live lives bankrolled by aid, he said, the world should create a Gaza that was fuelled by investment and entrepreneurship. The ambition appeared enormous, and it also seemed like a crashing contrast with the reality of vast numbers of people sleeping in torn tents amid piles of rubble that will take years to clear. It's one thing to talk about a sweeping revival, and another thing to deliver it. So is it cynical to suggest that a creation born out of a war in the Middle East should now be seen as a challenger to the United Nations? Honestly, probably not. Has anyone ever scored a point by underestimating the ambition of the American president? For one thing, the UN is hardly the most popular organisation in the world. Despite its aspirations and humanitarian credentials, it has found itself with an endless list of critics who accuse the UN of everything from institutionalised bias to wholesale corruption. Israel which, in particular, regards it with contempt, this week started work to demolish the Jerusalem headquarters of UNRWA, a UN agency founded to support Palestinian refugees that Israel has repeatedly accused of enabling Hamas. The UN, in turn, has rejected those criticisms and described the demolition as \"an unprecedented attack\". Israel will join this new board. More than one Israeli official has said to me that they would much rather deal with the White House than the UN, however capricious the American administration may be. Of course, there are countless others around the world who would ride to the UN's defence. But even the organisation's own leader admits that it is struggling to maintain its preeminent position in global diplomacy. The Board of Peace won't usurp the UN any time soon. In fact, there's a very good chance it will never do any such thing, particularly if it continues to be treated with scorn by Europe. Read more:Who's on Trump's Board of Peace - and who said noIs a new world 'without rules' emerging? But it is a challenge, and a symbol of how the world order is changing before our eyes. America, for so long the self-proclaimed leader and policeman of the free world, is now setting up its own gang. For the moment, the Board of Peace is largely reserved for Trump's friends, and those who want to be his friend. He is, after all, chairman for life, and he also has the right to nominate his successor. Quite what might happen if America were to elect a Democrat president in 2028 is anyone's guess. But if Russia were to join the board now, or India, or China, or all of them, then the dynamic would change. Suddenly this board might have immense gravitational pull and power, like a masonic lodge with nuclear weapons. We live in a time of unprecedented diplomacy and unpredictable outcomes. And for many, that is uncomfortable."
    },
    {
        "title": "The reality behind Trump's Greenland 'deal'",
        "description": "European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours.",
        "url": "https://news.sky.com/story/the-truth-behind-trumps-greenland-deal-13497401",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-nato-denmark_7142105.png?20260122011635",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2026-01-22 02:31:00",
        "Headline": "Donald Trump's team will act like he has achieved something with an apparent \"framework of a deal\" on Greenland. But be in no doubt, that's nonsense - and the US president has inflicted serious damage to the trans-Atlantic alliance.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours. There is no \"framework of a deal\". Not yet. Donald Trump may claim there is, but that's only because he needed a way to back down from his threats when he realised that he wasn't going to be able to own Greenland. Trump to roll out 'Board of Peace' at Davos - live updates \"Is this just Trump's off-ramp? No actual framework of a deal yet?\" I asked one diplomat at the heart of it all. The response: \"Exactly.\" Through the \"Trump whisperer\", NATO secretary general Mark Rutte, the Danish and Greenlander positions have essentially been reiterated to the American president. During a face-to-face meeting in Davos, pre-existing commitments in the 1951 US-Denmark treaty were reemphasised and European nations re-committed to increase their own defence of Greenland. When they did precisely this last week, by literally sending senior military officials to Greenland, Trump interpreted it as a provocation against him and issued the tariff threat. \"I'm so bored of this now…\" one European ambassador told me over the weekend, such is the level of weariness over the American president's antics. Read more from Sky News:This crisis is far from over for NATO A trio of U-turns The day in Davos was dizzying even by Trump's standards. He first U-turned on the implicit threat of military action, then he U-turned on the tariff threat, and then he U-turned on the insistence that he take sovereignty of Greenland. All in the space of a day. The penny had dropped in his head, it seems. He realised his Greenland ownership plans were more than just unpopular at home (among his own side too). They were seen as self-defeating, undeliverable and frankly mad. An emergency EU leaders summit is set to go ahead today despite Trump's U-turn on Greenland and imposing tariffs. The US president has claimed everyone is \"very happy\" after claiming a deal is in the works over the future of the Arctic territory. Speaking at the World Economic Forum on Wednesday, Trump also scrapped a threat to impose tariffs on European allies, including the UK, over their opposition to his proposed takeover following a meeting with NATO chief Mark Rutte. Posting on Truth Social, Trump said the framework of a future deal also spanned the \"entire Arctic region\", adding the \"solution\" will be great for the US and all NATO countries. He said he had spoken with other European leaders about it, but nothing had yet been signed and details have not been forthcoming. Trump also declared the US \"won't use force\" to take Greenland. It came after the US president's threats to take Greenland prompted a furious response from leaders on the continent and in London, with Sir Keir Starmer refusing to bow to pressure. Starmer will host the Danish PM in Downing Street later. He arrived in Davos to a wave of opposition. For once, Europe was united and firm. It can be incredibly effective when it's both of those things together. Of course, Team Trump will spin this as another blinding example of the president's \"art of the deal\" playing out; like they achieved something. But be in no doubt, that's nonsense. It's half show, half ineptitude, which is deeply damaging to the trans-Atlantic partnership. America under Trump is less reliable by the day. And the damage is lasting. Where are we now - and what next? On Greenland, we are now back at the position we were in last week when the Danish and Greenland foreign ministers met Trump's team. They agreed then to form a \"working group\" to seek a middle ground which addressed Trump's security concerns while not handing over Greenland's sovereignty. All that Trump really did today was to agree on the American participants in that working group. So where next? Both sides will look for a middle ground that doesn't hand over Greenland to America. There is plenty of space for ideas and creative thinking - there always was if only the American president was willing to listen. It's likely that the middle ground will involve some sort of arrangement similar to the UK military bases in Cyprus. New US military bases would be established in uninhabited parts of Greenland on a lease or sale deal. They would become American territory, but sovereignty of Greenland would remain unchanged."
    },
    {
        "title": "67 people killed in Pakistan shopping centre fire",
        "description": "The remains of dozens more people killed in an inferno at a shopping centre in Pakistan have been found, bringing the total number killed to 67.",
        "url": "https://news.sky.com/story/remains-of-dozens-more-people-recovered-from-shopping-centre-fire-in-pakistan-taking-number-killed-to-67-13497708",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-karachi-pakistan-fire_7142872.jpg?20260122172727",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 18:38:00",
        "Headline": "Police surgeon Dr Summaiya Syed says most remains had been discovered in fragments, making identification extremely difficult.",
        "Content": "The remains of dozens more people killed in an inferno at a shopping centre in Pakistan have been found, bringing the total number killed to 67. The fire at the multi-storey Gul Plaza in the country's largest city of Karachi was extinguished late last Sunday, nearly 24 hours after it broke out. By the time the blaze was extinguished, the building had largely been reduced to a mass of ash and debris. Police surgeon Dr Summaiya Syed said most remains had been discovered in fragments, making identification extremely difficult. She said 67 deaths have been confirmed, with rescue teams still searching the centre. The previous number of deaths confirmed by authorities stood at 34. The blaze erupted when most shop owners were either closing for the day or had already left, investigators said. The Sindh provincial government said around 70 people went missing when the flames spread rapidly, fuelled by goods such as cosmetics, clothing and plastic household items. While the cause of the fire remains under investigation, police have indicated a short circuit may be behind the blaze. Read more from Sky News:Spain sees fourth train crash in five daysWho's on Trump's Board of Peace - and who said no Karachi has a history of deadly fires, with most buildings in the city and elsewhere in the country lacking fire prevention and firefighting systems. In November 2023, 10 people were killed and 22 injured in a fire at another shopping centre in the city. In 2012, a massive fire at a garment factory in the city killed 260 people."
    },
    {
        "title": "Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return",
        "description": "Nigerian bandits who kidnapped more than 150 churchgoers are demanding 17 motorbikes in return.",
        "url": "https://news.sky.com/story/nigerian-bandits-who-kidnapped-150-churchgoers-demand-motorbikes-in-return-13497721",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigeria-kidnappings_7139887.jpg?20260119174028",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 16:54:00",
        "Headline": "The bikes are believed to cost around $1,000 each and help rogue gangs navigate the vast Nigerian forest.",
        "Content": "Nigerian bandits who kidnapped more than 150 churchgoers are demanding 17 motorbikes in return. It comes after attackers raided three different churches in conflict-hit Kaduna state, northwest Nigeria, on Sunday. They seized 177 people - before 11 managed to escape. It marks one of the largest mass abductions in recent months for the country - which has been plagued by sectarian violence. The abductors are now demanding 17 motorcycles - costing roughly $1,000 each - to begin negotiations for their release, local residents told the Associated Press. Local village leader Ishaku Dan'azumi said: \"They said that they want 17 motorcycles (and) have not told us yet that they need money. Sebastine Barde, president of the Adara Development Association ethnic group in the district, added: \"The abductors said they lost 17 motorcycles and they want their replacement.\" \n                  Nigerian troops rescue 62 hostages in crackdown on armed gangs, army says\n                 \n                  Anthony Joshua's driver appears in court over fatal crash in Nigeria\n                 \n                  Gunmen abduct more than 150 Christians in mass kidnapping\n                 Gunmen in Nigeria's conflict-ridden hotspots often use bikes to get through vast forest reserves that serve as their hideouts, making it easier to evade security forces. Read more from Sky News:Sinners breaks Oscars nomination recordExplainer: Who's on Trump's Board of Peace Nigerian security forces have deployed tactical teams in search of the kidnappers - believed to be among the rogue gangs who often carry out kidnappings for ransoms in remote areas of the country. Kaduna Governor Uba Sani visited the affected areas in Kajuru late on Wednesday and said the state is working closely with security agencies to find and rescue the hostages. \"Our administration will continue to pursue peace, security and inclusive development,\" he said. Attacks on churches have sparked claims of religious persecution by US President Donald Trump and others, although the Nigerian government says the security crisis is not a \"Christian genocide\". Nonetheless, on Christmas Day, US strikes rained down near Sokoto - a Muslim-majority city in the north of the country - allegedly targeting an Islamic State group in what Mr Trump called a \"Christmas present\"."
    },
    {
        "title": "Gunman at large in Lake Cargelligo, Australia, after three people shot dead ",
        "description": "A gunman is reported to be at large in an Australian town following shootings that killed three people and wounded one. ",
        "url": "https://news.sky.com/story/gunman-at-large-in-lake-cargelligo-australia-after-three-people-shot-dead-13497500",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lake-cargelligo-new-south-wales_7142380.jpg?20260122102828",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 09:45:00",
        "Headline": "The shootings in New South Wales came during a national day of mourning for the victims of December's Bondi Beach massacre that saw gunmen kill 15.",
        "Content": "A gunman is reported to be at large in an Australian town following shootings that killed three people and wounded one.  Police were called to two addresses in Lake Cargelligo, New South Wales, after 4pm on Thursday (7am in the UK). Two couples, a man and woman, had been shot in each location within minutes, Police Assistant Commissioner Andy Holland said. Both women, and a man, died. Another man was taken to hospital in serious but stable condition, he added. State police have been searching for the suspect and have cordoned off the town - which has a population of around 1,500 - to prevent his escape. They know the gunmen's identity but not his relationship with the victims, who were all Lake Cargelligo locals. The suspect's name has not been released. Heavily armed tactical police were sent in from other areas, as officers urged the public to avoid the town and for local residents to stay inside. \n                  Surfer 'lucky to survive' Sydney's fourth shark attack in three days\n                 \n                  Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting\n                 \n                  Boy, 12, and man critically hurt in Sydney after three shark attacks in two days\n                 Read more from Sky News:The penny dropped over Trump's Greenland plansWhy Antarctica's underwater tsunamis alarm scientists Local state parliament politician Roy Butler also told the Australian Broadcasting Corporation that the shooting was \"tragic news\" for the town. \"It's a terrible situation, and it's still live, so we don't have much information. My thoughts are with the victims and their families,\" he added. The shootings came as Australia marked a national day of mourning for the victims of the Bondi Beach attack last December, where 15 people were killed during a Hanukkah celebration in Sydney. Prime Minister Anthony Albanese posted on X that a minute's silence would take place on Thursday, and added: \"This is a day of remembrance. And a day of unity. Because light will always be stronger than hate.\" Earlier this week, Australian politicians fast tracked reforms to toughen gun control and hate crime laws, voting for a national gun buyback scheme, tighter background checks for firearms licences and tougher penalties for those spreading hate."
    },
    {
        "title": "Several missing after New Zealand campsite landslide - with no sign of life detected for hours, official says",
        "description": "Rescue efforts are under way to free people buried under rubble after landslides hit a campsite and house in New Zealand.",
        "url": "https://news.sky.com/story/several-missing-after-new-zealand-campsite-landslide-with-no-sign-of-life-detected-for-hours-official-says-13497417",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mount-maunganui-new-zealand_7142152.jpg?20260122063741",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-22 06:33:00",
        "Headline": "Police Superintendent Tim Anderson said the number of people missing was in the \"single figures\" but did not provide further details on how many were affected by the slide at the base of the popular tourist spot of Mount Maunganui.",
        "Content": "Rescue efforts are under way to free people buried under rubble after landslides hit a campsite and house in New Zealand. They were triggered by heavy rains across the east of the North Island that cut power to thousands of homes, closed roads and caused widespread damage. Emergency services were called around 9.30am on Thursday (9.30pm Wednesday UK time) to the base of Mount Maunganui, a popular tourist spot in the Bay of Plenty. The rubble hit Beachside Holiday Park in a town named after the extinct volcano - a sacred Maori site - leaving caravans strewn and damaged. Police Superintendent Tim Anderson said the number of people missing was in the \"single figures\" but did not further say how many were affected. Local media reports said children were among the missing, citing emergency management minister Mark Mitchell. Police said two people were missing after another landslide struck a house in nearby Papamoa. \n                  New Zealand 'suitcase murders': Woman jailed for life for killing her two children\n                 \n                  Mother guilty of murdering her children and keeping remains in Auckland storage unit\n                 \n                  New photos show bush campsite where fugitive hid with his children before being shot dead by police\n                 A third person was said to be missing after a vehicle was washed away north of Auckland. 'Voices heard' Three hours after the slide, Fire and Emergency New Zealand commander William Pike said that no survivors had been recovered at Mount Maunganui. \"Members of the public... tried to get into the rubble and did hear some voices,\" Mr Pike told reporters. \"Our initial fire crew arrived and… were able to hear the same. \"Shortly after our initial crew arrived, we withdrew everyone from the site due to possible movement and slip.\" He added that no sign of life had been detected since. Read more from Sky News:Tunbridge Wells's water fight is anything but funAlmost certain UK will ban social media for children Prime Minister Christopher Luxon urged residents in affected areas to follow safety advice from local authorities. \"Extreme weather continues to cause dangerous conditions across the North Island,\" he said on social media. \"Right now, the government is doing everything we can to support those impacted.\" Bay of Plenty tourism website describes Mount Maunganui as a must-visit destination on any trip to New Zealand, with \"the country's best beach\", which is popular for swimming, walking and other watersports."
    },
    {
        "title": "Trump under fire for claiming NATO allies avoided Afghanistan frontline",
        "description": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan.",
        "url": "https://news.sky.com/story/trump-under-fire-for-claiming-nato-allies-avoided-afghanistan-frontline-13497843",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afghanistan-british_7143138.jpg?20260122232937",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:31:00",
        "Headline": "In an interview with Fox News, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". America is the only country to have invoked the alliance's collective defence provision.",
        "Content": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan. In an interview with Fox News in Davos, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". He added: \"We've never needed them. \"They'll say they sent some troops to Afghanistan … and they did, they stayed a little back, a little off the front lines.\" Sky News US correspondent David Blevins said the comments would be deemed \"grossly offensive\" by allies who fought alongside the US. America is the only NATO member to have invoked the collective security provisions of its Article 5 clause - that an attack against one member is an attack on all. That came after the 9/11 terror attacks of 2001, which led to a US-led invasion of Afghanistan. The UK suffered the second-highest number of military deaths in the Afghanistan conflict at 457. The US saw 2,461 deaths. America's allies suffered 1,160 deaths during the conflict - around a third of the total coalition deaths. 'We have always been there' Dame Emily Thornberry MP, chair of the Commons Foreign Affairs Select Committee, said Mr Trump's comments were \"an insult\" to the families of those who died and \"so much more than a mistake\". Speaking on the BBC's Question Time, Dame Emily said: \"How dare he say we weren't on the frontline, how dare he. \"We have always been there whenever the Americans have wanted us, we have always been there.\" In a social media post, Liberal Democrat leader Sir Ed Davey MP said: \"Trump avoided military service five times. \"How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.\" Trump's words 'a disservice' to troops Tory MP Ben Obese-Jecty, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". He said: \"I saw first hand the sacrifices made by British soldiers I served alongside in Sangin where we suffered horrific casualties, as did the US Marines the following year. \"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\" Read more from Sky News:Trump promises Greenland 'deal' will be 'amazing' for USIs president's peace board a new UN or a gang of friends? Last year, US vice president JD Vance hit back at claims of \"disrespecting\" British troops who served in Iraq and Afghanistan, after suggesting a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". At the time, only the UK and France had pledged troops to a potential peacekeeping force."
    },
    {
        "title": "ICE officers snatch five-year-old from car and use him as 'bait' to lure dad, school claims",
        "description": "US Immigration and Customs Enforcement (ICE) officers have detained a five-year-old boy - after using him as \"bait\" to capture his father, officials claim.",
        "url": "https://news.sky.com/story/ice-officers-detain-five-year-old-after-using-him-as-bait-to-capture-dad-school-claims-13497748",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ice-usa_7142986.jpg?20260122190237",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-22 17:45:00",
        "Headline": "Liam Conejo Ramos was told to knock on the door and lure his dad out, officials claim. The pair are now in a holding facility in Texas.",
        "Content": "US Immigration and Customs Enforcement (ICE) officers have detained a five-year-old boy - after using him as \"bait\" to capture his father, officials claim. The pair have since been flown more than 1,000 miles from their home in Minneapolis to a facility in Texas. It makes him the fourth school student to be detained by the controversial immigration force in recent weeks - amidst a crackdown on the city led by US President Donald Trump. Agents snatched the boy, Liam Conejo Ramos, from a running car on Tuesday, a local school leader claimed. The child was then sent to knock on a house to lure his dad, Adrian Alexander Conejo Arias, outside, Columbia Heights Public Schools Superintendent Zena Stenvik added. She said the immigration force was \"essentially using a five-year-old as bait,\" in a press conference on Wednesday. \"Why detain a five-year-old?\" she asked. \n                  Trump under fire for claiming NATO allies avoided Afghanistan frontline\n                 \n                  Zelenskyy lashes out at Europe ahead of first trilateral peace talks\n                 \n                  Zelenskyy drops brutal truth bombs upon European allies\n                 \"You cannot tell me that this child is going to be classified as a violent criminal.\" The White House has struck a different tone, however. Department of Homeland Security spokesperson Tricia McLaughlin said in a statement that \"ICE did NOT target a child\". She insisted the force had come to arrest Conejo Arias, an Ecuadorian national, before he fled on foot \"abandoning his child\". \"For the child's safety,\" McLaughlin said, \"one of our ICE officers remained with the child while the other officers apprehended Conejo Arias\". She added that parents are given the choice to be removed with their children or have them placed with a person of their choosing. Stenvik said the family has an active asylum case and has not been ordered to leave the country. Read more from Sky News:Trump leaves Davos after Greenland U-turn She insisted that there was another adult present when the pair were taken, but the agents would not let Liam be left with him. They are now in a family holding cell in Texas, Marc Prokosch, the family's lawyer, claimed. \"Every step of their immigration process has been doing what they've been asked to do,\" Prokosch said of the family's asylum claim. \"So this is just cruelty.\" Since Donald Trump ramped up the presence of ICE officers in Minneapolis, two 17-year-olds and a 10-year-old have also been taken. Stenvik said attendances in schools had plummeted in recent weeks - with some classes down by two thirds. Ella Sullivan, Liam's teacher, described Liam as \"kind and loving\". \"His classmates miss him,\" she said. \"And all I want is for him to be safe and back here.\" It also comes just weeks after an ICE agent shot and killed Minneapolis resident Renee Good."
    },
    {
        "title": "Why Trump has insisted the US 'needs' Greenland",
        "description": "Donald &#8204;Trump has started the year by persistently highlighting his ambitions to own Greenland, insisting it is necessary for national security. ",
        "url": "https://news.sky.com/story/why-trump-has-insisted-the-us-needs-greenland-13285350",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-jr-greenland_6794227.jpg?20250108104747",
        "type": "US",
        "Author": "Jake Levison and Lauren Russell, news reporters",
        "Date Published": "2026-01-22 22:00:00",
        "Headline": "The US president has claimed he wants to annex Greenland for the sake of national security - but experts suggest he has ulterior motives. ",
        "Content": "By Jake Levison and Lauren Russell, news reporters  Donald ‌Trump has started the year by persistently highlighting his ambitions to own Greenland, insisting it is necessary for national security.  Greenland, Denmark and the other European nations that are part of NATO, the alliance of 32 North American and European countries, pushed against his plans. The US president subsequently began making implicit threats of military action, saying he couldn't rule it out. He then threatened some European nations - including the UK - with new tariffs if he was blocked from purchasing Greenland. In a shock move on 21 January, while in Davos for the World Economic Forum, Mr Trump U-turned on his threats, saying he'd had a \"very productive\" meeting with NATO chief Mark Rutte in which they had formed the framework of a future deal with regard to Greenland and the \"entire Arctic region\", and the \"solution\" will be great for the US and all NATO countries. The details of the supposed framework have not been revealed by Mr Trump or Mr Rutte, while NATO said matters of Greenland's sovereignty weren't discussed in the meeting at all. But why has Mr Trump insisted that the US needs Greenland? Trump says US 'needs' Greenland for national security Greenland, which is northeast of Canada, is a semi-autonomous territory of Denmark. Straddling the Arctic Circle between the US, Russia and Europe, the island of just 57,000 people offers a unique geopolitical advantage that America has eyed for more than 150 years. The idea of taking Greenland is not a new one for Mr Trump, either, who raised the possibility during his first term when he said he had considered purchasing it. But he has since reiterated the benefits it could have for America's national security and has strengthened his rhetoric. He has said it is \"very important for the national security of the United States, Europe, and other parts of the free world\". The shortest distance between Russia and the US tracks over Greenland, making its location a critical site for the US ballistic missile defence system. Greenland is also already home to a large US military base, called the Pituffik Space Base. Another US concern is in the sea - specifically the Northern Sea Route (NSR) and Northwest Passage (NWP) - according to Sky News' military analyst Sean Bell. He says global warming is melting Greenland's ice sheet and opening up new trade routes that have historically been frozen and impassable for most of the year. It means that new, cheaper routes for shipping goods from Europe to Japan are opening around Greenland. \"Ensuring freedom of passage on these new trade routes is a US security concern,\" Bell says. Is there really a national security threat in Greenland? Mr Trump has suggested there are immediate threats to the US and NATO countries in Greenland. He previously mocked local efforts to defend the sparsely populated island, saying \"they added one more dog sled\" that would be no match for the \"Russian and Chinese ships\" he claimed were \"all over the place\" around the territory. Peter Viggo Jakobsen, an associate professor at the Royal Danish Defence College, is among experts who have rubbished Mr Trump's claims that Russian and Chinese ships are posing a threat around Greenland. \"There is no acute problem to solve - the Chinese and Russian ships that he keeps talking about are a figment of his imagination,\" Dr Jakobsen told Sky News. \"There is no security threat to Greenland,\" he added, explaining that China does not operate warships and submarines in the Arctic and that while Russia may operate the odd submarine near Greenland on occasion, \"that is it\". In fact, he says, there is currently no external threat to Greenland \"save the US one\". The US military already has de facto military control of Greenland, as it has since the Second World War. \"The existing base agreement with Greenland and Denmark gives the US permission to expand their military presence in Greenland and establish new bases if they perceive it as necessary,\" he says. Read more:The reality behind Trump's Greenland 'deal'This crisis is far from over for NATO He says Mr Trump would only have to \"consult and inform\" Nuuk and Copenhagen to strengthen the US military in Greenland, yet he has not done so. Dr Jakobsen says this suggests that the US president's annexation goals have nothing to do with national security. Rich in natural resources Greenland holds rich deposits of various natural resources. Locked inside the island's ice are valuable rare earth minerals needed for telecommunications, as well as uranium, billions of untapped barrels of oil and a vast supply of natural gas that used to be inaccessible but is becoming less so. Many of the same minerals are currently mostly supplied by China, so countries including the US are interested in tapping into available resources closer to home. Dr Jakobsen says Mr Trump wants full control over Greenland's resources and that this is the purpose of his annexation goals. He says there is a \"clear parallel\" between this and the Trump administration's attack on Venezuela, when the US targeted its capital and captured President Nicolas Maduro. Mr Trump has been unambiguous in comments suggesting that Venezuela's huge oil reserves were a motivation for the removal of Maduro. \"If Venezuela was not so rich on oil, Trump probably would not have launched the attack,\" says Dr Jakobsen. Mr Trump has denied that resources are a factor in his aim of running Greenland, saying his sole concern is national security."
    },
    {
        "title": "Is Trump's peace board a new UN or a gang of friends?",
        "description": "When it was announced, four months ago, the idea of a Board of Peace seemed wholly entwined with the future of Gaza.",
        "url": "https://news.sky.com/story/is-trumps-peace-board-a-new-un-or-a-gang-of-friends-13497816",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-board-of-peace_7142376.jpg?20260122102742",
        "type": "US",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-22 21:07:00",
        "Headline": "No subtitle found",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n When it was announced, four months ago, the idea of a Board of Peace seemed wholly entwined with the future of Gaza. Since then, things have changed. Now, the board has taken on a more expansive view. Perhaps it was always planned like that, but in Davos its ambitions became more overt, its scope much wider and its pace more pressing. The message: yes, Gaza, but also yes, everything else. On Gaza, the tentacles of the Trump peace plan are certainly spreading. As the board members gathered for the first time, Jared Kushner, the son-in-law who doubles as Trump's roving deal-making diplomat, delivered a short PowerPoint presentation that showed his vision for how Gaza could be redesigned and rethought as a paradise of free market economics. His message was quite evident - that Gaza should not be considered as a warzone, but as an investment opportunity, and a chance for a new economic model. Instead of allowing people to live lives bankrolled by aid, he said, the world should create a Gaza that was fuelled by investment and entrepreneurship. The ambition appeared enormous, and it also seemed like a crashing contrast with the reality of vast numbers of people sleeping in torn tents amid piles of rubble that will take years to clear. It's one thing to talk about a sweeping revival, and another thing to deliver it. So is it cynical to suggest that a creation born out of a war in the Middle East should now be seen as a challenger to the United Nations? Honestly, probably not. Has anyone ever scored a point by underestimating the ambition of the American president? For one thing, the UN is hardly the most popular organisation in the world. Despite its aspirations and humanitarian credentials, it has found itself with an endless list of critics who accuse the UN of everything from institutionalised bias to wholesale corruption. Israel which, in particular, regards it with contempt, this week started work to demolish the Jerusalem headquarters of UNRWA, a UN agency founded to support Palestinian refugees that Israel has repeatedly accused of enabling Hamas. The UN, in turn, has rejected those criticisms and described the demolition as \"an unprecedented attack\". Israel will join this new board. More than one Israeli official has said to me that they would much rather deal with the White House than the UN, however capricious the American administration may be. Of course, there are countless others around the world who would ride to the UN's defence. But even the organisation's own leader admits that it is struggling to maintain its preeminent position in global diplomacy. The Board of Peace won't usurp the UN any time soon. In fact, there's a very good chance it will never do any such thing, particularly if it continues to be treated with scorn by Europe. Read more:Who's on Trump's Board of Peace - and who said noIs a new world 'without rules' emerging? But it is a challenge, and a symbol of how the world order is changing before our eyes. America, for so long the self-proclaimed leader and policeman of the free world, is now setting up its own gang. For the moment, the Board of Peace is largely reserved for Trump's friends, and those who want to be his friend. He is, after all, chairman for life, and he also has the right to nominate his successor. Quite what might happen if America were to elect a Democrat president in 2028 is anyone's guess. But if Russia were to join the board now, or India, or China, or all of them, then the dynamic would change. Suddenly this board might have immense gravitational pull and power, like a masonic lodge with nuclear weapons. We live in a time of unprecedented diplomacy and unpredictable outcomes. And for many, that is uncomfortable."
    },
    {
        "title": "Man accused of rape answered Barron Trump video call during altercation, court hears",
        "description": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard.",
        "url": "https://news.sky.com/story/man-accused-of-rape-answered-barron-trump-video-call-during-altercation-court-hears-13497804",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-barron-trump_7143060.jpg?20260122210546",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-22 20:12:00",
        "Headline": "The son of US President Donald Trump  ended up calling UK police from across the Atlantic after the exchange.",
        "Content": "A man accused of raping a woman answered a video call from the US president's son Barron Trump during an altercation, a court has heard. Donald Trump's son called his female friend only for Matvei Rumiantsev, 22, to answer instead. He pointed the camera at Mr Trump's female friend - who was \"hysterical crying, screaming, shouting\", Snaresbrook Crown Court heard on Thursday. The exchange prompted Mr Trump - who was in the US - to call British police and alert them. Rumiantsev now stands trial accused of assault and two counts of rape, among other charges, against the alleged victim. Jurors heard Rumiantsev and the woman had been drinking together on the evening of 17 January last year and into the early hours of the next day. Giving evidence on Thursday, the defendant told jurors that before he answered a call from the US president's son on the alleged victim's phone, the woman had been \"in a stage of complete breakdown\", partly because she had been drinking. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post  \"She was just completely hysterical crying, screaming, shouting at me,\" he added. \"I noticed her phone next to me on the sofa and it was ringing with a Barron Trump face call. \"I don't know what went through my head but I answered yes. \"At that point I was standing up, I stepped away from her maybe for a couple metres… I answered the call and I immediately put the camera towards her. \"I don't know why I did that. \"Maybe I thought she would realise that her behaviour was unreasonable, that she wouldn't behave like this in front of someone else.\" Prosecutors allege Rumiantsev strangled the woman that evening. He was arrested on the morning of 18 January 2025 and taken into custody. In a transcript of the call he made to the emergency services, Mr Trump said: \"Oh I'm calling from the US, uh, I just got a call from a girl, you know, she's getting beat up.\" Mr Trump replied to investigating police in May in an email which said \"what I saw was very brief indeed but indeed prevalent\", the court heard. \"I didn't expect her to pick up due to the difference in the time zone to the fact I am in the USA, the phone was answered but not by her, to my dismay,\" the email continued. \"The individual who picked up the phone was a shirtless man with darkish hair, although I didn't get a good look, this view lasted maybe one second and I was racing with adrenaline. \"The camera was then flipped to the victim getting hit while crying, stating something in Russian. The guy had hung up. This whole interaction had lasted five to seven seconds.\" Rumiantsev, who is Russian, had been working as a receptionist at the time. He stands accused of one count of rape between 17 and 18 January 2025 and another count between 1 and 30 November 2024. He said he has experience in freestyle wrestling and accepted the alleged victim is a lot smaller than him but denied ever strangling, hitting or kicking her. He insisted he had only grabbed the woman's arms on 18 January to prevent her from hitting him. Earlier on Thursday, the court heard Rumiantsev became aware of the alleged victim's friendship with Mr Trump in October 2024. The defendant told the jury that on 3 November 2024, he and the alleged victim had a disagreement. Rumiantsev said: \"I started to explain that I felt upset as well about her talking to Barron Trump. \"I was in no way controlling but I was trying to make her know that if she feels unwell seeing messages I had with girls 10 years ago, she could maybe understand how I felt when she was sat there this moment texting someone else.\" Rumiantsev denies assault, actual bodily harm, intentional strangulation, perverting the course of justice and two counts of rape, in charges dating between 1 November 2024 and 23 January 2025. The trial continues."
    },
    {
        "title": "Trump sues JPMorgan Chase for $5bn in debanking row",
        "description": "Donald Trump has filed a $5bn (&#163;3.7bn) lawsuit against JPMorgan Chase (JPMC),  accusing it of debanking him and his business empire after his first term in the White House ended.",
        "url": "https://news.sky.com/story/trump-sues-jpmorgan-chase-for-5bn-in-debanking-row-13497774",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-davos_7142124.jpg?20260122034907",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2026-01-22 18:38:00",
        "Headline": "The lawsuit claims personal and business accounts were abruptly closed by the bank after Mr Trump left office in 2021 in the wake of the Capitol riots.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has filed a $5bn (£3.7bn) lawsuit against JPMorgan Chase (JPMC),  accusing it of debanking him and his business empire after his first term in the White House ended. The US president claims America's largest bank by assets and its chief executive Jamie Dimon closed a number of personal and business accounts in February 2021, with 60 days' notice, for political reasons. The bank has denied this was the case. Money latest: Is era of high savings rates over?  Mr Trump argues that he and his business interests were cut off from millions of dollars and suffered disruption as they scrambled to open bank accounts elsewhere. According to Fox Business, the companies allegedly affected were a number of his interests in the hospitality sector. The lawsuit, filed in Miami-Dade County court in Florida, relates to the time of the handover of power to Joe Biden following the 2020 election result that Mr Trump maintained had been rigged. The disputed election culminated in the so-called Capitol riot of 6 January. \"JPMC debanked [Trump and his businesses] because it believed that the political tide at the moment favored doing so,\" the lawsuit claims. In a statement, JPMorgan said it regretted the fact that Mr Trump had brought the action but a spokesperson added: \"We believe the suit has no merit. \"JPMC does not close accounts for political or religious reasons. We do close accounts because they create legal or regulatory risk for the company.\" Read more:Donald Trump and his long history of lawsuitsWhat does Trump accuse the BBC of doing? The debanking case has echoes of a separate row in the UK between the Reform UK leader Nigel Farage and NatWest in 2023 over the closure of his accounts at Coutts, owned by the bank. A settlement was agreed almost two years later, averting planned civil action by Mr Farage. Mr Trump has also brought a $10bn defamation case, again in Florida, against the BBC over the broadcaster's editing of a speech he made on the day of the Capitol protests."
    },
    {
        "title": "The reality behind Trump's Greenland 'deal'",
        "description": "European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours.",
        "url": "https://news.sky.com/story/the-truth-behind-trumps-greenland-deal-13497401",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-nato-denmark_7142105.png?20260122011635",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2026-01-22 02:31:00",
        "Headline": "Donald Trump's team will act like he has achieved something with an apparent \"framework of a deal\" on Greenland. But be in no doubt, that's nonsense - and the US president has inflicted serious damage to the trans-Atlantic alliance.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n European governments and their diplomats here in Washington are as relieved as they are exasperated by this extraordinary Greenland show and latest act which played out in the Swiss Alps over the past 24 hours. There is no \"framework of a deal\". Not yet. Donald Trump may claim there is, but that's only because he needed a way to back down from his threats when he realised that he wasn't going to be able to own Greenland. Trump to roll out 'Board of Peace' at Davos - live updates \"Is this just Trump's off-ramp? No actual framework of a deal yet?\" I asked one diplomat at the heart of it all. The response: \"Exactly.\" Through the \"Trump whisperer\", NATO secretary general Mark Rutte, the Danish and Greenlander positions have essentially been reiterated to the American president. During a face-to-face meeting in Davos, pre-existing commitments in the 1951 US-Denmark treaty were reemphasised and European nations re-committed to increase their own defence of Greenland. When they did precisely this last week, by literally sending senior military officials to Greenland, Trump interpreted it as a provocation against him and issued the tariff threat. \"I'm so bored of this now…\" one European ambassador told me over the weekend, such is the level of weariness over the American president's antics. Read more from Sky News:This crisis is far from over for NATO A trio of U-turns The day in Davos was dizzying even by Trump's standards. He first U-turned on the implicit threat of military action, then he U-turned on the tariff threat, and then he U-turned on the insistence that he take sovereignty of Greenland. All in the space of a day. The penny had dropped in his head, it seems. He realised his Greenland ownership plans were more than just unpopular at home (among his own side too). They were seen as self-defeating, undeliverable and frankly mad. An emergency EU leaders summit is set to go ahead today despite Trump's U-turn on Greenland and imposing tariffs. The US president has claimed everyone is \"very happy\" after claiming a deal is in the works over the future of the Arctic territory. Speaking at the World Economic Forum on Wednesday, Trump also scrapped a threat to impose tariffs on European allies, including the UK, over their opposition to his proposed takeover following a meeting with NATO chief Mark Rutte. Posting on Truth Social, Trump said the framework of a future deal also spanned the \"entire Arctic region\", adding the \"solution\" will be great for the US and all NATO countries. He said he had spoken with other European leaders about it, but nothing had yet been signed and details have not been forthcoming. Trump also declared the US \"won't use force\" to take Greenland. It came after the US president's threats to take Greenland prompted a furious response from leaders on the continent and in London, with Sir Keir Starmer refusing to bow to pressure. Starmer will host the Danish PM in Downing Street later. He arrived in Davos to a wave of opposition. For once, Europe was united and firm. It can be incredibly effective when it's both of those things together. Of course, Team Trump will spin this as another blinding example of the president's \"art of the deal\" playing out; like they achieved something. But be in no doubt, that's nonsense. It's half show, half ineptitude, which is deeply damaging to the trans-Atlantic partnership. America under Trump is less reliable by the day. And the damage is lasting. Where are we now - and what next? On Greenland, we are now back at the position we were in last week when the Danish and Greenland foreign ministers met Trump's team. They agreed then to form a \"working group\" to seek a middle ground which addressed Trump's security concerns while not handing over Greenland's sovereignty. All that Trump really did today was to agree on the American participants in that working group. So where next? Both sides will look for a middle ground that doesn't hand over Greenland to America. There is plenty of space for ideas and creative thinking - there always was if only the American president was willing to listen. It's likely that the middle ground will involve some sort of arrangement similar to the UK military bases in Cyprus. New US military bases would be established in uninhabited parts of Greenland on a lease or sale deal. They would become American territory, but sovereignty of Greenland would remain unchanged."
    },
    {
        "title": "Trump's Greenland climbdown: Don't let it fool you, this crisis is far from over for NATO",
        "description": "Donald Trump's grandstanding on Greenland betrays a disdain for NATO that means this crisis for the alliance is far from over despite his sudden climbdown.",
        "url": "https://news.sky.com/story/trumps-greenland-climbdown-dont-let-it-fool-you-this-crisis-is-far-from-over-for-nato-13497397",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-davos_7142097.jpg?20260122000237",
        "type": "US",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-22 00:16:00",
        "Headline": "Whether a deal is done or not, Donald Trump's willingness to publicly humiliate and bully traditional allies should be a huge wake-up call. At best, they've just been bought some more time.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Donald Trump's grandstanding on Greenland betrays a disdain for NATO that means this crisis for the alliance is far from over despite his sudden climbdown. Governments in London, Paris, Berlin, and Copenhagen may well be breathing a sigh of relief that a historic rupture with Washington over the Arctic territory - which is part of the Kingdom of Denmark, a fellow NATO member - appears to have been averted for now. Trump's climbdown as it happened But the ease at which the president felt he could publicly humiliate and bully them in the pursuit of his own interests is surely the loudest wake-up call yet for the UK, European allies and Canada to rebuild their own defences instead of overly relying on the US. In a head-spinning flip, Trump on Wednesday went from threatening hostile action against those who defied his hopes for an Arctic land grab, to posting a harmonious message on social media about forming \"the framework of a future deal\" on the territory. Read more from Sky News:Key points from Trump's Davos speech The 'Daddy' strategy The shift followed a meeting with Mark Rutte, the head of NATO, on the sidelines of a major economic forum in Davos. Rutte, a former prime minister of the Netherlands who knows the American commander in chief well, grabbed headlines last year because of his fawning language when talking to Trump, even referring to him as \"daddy\" - a label the US leader seemed to like. However, this strategic sycophancy - despite being cringey - appears to be paying off. The secretary general kept Trump onside at a NATO summit last June even though the US president has long criticised his allies for freeloading off American security instead of investing sufficient money in their own armed forces - a fair challenge. Rutte now appears to have helped navigate some kind of compromise on the US presence in Greenland, though he has no legal authority to negotiate the fate of the territory. An emergency EU leaders summit is set to go ahead today despite Trump's U-turn on Greenland and imposing tariffs. The US president has claimed everyone is \"very happy\" after claiming a deal is in the works over the future of the Arctic territory. Speaking at the World Economic Forum on Wednesday, Trump also scrapped a threat to impose tariffs on European allies, including the UK, over their opposition to his proposed takeover following a meeting with NATO chief Mark Rutte. Posting on Truth Social, Trump said the framework of a future deal also spanned the \"entire Arctic region\", adding the \"solution\" will be great for the US and all NATO countries. He said he had spoken with other European leaders about it, but nothing had yet been signed and details have not been forthcoming. Trump also declared the US \"won't use force\" to take Greenland. It came after the US president's threats to take Greenland prompted a furious response from leaders on the continent and in London, with Sir Keir Starmer refusing to bow to pressure. Starmer will host the Danish PM in Downing Street later. The deal is unclear… After the Davos meeting, Trump posted on his Truth Social site that he and the NATO boss \"have formed the framework of a future deal with respect to Greenland and, in fact, the entire Arctic region. His solution, if consummated, will be a great one for the United States of America and all NATO nations\". He then scrapped a threat to hit the UK and seven other allies with tariffs from next month. The finer details of the Greenland plan, which may or may not be accepted by Greenlanders and Denmark, is not yet clear. …the damage done is not What is in no doubt, though, is the damage that this rift has already caused to NATO cohesion, prompting many European nations, even the typically uber-loyal UK, to use increasingly strident language when pushing back against Trump's demands. Tough words are one thing, but for Britain and the rest of Europe to stand a chance of being able to ensure their collective and national interests are protected, going forward, they will need to stop talking about rebuilding their military capabilities and start urgently acting. Rutte's flattering diplomacy will at best be buying a bit more time for these countries to - in Trump's own words - \"step up\" and defend themselves. Such a move will not only make NATO stronger to counter external threats, such as from Russia and China. It will also cushion allies from whenever Trump next decides to turn on them."
    },
    {
        "title": "Oscar nominations: The biggest snubs and surprises",
        "description": "While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow.",
        "url": "https://news.sky.com/story/the-biggest-snubs-and-surprises-of-this-years-oscar-nominations-13497715",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wicked-for-good-awards-season_7127357.jpg?20260105164713",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2026-01-22 17:36:00",
        "Headline": "As Sinners stars celebrate, Paul Mescal, Ariana Grande and Cynthia Erivo have been left crying into their popcorn. Here are some of the movies and stars that failed to make the cut.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow. Wicked: For Good may have done fairly swift business at the box office, but that simply did not translate into Oscar votes. Read more: Oscar nominations 2026 as it happened After the first instalment of the movie got 10 nods last year, the second part did not receive a single nomination. While its two stars - Cynthia Erivo and Ariana Grande - failed to make it into the best actress and best supporting actress categories, the biggest blow will be missing out on the coveted best picture category. Meanwhile, Paul Mescal was overlooked in the best supporting actor category for his performance as playwright William Shakespeare in the big-screen adaptation of Maggie O'Farrell's award-winning novel Hamnet. While that's the category he campaigned in, some felt he would have been placed in the best actor category, raising the possibility that the Irish star split some of his votes if some people put his name in the latter. Another acting omission was that of Chase Infiniti - breakout star of One Battle After Another, playing the daughter of Leonardo DiCaprio's washed-up revolutionary. Read more: Oscar nominations 2026: The full list After her nomination in the best actress category at the Golden Globes earlier this month, she had been widely expected to appear in the Oscar nominations line-up too. Her four co-stars - Leonardo DiCaprio, Benicio Del Toro, Sean Penn and Teyana Taylor - all made it into the mix. In a tight race, while Infiniti failed to make the best actress cut, Kate Hudson did make it in for her performance in musical drama Song Sung Blue, which was far from guaranteed. A recent publicity event at which she was interviewed by her mother, veteran Hollywood star Goldie Hawn, may well have given her the voter boost she needed to get her over the line. While Mescal and Infiniti missed out, it was a different story for British stars Delroy Lindo, 74, and Wunmi Mosaku, 39, who both got nods for Sinners. RADA-trained British Nigerian actress Mosaku had made her way into the awards conversation in recent days, but Lindo's nod for his portrayal of musician Delta Slim was out of the blue. The London-born actor was critically acclaimed for his performance, but most pundits expected him to be left out in favour of Mescal or Adam Sandler for Jay Kelly. While Norwegian family drama Sentimental Value got an impressive nine nods overall, it got nothing in the new category, best achievement in casting. It's a slightly strange omission, considering it got four nods in the acting categories - Renate Reinsve in best actress in a leading role, both Elle Fanning and Inga Ibsdotter Lilleaas in best supporting actress and Stellan Skarsgard in best supporting actor. And while gothic horror Frankenstein got nine nods - including best picture - Mexican filmmaker Guillermo del Toro missed out in the best director category. Formula One blockbuster F1, starring Damson Idris and Brad Pitt, while expected to do well in the technical categories, also managed to nudge its way into the best picture race. A summer hit, it remains to be seen if it will have the backing to win pole position at this year's Academy Awards in LA on Sunday, 15 March."
    },
    {
        "title": "Trump sues JPMorgan Chase for $5bn in debanking row",
        "description": "Donald Trump has filed a $5bn (&#163;3.7bn) lawsuit against JPMorgan Chase (JPMC),  accusing it of debanking him and his business empire after his first term in the White House ended.",
        "url": "https://news.sky.com/story/trump-sues-jpmorgan-chase-for-5bn-in-debanking-row-13497774",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-davos_7142124.jpg?20260122034907",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-22 18:38:00",
        "Headline": "The lawsuit claims personal and business accounts were abruptly closed by the bank after Mr Trump left office in 2021 in the wake of the Capitol riots.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has filed a $5bn (£3.7bn) lawsuit against JPMorgan Chase (JPMC),  accusing it of debanking him and his business empire after his first term in the White House ended. The US president claims America's largest bank by assets and its chief executive Jamie Dimon closed a number of personal and business accounts in February 2021, with 60 days' notice, for political reasons. The bank has denied this was the case. Money latest: Is era of high savings rates over?  Mr Trump argues that he and his business interests were cut off from millions of dollars and suffered disruption as they scrambled to open bank accounts elsewhere. According to Fox Business, the companies allegedly affected were a number of his interests in the hospitality sector. The lawsuit, filed in Miami-Dade County court in Florida, relates to the time of the handover of power to Joe Biden following the 2020 election result that Mr Trump maintained had been rigged. The disputed election culminated in the so-called Capitol riot of 6 January. \"JPMC debanked [Trump and his businesses] because it believed that the political tide at the moment favored doing so,\" the lawsuit claims. In a statement, JPMorgan said it regretted the fact that Mr Trump had brought the action but a spokesperson added: \"We believe the suit has no merit. \"JPMC does not close accounts for political or religious reasons. We do close accounts because they create legal or regulatory risk for the company.\" Read more:Donald Trump and his long history of lawsuitsWhat does Trump accuse the BBC of doing? The debanking case has echoes of a separate row in the UK between the Reform UK leader Nigel Farage and NatWest in 2023 over the closure of his accounts at Coutts, owned by the bank. A settlement was agreed almost two years later, averting planned civil action by Mr Farage. Mr Trump has also brought a $10bn defamation case, again in Florida, against the BBC over the broadcaster's editing of a speech he made on the day of the Capitol protests."
    },
    {
        "title": "HSBC chair Nelson among bosses joining Starmer on China visit",
        "description": "Brendan Nelson, the new chairman of HSBC Holdings, will be among the business leaders who travel to China with Sir Keir Starmer next week as the prime minister tries to reset Britain's relationship with Beijing.",
        "url": "https://news.sky.com/story/hsbc-chair-nelson-among-bosses-joining-starmer-on-china-visit-13497533",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-xi-jinping-keir-starmer_6751051.jpg?20241118120929",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-22 10:55:00",
        "Headline": "Brendan Nelson, who became permanent chair of the banking giant last month, will be part of the business delegation which travels to Beijing with the prime minister next week, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Brendan Nelson, the new chairman of HSBC Holdings, will be among the business leaders who travel to China with Sir Keir Starmer next week as the prime minister tries to reset Britain's relationship with Beijing. Sky News has learnt that Mr Nelson, who only took over as the bank's permanent chair last month, will be part of Sir Keir's business delegation, alongside executives from companies expected to include London Stock Exchange Group, Prudential and Rolls-Royce. Money blog: Diners shocked at price of single McDonald's hash brown The visit will be the first by a British premier since 2018, when Theresa May took a business delegation to China. One private sector source said the short notice involved in arranging the trip meant a number of companies were likely to send executives other than their CEOs with the PM. Reuters reported this week that a revamped UK-China CEO Council was likely to be unveiled next week, with representatives from companies including AstraZeneca, BP and Jaguar Land Rover expected to participate. The go-ahead for Sir Keir's visit came after the government this week approved plans for a new Chinese embassy in London - a decision which has been mired in controversy over perceived security risks. \n                  Government warned of 'potentially catastrophic' legal challenge over Chinese embassy\n                 \n                  'Don't bow to China': Protesters march against Chinese 'mega embassy' in London\n                 \n                  Judicial review to be launched after China's 'super embassy' in London approved\n                 Business leaders have joined prime ministers on a string of previous visits to Beijing, including during the premiership of David Cameron, who hailed a 'golden era' of relations between the two countries. The relationship has cooled significantly in recent times amid geopolitical stresses, and there remain doubts over whether other bilateral economic forums between Britain and China - including the Economic and Financial Dialogue - will take place as scheduled this year. \"We had the golden age, which then flipped to an ice age,\" Sir Keir said in a speech last month. \"We reject that binary choice,\" he said, adding that China was a \"nation of immense scale, ambition and ingenuity\" and \"a defining force in technology, in trade and global governance\". None of the companies contacted by Sky News would comment."
    },
    {
        "title": "Ovo to compensate vulnerable customers 'left without support'",
        "description": "One of the UK's biggest energy providers is to compensate more than 11,000  customers, most of them vulnerable, for failing to pay electricity bill discounts on time.",
        "url": "https://news.sky.com/story/ovo-to-compensate-vulnerable-customers-left-without-support-13497485",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-22 09:18:00",
        "Headline": "More than 11,000 impacted customers will receive compensation of at least £150 for late payment of the warm home discount scheme benefit. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n One of the UK's biggest energy providers is to compensate more than 11,000  customers, most of them vulnerable, for failing to pay electricity bill discounts on time. Ovo, the country's fourth largest gas and electricity supplier, was more than 19 months late making the warm home discount payments and so has been ordered by energy regulator Ofgem to pay over £2.7m in redress. Money blog: Diners shocked at price of single McDonald's hash brown The £2,765,200 sum comprises individual compensation payments of at least £150, which will be sent to the 11,646 directly affected customers. All those impacted will receive £150, while 4,066 customers classed as medically vulnerable will get an additional £150. A further £100 will be paid to customers for every time they didn't have enough money to top up their prepayment meter, causing it to run out, between 31 March and 31 May 2024. Of the roughly 11,000 customers impacted by the absence of the government bill discount, 7,726 were classed as vulnerable energy consumers. \n                  Britons are less well off than they were in 2019 - and these figures show it\n                 \n                  Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars\n                 \n                  Were it not for the upcoming budget, interest rates could have been cut\n                 These customers have been contacted, Ofgem said, and do not need to take any further action. They will be compensated automatically, the regulator added. What did Ovo do? Instead of paying the warm home discount by the 31 March 2024 deadline, the customers in question did not receive their rebate until November 2025, Ofgem said. \"The delay meant that some of the most vulnerable customers were left without the support they were entitled to during the coldest winter months,\" it added. The warm home discount applies to electricity bills during winter for low‑income or vulnerable households. It is applied directly to bills. In response, an Ovo spokesperson said, \"We're very sorry that some customers did not receive their Warm Home Discount payments on time. We have worked closely with Ofgem to understand what went wrong and to put measures in place to ensure it does not happen again. \"We did not meet the high standards of service we set for ourselves, and all affected customers have now been compensated.\""
    },
    {
        "title": "ClearScore homes in on mortgage market with Acre deal",
        "description": "One of Britain&#8217;s leading financial technology companies will on Friday announce the acquisition of a mortgage sector tech platform as it further diversifies its revenue base ahead of a public share listing.",
        "url": "https://news.sky.com/story/clearscore-homes-in-on-mortgage-market-with-acre-deal-13497595",
        "image_url": "https://e3.365dm.com/21/06/1920x1080/skynews-justin-basini-chief-executive_5426088.jpg?20210624163357",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-22 13:13:00",
        "Headline": "The company will announce on Friday the acquisition of a mortgage technology platform that will help diversify its revenue base as it prepares for a public market listing, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of Britain’s leading financial technology companies will on Friday announce the acquisition of a mortgage sector tech platform as it further diversifies its revenue base ahead of a public share listing. Sky News has learnt that ClearScore Group has struck a deal to acquire Acre Platforms for an undisclosed sum, a move that will accelerate its push into the mortgage industry. ClearScore, which has evolved from a credit-checking agency business into a broader provider of financial marketplaces, acquired Aro Finance a year ago, strengthening its presence in the provision of secured loans. The purchase of Acre will extend this position in an attempt to tap into ClearScore's 16 million-strong British user base. Money latest: Is era of high savings rates over? It then plans to bring its mortgage platform to customers in Australia, Canada, New Zealand and South Africa. Run by Justin Basini, its co-founder and chief executive, ClearScore's rapid growth has placed it firmly on a path towards a stock market flotation. \n                  Trump sues JPMorgan Chase for $5bn in debanking row\n                 \n                  HSBC chair Nelson among bosses joining Starmer on China visit\n                 \n                  Ovo to compensate vulnerable customers 'left without support'\n                 Mr Basini has urged the government to do more to promote retail investing in the UK in order to make a more compelling case for the company to list in the UK rather than a rival overseas exchange. In response to an enquiry from Sky News, a ClearScore Group spokesperson said: \"Acre is a strategic acquisition for the ClearScore Group, advancing our position in mortgages and building on our expansion into secured loans in 2025. \"Bringing Acre into the Group will power our overall home lending capability, giving ClearScore a complementary technology platform in the mortgage industry that sits alongside our existing global financial marketplaces. \"It will also provide additional data streams, ensuring a richer set of insights for ClearScore users.\" In total, ClearScore has more than 25 million users globally It matches users to credit cards, loans and car finance through the deployment of credit and affordability data."
    },
    {
        "title": "Banking behemoth JP Morgan Nutmegs rivals with purchase of WealthOS",
        "description": "JP Morgan Chase, the US-based banking giant, has swooped to buy a British pensions technology company as it tries to augment its retirement planning services to personal investing clients.",
        "url": "https://news.sky.com/story/banking-behemoth-jp-morgan-nutmegs-rivals-with-purchase-of-wealthos-13497622",
        "image_url": "https://e3.365dm.com/19/01/1920x1080/skynews-nutmeg-asset-management_4553717.jpg?20190122124743",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-22 13:42:00",
        "Headline": "JP Morgan Chase has swooped to buy pensions technology platform WealthOS for an undisclosed sum, according to an internal memo circulated by the American banking giant and seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n JP Morgan Chase, the US-based banking giant, has swooped to buy a British pensions technology company as it tries to augment its retirement planning services to personal investing clients. Sky News has learnt that JP Morgan has agreed to snap up WealthOS, which was founded in 2019. Chaired by former Google executive John Herlihy, WealthOS is a wealth management software business. Money latest: Is era of high savings rates over? The deal was announced internally by JP Morgan Chase's personal investing division - previously called Nutmeg - this week. The price being paid by the American bank was unclear on Thursday. WealthOS has a workforce split between the UK and Sri Lanka, where it has a product and software engineering centre. \n                  Trump sues JPMorgan Chase for $5bn in debanking row\n                 \n                  HSBC chair Nelson among bosses joining Starmer on China visit\n                 \n                  Ovo to compensate vulnerable customers 'left without support'\n                 JP Morgan has made big strides into the UK personal banking and wealth management sector in recent years, launching a digital savings bank under the Chase brand in 2021. It acquired Nutmeg, for which it was reported to have paid about £700m, the same year. Nutmeg, now called JP Morgan Personal Investing, has roughly 275,000 customers in the UK, according to an internal memo announcing the deal, which the firm said would give it \"access to cutting-edge technology and deep sector expertise\". JP Morgan declined to comment."
    },
    {
        "title": "Black Sheep brewery owner set for rescue by rival Saltaire",
        "description": "The brewery group behind brands such as Black Sheep and Fourpure is to be rescued from the brink of collapse by Saltaire Brewery, a Yorkshire-based rival.",
        "url": "https://news.sky.com/story/black-sheep-brewery-owner-set-for-rescue-by-rival-saltaire-13497424",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-black-sheep_6142048.jpg?20230503105738",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-22 06:41:00",
        "Headline": "The future of Keystone Brewing Group, which has been preparing for weeks to appoint administrators, could be salvaged on Thursday by Yorkshire-based Saltaire Brewery, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The brewery group behind brands such as Black Sheep and Fourpure is to be rescued from the brink of collapse by Saltaire Brewery, a Yorkshire-based rival. Sky News has learnt that the future of Keystone Brewing Group, which has filed a series of notices of its intention to appoint administrators in recent weeks, is close to being salvaged in a deal which could take place as early as Thursday. Saltaire is understood to have proposed a deal which would maintain Keystone's workforce, which is thought to number between 150 and 200 people. The transaction is expected to take place through a pre-pack administration, under which insolvency practitioners line up a buyer to acquire a company's assets as soon as it is placed into administration. Sky News revealed in January that Keystone, which has sales and distribution agreements with brands such as Magic Rock and Hofmeister, was close to collapse as it grappled with a toxic cocktail of surging costs and waning consumer confidence. Some of the beers in Keystone stable are among the best-known in Britain, with Black Sheep having been founded in 1992 by a member of the Theakston brewing family. Black Sheep previously fell into administration in 2023, before being rescued by its current owner, Breal - which itself had rescued a number of smaller brewers from collapse in recent years. \n                  Trump sues JPMorgan Chase for $5bn in debanking row\n                 \n                  HSBC chair Nelson among bosses joining Starmer on China visit\n                 \n                  Ovo to compensate vulnerable customers 'left without support'\n                 Keystone is run by industry veteran Steve Cox, who joined the company last year with a brief to hit a £100m annual sales target by 2028. Saltaire is owned by Paramount Retail Group, a conglomerate with interests spanning petfood, confectionery, DIY and home interiors. FRP Advisory, the professional services firm, is handling the preparations for insolvency. A spokesman for FRP declined to comment, while Saltaire's owner, Paramount, has been contacted for comment."
    },
    {
        "title": "Trump under fire for claiming NATO allies avoided Afghanistan frontline",
        "description": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan.",
        "url": "https://news.sky.com/story/trump-under-fire-for-claiming-nato-allies-avoided-afghanistan-frontline-13497843",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-afghanistan-british_7143138.jpg?20260122232937",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 22:31:00",
        "Headline": "In an interview with Fox News, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". America is the only country to have invoked the alliance's collective defence provision.",
        "Content": "Donald Trump has been criticised for claiming NATO troops stayed \"a little off the front lines\" in Afghanistan. In an interview with Fox News in Davos, the US president repeated his criticism of NATO, saying he was not \"sure\" the alliance would \"be there if we ever needed them\". He added: \"We've never needed them. \"They'll say they sent some troops to Afghanistan … and they did, they stayed a little back, a little off the front lines.\" Sky News US correspondent David Blevins said the comments would be deemed \"grossly offensive\" by allies who fought alongside the US. America is the only NATO member to have invoked the collective security provisions of its Article 5 clause - that an attack against one member is an attack on all. That came after the 9/11 terror attacks of 2001, which led to a US-led invasion of Afghanistan. The UK suffered the second-highest number of military deaths in the Afghanistan conflict at 457. The US saw 2,461 deaths. America's allies suffered 1,160 deaths during the conflict - around a third of the total coalition deaths. 'We have always been there' Dame Emily Thornberry MP, chair of the Commons Foreign Affairs Select Committee, said Mr Trump's comments were \"an insult\" to the families of those who died and \"so much more than a mistake\". Speaking on the BBC's Question Time, Dame Emily said: \"How dare he say we weren't on the frontline, how dare he. \"We have always been there whenever the Americans have wanted us, we have always been there.\" In a social media post, Liberal Democrat leader Sir Ed Davey MP said: \"Trump avoided military service five times. \"How dare he question their sacrifice. Farage and all the others still fawning over Trump should be ashamed.\" Trump's words 'a disservice' to troops Tory MP Ben Obese-Jecty, who served in Afghanistan as a captain in the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". He said: \"I saw first hand the sacrifices made by British soldiers I served alongside in Sangin where we suffered horrific casualties, as did the US Marines the following year. \"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\" Read more from Sky News:Trump promises Greenland 'deal' will be 'amazing' for USIs president's peace board a new UN or a gang of friends? Last year, US vice president JD Vance hit back at claims of \"disrespecting\" British troops who served in Iraq and Afghanistan, after suggesting a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". At the time, only the UK and France had pledged troops to a potential peacekeeping force."
    },
    {
        "title": "Is this the end of social media for teenagers? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Tap here to listen to Electoral Dysfunction on your podcast app 👈</a>        ",
        "url": "https://news.sky.com/story/is-this-the-end-of-social-media-for-teenagers-13497764",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 18:10:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Tap here to listen to Electoral Dysfunction on your podcast app 👈  Should social media be banned for under-16s? After a dramatic vote in the House of Lords, Beth, Harriet, and Ruth dig into what a ban would really mean and what impact it would have on young people, and they hear from some of them.  And on the world stage, Donald Trump's threats over Greenland and tariffs have rattled allies and forced an uncomfortable reckoning about the strength of the transatlantic relationship. With Davos dominated by power plays and a hard-hitting speech from Canada's Mark Carney, the trio asks whether the rules-based world order is already breaking, and where that leaves Britain. You can WhatsApp the podcast at 07934 200 444 or email electoraldysfunction@sky.uk. Remember, you can also watch Beth, Harriet, and Ruth on YouTube."
    },
    {
        "title": "Andy Burnham, next PM? The big hurdle facing popular mayor",
        "description": "Could Andy Burnham be on the brink of becoming a member of parliament?",
        "url": "https://news.sky.com/story/andy-burnham-next-pm-the-big-hurdle-facing-popular-mayor-13497844",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-burnham-starmer_7031541.jpg?20250925164026",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2026-01-22 22:56:00",
        "Headline": "Ex-Labour health minister Andrew Gwynne has confirmed he is to step down from parliament. The by-election could pave the way for Andy Burnham to return to Westminster, but reports suggest Sir Keir Starmer's allies want to stop him.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Could Andy Burnham be on the brink of becoming a member of parliament? After former minister Andrew Gwynne stepped down as a Labour MP, his Gorton and Denton constituency has been touted as a potential seat for the mayor of Greater Manchester. Starmer responds to leadership speculation - politics latest Well, he faces a BIG hurdle. There is a new rule - introduced in the 2026 Labour rule book - about mayors wanting to become an MP. It says: \"Directly Elected Mayors and Police and Crime Commissioners must seek the express permission of the NEC/SEC/WEC (as applicable) before seeking nomination as Labour candidates for the Westminster Parliament. \"The NEC/SEC/WEC's decision shall be final.\" Burnham would have to stand down as Manchester mayor, triggering an election for that post - which Labour are not guaranteed to win and will cost hundreds of thousands of pounds. So, these are the grounds that could be used to block Burnham by Labour's National Executive Committee (NEC). I'm told Sir Keir Starmer's chief-of-staff Morgan McSweeney thinks he's got the NEC sewn up to block Burnham. But you never quite know. Read more from Sky News:Zelenskyy lashes out at EuropeSnubs and surprises in Oscar nominations If Burnham is granted permission to apply for the seat, the NEC creates a long and a shortlist. NEC member Cat Arnold told Sky News there must be a \"free and fair selection, at long list and shortlist stage\". \"It would be completely unacceptable to gerrymander or unduly narrow the list of potential candidates,\" she said. Political editor A cabinet minister told me last week about a leadership challenge: \"Changing leader is a bit Tory for me.\" \"If we try to change leader, the party will end up tacking to the left and that's not Labour's problem with the country, so it won't be the solution,\" they said. \"It's probably better to try to work on making Starmer better.\" The long list is done over email, then the shortlisting is done by a panel. The panel has three members of the NEC, one member of the board and a local constituency representative. The panel is chosen by the office of the general secretary, Hollie Ridley, who is close to McSweeney. So it's far from clear Burnham wins this."
    },
    {
        "title": "Police forces to be slashed in sweeping reforms",
        "description": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades.",
        "url": "https://news.sky.com/story/number-of-police-forces-to-be-slashed-in-largest-reform-in-decades-13497814",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shabana-mahmood_7084641.jpg?20251118060407",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 21:02:00",
        "Headline": "Tory opposition warn the plan risks \"undermining efforts to fight crime\".",
        "Content": "The number of police constabularies in the UK is set to be slashed in what is understood to be the largest overhaul of policing in decades. Home Secretary Shabana Mahmood will reveal plans next week for reform that will significantly cut the number of forces down from 43. Critics have long argued the current model is bureaucratic and wastes too much money - and some inside government believe smaller forces are not equipped to deal with serious crimes.   It is understood the reforms would involve merging back-office functions to free up resources to be invested in more police officers. Ministers will also reveal plans for Local Policing Areas - which allow officers to focus on neighbourhood policing. These will be set up across the country to deal with lower level \"local crime\" such as shoplifting and anti-social behaviour. The plans - which the Conservatives say risk \"undermining efforts to fight crime\" - will not come into place until around 2034, insiders have warned. The shift in strategy marks the latest development in ongoing tensions between the police and the home secretary - who last week welcomed plans to allow her to force the resignation of chief constables. Earlier, a government source pointed to Wiltshire Police, which needed support from 40 other forces to respond to the Salisbury poisonings in 2018, as well as vast differences in charge rates for some offences. They said: \"Under this new structure, all forces - regardless of where they are - will have the tools and resources they need to fight serious crime. \"Where you live will no longer determine the outcomes you get from your force.\" It is unclear exactly how many forces will operate under the new framework but an independent review will be announced to look at precise details. Read more from Sky News:Trump sues JPMorgan ChaseBristol man died tying flags to lamp post Similar cuts have been proposed as long as 20 years ago, when then home secretary Charles Clarke suggested cutting the number of forces to 12. But the plans were scrapped by his successor John Reid just four months later after the proposed merger of Lancashire and Cumbria police forces collapsed and senior officers turned against the idea. Allies of Ms Mahmood stressed her commitment to the reforms, but Conservative shadow home secretary Chris Philp said there was \"no evidence\" that merging police forces would cut crime or improve performance. He said: \"Top-down reorganisation risks undermining efforts to fight crime, inevitably leading to centralised control that will hit towns and villages across the country hardest. \"The biggest force, the Met, has the lowest crime solving rates and falling police numbers. Big is not necessarily better.\""
    },
    {
        "title": "How quickly could the UK ban teenagers from social media?",
        "description": "The UK just got much closer to banning under-16s from social media. So, how long could it take for a ban to come into force?",
        "url": "https://news.sky.com/story/how-quickly-could-the-uk-ban-teenagers-from-social-media-13497587",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-media-nicole-johnston_7106650.jpg?20251210150027",
        "type": "Politics",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-22 12:47:00",
        "Headline": "This week's House of Lords decision to back a bar for under-16s on social media platforms, could accelerate the process needed to make it British law.",
        "Content": "\n          Science and technology reporter\n       The UK just got much closer to banning under-16s from social media. So, how long could it take for a ban to come into force? On Thursday night, the House of Lords voted for a social media ban for under-16s added into a piece of legislation called the Children's Wellbeing and Schools Bill. The amendment could drastically speed up the implementation of a social media ban here in the UK. If it is also passed by the House of Commons it will become law. Read more: What UK social media ban on children could look like - as government considers action Without amendment, campaigners would have had to wait for the government to run a nationwide consultation that it announced on Monday. Ministers are not scheduled to respond to that consultation until the summer, so that would already have meant a six-month wait. If the consultation did suggest a ban was necessary, the government says it would offer MPs a chance to vote on a new amendment giving them the power to enact the ban. More time would then have been needed to give tech companies time to prepare. \n                  How woman's 'fairytale' home upgrade turned into a nightmare\n                 \n                  Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban\n                 \n                  Logging off: Kids' social media ban now feels almost certain\n                 By adding an amendment into legislation already going through parliament, Lord Nash, who proposed the amendment, has managed to skip many of those hurdles. That was intentional. \"The longer we delay, the more children we fail,\" the Conservative peer said earlier this week. Read more: Logging off: Kids' social media ban now feels almost certain Now the bill - with its new social media ban amendment - will go back to the House of Commons for MPs to consider and vote on it. One Labour MP told Sky's political reporter Faye Brown there was \"no way\" the government could pressure its MPs to vote against it, claiming a majority are in favour of the ban. The government in Australia faced very similar pressure in the run-up to approving their ban for under-16s on social media, according to Daniel Stone, a fellow with Australia's Centre for Responsible Technology who is currently based in Cambridge. \"From far away, we can think that the Australian government went into this with a really clear intention,\" he told Sky News, \"But the reality is that the process wasn't that dissimilar from what we're seeing playing out here. \"The Australian government had originally resisted acting on it, and then, due to the political circumstance, it became more and more urgent, and they decided that there was an incredible amount of political urgency, and that the community really wanted to see something done, and decided to embrace it.\" As in Australia, once the law passes, tech companies will be given 12 months to prepare to remove their under-16 users and block new ones. Many of them will already have the technology in place to do this. In July, new rules came into force that meant under-18s needed to be blocked from seeing adult and harmful content. Read more: What is AI facial age estimation? The age-verification tools used by many UK companies to comply with those rules is the same tech being used in Australia to block under-16s from social media. There's been a fair amount of criticism of that technology, with Australian teenagers this week telling Sky News they were able to easily bypass it. However, that doesn't necessarily undermine the ban, according to Mr Stone. \"Some kids might attempt to get around this and they'll probably be successful if they do,\" he said. \"The important thing is to make sure that we're establishing a clear social norm, that [social media] is harmful, that a certain amount of care is required and that we should be broadly hesitant about jumping straight into it.\""
    },
    {
        "title": "Asylum seekers moved into Crowborough Army Camp despite local opposition",
        "description": "Asylum seekers have started moving into a military training camp in East Sussex despite opposition from the local council and residents.",
        "url": "https://news.sky.com/story/asylum-seekers-moved-into-crowborough-army-camp-despite-local-opposition-13497510",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-crowborough-army-migrant_7142384.jpg?20260122103753",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 10:12:00",
        "Headline": "Wealden District Council said it is looking at bringing a legal challenge against the Home Office over safety and security concerns.",
        "Content": "Asylum seekers have started moving into a military training camp in East Sussex despite opposition from the local council and residents. A total of 27 single male migrants have been moved into Crowborough Army Camp, the Home Office has announced. It will eventually house more than 500 for up to three months at a time while their asylum claims are processed. The camp was first proposed in October as an alternative to asylum hotels, which the government has pledged to close by the end of this parliament, set for 2029. Since then, there have been regular protests by locals over concerns about safety and security. Conservative shadow home secretary Chris Philp called it \"another day of shame for the Labour government\" as he accused the Home Office of having \"kicked out\" the 6,000 army and RAF cadets who use the site for training every year. Wealden District Council leader James Partridge said he had a meeting with border security and asylum minister Alex Norris on Wednesday evening, when he was told no decision had been made yet. \n                  Trump under fire for claiming NATO allies avoided Afghanistan frontline\n                 \n                  Is this the end of social media for teenagers? \n                 \n                  Andy Burnham, next PM? The big hurdle facing popular mayor\n                 But an hour later, Mr Partridge said he had been informed the army camp will be used, despite the council's \"strong objection\". \"The minister hasn't listened to any of this,\" he said in a social media video. Mr Partridge said the council has asked its legal team to see if they can bring a legal challenge to the Home Office's decision. A crowdfund of residents has already raised £93,000 for a legal challenge, more than the £90,000 target. \"We know this [legal challenge] is a long shot, but we've been probing the Home Office throughout the process to see if we can find a way to bring a successful legal action,\" Mr Partridge added. He said locals need to \"try and find a way to make the best of it, and certainly not make matters worse\". \"We know a lot of people will be angry, frightened and worried,\" he added. He called on residents to \"come together\" like they did to welcome Afghans and Ukrainian refugees, and \"take responsibility for making our community feel safe and secure\". Mr Philp added that illegal immigrants \"pose a threat to local communities up and down the country\". \"We have seen hundreds of crimes committed by illegal immigrants in asylum accommodation, including many rapes, sexual assaults and even murder,\" he said. \"Now the women and children of Crowborough will be exposed to those risks too.\" The Home Office says the Crowborough accommodation has 24-hour security, CCTV and a strict sign-in system for those being housed there. Home Secretary Shabana Mahmood said: \"Illegal migration has been placing immense pressure on communities. \"That is why we are removing the incentives that draw illegal migrants to Britain, closing asylum hotels that are blighting communities. \"Crowborough is just the start.\""
    },
    {
        "title": "Welsh first minister accuses Westminster of treating Wales unfairly",
        "description": "First Minister of Wales Eluned Morgan has issued&#160;a&#160;warning&#160;to Sir Keir&#160;Starmer&#160;that if powers are&#160;not devolved to&#160;the Senedd, Wales will begin a path of nationalism which could threaten the future of the United Kingdom.",
        "url": "https://news.sky.com/story/welsh-first-minister-accuses-westminster-of-treating-wales-unfairly-13497693",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eluned-morgan-labour_7142799.jpg?20260122162920",
        "type": "Politics",
        "Author": "Hannah Woodward, political news editor",
        "Date Published": "2026-01-22 17:14:00",
        "Headline": "According to the latest polling from YouGov, a Plaid Cymru-led government is the most likely outcome at the Senedd elections in May, whereas Labour faces obliteration.",
        "Content": "By Hannah Woodward, political news editor  First Minister of Wales Eluned Morgan has issued a warning to Sir Keir Starmer that if powers are not devolved to the Senedd, Wales will begin a path of nationalism which could threaten the future of the United Kingdom. The Welsh Labour leader argues Wales has been treated differently from the other nations and there is an opportunity to \"correct these historic problems\". In her first significant address ahead of the Senedd elections in May, Ms Morgan called on Wales to be treated the same as Scotland. The first minister said she is seeking devolution of policing, rail, youth justice and probation, along with the transfer of Crown Estate powers. She also called on Chancellor Rachel Reeves to make the Welsh government's full access to its financial reserves permanent. Ms Morgan also wants a Constitutional Reform Act to legally protect devolution. Speaking at an event in London, the First Minister of Wales said: \"In some areas, people and businesses in Wales have been denied the equivalent service or the same level of opportunity as the people in England. So for people who believe in the union, as I passionately do, you can't explain that, let alone justify it. \n                  Plaid Cymru leader was 'turned down' for meeting with PM, he claims\n                 \n                  Is Labour losing Wales to Reform? \n                 \n                  Welsh Labour leader backs calls for winter fuel payment cut rethink\n                 \"Now I want to consider the case of heavy rail infrastructure. Wales receives 1% of rail infrastructure funding despite having 11% of rail tracks. Scotland receives its fair share. Why can't Wales be a successful project? \"The next chapter on devolution has to correct these historic problems\". Wales is at a crossroads in politics, as come May, Labour look to see an end to their century-old dominance in Wales. It is also likely that Labour will no longer lead the government for the first time since the Senedd's creation. According to the latest polling from YouGov for ITV Wales, a Plaid Cymru-led government is the most likely outcome at the May elections, whereas Labour faces obliteration. Plaid Cymru are ahead at 37%, followed by Reform 23%, Green Party 13%, Labour 10%, Conservatives 10% and the Liberal Democrats on 10%. Read more:Kids' social media ban now feels almost certainAsylum seekers moved into army barracks despite opposition The first minister senses the challenges the Labour Party faces from the threat of Plaid in May, warning \"separatism is now very much on the agenda\". She told the event in London: \"The rise of nationalism in Wales, as evidenced in the most recent opinion polls, would give two pro-independence parties, Plaid and the Greens, a majority in Wales. \"Separatism is now very much on the agenda in our nation...and the UK government can play a leading role to resist separatism and the breakup of the union\". Plaid Cymru described Ms Morgan's speech as \"disingenuous\". Heledd Fychan MS told Sky News: \"Plaid Cymru has always led the case for fair funding for Wales, devolving justice, securing powers over our natural resources and securing the billions owed to Wales in rail cash - yet Labour in both Westminster and Cardiff have blocked, and actively opposed, this from happening. \"It is disingenuous of them to claim that they now champion devolution or Welsh interests. \"This was a speech rooted in desperation by a party that's trying to stay relevant when the people of Wales are challenging them on their failure to deliver in government.\" Ms Morgan offered no sign that the UK government is prepared to meet her demands for further devolution. But the fight to secure more powers for Cardiff Bay is far from new for the first minister. Ms Morgan has long demanded control of the Crown Estate, mirroring Scotland's model, where revenues go straight to the Scottish government rather than the UK Treasury. But Westminster has repeatedly rebuffed her, James Murray -then a treasury minister and now chief secretary to the Treasury - told MPs last year that devolving the crown estate would make \"no commercial sense\". In response to the first minister's calls for more devolution a UK government spokesperson said: \"The UK government is working with the Welsh government to deliver the priorities of the people of Wales. \"We recently provided Welsh government with its largest-ever budget settlement of more than £22bn a year, enabling greater investment in the NHS, schools and local services and helping to break down barriers to opportunity, while changes we have made to the fiscal framework mean that the Welsh government has an extra £425m in new spending power in the coming years. \"And this UK government has also delivered generational direct investment in Wales - including new nuclear at Wylfa on Anglesey and £445m to modernise Welsh rail.\""
    },
    {
        "title": "Labour ex-minister to step down as MP - potentially paving way for Andy Burnham to run for parliament",
        "description": "A suspended Labour MP has announced he is stepping down, triggering a by-election.",
        "url": "https://news.sky.com/story/former-labour-minister-set-to-stand-down-as-mp-triggering-by-election-13497554",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-liverpool-conference_7036188.jpg?20250929141240",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 11:14:00",
        "Headline": "Andrew Gwynne's constituency has been touted as a potential seat for Manchester mayor Andy Burnham, who could challenge Sir Keir Starmer. But the \"King of the North\" would face a number of hurdles before he could enter parliament.",
        "Content": "A suspended Labour MP has announced he is stepping down, triggering a by-election. Andrew Gwynne, who was suspended from Labour over offensive WhatsApps, will soon retire from his Gorton and Denton constituency in Greater Manchester on medical grounds. This will trigger a by-election, which could potentially pave the way for Manchester mayor Andy Burnham to become an MP, a step he would need to take to challenge Sir Keir Starmer for the Labour leadership. Politics latest: 29 council elections postponed One of the most popular figures in the Labour Party, former Blair and Brown minister Mr Burnham has long been rumoured to be considering a return to Westminster politics. After a series of resignations and sackings from Sir Keir's close circle, rumours ramped up in September that Mr Burnham was looking to challenge the prime minister. Mr Gwynne, a former Labour health minister, who is sitting as an independent while he awaits the results of a parliamentary standards investigation, said it has \"been the honour of my life\" to serve as an MP for 21 years. \n                  2027 Tour de France: Full route of famous cycling race's return to the UK revealed\n                 \n                  'It made me feel so small' says man turned away from hotel for being homeless\n                 \n                  Ex-Man United star said heading ball 'hasn't helped' following dementia diagnosis before death\n                 But he said he has \"suffered significant ill health\" over most of that time and his GP has advised that despite treatment and support he still has \"a marked dissociation between the reality of his difficulties and the 'front' that he shows to the world\". Mr Gwynne took the unusual step of publishing his GP's advice, which also said he \"remains on very high dose medication\" for his mental health and he does \"not think that he will be able safely to return to work as an MP\". He said Mr Gwynne experienced \"rapid deterioration\" in February last year when the MP's WhatsApp messages were leaked to the media. They included racist comments about Labour MP Diane Abbott, sexist remarks about then-deputy prime minister Angela Rayner, saying he hoped a pension would soon die after asking a councillor about bin collections and joking about a constituent being \"mown down\" by a truck. The Labour Party said it is looking forward to Gorton and Denton residents getting to choose a new Labour MP but made no hints as to who that could be. Mr Gwynne's constituency, on the outskirts of Manchester, has been seen as a potential seat for Mr Burnham for a while. The \"King of the North\", as Mr Burnham is sometimes known, has been re-elected as mayor three times since 2017 and has become well-known for being at odds with Sir Keir. However, if he quit as mayor, he would be breaking his promise to stay on until 2028. He would also need the backing of Labour's National Executive Committee (NEC) to stand and any candidate would have to be approved by the Consitituency Labour Party for Gorton and Denton. Read more:Kids' social media ban now feels almost certainAsylum seekers moved into army barracks despite local opposition If Mr Burnham was successful, a by-election for Manchester mayor would also be triggered, which would cost hundreds of thousands of pounds and Labour would not be guaranteed to win - something that could be used by the NEC to block his nomination as a candidate. The NEC panel, which makes the final decision, is chosen by the office of the general secretary, Hollie Ridley, who is close to Sir Keir's chief of staff, Morgan McSweeney. Mr Burnham is also not guaranteed to win, even if he does run, with an emboldened Reform likely to pose a significant challenge. Mr Gwynne had a medium-sized majority of 13,413 but the Reform candidate came second in the Gorton and Denton seat in 2024. Nationally, the country has seen a significant swing to Reform from Labour in the polls since the election. A Reform spokesman said: \"If the by-election happens, then Reform will throw everything at it. It's a huge ask for anyone to beat Labour in Manchester but we will give it our all.\" A Labour source said, despite Mr Burnham being popular with party members, there are many MPs who do not want him as an MP as there is a \"recipe of psychodrama\" in the run-up to May's local elections when they need to focus on telling the public what the government is doing for the country. They added there are \"lots of other good options\" for potential by-election candidates in the north west, including the female leader of Manchester City Council. \"It would be good to have a woman,\" they said. No date has yet been set for the by-election."
    },
    {
        "title": "Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban",
        "description": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said.",
        "url": "https://news.sky.com/story/harriet-harman-why-labours-shambles-social-media-plan-wont-be-fixed-by-ban-13497710",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-harriet-harman-electoral-dysfunction_7142840.png?20260122171126",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-22 16:39:00",
        "Headline": "Harriet Harman tells the Electoral Dysfunction podcast the government's social media plans are a \"shambles\", warning a ban on under-16s is unworkable and creates a \"cliff edge\" for teenagers.",
        "Content": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said. Speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, the Labour peer cast doubt upon whether a ban on under-16s using social media - as supported by the House of Lords - is workable. The proposals passed by the Lords still need to be agreed by MPs before they become law. The government wants to hold a consultation before committing to a ban. Harman pointed to existing legislation like the Online Harms Bill, Crime and Policing Bill, Data Use and Access Bill, before even considering the Children's Wellbeing and Schools Bill under which peers and some MPs want a social media ban to be legislated. 👉Tap here to listen to Electoral Dysfunction on your podcast app👈 \"It's kind of a shambles, it's not coherent,\" Harman said. \"I really think what we need is a committee in the House of Commons of MPs.\" Without sorting out a \"process\", Harman said the government risked leaping on a ban only to \"discover the ban doesn't work\" and have to try something else, \"which is tougher regulation of social media companies\". \"Meanwhile, people will think we've got this problem and the government is being ineffective, they're not acting appropriately. And that's because the process just does not fit the problem that we've got today,\" she said. 'Cliff edge' warning Another issue raised by Harman was a potential \"cliff edge\" for children when they turn 16. \"You haven't had any sort of education through experience of how to use social media, and you're suddenly exposed to the big wide world with a cliff edge,\" she warned. \"[Another issue] is that for a lot of kids, social media can combat isolation and can help them find their community if they've got a particular problem, and therefore it can have a beneficial effect of linking kids up together.\" Read more from Sky News:How quickly could UK ban teens from social media?What UK social media ban on children could look like In the House of Lords debate about the ban this week, both these points were raised by some peers. Lord Nash, the Conservative peer who proposed the ban, argued against the idea of \"cliff edge\", saying instead the proposal \"seeks merely to give teenagers a few more years to mature so that they can deal more effectively with social media, distinguish fact from fiction and exercise better judgement\". And on access to like-minded communities, he said: \"The police who specialise in child sexual abuse material and radicalisation say that it is precisely the help forums for groups such as LGBTQ+, those with eating disorders, those with ADHD, etc, where the worst abusers hang out and target children.\""
    },
    {
        "title": "'We were lied to, demeaned and smeared': Hospital inquiry families call for Glasgow health board bosses to 'face a reckoning'",
        "description": "Families of patients treated at Scotland's superhospital which is at the centre of infection concerns are calling for health board bosses to \"face a reckoning\" amid claims they were \"lied to\", \"demeaned and smeared\".",
        "url": "https://news.sky.com/story/we-were-lied-to-demeaned-and-smeared-hospital-inquiry-families-call-for-glasgow-health-board-bosses-to-face-a-reckoning-13497513",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-qeuh-glasgow-hospital_7142391.jpg?20260122104214",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-22 10:22:00",
        "Headline": "The Scottish Hospitals Inquiry has been examining the design and construction of the Queen Elizabeth University Hospital (QEUH) campus in Glasgow.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Families of patients treated at Scotland's superhospital which is at the centre of infection concerns are calling for health board bosses to \"face a reckoning\" amid claims they were \"lied to\", \"demeaned and smeared\". The Scottish Hospitals Inquiry has been examining the design and construction of the Queen Elizabeth University Hospital (QEUH) campus in Glasgow. In closing submissions, NHS Greater Glasgow and Clyde (NHSGGC) said \"pressure was applied\" to open the hospital on time and on budget in 2015, and it is now clear it \"opened too early\" and \"was not ready\". The health board also admitted, on the balance of probabilities, there was a \"causal connection between some infections suffered by patients and the hospital environment, in particular the water system\". However, it added that there was \"no definite link between infections and the water system\". NHSGGC has offered a \"sincere and unreserved apology\" to the patients and families affected, and said the QEUH and Royal Hospital for Children (RHC) - which are on the same campus - are \"safe today\". 'Deceit and conniving cowardice' \n                  Call for urgent Holyrood statement after Glasgow health board's hospital infections admission\n                 \n                  Man jailed for violent bottle attack on two passengers on Glasgow to Perth train service\n                 \n                  Glasgow City Council ordered to pay £80,000 after man hit by falling lamppost\n                 Thompsons Solicitors Scotland represents the majority of the affected families and issued a statement on their behalf. It read: \"We were all lied to by GGCH [Greater Glasgow and Clyde Health Board]. We were all disbelieved by GGCH. \"We were all demeaned and smeared by GGCH. We have all had our families devastated and our lives traumatised by GGCH.\" It added: \"We cannot overstate the level of deceit and conniving cowardice displayed by GGCH during the whole unfolding of this awful scandal.\" The families urged political leaders to \"act now\" as they paid tribute to the \"brave and decent\" clinicians and staff who tried to speak out but were reportedly \"silenced\" by the health board. The statement added: \"Those past and present who have presided over this despicable incompetence and cover-up must now be held to account. \"The leadership of GGCH past and present must now face a reckoning.\" 'The hospitals are safe today' NHSGGC said ensuring the safe care of patients is a \"key priority at all times\". The health board added: \"Comprehensive steps have been taken to address past physical defects in the building and a significant programme of maintenance and monitoring is in place. \"Our staff are committed to providing safe, high-quality care. It wouldn't be appropriate for us to comment further at this time while the inquiry is ongoing.\" Read more from Sky News:Fresh search for 'Beast of Birkenhead'Several missing after campsite landslide The inquiry - which is also looking at the Royal Hospital for Children and Young People and Department of Clinical Neurosciences (RHCYP/DCN) in Edinburgh - was launched in the wake of deaths linked to infections, including that of 10-year-old Milly Main. Milly died in 2017 after contracting an infection within the RHC's cancer ward. Scottish Labour are calling for the release of all documents relating to the opening of the QEUH, with the Scottish Conservatives additionally pushing for Nicola Sturgeon to make a personal statement to Holyrood on the issue. Ms Sturgeon was health secretary when the hospital was commissioned and first minister when it opened. The inquiry, chaired by Lord Brodie, will hear closing statements from the families later on Thursday. 'Who applied the pressure?' At FMQs, First Minister John Swinney dodged questions over who supposedly applied pressure on the health board to open the hospital on time and on budget. Scottish Tory leader Russell Findlay asked: \"Did Nicola Sturgeon or anyone else in the SNP government apply political pressure to open the hospital before it was ready?\" Mr Swinney replied: \"The direct answer to that question is no.\" Scottish Labour leader Anas Sarwar branded it the \"biggest scandal in the history of this parliament\". Mr Swinney claimed the Scottish government was first told by NHSGGC of a \"water contamination problem\" in March 2018. The first minister acknowledged the \"significant public interest\" in the inquiry as he was repeatedly questioned over \"who applied that pressure and why\". He replied: \"These issues are the substance of the public inquiry. \"And as I've indicated to in my answers already, the government clearly expected the hospital to open, preparations were being taken to do that, and the operational responsibility for that lay with NHS Greater Glasgow and Clyde. \"And these issues are the substance of the inquiry that Lord Brodie must undertake.\" Mr Swinney said his government had shared all relevant evidence that addresses the terms of reference of the inquiry. But he added: \"Nonetheless, if there is anything further related to the business of government, whether that's cabinet minutes or ministerial correspondence not submitted to the inquiry, then I'm happy to release this, subject to any appropriate redactions, such as personal information and the respecting of legal professional privilege.\""
    },
    {
        "title": "How woman's 'fairytale' home upgrade turned into a nightmare",
        "description": "When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\".",
        "url": "https://news.sky.com/story/how-home-upgrade-scheme-went-from-fairytale-to-worst-experience-of-my-life-13497801",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jane-eco-seabrook_7143140.jpg?20260123013438",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-22 20:11:00",
        "Headline": "A new report by MPs warns the Energy Company Obligation scheme, which left more than 30,000 homes flooded, mouldy or cold, was so \"catastrophic\" it ought to be referred to the Serious Fraud Office.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n When Jane Wallbank found out she'd been awarded free upgrades to make her home warmer and cheaper to run, it sounded like \"a fairytale\". \"Bills have become astronomically expensive in the last few years,\" said Jane, a support worker for people with learning needs. Then she qualified for internal wall insulation, smart radiator sensors and an extractor fan under the ECO (Energy Company Obligation) scheme, designed to upgrade homes for those in fuel poverty and make them greener. It is paid for by energy-bill payers and overseen by a patchwork of energy companies, the government and other agencies. \"I almost felt special, like I could cut energy bills and have a bit left each month,\" said Jane, a single mum of two, who works full-time but receives some universal credit. But she ended up without heating for three weeks, a home flooded from top to bottom, mouldy floors, holes in the walls, doubled heating bills and asthma attacks. \"It's been the worst experience of my life, and it just feels never-ending,\" Jane told Sky News. \"I'm just exhausted, truly, truly exhausted. I have spent every moment I have, between work and kids, pulling furniture around.\" Her home is one of at least 30,000 left with defects by the ECO scheme. The technologies on offer are well evidenced to improve homes, and many installations were done well under ECO. But experts say the poor oversight and money available incentivised \"cowboy\" installers to do the upgrades even in homes that weren't suitable, or to shoddy standards. Damning report shines fresh light on problem Sky News reported some of these problems previously, and the bodies involved have been working since 2024 to fix some of the issues. But a scathing new report today revealed that fewer than 10% of the thousands of homes installed with dodgy wall insulation have been fixed. In the meantime, further bad installations have continued to take place, such as in Jane's rented home in south Wales last autumn. What's more, the remedy has so far focused only on the 30,000 homes with faulty insulation. But Sky News has received reports of scores more issues, from roofs damaged by solar panels, heating systems that couldn't accommodate the heat pumps, or insulation that got wet and spread mould. The common thread is a sense of stress and helplessness. Today's new report found that after a year of trying to resolve the issues, the quality scheme Trustmark had only identified and remedied 3,000 of the at least 30,000 affected by poor insulation. Fraud, failings and financial risk In fact, the Public Account Committee (PAC) of MPs said the whole thing ought to be referred to the Serious Fraud Office for the \"sheer levels of non-compliance\". They described \"a system with serious failings at every level\" that has left already vulnerable recipients financially exposed. Original installers are only liable to cover the remediation costs of up to £20,000, but some properties suffered £250,000 of damage. PAC chair Sir Geoffrey Clifton-Brown MP said: \"Potentially thousands of people are now living with health and safety risks in their homes, and despite government's protestations we have nowhere near enough assurance that they are not financially exposed to unaffordable bills to repair the defective works.\" Read more from Sky News:Police forces to be slashedZelenskyy drops truth bombs on Europe Minister for energy consumers Martin McCluskey said \"we inherited a broken system from the previous government\" and \"are cleaning up this mess\". He said all homes with external wall insulation are being audited, and \"no household should be asked to pay any money to put things right\". Ministers have also decided to replace the ECO with schemes run by local authorities, which have a \"significantly better record of delivery\", and to set up the new Warm Homes Agency, a single system for retrofit \"to provide stronger, formal government oversight and driving up quality\". Concerns mistakes could be repeated The report also raises difficult questions about the government's new Warm Homes plan, which is putting up £15bn to help more homes get onto solar panels, heat pumps and other green technology. Ministers say this has been designed with better oversight to avoid the same mistakes and is also moving away from insulation, given the previous problems. But Sir Geoffrey said the \"public's confidence will have rightly been shaken in retrofit schemes\" and government now has a \"self-inflicted job of work on its hands to restore faith in the action required to bring down bills and reduce emissions\". Simon Francis, coordinator of the End Fuel Poverty Coalition, said: \"Done properly, home upgrades and insulation are among the safest ways to bring down energy bills. Done badly, as we've seen, they can cause real harm.\" He added: \"What's shocking is not just the scale of the damage, but how long it was allowed to happen without effective intervention.\""
    },
    {
        "title": "Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban",
        "description": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said.",
        "url": "https://news.sky.com/story/harriet-harman-why-labours-shambles-social-media-plan-wont-be-fixed-by-ban-13497710",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-harriet-harman-electoral-dysfunction_7142840.png?20260122171126",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-22 16:39:00",
        "Headline": "Harriet Harman tells the Electoral Dysfunction podcast the government's social media plans are a \"shambles\", warning a ban on under-16s is unworkable and creates a \"cliff edge\" for teenagers.",
        "Content": "The \"shambles\" of the government's plan on social media will not be fixed by banning children from accessing the platforms, Harriet Harman has said. Speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, the Labour peer cast doubt upon whether a ban on under-16s using social media - as supported by the House of Lords - is workable. The proposals passed by the Lords still need to be agreed by MPs before they become law. The government wants to hold a consultation before committing to a ban. Harman pointed to existing legislation like the Online Harms Bill, Crime and Policing Bill, Data Use and Access Bill, before even considering the Children's Wellbeing and Schools Bill under which peers and some MPs want a social media ban to be legislated. 👉Tap here to listen to Electoral Dysfunction on your podcast app👈 \"It's kind of a shambles, it's not coherent,\" Harman said. \"I really think what we need is a committee in the House of Commons of MPs.\" Without sorting out a \"process\", Harman said the government risked leaping on a ban only to \"discover the ban doesn't work\" and have to try something else, \"which is tougher regulation of social media companies\". \"Meanwhile, people will think we've got this problem and the government is being ineffective, they're not acting appropriately. And that's because the process just does not fit the problem that we've got today,\" she said. 'Cliff edge' warning Another issue raised by Harman was a potential \"cliff edge\" for children when they turn 16. \"You haven't had any sort of education through experience of how to use social media, and you're suddenly exposed to the big wide world with a cliff edge,\" she warned. \"[Another issue] is that for a lot of kids, social media can combat isolation and can help them find their community if they've got a particular problem, and therefore it can have a beneficial effect of linking kids up together.\" Read more from Sky News:How quickly could UK ban teens from social media?What UK social media ban on children could look like In the House of Lords debate about the ban this week, both these points were raised by some peers. Lord Nash, the Conservative peer who proposed the ban, argued against the idea of \"cliff edge\", saying instead the proposal \"seeks merely to give teenagers a few more years to mature so that they can deal more effectively with social media, distinguish fact from fiction and exercise better judgement\". And on access to like-minded communities, he said: \"The police who specialise in child sexual abuse material and radicalisation say that it is precisely the help forums for groups such as LGBTQ+, those with eating disorders, those with ADHD, etc, where the worst abusers hang out and target children.\""
    },
    {
        "title": "How quickly could the UK ban teenagers from social media?",
        "description": "The UK just got much closer to banning under-16s from social media. So, how long could it take for a ban to come into force?",
        "url": "https://news.sky.com/story/how-quickly-could-the-uk-ban-teenagers-from-social-media-13497587",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-media-nicole-johnston_7106650.jpg?20251210150027",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-22 12:47:00",
        "Headline": "This week's House of Lords decision to back a bar for under-16s on social media platforms, could accelerate the process needed to make it British law.",
        "Content": "\n          Science and technology reporter\n       The UK just got much closer to banning under-16s from social media. So, how long could it take for a ban to come into force? On Thursday night, the House of Lords voted for a social media ban for under-16s added into a piece of legislation called the Children's Wellbeing and Schools Bill. The amendment could drastically speed up the implementation of a social media ban here in the UK. If it is also passed by the House of Commons it will become law. Read more: What UK social media ban on children could look like - as government considers action Without amendment, campaigners would have had to wait for the government to run a nationwide consultation that it announced on Monday. Ministers are not scheduled to respond to that consultation until the summer, so that would already have meant a six-month wait. If the consultation did suggest a ban was necessary, the government says it would offer MPs a chance to vote on a new amendment giving them the power to enact the ban. More time would then have been needed to give tech companies time to prepare. \n                  How woman's 'fairytale' home upgrade turned into a nightmare\n                 \n                  Harriet Harman: Why Labour's 'shambles' social media plan won't be fixed by ban\n                 \n                  Logging off: Kids' social media ban now feels almost certain\n                 By adding an amendment into legislation already going through parliament, Lord Nash, who proposed the amendment, has managed to skip many of those hurdles. That was intentional. \"The longer we delay, the more children we fail,\" the Conservative peer said earlier this week. Read more: Logging off: Kids' social media ban now feels almost certain Now the bill - with its new social media ban amendment - will go back to the House of Commons for MPs to consider and vote on it. One Labour MP told Sky's political reporter Faye Brown there was \"no way\" the government could pressure its MPs to vote against it, claiming a majority are in favour of the ban. The government in Australia faced very similar pressure in the run-up to approving their ban for under-16s on social media, according to Daniel Stone, a fellow with Australia's Centre for Responsible Technology who is currently based in Cambridge. \"From far away, we can think that the Australian government went into this with a really clear intention,\" he told Sky News, \"But the reality is that the process wasn't that dissimilar from what we're seeing playing out here. \"The Australian government had originally resisted acting on it, and then, due to the political circumstance, it became more and more urgent, and they decided that there was an incredible amount of political urgency, and that the community really wanted to see something done, and decided to embrace it.\" As in Australia, once the law passes, tech companies will be given 12 months to prepare to remove their under-16 users and block new ones. Many of them will already have the technology in place to do this. In July, new rules came into force that meant under-18s needed to be blocked from seeing adult and harmful content. Read more: What is AI facial age estimation? The age-verification tools used by many UK companies to comply with those rules is the same tech being used in Australia to block under-16s from social media. There's been a fair amount of criticism of that technology, with Australian teenagers this week telling Sky News they were able to easily bypass it. However, that doesn't necessarily undermine the ban, according to Mr Stone. \"Some kids might attempt to get around this and they'll probably be successful if they do,\" he said. \"The important thing is to make sure that we're establishing a clear social norm, that [social media] is harmful, that a certain amount of care is required and that we should be broadly hesitant about jumping straight into it.\""
    },
    {
        "title": "Oscar nominations: The biggest snubs and surprises",
        "description": "While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow.",
        "url": "https://news.sky.com/story/the-biggest-snubs-and-surprises-of-this-years-oscar-nominations-13497715",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wicked-for-good-awards-season_7127357.jpg?20260105164713",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2026-01-22 17:36:00",
        "Headline": "As Sinners stars celebrate, Paul Mescal, Ariana Grande and Cynthia Erivo have been left crying into their popcorn. Here are some of the movies and stars that failed to make the cut.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n While Sinners has surpassed all expectations at this year's Oscar nominations, coming away with a whopping 16 nods, not all movies will be coming away from the nominations with the same happy glow. Wicked: For Good may have done fairly swift business at the box office, but that simply did not translate into Oscar votes. Read more: Oscar nominations 2026 as it happened After the first instalment of the movie got 10 nods last year, the second part did not receive a single nomination. While its two stars - Cynthia Erivo and Ariana Grande - failed to make it into the best actress and best supporting actress categories, the biggest blow will be missing out on the coveted best picture category. Meanwhile, Paul Mescal was overlooked in the best supporting actor category for his performance as playwright William Shakespeare in the big-screen adaptation of Maggie O'Farrell's award-winning novel Hamnet. While that's the category he campaigned in, some felt he would have been placed in the best actor category, raising the possibility that the Irish star split some of his votes if some people put his name in the latter. Another acting omission was that of Chase Infiniti - breakout star of One Battle After Another, playing the daughter of Leonardo DiCaprio's washed-up revolutionary. Read more: Oscar nominations 2026: The full list After her nomination in the best actress category at the Golden Globes earlier this month, she had been widely expected to appear in the Oscar nominations line-up too. Her four co-stars - Leonardo DiCaprio, Benicio Del Toro, Sean Penn and Teyana Taylor - all made it into the mix. In a tight race, while Infiniti failed to make the best actress cut, Kate Hudson did make it in for her performance in musical drama Song Sung Blue, which was far from guaranteed. A recent publicity event at which she was interviewed by her mother, veteran Hollywood star Goldie Hawn, may well have given her the voter boost she needed to get her over the line. While Mescal and Infiniti missed out, it was a different story for British stars Delroy Lindo, 74, and Wunmi Mosaku, 39, who both got nods for Sinners. RADA-trained British Nigerian actress Mosaku had made her way into the awards conversation in recent days, but Lindo's nod for his portrayal of musician Delta Slim was out of the blue. The London-born actor was critically acclaimed for his performance, but most pundits expected him to be left out in favour of Mescal or Adam Sandler for Jay Kelly. While Norwegian family drama Sentimental Value got an impressive nine nods overall, it got nothing in the new category, best achievement in casting. It's a slightly strange omission, considering it got four nods in the acting categories - Renate Reinsve in best actress in a leading role, both Elle Fanning and Inga Ibsdotter Lilleaas in best supporting actress and Stellan Skarsgard in best supporting actor. And while gothic horror Frankenstein got nine nods - including best picture - Mexican filmmaker Guillermo del Toro missed out in the best director category. Formula One blockbuster F1, starring Damson Idris and Brad Pitt, while expected to do well in the technical categories, also managed to nudge its way into the best picture race. A summer hit, it remains to be seen if it will have the backing to win pole position at this year's Academy Awards in LA on Sunday, 15 March."
    },
    {
        "title": "Oscar nominations 2026: The full list of stars and films up for awards",
        "description": "Many expected the politically charged thriller One Battle After Another to lead the Oscar field, but vampire horror Sinners has swooped into first place with 16 nominations.",
        "url": "https://news.sky.com/story/oscar-nominations-2026-the-full-list-of-stars-and-films-up-for-awards-13497656",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-marty-supreme-hamnet_7142539.jpg?20260122173706",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-22 15:40:00",
        "Headline": "Sinners leads the nominations for this year's Oscars with 16 nods, followed by One Battle After Another with 13.",
        "Content": "Many expected the politically charged thriller One Battle After Another to lead the Oscar field, but vampire horror Sinners has swooped into first place with 16 nominations. Two of the movie's British stars, Delroy Lindo and Wunmi Mosaku, have also made it into the best actor and best actress categories. Here are the nominations from all 24 Oscar categories. Read more: Oscar nominations 2026 live: Sinners breaks record - as Timothee Chalamet makes history Best pictureOne Battle After AnotherSinnersHamnetMarty SupremeFrankensteinSentimental ValueTrain DreamsBugoniaThe Secret AgentF1 Best directorPaul Thomas Anderson - One Battle After AnotherRyan Coogler - SinnersChloe Zhao - HamnetJosh Safdie - Marty SupremeJoachim Trier - Sentimental Value Best actress in a leading roleJessie Buckley, HamnetRose Byrne, If I Had Legs I'd Kick YouKate Hudson, Song Sung BlueRenate Reinsve, Sentimental ValueEmma Stone, Bugonia Best actor in a leading roleMichael B Jordan - SinnersLeonardo DiCaprio - One Battle After AnotherTimothee Chalamet - Marty SupremeWagner Moura - The Secret AgentEthan Hawke - Blue Moon Best supporting actorStellan Skarsgard - Sentimental ValueBenicio del Toro - One Battle After AnotherSean Penn - One Battle After AnotherJacob Elordi - FrankensteinDelroy Lindo - Sinners Best supporting actressTeyana Taylor - One Battle After AnotherAmy Madigan - WeaponsInga Ibsdotter Lilleaas - Sentimental ValueWunmi Mosaku - SinnersElle Fanning - Sentimental Value Best original screenplaySinnersMarty SupremeSentimental ValueIt Was Just an AccidentBlue Moon Best adapted screenplayOne Battle After AnotherHamnetTrain DreamsBugoniaFrankenstein Best animated short filmButterflyForevergreenThe Girl Who Cried PearlsRetirement PlanThe Three Sisters Best live action short filmButcher's StainA Friend of DorothyJane Austen's Period DramaThe SingersTwo People Exchanging Saliva Best make-up and hairstylingKokuhoFrankeinsteinSinnersThe Smashing MachineThe Ugly Stepsister Best original scoreBugoniaFrankensteinHamnetOne Battle after AnotherSinners Best animated feature filmKPop Demon HuntersZootopia 2ArcoElioLittle Amelie or the Character of Rain Best castingHamnetMarty SupremeOne Battle after AnotherThe Secret AgentSinners Best cinematographyFrankensteinMarty SupremeOne Battle after AnotherSinnersTrain Dreams Best documentary feature filmThe Alabama SolutionCome See Me in the Good LightCutting through RocksMr Nobody against PutinThe Perfect Neighbor Best short filmAll the Empty RoomsArmed Only with a Camera: The Life and Death of Brent RenaudChildren No More: Were and Are GoneThe Devil Is BusyPerfectly a Strangeness Best film editingOne Battle After AnotherSinnersMarty SupremeF1: The MovieSentimental Value Best international feature filmBrazil, The Secret AgentFrance, It Was Just an AccidentNorway, Sentimental ValueSpain, SiratTunisia, The Voice of Hind Rajab Best original songDear Me from Diane Warren: RelentlessGolden from KPop Demon HuntersI Lied To You from SinnersSweet Dreams Of Joy from Viva Verdi!Train Dreams from Train Dreams Best costume designHamnetMarty SupremeAvatar: Fire and AshFrankensteinSinners Best production designFrankensteinHamnetMarty SupremeOne Battle After AnotherSinners Best original soundF1FrankensteinOne Battle after AnotherSinnersSirat Best visual effectsAvatar: Fire and AshF1Jurassic World RebirthThe Lost BusSinners"
    },
    {
        "title": "Liz Hurley hits back at 'leak' suggestions and claims phone was bugged, during intense day at High Court",
        "description": "Elizabeth Hurley hit back at suggestions of \"leaks\" among her friends as she gave evidence in the privacy trial against the publisher of the Daily Mail - and became tearful as she spoke about the impact of articles written about her private life.",
        "url": "https://news.sky.com/story/liz-hurley-hits-back-at-leak-suggestions-and-claims-phone-was-bugged-during-intense-day-at-high-court-13497701",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-liz-hurley-court-daily-mail_7142699.jpg?20260122145450",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-01-22 16:19:00",
        "Headline": "The actress and model was supported by her son, Damian, as well as her fellow claimant, Prince Harry, as she gave evidence in the High Court. Associated Newspapers, publisher of the Daily Mail, has strenously denied wrongdoing.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Elizabeth Hurley hit back at suggestions of \"leaks\" among her friends as she gave evidence in the privacy trial against the publisher of the Daily Mail - and became tearful as she spoke about the impact of articles written about her private life. The actress and model spent about three hours in the witness box at the High Court, where she and six others, including Prince Harry and Sir Elton John, are suing Associated Newspapers Limited (ANL) over allegations of unlawful information gathering. ANL strenuously denies wrongdoing and also argues the claims have been brought too late. The allegations in Hurley's case relate to 15 articles published between 2002 and 2011. In a written witness statement submitted to the court, Hurley, 60, said the Daily Mail's alleged unlawful acts involved \"tapping my phones and recording my live telephone conversations, placing surreptitious mics on my home windows\" and \"other monstrous, staggering things\". She said the alleged tapping of her landline was a \"brutal invasion of privacy\" that left her feeling \"crushed\". In court, she explained in front of Judge Nicklin how there had been an \"avalanche\" of articles written about her in the 2000s, and particularly after the birth of her son, Damian. Many were \"unpleasant\", she told the court. Hurley became tearful and wiped her eyes several times during her evidence, but each time said she wanted to carry on rather than taking a break. \"I felt really mortified that my son would be able to read all this stuff one day, and I feel really bad that that day is today when all this stuff is being regurgitated again,\" Hurley said. \"Yet again, everyone's privacy is being invaded in this terrible way, and I feel very helpless about that.\" Damian Hurley sat in court to support his mother - joined in the morning by Prince Harry, following his own evidence yesterday. As he arrived at court, Sky News asked the duke how he was feeling - to which he turned and smiled, replying: \"Great, thank you.\" 'I believe people were listening to me' During questioning by Antony White KC, representing ANL, Hurley hit back at his suggestion of \"leaks\" among her friends. Asked why she did not complain about the articles in her claim at the time they were published, Hurley said she had always thought \"complaints were for libel\" - and these stories \"were in essence true\". She continued: \"I believe that is because people were listening to me speak.\" There were \"microphones on the windowsill of my dining room\" and her rooms and landlines were \"bugged\", Hurley told the court. \"Yes, there were leaks, but they were not from my friends,\" she said. Hurley was also questioned about her friendship with her ex-boyfriend Hugh Grant, and the extent of her involvement with Hacked Off, the press reform group he campaigns for. The actress told the court she had donated £350,000 damages awarded to her after a settlement with Mirror Group Newspapers, but was not involved with the group - pushing back on that suggestion from White several times. At the end of her evidence, David Sherborne, who is representing Hurley and the other claimants, asked her how she felt about having to come to court \"as a result of Associated denying the claims\". Hurley responded: \"I don't really want to be here, didn't want to come. \"I find it intimidating. I find it quite traumatic. I don't really like talking about things that happened to me in the past.\" Becoming emotional, she added: \"I find it very painful.\" Read more:The latest updates from courtAnalysis: Harry's short time in the witness box What has ANL said? During his opening statement to the trial earlier this week, Mr White described the allegations against the publisher as \"threadbare\", and said ANL journalists have a \"compelling account of a pattern of legitimate sourcing\" of the articles in question. In a written submission for the trial, the lawyer said allegations of unlawful information gathering (UIG) against ANL, \"including of phone hacking and phone tapping, in connection with Ms Hurley or her 10 named associates\", are \"unsupported by the evidence before the court\". The claims are \"entirely baseless\", he went on, and \"borne of an attempt by members of the claimants' research team, adopted by Ms Hurley and her legal representatives, to present a case of UIG against Associated based entirely on spurious and, or, discredited information.\" Further witnesses for the claimants are due to give evidence next week, before witnesses for ANL are called later on. The trial is set to last about nine weeks, with a decision expected at a later date."
    }
]