[
    {
        "title": "Get ready to fight: Armed forces chief issues stark warning as Russian threat grows",
        "description": "There is a growing risk that Russia could attack the UK, and the nation's \"sons and daughters\" need to be ready to fight, the head of Britain's armed forces has said.",
        "url": "https://news.sky.com/story/uks-sons-and-daughters-need-to-be-ready-to-fight-amid-growing-russian-threat-says-head-of-armed-forces-13483860",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-putin-british-army_7111571.jpg?20251216002150",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-15 18:31:00",
        "Headline": "In an extraordinarily blunt intervention, Air Chief Marshal Sir Richard Knighton warned that Russia's military strength is increasing and is something to fear, with Russian troops now battle-hardened after spending the past nearly four years waging a full-scale war in Ukraine.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  There is a growing risk that Russia could attack the UK, and the nation's \"sons and daughters\" need to be ready to fight, the head of Britain's armed forces has said. In an extraordinarily blunt intervention, Air Chief Marshal Sir Richard Knighton warned that Russia's military strength is increasing and is something to fear, with Russian troops now battle-hardened after spending the past nearly four years waging a full-scale war in Ukraine. He said the UK's armed forces would always be the first line of defence alongside the rest of the NATO alliance, but the whole of society must also play a part in rebuilding resilience. The chief of the defence staff said it is important to be honest with \"families and households\" across the UK about what it means to be prepared for \"an array of real, physical threats\". UK's 'sons and daughters' must be ready Serving up a sombre reality check, Air Chief Marshal Knighton said he agreed with his French counterpart, General Fabien Mandon, who said last month that France must be ready for the possibility of losing its children in a potential war with Russia. \"The situation is more dangerous than I have known during my career, and the price of peace is rising,\" the British defence chief said. \"Our response needs to go beyond simply strengthening our armed forces. It needs a whole of nation response that builds our defence industrial capacity, grows the skills we need, harnesses the power of the institutions we will need in wartime and ensures and increases the resilience of society and the infrastructure that supports it.\" He continued: \"Sons and daughters. Colleagues. Veterans. …will all have a role to play. \"To build. To serve. And if necessary, to fight. And more families will know what sacrifice for our nation means.\"  Most people in the UK, though, no longer have direct experience of the armed forces thanks to the peace that followed the end of the Cold War almost 35 years ago. The military chief noted that it was 65 years ago this month since the last national service call-ups took place, and 80 years since the end of the Second World War. But he indicated that the kind of national defence and resilience that was once second nature to UK society up until the collapse of the Soviet Union needs to return. He said that while there was only deemed by defence analysts to be a \"remote\" chance of up to a 5% of Russia launching a \"significant direct attack or invasion\" against the UK, this \"does not mean the chances are zero\". Russian threat 'worsening' Air Chief Marshal Knighton said: \"My point is that none of us can say with any certainty what the absolute risk might be. And even though simple binary statements might be easy for people to engage with, they risk instilling panic or complacency. \"What really matters is the trend. Are the chances of conflict growing? \"And here, I think the evidence is clear that the trend, from Russia in particular, is worsening, and that is the key argument for action.\" Turning to the capability of the Russian armed forces, despite being locked in a major war against Ukraine, he said their \"hard power is growing quickly\".  \"Over the past 20 years, Russia has delivered significant defence reform and investment into what were weak and hollowed-out armed forces,\" he added. \"The Russian armed forces are now more than 1.1 million strong, consuming more than seven per cent of GDP, and around 40% of government spending, which is a sum that has more than doubled over the past decade.\" By contrast, the UK army is a little over 70,000 soldiers, with the government only committed to increasing defence spending to 2.5% of GDP from 2.3% by 2027. Russian power 'something to fear' \"We should be under no illusions that Russia has a massive, increasingly technically sophisticated, and now, highly combat-experienced, military,\" the military chief said. He described how Russia is \"developing new and destabilising weapons systems such as nuclear-armed torpedoes and nuclear-powered cruise missiles putting nuclear weapons in space. So it is absolutely clear that Russia's hard power is something to fear, but what about Russia's intent to use it?\" The military chief said the war in Ukraine and Russia's willingness to target its neighbouring states show it \"wishes to challenge, limit, divide and ultimately destroy NATO\". But he acknowledged this threat is not yet felt in the UK as it is in countries that share physical land borders with Russia. In a sign that he is seeking a more rapid increase in defence spending, he said Germany expects to spend 3.5% of GDP on defence by 2029, while Poland is already at 4.2%. \"And we have seen just in the past few weeks France and Germany return to a form of national service.\" Read more from Sky News:Russia trying to 'bully' UK and alliesPutin may exploit British soldier's death He continued: \"In reality, other than proximity, the threat in the UK isn't really any different to the threat in Germany, for example. \"Unless we are able to raise awareness and stimulate the conversation with society about the risks, we can't expect the rest of government, society, and industry to act or bear the costs.\" The defence chief called out a podcast series by Sky News and Tortoise called The Wargame, which simulates a Russian attack on the UK, as an example of efforts in the media to raise public awareness.  Building on the success of the highly acclaimed podcast The Wargame, Sky News presents The Wargame: Decoded - a one-off live event that takes you deep inside the minds of the wargame's participants. Discover how they tackled the toughest challenges, the decisions they made under intense pressure, and even experience key moments of the game for yourself. Click here to get tickets. Sky News' Deborah Haynes will guide the conversation with Sir Ben Wallace, Robert Johnson, Jack Straw, Amber Rudd, Keir Giles and General Sir Richard Barrons - real-life military chiefs, former government officials and leading experts. Together, they will unpack their experiences inside The Wargame, revealing the uncertainty, moral dilemmas and real-world pressures faced by those who must make decisions when the nation is under threat. Join us for this unique event exploring how the UK might respond in a moment of national crisis and get a rare, unfiltered glimpse into how prepared the country truly is for war."
    },
    {
        "title": "Timeline of Bondi Beach shooting: Videos show how terror attack unfolded",
        "description": null,
        "url": "https://news.sky.com/story/timeline-of-bondi-beach-shooting-videos-show-how-terror-attack-unfolded-13483893",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-naveed-akram_7111132.jpg?20251215164906",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 20:05:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Rob Reiner death: 'Sick' Trump sparks backlash with 'disgusting' post about murdered film director",
        "description": "Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner.",
        "url": "https://news.sky.com/story/rob-reiner-death-sick-trump-sparks-backlash-with-disgusting-post-about-murdered-film-director-13483564",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rob-reiner-michele-singer-reiner_7110445.jpg?20251215194001",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 07:29:00",
        "Headline": "The US president says Rob Reiner had \"TRUMP DERANGEMENT SYNDROME\" in an online post after he and his wife, Michele Singer Reiner, were found dead.",
        "Content": " Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner. The Hollywood luminary was found stabbed to death with his wife on Sunday - and the filmmaker's son had been arrested on murder charges. Reacting to news of his death, the US president said in a post on Truth Social that Reiner was \"tortured and struggling, but once very talented movie director and comedy star\". Mr Trump said Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS\". \"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before. May Rob and Michele rest in peace,\" Mr Trump wrote. Celebrities and politicians have criticised Mr Trump for his comments, labelling them \"disgusting\" and \"petty\". 'Can you get any lower?' \"What a disgusting and vile statement,\" actor Patrick Schwarzenegger said on X, while Californian Democrat Zoe Lofgren condemned Mr Trump's comments as \"a new low for this petty, hateful man\". Talk show host Whoopi Goldberg compared the president's comments to those he made after the assassination of right-wing activist Charlie Kirk, when Mr Trump hit out at critics. \"I don't understand the man in the White House. He spoke at length about Charlie Kirk and about caring, and then this is what he puts out. Have you no shame? No shame at all? Can you get any lower? I don't think so,\" she said. 'Sick' \"This is a sick man,\" California governor Gavin Newsom wrote on X. Republican US House member Thomas Massie also addressed the comments, saying: \"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered.\" Meanwhile, Reiner's son, Nick, 32, has been \"booked for murder\", Los Angeles police chief Jim McDonnell said. The LAPD later said Nick Reiner remains in custody without bail. Mr McDonnell said the department's robbery and homicide division was handling the investigation. \"They worked throughout the night on this case and were able to take into custody Nick Reiner, a suspect in this case,\" he said, calling the deaths \"a very tragic incident\". It comes as it emerged Nick was reportedly disruptive when he joined his father and mother, Michele Singer Reiner, at a party hosted by comedian Conan O'Brien on Saturday night, the day before the killings. Reiner and his wife were upset and embarrassed about their son's behaviour, Sky News's US partner NBC News cited a source as saying, and expressed concerns about his health. The outlet cited another source saying Nick's behaviour had made other guests uncomfortable. They said he interrupted a conversation comedian and filmmaker Bill Hader was having with two guests and, when told it was a private conversation, stood still and stared before storming off. Reiner and his wife apparently died of stab wounds, US media reported. The Los Angeles Fire Department said a 78-year-old man and a 68-year-old woman were found dead inside a property in the Brentwood neighbourhood, without identifying the victims. The victims were later confirmed to be Reiner and his wife. The case against Nick Reiner will be presented to the Los Angeles county district attorney's office for filing consideration on Tuesday, according to the LAPD. Nick Reiner has spoken publicly of his struggles with addiction after he had cycled in and out of treatment facilities by the age of 18, with periods of homelessness and relapses in between. Reiner and his son explored their difficult relationship and Nick Reiner's struggles with heroin addiction and homelessness in a 2016 film called Being Charlie, which they co-wrote. Republican congresswoman Marjorie Taylor Greene referred to Nick Reiner's \"drug addiction and other issues\" in a statement on X. \"This is a family tragedy, not about politics or political enemies,\" Ms Taylor Greene said. \"Many families deal with a family member with drug addiction and mental health issues. It's incredibly difficult and should be met with empathy especially when it ends in murder.\" Reiner was a celebrated director whose work included some of the most memorable movies of the 1980s and 1990s. He directed classics such as This Is Spinal Tap, The Princess Bride, When Harry Met Sally, A Few Good Men and Stand By Me. He also acted, starring in Sleepless In Seattle and The Wolf Of Wall Street among others. His most recent high-profile work was a recurring guest role in the hit show The Bear. He met Michele Singer in 1989, while directing When Harry Met Sally. They have three children together. Singer used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal. Former US president Barack Obama has led tributes. He wrote on X that \"Michelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele. Rob's achievements in film and television gave us some of our most cherished stories on screen\". Harry Shearer, who collaborated with Reiner on This Is Spinal Tap, said in a statement: \"Rob was a friend and collaborator through much of my life. He was funny, he was smart, he was a mensch.\" He said Reiner's wife was a \"very good friend\" to his own wife, Judith, adding: \"This is unspeakable, the stuff of Greek tragedy.\" Christopher Guest, who starred in Reiner's films This Is Spinal Tap and The Princess Bride, and his wife Jamie Lee Curtis said in a joint statement that they were \"numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner\". The couple said: \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis. We have lost great friends. Please give us time to grieve.\" Read more: Reiner spoke to Eric Idle about future before death Reiner was a champion of liberal causes and a political activist. In the 2004 presidential election, he backed Democrat candidate John Kerry and featured in advertisements taking aim at incumbent president George W Bush. Reiner also supported Democratic presidential hopefuls Al Gore and Hillary Clinton. \"This is a devastating loss for our city and our country. Rob Reiner's contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" Los Angeles mayor Karen Bass said. California governor Mr Newsom paid tribute to Reiner's activism as he said he was \"heartbroken\" over the director's death. \"Rob was a passionate advocate for children and for civil rights - from taking on Big Tobacco, fighting for marriage equality, to serving as a powerful voice in early education,\" Mr Newsom said in a statement. \"He made California a better place through his good works. Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.\" Read more from Sky News:Four charged with California bomb plotAustralian PM reveals details about Bondi killers Former House speaker, Democrat Nancy Pelosi, said: \"Personally, Rob cared deeply about people and demonstrated that in his civic activities - whether by supporting the First 5 initiative or fighting against Prop 8 in California. \"Civically, he was a champion for the First Amendment and the creative rights of artists. And professionally, he was an iconic figure in film who made us laugh, cry and think with the movies he created.\""
    },
    {
        "title": "Liverpool parade attacker told police he'd 'ruined' his family's life",
        "description": "Liverpool parade attacker Paul Doyle told police he'd \"ruined\" his family's life after driving into more than 100 people at a Premier League title parade, a court has heard.",
        "url": "https://news.sky.com/story/hero-pedestrian-climbed-into-car-of-liverpool-parade-attacker-to-stop-him-court-hears-13483773",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-doyle-liverpool_7092383.jpg?20251126114044",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 14:46:00",
        "Headline": "Paul Doyle is due to be sentenced on Tuesday after pleading guilty to 31 offences relating to seriously injuring people during the victory parade in May.",
        "Content": " Liverpool parade attacker Paul Doyle told police he'd \"ruined\" his family's life after driving into more than 100 people at a Premier League title parade, a court has heard. Monday's sentencing hearing was told the 54-year-old was \"in a rage\" and his \"anger had completely taken hold of him\" when he used his car as a \"weapon\" to plough through more than 100 people celebrating Liverpool's title win back in May. The court heard he told officers: \"I've just ruined my family's life.\" Doyle is due to be sentenced today after pleading guilty to 31 offences relating to seriously injuring people during the victory parade on 26 May. Doyle, described as a \"family man\" by prosecutors, wept as footage of the horrific rampage was shown to the city's crown court several times on Monday. 'Hero' pedestrian climbed into car Paul Greaney KC, prosecuting, described the actions of Daniel Barr, who he called the \"hero\" of the day. Mr Barr, an ex-soldier, had \"bravely\" jumped into the back of Doyle's Ford Galaxy and placed the vehicle into park. He was walking up Water Street when he noted the defendant's Ford Galaxy in the distance, said Mr Greaney, noting the crowd's attitude changed from \"joyous to desperate\". Doyle's vehicle then stopped next to Mr Barr \"all of a sudden\". \"Daniel Barr instinctively pulled open the rear passenger-side door and climbed in. He did so with the intention of stopping the driver,\" the prosecutor said. Mr Barr leaned forward and moved the gear into \"park\" and \"held it as hard as he could\". Mr Greaney added: \"The Galaxy did not stop immediately, but in the end it did.\" The prosecutor said police officers forced Doyle into a police van after the attack. This, he said, was done \"in the midst of a hostile crowd\", adding that officers' behaviour was both \"brave and effective\". When Doyle was securely in the van, Mr Greaney said police body-worn camera footage picked up him saying: \"I've just ruined my family's life.\" Read more from Sky News:Christmas doctors' strike to go aheadRob Reiner spoke to Eric Idle before he died Doyle admitted dangerous driving, affray, 17 charges of attempting to cause grievous bodily harm (GBH) with intent, nine counts of causing GBH with intent, and three counts of wounding with intent last month. He had previously denied the offences, which relate to 29 victims aged between six months old and 77 years old. 'Truly shocking' The court was shown dashcam footage taken from the defendant's car showing the attack. Mr Greaney warned the court: \"What we are about to display on the screens is truly shocking.\" There were audible gasps in the courtroom as the footage played. Doyle could be heard repeatedly shouting at pedestrians to \"move out the f****** way\" as he drove through crowds. Consistently using his vehicle's horn, people could be seen trying to jump out of the way, with some forced on to the bonnet of the car. \"F****** pr****,\" Doyle shouts as the footage continues. By the end of the footage, people begin to attempt to run up to the vehicle. When the car stops, one man shouts, \"get the f*** out of the car\". Mr Greaney also detailed some of the injuries sustained by victims on the day of the attack. One woman, aged 66, spent four nights in hospital after breaking six ribs and suffering fractures to her fingers on her left hand and her left wrist. Another woman, aged 77 at the time, spent 27 days in hospital. The prosecutor said she suffered a fractured left forearm, fractured left collar bone, three fractured ribs, a fractured pelvis, a broken nose, as well as multiple abrasions and bruising to her head, knees and back. Another victim, who was 17, suffered bruising to their legs, shoulder and had a small fracture to their tibia. After suffering wound infections, it took two months before the victim regained mobility, the prosecutor added. The victims of Paul Doyle's attack during Liverpool's Premier League victory parade have spoken of how they have suffered from \"emotional and psychological injury\" as well as \"frequent flashbacks\". A total of 78 people submitted victim statements to the court, in which they described how the \"best day ever\" soon became the worst. Doyle sobbed as the words of one victim, a 12-year-old boy, were read out by prosecutor Philip Astbury at Liverpool Crown Court. The child, who cannot be named for legal reasons, said: \"I found myself on the floor having been hit by a car I did not see coming, I have never felt so scared before in my life.\" The boy’s mother said in her statement her heart sank when she saw her child inert on the floor. She said the incident \"caused me much anxiety having to watch my son deal with the pain, the frustration, him feeling down and isolated from his friends in school, the nightmares and the after-effects on him\". The boy's mother added: \"The sight of my son lying motionless on the road, not moving for those few seconds, and the sound of the car hitting people will live with me forever.\" Another mother said she thought her baby son had died after his pram was catapulted into the air after being struck by Doyle's vehicle, adding that she thought she would \"be next\". Sheree Aldridge, 37, said her partner Dan Eveson had proudly dressed their six-month-old son Teddy Eveson in his Liverpool FC shirt that day and \"was excited to share this moment\" with him. She said in the statement: \"In that moment I thought I was going to die. I didn't know where Dan and Teddy was. \"I felt an overwhelming pain in my leg and looked up to see Teddy's pushchair on its side further up the road. I thought my Teddy was dead. \"I thought I was next. I thought my children would grow up without a mother.\" The court also heard how a third mother, whose 13-year-old son was injured, said she has trouble sleeping due to flashbacks and has visions of her son's \"terrified face\". Mr Greaney said some people at the scene on 26 May \"thought that what was taking place was a terrorist attack\". However, the prosecution ruled out that the defendant's actions were \"driven by ideology\". Police investigations showed there was no problem with the vehicle, and Doyle was completely sober and \"free of all drugs\", Mr Greaney said. \"The truth is a simple one - Paul Doyle just lost his temper in his desire to get to where he wanted to get to. \"In a rage, he drove into the crowd,\" he added. Doyle was arrested at the scene in Water Street just after 6pm and charged later that week. The youngest victim was six-month-old Teddy Eveson, whose parents later told media he was thrown about 15ft down the road in his pram when the crash happened. Doyle, of Croxteth, Liverpool, admitted attempting to cause grievous bodily harm to the baby. Five other children, whom Doyle either injured or attempted to injure, cannot be named for legal reasons."
    },
    {
        "title": "UK weather: Heavy rain and flooding to hit parts of UK as new warning issued",
        "description": "Forecasters have issued a new yellow warning for rain as parts of the UK could face flooding and travel disruption in the coming days.",
        "url": "https://news.sky.com/story/uk-weather-heavy-rain-and-flooding-to-hit-parts-of-uk-as-new-warning-issued-13483724",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-briton-ferry-neath_7111097.jpg?20251215161646",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 12:39:00",
        "Headline": "The Met Office said some communities could \"become cut off\" and 15-25mm of rain is \"likely to accumulate quite widely\" in parts of the UK.",
        "Content": "Forecasters have issued a new yellow warning for rain as parts of the UK could face flooding and travel disruption in the coming days. The Met Office said \"15-25mm of rain is likely to accumulate quite widely\" in South Wales and the South West of England on Wednesday and will fall on ground which is already saturated. The yellow warning applies from 10am until the end of the day. Check the forecast for your area There is a chance of power cuts and disruption to travel networks, while some communities could \"become cut off\" due to the conditions, said the Met Office. It comes as many parts of the UK were already facing warnings previously issued for Monday and Tuesday. An amber rain warning for possible danger to life is in force until 9pm on Monday for southern parts of Wales. Forecasters said 50mm to 80mm of rain is \"likely to fall quite widely\" with some places \"seeing close to 100mm\". The Met Office added that \"fast flowing or deep floodwater is likely, causing danger to life\" and warned it was \"not safe to drive, walk or swim\" through such conditions. \"Given the recent wet weather and saturated ground, the likelihood of impacts is higher,\" the agency said. \"If you must travel, ensure you watch for possible danger and drive cautiously.\" Further yellow rain warnings are also currently in place for parts of northeast, northwest and southwest England, the East Midlands, the West Midlands and Wales. Most apply for much of Monday, but the warning for the North East of England and Yorkshire is in force until 3am on Tuesday. Read more from Sky News:Christmas strike by resident doctors to go aheadUS and China should collaborate over moon trips, says Tim Peake  Sky News meteorologist Dr Christopher England said the \"prolonged heavy rain on already saturated ground\" has led to the series of Met Office warnings. \"In Cumbria, there has been over 150mm of rain quite widely, with 360.6mm recorded at the Honister Pass - over a foot in old money - while Scotland has seen over 100mm in places,\" he said. \"Further rain moving in on Wednesday has led to another yellow warning in the South West, indicating the chance of some significant disruption there.\" It comes after the UK faced a series of similar warnings at the weekend."
    },
    {
        "title": "Brown University shooting victims named as new video footage released in search for gunman",
        "description": "Two students killed in a shooting at Brown University have been named.",
        "url": "https://news.sky.com/story/brown-university-shooting-victims-named-as-new-video-footage-released-in-search-for-gunman-13483911",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-fbi-brown-university_7111468.jpg?20251215222914",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 20:42:00",
        "Headline": "Authorities released a \"person of interest\" on Sunday after determining the evidence pointed \"in a different direction\". Police called on the public to help as they released a new video on Monday. ",
        "Content": " Two students killed in a shooting at Brown University have been named. Ella Cook, from Mountain Brook, Alabama, and Mukhammad Aziz Umurzokov, a citizen of Uzbekistan, were killed in Saturday's shooting, which also left nine wounded. The gunman opened fire inside a classroom in the engineering building, shooting more than 40 rounds from a 9mm handgun, a police official said. The attack took place as final exams were under way and sparked hours of chaos on the campus and in the surrounding neighbourhoods, leading to a frantic police search, with hundreds of officers involved. The following day, a \"person of interest\" was released from custody when police said the evidence pointed \"in a different direction\". New footage released CCTV released by Providence Police on Monday shows a man walking on the pavement on a road with cars driving past at 4.06pm. He appears to be dressed all in black, but his face is not visible. \"Right now, we don't have any evidence to suggest that it was more than that individual,\" Providence mayor Brett Smiley said after the release of the footage. Two handguns were recovered when the original person of interest was taken into custody and police also found two loaded 30-round magazines, a police official said. Read more from Sky News:Four charged over New Year's Eve bombTrump launches attack on Rob Reiner Investigators were not immediately sure how the gunman got inside the first-floor classroom, housed in a seven-storey complex. Police had announced early on Sunday that they had detained a person of interest at a Rhode Island hotel in connection with the attack and lifted a lockdown at the Ivy League school's campus. One video of the attack showed students in a library shaking and wincing as they heard loud bangs just before police entered the room to clear the building. During the lockdown, which was not lifted until Sunday, many students remained barricaded in rooms, while others hid behind furniture and bookshelves as police searched for the gunman. One of the nine wounded students has been released from the hospital, university president Christina Paxson said on Sunday. Seven others were in critical but stable conditions, and one was in a critical condition. Brown, the seventh-oldest higher education institution in the US, is one of the nation's most prestigious colleges, with around 7,300 undergraduates and more than 3,000 graduate students. The school cancelled all remaining classes and exams for the semester."
    },
    {
        "title": "European leaders back 'multinational force' to secure peace in Ukraine, as US commits to security guarantees",
        "description": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today.",
        "url": "https://news.sky.com/story/european-leaders-back-multinational-force-to-secure-peace-in-ukraine-as-us-commits-to-security-guarantees-13483879",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-berli-berlin_7111348.jpg?20251215204218",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-15 19:35:00",
        "Headline": "The leaders were optimistic after meeting in Berlin, alongside talks between Ukraine and the US. A US official said about 90% of issues were resolved.",
        "Content": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today. In a join statement, they heralded \"significant progress\" - boosted by a new US commitment to provide unspecified security guarantees to Ukraine. German Chancellor Friedrich Merz described the guarantees by the US as \"truly remarkable\". He said: \"This is a very important advancement that I greatly welcome.\" Adding to the positive mood music, US President Donald Trump said he believed \"we are closer now than we have been ever\" to agreeing a ceasefire for the deadliest conflict in Europe since the Second World War. The comments round off two days of talks in Berlin between Ukrainian and US envoys Steve Witkoff and Jared Kushner, and a separate meeting of European leaders in the German capital. Read more: UK's 'sons and daughters' need to be ready to fight However, Ukrainian President Volodymyr Zelenskyy called the talks on conceding territories to Russia \"painful\" and \"very difficult\". He told reporters in Berlin: \"Frankly speaking, we still have different positions.\"  Earlier, his security officials claimed to have dealt a lethal strike to a $400m (£299m) Russian submarine in the Black Sea - a claim that Russia rejected. \"The information from the Ukrainian special services about the alleged destruction of one of Russia's submarines is not true\", said the Black Sea Fleet command. Not a single ship or submarine of the Black Sea Fleet in the Novorossiysk base bay, nor their crews, were injured in the sabotage, the fleet command said. Back in Berlin, European leaders issued a joint statement on behalf of the leaders of Germany, Denmark, Finland, France, Italy, the Netherlands, Norway, Poland, Sweden and the UK, as well as the presidents of the European Council and the European Commission. The document said the leaders \"welcomed the close work between President Zelenskyy's and President Trump's teams, as well as European teams over the recent days and weeks\". \"They agreed to work together with President Trump and President Zelenskyy to get to a lasting peace, which preserves Ukrainian sovereignty and European security. \"Leaders appreciated the strong convergence between the United States, Ukraine and Europe.\" Outlining what they considered necessary security guarantees, the leaders said the \"multinational force\" should be made up of countries from the so-called Coalition of the Willing and \"supported by the US\". They also said they \"strongly support\" Ukraine joining the European Union, and that it should be able to maintain its armed forces at a level of 800,000. \"It will assist in the regeneration of Ukraine's forces, in securing Ukraine's skies, and in supporting safer seas, including through operating inside Ukraine.\" A US official said about 90% of issues between the warring parties had been resolved and that they believed Russia would be open to Ukraine joining the European Union, and to the security guarantees in the deal."
    },
    {
        "title": "JetBlue passenger plane and US Air Force aircraft in near miss by Venezuela",
        "description": "A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording.",
        "url": "https://news.sky.com/story/jetblue-passenger-plane-and-us-air-force-aircraft-in-near-miss-by-venezuela-13483942",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jetblue-us-air-force_7111465.jpg?20251215222232",
        "type": "Home",
        "Author": "Callum Tennant, news reporter",
        "Date Published": "2025-12-15 21:40:00",
        "Headline": "The US Air Force plane was reported to be flying with its transponder turned off in an incident described as \"outrageous\" by the JetBlue pilot. ",
        "Content": "By Callum Tennant, news reporter  A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording. JetBlue Flight 1112 was flying to New York from the Caribbean nation of Curacao and was flying about 40 miles off the coast of Venezuela when the Airbus A320 reported encountering the air force refuelling tanker. The air force pilot was within a few miles of the plane and at the same altitude. The JetBlue pilot said on the recording: \"We almost had a mid-air collision up here. \"They passed directly in our flight path... They don't have their transponder turned on. It's outrageous.\" The air force jet then entered Venezuelan airspace, the JetBlue pilot said. A JetBlue spokesperson said the airline had reported this incident to federal authorities and will participate in any investigation. They added that: \"Our crew members are trained on proper procedures for various flight situations, and we appreciate our crew for promptly reporting this situation to our leadership team.\" US southern command - responsible for US military operations in Central America, South America, and the Caribbean - said it was aware of the incident and reviewing the matter. They added that: \"Safety remains a top priority, and we are working through the appropriate channels to assess the facts surrounding the situation.\" Last month, the Federal Aviation Administration (FAA) warned major airlines of a \"potentially hazardous situation\" when flying over Venezuela and urged them to exercise caution.  Major airlines from around the world have halted flights as tensions have worsened and US President Donald Trump has threatened to begin hitting land targets in Venezuela. The incident follows a fatal accident between a US military helicopter and an American Airlines flight in January that left 67 dead. That crash, which happened in the heart of Washington DC, highlighted the importance of clear communication between civil and military aircraft when operating in the same area. US military build-up in Southern Caribbean  The close call in the Caribbean happened as the US continues its military build-up in the area as President Trump campaigns to oust Venezuela's President Nicolas Maduro. The increase in US military presence includes flights by US bombers near Venezuela, the arrival of the world's largest aircraft carrier and new agreements for US military assets to transit neighbouring countries. On Monday, Trinidad and Tobago became the latest country to grant approval for US military aircraft to transit its airports in the coming weeks, according to the country's foreign ministry. All of these moves are aimed at increasing US pressure on Venezuela's government. Last week, US forces seized an oil tanker off the coast of Venezuela, escalating tensions between Washington and Caracas. Oil exports from Venezuela have fallen significantly since the ship's seizure, according to shipping data and maritime sources. Read more:The US-Venezuela crisis explainedWho is Maria Corina Machado? The seizure followed a large US naval build-up in the region, which has seen the US launch strikes against multiple boats purported to be smuggling drugs to America over the past few months. The legality of such moves has been questioned but has not prevented their repeated use. It is reported that Venezuela's opposition leader Maria Corina Machado escaped with US help to the Caribbean Island of Curacao during a daring escape from her country - before arriving in Norway. Pressed several times on whether she supported a possible US invasion of Venezuela to overthrow Nicolas Maduro, she would not commit outright but said the country has already been invaded by Russia, Iran and terrorist groups like Hezbollah."
    },
    {
        "title": "Get ready to fight: Armed forces chief issues stark warning as Russian threat grows",
        "description": "There is a growing risk that Russia could attack the UK, and the nation's \"sons and daughters\" need to be ready to fight, the head of Britain's armed forces has said.",
        "url": "https://news.sky.com/story/uks-sons-and-daughters-need-to-be-ready-to-fight-amid-growing-russian-threat-says-head-of-armed-forces-13483860",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-putin-british-army_7111571.jpg?20251216002150",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-15 18:31:00",
        "Headline": "In an extraordinarily blunt intervention, Air Chief Marshal Sir Richard Knighton warned that Russia's military strength is increasing and is something to fear, with Russian troops now battle-hardened after spending the past nearly four years waging a full-scale war in Ukraine.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  There is a growing risk that Russia could attack the UK, and the nation's \"sons and daughters\" need to be ready to fight, the head of Britain's armed forces has said. In an extraordinarily blunt intervention, Air Chief Marshal Sir Richard Knighton warned that Russia's military strength is increasing and is something to fear, with Russian troops now battle-hardened after spending the past nearly four years waging a full-scale war in Ukraine. He said the UK's armed forces would always be the first line of defence alongside the rest of the NATO alliance, but the whole of society must also play a part in rebuilding resilience. The chief of the defence staff said it is important to be honest with \"families and households\" across the UK about what it means to be prepared for \"an array of real, physical threats\". UK's 'sons and daughters' must be ready Serving up a sombre reality check, Air Chief Marshal Knighton said he agreed with his French counterpart, General Fabien Mandon, who said last month that France must be ready for the possibility of losing its children in a potential war with Russia. \"The situation is more dangerous than I have known during my career, and the price of peace is rising,\" the British defence chief said. \"Our response needs to go beyond simply strengthening our armed forces. It needs a whole of nation response that builds our defence industrial capacity, grows the skills we need, harnesses the power of the institutions we will need in wartime and ensures and increases the resilience of society and the infrastructure that supports it.\" He continued: \"Sons and daughters. Colleagues. Veterans. …will all have a role to play. \"To build. To serve. And if necessary, to fight. And more families will know what sacrifice for our nation means.\"  Most people in the UK, though, no longer have direct experience of the armed forces thanks to the peace that followed the end of the Cold War almost 35 years ago. The military chief noted that it was 65 years ago this month since the last national service call-ups took place, and 80 years since the end of the Second World War. But he indicated that the kind of national defence and resilience that was once second nature to UK society up until the collapse of the Soviet Union needs to return. He said that while there was only deemed by defence analysts to be a \"remote\" chance of up to a 5% of Russia launching a \"significant direct attack or invasion\" against the UK, this \"does not mean the chances are zero\". Russian threat 'worsening' Air Chief Marshal Knighton said: \"My point is that none of us can say with any certainty what the absolute risk might be. And even though simple binary statements might be easy for people to engage with, they risk instilling panic or complacency. \"What really matters is the trend. Are the chances of conflict growing? \"And here, I think the evidence is clear that the trend, from Russia in particular, is worsening, and that is the key argument for action.\" Turning to the capability of the Russian armed forces, despite being locked in a major war against Ukraine, he said their \"hard power is growing quickly\".  \"Over the past 20 years, Russia has delivered significant defence reform and investment into what were weak and hollowed-out armed forces,\" he added. \"The Russian armed forces are now more than 1.1 million strong, consuming more than seven per cent of GDP, and around 40% of government spending, which is a sum that has more than doubled over the past decade.\" By contrast, the UK army is a little over 70,000 soldiers, with the government only committed to increasing defence spending to 2.5% of GDP from 2.3% by 2027. Russian power 'something to fear' \"We should be under no illusions that Russia has a massive, increasingly technically sophisticated, and now, highly combat-experienced, military,\" the military chief said. He described how Russia is \"developing new and destabilising weapons systems such as nuclear-armed torpedoes and nuclear-powered cruise missiles putting nuclear weapons in space. So it is absolutely clear that Russia's hard power is something to fear, but what about Russia's intent to use it?\" The military chief said the war in Ukraine and Russia's willingness to target its neighbouring states show it \"wishes to challenge, limit, divide and ultimately destroy NATO\". But he acknowledged this threat is not yet felt in the UK as it is in countries that share physical land borders with Russia. In a sign that he is seeking a more rapid increase in defence spending, he said Germany expects to spend 3.5% of GDP on defence by 2029, while Poland is already at 4.2%. \"And we have seen just in the past few weeks France and Germany return to a form of national service.\" Read more from Sky News:Russia trying to 'bully' UK and alliesPutin may exploit British soldier's death He continued: \"In reality, other than proximity, the threat in the UK isn't really any different to the threat in Germany, for example. \"Unless we are able to raise awareness and stimulate the conversation with society about the risks, we can't expect the rest of government, society, and industry to act or bear the costs.\" The defence chief called out a podcast series by Sky News and Tortoise called The Wargame, which simulates a Russian attack on the UK, as an example of efforts in the media to raise public awareness.  Building on the success of the highly acclaimed podcast The Wargame, Sky News presents The Wargame: Decoded - a one-off live event that takes you deep inside the minds of the wargame's participants. Discover how they tackled the toughest challenges, the decisions they made under intense pressure, and even experience key moments of the game for yourself. Click here to get tickets. Sky News' Deborah Haynes will guide the conversation with Sir Ben Wallace, Robert Johnson, Jack Straw, Amber Rudd, Keir Giles and General Sir Richard Barrons - real-life military chiefs, former government officials and leading experts. Together, they will unpack their experiences inside The Wargame, revealing the uncertainty, moral dilemmas and real-world pressures faced by those who must make decisions when the nation is under threat. Join us for this unique event exploring how the UK might respond in a moment of national crisis and get a rare, unfiltered glimpse into how prepared the country truly is for war."
    },
    {
        "title": "Liverpool parade attacker told police he'd 'ruined' his family's life",
        "description": "Liverpool parade attacker Paul Doyle told police he'd \"ruined\" his family's life after driving into more than 100 people at a Premier League title parade, a court has heard.",
        "url": "https://news.sky.com/story/hero-pedestrian-climbed-into-car-of-liverpool-parade-attacker-to-stop-him-court-hears-13483773",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-doyle-liverpool_7092383.jpg?20251126114044",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-15 14:46:00",
        "Headline": "Paul Doyle is due to be sentenced on Tuesday after pleading guilty to 31 offences relating to seriously injuring people during the victory parade in May.",
        "Content": " Liverpool parade attacker Paul Doyle told police he'd \"ruined\" his family's life after driving into more than 100 people at a Premier League title parade, a court has heard. Monday's sentencing hearing was told the 54-year-old was \"in a rage\" and his \"anger had completely taken hold of him\" when he used his car as a \"weapon\" to plough through more than 100 people celebrating Liverpool's title win back in May. The court heard he told officers: \"I've just ruined my family's life.\" Doyle is due to be sentenced today after pleading guilty to 31 offences relating to seriously injuring people during the victory parade on 26 May. Doyle, described as a \"family man\" by prosecutors, wept as footage of the horrific rampage was shown to the city's crown court several times on Monday. 'Hero' pedestrian climbed into car Paul Greaney KC, prosecuting, described the actions of Daniel Barr, who he called the \"hero\" of the day. Mr Barr, an ex-soldier, had \"bravely\" jumped into the back of Doyle's Ford Galaxy and placed the vehicle into park. He was walking up Water Street when he noted the defendant's Ford Galaxy in the distance, said Mr Greaney, noting the crowd's attitude changed from \"joyous to desperate\". Doyle's vehicle then stopped next to Mr Barr \"all of a sudden\". \"Daniel Barr instinctively pulled open the rear passenger-side door and climbed in. He did so with the intention of stopping the driver,\" the prosecutor said. Mr Barr leaned forward and moved the gear into \"park\" and \"held it as hard as he could\". Mr Greaney added: \"The Galaxy did not stop immediately, but in the end it did.\" The prosecutor said police officers forced Doyle into a police van after the attack. This, he said, was done \"in the midst of a hostile crowd\", adding that officers' behaviour was both \"brave and effective\". When Doyle was securely in the van, Mr Greaney said police body-worn camera footage picked up him saying: \"I've just ruined my family's life.\" Read more from Sky News:Christmas doctors' strike to go aheadRob Reiner spoke to Eric Idle before he died Doyle admitted dangerous driving, affray, 17 charges of attempting to cause grievous bodily harm (GBH) with intent, nine counts of causing GBH with intent, and three counts of wounding with intent last month. He had previously denied the offences, which relate to 29 victims aged between six months old and 77 years old. 'Truly shocking' The court was shown dashcam footage taken from the defendant's car showing the attack. Mr Greaney warned the court: \"What we are about to display on the screens is truly shocking.\" There were audible gasps in the courtroom as the footage played. Doyle could be heard repeatedly shouting at pedestrians to \"move out the f****** way\" as he drove through crowds. Consistently using his vehicle's horn, people could be seen trying to jump out of the way, with some forced on to the bonnet of the car. \"F****** pr****,\" Doyle shouts as the footage continues. By the end of the footage, people begin to attempt to run up to the vehicle. When the car stops, one man shouts, \"get the f*** out of the car\". Mr Greaney also detailed some of the injuries sustained by victims on the day of the attack. One woman, aged 66, spent four nights in hospital after breaking six ribs and suffering fractures to her fingers on her left hand and her left wrist. Another woman, aged 77 at the time, spent 27 days in hospital. The prosecutor said she suffered a fractured left forearm, fractured left collar bone, three fractured ribs, a fractured pelvis, a broken nose, as well as multiple abrasions and bruising to her head, knees and back. Another victim, who was 17, suffered bruising to their legs, shoulder and had a small fracture to their tibia. After suffering wound infections, it took two months before the victim regained mobility, the prosecutor added. The victims of Paul Doyle's attack during Liverpool's Premier League victory parade have spoken of how they have suffered from \"emotional and psychological injury\" as well as \"frequent flashbacks\". A total of 78 people submitted victim statements to the court, in which they described how the \"best day ever\" soon became the worst. Doyle sobbed as the words of one victim, a 12-year-old boy, were read out by prosecutor Philip Astbury at Liverpool Crown Court. The child, who cannot be named for legal reasons, said: \"I found myself on the floor having been hit by a car I did not see coming, I have never felt so scared before in my life.\" The boy’s mother said in her statement her heart sank when she saw her child inert on the floor. She said the incident \"caused me much anxiety having to watch my son deal with the pain, the frustration, him feeling down and isolated from his friends in school, the nightmares and the after-effects on him\". The boy's mother added: \"The sight of my son lying motionless on the road, not moving for those few seconds, and the sound of the car hitting people will live with me forever.\" Another mother said she thought her baby son had died after his pram was catapulted into the air after being struck by Doyle's vehicle, adding that she thought she would \"be next\". Sheree Aldridge, 37, said her partner Dan Eveson had proudly dressed their six-month-old son Teddy Eveson in his Liverpool FC shirt that day and \"was excited to share this moment\" with him. She said in the statement: \"In that moment I thought I was going to die. I didn't know where Dan and Teddy was. \"I felt an overwhelming pain in my leg and looked up to see Teddy's pushchair on its side further up the road. I thought my Teddy was dead. \"I thought I was next. I thought my children would grow up without a mother.\" The court also heard how a third mother, whose 13-year-old son was injured, said she has trouble sleeping due to flashbacks and has visions of her son's \"terrified face\". Mr Greaney said some people at the scene on 26 May \"thought that what was taking place was a terrorist attack\". However, the prosecution ruled out that the defendant's actions were \"driven by ideology\". Police investigations showed there was no problem with the vehicle, and Doyle was completely sober and \"free of all drugs\", Mr Greaney said. \"The truth is a simple one - Paul Doyle just lost his temper in his desire to get to where he wanted to get to. \"In a rage, he drove into the crowd,\" he added. Doyle was arrested at the scene in Water Street just after 6pm and charged later that week. The youngest victim was six-month-old Teddy Eveson, whose parents later told media he was thrown about 15ft down the road in his pram when the crash happened. Doyle, of Croxteth, Liverpool, admitted attempting to cause grievous bodily harm to the baby. Five other children, whom Doyle either injured or attempted to injure, cannot be named for legal reasons."
    },
    {
        "title": "Russia trying to 'bully' UK and allies with attacks under threshold of all-out war, MI6 chief says",
        "description": "Russia is trying to \"bully, fearmonger and manipulate\" the UK and its allies with attacks under the threshold of all-out war, the new head of MI6 has said.",
        "url": "https://news.sky.com/story/frontline-with-russia-is-everywhere-even-in-the-minds-of-our-citizens-mi6-chief-says-13483818",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-vladimir-yakushev_7110983.jpg?20251215172657",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-15 16:21:00",
        "Headline": "Blaise Metreweli said Britain is \"operating in a space between peace and war\" and that everyone has a responsibility to understand the dangers.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Russia is trying to \"bully, fearmonger and manipulate\" the UK and its allies with attacks under the threshold of all-out war, the new head of MI6 has said. Blaise Metreweli, the first female chief of the Secret Intelligence Service (SIS), said Britain was \"operating in a space between peace and war\" and that everyone has a responsibility to understand the dangers because \"the frontline is everywhere\". In her first big speech on Monday, she also focused on Vladimir Putin's devastating war in Ukraine, accusing him of \"dragging out negotiations\" on a peace deal and warning that Kyiv's fate is \"fundamental not just to European sovereignty and security but to global security\". Offering her view on the evolution of global security threats, Ms Metreweli underlined the transformative role of technology, from artificial intelligence to quantum computing. She said control over such advanced technologies is shifting from states to corporations and even individuals, making the balance of global power more \"diffuse, more unpredictable\". The spymaster did not name anyone.  However, innovators such as Elon Musk are becoming increasingly influential, with their technologies such as his Starlink satellites and his social media site X. The boss of MI6 was speaking at her agency's headquarters in London, though she said that the main work of her spies was carried \"many miles away from this place - out of sight, hidden from the world, undercover, recruiting and running agents who choose to place their trust in us, sharing secrets to make the UK and the world safer\". She warned the world was \"more dangerous and contested now than it has been for decades\". Read more from Sky News:Who were the suspected gunmen in Bondi Beach terror attack?Jimmy Lai found guilty of national security offences in Hong Kong The spy chief said: \"Conflict is evolving and trust eroding, just as new technologies spur both competition and dependence. \"We are being contested from sea to space - from the battlefield to the boardroom. And even our brains as disinformation manipulates our understanding of each other and ourselves… We are now operating in a space between peace and war. \"This is not a temporary state or a gradual evolution. Our world is being actively remade with profound implications for national and international security.\" Breaking with a tradition by previous chiefs of offering a view on a range of threats when speaking publicly, Ms Metreweli said she was choosing to focus on Russia. \"We all continue to face the menace of an aggressive, expansionist and revisionist Russia, seeking to subjugate Ukraine and harass NATO,\" she said.  On the conflict, she said Putin was \"dragging out negotiations and shifting the cost of war on to his own population\". Her comments come as Donald Trump is attempting to broker a peace deal between Moscow and Kyiv. General Oleksandr Syrskyi, the head of Ukraine's armed forces, told Sky News in an interview earlier this month that he believed Putin was using the US push for negotiations as \"cover\" while Russian troops attempted to seize more land by force.  The MI6 boss said the UK's support for Ukraine would endure regardless of Moscow's stalling actions. She also flagged a growing wave of \"grey zone\" hostilities - deliberately carried out under the threshold of conventional armed conflict - that she attributed to Moscow. \"It's important to understand their [Russia's] attempts to bully, fearmonger and manipulate because it affects us all,\" she said. \"I am talking about cyber attacks on critical infrastructure. Drones buzzing airports and bases. Aggressive activity in our seas, above and below the waves. State-sponsored arson and sabotage. Propaganda and influence operations that crack open and exploit fractures within societies.\" While she did not specify any particular incidents, there have been a spate of mysterious drone sightings in Denmark, Germany and Sweden; while a Russian spy ship was spotted off the coast of Scotland and acts of arson and sabotage have been carried out in the UK, such as a blaze at a warehouse in east London that was providing aid to Ukraine. Drawing attention to another method to attack a country and its people, Ms Metreweli underlined how information is being weaponised, with falsehoods spread online that are designed to erode trust in a society and amplify divisions. \"The export of chaos is a feature not a bug in this Russian approach to international engagement and we should be ready for this to continue until Putin is forced to change his calculus,\" she said.  MI6, she said, is adapting to respond to the evolving threats. But unusually Ms Metroweli also said the wider British public had a role to play, such as with schools helping to educate children to spot disinformation on social media and to check sources of news \"and be alive to those algorithms that trigger intense reactions like fear\". She added: \"It also means everyone in society really understanding the world we are in - a world where… the frontline is everywhere. Online, on our streets, in our supply chains, in the minds and on the screens of our citizens.\" Building on the success of the highly acclaimed podcast The Wargame, Sky News presents The Wargame: Decoded - a one-off live event that takes you deep inside the minds of the wargame's participants. Discover how they tackled the toughest challenges, the decisions they made under intense pressure, and even experience key moments of the game for yourself. Click here to get tickets. Sky News' Deborah Haynes will guide the conversation with Sir Ben Wallace, Robert Johnson, Jack Straw, Amber Rudd, Keir Giles and General Sir Richard Barrons - real-life military chiefs, former government officials and leading experts. Together, they will unpack their experiences inside The Wargame, revealing the uncertainty, moral dilemmas and real-world pressures faced by those who must make decisions when the nation is under threat. Join us for this unique event exploring how the UK might respond in a moment of national crisis and get a rare, unfiltered glimpse into how prepared the country truly is for war."
    },
    {
        "title": "Drivers fined after speed camera issue across major A-roads and motorways",
        "description": "Some drivers have been incorrectly fined for speeding due to an issue with variable speed cameras in England, National Highways has said. ",
        "url": "https://news.sky.com/story/drivers-fined-after-speed-camera-issue-across-major-a-roads-and-motorways-13483868",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-speed-camera-road_7111283.jpg?20251215195148",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-15 19:24:00",
        "Headline": "Around 2,650 \"total erroneous camera activations\" have been identified on impacted roads since 2021, National Highways said. ",
        "Content": "Some drivers have been incorrectly fined for speeding due to an issue with variable speed cameras in England, National Highways has said.  The government agency said it was implementing a fix to address an anomaly detected in the way some variable speed cameras interact with signs on some A-roads and motorways. This has resulted in a \"very small number of people incorrectly facing enforcement action for speeding,\" the agency said, as it offered an apology to those affected. A National Highways spokesperson said: \"The anomaly has meant there was, at times, a slight delay between cameras and variable speed signs, leading to some drivers being incorrectly detected as speeding after the limit had changed.\" As a result, the agency said it had identified around 2,650 \"total erroneous camera activations\" on impacted roads since 2021, noting this was the equivalent of fewer than two a day. It said not all activations were enforced, so the amount of people impacted will be lower than this. And to put this into context, said the agency, there have been more than six million total activations on the impacted roads during this period. \n                  Driving test changes announced - with more focus on faster and rural roads to cut deaths\n                 \n                  New campaign backs introduction of graduated driving licences\n                 \n                  Seven red flags your mechanic is ripping you off - and what you can do about it\n                 The anomaly impacts just 10% of the Strategic Road Network, which is made up of motorways and major A-roads in England, according to the agency. The spokesperson added: \"National Highways apologises to anyone affected. They will be reimbursed and have points removed from their licence where relevant. \"Steps will be taken to remedy any incorrect enforcement action, and anybody affected will be contacted directly.\" Read more from Sky News:Heavy rain and flooding to hit parts of UKChristmas strike by resident doctors to go ahead National Highways said it has developed a data check to ensure nobody will now be prosecuted incorrectly, and is liaising with police on its implementation. The agency said enforcement remains in place and anybody breaking the law could face prosecution. It also said it will be increasing other safety measures, and policing will continue to enforce speeding and other offences on its road network. The agency said it would swiftly ensure that any incorrect penalties are rectified. National Highways Chief Executive Nick Harris said: \"Safety is our number one priority and we have developed a fix for this technical anomaly to maintain the highest levels of safety on these roads and make sure no one is wrongly prosecuted. \"All drivers should continue observing the posted speed limits as normal. Anyone who has been impacted will be contacted by the relevant police force.\""
    },
    {
        "title": "Angela Rayner calls on MPs to sit 'through the night' to get workers' rights bill through parliament",
        "description": "Angela Rayner has issued an angry call to MPs to sit \"through the night\" to stop hereditary peers delaying her flagship employment rights bill.",
        "url": "https://news.sky.com/story/angela-rayner-calls-on-mps-to-sit-through-the-night-to-get-workers-rights-bill-through-parliament-13483954",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-angela-rayner-resignation_7058347.jpg?20251022134544",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-12-15 22:10:00",
        "Headline": "The former deputy prime minister's flagship bill is being delayed by peers with just days to go before the Christmas break.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Angela Rayner has issued an angry call to MPs to sit \"through the night\" to stop hereditary peers delaying her flagship employment rights bill. In an outburst at the start of the latest \"ping pong\" between the Lords and Commons, she said: \"What's wrong with protecting people from unfair dismissal?\" The former deputy prime minister hit out at the delaying tactics of the House of Lords, with the clock ticking only days before parliament's Christmas recess. The bill now goes back to the Lords on Tuesday, when ministers hope peers will drop their opposition so the bill can receive royal assent by the time parliament rises on Thursday.  Ms Rayner's attack on hereditary peers followed a government defeat in the Lords by 24 votes last week, just days before Sir Keir Starmer created 25 new Labour peers. \"What message does this send to the British public, when 33 hereditary peers have tried to defeat the government by 24 votes on a manifesto promise on sick pay, for example, which will miss the deadline for April for some of the lowest earners from some of the wealthiest?\" she declared. \"Shouldn't we get on, go through the night if we have to, and get this bill passed?\" And employment minister Kate Dearden told MPs: \"We have been in ping pong for far too long, and further delay is not in anyone's best interest.\"   At the end of an hour-long debate, MPs voted by 311 votes to 96, a majority of 215, to remove a cap on unfair dismissal compensation, overturning a vote in the Lords last week. In its attempts to get the bill through the Lords, ministers have abandoned day one protection against unfair dismissal and, after a deal with trade unions, replaced it with a six-month qualifying period. But at the same time the government introduced an 11th hour measure to scrap compensation caps for unfair dismissal, which is currently 52 weeks' pay or £118,223, whichever is lower. Read more: Starmer insists budget leaks and leadership speculation did not come from him Shadow business secretary Andrew Griffith, who has led Tory opposition to the bill, attacked the removal of a cap. \"It wasn't in the manifesto, it wasn't in the bill, it wasn't in the impact assessment,\" he protested. Earlier, in a boost for the government, six business groups urged peers to back down and end the parliamentary \"ping pong\" between the Commons and the Lords. The groups, including the Confederation of British Industry (CBI) and the British Chamber of Commerce (BCC), fear the six-month unfair dismissal compromise agreed with the unions could be at risk. \"To avoid losing the six-month qualifying period, we therefore believe that now is the time for parliament to pass the bill,\" they urged in a letter to Business Secretary Peter Kyle. Mr Kyle said \"all parties... have made difficult but necessary compromises to bring this bill forward\" and urged \"everyone\" to recognise business groups and trade unions want it passed \"without further delay\"."
    },
    {
        "title": "Christmas strike by resident doctors to go ahead as flu cases in hospitals surge",
        "description": "A five-day strike involving tens of thousands of doctors in England will go ahead as planned, the British Medical Association (BMA) has said.",
        "url": "https://news.sky.com/story/christmas-strike-by-resident-doctors-to-go-ahead-as-flu-cases-in-hospitals-surge-13483578",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-resident-doctors-strike_7097772.jpg?20251201164917",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-15 08:22:00",
        "Headline": "The five days of action are confirmed despite the NHS facing the \"worst case scenario\" after flu cases rose by more than 55% in a week.",
        "Content": " A five-day strike involving tens of thousands of doctors in England will go ahead as planned, the British Medical Association (BMA) has said. The union said its resident doctor members had rejected the government's offer to call off the strikes, and will stop work between 17 and 22 December. Announcing the move, the BMA said 83.2% of those who took part in a poll rejected the offer, with a turnout of 65.34%. The news comes after NHS England said it was facing the \"worst case scenario\" following a rise in flu cases of more than 55% in a week. Hospitals in England are said to be facing record levels of the disease for the time of year. Live updates: Doctors to strike  Health Secretary Wes Streeting accused the union of \"shocking disregard for patient safety\" for choosing to stage a walkout \"to inflict damage on the NHS at the moment of maximum danger\". He said the strikes were \"self-indulgent, irresponsible and dangerous\" - and said doctors would be \"abandoning\" patients. Mr Streeting said the BMA had refused to postpone strikes to January and \"help patients and other NHS staff cope over Christmas\". \"There is no need for these strikes to go ahead this week, and it reveals the BMA's shocking disregard for patient safety,\" he added. But the BMA said the strike was \"still entirely avoidable\" and that it was \"willing to work to find a solution\".  BMA resident doctors committee chair Dr Jack Fletcher said: \"The health secretary should now work with us in the short time we have left to come up with a credible offer to end this jobs crisis and avert the real terms pay cuts he is pushing in 2026.\" The union said it remained \"committed to ensuring patient safety\" and it would be in \"close contact\" with NHS England during the strike action to \"address safety concerns if they arise\". The government's offer had included a fast expansion of specialist training posts as well as covering out-of-pocket expenses such as exam fees. It did not include extra pay, but had offered to extend the union's strike mandate to enable any walkout to be rescheduled to January.  'Abandoning patients in hour of greatest need' Mr Streeting said the strike \"goes against everything\" a medical career is about. He said: \"The government's offer would have halved competition for jobs and put more money in resident doctors' pockets, but the BMA has again rejected it because it doesn't meet their ask of a further 26% pay rise. \"Resident doctors have already had a 28.9% pay rise - there is no justification for striking just because this fantasy demand has not been met. \"I am appealing to ordinary resident doctors to go to work this week. There is a different magnitude of risk in striking at this moment. \"Abandoning your patients in their hour of greatest need goes against everything a career in medicine is meant to be about.\" Health correspondent Wes Streeting took a risky line of attack. He put an offer of more jobs to the BMA. And while that offer was being considered he went on the offensive.  He warned the NHS would collapse if the resident doctors carried on with their strikes during a record flu season. He repeated that line throughout the weekend when the pools were open and voting had begun. The BMA responded by accusing Wes Streeting of “scaremongering”.  Senior NHS consultants gave interviews saying flu season was bad, but to be expected, and with the same contingency planning that happens every summer (off flu season) the NHS would cope. The BMA will argue that Mr Streeting can make the resident doctors his scapegoat for an NHS that will struggle again this winter. They reject that idea completely. And now they have rejected his offer.  Hospital leaders said the strike would come as the NHS \"needs all hands on deck\" - and called the action \"bitterly disappointing\". Daniel Elkeles, chief executive of NHS Providers, said: \"This vote is a bitter pill which will inevitably result in harm to patients and damage to the NHS. \"We had hoped that the government's recent updated offer would be enough to head off another walkout at a time when so many people are suffering with flu, and the NHS needs all hands on deck.\" Rory Deighton, acute and community care director at the NHS Confederation, said: \"It is bitterly disappointing that the BMA has rejected this offer and chosen to continue with hugely disruptive strikes.\" Public support for the strikes is low, according to a YouGov poll released last week. The results showed 58% of those asked either somewhat or strongly opposed the industrial action, while 33% somewhat or strongly supported it."
    },
    {
        "title": "Sir Keir Starmer insists budget leaks and leadership speculation did not come from him",
        "description": "Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings.",
        "url": "https://news.sky.com/story/sir-keir-starmer-insists-budget-leaks-and-leadership-speculation-did-not-come-from-him-13483817",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-liaison-committee-keir-starmer_7111014.jpg?20251215144118",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-15 16:17:00",
        "Headline": "There were several leaks about the budget ahead of its delivery, and there have been claims other cabinet ministers are looking to take the PM's job.",
        "Content": " Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings. The prime minister told parliament's liaison committee a leak to the Financial Times 13 days before the budget, revealing a proposal to increase income tax had been dropped, was \"unacceptable\". \"It was not a briefing that was signed off by me or any of my ministers or officials,\" he told the committee, which is made up of the chairs of select committees. \"It was unacceptable.\" Politics latest: Starmer '10 out of 10' gutted about doctors' strike Asked about claims certain cabinet members are trying to replace Sir Keir as prime minister, he said: \"I can say, hand on heart, that none of it comes from me or is encouraged by me.\" He said briefing against cabinet ministers is \"completely unacceptable\" and said he has \"made that repeatedly clear to my staff, to the cabinet\". \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 The prime minister said he has put in place \"a number of procedures\" to \"give me a level of assurance\" that ministers, his team and staff are not the ones leaking. He said he has \"no reason to believe\" anybody in Number 10 leaked the plan to no longer increase income tax. Other budget details were also leaked, including a pay-per-mile levy on electric vehicles and a tourist tax. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Keir said he will wait for an inquiry into the budget leaks to conclude, but vowed: \"I'll get to the bottom of these leaks.\" Asked if he would be \"ruthless\" with whoever was responsible, he said: \"I want to stop these leaks.\" He said he would \"take action\" against individuals and said, although it is \"very difficult\" to find out the source, he has previously shown how he has \"acted accordingly\" during his time as prime minister, leader of the opposition and director of public prosecutions. Last week, Chancellor Rachel Reeves faced similar questioning at the Treasury select committee. She said the leaks were \"very damaging\" and \"we cannot allow this to happen again\". Ms Reeves said a review of Treasury processes is taking place and she has brought in the National Centre for Cyber Security to carry out a forensic examination of IT systems, after the Office for Budget Responsibility's assessment of the budget was accessible before she had announced it."
    },
    {
        "title": "European leaders back 'multinational force' to secure peace in Ukraine, as US commits to security guarantees",
        "description": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today.",
        "url": "https://news.sky.com/story/european-leaders-back-multinational-force-to-secure-peace-in-ukraine-as-us-commits-to-security-guarantees-13483879",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-berli-berlin_7111348.jpg?20251215204218",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-15 19:35:00",
        "Headline": "The leaders were optimistic after meeting in Berlin, alongside talks between Ukraine and the US. A US official said about 90% of issues were resolved.",
        "Content": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today. In a join statement, they heralded \"significant progress\" - boosted by a new US commitment to provide unspecified security guarantees to Ukraine. German Chancellor Friedrich Merz described the guarantees by the US as \"truly remarkable\". He said: \"This is a very important advancement that I greatly welcome.\" Adding to the positive mood music, US President Donald Trump said he believed \"we are closer now than we have been ever\" to agreeing a ceasefire for the deadliest conflict in Europe since the Second World War. The comments round off two days of talks in Berlin between Ukrainian and US envoys Steve Witkoff and Jared Kushner, and a separate meeting of European leaders in the German capital. Read more: UK's 'sons and daughters' need to be ready to fight However, Ukrainian President Volodymyr Zelenskyy called the talks on conceding territories to Russia \"painful\" and \"very difficult\". He told reporters in Berlin: \"Frankly speaking, we still have different positions.\"  Earlier, his security officials claimed to have dealt a lethal strike to a $400m (£299m) Russian submarine in the Black Sea - a claim that Russia rejected. \"The information from the Ukrainian special services about the alleged destruction of one of Russia's submarines is not true\", said the Black Sea Fleet command. Not a single ship or submarine of the Black Sea Fleet in the Novorossiysk base bay, nor their crews, were injured in the sabotage, the fleet command said. Back in Berlin, European leaders issued a joint statement on behalf of the leaders of Germany, Denmark, Finland, France, Italy, the Netherlands, Norway, Poland, Sweden and the UK, as well as the presidents of the European Council and the European Commission. The document said the leaders \"welcomed the close work between President Zelenskyy's and President Trump's teams, as well as European teams over the recent days and weeks\". \"They agreed to work together with President Trump and President Zelenskyy to get to a lasting peace, which preserves Ukrainian sovereignty and European security. \"Leaders appreciated the strong convergence between the United States, Ukraine and Europe.\" Outlining what they considered necessary security guarantees, the leaders said the \"multinational force\" should be made up of countries from the so-called Coalition of the Willing and \"supported by the US\". They also said they \"strongly support\" Ukraine joining the European Union, and that it should be able to maintain its armed forces at a level of 800,000. \"It will assist in the regeneration of Ukraine's forces, in securing Ukraine's skies, and in supporting safer seas, including through operating inside Ukraine.\" A US official said about 90% of issues between the warring parties had been resolved and that they believed Russia would be open to Ukraine joining the European Union, and to the security guarantees in the deal."
    },
    {
        "title": "Who were the suspected gunmen in Bondi Beach terror attack?",
        "description": "A father and son have been identified as the suspected gunmen in the terror attack on a Jewish event in Bondi Beach which killed at least 15 people.",
        "url": "https://news.sky.com/story/what-we-know-about-suspected-shooters-in-bondi-beach-attack-13483604",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-bondi-shooting_7110347.jpg?20251215102810",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-15 09:56:00",
        "Headline": "More than 1,000 people were celebrating the Jewish festival of Hanukkah on the beach on Sunday evening when two gunmen opened fire from a bridge, killing at least 15 people.",
        "Content": " A father and son have been identified as the suspected gunmen in the terror attack on a Jewish event in Bondi Beach which killed at least 15 people. More than 1,000 people were celebrating the Jewish festival of Hanukkah on the beach on Sunday evening when two people opened fire on them. Those killed in the attack range from 10 years of age to 87, including a rabbi and a Holocaust survivor, while 38 others have been injured. One of the alleged gunmen has been named by New South Wales (NSW) police as 24-year-old Naveed Akram, while the other has been identified as his 50-year-old father Sajid Akram. How did they carry out the attack? Footage shows the gunmen start firing into the crowd from a footbridge that leads over a car park to the beach. Sky News has identified from the footage that the younger gunman was using a rifle, while the older one was using a semi-automatic shotgun.  Police commissioner Mal Lanyon said officers searched two properties in connection with the suspects and found that the father had six firearms licenced to him. Follow live: 15 people and gunman killed in shooting More footage from the scene showed that a man, later identified as 43-year-old fruit shop owner Ahmed al Ahmed, tackled and disarmed one of the gunmen, believed to be the father Sajid, before pointing his own weapon at him, which was empty.  The footage then showed the disarmed gunman running towards where the other gunman was located. Mr Ahmed was shot twice in the incident and required surgery, his family said. The shooting is estimated to have gone on for roughly 10 minutes from 6.47pm. Eventually, the police took down the gunmen 75 seconds apart on the bridge. Read more:The victims of Bondi terror attackEyewitness accounts of 'utter panic and chaos'  The father was killed at the scene by police, while the son was shot and wounded. He is being treated at a hospital, according to police. Mr Lanyon said he \"may well\" face criminal charges. In an update on Monday, Prime Minister Anthony Albanese told ABC that the suspect was in a coma. He also said there were a range of IEDs and \"explosive devices\" in their car that they intended to use to \"cause further damage\". What do we know about their backgrounds? Sajid Akram arrived in Australia in 1998 on a student visa and transferred to a partner visa three years later, before becoming a permanent resident, according to Home Affairs Minister Tony Burke. Officials have not disclosed what country he migrated from. He had his gun licence for approximately a decade and held a gun club membership, Mr Lanyon said. The younger suspect was an Australian-born citizen who first came to the attention of the Australian Security Intelligence Organisation (ASIO) in October 2019, Mr Albanese told reporters.  \"He was examined on the basis of being associated with others and the assessment was made that there was no indication of any ongoing threat or threat of him engaging in violence,\" Mr Albanese said. Mr Albanese said the suspect was investigated for six months over his connections to two people who later went to jail, one man for planning terror attacks. He said he was not put on a watch list because the investigation uncovered no evidence that he was planning or considering any act of antisemitic violence. Neither the father nor son have been on the ASIO's radar since the 7 October Hamas attacks, he added. What do we know about the motives? New South Wales Police designated the attack a terrorist incident, and Mr Lanyon said a \"significant investigation\" would be led by counterterrorism and that \"no stone will be left unturned\".  \"When I asked for calm, that is really important,\" he said. \"This is not a time for retribution. This is a time to allow the police to do their duty. So police are responding to make sure that all of the community is safe.\" Mr Albanese called the massacre an act of antisemitic terrorism that struck at the heart of the nation. On Monday, he said the attackers were \"two evil people... driven by ideology\" whose actions were the result of an \"extreme perversion of Islam\". NSW Premier Chris Minns said after the attack: \"This attack was designed to target Sydney's Jewish community on the first day of Hanukkah. What should have been a night of peace and joy celebrated in that community with families and supporters has been shattered by this horrifying, evil attack.\""
    },
    {
        "title": "JetBlue passenger plane and US Air Force aircraft in near miss by Venezuela",
        "description": "A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording.",
        "url": "https://news.sky.com/story/jetblue-passenger-plane-and-us-air-force-aircraft-in-near-miss-by-venezuela-13483942",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jetblue-us-air-force_7111465.jpg?20251215222232",
        "type": "World",
        "Author": "Callum Tennant, news reporter",
        "Date Published": "2025-12-15 21:40:00",
        "Headline": "The US Air Force plane was reported to be flying with its transponder turned off in an incident described as \"outrageous\" by the JetBlue pilot. ",
        "Content": "By Callum Tennant, news reporter  A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording. JetBlue Flight 1112 was flying to New York from the Caribbean nation of Curacao and was flying about 40 miles off the coast of Venezuela when the Airbus A320 reported encountering the air force refuelling tanker. The air force pilot was within a few miles of the plane and at the same altitude. The JetBlue pilot said on the recording: \"We almost had a mid-air collision up here. \"They passed directly in our flight path... They don't have their transponder turned on. It's outrageous.\" The air force jet then entered Venezuelan airspace, the JetBlue pilot said. A JetBlue spokesperson said the airline had reported this incident to federal authorities and will participate in any investigation. They added that: \"Our crew members are trained on proper procedures for various flight situations, and we appreciate our crew for promptly reporting this situation to our leadership team.\" US southern command - responsible for US military operations in Central America, South America, and the Caribbean - said it was aware of the incident and reviewing the matter. They added that: \"Safety remains a top priority, and we are working through the appropriate channels to assess the facts surrounding the situation.\" Last month, the Federal Aviation Administration (FAA) warned major airlines of a \"potentially hazardous situation\" when flying over Venezuela and urged them to exercise caution.  Major airlines from around the world have halted flights as tensions have worsened and US President Donald Trump has threatened to begin hitting land targets in Venezuela. The incident follows a fatal accident between a US military helicopter and an American Airlines flight in January that left 67 dead. That crash, which happened in the heart of Washington DC, highlighted the importance of clear communication between civil and military aircraft when operating in the same area. US military build-up in Southern Caribbean  The close call in the Caribbean happened as the US continues its military build-up in the area as President Trump campaigns to oust Venezuela's President Nicolas Maduro. The increase in US military presence includes flights by US bombers near Venezuela, the arrival of the world's largest aircraft carrier and new agreements for US military assets to transit neighbouring countries. On Monday, Trinidad and Tobago became the latest country to grant approval for US military aircraft to transit its airports in the coming weeks, according to the country's foreign ministry. All of these moves are aimed at increasing US pressure on Venezuela's government. Last week, US forces seized an oil tanker off the coast of Venezuela, escalating tensions between Washington and Caracas. Oil exports from Venezuela have fallen significantly since the ship's seizure, according to shipping data and maritime sources. Read more:The US-Venezuela crisis explainedWho is Maria Corina Machado? The seizure followed a large US naval build-up in the region, which has seen the US launch strikes against multiple boats purported to be smuggling drugs to America over the past few months. The legality of such moves has been questioned but has not prevented their repeated use. It is reported that Venezuela's opposition leader Maria Corina Machado escaped with US help to the Caribbean Island of Curacao during a daring escape from her country - before arriving in Norway. Pressed several times on whether she supported a possible US invasion of Venezuela to overthrow Nicolas Maduro, she would not commit outright but said the country has already been invaded by Russia, Iran and terrorist groups like Hezbollah."
    },
    {
        "title": "Timeline of Bondi Beach shooting: Videos show how terror attack unfolded",
        "description": "It took a mere eight minutes for a father and son to emerge from their car on to Bondi Beach in Sydney, Australia, and carry out one of the worst mass shootings the country has ever seen.&#160;",
        "url": "https://news.sky.com/story/timeline-of-bondi-beach-shooting-videos-show-how-terror-attack-unfolded-13483667",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-naveed-akram_7111132.jpg?20251215164906",
        "type": "World",
        "Author": "Claire Gilbody-Dickerson, reporter, and Adam Parker, OSINT editor",
        "Date Published": "2025-12-15 11:00:00",
        "Headline": "Sky News' Data and Forensics team has analysed footage taken from different angles by various members of the public to synchronise it and come up with a precise timeline of how the terror attack on a Jewish gathering on Sunday unfolded.",
        "Content": "By Claire Gilbody-Dickerson, reporter, and Adam Parker, OSINT editor   It took a mere eight minutes for a father and son to emerge from their car on to Bondi Beach in Sydney, Australia, and carry out one of the worst mass shootings the country has ever seen.  Sky News' Data and Forensics team has analysed footage taken from different angles by various members of the public to synchronise it and come up with a precise timeline of how the terror attack on a Jewish gathering on Sunday unfolded. A harrowing clip from the scene of the attack which was shared on social media and verified by Sky News shows people lying on the ground as about 35 gunshots ring out. Follow the latest updates on the Bondi Beach terror attack  A baby cries and people are heard screaming \"stay down\" and \"get on the ground\" during the nearly three-minute clip. The number of those killed in the attack has risen to 15, with one gunman later shot dead. Twenty-six people remain in hospital, according to New South Wales's health service. Here's a breakdown of what happened during the attack, from the moment the attackers open fire to when one gunman is shot dead by the police and the other apprehended. 18:42:27 This is the first footage we have of the gunmen, about two minutes after the attacked started. Footage shows the silver Hyundai Elantra belonging to the men. An eyewitness told 9News Australia one of the men got out of the back left door and started firing straight away. The suspects - 50-year-old Sajid Akram and his 24-year-old son, Naveed - started shooting people then moved on to a footbridge that leads over a car park to the beach. 18:42:46 A police utility van with its lights and sounds on passes by. These are not armed units - it's an evidence section vehicle from the forensics department. 18:42:47 The attackers leave a gun on the bridge. 18:43:02 The older man walks off the bridge and heads towards the Hanukkah event attended by more than 1,000 people on the popular beach. 18:45:07 The 50-year-old is seen in the field right next to the event. He reloads his gun. 18:45:18 Ahmed al Ahmed, a 43-year-old fruit shop owner hailed a \"hero\" after bravely tackling one of the attackers, disarms the elder man of his first gun. This is around 40m away from the bridge. Read more:The victims of Bondi terror attackWho were the suspected shooters in Bondi Beach terror attack?What we know so far about Bondi Beach shooting 18:46:04 The elder man returns to the bridge. 18:46:15 He picks up the third weapon. 18:47:00 Police start firing from west of the bridge, the opposite direction to where the Hanukkah event is taking place. The man gets shot and appears to be dead. 18:47:15 A police officer fires at the younger gunman on the bridge. 18:48:13 The man gets hit. 18:48:16 He then gets hit again and goes down. He remains in critical condition. Tap to never miss an episode: Follow Cheat Sheet here '106 gunshots' Four firearms were found at the scene, three on Sunday and another on Monday, police said. Forensic audio expert Professor Rob Maher analysed the shooting and told Sky News he counted \"106 audible gunshots\". But he added: \"Some overlap and possible echoes, but that appears to be the mixture of the close shots in the video and more distant shots, presumably law enforcement. \"Not all of the audible shots correspond to visible shooting actions by the individuals on the bridge, so I would assume there were shots taking place out of the video scene.\" Firearms expert Jonathan Ferguson told Sky News the younger attacker was firing a Beretta BRX-1 \"straight-pull\" hunting rifle, while the older man was using a Stoeger M3000 12 gauge semi-automatic shotgun. Mr Ferguson added that the firearm the older man picked up after being stripped of his Stoeger by Mr Ahmed is a similar shotgun to the one he had been using. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Briton Jimmy Lai found guilty of national security offences in Hong Kong",
        "description": "Pro-democracy campaigner Jimmy Lai has been found guilty of national security offences in Hong Kong.",
        "url": "https://news.sky.com/story/jailed-briton-jimmy-lai-found-guilty-of-national-security-offences-in-hong-kong-13483513",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-china-jimmy-lai_6989838.jpg?20250818052458",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-15 00:33:00",
        "Headline": "The pro-democracy campaigner was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong.",
        "Content": " Pro-democracy campaigner Jimmy Lai has been found guilty of national security offences in Hong Kong. The media tycoon and British citizen, 78, was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong. Sky News' Asia correspondent Helen-Ann Smith, who is at West Kowloon Law Courts Building, said Lai looked \"drawn and thin\" as he listened to the verdict being delivered. He had previously been sentenced for several lesser offences during his five years in prison. Asia correspondent There was a tense hush in the court as Jimmy Lai was led in for his long-awaited verdicts. He looked thin and drawn but not in bad spirits. He smiled and waved when he saw his family and, for a moment, he appeared very deeply struck by the emotion of it all. When the judgement was read out, he sat still glancing at his family. His wife barely took her eyes off him.\n\n There was never any doubt about what this verdict would be, but it's nonetheless a moment of such stark symbolism for this city. Despite sweeping international criticism and Hong Kong's insistence that it observes the rule of law, the man who has been called this city's greatest dissident could not be seen to go unpunished.  Indeed, in so many ways these guilty verdicts are a mark of how much Hong Kong has changed. They are a conclusion of sorts , not just for Jimmy Lai himself, but for the wide-reaching crackdown on free press and free speech. Lai, who founded the now-defunct pro-democracy newspaper Apple Daily, was charged with two counts of conspiracy to commit collusion with foreign forces to endanger national security, as well as one count of conspiracy to distribute seditious publications. He has been found guilty of all three charges and could be sentenced later to life in prison. Reading from an 855-page verdict, Judge Esther Toh said that the evidence showed Lai had extended \"constant invitations\" to the US to help bring down the Chinese government and had spent years considering what leverage the US could use. \n                  Japan accuses Chinese fighter of locking fire-control radar on its jets\n                 \n                  Government delays Chinese 'super embassy' decision\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \"There is no doubt that the first defendant had harboured his resentment and hatred of the PRC (People's Republic of China) for many of his adult years,\" Judge Toh said. She added that the court was satisfied that Lai was the \"mastermind\" of the conspiracies and that the only reasonable inference from the evidence was that Lai's intent was to seek the downfall of the ruling Communist Party even at the sacrifice of the people of China and Hong Kong. The chief executive of the Hong Kong government, John Lee, said Lai \"has long been using his media outlet, Apple Daily, to wantonly create social conflicts, incite social antagonism, incite hatred, glorify violence and openly beg for foreign sanctions against China and the HKSAR, attracting external interference\". He added: \"He has harmed the fundamental interests of the country and the well-being of the people of Hong Kong; his actions are shameful and his intentions malicious.\" Lai has spent more than 1,800 days in solitary confinement. His family say his health has worsened as a result and that he suffers from diabetes, high blood pressure and heart palpitations. His son Sebastien Lai described his father's \"rapidly\" declining health as \"heartbreaking\" during a press conference later on Monday. Mr Lai said: \"In the 800-page verdict that they have, there's essentially nothing. \"There's nothing that incriminates him. There's nothing that even under their own legal system would make him guilty.\" Mr Lai added that it is a \"perfect example\" of how the law has been \"moulded and weaponised against someone who essentially said stuff that they didn't like\". Mr Lai urged the UK government to \"put action behind words\". He said: \"Make my father's release a precondition to closer relationships with China.\" Downing Street condemned the verdict, with Prime Minister Sir Keir Starmer's official spokesman saying: \"We will continue to appeal to the Chinese government ahead of Jimmy Lai's sentencing for his release and access to medical treatment. \"Jimmy Lai's case has been a priority for this government and the prime minister, and as the foreign secretary has said, we condemn the politically motivated prosecution that has resulted in today's guilty verdict.\" He added: \"The UK has repeatedly called for Beijing's national security law to be repealed and for an end to the prosecution of all individuals charged under it, and we will continue to call for his immediate release.\" The UK \"cannot shy away from engagement\" with China, he insisted, when asked if Sir Keir still planned to travel to the country and meet its leaders next year. The spokesman would not be drawn into saying whether the Labour government planned to summon the Chinese ambassador over Lai's case. Foreign Secretary Yvette Cooper said she condemned the \"politically motivated prosecution of Jimmy Lai that has resulted in today's guilty verdict\". She added: \"Jimmy Lai has been targeted by the Chinese and Hong Kong governments for peacefully exercising his right to freedom of expression. \"Beijing's National Security Law was imposed on Hong Kong to silence China's critics. The UK has repeatedly called for the National Security Law to be repealed and for an end to the prosecution of all individuals charged under it. \"We continue to call for Mr Lai's immediate release, for all necessary treatment and for full access to independent medical professionals.\" China's ambassador to the UK, Zheng Zeguang, met with a senior official at the UK Foreign Office \"to lodge solemn representations over the UK side's statement that made irresponsible remarks on the Hong Kong High Court's guilty verdict in the Jimmy Lai case\", China's embassy said. \"He urged the UK to abandon its colonial mindset, immediately stop interfering in Hong Kong's judicial affairs, stop making the case for anti-China rioters bent on destabilising Hong Kong, and stop meddling in China's internal affairs.\" Shadow foreign secretary Dame Priti Patel called Mr Lai's conviction \"an outrage to democracy, personal freedom and liberty\". The Conservative called on the prime minister to directly raise the case with China's President Xi Jinping, \"and demand Jimmy's immediate release from custody so his ordeal can end, he can be returned to Britain and be reunited with his family\". She added: \"The imposition of the National Security Law on Hong Kong is in violation of the freedoms that should have been guaranteed under the Sino-British Joint Declaration, and the British Government has not done enough to oppose the suppression of freedom and human rights in Hong Kong.\" Lai's trial, heard by three judges approved by the Hong Kong authorities without a jury present, has been closely monitored by the UK, the US, the European Union and political observers as a barometer of media freedom and judicial independence in the former British colony, which returned to Chinese rule in 1997. Responding to the verdict, the Committee for Freedom in Hong Kong Foundation's UK and Europe director Mark Sabah said in a statement: \"This verdict should surprise absolutely no one. The trial against Jimmy Lai has been a show trial masquerading as justice. But what's actually been on display is the complete and total destruction of Hong Kong's reputation as a global legal centre. \"Jimmy Lai is a British citizen. But instead of demanding the release of one of its own, the British government's response has been years of timid action and kowtowing to the Chinese Communist Party (CCP). By abandoning one of its citizens, the British government has sent a clear and shameful message: trade access to the CCP matters more than the rule of law, press freedom, or the safety of British nationals abroad.\" He added: \"We now wait for whatever sentence the Hong Kong authorities and the CCP conjure up to bring this five-year charade to an end. But make no mistake, the fight for freedom and justice will go on, not just for Jimmy Lai but for all political prisoners in Hong Kong.\" Three months after winning the 2024 UK general election, Sir Keir had said securing Lai's release was a \"priority\" for his government and that it would \"continue\" to raise the case with China. Most recently, during a January trip to China, Chancellor Rachel Reeves said she raised the question over Lai's imprisonment with every minister she met. Lai was born in mainland China but fled to Hong Kong at the age of 12, after stowing away on a fishing boat. Here, he began working as a child labourer in a garment factory. He went on to build a fortune with the fashion empire Giordano and, after the 1989 Tiananmen Square massacre, when thousands of people protested for political reforms in Beijing, he became a democracy advocate and turned his hand to newspapers.\n\n Ahead of the 1997 handover of Hong Kong from the UK to China, he started the Chinese-language newspaper Apple Daily in an attempt to maintain freedom of speech. The paper was staunchly pro-democratic and did not shy away from criticising authorities in Beijing. Around the same time, in 1994, he became a full British citizen. He has never held a Chinese or Hong Kong passport, but is seen as a Chinese citizen by Hong Kong authorities. It was his pro-democratic beliefs that led to Lai becoming a key figure in the 2019 protests in Hong Kong, spurred by Beijing's tightening squeeze on wide-ranging freedoms. Lai's Apple Daily newspaper backed the protesters, criticising the government reforms. Lai and his sons were arrested in August 2020 after police raided the offices of the Apple Daily publisher, Next Digital. He was granted bail, but this was overturned in December of the same year, when Lai was charged with fraud. He was charged under the very national security laws, put in place in 2020, that he had protested. On 15 December, he was found guilty of collusion with foreign forces, as well as conspiracy to print and distribute seditious publications. Read more about Jimmy Lai here In August, Sebastien Lai told Sky News that unless the British government intervenes, his father \"is most likely going to die in jail\". He said his father's death would not just be a personal tragedy, but a huge problem for both the Hong Kong authorities and Beijing's government. \"You can't tell the world you have the rule of law, the free press and all these values that are instrumental to a financial centre and still have my father in jail,\" he told Sky News. \"And if he dies, that's it, that's a comma on Hong Kong as a financial centre.\""
    },
    {
        "title": "Russia trying to 'bully' UK and allies with attacks under threshold of all-out war, MI6 chief says",
        "description": "Russia is trying to \"bully, fearmonger and manipulate\" the UK and its allies with attacks under the threshold of all-out war, the new head of MI6 has said.",
        "url": "https://news.sky.com/story/frontline-with-russia-is-everywhere-even-in-the-minds-of-our-citizens-mi6-chief-says-13483818",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-vladimir-yakushev_7110983.jpg?20251215172657",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-15 16:21:00",
        "Headline": "Blaise Metreweli said Britain is \"operating in a space between peace and war\" and that everyone has a responsibility to understand the dangers.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Russia is trying to \"bully, fearmonger and manipulate\" the UK and its allies with attacks under the threshold of all-out war, the new head of MI6 has said. Blaise Metreweli, the first female chief of the Secret Intelligence Service (SIS), said Britain was \"operating in a space between peace and war\" and that everyone has a responsibility to understand the dangers because \"the frontline is everywhere\". In her first big speech on Monday, she also focused on Vladimir Putin's devastating war in Ukraine, accusing him of \"dragging out negotiations\" on a peace deal and warning that Kyiv's fate is \"fundamental not just to European sovereignty and security but to global security\". Offering her view on the evolution of global security threats, Ms Metreweli underlined the transformative role of technology, from artificial intelligence to quantum computing. She said control over such advanced technologies is shifting from states to corporations and even individuals, making the balance of global power more \"diffuse, more unpredictable\". The spymaster did not name anyone.  However, innovators such as Elon Musk are becoming increasingly influential, with their technologies such as his Starlink satellites and his social media site X. The boss of MI6 was speaking at her agency's headquarters in London, though she said that the main work of her spies was carried \"many miles away from this place - out of sight, hidden from the world, undercover, recruiting and running agents who choose to place their trust in us, sharing secrets to make the UK and the world safer\". She warned the world was \"more dangerous and contested now than it has been for decades\". Read more from Sky News:Who were the suspected gunmen in Bondi Beach terror attack?Jimmy Lai found guilty of national security offences in Hong Kong The spy chief said: \"Conflict is evolving and trust eroding, just as new technologies spur both competition and dependence. \"We are being contested from sea to space - from the battlefield to the boardroom. And even our brains as disinformation manipulates our understanding of each other and ourselves… We are now operating in a space between peace and war. \"This is not a temporary state or a gradual evolution. Our world is being actively remade with profound implications for national and international security.\" Breaking with a tradition by previous chiefs of offering a view on a range of threats when speaking publicly, Ms Metreweli said she was choosing to focus on Russia. \"We all continue to face the menace of an aggressive, expansionist and revisionist Russia, seeking to subjugate Ukraine and harass NATO,\" she said.  On the conflict, she said Putin was \"dragging out negotiations and shifting the cost of war on to his own population\". Her comments come as Donald Trump is attempting to broker a peace deal between Moscow and Kyiv. General Oleksandr Syrskyi, the head of Ukraine's armed forces, told Sky News in an interview earlier this month that he believed Putin was using the US push for negotiations as \"cover\" while Russian troops attempted to seize more land by force.  The MI6 boss said the UK's support for Ukraine would endure regardless of Moscow's stalling actions. She also flagged a growing wave of \"grey zone\" hostilities - deliberately carried out under the threshold of conventional armed conflict - that she attributed to Moscow. \"It's important to understand their [Russia's] attempts to bully, fearmonger and manipulate because it affects us all,\" she said. \"I am talking about cyber attacks on critical infrastructure. Drones buzzing airports and bases. Aggressive activity in our seas, above and below the waves. State-sponsored arson and sabotage. Propaganda and influence operations that crack open and exploit fractures within societies.\" While she did not specify any particular incidents, there have been a spate of mysterious drone sightings in Denmark, Germany and Sweden; while a Russian spy ship was spotted off the coast of Scotland and acts of arson and sabotage have been carried out in the UK, such as a blaze at a warehouse in east London that was providing aid to Ukraine. Drawing attention to another method to attack a country and its people, Ms Metreweli underlined how information is being weaponised, with falsehoods spread online that are designed to erode trust in a society and amplify divisions. \"The export of chaos is a feature not a bug in this Russian approach to international engagement and we should be ready for this to continue until Putin is forced to change his calculus,\" she said.  MI6, she said, is adapting to respond to the evolving threats. But unusually Ms Metroweli also said the wider British public had a role to play, such as with schools helping to educate children to spot disinformation on social media and to check sources of news \"and be alive to those algorithms that trigger intense reactions like fear\". She added: \"It also means everyone in society really understanding the world we are in - a world where… the frontline is everywhere. Online, on our streets, in our supply chains, in the minds and on the screens of our citizens.\" Building on the success of the highly acclaimed podcast The Wargame, Sky News presents The Wargame: Decoded - a one-off live event that takes you deep inside the minds of the wargame's participants. Discover how they tackled the toughest challenges, the decisions they made under intense pressure, and even experience key moments of the game for yourself. Click here to get tickets. Sky News' Deborah Haynes will guide the conversation with Sir Ben Wallace, Robert Johnson, Jack Straw, Amber Rudd, Keir Giles and General Sir Richard Barrons - real-life military chiefs, former government officials and leading experts. Together, they will unpack their experiences inside The Wargame, revealing the uncertainty, moral dilemmas and real-world pressures faced by those who must make decisions when the nation is under threat. Join us for this unique event exploring how the UK might respond in a moment of national crisis and get a rare, unfiltered glimpse into how prepared the country truly is for war."
    },
    {
        "title": "US and China should collaborate on new trips to the moon, says British astronaut Tim Peake",
        "description": "British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\".",
        "url": "https://news.sky.com/story/us-and-china-should-collaborate-on-new-trips-to-the-moon-says-british-astronaut-tim-peake-13483517",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tim-peake-nasa_7110432.jpg?20251215023010",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-15 02:02:00",
        "Headline": "In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Tim Peake urges the powers to co-operate rather than race in a new era of hazardous lunar exploration.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\". In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Mr Peake said it would be \"foolish\" to start a new era of hazardous lunar exploration without contingency plans for rescuing astronauts from other countries in an emergency. \"Space is incredibly hard, a very hostile environment,\" he said. \"It would be foolish to not have things like common docking systems so that we can help each other out if people got into trouble. \"That's the whole spirit of exploration. Okay, we might be coming from different positions, but we're also one species and there to cooperate and collaborate.\" Sean Duffy, the acting NASA chief, has vowed the US will build a sustainable presence on the moon before China. \"We're going back to the moon - and this time when we plant our flag, we stay,\" he said in a NASA video in September. \n                  Blue Origin sends NASA spacecraft to Mars and lands booster for first time - heating up race with Elon Musk's SpaceX\n                 \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job\n                 \"Our mission is maintaining American dominance in space. \"China wants to get there, but we're getting there first. We will win the second space race.\" But Mr Peake said lessons should be learned from the space station, where astronauts from Russia and Western nations had successfully worked alongside each other for 25 years despite geopolitical tensions. \"I think as we move forward again and are focusing on the moon as a goal, we should embody this spirit of collaboration,\" he said. NASA is just weeks away from launching four astronauts on a mission to fly around the moon for the first time since the final Apollo landing in 1972. It'll be the first crewed flight of NASA's new SLS mega-rocket that will be the workhorse of the Artemis space programme. A test flight in 2022 without humans on board identified a series of serious problems with the crew capsule, but the agency is confident those have been fixed. \"This SLS rocket is only on its second mission, so there is definitely a greater level of risk associated with it,\" Mr Peake said. \"But the astronauts are completely committed to what they're doing, passionate about what they're doing, and all the experts who are working on the Artemis mission would have gone to every effort to make sure the risk is as low as possible.\"  The European Space Agency said earlier this month that an as-yet unnamed German astronaut will be the first from Europe to join a future Artemis mission to the moon. But Mr Peake, who retired from ESA in 2023, was confident the UK's turn would come. Rosemary Coogan, from Northern Ireland, is part of the agency's trained astronaut corps. \"It would be great to see that first European on the moon,\" he said. \"But I'd love to see a Union flag on the surface in the not-too-distant future.\""
    },
    {
        "title": "European leaders back 'multinational force' to secure peace in Ukraine, as US commits to security guarantees",
        "description": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today.",
        "url": "https://news.sky.com/story/european-leaders-back-multinational-force-to-secure-peace-in-ukraine-as-us-commits-to-security-guarantees-13483879",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-berli-berlin_7111348.jpg?20251215204218",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-15 19:35:00",
        "Headline": "The leaders were optimistic after meeting in Berlin, alongside talks between Ukraine and the US. A US official said about 90% of issues were resolved.",
        "Content": "European leaders have called for a \"multinational force\" to secure Ukraine after an eventual peace deal with Russia, as they struck an optimistic tone after talks in Berlin today. In a join statement, they heralded \"significant progress\" - boosted by a new US commitment to provide unspecified security guarantees to Ukraine. German Chancellor Friedrich Merz described the guarantees by the US as \"truly remarkable\". He said: \"This is a very important advancement that I greatly welcome.\" Adding to the positive mood music, US President Donald Trump said he believed \"we are closer now than we have been ever\" to agreeing a ceasefire for the deadliest conflict in Europe since the Second World War. The comments round off two days of talks in Berlin between Ukrainian and US envoys Steve Witkoff and Jared Kushner, and a separate meeting of European leaders in the German capital. Read more: UK's 'sons and daughters' need to be ready to fight However, Ukrainian President Volodymyr Zelenskyy called the talks on conceding territories to Russia \"painful\" and \"very difficult\". He told reporters in Berlin: \"Frankly speaking, we still have different positions.\"  Earlier, his security officials claimed to have dealt a lethal strike to a $400m (£299m) Russian submarine in the Black Sea - a claim that Russia rejected. \"The information from the Ukrainian special services about the alleged destruction of one of Russia's submarines is not true\", said the Black Sea Fleet command. Not a single ship or submarine of the Black Sea Fleet in the Novorossiysk base bay, nor their crews, were injured in the sabotage, the fleet command said. Back in Berlin, European leaders issued a joint statement on behalf of the leaders of Germany, Denmark, Finland, France, Italy, the Netherlands, Norway, Poland, Sweden and the UK, as well as the presidents of the European Council and the European Commission. The document said the leaders \"welcomed the close work between President Zelenskyy's and President Trump's teams, as well as European teams over the recent days and weeks\". \"They agreed to work together with President Trump and President Zelenskyy to get to a lasting peace, which preserves Ukrainian sovereignty and European security. \"Leaders appreciated the strong convergence between the United States, Ukraine and Europe.\" Outlining what they considered necessary security guarantees, the leaders said the \"multinational force\" should be made up of countries from the so-called Coalition of the Willing and \"supported by the US\". They also said they \"strongly support\" Ukraine joining the European Union, and that it should be able to maintain its armed forces at a level of 800,000. \"It will assist in the regeneration of Ukraine's forces, in securing Ukraine's skies, and in supporting safer seas, including through operating inside Ukraine.\" A US official said about 90% of issues between the warring parties had been resolved and that they believed Russia would be open to Ukraine joining the European Union, and to the security guarantees in the deal."
    },
    {
        "title": "Rob Reiner death: 'Sick' Trump sparks backlash with 'disgusting' post about murdered film director",
        "description": "Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner.",
        "url": "https://news.sky.com/story/rob-reiner-death-sick-trump-sparks-backlash-with-disgusting-post-about-murdered-film-director-13483564",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rob-reiner-michele-singer-reiner_7110445.jpg?20251215194001",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-15 07:29:00",
        "Headline": "The US president says Rob Reiner had \"TRUMP DERANGEMENT SYNDROME\" in an online post after he and his wife, Michele Singer Reiner, were found dead.",
        "Content": " Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner. The Hollywood luminary was found stabbed to death with his wife on Sunday - and the filmmaker's son had been arrested on murder charges. Reacting to news of his death, the US president said in a post on Truth Social that Reiner was \"tortured and struggling, but once very talented movie director and comedy star\". Mr Trump said Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS\". \"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before. May Rob and Michele rest in peace,\" Mr Trump wrote. Celebrities and politicians have criticised Mr Trump for his comments, labelling them \"disgusting\" and \"petty\". 'Can you get any lower?' \"What a disgusting and vile statement,\" actor Patrick Schwarzenegger said on X, while Californian Democrat Zoe Lofgren condemned Mr Trump's comments as \"a new low for this petty, hateful man\". Talk show host Whoopi Goldberg compared the president's comments to those he made after the assassination of right-wing activist Charlie Kirk, when Mr Trump hit out at critics. \"I don't understand the man in the White House. He spoke at length about Charlie Kirk and about caring, and then this is what he puts out. Have you no shame? No shame at all? Can you get any lower? I don't think so,\" she said. 'Sick' \"This is a sick man,\" California governor Gavin Newsom wrote on X. Republican US House member Thomas Massie also addressed the comments, saying: \"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered.\" Meanwhile, Reiner's son, Nick, 32, has been \"booked for murder\", Los Angeles police chief Jim McDonnell said. The LAPD later said Nick Reiner remains in custody without bail. Mr McDonnell said the department's robbery and homicide division was handling the investigation. \"They worked throughout the night on this case and were able to take into custody Nick Reiner, a suspect in this case,\" he said, calling the deaths \"a very tragic incident\". It comes as it emerged Nick was reportedly disruptive when he joined his father and mother, Michele Singer Reiner, at a party hosted by comedian Conan O'Brien on Saturday night, the day before the killings. Reiner and his wife were upset and embarrassed about their son's behaviour, Sky News's US partner NBC News cited a source as saying, and expressed concerns about his health. The outlet cited another source saying Nick's behaviour had made other guests uncomfortable. They said he interrupted a conversation comedian and filmmaker Bill Hader was having with two guests and, when told it was a private conversation, stood still and stared before storming off. Reiner and his wife apparently died of stab wounds, US media reported. The Los Angeles Fire Department said a 78-year-old man and a 68-year-old woman were found dead inside a property in the Brentwood neighbourhood, without identifying the victims. The victims were later confirmed to be Reiner and his wife. The case against Nick Reiner will be presented to the Los Angeles county district attorney's office for filing consideration on Tuesday, according to the LAPD. Nick Reiner has spoken publicly of his struggles with addiction after he had cycled in and out of treatment facilities by the age of 18, with periods of homelessness and relapses in between. Reiner and his son explored their difficult relationship and Nick Reiner's struggles with heroin addiction and homelessness in a 2016 film called Being Charlie, which they co-wrote. Republican congresswoman Marjorie Taylor Greene referred to Nick Reiner's \"drug addiction and other issues\" in a statement on X. \"This is a family tragedy, not about politics or political enemies,\" Ms Taylor Greene said. \"Many families deal with a family member with drug addiction and mental health issues. It's incredibly difficult and should be met with empathy especially when it ends in murder.\" Reiner was a celebrated director whose work included some of the most memorable movies of the 1980s and 1990s. He directed classics such as This Is Spinal Tap, The Princess Bride, When Harry Met Sally, A Few Good Men and Stand By Me. He also acted, starring in Sleepless In Seattle and The Wolf Of Wall Street among others. His most recent high-profile work was a recurring guest role in the hit show The Bear. He met Michele Singer in 1989, while directing When Harry Met Sally. They have three children together. Singer used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal. Former US president Barack Obama has led tributes. He wrote on X that \"Michelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele. Rob's achievements in film and television gave us some of our most cherished stories on screen\". Harry Shearer, who collaborated with Reiner on This Is Spinal Tap, said in a statement: \"Rob was a friend and collaborator through much of my life. He was funny, he was smart, he was a mensch.\" He said Reiner's wife was a \"very good friend\" to his own wife, Judith, adding: \"This is unspeakable, the stuff of Greek tragedy.\" Christopher Guest, who starred in Reiner's films This Is Spinal Tap and The Princess Bride, and his wife Jamie Lee Curtis said in a joint statement that they were \"numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner\". The couple said: \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis. We have lost great friends. Please give us time to grieve.\" Read more: Reiner spoke to Eric Idle about future before death Reiner was a champion of liberal causes and a political activist. In the 2004 presidential election, he backed Democrat candidate John Kerry and featured in advertisements taking aim at incumbent president George W Bush. Reiner also supported Democratic presidential hopefuls Al Gore and Hillary Clinton. \"This is a devastating loss for our city and our country. Rob Reiner's contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" Los Angeles mayor Karen Bass said. California governor Mr Newsom paid tribute to Reiner's activism as he said he was \"heartbroken\" over the director's death. \"Rob was a passionate advocate for children and for civil rights - from taking on Big Tobacco, fighting for marriage equality, to serving as a powerful voice in early education,\" Mr Newsom said in a statement. \"He made California a better place through his good works. Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.\" Read more from Sky News:Four charged with California bomb plotAustralian PM reveals details about Bondi killers Former House speaker, Democrat Nancy Pelosi, said: \"Personally, Rob cared deeply about people and demonstrated that in his civic activities - whether by supporting the First 5 initiative or fighting against Prop 8 in California. \"Civically, he was a champion for the First Amendment and the creative rights of artists. And professionally, he was an iconic figure in film who made us laugh, cry and think with the movies he created.\""
    },
    {
        "title": "Brown University shooting victims named as new video footage released in search for gunman",
        "description": "Two students killed in a shooting at Brown University have been named.",
        "url": "https://news.sky.com/story/brown-university-shooting-victims-named-as-new-video-footage-released-in-search-for-gunman-13483911",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-fbi-brown-university_7111468.jpg?20251215222914",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-15 20:42:00",
        "Headline": "Authorities released a \"person of interest\" on Sunday after determining the evidence pointed \"in a different direction\". Police called on the public to help as they released a new video on Monday. ",
        "Content": " Two students killed in a shooting at Brown University have been named. Ella Cook, from Mountain Brook, Alabama, and Mukhammad Aziz Umurzokov, a citizen of Uzbekistan, were killed in Saturday's shooting, which also left nine wounded. The gunman opened fire inside a classroom in the engineering building, shooting more than 40 rounds from a 9mm handgun, a police official said. The attack took place as final exams were under way and sparked hours of chaos on the campus and in the surrounding neighbourhoods, leading to a frantic police search, with hundreds of officers involved. The following day, a \"person of interest\" was released from custody when police said the evidence pointed \"in a different direction\". New footage released CCTV released by Providence Police on Monday shows a man walking on the pavement on a road with cars driving past at 4.06pm. He appears to be dressed all in black, but his face is not visible. \"Right now, we don't have any evidence to suggest that it was more than that individual,\" Providence mayor Brett Smiley said after the release of the footage. Two handguns were recovered when the original person of interest was taken into custody and police also found two loaded 30-round magazines, a police official said. Read more from Sky News:Four charged over New Year's Eve bombTrump launches attack on Rob Reiner Investigators were not immediately sure how the gunman got inside the first-floor classroom, housed in a seven-storey complex. Police had announced early on Sunday that they had detained a person of interest at a Rhode Island hotel in connection with the attack and lifted a lockdown at the Ivy League school's campus. One video of the attack showed students in a library shaking and wincing as they heard loud bangs just before police entered the room to clear the building. During the lockdown, which was not lifted until Sunday, many students remained barricaded in rooms, while others hid behind furniture and bookshelves as police searched for the gunman. One of the nine wounded students has been released from the hospital, university president Christina Paxson said on Sunday. Seven others were in critical but stable conditions, and one was in a critical condition. Brown, the seventh-oldest higher education institution in the US, is one of the nation's most prestigious colleges, with around 7,300 undergraduates and more than 3,000 graduate students. The school cancelled all remaining classes and exams for the semester."
    },
    {
        "title": "Police release man detained in connection with Brown University shooting",
        "description": "Police are releasing a man detained in connection with the fatal shooting on the campus of Brown University in Providence, Rhode Island.",
        "url": "https://news.sky.com/story/police-release-man-detained-in-connection-with-brown-university-shooting-13483519",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brownshooter-brown-university_7109554.jpg?20251214041003",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-15 04:03:00",
        "Headline": "Two people were killed and nine others, all or nearly all of whom are also believed to be students, were injured in the attack on Saturday.",
        "Content": " Police are releasing a man detained in connection with the fatal shooting on the campus of Brown University in Providence, Rhode Island. Two people were killed and nine others, all or nearly all of whom are also believed to be students, were injured in the attack on Saturday. Earlier, three senior law enforcement officials briefed on the investigation told Sky's US partner NBC News the detained man, who is being released, was 24-year-old Benjamin Erickson, who had served several years in the US army. The release means that the suspected gunman remains at large. Speaking at a news conference, Providence mayor Brett Smiley said: \"We know that this is likely to cause fresh anxiety for our community and we want to reiterate what we said earlier... which is ever since the initial call, now a day and a half ago, we have not received any credible or specific threats to the Providence community. \"So the status of safety in our community remains unchanged, and we believe that you remain safe in our community.\" Mr Smiley said there would be a continuation of an enhanced police presence throughout the city and on the university campus. \"We have not yet solved this case, but I am confident we are going to do that in the near future,\" Rhode Island attorney general Peter Neronha said. The shooting happened inside a classroom on the first floor of the Barus & Holley engineering building, a seven-storey structure home to much of the university's engineering and physics study and research. Brown University provost Frank Doyle confirmed final exams were taking place in the engineering building when the gunman opened fire. A police official told the AP news agency the gunman fired more than 40 9mm rounds. A gun has not been recovered, but officers did seize two loaded 30-round magazines. A video released by officials shows a suspect walking down a street away from the campus and turning a corner, dressed in dark, loose-fitting clothing. Seven people injured in the shooting were in a stable condition, the Providence mayor, Mr Smiley, said. One remained in critical but stable condition, while another had been discharged, he added. Brown is a private university with roughly 7,300 undergraduate students and more than 3,000 graduate students."
    },
    {
        "title": "JetBlue passenger plane and US Air Force aircraft in near miss by Venezuela",
        "description": "A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording.",
        "url": "https://news.sky.com/story/jetblue-passenger-plane-and-us-air-force-aircraft-in-near-miss-by-venezuela-13483942",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jetblue-us-air-force_7111465.jpg?20251215222232",
        "type": "US",
        "Author": "Callum Tennant, news reporter",
        "Date Published": "2025-12-15 21:40:00",
        "Headline": "The US Air Force plane was reported to be flying with its transponder turned off in an incident described as \"outrageous\" by the JetBlue pilot. ",
        "Content": "By Callum Tennant, news reporter  A JetBlue passenger plane took evasive action to avoid a mid-air collision with a US Air Force plane flying with its transponder turned off near Venezuela, a pilot has said in an air traffic control recording. JetBlue Flight 1112 was flying to New York from the Caribbean nation of Curacao and was flying about 40 miles off the coast of Venezuela when the Airbus A320 reported encountering the air force refuelling tanker. The air force pilot was within a few miles of the plane and at the same altitude. The JetBlue pilot said on the recording: \"We almost had a mid-air collision up here. \"They passed directly in our flight path... They don't have their transponder turned on. It's outrageous.\" The air force jet then entered Venezuelan airspace, the JetBlue pilot said. A JetBlue spokesperson said the airline had reported this incident to federal authorities and will participate in any investigation. They added that: \"Our crew members are trained on proper procedures for various flight situations, and we appreciate our crew for promptly reporting this situation to our leadership team.\" US southern command - responsible for US military operations in Central America, South America, and the Caribbean - said it was aware of the incident and reviewing the matter. They added that: \"Safety remains a top priority, and we are working through the appropriate channels to assess the facts surrounding the situation.\" Last month, the Federal Aviation Administration (FAA) warned major airlines of a \"potentially hazardous situation\" when flying over Venezuela and urged them to exercise caution.  Major airlines from around the world have halted flights as tensions have worsened and US President Donald Trump has threatened to begin hitting land targets in Venezuela. The incident follows a fatal accident between a US military helicopter and an American Airlines flight in January that left 67 dead. That crash, which happened in the heart of Washington DC, highlighted the importance of clear communication between civil and military aircraft when operating in the same area. US military build-up in Southern Caribbean  The close call in the Caribbean happened as the US continues its military build-up in the area as President Trump campaigns to oust Venezuela's President Nicolas Maduro. The increase in US military presence includes flights by US bombers near Venezuela, the arrival of the world's largest aircraft carrier and new agreements for US military assets to transit neighbouring countries. On Monday, Trinidad and Tobago became the latest country to grant approval for US military aircraft to transit its airports in the coming weeks, according to the country's foreign ministry. All of these moves are aimed at increasing US pressure on Venezuela's government. Last week, US forces seized an oil tanker off the coast of Venezuela, escalating tensions between Washington and Caracas. Oil exports from Venezuela have fallen significantly since the ship's seizure, according to shipping data and maritime sources. Read more:The US-Venezuela crisis explainedWho is Maria Corina Machado? The seizure followed a large US naval build-up in the region, which has seen the US launch strikes against multiple boats purported to be smuggling drugs to America over the past few months. The legality of such moves has been questioned but has not prevented their repeated use. It is reported that Venezuela's opposition leader Maria Corina Machado escaped with US help to the Caribbean Island of Curacao during a daring escape from her country - before arriving in Norway. Pressed several times on whether she supported a possible US invasion of Venezuela to overthrow Nicolas Maduro, she would not commit outright but said the country has already been invaded by Russia, Iran and terrorist groups like Hezbollah."
    },
    {
        "title": "US and China should collaborate on new trips to the moon, says British astronaut Tim Peake",
        "description": "British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\".",
        "url": "https://news.sky.com/story/us-and-china-should-collaborate-on-new-trips-to-the-moon-says-british-astronaut-tim-peake-13483517",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tim-peake-nasa_7110432.jpg?20251215023010",
        "type": "US",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-15 02:02:00",
        "Headline": "In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Tim Peake urges the powers to co-operate rather than race in a new era of hazardous lunar exploration.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\". In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Mr Peake said it would be \"foolish\" to start a new era of hazardous lunar exploration without contingency plans for rescuing astronauts from other countries in an emergency. \"Space is incredibly hard, a very hostile environment,\" he said. \"It would be foolish to not have things like common docking systems so that we can help each other out if people got into trouble. \"That's the whole spirit of exploration. Okay, we might be coming from different positions, but we're also one species and there to cooperate and collaborate.\" Sean Duffy, the acting NASA chief, has vowed the US will build a sustainable presence on the moon before China. \"We're going back to the moon - and this time when we plant our flag, we stay,\" he said in a NASA video in September. \n                  Blue Origin sends NASA spacecraft to Mars and lands booster for first time - heating up race with Elon Musk's SpaceX\n                 \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job\n                 \"Our mission is maintaining American dominance in space. \"China wants to get there, but we're getting there first. We will win the second space race.\" But Mr Peake said lessons should be learned from the space station, where astronauts from Russia and Western nations had successfully worked alongside each other for 25 years despite geopolitical tensions. \"I think as we move forward again and are focusing on the moon as a goal, we should embody this spirit of collaboration,\" he said. NASA is just weeks away from launching four astronauts on a mission to fly around the moon for the first time since the final Apollo landing in 1972. It'll be the first crewed flight of NASA's new SLS mega-rocket that will be the workhorse of the Artemis space programme. A test flight in 2022 without humans on board identified a series of serious problems with the crew capsule, but the agency is confident those have been fixed. \"This SLS rocket is only on its second mission, so there is definitely a greater level of risk associated with it,\" Mr Peake said. \"But the astronauts are completely committed to what they're doing, passionate about what they're doing, and all the experts who are working on the Artemis mission would have gone to every effort to make sure the risk is as low as possible.\"  The European Space Agency said earlier this month that an as-yet unnamed German astronaut will be the first from Europe to join a future Artemis mission to the moon. But Mr Peake, who retired from ESA in 2023, was confident the UK's turn would come. Rosemary Coogan, from Northern Ireland, is part of the agency's trained astronaut corps. \"It would be great to see that first European on the moon,\" he said. \"But I'd love to see a Union flag on the surface in the not-too-distant future.\""
    },
    {
        "title": "Sir Keir Starmer insists budget leaks and leadership speculation did not come from him",
        "description": "Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings.",
        "url": "https://news.sky.com/story/sir-keir-starmer-insists-budget-leaks-and-leadership-speculation-did-not-come-from-him-13483817",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-liaison-committee-keir-starmer_7111014.jpg?20251215144118",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-15 16:17:00",
        "Headline": "There were several leaks about the budget ahead of its delivery, and there have been claims other cabinet ministers are looking to take the PM's job.",
        "Content": " Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings. The prime minister told parliament's liaison committee a leak to the Financial Times 13 days before the budget, revealing a proposal to increase income tax had been dropped, was \"unacceptable\". \"It was not a briefing that was signed off by me or any of my ministers or officials,\" he told the committee, which is made up of the chairs of select committees. \"It was unacceptable.\" Politics latest: Starmer '10 out of 10' gutted about doctors' strike Asked about claims certain cabinet members are trying to replace Sir Keir as prime minister, he said: \"I can say, hand on heart, that none of it comes from me or is encouraged by me.\" He said briefing against cabinet ministers is \"completely unacceptable\" and said he has \"made that repeatedly clear to my staff, to the cabinet\". \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 The prime minister said he has put in place \"a number of procedures\" to \"give me a level of assurance\" that ministers, his team and staff are not the ones leaking. He said he has \"no reason to believe\" anybody in Number 10 leaked the plan to no longer increase income tax. Other budget details were also leaked, including a pay-per-mile levy on electric vehicles and a tourist tax. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Keir said he will wait for an inquiry into the budget leaks to conclude, but vowed: \"I'll get to the bottom of these leaks.\" Asked if he would be \"ruthless\" with whoever was responsible, he said: \"I want to stop these leaks.\" He said he would \"take action\" against individuals and said, although it is \"very difficult\" to find out the source, he has previously shown how he has \"acted accordingly\" during his time as prime minister, leader of the opposition and director of public prosecutions. Last week, Chancellor Rachel Reeves faced similar questioning at the Treasury select committee. She said the leaks were \"very damaging\" and \"we cannot allow this to happen again\". Ms Reeves said a review of Treasury processes is taking place and she has brought in the National Centre for Cyber Security to carry out a forensic examination of IT systems, after the Office for Budget Responsibility's assessment of the budget was accessible before she had announced it."
    },
    {
        "title": "Wrestling execs to pin down £5m funding for Project Fight launch",
        "description": "A British professional wrestler is in talks with potential backers to secure millions of pounds in funding for a revamped European series that will aim to capitalise on the sport&#8217;s British fan base.",
        "url": "https://news.sky.com/story/wrestling-execs-to-pin-down-1635m-funding-for-project-fight-launch-13483664",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trent-seven-wrestler_7110889.jpg?20251215121816",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-15 10:57:00",
        "Headline": "Ben Webb, a British pro wrestler, is working with Oakwell Advisory on plans for a revamped European series that would aim to capitalise on interest from millions of British fans, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British professional wrestler is in talks with potential backers to secure millions of pounds in funding for a revamped European series that will aim to capitalise on the sport’s British fan base. Sky News has learnt that Ben Webb, who participated in the WWE franchise under the name Trent Seven, is working with advisers to raise about £5m to help build Project Fight into \"Europe's number one televised wrestling brand\". Mr Webb has enlisted Oakwell, the sports advisory firm which is also working on efforts to attract private capital into British cycling, to advise on the fundraising and the development of the new product. Money latest: Christmas chocolates nearly double in price but shrink in size The Project Fight team is said to have held discussions with Sunset+Vine, the production company and Paramount, the owner of Channel 5 in the UK, about collaborating on the new venture. Talks with prospective investors are understood to have been underway for weeks. If successfully secured, the new funding would be raised at a pre-money valuation of roughly £10m. \n                  Strawberry fields forever? The West Sussex farm growing berries in December\n                 \n                  Caffe Nero boss has a warning for coffee drinkers | Money\n                 \n                  Sir Keir Starmer insists budget leaks and leadership speculation did not come from him\n                 The capital would allow Project Fight to break even in its third year, according to its architects. Mr Webb said the project's ambition was to \"transform the UK and European professional wrestling landscape and create a business valued at over £100m over the next five years\". It comes amid burgeoning interest in wrestling among international audiences, with Netflix drawing nearly 5 million global views for the debut of its RAW wrestling event in January. Meanwhile, All Elite Wrestling, founded in 2019, has a US broadcast deal with Warner Bros Discovery said to be worth at least $150m annually. Research suggests that up to six million people in Britain alone consider themselves to be wrestling enthusiasts, with Project Fight aiming to tap into that base and bridge the gap between die-hard and casual fans, while also aiming to support the independent wrestling scene. \"I built a company from a disused scout hut with 40 friends and family in the crowd and grew it organically to thousands at the NEC, all over the UK, Japan, Mexico, USA and the world, and it helped changed the landscape of British wrestling,\" Mr Webb told Sky News. \"There is a huge, passionate professional wrestling fanbase in the UK that lacks a domestic promotion to follow and is underserved by existing promotions.\" Mr Webb is a former two-times Tag Team Champion in WWE with 16 years' experience wrestling across the world for WWE, AEW, TNA, New Japan Pro Wrestling, and other backers. He also owns the Fight Club Pro brand, which has staged shows at the Birmingham NEC, as well as in Tokyo, Mexico and the US. Project Fight's advisory board includes Roger Draper, former chief executive of Sport England and the Lawn Tennis Association, and Peter Angell, the CEO of Sunset+Vine. The venture is also formulating a broader content distribution strategy aimed at utilising wrestlers' existing social media followers, and content-sharing partnerships with major wrestling-adjacent influencers. Mr Webb said Project Fight would have a gender-balanced roster, including female wrestlers from the UK, US, China, Japan, Australia, France, India, and Canada. The roster of wrestlers being lined up is said to have a combined social media following of more than 12 million. A premium pilot event is expected to take place next year, depending upon the successful completion of the fundraising."
    },
    {
        "title": "Angela Rayner calls on MPs to sit 'through the night' to get workers' rights bill through parliament",
        "description": "Angela Rayner has issued an angry call to MPs to sit \"through the night\" to stop hereditary peers delaying her flagship employment rights bill.",
        "url": "https://news.sky.com/story/angela-rayner-calls-on-mps-to-sit-through-the-night-to-get-workers-rights-bill-through-parliament-13483954",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-angela-rayner-resignation_7058347.jpg?20251022134544",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-12-15 22:10:00",
        "Headline": "The former deputy prime minister's flagship bill is being delayed by peers with just days to go before the Christmas break.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Angela Rayner has issued an angry call to MPs to sit \"through the night\" to stop hereditary peers delaying her flagship employment rights bill. In an outburst at the start of the latest \"ping pong\" between the Lords and Commons, she said: \"What's wrong with protecting people from unfair dismissal?\" The former deputy prime minister hit out at the delaying tactics of the House of Lords, with the clock ticking only days before parliament's Christmas recess. The bill now goes back to the Lords on Tuesday, when ministers hope peers will drop their opposition so the bill can receive royal assent by the time parliament rises on Thursday.  Ms Rayner's attack on hereditary peers followed a government defeat in the Lords by 24 votes last week, just days before Sir Keir Starmer created 25 new Labour peers. \"What message does this send to the British public, when 33 hereditary peers have tried to defeat the government by 24 votes on a manifesto promise on sick pay, for example, which will miss the deadline for April for some of the lowest earners from some of the wealthiest?\" she declared. \"Shouldn't we get on, go through the night if we have to, and get this bill passed?\" And employment minister Kate Dearden told MPs: \"We have been in ping pong for far too long, and further delay is not in anyone's best interest.\"   At the end of an hour-long debate, MPs voted by 311 votes to 96, a majority of 215, to remove a cap on unfair dismissal compensation, overturning a vote in the Lords last week. In its attempts to get the bill through the Lords, ministers have abandoned day one protection against unfair dismissal and, after a deal with trade unions, replaced it with a six-month qualifying period. But at the same time the government introduced an 11th hour measure to scrap compensation caps for unfair dismissal, which is currently 52 weeks' pay or £118,223, whichever is lower. Read more: Starmer insists budget leaks and leadership speculation did not come from him Shadow business secretary Andrew Griffith, who has led Tory opposition to the bill, attacked the removal of a cap. \"It wasn't in the manifesto, it wasn't in the bill, it wasn't in the impact assessment,\" he protested. Earlier, in a boost for the government, six business groups urged peers to back down and end the parliamentary \"ping pong\" between the Commons and the Lords. The groups, including the Confederation of British Industry (CBI) and the British Chamber of Commerce (BCC), fear the six-month unfair dismissal compromise agreed with the unions could be at risk. \"To avoid losing the six-month qualifying period, we therefore believe that now is the time for parliament to pass the bill,\" they urged in a letter to Business Secretary Peter Kyle. Mr Kyle said \"all parties... have made difficult but necessary compromises to bring this bill forward\" and urged \"everyone\" to recognise business groups and trade unions want it passed \"without further delay\"."
    },
    {
        "title": "Sir Keir Starmer insists budget leaks and leadership speculation did not come from him",
        "description": "Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings.",
        "url": "https://news.sky.com/story/sir-keir-starmer-insists-budget-leaks-and-leadership-speculation-did-not-come-from-him-13483817",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-liaison-committee-keir-starmer_7111014.jpg?20251215144118",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-15 16:17:00",
        "Headline": "There were several leaks about the budget ahead of its delivery, and there have been claims other cabinet ministers are looking to take the PM's job.",
        "Content": " Sir Keir Starmer has insisted none of the budget leaks and leadership speculation has come from him - as he vowed to \"get to the bottom\" of the briefings. The prime minister told parliament's liaison committee a leak to the Financial Times 13 days before the budget, revealing a proposal to increase income tax had been dropped, was \"unacceptable\". \"It was not a briefing that was signed off by me or any of my ministers or officials,\" he told the committee, which is made up of the chairs of select committees. \"It was unacceptable.\" Politics latest: Starmer '10 out of 10' gutted about doctors' strike Asked about claims certain cabinet members are trying to replace Sir Keir as prime minister, he said: \"I can say, hand on heart, that none of it comes from me or is encouraged by me.\" He said briefing against cabinet ministers is \"completely unacceptable\" and said he has \"made that repeatedly clear to my staff, to the cabinet\". \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 The prime minister said he has put in place \"a number of procedures\" to \"give me a level of assurance\" that ministers, his team and staff are not the ones leaking. He said he has \"no reason to believe\" anybody in Number 10 leaked the plan to no longer increase income tax. Other budget details were also leaked, including a pay-per-mile levy on electric vehicles and a tourist tax. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Keir said he will wait for an inquiry into the budget leaks to conclude, but vowed: \"I'll get to the bottom of these leaks.\" Asked if he would be \"ruthless\" with whoever was responsible, he said: \"I want to stop these leaks.\" He said he would \"take action\" against individuals and said, although it is \"very difficult\" to find out the source, he has previously shown how he has \"acted accordingly\" during his time as prime minister, leader of the opposition and director of public prosecutions. Last week, Chancellor Rachel Reeves faced similar questioning at the Treasury select committee. She said the leaks were \"very damaging\" and \"we cannot allow this to happen again\". Ms Reeves said a review of Treasury processes is taking place and she has brought in the National Centre for Cyber Security to carry out a forensic examination of IT systems, after the Office for Budget Responsibility's assessment of the budget was accessible before she had announced it."
    },
    {
        "title": "US and China should collaborate on new trips to the moon, says British astronaut Tim Peake",
        "description": "British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\".",
        "url": "https://news.sky.com/story/us-and-china-should-collaborate-on-new-trips-to-the-moon-says-british-astronaut-tim-peake-13483517",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tim-peake-nasa_7110432.jpg?20251215023010",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-15 02:02:00",
        "Headline": "In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Tim Peake urges the powers to co-operate rather than race in a new era of hazardous lunar exploration.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  British astronaut Tim Peake has urged the US and China to de-escalate talk of a space race and instead return to the moon with a \"spirit of collaboration\". In an interview with Sky News to mark the 10th anniversary of his launch to the International Space Station (ISS), Mr Peake said it would be \"foolish\" to start a new era of hazardous lunar exploration without contingency plans for rescuing astronauts from other countries in an emergency. \"Space is incredibly hard, a very hostile environment,\" he said. \"It would be foolish to not have things like common docking systems so that we can help each other out if people got into trouble. \"That's the whole spirit of exploration. Okay, we might be coming from different positions, but we're also one species and there to cooperate and collaborate.\" Sean Duffy, the acting NASA chief, has vowed the US will build a sustainable presence on the moon before China. \"We're going back to the moon - and this time when we plant our flag, we stay,\" he said in a NASA video in September. \n                  Blue Origin sends NASA spacecraft to Mars and lands booster for first time - heating up race with Elon Musk's SpaceX\n                 \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job\n                 \"Our mission is maintaining American dominance in space. \"China wants to get there, but we're getting there first. We will win the second space race.\" But Mr Peake said lessons should be learned from the space station, where astronauts from Russia and Western nations had successfully worked alongside each other for 25 years despite geopolitical tensions. \"I think as we move forward again and are focusing on the moon as a goal, we should embody this spirit of collaboration,\" he said. NASA is just weeks away from launching four astronauts on a mission to fly around the moon for the first time since the final Apollo landing in 1972. It'll be the first crewed flight of NASA's new SLS mega-rocket that will be the workhorse of the Artemis space programme. A test flight in 2022 without humans on board identified a series of serious problems with the crew capsule, but the agency is confident those have been fixed. \"This SLS rocket is only on its second mission, so there is definitely a greater level of risk associated with it,\" Mr Peake said. \"But the astronauts are completely committed to what they're doing, passionate about what they're doing, and all the experts who are working on the Artemis mission would have gone to every effort to make sure the risk is as low as possible.\"  The European Space Agency said earlier this month that an as-yet unnamed German astronaut will be the first from Europe to join a future Artemis mission to the moon. But Mr Peake, who retired from ESA in 2023, was confident the UK's turn would come. Rosemary Coogan, from Northern Ireland, is part of the agency's trained astronaut corps. \"It would be great to see that first European on the moon,\" he said. \"But I'd love to see a Union flag on the surface in the not-too-distant future.\""
    },
    {
        "title": "Rob Reiner death: 'Sick' Trump sparks backlash with 'disgusting' post about murdered film director",
        "description": "Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner.",
        "url": "https://news.sky.com/story/rob-reiner-death-sick-trump-sparks-backlash-with-disgusting-post-about-murdered-film-director-13483564",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rob-reiner-michele-singer-reiner_7110445.jpg?20251215194001",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-15 07:29:00",
        "Headline": "The US president says Rob Reiner had \"TRUMP DERANGEMENT SYNDROME\" in an online post after he and his wife, Michele Singer Reiner, were found dead.",
        "Content": " Donald Trump has been branded \"a sick man \" after launching an extraordinary attack against murdered film director Rob Reiner. The Hollywood luminary was found stabbed to death with his wife on Sunday - and the filmmaker's son had been arrested on murder charges. Reacting to news of his death, the US president said in a post on Truth Social that Reiner was \"tortured and struggling, but once very talented movie director and comedy star\". Mr Trump said Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS\". \"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before. May Rob and Michele rest in peace,\" Mr Trump wrote. Celebrities and politicians have criticised Mr Trump for his comments, labelling them \"disgusting\" and \"petty\". 'Can you get any lower?' \"What a disgusting and vile statement,\" actor Patrick Schwarzenegger said on X, while Californian Democrat Zoe Lofgren condemned Mr Trump's comments as \"a new low for this petty, hateful man\". Talk show host Whoopi Goldberg compared the president's comments to those he made after the assassination of right-wing activist Charlie Kirk, when Mr Trump hit out at critics. \"I don't understand the man in the White House. He spoke at length about Charlie Kirk and about caring, and then this is what he puts out. Have you no shame? No shame at all? Can you get any lower? I don't think so,\" she said. 'Sick' \"This is a sick man,\" California governor Gavin Newsom wrote on X. Republican US House member Thomas Massie also addressed the comments, saying: \"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered.\" Meanwhile, Reiner's son, Nick, 32, has been \"booked for murder\", Los Angeles police chief Jim McDonnell said. The LAPD later said Nick Reiner remains in custody without bail. Mr McDonnell said the department's robbery and homicide division was handling the investigation. \"They worked throughout the night on this case and were able to take into custody Nick Reiner, a suspect in this case,\" he said, calling the deaths \"a very tragic incident\". It comes as it emerged Nick was reportedly disruptive when he joined his father and mother, Michele Singer Reiner, at a party hosted by comedian Conan O'Brien on Saturday night, the day before the killings. Reiner and his wife were upset and embarrassed about their son's behaviour, Sky News's US partner NBC News cited a source as saying, and expressed concerns about his health. The outlet cited another source saying Nick's behaviour had made other guests uncomfortable. They said he interrupted a conversation comedian and filmmaker Bill Hader was having with two guests and, when told it was a private conversation, stood still and stared before storming off. Reiner and his wife apparently died of stab wounds, US media reported. The Los Angeles Fire Department said a 78-year-old man and a 68-year-old woman were found dead inside a property in the Brentwood neighbourhood, without identifying the victims. The victims were later confirmed to be Reiner and his wife. The case against Nick Reiner will be presented to the Los Angeles county district attorney's office for filing consideration on Tuesday, according to the LAPD. Nick Reiner has spoken publicly of his struggles with addiction after he had cycled in and out of treatment facilities by the age of 18, with periods of homelessness and relapses in between. Reiner and his son explored their difficult relationship and Nick Reiner's struggles with heroin addiction and homelessness in a 2016 film called Being Charlie, which they co-wrote. Republican congresswoman Marjorie Taylor Greene referred to Nick Reiner's \"drug addiction and other issues\" in a statement on X. \"This is a family tragedy, not about politics or political enemies,\" Ms Taylor Greene said. \"Many families deal with a family member with drug addiction and mental health issues. It's incredibly difficult and should be met with empathy especially when it ends in murder.\" Reiner was a celebrated director whose work included some of the most memorable movies of the 1980s and 1990s. He directed classics such as This Is Spinal Tap, The Princess Bride, When Harry Met Sally, A Few Good Men and Stand By Me. He also acted, starring in Sleepless In Seattle and The Wolf Of Wall Street among others. His most recent high-profile work was a recurring guest role in the hit show The Bear. He met Michele Singer in 1989, while directing When Harry Met Sally. They have three children together. Singer used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal. Former US president Barack Obama has led tributes. He wrote on X that \"Michelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele. Rob's achievements in film and television gave us some of our most cherished stories on screen\". Harry Shearer, who collaborated with Reiner on This Is Spinal Tap, said in a statement: \"Rob was a friend and collaborator through much of my life. He was funny, he was smart, he was a mensch.\" He said Reiner's wife was a \"very good friend\" to his own wife, Judith, adding: \"This is unspeakable, the stuff of Greek tragedy.\" Christopher Guest, who starred in Reiner's films This Is Spinal Tap and The Princess Bride, and his wife Jamie Lee Curtis said in a joint statement that they were \"numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner\". The couple said: \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis. We have lost great friends. Please give us time to grieve.\" Read more: Reiner spoke to Eric Idle about future before death Reiner was a champion of liberal causes and a political activist. In the 2004 presidential election, he backed Democrat candidate John Kerry and featured in advertisements taking aim at incumbent president George W Bush. Reiner also supported Democratic presidential hopefuls Al Gore and Hillary Clinton. \"This is a devastating loss for our city and our country. Rob Reiner's contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" Los Angeles mayor Karen Bass said. California governor Mr Newsom paid tribute to Reiner's activism as he said he was \"heartbroken\" over the director's death. \"Rob was a passionate advocate for children and for civil rights - from taking on Big Tobacco, fighting for marriage equality, to serving as a powerful voice in early education,\" Mr Newsom said in a statement. \"He made California a better place through his good works. Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.\" Read more from Sky News:Four charged with California bomb plotAustralian PM reveals details about Bondi killers Former House speaker, Democrat Nancy Pelosi, said: \"Personally, Rob cared deeply about people and demonstrated that in his civic activities - whether by supporting the First 5 initiative or fighting against Prop 8 in California. \"Civically, he was a champion for the First Amendment and the creative rights of artists. And professionally, he was an iconic figure in film who made us laugh, cry and think with the movies he created.\""
    },
    {
        "title": "Sir Cliff Richard says he has been treated for prostate cancer",
        "description": "Sir Cliff Richard has revealed he has been treated for prostate cancer during the past year.",
        "url": "https://news.sky.com/story/sir-cliff-richard-has-been-treated-for-prostate-cancer-13483538",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cliff-richard-music_7110560.jpg?20251215080049",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-15 06:22:00",
        "Headline": "The 85-year-old said the cancer was detected in a health check-up ahead of a tour of Australia and New Zealand.",
        "Content": " Sir Cliff Richard has revealed he has been treated for prostate cancer during the past year. The 85-year-old singer said his cancer had \"gone at the moment\" and backed calls for a national screening test for men. In an interview with Good Morning Britain, he said: \"I was about to embark on a tour... I was going to Australia and New Zealand, and the promoter said 'well we need your insurance, so you'll need to be checked up for something'. \"They found I had a prostate with cancer, but the good fortune was it was not very old. And the other thing is that it had not metastasized. It hadn't moved into bones or anything like that. \"And the cancer's gone at the moment, I don't know whether it's going to come back. I mean you can't tell with those sort of things, but we need to absolutely, I'm convinced, get there, get tested, get checked. \"I think we as men... we've got to be seen as human beings who may die of this thing.\" Sir Cliff made the revelation in conversation with former Sky News presenter, Dermot Murnaghan, who has himself been diagnosed with stage four prostate cancer. \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  Prostate cancer treatment with potential for fewer side effects to be trialled in UK\n                 \n                  Why prostate cancer is expected to be left as the only major cancer without national screening\n                 Mr Murnaghan asked the singer whether he backed calls for a national prostate cancer screening programme, given that the disease is \"the most prevalent cancer amongst men\". Lending his support, Sir Cliff replied: \"We have governments to look after our country and those who live in that country. We all deserve to have the same ability to have a test and then start the treatments really early. \"It's only been one year now I've been in touch with cancer, but in point of fact, every time I've talked with anybody, this has come up, and so I think our government must listen to us.\" Last month the UK National Screening Committee decided not to recommend mass screening for prostate cancer, saying the measure was \"likely to cause more harm than good\". Instead, it proposes a targeted screening programme every two years for men with specific genetic mutations, known as BRCA-1 and BRCA-2, between the ages of 45 and 61. The news comes after King Charles revealed he had reached a \"milestone\" in his own fight with cancer, and would be able to reduce his schedule of treatment in the new year.  He credited the \"personal blessing\" to early diagnosis when he announced the news on Friday. The King had said: \"Early diagnosis quite simply saves lives. \"Now, I have heard this message repeatedly during my visits to cancer centres across the country. I know too what a difference it has made in my own case, enabling me to continue leading a full and active life, even while undergoing treatment. \"Today, I am able to share with you the good news that thanks to early diagnosis, effective intervention and adherence to 'doctors' orders', my own schedule of cancer treatment can be reduced in the new year.\" He continued: \"This milestone is both a personal blessing and a testimony to the remarkable advances that have been made in cancer care in recent years; testimony that I hope may give encouragement to the 50% of us who will be diagnosed with the illness at some point in our lives.\" Buckingham Palace has not revealed what kind of cancer the King has, though it is confirmed not to be prostate cancer. Read more:King 'deeply touched' by reaction to cancer 'good news'NHS to offer same-day prostate cancer diagnosis Mr Murnaghan asked Sir Cliff whether his own charitable efforts could be co-ordinated with the King's on the issue of early screening. The pop icon replied: \"I'm sure! I mean, why not? I've been involved with many charities over the years, and if the king is happy to front it for us, I'm sure loads of people... I certainly would join him, I'm sure you would. \"If the King is listening, then I'm sure most of us would say, yeah, we're available.\""
    },
    {
        "title": "Rob Reiner spoke to Eric Idle about future before he and wife were killed",
        "description": "Hollywood director Rob Reiner was discussing his future in one of his final conversations before he and his wife were stabbed to death, Monty Python star Eric Idle has revealed.",
        "url": "https://news.sky.com/story/rob-reiner-spoke-to-eric-idle-for-over-an-hour-on-the-night-he-died-13483633",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rob-reiner-eric-idle_7110799.jpg?20251215112031",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-15 10:31:00",
        "Headline": "The director talked about \"filming at Stonehenge and his thoughts for the future\", according to his friend, the Monty Python star Eric Idle.",
        "Content": " Hollywood director Rob Reiner was discussing his future in one of his final conversations before he and his wife were stabbed to death, Monty Python star Eric Idle has revealed. The bodies of Reiner and his wife, the photographer Michele Singer Reiner, were found at their Los Angeles home with stab wounds on Sunday. One of his last conversations was with Idle, it has now emerged. Writing on X on Monday, the Monty Python star wrote: \"Rob Reiner was a lovely man. I spoke to him last night for over an hour. I always enjoyed his company. I met him at his Dad's in 1975. \"He was telling me about filming at Stonehenge and his thoughts for the future. This is so awful. I shall miss him. A clever, talented and very thoughtful man. So awful.\" Beyond Hollywood, the Reiners were known for their politics - both were vocal supporters of the Democratic Party. Former US president Barack Obama was among those paying tribute, writing on X: \"Michelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele. \n                  Trump sues BBC for $5bn in defamation lawsuit\n                 \n                  Four charged with New Year's Eve plot to bomb multiple targets in California\n                 \n                  Rob Reiner death: 'Sick' Trump sparks backlash with 'disgusting' post about murdered film director\n                 \"Rob's achievements in film and television gave us some of our most cherished stories on screen. \"But beneath all of the stories he produced was a deep belief in the goodness of people - and a lifelong commitment to putting that belief into action. \"Together, he and his wife lived lives defined by purpose. They will be remembered for the values they championed and the countless people they inspired. \"We send our deepest condolences to all who loved them.\" Reiner, son of the comic actor Carl Reiner, rose to prominence on the small screen, winning two Primetime Emmy Awards for his depiction of Mike \"Meathead\" Stivic in the CBS sitcom All In The Family. But he was perhaps best known for his work as a director, including the iconic 1984 mockumentary This Is Spinal Tap, and films like The Princess Bride, When Harry Met Sally, and A Few Good Men. Reiner's friend Josh Gad, known as the voice of Olaf in Disney's Frozen franchise, called him \"one of the greatest directors of our time\". He wrote on Facebook: \"He was a friend. He was simply a beautiful person. Rob Reiner and his wife Michelle [sic] were two of the most kind and caring souls you could ever imagine. \"He cared so much for those who had no voices. This loss is devastating. I cannot express how much this hurts. Love you Rob and Michelle [sic]. Thank you for all you gave us.\" Actor James Woods, a staunch Donald Trump supporter, spoke of his \"love and respect\" for his contemporary. He wrote: \"Rob and I remained good friends ever since we made Ghosts Of Mississippi. The studio didn't think I was old enough to do the part, but Rob fought for me. \"Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.\" Ben Stiller said Reiner was \"one of my favourite directors\" and called his death a \"huge loss\". He wrote: \"He made some of the most formative movies for my generation. \"He came out from behind a huge comedic shadow of the great Carl Reiner and being a TV actor to being a great director who made an incredible run of movies. \"Spinal Tap is one of the best comedies ever made - and the list goes on. He was a kind caring person who was really really funny.\" \"I didn't know him well but was always a fan and I feel a real sadness for those who did, and his family.\" Actor Paul Walter Hauser wrote: \"Grieving the loss of my favourite director of all-time. A Few Good Men is THE reason I became an actor, and Rob's filmography behind the camera is THE reason I wanted to direct and still do.\" On X, actor Elijah Wood posted simply: \"Horrified to hear of the passing of Rob Reiner and his wonderful wife Michelle [sic]. So much love to their kids and family.\""
    }
]