[
    {
        "title": "The online drug trade behind QR code stickers plastered on streets across the UK ",
        "description": "Steve first spotted the eye-catching stickers while walking to the shops in Burton upon Trent. Plastered on bins and lamp posts, they featured a shiny, green cannabis leaf with a QR code and the words \"get your delivery\".",
        "url": "https://news.sky.com/story/the-online-drug-trade-behind-qr-code-stickers-plastered-on-streets-across-the-uk-13365660",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cannabis-stickers_6914428.jpg?20250512174626",
        "type": "Home",
        "Author": "Henry Vaughan, Tom Cheshire, data and forensics correspondent, and Sam Doak, OSINT producer",
        "Date Published": "2025-05-12 23:00:00",
        "Headline": "A Sky News investigation has uncovered the complex gang network running a brazen cannabis home delivery operation.",
        "Content": "By Henry Vaughan, Tom Cheshire, data and forensics correspondent, and Sam Doak, OSINT producer  Steve first spotted the eye-catching stickers while walking to the shops in Burton upon Trent. Plastered on bins and lamp posts, they featured a shiny, green cannabis leaf with a QR code and the words \"get your delivery\". The former prison officer, who is in his 50s, wanted to try the Class B drug as an alternative to prescribed opiates to ease his pain after breaking his back in three places. He had only recently moved to the Staffordshire market town and was reluctant to buy off the street. \"I didn't want to just tap up some roadman,\" he says. Using his smartphone camera, he was taken to a slick, colourful site on the open web offering a wide range of cannabis products - from vapes and tinctures to pre-rolled joints, buds and gummies. Just like legitimate online shops, it promised free delivery to arrive the next day and had glowing reviews on Google and Trustpilot. Steve (not his real name) went on to order products including vapes and herbal cannabis. \"The first time I was shaking… when the postman came down the path - the package absolutely stank,\" he says. \"It's letterbox shaped so you don't get a knock. The postman shoves it through your door and that's it - job done.\" Similar stickers have been reported across the UK, from cities such as Birmingham, Glasgow and London, to smaller towns including Shrewsbury, in Shropshire, and Droitwich, in Worcestershire. There have also been sightings in South Wales. Some have appeared near schools, universities and police stations. Hidden gang network  A Sky News investigation has identified three different sticker designs, each of which directs users to separate, but linked, websites (which we are not naming), with their own branding. Hidden in their source code is a long list of bank accounts and business names which are randomly selected when users make a purchase. Using publicly available tools, we were able to build a network map of the businesses involved, the people behind them and how they are linked. All are Lithuanian nationals, mostly registered to addresses in a small area of east London, one of which is linked to an alleged gangster found guilty of kidnap and torture in Lithuania. Royal Mail tracking details also suggest the operation is based in this area as the packages passed through Romford’s mail centre. An analysis of Bitcoin wallets - carried out by TRM Labs - shows one of the sites had received around $109,000 (£82,000) by mid-March, although the true income is likely to be far higher as more buyers use regular bank transfers than cryptocurrency. When we visited a woman who owns two of the houses associated with the bank accounts, she said she had never heard of the website and had no idea a criminal enterprise may be being run from her properties. She also said three Lithuanian nationals we identified as being connected with the site had left the UK. Former head of drugs threat and intelligence for the National Crime Agency (NCA), Tony Saggers, says the scale of the operation suggests those behind it have access to wholesale quantities of cannabis, which has probably been grown in the UK. It also demonstrates the \"evolution of online drug markets\" from the dark web to open websites, \"making them more accessible to the wider population\", he tells Sky News. Ben (not his real name), a student in his early 20s, scanned a QR code sticker out of \"genuine curiosity\" after spotting it on a telecoms cabinet near the University of York. He'd never bought or used drugs before but says he \"had a moment of free will and the risk of losing money was minimal so I tried it\". \"Perhaps it's something to do with the website, it's like you are buying a professional regulated product so that made me worry less.\" A £10 pre-rolled joint arrived by Royal Mail first class post in \"branded packaging and looked clean and professional\". However, he says he didn't enjoy smoking it and for his \"mental health\" hasn't bought any more. 'Russian roulette' Dr Simon Erridge, research director at Curaleaf Clinic, where specialist doctors can legally prescribe medical cannabis, says people like Steve and Ben are playing \"Russian roulette\". The clinic has run a campaign using its own QR code stickers, which direct people to results from its study with Manchester Metropolitan University. It found 90% of 60 illegal cannabis samples seized by the Greater Manchester and Northumbria police forces were contaminated with mould, yeast, lead, E.coli or salmonella. An analysis of WEDINOS data, a service that tests drugs sent in by users, found 43% of the 1,635 samples bought as cannabis contained no compounds naturally derived from the plant. Some 38% contained harmful substances, with 27% containing synthetic chemicals such as spice, a drug which is popular in prisons and that can cause dangerous side effects including cardiac arrest. The clinic's research also shows consumer habits are changing. A survey of 500 cannabis users last year found that while street dealers are still the most common source (45%), just above friends and family (44%), more people are buying online. Some 7% said they had engaged with QR codes, while the use of websites offering illegal cannabis products almost doubled from 6% in 2022 to around one in ten (11%) in 2024. The trend is even more pronounced among young adults, with 15% of 18-24-year-olds buying cannabis online. Sarah (not her real name), a professional in her 40s, says \"buying on the streets isn't an option for me\". She has bought fake cannabis vapes through Instagram in the past. But she says tests confirmed THC was present in a vape she bought through one of the websites. It's illegal to possess and sell products containing THC without a prescription, but Sarah says she's more worried about losing money if the package gets intercepted. \"I don't think the police would do much anyway,\" she says. What are police doing about it? Supply can carry a maximum 14-year prison sentence, with five years for possession, although those caught with a small amount of cannabis are often dealt with by way of a warning or on-the-spot fine. Police are aware QR code stickers are being used to sell drugs and see it as part of the evolution of how criminals have adopted technology. They believe they could be used as evidence in future prosecutions, although none of the forces we contacted, where the issue has been reported, were able to point to any arrests. Derbyshire Police says officers are on the look-out for stickers and will remove them when out on patrol but have not yet been able to identify the people responsible. Detective Constable Matt Pedrick, from West Mercia Police, another area where the stickers have been reported, says any website advertising the sale of cannabis \"is probably based outside the UK\". \"We remove the stickers when we find them, and would advise anyone to steer clear of these websites and to remember that drugs laws apply to all drugs regardless of where they are purchased.\" Police also believe the stickers aren't just a matter for their officers and want councils, businesses and transport companies to remove them - and for postal services to ensure they're not inadvertently helping supply drugs. Read more from Sky News:Driver who used car to murder e-bike rider is jailedCrossbow attack suspect died from self-inflicted gunshot Ex-NCA officer Tony Saggers says the brazen nature of the operation suggests those behind it are \"laughing in the face of law enforcement\" but doesn't think it represents decriminalisation by the back door. He says the combination of an online marketplace and a drug that's a lower priority for police \"make it easier for some people to get away with that for periods of time\". \"But I wouldn't ever suggest that they're always going to get away with it because people's time does come round,\" he says. \"And if a site that's doing well and selling high volumes and increasingly high volumes continues to be successful, they're more likely to attract attention.\" We contacted the NCA about our findings. “Many organised crime groups selling drugs use social media and communication platforms to promote and sell their illicit produce,\" it said in a statement. “The NCA is working with partners across law enforcement and government to tackle drug trafficking. They suggested we contact the Metropolitan Police and Ofcom, which regulates the postal service. The Met pointed us to the National Police Chiefs' Council (NPCC) because \"the website covers the UK\", but the NPCC wouldn't provide a comment on the record."
    },
    {
        "title": "Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes",
        "description": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes.",
        "url": "https://news.sky.com/story/fire-at-sir-keir-starmers-house-in-north-london-investigated-by-police-13366745",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-house_6914629.jpg?20250512231945",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-12 15:05:00",
        "Headline": "The entrance to Sir Keir Starmer's house was damaged in the fire. Nobody was hurt and a police cordon remains in place.",
        "Content": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes. The Metropolitan Police said on Monday evening that detectives are checking a vehicle fire in NW5 last week and a fire at the entrance of a property in N7 on Sunday to see whether they are connected to the fire at Sir Keir Starmer's house in the early hours of Monday morning. The prime minister is understood to still own the home and used to live there before he and his family moved into 10 Downing Street after Labour won last year's general election. It is believed the property is being rented out. Counter-terrorism police are leading the investigation as a precaution, the Met said. The blaze damaged the entrance to the house, but there were no injuries, the force said. Politics latest: Starmer announces migration crackdown A statement from the Metropolitan Police said: \"On Monday 12 May at 1.35am, police were alerted by the London Fire Brigade to reports of a fire at a residential address. \n                  Sir Keir Starmer's migration package is significant - but will it be enough?\n                 \n                  Migration - Is Labour Reform-ing?\n                 \n                  Is this Sir Keir Starmer's biggest week as PM?\n                 \"Officers attended the scene. Damage was caused to the property's entrance, nobody was hurt. \"As a precaution and due to the property having previous connections with a high-profile public figure, officers from the Met's Counter Terrorism Command are leading the investigation into this fire. Enquiries are ongoing to establish the potential cause of the fire.\" A police cordon and officers, as well as investigators from London Fire Brigade, could be seen outside and at one point, part of the street was cordoned off to all vehicles. London Fire Brigade said firefighters were called just after 1am, and the blaze was out within half an hour. It described the incident as \"a small fire outside a property\". Read more:What are Mr Starmer's new immigration rules?Why movie line reflects public mood on prisonsHow PM sealed Trump trade deal Sir Keir expressed his gratitude to the police and fire services via his official spokesman, who said: \"I can only say that the prime minister thanks the emergency services for their work, and it is subject to a live investigation. So I can't comment any further.\" On Monday, Sir Keir made a major policy speech on immigration, promising to bring down net migration by the end of this parliament with a system that is \"controlled, selective and fair\". He did not clarify how far he wants figures to fall, only saying numbers will come down \"substantially\" as he set out plans in the government's Immigration White Paper, including banning care homes from hiring overseas."
    },
    {
        "title": "Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer",
        "description": "US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said.",
        "url": "https://news.sky.com/story/minister-does-not-rule-out-supermax-prisons-for-most-dangerous-offenders-following-alleged-rudakubana-attack-13366851",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-crime-preston-prison_6913736.jpg?20250512001252",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-12 18:36:00",
        "Headline": "James Timpson tells the Politics Hub with Sophy Ridge that community sentences should also be considered for non-violent offenders.",
        "Content": " US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said. James Timpson told the Politics Hub with Sophy Ridge that \"we shouldn't rule anything out\" when asked if the most dangerous criminals should be placed in top security prisons. It comes after Southport triple killer Axel Rudakubana allegedly threw boiling water from a kettle at an officer at HMP Belmarsh on Thursday. Police are now investigating. Politics latest: PM has undergone a 'miraculous conversion', say Tories  Before that, three prison officers were also allegedly attacked by 28-year-old Hashem Abedi - the brother of Manchester Arena bomber Salman Abedi - with hot cooking oil and \"improvised knives\", potentially made from a baking tray. Speaking from HMP Preston for a special programme of the Politics Hub, Mr Timpson told Sophy Ridge: \"We inherited a complete mess in the prison system. \"Violence is up, assaults on staff is up. But for me, we shouldn't rule anything out.\" \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 \n                  Woman says she was 'junkie, shoplifter' - here's what turned her life around\n                 \n                  Prison officer says his 'greatest fear' is colleague getting murdered on duty\n                 He added: \"What we need to do is to speak to our staff. They're the experts at dealing with these offenders day in, day out. \" Mr Timpson - who was the chief executive of Timpson Group before he was appointed prisons minister last year - said the violence in prisons was \"too high\".  He continued: \"The number of people when you have prisons are so full, and the people in there are not going to education or into purposeful activity. \"You get more violence and that is totally unacceptable. Our staff turn up to work to help turn people. \"They want to turn people's lives around. They didn't turn up to work to get assaulted. It's totally unacceptable.\" Read more: Should some women offenders be spared jail? Prison officer 'will be killed if government does not get a grip' Reflecting on the crisis facing the UK prison system ahead of the government's sentencing review, Mr Timpson said a major problem was the high rate of reoffending, saying \"80% of offending is reoffending\". He said people were leaving places like HMP Preston \"addicted to drugs, nowhere to live, mental health problems - and that's why they keep coming back\". Asked whether every prison had a drugs issue, he replied: \"100%.\" \"If we want to keep the public safe, we need to do a lot more of the work in here and in the community. But also we need to build more prisons.\" Put to him that making more use of community sentences - thought to be one of the recommendations in the government's sentencing review - might be considered a \"cushy option\" compared to a custodial sentence, Mr Timpson said: \"There are some people in this prison tonight who would prefer to be in prison than do a community sentence - but that's not everybody. \"Community sentences need to be tough punishments outside of prison, not just to help them address their offending behaviour, but also the victims need to see punishments being done too and for me, technology has a big part to play in the future.\""
    },
    {
        "title": "Man jailed for Diane Sindall murder in 1986 could have conviction quashed",
        "description": "A man jailed for murder nearly 40 years ago could have his conviction quashed by the Court of Appeal today, ending what's thought to be the longest-running miscarriage of justice in British history.",
        "url": "https://news.sky.com/story/man-jailed-for-diane-sindall-murder-in-1986-could-have-conviction-quashed-13364302",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-diane-sindall-peter-sullivan_6910154.jpg?20250508162400",
        "type": "Home",
        "Author": "Greg Milam",
        "Date Published": "2025-05-12 23:00:00",
        "Headline": "Peter Sullivan was convicted of murdering Diane Sindall in Birkenhead in August 1986. The 21-year-old florist had been beaten and raped and left in an alleyway.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n A man jailed for murder nearly 40 years ago could have his conviction quashed by the Court of Appeal today, ending what's thought to be the longest-running miscarriage of justice in British history. Peter Sullivan was convicted of murdering Diane Sindall in Birkenhead in August 1986. The 21-year-old florist had been beaten and raped and left in an alleyway. Mr Sullivan has always maintained his innocence and new tests ordered by the Criminal Cases Review Commission have revealed his DNA was not present on samples preserved at the time. Merseyside Police have confirmed detectives are now \"carrying out an extensive investigation in a bid to identify who the new DNA profile belongs to, as to date there is no match on the national DNA database\". Detectives are also contacting individuals identified in the original investigation to request voluntary DNA samples. That original investigation was the largest in the force's history and, for many officers, the \"frenzied\" nature of the attack made it the worst case they had ever encountered. Diane, who was engaged to be married, had just left her shift as a part-time barmaid at a pub in Bebington when her small blue van ran out of petrol. \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 \n                  Syrian man who fled UK after raping 15-year-old girl near Hampden Park is jailed\n                 \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 She was walking to an all-night garage when she was attacked. Mr Sullivan, who was 29 at the time and described as a loner, initially denied the attack but later signed a confession. Questions have since been raised about whether he had proper legal representation during police interviews. Evidence related to bite marks on Diane's body, considered crucial at the trial, has also since been called into question. At the time of Mr Sullivan's trial in 1987, DNA technology was not available and subsequent requests for new tests had been refused. In its statement, Merseyside Police said: \"In November 2024, the Criminal Cases Review Commission announced that Peter Sullivan's murder conviction was being referred to the Court of Appeal due to the discovery of new DNA evidence, which was not available at the time of the trial. \"There have been significant developments in the use and understanding of DNA evidence in criminal investigations, that was still in its infancy at the time of the murder of Diane Sindall. \"These developments have led to the discovery of the new evidence.\" Read more from Sky News:Weight loss jabs 'could almost halve risk of cancer'Pope Leo calls for end to polarising 'war of words' The murder sent a chill through the community. On the grass verge close to where Diane's body was found, a memorial stone has been placed in memory of her and \"and all of our sisters who have been raped and murdered\". Diane Sindall's family told Sky News they did not want to comment on the case."
    },
    {
        "title": "Islamic State fighters who return to the UK must face justice, committee says",
        "description": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said.",
        "url": "https://news.sky.com/story/islamic-state-fighters-who-return-to-the-uk-must-face-justice-committee-says-13366924",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-khaled-brigade-syria_6786301.jpg?20241227150134",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-12 22:28:00",
        "Headline": "More than 400 people who fought for ISIS in Syria and Iraq are believed to have later returned to the UK, without being prosecuted. A new report is calling for changes to the law to help authorities be better equipped to go after them.",
        "Content": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said. More than 400 people who fought for the group, also called ISIS and Daesh, are thought to have then returned to the UK, after travelling to the Middle East. ISIS once held swathes of land in Syria and Iraq and was responsible for widespread campaigns of terror, murder, and rape. This often targeted minority religious groups like the Yazidis. Sky News recently released a documentary on ISIS and the Yazidis, led by special correspondent Alex Crawford. Crawford gave evidence to parliament's Joint Committee on Human Rights (JCHR), which in a new report has warned that none of the ISIS supporters who had made their way back to the UK had been successfully prosecuted. It called on the government to take steps to ensure they can be tried in British courts, after ministers previously claimed such crimes were \"best investigated and prosecuted under local laws\" - meaning abroad. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Yazidi women still enslaved in ISIS detention camps, Sky News documentary reveals\n                 \n                  Five jihadists found guilty of holding French journalists hostage\n                 'The UK cannot wash its hands of this' \"Where the UK has jurisdiction over international crimes, the UK should seek to investigate and prosecute such crimes,\" the committee's latest report said. However, the report said that UK courts faced a \"key barrier\" to delivering justice on war crimes and genocide. This was because it is not possible to prosecute people for these crimes unless they are UK nationals, residents or \"subject to service personnel laws\". The committee said ministers should use the Crime and Policing Bill, currently making its way through parliament, to amend the law. Read more:The camps full of the radicalised children of ISThe Londoner locked up in a forgotten prison Lord Alton, chairman of the JCHR, said: \"This is not something the UK can simply wash its hands of because it happened overseas. \"We know that British nationals committed the most horrendous crimes in Iraq and Syria under the Daesh [ISIS] regime and we have a duty to see them brought to justice. \"To date, no Daesh fighters have been successfully prosecuted for international crimes in the UK and we find this unacceptable.\" The committee added that more must also be done to repatriate children held in camps in northeast Syria where former ISIS fighters and their families are being held. 'There are no rights for anything' Crawford was one of those who gave evidence to the committee. She first met Yazidi women captured by ISIS in 2014, and has covered the topic a number of times since, including most recently in the 10 Years Of Darkness: ISIS & The Yazidis documentary. She told the committee the camps in northeast Syria were \"filled with hopelessness and helplessness, and a really strong anger and frustration\".  \"There are multiple human rights concerns,\" she said, adding that those living there essentially had no rights. She went on: \"There is no right of freedom. There is no right to access to legal representation. There are no rights for anything. \"Many of the children - I do not know how many - have been born there. \"They are very young - younger than six - so many of them have been born there in, to be honest, very dirty, disgusting conditions.\""
    },
    {
        "title": "Sean 'Diddy' Combs forced women into 'freak offs', jurors told - as hotel CCTV is played in court",
        "description": "Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial.",
        "url": "https://news.sky.com/story/sean-diddy-combs-forced-women-into-freak-offs-jurors-told-as-hotel-cctv-is-played-in-court-13366806",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-brian-steel-sean-combs_6914116.jpg?20250512133129",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-12 16:42:00",
        "Headline": "In the courtroom in Manhattan, New York, Sean Combs blew a kiss to his mother and family members supporting him. He listened intently as both the prosecution and defence outlined the details of his high-profile case, and two witnesses gave evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial. In the courtroom in Manhattan, New York, Combs blew a kiss to his mother and family members supporting him, before listening intently as opening statements from the prosecution and defence outlined the details of the high-profile case. The hip-hop mogul, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, and strenuously denied all allegations of sexual abuse.  His defence lawyers say all sexual encounters were consensual and that the case is really about nothing more than Combs's sexual preferences, which they say should remain private. Combs is a \"flawed individual\", they argue, but not a racketeer or a sex trafficker. The court also heard evidence from two witnesses - a former hotel security guard and a male escort. But first, prosecutor Emily Johnson gave her opening statement. \"To the public, he was Puff Daddy or Diddy,\" she told the court, describing Combs as a \"business icon\" and \"larger than life\". However, there was another side to the rapper, she says - a side that \"ran a criminal enterprise\", she said. He sometimes \"called himself the king\", Ms Johnson said, and expected to be treated like one. \"This is Sean Combs,\" Ms Johnson told jurors as she pointed at Combs, who leaned back in his chair. \"During this trial you are going to hear about 20 years of the defendant's crimes.\" Those crimes, she said, included kidnapping, arson, drugs, sex crimes, bribery and obstruction. Ms Johnson said Combs beat and sexually exploited his former long-term girlfriend Cassie, who was named in court, and compelled the singer and other women to take drugs and have sex with male escorts. He threatened to ruin Cassie's career by publicly releasing videos of these sexual encounters, which were dubbed \"freak offs\", jurors heard. \"Her livelihood depended on keeping him happy,\" the prosecutor said. Jurors will hear testimonies from alleged victims who will talk about \"some of the most painful experiences of their lives\", Ms Johnson continued. \"The days they spent in hotel rooms, high on drugs, dressed in costumes to perform the defendant's sexual fantasies.\" 'This is not a complicated case' But Teny Geragos, who is on Combs's defence team, painted a very different picture. \"Sean Combs is a complicated man,\" she told the court. \"But this is not a complicated case. This case is about love, jealousy, infidelity and money.\" Ms Geragos conceded that Combs could be violent and said she understood some jurors might not condone this, nor his \"kinky sex\". But the rapper is \"not charged with being mean\", she said, and his lifestyle may have been indulgent, but it was not illegal. She also claimed Combs's accusers were motivated by money. Cassie hotel footage shown in court After the opening statements, the first witness, Israel Florez, was called to the stand. Now a police officer in LA, in March 2016, Mr Florez worked as a security guard at a hotel in Los Angeles, where Combs was filmed on CCTV seemingly attacking R&B singer and model Cassie, whose full name is Casandra Ventura. After CNN aired video of the attack last year, the rapper apologised in a video on social media and said he was \"disgusted\" by his actions. Video footage of this incident was shown in court as Mr Florez gave his testimony. He told the court he recognised Combs after responding to a call of a woman in distress on the sixth floor of the hotel. The rapper was wearing only a towel and socks, Mr Florez told the court, and had \"a blank stare, like a devilish stare, just looking at me\". He said that as he was escorting Ms Ventura and Combs to their room, she indicated she wanted to leave and the rapper told her: \"You're not going to leave.\" Combs then offered him money and told him \"don't tell nobody\", Mr Florez said. Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial The second witness, Daniel Phillip, used to work as a male escort, the court was told. He said he met Ms Ventura at a hotel in Manhattan, where he thought he was attending a bachelorette party. However, he said he ended up having sex with Ms Ventura as Combs watched and masturbated, and that he was paid several thousand dollars. Mr Phillip said he had several subsequent encounters with the then couple, which lasted between an hour and 10 hours, and that he witnessed or heard the rapper being violent on two occasions. He told the court he did not intervene as Combs was powerful, and that he feared for his life. His evidence will continue tomorrow. The trial is expected to last about eight weeks. Combs faces up to life in prison if he is convicted."
    },
    {
        "title": "'Simple' MRI test can identify heart disease risk 10 years early - study",
        "description": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study.",
        "url": "https://news.sky.com/story/simple-mri-test-can-identify-heart-disease-risk-10-years-early-study-13366703",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-heart-attack-cardio_6914241.jpg?20250512150219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-12 13:49:00",
        "Headline": "Researchers say the finding could \"save vast numbers of lives\" and mean patients get pre-emptive treatment years in advance.",
        "Content": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study. University of Dundee researchers collected data from 5,015 volunteers between 2008 and 2013. At the time, none had a history of heart disease or were at immediate risk. However, 10 years on, they found an increased (but normal) mass of the heart's left ventricle was a \"clear indicator\" of the risk of future cardiovascular disease. The risk was the same even if the organ was functioning as expected at the time of the tests. The study also found men and women had different risk factors: A larger left ventricle was linked with diastolic blood pressure in men, but in women it was linked with cholesterol. Ventricles are the lower two chambers of the heart - blood is pumped through them, aided by four valves. Professor Jill Belch, who led the study, said a \"simple\" MRI scan could be used to identify people at risk years before a potential heart attack or stroke. \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  London Underground stations shut and lines suspended as power cut hits Tube\n                 \"The ability to provide pre-emptive treatment for patients at a stage where their heart is working perfectly well could save vast numbers of lives,\" she said. Read more from Sky News:Weight loss jabs could almost halve risk of cancers - studyFirst moon rocks on Earth in half a century arrive in UK Prof Belch added: \"The volunteers who took part in this study had no immediate risk of heart disease. \"This is exciting as it allows us to pick up people, and treat them, before any organ damage has occurred.\" Lifestyle factors such as obesity, smoking, bad diet and lack of exercise can increase the risk of cardiovascular disease - but some people are also genetically more susceptible. The study appears in the journal Radiology."
    },
    {
        "title": "Family's tribute to 'kind and generous' grandparents killed in house fire",
        "description": "The family of a \"kind and generous\" elderly couple who died in a house fire have paid tribute to \"much-loved grandparents\".",
        "url": "https://news.sky.com/story/familys-tribute-to-kind-and-generous-grandparents-killed-in-house-fire-13366913",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-stan-roma-rickman_6891432.jpg?20250419211853",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-12 21:46:00",
        "Headline": "Stan Rickman, 91, and Roma Rickman, 88, were found dead at their home last month. Their family has put out a tribute to the grandparents they will \"greatly miss\".",
        "Content": "The family of a \"kind and generous\" elderly couple who died in a house fire have paid tribute to \"much-loved grandparents\". Stan Rickman, 91, and Roma Rickman, 88, of Heron Close in Alton, Hampshire, were found dead at their home early on 14 April. Hampshire Police have arrested a 15-year-old boy from Bordon as well as two other teenage boys from Alton on suspicion of murder. All three have been released on bail, pending further inquiries. In a statement shared by police, the couple's family said they \"will be greatly missed\". \"Stan and Roma were much loved parents and grandparents who were kind and generous and would do anything for anyone,\" they said. \"The family are extremely saddened that they were taken from us too early and that we were unable to share their last years with them. \"They will be greatly missed, but their memory will live on through their family and many friends. \"The family wish to thank the emergency services for their actions and support through this difficult time.\" Read more:Carnival closes after waltzer car crashes with children insideCrossbow attack suspect died from 'self-inflicted gunshot' A police spokesman separately appealed for any information that could assist their investigation. \"This includes any CCTV, dash cam or doorbell camera footage from the area at the time,\" he added."
    },
    {
        "title": "Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes",
        "description": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes.",
        "url": "https://news.sky.com/story/fire-at-sir-keir-starmers-house-in-north-london-investigated-by-police-13366745",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-house_6914629.jpg?20250512231945",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 15:05:00",
        "Headline": "The entrance to Sir Keir Starmer's house was damaged in the fire. Nobody was hurt and a police cordon remains in place.",
        "Content": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes. The Metropolitan Police said on Monday evening that detectives are checking a vehicle fire in NW5 last week and a fire at the entrance of a property in N7 on Sunday to see whether they are connected to the fire at Sir Keir Starmer's house in the early hours of Monday morning. The prime minister is understood to still own the home and used to live there before he and his family moved into 10 Downing Street after Labour won last year's general election. It is believed the property is being rented out. Counter-terrorism police are leading the investigation as a precaution, the Met said. The blaze damaged the entrance to the house, but there were no injuries, the force said. Politics latest: Starmer announces migration crackdown A statement from the Metropolitan Police said: \"On Monday 12 May at 1.35am, police were alerted by the London Fire Brigade to reports of a fire at a residential address. \n                  Sir Keir Starmer's migration package is significant - but will it be enough?\n                 \n                  Migration - Is Labour Reform-ing?\n                 \n                  Is this Sir Keir Starmer's biggest week as PM?\n                 \"Officers attended the scene. Damage was caused to the property's entrance, nobody was hurt. \"As a precaution and due to the property having previous connections with a high-profile public figure, officers from the Met's Counter Terrorism Command are leading the investigation into this fire. Enquiries are ongoing to establish the potential cause of the fire.\" A police cordon and officers, as well as investigators from London Fire Brigade, could be seen outside and at one point, part of the street was cordoned off to all vehicles. London Fire Brigade said firefighters were called just after 1am, and the blaze was out within half an hour. It described the incident as \"a small fire outside a property\". Read more:What are Mr Starmer's new immigration rules?Why movie line reflects public mood on prisonsHow PM sealed Trump trade deal Sir Keir expressed his gratitude to the police and fire services via his official spokesman, who said: \"I can only say that the prime minister thanks the emergency services for their work, and it is subject to a live investigation. So I can't comment any further.\" On Monday, Sir Keir made a major policy speech on immigration, promising to bring down net migration by the end of this parliament with a system that is \"controlled, selective and fair\". He did not clarify how far he wants figures to fall, only saying numbers will come down \"substantially\" as he set out plans in the government's Immigration White Paper, including banning care homes from hiring overseas."
    },
    {
        "title": "Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer",
        "description": "US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said.",
        "url": "https://news.sky.com/story/minister-does-not-rule-out-supermax-prisons-for-most-dangerous-offenders-following-alleged-rudakubana-attack-13366851",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-crime-preston-prison_6913736.jpg?20250512001252",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 18:36:00",
        "Headline": "James Timpson tells the Politics Hub with Sophy Ridge that community sentences should also be considered for non-violent offenders.",
        "Content": " US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said. James Timpson told the Politics Hub with Sophy Ridge that \"we shouldn't rule anything out\" when asked if the most dangerous criminals should be placed in top security prisons. It comes after Southport triple killer Axel Rudakubana allegedly threw boiling water from a kettle at an officer at HMP Belmarsh on Thursday. Police are now investigating. Politics latest: PM has undergone a 'miraculous conversion', say Tories  Before that, three prison officers were also allegedly attacked by 28-year-old Hashem Abedi - the brother of Manchester Arena bomber Salman Abedi - with hot cooking oil and \"improvised knives\", potentially made from a baking tray. Speaking from HMP Preston for a special programme of the Politics Hub, Mr Timpson told Sophy Ridge: \"We inherited a complete mess in the prison system. \"Violence is up, assaults on staff is up. But for me, we shouldn't rule anything out.\" \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 \n                  Woman says she was 'junkie, shoplifter' - here's what turned her life around\n                 \n                  Prison officer says his 'greatest fear' is colleague getting murdered on duty\n                 He added: \"What we need to do is to speak to our staff. They're the experts at dealing with these offenders day in, day out. \" Mr Timpson - who was the chief executive of Timpson Group before he was appointed prisons minister last year - said the violence in prisons was \"too high\".  He continued: \"The number of people when you have prisons are so full, and the people in there are not going to education or into purposeful activity. \"You get more violence and that is totally unacceptable. Our staff turn up to work to help turn people. \"They want to turn people's lives around. They didn't turn up to work to get assaulted. It's totally unacceptable.\" Read more: Should some women offenders be spared jail? Prison officer 'will be killed if government does not get a grip' Reflecting on the crisis facing the UK prison system ahead of the government's sentencing review, Mr Timpson said a major problem was the high rate of reoffending, saying \"80% of offending is reoffending\". He said people were leaving places like HMP Preston \"addicted to drugs, nowhere to live, mental health problems - and that's why they keep coming back\". Asked whether every prison had a drugs issue, he replied: \"100%.\" \"If we want to keep the public safe, we need to do a lot more of the work in here and in the community. But also we need to build more prisons.\" Put to him that making more use of community sentences - thought to be one of the recommendations in the government's sentencing review - might be considered a \"cushy option\" compared to a custodial sentence, Mr Timpson said: \"There are some people in this prison tonight who would prefer to be in prison than do a community sentence - but that's not everybody. \"Community sentences need to be tough punishments outside of prison, not just to help them address their offending behaviour, but also the victims need to see punishments being done too and for me, technology has a big part to play in the future.\""
    },
    {
        "title": "Sir Keir Starmer's migration package is significant - but will it be enough?",
        "description": "There's little doubt Sir Keir Starmer's proposals to curb legal migration are substantial and are likely to result in a meaningful reduction.&#160;",
        "url": "https://news.sky.com/story/sir-keir-starmers-migration-package-is-significant-but-will-it-be-enough-13366832",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-prime-minister_6914503.jpg?20250512191755",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-05-12 17:35:00",
        "Headline": "The prime minister shifted the political dial as he rejected the longstanding claim about the link between growth and migration.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There's little doubt Sir Keir Starmer's proposals to curb legal migration are substantial and are likely to result in a meaningful reduction.  That the ban on new care workers from overseas is causing angst in the sector is proof that it will make a difference, regardless of the arguments for and against the plan. Increasing the educational qualifications and English language requirements simply squeezes the eligibility of potential migrants. The decision to double from five to 10 years the wait to become a permanent resident means a much tougher qualifying period than the US. This is a significant package. Politics latest: Watch Sophy Ridge live from Category B jail But will it be enough, given we've had other substantial packages under previous administrations? Perhaps - but we will not know for years. But as well as moving the policy debate, the prime minister is also changing the political terms of discussion. Sir Keir insisted on Monday that he rejects the longstanding claim of Labour predecessors about the link between growth and migration. \n                  Migration - Is Labour Reform-ing?\n                 \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Is this Sir Keir Starmer's biggest week as PM?\n                 Although he has previously made this argument, the latest announcement was the most emphatic rejection of a cornerstone of cross-party thinking that lasted up to and through the Brexit referendum. The prime minister now says he knows better but what has he done about that? Read more:What are Starmer's new immigration rules?Labour's immigration plan builds on Tory rollbacks An unspoken feature of our government since Brexit has been that successive chancellors have ended up as advocates for higher migration, knowing that any drop in numbers would also hit their growth projections. There are those in Downing Street who believe that the interaction of fiscal rules and OBR forecasts do not capture the true net economic cost-benefit of migration. But when I asked Sir Keir about this, and whether he could change the way of measuring the economic impact of migration, he dodged the question. But does anyone have the answer? Farage's approach Most presume the toughest solutions come from Nigel Farage's Reform UK, and he attacks the prime minister for fiddling around the edges. But how would he do it? Last year's Reform manifesto promised a \"freeze on non-essential immigration\", claiming it has \"pushed Britain to breaking point\". However, this still provides scope for migrants with \"essential skills, mainly around healthcare, (which) must be the only exception\". But is this not exactly the sort of wiggle room that Mr Farage would criticise if another party exercised it? I pressed Mr Farage on how big this exemption would be, and after dodging the question several times - saying that I was missing the point because most migrants do not work - he replied: \"I can't tell you the numbers right now, I don't have all the figures. \"What I can tell you is anyone that comes in will not be allowed to stay long-term. That's the difference.\" He added: \"You ask me in four years' time, all right? Ask me in four years' time.\" This is the first time Mr Farage has offered a numerical cap before the next election. Even broad brush promises in opposition are complex. Let's see if the debate is still as salient by the next election."
    },
    {
        "title": "Man jailed for Diane Sindall murder in 1986 could have conviction quashed",
        "description": "A man jailed for murder nearly 40 years ago could have his conviction quashed by the Court of Appeal today, ending what's thought to be the longest-running miscarriage of justice in British history.",
        "url": "https://news.sky.com/story/man-jailed-for-diane-sindall-murder-in-1986-could-have-conviction-quashed-13364302",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-diane-sindall-peter-sullivan_6910154.jpg?20250508162400",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-05-12 23:00:00",
        "Headline": "Peter Sullivan was convicted of murdering Diane Sindall in Birkenhead in August 1986. The 21-year-old florist had been beaten and raped and left in an alleyway.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n A man jailed for murder nearly 40 years ago could have his conviction quashed by the Court of Appeal today, ending what's thought to be the longest-running miscarriage of justice in British history. Peter Sullivan was convicted of murdering Diane Sindall in Birkenhead in August 1986. The 21-year-old florist had been beaten and raped and left in an alleyway. Mr Sullivan has always maintained his innocence and new tests ordered by the Criminal Cases Review Commission have revealed his DNA was not present on samples preserved at the time. Merseyside Police have confirmed detectives are now \"carrying out an extensive investigation in a bid to identify who the new DNA profile belongs to, as to date there is no match on the national DNA database\". Detectives are also contacting individuals identified in the original investigation to request voluntary DNA samples. That original investigation was the largest in the force's history and, for many officers, the \"frenzied\" nature of the attack made it the worst case they had ever encountered. Diane, who was engaged to be married, had just left her shift as a part-time barmaid at a pub in Bebington when her small blue van ran out of petrol. \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 \n                  Syrian man who fled UK after raping 15-year-old girl near Hampden Park is jailed\n                 \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 She was walking to an all-night garage when she was attacked. Mr Sullivan, who was 29 at the time and described as a loner, initially denied the attack but later signed a confession. Questions have since been raised about whether he had proper legal representation during police interviews. Evidence related to bite marks on Diane's body, considered crucial at the trial, has also since been called into question. At the time of Mr Sullivan's trial in 1987, DNA technology was not available and subsequent requests for new tests had been refused. In its statement, Merseyside Police said: \"In November 2024, the Criminal Cases Review Commission announced that Peter Sullivan's murder conviction was being referred to the Court of Appeal due to the discovery of new DNA evidence, which was not available at the time of the trial. \"There have been significant developments in the use and understanding of DNA evidence in criminal investigations, that was still in its infancy at the time of the murder of Diane Sindall. \"These developments have led to the discovery of the new evidence.\" Read more from Sky News:Weight loss jabs 'could almost halve risk of cancer'Pope Leo calls for end to polarising 'war of words' The murder sent a chill through the community. On the grass verge close to where Diane's body was found, a memorial stone has been placed in memory of her and \"and all of our sisters who have been raped and murdered\". Diane Sindall's family told Sky News they did not want to comment on the case."
    },
    {
        "title": "'Simple' MRI test can identify heart disease risk 10 years early - study",
        "description": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study.",
        "url": "https://news.sky.com/story/simple-mri-test-can-identify-heart-disease-risk-10-years-early-study-13366703",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-heart-attack-cardio_6914241.jpg?20250512150219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 13:49:00",
        "Headline": "Researchers say the finding could \"save vast numbers of lives\" and mean patients get pre-emptive treatment years in advance.",
        "Content": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study. University of Dundee researchers collected data from 5,015 volunteers between 2008 and 2013. At the time, none had a history of heart disease or were at immediate risk. However, 10 years on, they found an increased (but normal) mass of the heart's left ventricle was a \"clear indicator\" of the risk of future cardiovascular disease. The risk was the same even if the organ was functioning as expected at the time of the tests. The study also found men and women had different risk factors: A larger left ventricle was linked with diastolic blood pressure in men, but in women it was linked with cholesterol. Ventricles are the lower two chambers of the heart - blood is pumped through them, aided by four valves. Professor Jill Belch, who led the study, said a \"simple\" MRI scan could be used to identify people at risk years before a potential heart attack or stroke. \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  London Underground stations shut and lines suspended as power cut hits Tube\n                 \"The ability to provide pre-emptive treatment for patients at a stage where their heart is working perfectly well could save vast numbers of lives,\" she said. Read more from Sky News:Weight loss jabs could almost halve risk of cancers - studyFirst moon rocks on Earth in half a century arrive in UK Prof Belch added: \"The volunteers who took part in this study had no immediate risk of heart disease. \"This is exciting as it allows us to pick up people, and treat them, before any organ damage has occurred.\" Lifestyle factors such as obesity, smoking, bad diet and lack of exercise can increase the risk of cardiovascular disease - but some people are also genetically more susceptible. The study appears in the journal Radiology."
    },
    {
        "title": "Six Bulgarians who ran Russian spy ring out of guesthouse on east of coast of England jailed",
        "description": "Six members of a Russian spy ring run from a guesthouse in Great Yarmouth have been jailed for running espionage operations across Europe.",
        "url": "https://news.sky.com/story/six-bulgarians-who-ran-russian-spy-ring-out-of-guesthouse-on-east-of-coast-of-england-jailed-13366477",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russian-russia-spy_6913940.jpg?20250512114106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 08:25:00",
        "Headline": "The spies conducted surveillance for Russia, targeting journalists, dissidents and Ukrainian troops in London, Austria, Spain, Germany and Montenegro.",
        "Content": " Six members of a Russian spy ring run from a guesthouse in Great Yarmouth have been jailed for running espionage operations across Europe. The six Bulgarian spies conducted surveillance for Russia \"on an industrial scale\", targeting journalists, dissidents and Ukrainian troops in London, Austria, Spain, Germany and Montenegro. Ringleader Orlin Roussev, 47, who led the spy ring, was sentenced to 10 years and eight months. Roussev admitted his role along with his second-in-command, Biser Dzhambazov, 44, who was jailed for 10 years and two months and Ivan Stoyanov, 33, who was handed five years and three weeks in prison. Female \"honeytrap\" agents Katrin Ivanova, 33, and Vanya Gaberova, 30, and competitive swimmer Tihomir Ivanov Ivanchev, 39, were found guilty at the Old Bailey in March of activities which police have said put lives and national security at risk. Ivanova was jailed for nine years and eight months. Gaberova, of Euston, north London, was jailed for six years, eight months and three weeks, having found spying for Russia to be \"exciting and glamorous\", the judge said. Her ex-boyfriend Ivanchev, of Acton, west London, was sentenced to eight years in prison. It is believed to be one of the \"largest and most complex\" enemy operations to be uncovered on UK soil. The network engaged in a series of surveillance and intelligence operations over three years in which spies were referred to as Minions - characters from animated film Despicable Me. Ivanova, a laboratory receptionist from Harrow, north London, and Gaberova, a beautician from Acton, west London, were in a love triangle with the operations chief of the spy ring. Pretended to have cancer Dzhambazov, a delivery driver who ran the ground operations of the spy ring, was pretending to have cancer to cover up his affair with Gaberova. The group also included Dzhambazov's best friend Stoyanov, from Greenford, northwest London - a former cage fighter known as \"The Rock\" who had represented Bulgaria at judo and sambo. At the centre of the operation was Roussev, 46, who worked for a technology company at the London Stock Exchange before setting himself up as a freelance spy for hire. Roussev had lived near Tower Bridge in central London before moving to Great Yarmouth, where his partner bought the 33-room Haydee Guesthouse. It was there that he stashed his huge collection of spy equipment, much of which he had adapted himself. £173,000 paid to spies Roussev is believed to have received \"substantially more\" than the £173,000 he paid to other members of the spy ring but he was paid in cryptocurrencies and the money has not been traced. Among the spyware found at the seaside hotel were audiovisual spy devices hidden inside a rock, men's ties, a Coca-Cola bottle and a Minions cuddly toy. Kit to make and test counterfeit identity documents was recovered from Roussev's address, with a stash of fake passports also found at the one-bedroom flat in Harrow that Ivanova and Dzhambazov shared. Honey traps, but 'no James Bond activity' Their actual activities ranged between the UK, Austria, Spain, Germany and Montenegro and included dropping 100 litres of pigs' blood on the Kazakhstan embassy in London by drone, and kidnapping a man in the UK. They were overheard discussing deploying \"lashes queen\" Gaberova as a honeytrap to snare a high-profile journalist. After his arrest, Roussev initially denied spying for Russia, telling police: \"No James Bond activity on my end, I guarantee you.\" At the televised sentencing, judge Mr Justice Hilliard praised police for their \"extremely thorough and determined investigative work\". The defendants were \"motivated by money\", he said, and lived \"very comfortably\" on the substantial sums they were paid. Commander Dominic Murphy, head of Scotland Yard's Counter Terrorism Command, said the gang engaged in spying \"on an industrial scale\". He said they posed a \"serious threat\" to the UK and Europe and highlighted a \"relatively new phenomenon whereby espionage is being 'outsourced' by certain states\". Security minister Dan Jarvis said the \"substantial\" sentences they received \"should send a clear warning to anyone seeking to threaten our security, harm the UK and compromise the safety of the public\". Read more:Who were targets of Russian spy ring?Spy ring plotted to kidnap journalist He called the case a \"stark reminder\" of the \"increasingly complex\" threat facing the country from \"hostile states who wish to undermine us. \"We will use the full range of tools and powers available to us to detect, disrupt and deter malicious acts from hostile states and protect the public.\"He thanked the Crown Prosecution Service for \"disrupting this threat and bringing these individuals to justice\"."
    },
    {
        "title": "Syrian man who fled UK after raping 15-year-old girl near Hampden Park is jailed",
        "description": "A Syrian man who fled Scotland after raping a 15-year-old girl has been jailed for eight years.",
        "url": "https://news.sky.com/story/syrian-man-who-fled-uk-after-raping-15-year-old-girl-near-hampden-park-is-jailed-13366784",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hampden-park-glasgow_6914468.jpg?20250512183909",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-05-12 16:13:00",
        "Headline": "Marwan al Bakr, 32, subjected the teenager to a 55-minute serious sexual assault. He fled to Germany but was extradited back to Scotland to face justice.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A Syrian man who fled Scotland after raping a 15-year-old girl has been jailed for eight years. Marwan al Bakr, 32, subjected the vulnerable teenager to a 55-minute attack near the national football stadium Hampden Park in Glasgow on 14 February 2022. The Crown Office and Procurator Fiscal Service (COPFS) said al Bakr approached the victim while she was sitting at a bus stop before leading her to a secluded grassy area, where he carried out the serious sexual assault. The teenager raised the alarm a short time later and a police investigation was launched. Al Bakr was found to have fled the UK in the days following the attack. He was later traced in the Lathen area of Germany and extradited back to Scotland in October 2023. Al Bakr was last month found guilty of rape following a trial at the High Court in Livingston. \n                  The online drug trade behind QR code stickers plastered on streets across the UK \n                 \n                  Man jailed for Diane Sindall murder in 1986 could have conviction quashed\n                 \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 He was handed a 13-year extended sentence at the High Court in Stirling on Monday, with eight years in jail and five years on licence once released back into the community. Judge Jane Farquharson said the victim was a \"complete stranger\" to al Bakr as she described the accused's behaviour as \"opportunistic and predatory\". Citing CCTV footage, the judge said it was clear that al Bakr \"clocked\" the girl and took steps to follow her before approaching the teenager at the empty bus stop on the deserted street. Judge Farquharson said al Bakr \"removed\" the victim to a \"dark and quiet\" area of parkland, where he subjected her to a sex attack lasting almost an hour. The girl's shouts of \"stop\" and \"don't\" were said to have been heard within a nearby property. The judge stated: \"You have your own narrative about what happened that night which is completely at odds with the evidence led in court, and so I disregard the same.\" Read more from Sky News:Driver who used car as weapon to murder e-bike rider jailedManslaughter charges over woman killed by falling bricks 'Troubling reading' Judge Farquharson said two background reports prepared made for \"troubling reading\". She added: \"It is not just your pervasive self-interest. You have shown no insight whatsoever into your serious sexual offending.\" The judge highlighted the victim impact statement, noting: \"At just 18 years of age now, she has outlined the significant, ongoing and lasting effects of this offence on the day as she described it, that 'her body was taken away from her'.\" Judge Farquharson further criticised al Bakr's attitude to women, citing his conduct towards his female interpreter during the trial and his behaviour towards the female social workers tasked with preparing reports for the sentencing. 'Grave concern' The judge said: \"Your attitudes towards females cause me grave concern.\" However, Judge Farquharson did say al Bakr was a \"man of previous good character\" as she noted his \"difficult personal history\" given the war in his birth country of Syria. As well as the jail sentence, al Bakr was additionally placed on the sex offenders' register indefinitely and banned from contacting his victim. Katrina Parkes, procurator fiscal for high court sexual offences, said: \"Marwan al Bakr poses a significant danger through his predatory behaviour. \"I am grateful to the victim for coming forward. It is because of her that al Bakr will now face the consequences of his actions.\""
    },
    {
        "title": "Father Ted co-creator Graham Linehan denies harassing transgender woman",
        "description": "Father Ted co-creator Graham Linehan has pleaded not guilty to harassing a transgender woman and damaging her phone.",
        "url": "https://news.sky.com/story/father-ted-co-creator-graham-linehan-denies-harassing-transgender-woman-13366724",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-graham-linehan-court_6914253.jpg?20250512155139",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 14:28:00",
        "Headline": "Linehan, 56, said in a post on X in April that the allegations were related to an incident at a conference in London last October.",
        "Content": "Father Ted co-creator Graham Linehan has pleaded not guilty to harassing a transgender woman and damaging her phone. The Bafta-winning writer, who also came up with TV sitcoms The IT Crowd and Black Books, appeared at Westminster Magistrates' Court on Monday to deny the charges of harassing Sophia Brooks on social media and damaging her mobile in October. Linehan, 56, who created the three-season sitcom Father Ted in the 1990s with fellow Irish writer Arthur Mathews, said in a post on X in April that the allegations were related to an incident at the Battle of Ideas conference in London on 19 October. Court documents show Linehan is charged with harassing the alleged victim, a transgender activist, by posting abusive comments about her on social media between 11 October and 27 October, and damaging her phone to the value of £369 on the day of the conference. Outside court after the short hearing, he wore a T-shirt with a picture of a Daily Telegraph front page with the headline 'Trans women are not women', and said: \"For six years, ever since I began defending the rights of women and children against a dangerous ideology, I have faced harassment, abuse and threats. \"I've lost a great deal, but I am still here, and I will not waver in my resolve.\" Read more from Sky News:Green Party co-leader denies split over trans rightsThousands attend trans rights protests following Supreme Court ruling Deputy District Judge Louise Balmain told Linehan his trial would take place on 4 September this year at the same court. Linehan has become a strong vocal critic of the trans rights movement in recent years. He was freed on bail with the condition not to contact the complainant directly or indirectly."
    },
    {
        "title": "Nigel Farage says he would allow essential migration but numbers would be capped",
        "description": "Nigel Farage has told Sky News he would allow some essential migration in areas with skill shortages but that numbers would be capped. ",
        "url": "https://news.sky.com/story/nigel-farage-says-he-would-allow-essential-migration-but-numbers-would-be-capped-13366603",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-reform_6902067.jpg?20250512140558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-12 11:49:00",
        "Headline": "The Reform UK leader tells Sky News his party will announce the proposed cap on immigration before the next election.",
        "Content": " Nigel Farage has told Sky News he would allow some essential migration in areas with skill shortages but that numbers would be capped.  The Reform UK leader said he would announce the cap \"in four years' time\" after he was pressed repeatedly by Sky's deputy political editor Sam Coates about his manifesto pledge to freeze \"non-essential\" immigration. Politics latest: PM accused of 'shameful' language in migration crackdown It was put to Mr Farage that despite his criticism of the government's migration crackdown, allowing essential migration in his own plans is quite a big caveat given the UK's skills shortages. However the Clacton MP said he would allow people to plug the gaps on \"time dependent work permits\" rather than on longer-term visas. He said: \"Let's take engineering, for argument's sake. We don't train enough engineers, we just don't. It's crazy. \"We've been pushing young people to doing social sciences degrees or whatever it is. \"So you're an engineering company, you need somebody to come in on skills. If they come in, on a time dependent work permit, if all the right health assurances and levies have been paid and if at the end of that period of time, you leave or you're forced to leave, then it works.\" Read more:What are Starmer's new immigration rules?The choice facing Labour in face of Reform threat - analysis  Reform's manifesto, which they call a \"contract\", says that \"essential skills, mainly around healthcare, must be the only exception\" to migration. Pressed on how wide his exemption would be, Mr Farage said he hopes enough nurses and doctors will be trained \"not to need anybody from overseas within the space of a few years\". He said that work permits should be separate to immigration, adding: \"If you get a job for an American TV station and you stay 48 hours longer than your work permit, they will smash your front door down, put you in handcuffs and deport you. \"We allow all of these routes, whether it's coming into work, whether it's coming as a student, we have allowed all of these to become routes for long-term migration.\"  Asked if he would put a cap on his essential skills exemption, he said: \"We will. I can't tell you the numbers right now, I don't have all the figures. What I can tell you is anyone that comes in will not be allowed to stay long-term. That's the difference.\" Pressed if that was a commitment to a cap under a Reform UK government, he suggested he would set out further detail ahead of the next election, telling Coates: \"Ask me in four years' time, all right?\" Mr Farage was speaking after the government published an immigration white paper which pledged to ban overseas care workers as part of a package of measures to bring down net migration. The former Brexit Party leader claimed the proposals were a \"knee jerk reaction\" to his party's success at the local elections and accused the prime minister of not having the vigour to \"follow them through\". However he said he supports the \"principle\" of banning foreign care workers and conceded he might back some of the measures if they are put to a vote in parliament. He said: \"If it was stuff that did actually bind the government, there might be amendments on this that you would support. But I'm not convinced.\""
    },
    {
        "title": "American-Israeli hostage Edan Alexander released by Hamas",
        "description": "Hamas has released Edan Alexander, an Israeli soldier who holds American citizenship, as part of ongoing efforts to achieve a permanent ceasefire with Israel.",
        "url": "https://news.sky.com/story/american-israeli-hostage-edan-alexander-released-hamas-says-13366638",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-edan-alexander-hostage_6914590.jpg?20250512215530",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 12:36:00",
        "Headline": "The militant group announced on Sunday it would release the hostage as part of efforts to achieve a ceasefire.",
        "Content": " Hamas has released Edan Alexander, an Israeli soldier who holds American citizenship, as part of ongoing efforts to achieve a permanent ceasefire with Israel. The 21-year-old was believed to be the last living American hostage in Gaza. In a statement, Hamas said: \"The Izz ad-Din al-Qassam Brigades released the captured Israeli soldier, Edan Alexander, a US citizen, a short while ago, following contacts with the US administration. This comes as part of the efforts being made by mediators to achieve a ceasefire, open the crossings, and allow aid and relief to reach our people in the Gaza Strip. \"This step comes after important contacts in which Hamas demonstrated positivity and high flexibility. \"We affirm that serious and responsible negotiations achieve results in the release of prisoners. However, continuing the aggression prolongs their suffering and may kill them. \"We affirm the movement's readiness to immediately begin negotiations to reach a comprehensive and sustainable ceasefire agreement, including the withdrawal of the occupation army, the end of the siege, a prisoner exchange, and the reconstruction of the Gaza Strip. \"We urge the Trump administration to continue its efforts to end this brutal war waged by the war criminal Netanyahu against children, women, and defenceless civilians in the Gaza Strip.\" Mr Alexander was transferred to Israel Defence Forces (IDF) via the Red Cross. An IDF statement said: \"A short while ago, accompanied by IDF forces, the returning hostage, IDF soldier Edan Alexander, crossed the border into Israeli territory.\" He will be checked by doctors and reunited with his family in southern Israel, it added. \"The commanders and soldiers of the Israel Defense Forces salute and embrace the returning hostage as he makes his way home to the State of Israel.\"The IDF Spokesperson's Unit asks everyone to respect the privacy of the returning hostage and his family.\" Mr Alexander's parents, who live in the US, made the journey to Israel ahead of the release. The family said they were deeply grateful to US President Donald Trump and his administration for its work to secure the release - and have urged the Israeli government to continue efforts to free all hostages. Before leaving Washington for a whirlwind visit to Saudi Arabia, Qatar and the United Arab Emirates, Mr Trump told reporters the US national was \"coming home to his parents, which is really great news\". Mr Alexander, who is from New Jersey, was 19 when he was taken from his base on the border with Gaza in southern Israel during the Hamas attacks on 7 October 2023, when 1,200 people were killed. Read more on Sky News:A week that could define TrumpZelenskyy offers to meet PutinUK-based Bulgarian spies jailed The Hostages and Missing Families Forum Headquarters said in a statement: \"After 584 agonising days in captivity, Edan has returned home - to his family who worked tirelessly for his release, to his friends, and to an entire nation that fought and prayed for his return.\" The group called his release \"a ray of light and hope, but also a stark reminder that 58 men and women remain captive in Gaza\". \"We must not leave a single hostage behind. Without bringing everyone home, there can be no true victory, no healing, and no rebuilding as a nation. \"The return of all hostages is our generation's most urgent and critical mission. We will bring them back. We will rise again.​\" Last week Israel said 24 hostages were alive in Gaza, after around 250 were taken in the 2023 Hamas attack. Most of the hostages returned alive to Israel so far have been released as part of deals with Hamas during two temporary ceasefires in late 2023 and early 2025. Before Mr Alexander's release, around 59 hostages were thought to be still inside Gaza, around a third of them believed to be alive. Israel announced earlier this month it intends to occupy the entire Gaza enclave, threatening years of more war. Israel's war on Gaza, launched in retaliation for the 7 October attack, has killed more than 52,000 people and wounded more than 119,000, according to Gaza's Hamas-run health ministry."
    },
    {
        "title": "Pakistan claims it has 'upper hand' over India - but fragile truce could easily unravel",
        "description": "Pakistan has \"the upper hand\", according to the country's&#160;minister of information and broadcasting.",
        "url": "https://news.sky.com/story/pakistan-says-it-has-upper-hand-over-india-but-fragile-truce-could-easily-unravel-13366884",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/a529cb6cefe8598966d474a37179e58958234ee7fba1b078080d0e152dcfff6c_6914499.jpg?20250512191339",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-05-12 20:45:00",
        "Headline": "A Pakistani minister has told Sky News his country had scored a \"victory as visible as daylight\" following last week's fierce clashes.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  Pakistan has \"the upper hand\", according to the country's minister of information and broadcasting. After last week's intense clashes with India, Attaullah Tarar said they had scored a \"victory as visible as daylight\". He said Donald Trump had been \"pivotal\" in securing a ceasefire and he was hopeful the American leader could help bring together the two nuclear-armed neighbours to solve the enduring conflict in Kashmir. \"I think the US president made it abundantly clear that he would like to resolve issues, including Kashmir,\" Mr Tarar said. \"So, let's see how things unfold in the near future.\" But that may be very wishful thinking. India has ruled out formal talks on Kashmir since 2016 and, in his first address to the nation since the clashes began last week, Prime Minister Narendra Modi made clear terrorism was the only issue he wanted to discuss with Pakistan. Mr Modi, who has been relatively muted since the truce was agreed, said Pakistan will have to get rid of its \"terrorist infrastructure\" if it wants to be \"saved\". There has been speculation that India's strongman was annoyed that Mr Trump announced the truce first and has been under pressure domestically to look and act tougher on Pakistan. In his first comments since that truce, Mr Modi said earlier on Monday that India has only \"paused\" its military action and will \"retaliate on its own terms\" to any terror attack. \"We will be monitoring every step of Pakistan,\" he added in an address to the nation.  Islamabad has consistently denied any connection with last month's deadly attack on civilians in Pahalgam, in Indian-administered Kashmir. And the country's information minister accused New Delhi of \"failing miserably\" to produce a \"single piece of evidence linking Pakistan to the Pahalgam incident\". Pakistan's denials India claims their recent strikes on Pakistan targeted two terror groups with links to Pakistan - Lashkar-E-Taiba (LeT) and Jaish-e-Mohammed. LeT is accused of carrying out the Mumbai attacks in 2008 and has connections to the Resistance Front, which India alleges carried out this recent attack in Pahalgam. But the country's information minister rejected the idea they even exist. \"I completely deny any safe havens or terrorist camps in Pakistan,\" he added. Pakistan, he argued, \"is the biggest victim against terrorism\". \"We are fighting these terrorists day and night on our western regions, in our western borders, and we are dealing with these terrorists in the best way possible,\" he added. The uneasy truce The truce between the two nuclear neighbours is fragile and could easily unravel. What brought them both to an agreement so suddenly has been the subject of intense speculation. Read more:Intervention in Kashmir is poisoned fruitTrump faces criticism over Kashmir postTerror group supporters posted online from site targeted in strikes  But as he left the White House, bound for the Middle East, Mr Trump maintained trade had been a \"big reason\". That may have been enough to get the two sides to back down, but getting them to stay there will be much harder. Mr Modi and Mr Trump's relationship will be tested by this moment. Meanwhile, Pakistan appears jubilant, declaring this a huge win and a source of great national pride."
    },
    {
        "title": "Islamic State fighters who return to the UK must face justice, committee says",
        "description": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said.",
        "url": "https://news.sky.com/story/islamic-state-fighters-who-return-to-the-uk-must-face-justice-committee-says-13366924",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-khaled-brigade-syria_6786301.jpg?20241227150134",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 22:28:00",
        "Headline": "More than 400 people who fought for ISIS in Syria and Iraq are believed to have later returned to the UK, without being prosecuted. A new report is calling for changes to the law to help authorities be better equipped to go after them.",
        "Content": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said. More than 400 people who fought for the group, also called ISIS and Daesh, are thought to have then returned to the UK, after travelling to the Middle East. ISIS once held swathes of land in Syria and Iraq and was responsible for widespread campaigns of terror, murder, and rape. This often targeted minority religious groups like the Yazidis. Sky News recently released a documentary on ISIS and the Yazidis, led by special correspondent Alex Crawford. Crawford gave evidence to parliament's Joint Committee on Human Rights (JCHR), which in a new report has warned that none of the ISIS supporters who had made their way back to the UK had been successfully prosecuted. It called on the government to take steps to ensure they can be tried in British courts, after ministers previously claimed such crimes were \"best investigated and prosecuted under local laws\" - meaning abroad. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Yazidi women still enslaved in ISIS detention camps, Sky News documentary reveals\n                 \n                  Five jihadists found guilty of holding French journalists hostage\n                 'The UK cannot wash its hands of this' \"Where the UK has jurisdiction over international crimes, the UK should seek to investigate and prosecute such crimes,\" the committee's latest report said. However, the report said that UK courts faced a \"key barrier\" to delivering justice on war crimes and genocide. This was because it is not possible to prosecute people for these crimes unless they are UK nationals, residents or \"subject to service personnel laws\". The committee said ministers should use the Crime and Policing Bill, currently making its way through parliament, to amend the law. Read more:The camps full of the radicalised children of ISThe Londoner locked up in a forgotten prison Lord Alton, chairman of the JCHR, said: \"This is not something the UK can simply wash its hands of because it happened overseas. \"We know that British nationals committed the most horrendous crimes in Iraq and Syria under the Daesh [ISIS] regime and we have a duty to see them brought to justice. \"To date, no Daesh fighters have been successfully prosecuted for international crimes in the UK and we find this unacceptable.\" The committee added that more must also be done to repatriate children held in camps in northeast Syria where former ISIS fighters and their families are being held. 'There are no rights for anything' Crawford was one of those who gave evidence to the committee. She first met Yazidi women captured by ISIS in 2014, and has covered the topic a number of times since, including most recently in the 10 Years Of Darkness: ISIS & The Yazidis documentary. She told the committee the camps in northeast Syria were \"filled with hopelessness and helplessness, and a really strong anger and frustration\".  \"There are multiple human rights concerns,\" she said, adding that those living there essentially had no rights. She went on: \"There is no right of freedom. There is no right to access to legal representation. There are no rights for anything. \"Many of the children - I do not know how many - have been born there. \"They are very young - younger than six - so many of them have been born there in, to be honest, very dirty, disgusting conditions.\""
    },
    {
        "title": "Why Trump blinked in US-China trade war",
        "description": "Of all the fronts in Donald Trump's trade war, none was as dramatic and economically threatening as the sky-high tariffs he imposed on China.",
        "url": "https://news.sky.com/story/trade-war-trump-has-blinked-to-avoid-us-recession-13366594",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6914090.jpg?20250512131541",
        "type": "World",
        "Author": "Ed Conway",
        "Date Published": "2025-05-12 11:27:00",
        "Headline": "Is the trade war now over? Now that the two sides have blinked, can globalisation continue more or less as it had before? It's a trickier and more complex question than it might first seem.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Of all the fronts in Donald Trump's trade war, none was as dramatic and economically threatening as the sky-high tariffs he imposed on China. There are a couple of reasons: first, because China is and was the single biggest importer of goods into the US and, second, because of the sheer height of the tariffs imposed by the White House in recent months. In short, tariffs of over 100% were tantamount to a total embargo on goods coming from the United States' main trading partner. That would have had enormous economic implications, not just for the US but every other country around the world (these are the world's biggest and second-biggest economies, after all). Trump latest: US and China slash tariffs in trade war de-escalation So the truce announced on Monday by treasury secretary Scott Bessent is undoubtedly a very big deal indeed. In short, China will still face an extra 30% tariffs (the 20% levies cast as punishment for China's involvement in fentanyl imports and the 10% \"floor\" set on \"Liberation Day\") on top of the residual 10% average from the Biden era. But the rest of the extra tariffs will be paused for 90 days. China, in turn, has suspended its own retaliatory tariffs on the US. The market has responded as you would probably have expected, with share prices leaping in relief. But that raises a question: is the trade war now over? Now that the two sides have blinked, can globalisation continue more or less as it had before? That, it turns out, is a trickier and more complex question than it might first seem. For one thing, even if one were to assume this is a permanent truce rather than a suspended one, it still leaves tariffs considerably higher than they were only last year. And China faces tariffs far higher than most other countries (tot up the existing ones and the Trump era ones and China faces average tariffs of around 40%, while the average for most countries is between 8% and 14%, according to Capital Economics). In other words, the US is still implementing an economic policy designed to increase the cost of doing business with China, even if it no longer attempts to prevent it altogether. The fact that last week's trade agreement with the UK contains clauses seemingly designed to encourage it to raise trade barriers against China for reasons of \"security\" only reinforces this suspicion. The trade war is still simmering, even if it's no longer as hot as it was a few days ago. Read more:US-UK trade deal 'isn't worth the paper it's written on'Key details in 'historic' US-UK trade deal And more broadly, the deeper impact of the trade rollercoaster in recent months is unlikely to disappear altogether. Companies remain more nervous about investing in factories and expansions in the face of such deep economic instability. No-one is entirely sure the White House won't just U-turn once again. That being said, it's hard not to escape the conclusion that the US president has blinked in this trade war. In the face of a potential recession, he has pulled back from the scariest and most damaging of his tariffs, earlier and to a greater extent than many had expected."
    },
    {
        "title": "Six Bulgarians who ran Russian spy ring out of guesthouse on east of coast of England jailed",
        "description": "Six members of a Russian spy ring run from a guesthouse in Great Yarmouth have been jailed for running espionage operations across Europe.",
        "url": "https://news.sky.com/story/six-bulgarians-who-ran-russian-spy-ring-out-of-guesthouse-on-east-of-coast-of-england-jailed-13366477",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russian-russia-spy_6913940.jpg?20250512114106",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 08:25:00",
        "Headline": "The spies conducted surveillance for Russia, targeting journalists, dissidents and Ukrainian troops in London, Austria, Spain, Germany and Montenegro.",
        "Content": " Six members of a Russian spy ring run from a guesthouse in Great Yarmouth have been jailed for running espionage operations across Europe. The six Bulgarian spies conducted surveillance for Russia \"on an industrial scale\", targeting journalists, dissidents and Ukrainian troops in London, Austria, Spain, Germany and Montenegro. Ringleader Orlin Roussev, 47, who led the spy ring, was sentenced to 10 years and eight months. Roussev admitted his role along with his second-in-command, Biser Dzhambazov, 44, who was jailed for 10 years and two months and Ivan Stoyanov, 33, who was handed five years and three weeks in prison. Female \"honeytrap\" agents Katrin Ivanova, 33, and Vanya Gaberova, 30, and competitive swimmer Tihomir Ivanov Ivanchev, 39, were found guilty at the Old Bailey in March of activities which police have said put lives and national security at risk. Ivanova was jailed for nine years and eight months. Gaberova, of Euston, north London, was jailed for six years, eight months and three weeks, having found spying for Russia to be \"exciting and glamorous\", the judge said. Her ex-boyfriend Ivanchev, of Acton, west London, was sentenced to eight years in prison. It is believed to be one of the \"largest and most complex\" enemy operations to be uncovered on UK soil. The network engaged in a series of surveillance and intelligence operations over three years in which spies were referred to as Minions - characters from animated film Despicable Me. Ivanova, a laboratory receptionist from Harrow, north London, and Gaberova, a beautician from Acton, west London, were in a love triangle with the operations chief of the spy ring. Pretended to have cancer Dzhambazov, a delivery driver who ran the ground operations of the spy ring, was pretending to have cancer to cover up his affair with Gaberova. The group also included Dzhambazov's best friend Stoyanov, from Greenford, northwest London - a former cage fighter known as \"The Rock\" who had represented Bulgaria at judo and sambo. At the centre of the operation was Roussev, 46, who worked for a technology company at the London Stock Exchange before setting himself up as a freelance spy for hire. Roussev had lived near Tower Bridge in central London before moving to Great Yarmouth, where his partner bought the 33-room Haydee Guesthouse. It was there that he stashed his huge collection of spy equipment, much of which he had adapted himself. £173,000 paid to spies Roussev is believed to have received \"substantially more\" than the £173,000 he paid to other members of the spy ring but he was paid in cryptocurrencies and the money has not been traced. Among the spyware found at the seaside hotel were audiovisual spy devices hidden inside a rock, men's ties, a Coca-Cola bottle and a Minions cuddly toy. Kit to make and test counterfeit identity documents was recovered from Roussev's address, with a stash of fake passports also found at the one-bedroom flat in Harrow that Ivanova and Dzhambazov shared. Honey traps, but 'no James Bond activity' Their actual activities ranged between the UK, Austria, Spain, Germany and Montenegro and included dropping 100 litres of pigs' blood on the Kazakhstan embassy in London by drone, and kidnapping a man in the UK. They were overheard discussing deploying \"lashes queen\" Gaberova as a honeytrap to snare a high-profile journalist. After his arrest, Roussev initially denied spying for Russia, telling police: \"No James Bond activity on my end, I guarantee you.\" At the televised sentencing, judge Mr Justice Hilliard praised police for their \"extremely thorough and determined investigative work\". The defendants were \"motivated by money\", he said, and lived \"very comfortably\" on the substantial sums they were paid. Commander Dominic Murphy, head of Scotland Yard's Counter Terrorism Command, said the gang engaged in spying \"on an industrial scale\". He said they posed a \"serious threat\" to the UK and Europe and highlighted a \"relatively new phenomenon whereby espionage is being 'outsourced' by certain states\". Security minister Dan Jarvis said the \"substantial\" sentences they received \"should send a clear warning to anyone seeking to threaten our security, harm the UK and compromise the safety of the public\". Read more:Who were targets of Russian spy ring?Spy ring plotted to kidnap journalist He called the case a \"stark reminder\" of the \"increasingly complex\" threat facing the country from \"hostile states who wish to undermine us. \"We will use the full range of tools and powers available to us to detect, disrupt and deter malicious acts from hostile states and protect the public.\"He thanked the Crown Prosecution Service for \"disrupting this threat and bringing these individuals to justice\"."
    },
    {
        "title": "Nissan to cut 20,000 jobs globally, reports say",
        "description": "Nissan is set to announce a leap in its cost-cutting plans that will see 20,000 jobs go globally, according to reports in Japan.",
        "url": "https://news.sky.com/story/nissan-to-cut-20000-jobs-globally-reports-say-13366718",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-nissan-logo_6568780.jpg?20240529144551",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 14:20:00",
        "Headline": "The Japanese carmaker would be expected to clarify its position early on Tuesday when it is due to outline financial results - set to show a big net loss",
        "Content": "Nissan is set to announce a leap in its cost-cutting plans that will see 20,000 jobs go globally, according to reports in Japan. The carmaker, which employs around 6,000 workers at its sprawling manufacturing operations in Sunderland, had already let it be known last November that 9,000 roles would be going amid weak sales and rising costs. But Japanese broadcaster NHK said on Monday it expected that total to more than double. Money latest: Most crowded holiday hotspots revealed Nissan, which was yet to comment on the claim, is due to reveal full year results covering the 12 months to March on Tuesday morning. They are expected to show a net loss of up to £3.8bn due to a series of writedowns on the value of its operations. They will be the first results Nissan has declared since the appointment of a new chief executive last month. \n                  UK's desperation can be exploited as it can't compete with £100bns spent by the US and EU\n                 \n                  Nissan to build three new electric car models in Sunderland\n                 \n                  Nissan commits to 2030 electric car deadline despite delay to UK petrol-diesel ban\n                 Ivan Espinosa issued a \"significant\" downgrade to Nissan's outlook just three weeks ago. If the job cuts report is true, it would amount to a 15% reduction in the company's worldwide workforce. It is not known if the Sunderland production facilities form part of any planned job cuts or production reductions, of up to 20%, that were reported. Nissan has, on several occasions since Brexit, called the plant's future into question before proceeding with investment plans. It has invested £2bn in Sunderland since 2023 alone. The company secured UK government money this year for a new electric powertrain manufacturing facility in Sunderland. But a senior Nissan executive, Alan Johnson, warned more aid was needed just last month, arguing that the UK was \"not a competitive place\" to build cars. Nissan, like rivals, is facing challenges on many fronts. Read more:US-UK trade deal 'isn't worth the paper it's written on'Key details in 'historic' US-UK trade deal US trade tariffs of 25% on all car imports has exacerbated pressure on its supply chain and sales. The latter has been struggling due to weaker-than-anticipated electric car uptake. But the vast majority of its cars made in the UK will be subject to a tariff of just 10% after the UK-US trade deal agreed last week. It does not currently send Sunderland-made cars to the United States. Most are for export to Europe and the domestic UK market."
    },
    {
        "title": "Pope Leo calls for end to polarising 'war of words' in address to media",
        "description": "Pope Leo has called for an end to a polarising \"war of words\" as he hosted an audience with international media for the first time. ",
        "url": "https://news.sky.com/story/pope-leo-calls-for-end-to-polarising-war-of-words-in-address-to-media-13366497",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pope-leo-pope-leo-vatican_6913989.jpg?20250512113423",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 09:10:00",
        "Headline": "The new pontiff addresses thousands of the members of the media in Vatican City, saying \"we are living in times that are both difficult to navigate and to recount\".",
        "Content": "Pope Leo has called for an end to a polarising \"war of words\" as he hosted an audience with international media for the first time.  Speaking in Vatican City to thousands of members of the media, he said \"we are living in times that are both difficult to navigate and to recount\" - adding they present a \"challenge for all of us\", but it is one \"we should not run away from\". The new pontiff said he was repeating an \"invitation\" made by his predecessor Pope Francis by saying: \"Let us disarm communication of all prejudice and resentment, fanaticism and even hatred.\" \"Let us free it from aggression,\" he added. \"Disarmed and disarming communication allows us to share a different view of the world and to act in a manner consistent with our human dignity.\" Leo - the first pope from the US - opened the meeting with a few words in English, before turning to Italian and thanking journalists for covering the conclave and his historic election. Urging them to use words of peace, he said: \"Peace begins with each one of us: in the way we look at others, listen to others and speak about others. \"In this sense, the way we communicate is of fundamental importance: we must say 'no' to the war of words and images, we must reject the paradigm of war.\" Pope Leo XIV's choice to hold his pontificate's first audience with journalists was deeply significant, writes Simone Baglivo, Sky's Europe producer in Vatican City. Speaking with some of the 6,000 media professionals who covered his election, he focused on the need for press freedom around the world.  When he called for the release of journalists imprisoned for seeking the truth, the Vatican's Paul VI Hall erupted in applause. The American pontiff also recognised the tiring work many of us have done here and thanked us for that. Finally, he addressed us as \"dear friends\", delivered a blessing in Latin and decided to personally greet some of us.  While shaking my hand and many others, he confessed he's still learning his new role and isn't planning to visit the US anytime soon.  Instead, he said he's preparing a trip to Nicaea in Turkey, as Pope Francis wanted.  This is his first full week as Pope and many decisions are awaiting him. Yet, he seemed calm and relaxed and made some jokes too.  Read more: Who is Pope Leo XIV?Pope prays at tomb of predecessor The 69-year-old pontiff made history when he was elected as the first US pope last Thursday following a two-day conclave.   During his audience on Monday, the Pope - who spent many years in Peru as a missionary - expressed solidarity with imprisoned journalists and affirmed the \"precious gift of free speech and the press\". Drawing applause from the crowd, he asked for their release. Commenting on those \"who report on war even at the cost of their lives\", the Pope praised \"the courage of those who defend dignity, justice and the right of people to be informed, because only informed individuals can make free choices\". \"The suffering of these imprisoned journalists challenges the conscience of nations and the international community, calling on all of us to safeguard the precious gift of free speech and of the press,\" he added. Leo also addressed artificial intelligence, saying it had to be used with \"responsibility and discernment\". It comes after his first Sunday address since his election as pontiff, where he appealed to crowds in St Peter's Square for \"no more war\".  Quoting his predecessor Francis, he denounced the number of ongoing conflicts as \"a third world in pieces\". The Pope also called for an \"authentic and lasting peace\" in Ukraine and a ceasefire in Gaza and the release of all Israeli hostages."
    },
    {
        "title": "Kurdish militant group PKK announces it is disbanding - after four decades of armed conflict",
        "description": "A Kurdish militant group has announced it is to disband and disarm as part of a peace initiative with Turkey after four decades of armed conflict.",
        "url": "https://news.sky.com/story/kurdish-militant-group-pkk-announces-it-is-disbanding-after-four-decades-of-armed-conflict-13366425",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kurdish-ceasefire_6842836.jpg?20250301090826",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-12 06:22:00",
        "Headline": "The decision by the Kurdistan Workers' Party, or PKK, comes days after it convened a party congress in northern Iraq which assessed that the group's \"historical mission\" had been completed.",
        "Content": "A Kurdish militant group has announced it is to disband and disarm as part of a peace initiative with Turkey after four decades of armed conflict. The historic decision by the Kurdistan Workers' Party, or PKK, comes days after it convened a party congress in northern Iraq. Beyond just relations with Turkey, the development could have far-reaching political and security consequences for the region, including in neighbouring Syria where Kurdish forces are allied with the US military in the fight against Islamic State. More than 40,000 people have been killed in the conflict since the PKK launched its insurgency in 1984 in the hope of carving out a homeland for the Kurds, in an area straddling the borders of southeastern Turkey, northern Syria and Iraq, and part of Iran. The PKK is designated a terrorist group by Turkey and many of its Western allies. A spokesperson for Turkey's ruling AK Party said the PKK's decision to disband was an important step towards a \"terror-free Turkey\" and it would be closing monitoring the dissolution process. International correspondent The announcement that the PKK will lay down its arms is a significant development and could see the end of an uprising that has claimed thousands of lives. The PKK has been in armed conflict with the Turkish state since 1984. The move to disband and disarm follows a call from the group's leader, Abdullah Ocalan. He founded the PKK in 1978 - initially, the aim was to secure a Kurdish state, but over the years, the objective shifted towards gaining greater political and cultural rights. This latest development comes after Ocalan called for a ceasefire in February. The group says it has now achieved its objectives, and armed struggle is no longer the way forward. Instead, it will pursue its goals through democratic channels. There are a number of reasons why all this is happening now. The PKK has been battered by the Turkish military in recent years, and geopolitical changes in Iraq and Syria have made the organisation's operations more difficult. For Turkey, it is a win as President Recep Tayyip Erdogan can boast he's done what his predecessors have failed to do - he can also appeal for support from Kurdish politicians in Turkey to help in his bid for a new term in 2028. At present, that is a constitutional impossibility. There are still many questions about how the group will disband and disarm, though: What happens to the fighters and what happens to the weapons? Questions, too, about the future of Abdullah Ocalan - there are reports that under a deal, he may be paroled. He is currently serving a life sentence. Unravelling the PKK will undoubtedly be a complex process, but the end of the group opens gateways for resolving a conflict that has lasted for 40 years. The Firat news agency published what it said was the closing declaration of a congress that the PKK held last week innorthern Iraq, in response to a call in February from its jailed leader Abdullah Ocalan to disband. The congress \"decided to dissolve the PKK's organisational structure and the end armed struggle, with the practical implementation of this process to be led and overseen by (Ocalan),\" the agency reported. \"As a result, activities carried out under the name 'PKK' were formally terminated.\"  Read more from Sky News:Why Trump is set for truly consequential week - analysisEverything you need to know about P Diddy trial The congress assessed that the PKK's struggle had \"brought the Kurdish issue to the point of resolution through democratic politics, thus completing its historical mission\". It was not immediately clear what was meant by having completed the \"historical mission\". Earlier this year, the PKK declared a ceasefire \"to pave the way for... peace and democratic society\" but attached conditions, including the creation of a legal framework for peace negotiations."
    },
    {
        "title": "Sean 'Diddy' Combs forced women into 'freak offs', jurors told - as hotel CCTV is played in court",
        "description": "Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial.",
        "url": "https://news.sky.com/story/sean-diddy-combs-forced-women-into-freak-offs-jurors-told-as-hotel-cctv-is-played-in-court-13366806",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-brian-steel-sean-combs_6914116.jpg?20250512133129",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-12 16:42:00",
        "Headline": "In the courtroom in Manhattan, New York, Sean Combs blew a kiss to his mother and family members supporting him. He listened intently as both the prosecution and defence outlined the details of his high-profile case, and two witnesses gave evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial. In the courtroom in Manhattan, New York, Combs blew a kiss to his mother and family members supporting him, before listening intently as opening statements from the prosecution and defence outlined the details of the high-profile case. The hip-hop mogul, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, and strenuously denied all allegations of sexual abuse.  His defence lawyers say all sexual encounters were consensual and that the case is really about nothing more than Combs's sexual preferences, which they say should remain private. Combs is a \"flawed individual\", they argue, but not a racketeer or a sex trafficker. The court also heard evidence from two witnesses - a former hotel security guard and a male escort. But first, prosecutor Emily Johnson gave her opening statement. \"To the public, he was Puff Daddy or Diddy,\" she told the court, describing Combs as a \"business icon\" and \"larger than life\". However, there was another side to the rapper, she says - a side that \"ran a criminal enterprise\", she said. He sometimes \"called himself the king\", Ms Johnson said, and expected to be treated like one. \"This is Sean Combs,\" Ms Johnson told jurors as she pointed at Combs, who leaned back in his chair. \"During this trial you are going to hear about 20 years of the defendant's crimes.\" Those crimes, she said, included kidnapping, arson, drugs, sex crimes, bribery and obstruction. Ms Johnson said Combs beat and sexually exploited his former long-term girlfriend Cassie, who was named in court, and compelled the singer and other women to take drugs and have sex with male escorts. He threatened to ruin Cassie's career by publicly releasing videos of these sexual encounters, which were dubbed \"freak offs\", jurors heard. \"Her livelihood depended on keeping him happy,\" the prosecutor said. Jurors will hear testimonies from alleged victims who will talk about \"some of the most painful experiences of their lives\", Ms Johnson continued. \"The days they spent in hotel rooms, high on drugs, dressed in costumes to perform the defendant's sexual fantasies.\" 'This is not a complicated case' But Teny Geragos, who is on Combs's defence team, painted a very different picture. \"Sean Combs is a complicated man,\" she told the court. \"But this is not a complicated case. This case is about love, jealousy, infidelity and money.\" Ms Geragos conceded that Combs could be violent and said she understood some jurors might not condone this, nor his \"kinky sex\". But the rapper is \"not charged with being mean\", she said, and his lifestyle may have been indulgent, but it was not illegal. She also claimed Combs's accusers were motivated by money. Cassie hotel footage shown in court After the opening statements, the first witness, Israel Florez, was called to the stand. Now a police officer in LA, in March 2016, Mr Florez worked as a security guard at a hotel in Los Angeles, where Combs was filmed on CCTV seemingly attacking R&B singer and model Cassie, whose full name is Casandra Ventura. After CNN aired video of the attack last year, the rapper apologised in a video on social media and said he was \"disgusted\" by his actions. Video footage of this incident was shown in court as Mr Florez gave his testimony. He told the court he recognised Combs after responding to a call of a woman in distress on the sixth floor of the hotel. The rapper was wearing only a towel and socks, Mr Florez told the court, and had \"a blank stare, like a devilish stare, just looking at me\". He said that as he was escorting Ms Ventura and Combs to their room, she indicated she wanted to leave and the rapper told her: \"You're not going to leave.\" Combs then offered him money and told him \"don't tell nobody\", Mr Florez said. Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial The second witness, Daniel Phillip, used to work as a male escort, the court was told. He said he met Ms Ventura at a hotel in Manhattan, where he thought he was attending a bachelorette party. However, he said he ended up having sex with Ms Ventura as Combs watched and masturbated, and that he was paid several thousand dollars. Mr Phillip said he had several subsequent encounters with the then couple, which lasted between an hour and 10 hours, and that he witnessed or heard the rapper being violent on two occasions. He told the court he did not intervene as Combs was powerful, and that he feared for his life. His evidence will continue tomorrow. The trial is expected to last about eight weeks. Combs faces up to life in prison if he is convicted."
    },
    {
        "title": "American-Israeli hostage Edan Alexander released by Hamas",
        "description": "Hamas has released Edan Alexander, an Israeli soldier who holds American citizenship, as part of ongoing efforts to achieve a permanent ceasefire with Israel.",
        "url": "https://news.sky.com/story/american-israeli-hostage-edan-alexander-released-hamas-says-13366638",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-edan-alexander-hostage_6914590.jpg?20250512215530",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-12 12:36:00",
        "Headline": "The militant group announced on Sunday it would release the hostage as part of efforts to achieve a ceasefire.",
        "Content": " Hamas has released Edan Alexander, an Israeli soldier who holds American citizenship, as part of ongoing efforts to achieve a permanent ceasefire with Israel. The 21-year-old was believed to be the last living American hostage in Gaza. In a statement, Hamas said: \"The Izz ad-Din al-Qassam Brigades released the captured Israeli soldier, Edan Alexander, a US citizen, a short while ago, following contacts with the US administration. This comes as part of the efforts being made by mediators to achieve a ceasefire, open the crossings, and allow aid and relief to reach our people in the Gaza Strip. \"This step comes after important contacts in which Hamas demonstrated positivity and high flexibility. \"We affirm that serious and responsible negotiations achieve results in the release of prisoners. However, continuing the aggression prolongs their suffering and may kill them. \"We affirm the movement's readiness to immediately begin negotiations to reach a comprehensive and sustainable ceasefire agreement, including the withdrawal of the occupation army, the end of the siege, a prisoner exchange, and the reconstruction of the Gaza Strip. \"We urge the Trump administration to continue its efforts to end this brutal war waged by the war criminal Netanyahu against children, women, and defenceless civilians in the Gaza Strip.\" Mr Alexander was transferred to Israel Defence Forces (IDF) via the Red Cross. An IDF statement said: \"A short while ago, accompanied by IDF forces, the returning hostage, IDF soldier Edan Alexander, crossed the border into Israeli territory.\" He will be checked by doctors and reunited with his family in southern Israel, it added. \"The commanders and soldiers of the Israel Defense Forces salute and embrace the returning hostage as he makes his way home to the State of Israel.\"The IDF Spokesperson's Unit asks everyone to respect the privacy of the returning hostage and his family.\" Mr Alexander's parents, who live in the US, made the journey to Israel ahead of the release. The family said they were deeply grateful to US President Donald Trump and his administration for its work to secure the release - and have urged the Israeli government to continue efforts to free all hostages. Before leaving Washington for a whirlwind visit to Saudi Arabia, Qatar and the United Arab Emirates, Mr Trump told reporters the US national was \"coming home to his parents, which is really great news\". Mr Alexander, who is from New Jersey, was 19 when he was taken from his base on the border with Gaza in southern Israel during the Hamas attacks on 7 October 2023, when 1,200 people were killed. Read more on Sky News:A week that could define TrumpZelenskyy offers to meet PutinUK-based Bulgarian spies jailed The Hostages and Missing Families Forum Headquarters said in a statement: \"After 584 agonising days in captivity, Edan has returned home - to his family who worked tirelessly for his release, to his friends, and to an entire nation that fought and prayed for his return.\" The group called his release \"a ray of light and hope, but also a stark reminder that 58 men and women remain captive in Gaza\". \"We must not leave a single hostage behind. Without bringing everyone home, there can be no true victory, no healing, and no rebuilding as a nation. \"The return of all hostages is our generation's most urgent and critical mission. We will bring them back. We will rise again.​\" Last week Israel said 24 hostages were alive in Gaza, after around 250 were taken in the 2023 Hamas attack. Most of the hostages returned alive to Israel so far have been released as part of deals with Hamas during two temporary ceasefires in late 2023 and early 2025. Before Mr Alexander's release, around 59 hostages were thought to be still inside Gaza, around a third of them believed to be alive. Israel announced earlier this month it intends to occupy the entire Gaza enclave, threatening years of more war. Israel's war on Gaza, launched in retaliation for the 7 October attack, has killed more than 52,000 people and wounded more than 119,000, according to Gaza's Hamas-run health ministry."
    },
    {
        "title": "Donald Trump defends prospect of Air Force One replacement gift from Qatar as a 'very transparent deal'",
        "description": "Donald Trump has defended the possibility of being gifted an Air Force One replacement by the Qatari royal family.",
        "url": "https://news.sky.com/story/donald-trump-defends-prospect-of-air-force-one-replacement-gift-from-qatar-as-a-very-transparent-deal-13366384",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-air-force-one-donald-trump_6913744.jpg?20250512040138",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-12 02:47:00",
        "Headline": "Democrats have accused Donald Trump of succumbing to foreign influence over the prospect of accepting the luxury jet from Qatar. ",
        "Content": " Donald Trump has defended the possibility of being gifted an Air Force One replacement by the Qatari royal family. Described in some reports as a \"palace in the sky\", the Boeing 747-8 jumbo would be from the Qatari royal family and Mr Trump would keep it after his presidency ended, Sky News' US partner NBC News reported. White House press secretary Karoline Leavitt said any gift would comply with the relevant laws. Taking to his own social media platform, Mr Trump tried to defend the possibility. He said: \"So the fact that the Defense Department is getting a GIFT, FREE OF CHARGE, of a 747 aircraft to replace the 40 year old Air Force One, temporarily, in a very public and transparent transaction, so bothers the Crooked Democrats that they insist we pay, TOP DOLLAR, for the plane. \"Anybody can do that! The Dems are World Class Losers!!! MAGA\". Article I, section nine, clause 8 of the US Constitution reads: \"No Title of Nobility shall be granted by the United States: And no Person holding any Office of Profit or Trust under them, shall, without the Consent of the Congress, accept of any present, Emolument, Office, or Title, of any kind whatever, from any King, Prince, or foreign State.\" Read more:Zelenskyy offers to meet PutinTrump sets up week that could define him Ali al Ansari, Qatar's media attache to the US, said the \"possible transfer of an aircraft ... is currently under consideration\". Democrats have said the president must seek Congress's consent to accept such a gift. Senate minority leader Chuck Schumer said: \"Nothing says 'America First' like Air Force One, brought to you by Qatar. \"It's not just bribery, it's premium foreign influence with extra legroom.\""
    },
    {
        "title": "Ukraine, Gaza and China: Why Trump's Middle East tour takes on new importance",
        "description": "Donald Trump's tour of the Middle East this week has taken on a new importance after a series of surprising developments on the wars in Ukraine and Gaza, and on trade between the US and China.",
        "url": "https://news.sky.com/story/ukraine-gaza-and-china-why-trumps-middle-east-tour-takes-on-new-importance-13366383",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-united-states_6913743.jpg?20250512025048",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-12 01:28:00",
        "Headline": "Donald Trump is due to visit Saudi Arabia, then Qatar and the UAE this week in the first major foreign trip of his second presidency.",
        "Content": "Donald Trump's tour of the Middle East this week has taken on a new importance after a series of surprising developments on the wars in Ukraine and Gaza, and on trade between the US and China. After a diplomatic flurry over the weekend, it seemed like steps were being taken towards some form of possible peace in both Gaza and Ukraine. Alongside that, Washington claimed it had made \"substantial progress\" in trade talks with China, with treasury secretary Scott Bessent going as far as to say a deal had been agreed to cut the US trade deficit. But there was no mention of reducing tariffs. Mr Trump is due to travel to the Middle East later today on the first major foreign trip of his second presidency, visiting Saudi Arabia and then Qatar and the UAE. It will coincide with a possible meeting between Ukraine's Volodymyr Zelenskyy and Russia's Vladimir Putin, in person in Turkey, and comes after Hamas said it would release a hostage, an Israeli soldier who holds American citizenship. This leaves Mr Trump facing challenges on three fronts as he visits some of the richest nations in the world. Zelenskyy and Putin to meet? \n                  Trump set for truly consequential week for his presidency and his ability to effect change\n                 \n                  Trump hails 'total reset' with China as trade tariffs slashed\n                 \n                  Trump's tariffs hit the West's busiest port - with traffic down by nearly a third\n                 The US president previously claimed he could end the war in Ukraine in one day - something he has not done. On Sunday, he put pressure on Mr Zelenskyy to sit down and meet with Mr Putin in person after Moscow put forward the proposal for talks in Istanbul. This was something the leader from Kyiv quickly agreed to and it came after European leaders threatened Mr Putin with fresh sanctions.  Thursday could see a potential first in-person meeting between the two leaders since Moscow's invasion began. It could mark an extraordinary moment in the ongoing war in Ukraine, however, the countries are seemingly still a long way from actual peace. 👉 Follow Trump100 on your podcast app 👈 A trade deal or a first step? After Mr Trump declared war on the existing global trade system in April, hitting allies and foes alike with tariffs, it left many reeling and triggered an escalation with China, which slapped Washington with reciprocal measures. While those are still in place, the US said on Sunday that the two have agreed a deal to cut the US trade deficit. However, despite confidence from the US side, China's vice premier He Lifeng described the meeting as an \"important first step\" that created a foundation only. No mention was made of reducing tariffs and this would do little good elsewhere where tariffs continue to add friction to previously freer global trade. Israeli soldier to be released In Gaza, previous efforts to achieve a ceasefire collapsed and Israel implemented a total ban on aid going into the enclave to try to pressure Hamas back to the negotiating table. With charities warning that the 2.3 million Palestinians in Gaza face a humanitarian crisis, the militant group has said it will release Edan Alexander, an Israeli soldier who holds US citizenship. It comes after Israel announced it intends to occupy the entire enclave, threatening years of more war. No exact date was given, but Hamas said it would release the 21-year-old as part of ongoing efforts to achieve a permanent ceasefire with Israel. His expected release has been described as a \"gesture of goodwill\" by Steve Witkoff, Mr Trump's special envoy to the Middle East. The previously agreed ceasefire failed over disagreement on the transition from phase one onwards. While Hamas wanted to progress to phase two, where work would be done towards Israel's permanent withdrawal from Gaza and peace, Israel wanted to extend phase one and release more hostages. Read more:A week that could define TrumpZelenskyy offers to meet PutinHamas says it will release hostage Israel agreed to a framework proposed by the US that would see Hamas release half of the remaining hostages, its main bargaining chip, in exchange for a ceasefire extension and a promise to negotiate a lasting truce. While Mr Alexander is only one hostage, it will be seen as a promising sign that Hamas returned to the negotiating table and Mr Trump will be in Qatar, the key mediator in so-far unsuccessful peace efforts."
    },
    {
        "title": "Nissan to cut 20,000 jobs globally, reports say",
        "description": "Nissan is set to announce a leap in its cost-cutting plans that will see 20,000 jobs go globally, according to reports in Japan.",
        "url": "https://news.sky.com/story/nissan-to-cut-20000-jobs-globally-reports-say-13366718",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-nissan-logo_6568780.jpg?20240529144551",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-12 14:20:00",
        "Headline": "The Japanese carmaker would be expected to clarify its position early on Tuesday when it is due to outline financial results - set to show a big net loss",
        "Content": "Nissan is set to announce a leap in its cost-cutting plans that will see 20,000 jobs go globally, according to reports in Japan. The carmaker, which employs around 6,000 workers at its sprawling manufacturing operations in Sunderland, had already let it be known last November that 9,000 roles would be going amid weak sales and rising costs. But Japanese broadcaster NHK said on Monday it expected that total to more than double. Money latest: Most crowded holiday hotspots revealed Nissan, which was yet to comment on the claim, is due to reveal full year results covering the 12 months to March on Tuesday morning. They are expected to show a net loss of up to £3.8bn due to a series of writedowns on the value of its operations. They will be the first results Nissan has declared since the appointment of a new chief executive last month. \n                  UK's desperation can be exploited as it can't compete with £100bns spent by the US and EU\n                 \n                  Nissan to build three new electric car models in Sunderland\n                 \n                  Nissan commits to 2030 electric car deadline despite delay to UK petrol-diesel ban\n                 Ivan Espinosa issued a \"significant\" downgrade to Nissan's outlook just three weeks ago. If the job cuts report is true, it would amount to a 15% reduction in the company's worldwide workforce. It is not known if the Sunderland production facilities form part of any planned job cuts or production reductions, of up to 20%, that were reported. Nissan has, on several occasions since Brexit, called the plant's future into question before proceeding with investment plans. It has invested £2bn in Sunderland since 2023 alone. The company secured UK government money this year for a new electric powertrain manufacturing facility in Sunderland. But a senior Nissan executive, Alan Johnson, warned more aid was needed just last month, arguing that the UK was \"not a competitive place\" to build cars. Nissan, like rivals, is facing challenges on many fronts. Read more:US-UK trade deal 'isn't worth the paper it's written on'Key details in 'historic' US-UK trade deal US trade tariffs of 25% on all car imports has exacerbated pressure on its supply chain and sales. The latter has been struggling due to weaker-than-anticipated electric car uptake. But the vast majority of its cars made in the UK will be subject to a tariff of just 10% after the UK-US trade deal agreed last week. It does not currently send Sunderland-made cars to the United States. Most are for export to Europe and the domestic UK market."
    },
    {
        "title": "Why Trump blinked in US-China trade war",
        "description": "Of all the fronts in Donald Trump's trade war, none was as dramatic and economically threatening as the sky-high tariffs he imposed on China.",
        "url": "https://news.sky.com/story/trade-war-trump-has-blinked-to-avoid-us-recession-13366594",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6914090.jpg?20250512131541",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-05-12 11:27:00",
        "Headline": "Is the trade war now over? Now that the two sides have blinked, can globalisation continue more or less as it had before? It's a trickier and more complex question than it might first seem.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Of all the fronts in Donald Trump's trade war, none was as dramatic and economically threatening as the sky-high tariffs he imposed on China. There are a couple of reasons: first, because China is and was the single biggest importer of goods into the US and, second, because of the sheer height of the tariffs imposed by the White House in recent months. In short, tariffs of over 100% were tantamount to a total embargo on goods coming from the United States' main trading partner. That would have had enormous economic implications, not just for the US but every other country around the world (these are the world's biggest and second-biggest economies, after all). Trump latest: US and China slash tariffs in trade war de-escalation So the truce announced on Monday by treasury secretary Scott Bessent is undoubtedly a very big deal indeed. In short, China will still face an extra 30% tariffs (the 20% levies cast as punishment for China's involvement in fentanyl imports and the 10% \"floor\" set on \"Liberation Day\") on top of the residual 10% average from the Biden era. But the rest of the extra tariffs will be paused for 90 days. China, in turn, has suspended its own retaliatory tariffs on the US. The market has responded as you would probably have expected, with share prices leaping in relief. But that raises a question: is the trade war now over? Now that the two sides have blinked, can globalisation continue more or less as it had before? That, it turns out, is a trickier and more complex question than it might first seem. For one thing, even if one were to assume this is a permanent truce rather than a suspended one, it still leaves tariffs considerably higher than they were only last year. And China faces tariffs far higher than most other countries (tot up the existing ones and the Trump era ones and China faces average tariffs of around 40%, while the average for most countries is between 8% and 14%, according to Capital Economics). In other words, the US is still implementing an economic policy designed to increase the cost of doing business with China, even if it no longer attempts to prevent it altogether. The fact that last week's trade agreement with the UK contains clauses seemingly designed to encourage it to raise trade barriers against China for reasons of \"security\" only reinforces this suspicion. The trade war is still simmering, even if it's no longer as hot as it was a few days ago. Read more:US-UK trade deal 'isn't worth the paper it's written on'Key details in 'historic' US-UK trade deal And more broadly, the deeper impact of the trade rollercoaster in recent months is unlikely to disappear altogether. Companies remain more nervous about investing in factories and expansions in the face of such deep economic instability. No-one is entirely sure the White House won't just U-turn once again. That being said, it's hard not to escape the conclusion that the US president has blinked in this trade war. In the face of a potential recession, he has pulled back from the scariest and most damaging of his tariffs, earlier and to a greater extent than many had expected."
    },
    {
        "title": "12-hour days, £350k salaries: Life as a divorce lawyer",
        "description": "If you've ever spent your Monday morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, our Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to Yael Selig, partner at Osbornes Law and head of the family offices...",
        "url": "https://news.sky.com/story/12-hour-days-163350k-salaries-life-as-a-divorce-lawyer-13366592",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-careers-money-blog_6914039.jpg?20250512123439",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-12 11:31:00",
        "Headline": "Divorce lawyer Yael Selig tells the Money blog about salaries, long hours and the biggest mistake warring couples make.",
        "Content": "If you've ever spent your Monday morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, our Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to Yael Selig, partner at Osbornes Law and head of the family offices... I work 10-12 hours a day... The nature of my work means that I often have to work in the evenings due to unexpected issues. My workload is very intense, but I do try to make time for lunch. Of course, this very much depends on what is going on in a particular week. Newly qualified you'd expect to earn £50k... A top divorce lawyer... £350,000. We bill in six-minute increments... I deal with private clients, so it very much depends on the task at hand. If, for example, I have a 20-minute call with a client, this will mean that I will put down my time as three units. We do pilates... We recently introduced a weekly class in the office as well as various other wellbeing incentives (lunchtime walks, for example), which have all been met with great enthusiasm. This tells you a lot about how staff do need to be encouraged to get up from their desks. I wanted to be a dancer... I did ballet from a young age until I was 14 and then went on to join a contemporary dance group until I was 18. I come from a family of lawyers, so I decided to do a law degree. I do love connecting with people and family law seemed like the best option for me; it's the one I enjoyed most when I was studying. I have a reputation as a \"Rottweiler\"... I was acting for an older vulnerable client who was clearly being bullied by his ex-wife. She was the first to coin the phrase. You need patience and empathy. You need to be a good listener and a problem solver. But you also need to have some fight in you, as essentially you are a litigation lawyer. \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  London Underground stations shut and lines suspended as power cut hits Tube\n                 Unfortunately, it is inevitably a messy business, though I think I strike the right balance as I try my very best to resolve matters outside the court process and through negotiations. There are cases, unfortunately, where court is the only option, and this is where my reputation kicks in. Everyone hates something about their job and for me it's... the tight deadlines. You are often having to work to court deadlines and when your workload is super busy, it means you are faced with lots of these. There are two circumstances when I'd refuse a client... if it is unaffordable - litigation can be expensive. I always make sure that any potential client is made aware of the likely costs from the outset. And if a client is dishonest and wants to hide assets - then of course I cannot act for them. The biggest misconception about lawyers is... That you are cold and ruthless and only interested in fees. I lost a client to cancer... during divorce proceedings. I still think of him. Despite his diagnosis, the wife wanted to push on with litigation. Thankfully, I succeeded in stopping the proceedings while he undertook very aggressive chemotherapy. The courts were very sympathetic as he was diagnosed with terminal cancer, and he didn't know how long he had to live. His doctor's guess was that, at best, he had a year. I did everything I could to ensure that during the last eight months of his life he did not have to deal with the angst of court proceedings. I was adamant that, despite the other side's insistence to try and draw him into the litigation (court dates etc), I was not going to allow that to happen. I fought very hard for him, and we succeeded. He was a real gentleman who kept his sense of humour until the end of his days. What's it really like to be a...Brain surgeonChildren's entertainerRoyal photographer The job hasn't changed my opinion of marriage but... it does make me value my relationship. People can avoid a messy divorce by... being reasonable and not allowing their emotions to cloud their judgement. I accept this is difficult to do. In my experience, when the parties have a good line of communication between them, it helps keep matters on an even keel and they do not escalate. The most common mistake people make is to raise the temperature by... texting each other directly and insulting the other, and making threats regarding the children, which then makes matters considerably worse. If I had to do it all again... I would. Repeat, repeat, repeat! Despite the stress and intense workload... I do love my work. I have no plans to retire yet and haven't given it much thought. My job is very full on but I am very energetic, and I do love people and meeting new clients. It's what keeps me going."
    },
    {
        "title": "Everything you need to know about pension drawdown and annuities ",
        "description": "Annuities and drawdown are the two main ways of using your pension pot to fund your retirement. But how are they different? What option is best for you? And what risks do you need to be aware of? ",
        "url": "https://news.sky.com/story/everything-you-need-to-know-about-pension-drawdown-and-annuities-13366707",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-money-istock-pensions_6914258.jpg?20250512152342",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-12 13:51:00",
        "Headline": "Deciding what to do with your pension pot can be a difficult decision. Our Money blog team explains the two most popular options and everything you need to consider.",
        "Content": "Annuities and drawdown are the two main ways of using your pension pot to fund your retirement. But how are they different? What option is best for you? And what risks do you need to be aware of?  Our Money blog team has put together a guide explaining everything you need to know about the two options. First, let's take a look... DRAWDOWN This is a way of managing how you spend your pension pot - and is a much more flexible way of accessing your pension than its main alternative, the annuity. It allows you to take sums out gradually while leaving the rest invested. Pension providers and investment platforms offer the product, which is generally available to people aged 55 and over (rising to 57 from 2028) with a defined contribution pension, and not final salary or defined benefit pensions. \n                  Nissan to cut 20,000 jobs globally, reports say\n                 \n                  Trump hails 'total reset' with China as trade tariffs slashed\n                 \n                  Why Trump blinked in US-China trade war\n                 How does it work? You usually start by taking up to 25% of your pension pot tax-free. The rest is moved into what's called a \"drawdown account\", where it remains invested in funds of your choosing, such as stocks or bonds. You can take income from that invested pot whenever you like - but anything you withdraw beyond the tax-free portion (25%) is taxed at your income tax rate. The risk You have full control over how much to withdraw and how often, making it flexible for changing income needs - which sounds ideal. However, because your pot remains invested, it can rise or fall depending on market performance. Poor investment returns or withdrawing too much too soon could mean your money runs out in retirement. It can take just one volatile world event, such as Donald Trump imposing tariffs, to wipe significant value from your fund. You also need to make sure you take responsibility for the drawdown - keeping an eye on how it's performing, when to take out lump sums etc. If you don't plan properly and run out of money, that's on you. ANNUITIES This financial contract converts your savings into an annual income, like a state pension, rather than flexible drawdowns. The product is sold by insurance companies to those aged 55 and over and can be fixed-term or lifetime. Payments are made either annually, biannually, quarterly or monthly, and how much you receive depends on the size of your pension savings, the features of your particular annuity, and your health and lifestyle. How does it work? The annuity payment is an annual percentage of the amount you convert. So if you spend £100,000 of your pension savings on an annuity product at a 5% rate, you'll get £5,000 a year. Once you've agreed to the contract, you cannot change your annuity, take out lump sums, or transfer it to someone else. There are different types of annuity... Fixed v lifetime Lifetime annuities guarantee you a set income for the rest of your life, no matter how long that is. Fixed-term or temporary annuities pay an income for a set period of time, often between three and 25 years. This allows you to shop around for other options once the contract ends. Some people might use them as a bridge between retirement and the beginning of their state pension at age 66. Read more: 'My wife lost her job and we're buying a house - do we need to tell our mortgage provider?'Do you really need an estate agent to sell your home?Millions missing out on extra pension money - here's how to get yours What rates are available There are various packages, so let's start with the simplest. Level annuities pay out the same amount of money each year but they are vulnerable to inflation, which can reduce your standard of living over time. Escalating annuities provide a partial solution to this problem, increasing at a fixed percentage each year (eg 3%). The catch is that payments begin at a lower rate than level annuities. Inflation-linked annuities rise in line with the retail price index (RPI), proofing your income against inflation, but starting at a much lower rate. Investment-linked annuities invest part of your pension fund and pay out extra income - or not - based on the performance of the investment. Impaired or enhanced annuities can be used if you have health issues that are expected to shorten your lifespan. This allows larger annual payments to be made on the basis that insurance companies expect to spread them over a shorter period of time. Joint life annuities allow you to pay your spouse or partner after your death, but often at a lower rate. Or you can protect a lump sum in your initial agreement to be transferred to your loved one when you pass away. Taxation Annuities contribute to your personal allowance and, once that is reached, are taxable like any other income stream. Remember, you are entitled to draw down a 25% lump sum tax-free from your pension pot. An annuity paid to a spouse or partner after your death is also subject to income tax, unless you die before the age of 75. Advantages and disadvantages In summary, here are the positives and negatives to consider. Differences between drawdown and annuity  Here are the main differences between the two: Can you mix the two? Yes - in fact, the number of people doing this is growing. You can split your pension pot - buying an annuity with one part and using drawdown with the other. This hybrid approach helps balance steady and secure income with the prospect of growth with the other - as well as control over your remaining funds."
    },
    {
        "title": "FTSE-100 group Experian kicks off hunt for next chairman",
        "description": "Experian, the FTSE-100 credit referencing giant, is kicking off a hunt for a successor to its long-serving chairman.",
        "url": "https://news.sky.com/story/ftse-100-group-experian-kicks-off-hunt-for-next-chairman-13366536",
        "image_url": "https://e3.365dm.com/21/06/1920x1080/skynews-experian-logo-credit_5426115.jpg?20210624163818",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-12 10:08:00",
        "Headline": "Experian is working with headhunters to identify a successor to Mike Rogers, who has chaired the credit referencing giant since 2019, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Experian, the FTSE-100 credit referencing giant, is kicking off a hunt for a successor to its long-serving chairman. Sky News understands that Experian is working with headhunters to identify a replacement for Mike Rogers, who has chaired the company since July 2019. Mr Rogers has been on the company's board since the summer of 2017, meaning his independence will be 'timed out' under corporate governance guidelines by July 2026. Sources close to the process said a successor was unlikely to be in place until next year. The search for Experian's next chairman is being led internally by Alison Brittain, the Premier League chair, who serves as the company's senior independent director. One of the new chair's most pressing tasks is likely to be lining up a long-term successor to Brian Cassin, Experian's chief executive since 2014. Under Mr Cassin's leadership, the group's valuation has soared, and it now boasts a market capitalisation of more than £35bn. \n                  Nissan to cut 20,000 jobs globally, reports say\n                 \n                  Trump hails 'total reset' with China as trade tariffs slashed\n                 \n                  Why Trump blinked in US-China trade war\n                 Experian's global operations and strong presence in the US, have triggered speculation that it could follow other London-listed companies in switching its primary listing to New York. The shares have risen by about 14% during the last year. An Experian spokesman declined to comment."
    },
    {
        "title": " Great British Menu judge on a 'ridiculously good' own-brand product, complaining in restaurants and wine list tip",
        "description": "Every week the Money blog interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more - and they don't come much more celebrated than Lorna McNee, executive chef at Michelin-starred Cail Bruich in Glasgow. ",
        "url": "https://news.sky.com/story/great-british-menu-judge-on-a-ridiculously-good-own-brand-product-complaining-in-restaurants-and-wine-list-tip-13366584",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-money-blog-lorna-mcnee_6911579.png?20250510031837",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-12 11:17:00",
        "Headline": "Lorna McNee, executive chef at Michelin-starred Cail Bruich in Glasgow, tells the Money blog team about her favourite own-brand product, weird restaurant requests and why she loves Nando's.",
        "Content": "Every week the Money blog interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more - and they don't come much more celebrated than Lorna McNee, executive chef at Michelin-starred Cail Bruich in Glasgow.  This year she became a judge on Great British Menu, having been crowned champion of champions on the show in 2019. This is her Cheap Eats interview... My favourite own-brand product is... the Waitrose Basque cheesecake, hands down. It's ridiculously good. Rich, creamy, just the right amount of caramelised top... honestly, it's dangerous having it in the fridge. My favourite restaurant chain... has got to be Nando's. I go extra hot every time - no messing around. I always get a wrap with halloumi added, and then go all in with corn on the cob, spicy rice and fries on the side. Absolute perfection. And yes, I do judge anyone who orders lemon and herb. One UK restaurant that's worth blowing out for... has to be The Ledbury in London. Every time I've been it's absolutely blown me away. The level of finesse, the depth of flavour, the way they handle produce - it's all just exceptional. You can feel the passion in every course. It's one of those places where you leave genuinely inspired. If you're going to treat yourself, that's the spot to do it. I'll phone a restaurant if I'm going to be 10 minutes' late... I know how much planning goes into each service, so I hate the idea of throwing things off or keeping the team waiting. We understand life happens, but a quick call really does go a long way. It shows respect for the effort going on behind the scenes - and if you're like me, it helps ease that little knot of guilt too! \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  London Underground stations shut and lines suspended as power cut hits Tube\n                 The last time I complained in a restaurant... my mum had ordered a dish that was meant to come with haggis bon bons, and when it arrived, it was clearly black pudding. They tried to tell me it was haggis. I stayed calm, but eventually I said: \"I'm a chef - I know the difference.\" That changed the tone pretty quickly! I've got no problem if something's gone wrong, it happens - but just be honest about it. Don't try and pull a fast one, especially when mum's involved! The weirdest request I ever had was... someone ordering, in advance, two bananas (skin on!) and one baked potato wrapped in tinfoil. To this day, I have absolutely no idea why that's what they wanted… no explanation, no context, just that exact request. But hey, if it makes them happy, I'm more than happy to oblige. Don't be afraid to set a price limit when asking for advice about the wine list... or say something like: \"I'm looking for something between £X and £Y.\" It's super helpful and takes the pressure off. I didn't train for years to have a dish go cold while someone's getting the perfect drip shot of a sauce... Some influencers are great - genuinely passionate about food, respectful in the way they share it, and they can really help shine a light on restaurants that deserve it. But then there are the ones who turn up late, ask for \"extra aesthetic lighting\", spend more time filming than eating, and want the meal comped in return for a reel. It's not a performance - it's a restaurant. Also, if you're going to post reviews or critiques, be mindful. You're not Gordon Ramsay - and a bit of negative clout online might get you likes, but it can really knock a small team working their socks off. Share the love, but do it with respect. The most annoying review I ever had was... someone complaining that they could hear the kitchen. Well, of course you could! It's an open kitchen. Don't dine somewhere with an open kitchen if you don't want to hear it. Reviews, both good and bad, are part of having people take interest in your restaurant - and that's a positive thing. But unless you've had a genuinely poor experience, I do think leaving a bad review can be quite damaging. Especially when it comes from someone with no real understanding of our culture, how hard we work or how much we love what we do. There's always someone behind that plate who's poured their heart and soul into it. You don't have to love every bite , but show a bit of respect. It matters. My favourite cheap place to eat is... Caio in Bridge of Allan. You could get a half pizza - pepperoni would be my go-to - then finish with one of their homemade pistachio gelatos, which is just brilliant. The coffee's great too, proper quality. Here's a cheap mushroom stroganoff recipe...  Ingredients: Method: It's cosy, rich and takes around 20 minutes start to finish. You can easily bulk it out with extra veg like spinach or frozen peas - it won't stretch your pocket much further and will fill you for longer. Winning and now being a judge on Great British Menu has had a huge impact on my career... It opened so many doors and brought a level of recognition that you can't really prepare for. When I stepped into the role at Cail Bruich, there was already excitement and curiosity because of GBM, and I think that momentum helped us hit the ground running. Read more:The story of olive oil's 110% price riseMy tumble dryer takes nine hours - what can I do?All the latest consumer news from the Money blog But it has changed customer expectations... People arrive now with higher expectations, which is a good thing - it keeps us sharp. There's also a wider variety of diners coming in, not just locals or regulars, but people travelling from further afield who maybe saw the show and want to experience the food in person. GBM has given people a reason to walk through the door for the first time - but it's the team and the experience that keep them coming back. One thing people are often surprised by is just how intense and real the timings on the show are... When you see that clock ticking down on TV - it's not for show. There are no retakes, no pauses. What you cook in that time is what gets judged, full stop. It's incredibly high pressure, but also really exhilarating. The judging room is just as nerve-wracking as it looks... Even now, as a judge myself, I still get butterflies walking into that room."
    },
    {
        "title": "All you need to know about half-term strikes at Gatwick Airport",
        "description": "Baggage handlers and plane refuelers at Gatwick Airport are due to go on strike starting this Friday.",
        "url": "https://news.sky.com/story/all-you-need-to-know-about-half-term-strikes-at-gatwick-airport-13366575",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gatwick-airport-gatwick_6833402.jpg?20250219094107",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-12 11:04:00",
        "Headline": "Two companies, Red Handling and Red Line, which provide baggage handling and plane refuelling services at Gatwick, are planning industrial action for various dates – both of which coincide with the May half-term holiday in England and Wales.",
        "Content": "Baggage handlers and plane refuelers at Gatwick Airport are due to go on strike starting this Friday. Two companies, Red Handling and Red Line, are planning industrial action for various dates - both of which coincide with the May half-term holiday in England and Wales. Here we look at when the strikes are planned and what you can do if your flight is affected. When are the strikes happening? Red Handling and Red Line staff are striking on different days - but both coincide with the May half-term holiday in England and Wales from 26 to 30 May. Around 100 Red Handling employees, who work across baggage handling, check-in, and flight dispatching, are due to walk out on 18 May, 25 May, and 1 June. Red Line Oil Services, which runs plane refueling operations at Gatwick, are on strike between 16 and 20 May and 23 and 27 May. Read more from Sky NewsRyanair launches membership - Money latestEnergy customers get compensation for errorWhy Trump blinked in US-China trade war The second week of Red Line's industrial action is likely to cause the most disruption with hundreds of thousands due to fly abroad for the school holidays. Red Handling strikes were due to start on 11 May but were suspended for a week amid ongoing negotiations between its union and the company. Which airlines will be affected?  More than 40 airlines operate from Gatwick - across 150 short-haul and 40 long-haul destinations. It is the largest UK hub for easyJet, with Ryanair, British Airways, TUI, Vueling and Wizz all flying from there too. Both easyJet and Ryanair say they do not anticipate any impact to their customers. What are my rights if my flight is cancelled or delayed? If your flight is delayed or cancelled as a result of strikes by airline staff, you are entitled to compensation or a refund. However, strikes by third-party companies such as air traffic controllers, are not usually covered - as they are considered \"extraordinary circumstances\" under UK261 - the UK equivalent of EU aviation regulation. This could mean you are left out of pocket by this month's action - with those due to fly on the affected dates advised to consider their own contingency plans. Scott Dixon, a consumer and motoring disputes expert, says: \"Industrial action by third-party staff, like baggage handlers or refuellers, is usually treated as an 'extraordinary circumstance' and outside of the airline's control. \"Check your travel insurance policy to see if it covers strike-related delays or cancellations, especially if the strikes were announced before you bought your ticket.\" He adds: \"Evidence is key on all complaints. Keep all receipts and records of expenses and take screenshots of communication from the airline. \"Use the airline's official complaints process first. Airlines often stonewall these complaints and blatantly flout the law, knowing the majority of affected passengers will give up.\" Last-minute 'wildcat' strikes by third-party companies, which don't have the support of an official union, are not exempt under the 'extraordinary circumstance' criteria after the ruling by European judges in the German case of Helga Krusemann and others v TUIfly that airlines must provide compensation to ensure passengers arrive in their destination as planned. Why are staff striking - and what do they want?  Staff at both companies are represented by Unite the Union, which claims employees are being underpaid, paid late, suffering missed or incorrect pension payments, and not getting proper breaks. Red Handling staff were offered a 4.25% salary increase this year - and 3% rise next year, alongside their sickness waiting period being reduced from three days to two, but they rejected the deal. They were then offered the 4.25% salary increase as part of a one-year deal but rejected this as well. Unite general secretary Sharon Graham said: \"Workers at both companies have had enough of poor pay offers and appalling treatment from their employers and it is little surprise they are taking strike action. We will back our members at Red Handling and Redline all the way during these disputes.\" What have Gatwick, airlines, and striking companies said?  A Gatwick spokesperson told Sky News they are \"working closely with both parties and our airlines to minimise impacts to passengers\". \"Of course, we hope Red Handling, Redline Oil and their unions can reach a resolution before then,\" their statement added. EasyJet said in a separate statement: \"Should any action go ahead, contingency plans that we have been advised are in place mean we do not expect any impact and our flying programme which is currently planned to operate normally, so nothing different should be suggested.\""
    },
    {
        "title": "Virgin Media O2 and Daisy unite to form £3bn business telecoms group",
        "description": "Virgin Media O2 and Daisy Group are to unveil a merger of their business communications and IT operations in a bid to create a &#163;3bn telecoms powerhouse.",
        "url": "https://news.sky.com/story/virgin-media-o2-and-daisy-unite-to-form-1633bn-business-telecoms-group-13366453",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-virgin-media-o2-job-cuts_6229298.jpg?20230725010532",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-12 07:50:00",
        "Headline": "VMO2 is merging its business arm with Daisy Group to form a new company with annual revenues of about £1.4bn in a deal to be announced later on Monday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Virgin Media O2 and Daisy Group are to unveil a merger of their business communications and IT operations in a bid to create a £3bn telecoms powerhouse. Sky News has learnt that the two companies will announce later on Monday that they are to combine to form a company with annual revenues of about £1.4bn. Virgin Media O2 will own 70% of the new business, while Daisy Group will own 30%. The tie-up will create a stronger challenger to BT Group, Britain's biggest provider of IT and telecoms services to small and medium-sized businesses (SMEs). The new VMO2-Daisy business will have roughly 700,000 customers, and be valued at between £2.5bn and £3bn including debt. Combining the two operations is expected to produce substantial cost savings, according to one insider. Telecoms industry sources said that Matthew Riley, the Daisy Group founder, would chair the company, while Jo Bertram, the managing director of Virgin Media O2 Business, would be its chief executive. \n                  Nissan to cut 20,000 jobs globally, reports say\n                 \n                  Trump hails 'total reset' with China as trade tariffs slashed\n                 \n                  Why Trump blinked in US-China trade war\n                 It is the latest in a string of deals engineered by Mr Riley since he founded Daisy in 2001. One source said it was likely to be subjected to rigorous scrutiny by the Competition and Markets Authority, but was not expected to encounter any major obstacles. Both VMO2 and Daisy have been contacted for comment."
    },
    {
        "title": "Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer",
        "description": "US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said.",
        "url": "https://news.sky.com/story/minister-does-not-rule-out-supermax-prisons-for-most-dangerous-offenders-following-alleged-rudakubana-attack-13366851",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-crime-preston-prison_6913736.jpg?20250512001252",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-12 18:36:00",
        "Headline": "James Timpson tells the Politics Hub with Sophy Ridge that community sentences should also be considered for non-violent offenders.",
        "Content": " US-style \"supermax\" jails could be built to house the most dangerous offenders following a spate of alleged attacks on staff, the prisons minister has said. James Timpson told the Politics Hub with Sophy Ridge that \"we shouldn't rule anything out\" when asked if the most dangerous criminals should be placed in top security prisons. It comes after Southport triple killer Axel Rudakubana allegedly threw boiling water from a kettle at an officer at HMP Belmarsh on Thursday. Police are now investigating. Politics latest: PM has undergone a 'miraculous conversion', say Tories  Before that, three prison officers were also allegedly attacked by 28-year-old Hashem Abedi - the brother of Manchester Arena bomber Salman Abedi - with hot cooking oil and \"improvised knives\", potentially made from a baking tray. Speaking from HMP Preston for a special programme of the Politics Hub, Mr Timpson told Sophy Ridge: \"We inherited a complete mess in the prison system. \"Violence is up, assaults on staff is up. But for me, we shouldn't rule anything out.\" \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 \n                  Woman says she was 'junkie, shoplifter' - here's what turned her life around\n                 \n                  Prison officer says his 'greatest fear' is colleague getting murdered on duty\n                 He added: \"What we need to do is to speak to our staff. They're the experts at dealing with these offenders day in, day out. \" Mr Timpson - who was the chief executive of Timpson Group before he was appointed prisons minister last year - said the violence in prisons was \"too high\".  He continued: \"The number of people when you have prisons are so full, and the people in there are not going to education or into purposeful activity. \"You get more violence and that is totally unacceptable. Our staff turn up to work to help turn people. \"They want to turn people's lives around. They didn't turn up to work to get assaulted. It's totally unacceptable.\" Read more: Should some women offenders be spared jail? Prison officer 'will be killed if government does not get a grip' Reflecting on the crisis facing the UK prison system ahead of the government's sentencing review, Mr Timpson said a major problem was the high rate of reoffending, saying \"80% of offending is reoffending\". He said people were leaving places like HMP Preston \"addicted to drugs, nowhere to live, mental health problems - and that's why they keep coming back\". Asked whether every prison had a drugs issue, he replied: \"100%.\" \"If we want to keep the public safe, we need to do a lot more of the work in here and in the community. But also we need to build more prisons.\" Put to him that making more use of community sentences - thought to be one of the recommendations in the government's sentencing review - might be considered a \"cushy option\" compared to a custodial sentence, Mr Timpson said: \"There are some people in this prison tonight who would prefer to be in prison than do a community sentence - but that's not everybody. \"Community sentences need to be tough punishments outside of prison, not just to help them address their offending behaviour, but also the victims need to see punishments being done too and for me, technology has a big part to play in the future.\""
    },
    {
        "title": "What are Sir Keir Starmer's new immigration rules?",
        "description": "Sir Keir Starmer has promised to bring down migration numbers by tightening up the rules on those allowed to come to the UK.",
        "url": "https://news.sky.com/story/what-are-sir-keir-starmers-new-immigration-rules-13366468",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-uk-border-heathrow_6760256.jpg?20250512115004",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-12 08:16:00",
        "Headline": "The prime minister says he will bring net migration down by 2029 by being tougher on every area of immigration - work, family and study.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has promised to bring down migration numbers by tightening up the rules on those allowed to come to the UK. The prime minister promised his new plan will reduce net migration - the difference between immigration and emigration - by the end of this parliament in 2029. Details of the plans have been published in a white paper, a government document that outlines policy proposals before being introduced as legislation. Politics latest: Starmer makes migration vow as he unveils crackdown Sky News has combed through the white paper to bring you the details. Language requirements All visa routes will require people to have a certain level of English proficiency. \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  Islamic State fighters who return to the UK must face justice, committee says\n                 \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 People coming with the main visa holders - dependents - will also have to have a basic understanding of English, which they currently do not. The level of proficiency needed depends on the visa, with a skilled worker visa requiring at least upper intermediate level. Currently, it requires just an \"intermediate\" level. To extend visas, people will have to show progression in their English. Settled status Currently, people have to live in the UK for five years before they can gain settled status. Under the new plan, they will have to live in the UK for 10 years. However, \"high-contributing\" individuals such as doctors and nurses could be allowed to apply for settled status after five years. A new bereaved parent visa will be created so those in the UK who have a British or settled child that dies can get settled status immediately. Settled status gives people the right to work and live in the UK for as long as they like, and provides them with the same rights as citizens, such as healthcare and welfare and the right to bring family members to live in the UK. People with settled status can then choose to apply for British citizenship. Read more:Restricting staffing during shortage has care sector worriedUK-US trade deal 'isn't worth the paper it's written on'  British citizenship People can qualify sooner for citizenship by contributing to UK society and the economy, like settled status. The Life in the UK test will be reformed. Social care visa This visa, which allowed care workers to come to the UK due to a shortage, will not exist anymore. There will be a transition period until 2028 when visa extensions and switching to the visa for those already here will be allowed.  Skilled worker visa People wanting to come to the UK on a skilled worker visa must now have at least an undergraduate university degree. The minimum was previously A-levels. There will also be tighter restrictions on recruitment from overseas for jobs with \"critical\" skills shortages, as well as strategies to incentivise employers to increase training and participation rates in the UK. Very highly skilled people, in areas the government identifies, will be given preferential access to come to the UK legally by increasing the number of people allowed to come through the \"high talent\" routes such as the global talent visa, the innovator founder visa and high potential individual route. A limited pool of refugees will be allowed to apply for employment through the skilled worker route. Study visas People on graduate visas will only be allowed to remain in the UK for 18 months after they finish their studies. Currently, students finishing degrees can stay for two years if they apply for the graduate visa, or those finishing PhDs can stay for three. Institutions sponsoring international students will have their requirements strengthened, with those close to failing their sponsor duties placed on an action plan and limits imposed on the number of new students they can recruit. Sponsors, who can cover tuition fees and living costs, include overseas governments, UK government scholarships, UK government departments, UK universities, overseas universities, companies and charities. Humanitarian visa The Ukraine, Hong Kong and Afghanistan humanitarian visa routes will remain. However, the government will review the effectiveness of sponsorship arrangements for those schemes so businesses, universities and community groups can \"sustainably\" sponsor those refugees. Domestic worker visa To help prevent modern slavery, the government will reconsider this visa, which currently allows foreign national domestic workers to visit the UK with their employer for up to six months. Businesses Companies wanting to bring people from abroad to work for them in the UK will have to invest in the UK first. To prevent exploitation of low-skilled workers on temporary visas already in the UK, the government will look at making it easier for workers to move between licensed sponsors for the duration of their visa. The right to family life A growing number of asylum seekers have used the \"right to family life\" - Article 8 of the Human Rights Act - to stop their deportation. Legislation will be introduced to \"make clear it is the government and parliament that decides who should have the right to remain in the UK\". It will set out how Article 8 should be applied in different immigration routes so \"fewer cases are treated as 'exceptional'\". Foreign national offenders The Home Office will be given powers to more easily take enforcement and removal action, and revoke visas in a much wider range of crimes where people did not serve jail time in other countries. Deportation thresholds will be reviewed to take into account more than just the length of their sentence, with violence against women and girls taken more seriously. Enforcement Sir Keir said the immigration rules - at the border and in the system - will be more strongly enforced than before \"because fair rules must be followed\". People who claim asylum, particularly after arriving in the UK, where conditions in their home country have not materially changed, will face tighter controls, restrictions and requirements where there is evidence of abuse of the system. Other governments will be made to play their part to stop their nationals coming to the UK, or from being returned. Sponsors of migrant workers or students abusing the system will have financial penalties or sanctions placed on them, and they will be given more support to ensure compliance. People on short-term visas who commit an offence will be deported \"swiftly\". Scientific and tech methods will be explored to ensure adults coming to the UK are not wrongly identified as children. eVisas, which have now replaced physical documents, will help tackle illegal working and support raids on those overstaying their visas or on the wrong visa. Major banks are legally obligated to refuse current accounts to individuals suspected of being in the UK illegally and to notify the Home Office. This will be extended to other financial institutions."
    },
    {
        "title": "Islamic State fighters who return to the UK must face justice, committee says",
        "description": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said.",
        "url": "https://news.sky.com/story/islamic-state-fighters-who-return-to-the-uk-must-face-justice-committee-says-13366924",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-khaled-brigade-syria_6786301.jpg?20241227150134",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-12 22:28:00",
        "Headline": "More than 400 people who fought for ISIS in Syria and Iraq are believed to have later returned to the UK, without being prosecuted. A new report is calling for changes to the law to help authorities be better equipped to go after them.",
        "Content": "Islamic State fighters who return to the UK after killings, terror attacks and persecuting minorities must face justice, a committee of MPs and peers has said. More than 400 people who fought for the group, also called ISIS and Daesh, are thought to have then returned to the UK, after travelling to the Middle East. ISIS once held swathes of land in Syria and Iraq and was responsible for widespread campaigns of terror, murder, and rape. This often targeted minority religious groups like the Yazidis. Sky News recently released a documentary on ISIS and the Yazidis, led by special correspondent Alex Crawford. Crawford gave evidence to parliament's Joint Committee on Human Rights (JCHR), which in a new report has warned that none of the ISIS supporters who had made their way back to the UK had been successfully prosecuted. It called on the government to take steps to ensure they can be tried in British courts, after ministers previously claimed such crimes were \"best investigated and prosecuted under local laws\" - meaning abroad. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Yazidi women still enslaved in ISIS detention camps, Sky News documentary reveals\n                 \n                  Five jihadists found guilty of holding French journalists hostage\n                 'The UK cannot wash its hands of this' \"Where the UK has jurisdiction over international crimes, the UK should seek to investigate and prosecute such crimes,\" the committee's latest report said. However, the report said that UK courts faced a \"key barrier\" to delivering justice on war crimes and genocide. This was because it is not possible to prosecute people for these crimes unless they are UK nationals, residents or \"subject to service personnel laws\". The committee said ministers should use the Crime and Policing Bill, currently making its way through parliament, to amend the law. Read more:The camps full of the radicalised children of ISThe Londoner locked up in a forgotten prison Lord Alton, chairman of the JCHR, said: \"This is not something the UK can simply wash its hands of because it happened overseas. \"We know that British nationals committed the most horrendous crimes in Iraq and Syria under the Daesh [ISIS] regime and we have a duty to see them brought to justice. \"To date, no Daesh fighters have been successfully prosecuted for international crimes in the UK and we find this unacceptable.\" The committee added that more must also be done to repatriate children held in camps in northeast Syria where former ISIS fighters and their families are being held. 'There are no rights for anything' Crawford was one of those who gave evidence to the committee. She first met Yazidi women captured by ISIS in 2014, and has covered the topic a number of times since, including most recently in the 10 Years Of Darkness: ISIS & The Yazidis documentary. She told the committee the camps in northeast Syria were \"filled with hopelessness and helplessness, and a really strong anger and frustration\".  \"There are multiple human rights concerns,\" she said, adding that those living there essentially had no rights. She went on: \"There is no right of freedom. There is no right to access to legal representation. There are no rights for anything. \"Many of the children - I do not know how many - have been born there. \"They are very young - younger than six - so many of them have been born there in, to be honest, very dirty, disgusting conditions.\""
    },
    {
        "title": "Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes",
        "description": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes.",
        "url": "https://news.sky.com/story/fire-at-sir-keir-starmers-house-in-north-london-investigated-by-police-13366745",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-house_6914629.jpg?20250512231945",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-12 15:05:00",
        "Headline": "The entrance to Sir Keir Starmer's house was damaged in the fire. Nobody was hurt and a police cordon remains in place.",
        "Content": "Police investigating a fire at a north London house owned by Prime Minister Sir Keir Starmer are also looking into whether it is linked to two other recent blazes. The Metropolitan Police said on Monday evening that detectives are checking a vehicle fire in NW5 last week and a fire at the entrance of a property in N7 on Sunday to see whether they are connected to the fire at Sir Keir Starmer's house in the early hours of Monday morning. The prime minister is understood to still own the home and used to live there before he and his family moved into 10 Downing Street after Labour won last year's general election. It is believed the property is being rented out. Counter-terrorism police are leading the investigation as a precaution, the Met said. The blaze damaged the entrance to the house, but there were no injuries, the force said. Politics latest: Starmer announces migration crackdown A statement from the Metropolitan Police said: \"On Monday 12 May at 1.35am, police were alerted by the London Fire Brigade to reports of a fire at a residential address. \n                  Sir Keir Starmer's migration package is significant - but will it be enough?\n                 \n                  Migration - Is Labour Reform-ing?\n                 \n                  Is this Sir Keir Starmer's biggest week as PM?\n                 \"Officers attended the scene. Damage was caused to the property's entrance, nobody was hurt. \"As a precaution and due to the property having previous connections with a high-profile public figure, officers from the Met's Counter Terrorism Command are leading the investigation into this fire. Enquiries are ongoing to establish the potential cause of the fire.\" A police cordon and officers, as well as investigators from London Fire Brigade, could be seen outside and at one point, part of the street was cordoned off to all vehicles. London Fire Brigade said firefighters were called just after 1am, and the blaze was out within half an hour. It described the incident as \"a small fire outside a property\". Read more:What are Mr Starmer's new immigration rules?Why movie line reflects public mood on prisonsHow PM sealed Trump trade deal Sir Keir expressed his gratitude to the police and fire services via his official spokesman, who said: \"I can only say that the prime minister thanks the emergency services for their work, and it is subject to a live investigation. So I can't comment any further.\" On Monday, Sir Keir made a major policy speech on immigration, promising to bring down net migration by the end of this parliament with a system that is \"controlled, selective and fair\". He did not clarify how far he wants figures to fall, only saying numbers will come down \"substantially\" as he set out plans in the government's Immigration White Paper, including banning care homes from hiring overseas."
    },
    {
        "title": "Sir Keir Starmer's migration package is significant - but will it be enough?",
        "description": "There's little doubt Sir Keir Starmer's proposals to curb legal migration are substantial and are likely to result in a meaningful reduction.&#160;",
        "url": "https://news.sky.com/story/sir-keir-starmers-migration-package-is-significant-but-will-it-be-enough-13366832",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-prime-minister_6914503.jpg?20250512191755",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-05-12 17:35:00",
        "Headline": "The prime minister shifted the political dial as he rejected the longstanding claim about the link between growth and migration.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There's little doubt Sir Keir Starmer's proposals to curb legal migration are substantial and are likely to result in a meaningful reduction.  That the ban on new care workers from overseas is causing angst in the sector is proof that it will make a difference, regardless of the arguments for and against the plan. Increasing the educational qualifications and English language requirements simply squeezes the eligibility of potential migrants. The decision to double from five to 10 years the wait to become a permanent resident means a much tougher qualifying period than the US. This is a significant package. Politics latest: Watch Sophy Ridge live from Category B jail But will it be enough, given we've had other substantial packages under previous administrations? Perhaps - but we will not know for years. But as well as moving the policy debate, the prime minister is also changing the political terms of discussion. Sir Keir insisted on Monday that he rejects the longstanding claim of Labour predecessors about the link between growth and migration. \n                  Migration - Is Labour Reform-ing?\n                 \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Is this Sir Keir Starmer's biggest week as PM?\n                 Although he has previously made this argument, the latest announcement was the most emphatic rejection of a cornerstone of cross-party thinking that lasted up to and through the Brexit referendum. The prime minister now says he knows better but what has he done about that? Read more:What are Starmer's new immigration rules?Labour's immigration plan builds on Tory rollbacks An unspoken feature of our government since Brexit has been that successive chancellors have ended up as advocates for higher migration, knowing that any drop in numbers would also hit their growth projections. There are those in Downing Street who believe that the interaction of fiscal rules and OBR forecasts do not capture the true net economic cost-benefit of migration. But when I asked Sir Keir about this, and whether he could change the way of measuring the economic impact of migration, he dodged the question. But does anyone have the answer? Farage's approach Most presume the toughest solutions come from Nigel Farage's Reform UK, and he attacks the prime minister for fiddling around the edges. But how would he do it? Last year's Reform manifesto promised a \"freeze on non-essential immigration\", claiming it has \"pushed Britain to breaking point\". However, this still provides scope for migrants with \"essential skills, mainly around healthcare, (which) must be the only exception\". But is this not exactly the sort of wiggle room that Mr Farage would criticise if another party exercised it? I pressed Mr Farage on how big this exemption would be, and after dodging the question several times - saying that I was missing the point because most migrants do not work - he replied: \"I can't tell you the numbers right now, I don't have all the figures. \"What I can tell you is anyone that comes in will not be allowed to stay long-term. That's the difference.\" He added: \"You ask me in four years' time, all right? Ask me in four years' time.\" This is the first time Mr Farage has offered a numerical cap before the next election. Even broad brush promises in opposition are complex. Let's see if the debate is still as salient by the next election."
    },
    {
        "title": "Starmer says net migration will fall with 'controlled, selective and fair' system",
        "description": "Sir Keir Starmer has pledged to bring down net migration by the end of this parliament with a system that is \"controlled, selective and fair\".",
        "url": "https://news.sky.com/story/starmer-says-net-migration-will-fall-with-controlled-selective-and-fair-system-13366455",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-prime-minister_6913971.jpg?20250512111450",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-12 07:56:00",
        "Headline": "The prime minister tells a Downing Street news conference that parts of the UK's economy \"seem almost addicted to importing cheap labour\".",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has pledged to bring down net migration by the end of this parliament with a system that is \"controlled, selective and fair\". However, the prime minister has refused to say how far he wants figures to fall, only saying numbers will come down \"substantially\". Politics latest: Starmer announces sweeping migration crackdown Sir Keir was speaking at a news conference ahead of the publication of the government's Immigration White Paper, which sets out plans including banning care homes from hiring overseas. The prime minister said: \"Some people think controlling immigration is reining in a sort of natural freedom, rather than the basic and reasonable responsibility of the government to make choices that work for a nation's economy. \"And for years, this seems to have muddled our thinking. But let me be clear, it ends now. We will create a migration system that is controlled, selective, and fair.\"  He added: \"Let me put it this way, nations depend on rules, fair rules. \"In a diverse nation like ours, and I celebrate that, these rules become even more important. \"Without them, we risk becoming an island of strangers, not a nation that walks forward together.\" 'Chasing the tail of the right' The prime minister's \"island of strangers\" rhetoric has attracted criticism from within his own party, including Labour MP Sarah Owen, who said it could put the UK on \"a very dark path\". The chair of the Women and Equalities Select Committee said \"fair and sensible\" checks on immigration \"should not equal blaming all the woes of our country on immigrants\". \"The best way to avoid becoming an 'island of strangers' is investing in communities to thrive - not pitting people against each other,\" she added. \"I've said it before and will say it again, chasing the tail of the right risks taking our country down a very dark path.\" Nadia Whittome, the Labour MP for Nottingham East, also said the phrase mimicked the \"scaremongering of the far-right\", while former shadow chancellor John McDonnell argued it was reminiscent of the late politician Enoch Powell. Asked if net migration would fall, Sir Keir said it would \"fall substantially by the end of this parliament\" - but didn't give a specific target. He said it was not sensible \"to put a hard-edged cap on it\" as that has \"been done in one form or another for the best part of 10 years by different prime ministers\" and never worked. However, he pledged to go \"further and faster\" if needed, saying record high levels of net migration over the past few years have \"tested the theory\" that it can lead to economic growth. Read more:Labour's restrictive immigration approach builds on Tory rollbacksFarage addresses how Reform UK would deal with migration Net migration - the difference between the number of people immigrating and emigrating to a country - soared when the UK left the EU in January 2020. It reached 903,000 in the year to June 2023 before falling to 728,000 in mid-2024. But that is still well above its pre-Brexit high of 329,000 in the year up to June 2015. The government is under pressure to tackle legal migration, as well as illegal immigration, amid Reform UK's surge in the polls. 👉 Listen to Sky News Daily on your podcast app 👈 Sir Keir insisted cutting migration is something he believes in, saying parts of the UK's economy \"seem almost addicted to importing cheap labour\" rather than investing in skills at home. He said: \"On a day like today, people who like politics will try to make this all about politics, about this or that strategy targeting these voters, responding to that party. \"No, I'm doing this because it is right, because it is fair, and because this is what I believe in.\" But Reform's leader Nigel Farage told Sky News' deputy political editor Sam Coates that Monday's measures are a \"knee jerk reaction\" to his party's success at the local elections and the prime minister \"doesn't have the vigour\" to follow them through. What is in the immigration white paper?  Proposals in the government's white paper include raising the skills visa threshold to require a degree and higher salary, and closing the social care visa route to overseas recruitment. Other measures include: • Increasing English language requirements for visa holders and their dependants;• Narrowing the list of critical shortage occupations on the Temporary Shortage List;• Restricting dependants for lower skilled workers on the Temporary Shortage List and increasing salary thresholds for all visa holders seeking to bring in dependants;• Reducing time overseas students can stay from five years to 18 months after studies finish, and tighter rules on student visas;• Migrants having to wait 10 years for permanent settlement rather than five, unless they are \"high contributors\" The document suggests these measures could reduce immigration to the UK by around 98,000 per year. It is not clear how the government intends to boost its domestic workforce to fill the gaps that have been plugged by foreign labour, which the care sector is particularly reliant on. The Liberal Democrats called for a \"clear plan to make it easier to recruit British workers to fill vacancies\", including increasing the minimum pay of care workers and reforming the apprenticeship system. PM 'taking public for fools' Tory leader Kemi Badenoch accused the prime minister of \"taking the public for fools\" with his tough on immigration rhetoric, saying Labour has previously voted against many of the measures they are now proposing. She refused to take responsibility for her party overseeing record levels of migration, saying she was \"not running the cabinet\" then, and called for a legally binding cap on the number of people coming in. \"Kicking tough solutions and decisions into the long grass with a white paper is not going to solve the problem that we have right now\", she said."
    },
    {
        "title": "Nigel Farage says he would allow essential migration but numbers would be capped",
        "description": "Nigel Farage has told Sky News he would allow some essential migration in areas with skill shortages but that numbers would be capped. ",
        "url": "https://news.sky.com/story/nigel-farage-says-he-would-allow-essential-migration-but-numbers-would-be-capped-13366603",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-reform_6902067.jpg?20250512140558",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-12 11:49:00",
        "Headline": "The Reform UK leader tells Sky News his party will announce the proposed cap on immigration before the next election.",
        "Content": " Nigel Farage has told Sky News he would allow some essential migration in areas with skill shortages but that numbers would be capped.  The Reform UK leader said he would announce the cap \"in four years' time\" after he was pressed repeatedly by Sky's deputy political editor Sam Coates about his manifesto pledge to freeze \"non-essential\" immigration. Politics latest: PM accused of 'shameful' language in migration crackdown It was put to Mr Farage that despite his criticism of the government's migration crackdown, allowing essential migration in his own plans is quite a big caveat given the UK's skills shortages. However the Clacton MP said he would allow people to plug the gaps on \"time dependent work permits\" rather than on longer-term visas. He said: \"Let's take engineering, for argument's sake. We don't train enough engineers, we just don't. It's crazy. \"We've been pushing young people to doing social sciences degrees or whatever it is. \"So you're an engineering company, you need somebody to come in on skills. If they come in, on a time dependent work permit, if all the right health assurances and levies have been paid and if at the end of that period of time, you leave or you're forced to leave, then it works.\" Read more:What are Starmer's new immigration rules?The choice facing Labour in face of Reform threat - analysis  Reform's manifesto, which they call a \"contract\", says that \"essential skills, mainly around healthcare, must be the only exception\" to migration. Pressed on how wide his exemption would be, Mr Farage said he hopes enough nurses and doctors will be trained \"not to need anybody from overseas within the space of a few years\". He said that work permits should be separate to immigration, adding: \"If you get a job for an American TV station and you stay 48 hours longer than your work permit, they will smash your front door down, put you in handcuffs and deport you. \"We allow all of these routes, whether it's coming into work, whether it's coming as a student, we have allowed all of these to become routes for long-term migration.\"  Asked if he would put a cap on his essential skills exemption, he said: \"We will. I can't tell you the numbers right now, I don't have all the figures. What I can tell you is anyone that comes in will not be allowed to stay long-term. That's the difference.\" Pressed if that was a commitment to a cap under a Reform UK government, he suggested he would set out further detail ahead of the next election, telling Coates: \"Ask me in four years' time, all right?\" Mr Farage was speaking after the government published an immigration white paper which pledged to ban overseas care workers as part of a package of measures to bring down net migration. The former Brexit Party leader claimed the proposals were a \"knee jerk reaction\" to his party's success at the local elections and accused the prime minister of not having the vigour to \"follow them through\". However he said he supports the \"principle\" of banning foreign care workers and conceded he might back some of the measures if they are put to a vote in parliament. He said: \"If it was stuff that did actually bind the government, there might be amendments on this that you would support. But I'm not convinced.\""
    },
    {
        "title": "Restrictive immigration approach by Labour government builds on Conservative rollbacks",
        "description": "The government is planning a range of measures designed to restrict immigration to the UK, which will likely further reduce net migration - but without further details the impact is unclear.",
        "url": "https://news.sky.com/story/restrictive-immigration-approach-by-labour-government-builds-on-conservative-rollbacks-13366681",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-border-force-immigration_6914226.jpg?20250512145514",
        "type": "Politics",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-05-12 13:19:00",
        "Headline": "The government has pledged to reduce net migration figures by the end of the parliament but has not set a specific cap. With net migration already in decline and projected to fall further, it should not be a difficult target to meet. ",
        "Content": "\n          Data journalist\n              @joelysantacruz\n The government is planning a range of measures designed to restrict immigration to the UK, which will likely further reduce net migration - but without further details the impact is unclear. Among the measures in the white paper are changes to the types and numbers of work visas issued to foreign workers, including scrapping social care visas altogether. Announcing the policy proposals, the prime minister Sir Keir Starmer said he would get net migration \"down by the end of this parliament\", but would not be drawn on a specific number or yearly targets. Politics latest: Starmer announces sweeping migration crackdown Net migration - the difference between the number of people arriving (immigration) and leaving (emigration) - was already on track to fall from unusually high levels seen since Brexit, when rules for non-EU migrants were relaxed, according to the Migration Observatory research institute at the University of Oxford. It says Monday's announcement is more of a continuation of rollbacks that began under the previous Conservative government, which combined with new measures just unveiled could ultimately leave the system looking more similar to pre-Brexit rules for non-EU citizens. Georgina Sturge, data consultant at the Migration Observatory, said: \"These measures look likely to bring net migration down further if they work as intended, although a lot will depend on precisely how the measures are implemented.\" The number of work visas, including in social care, had already significantly declined before Monday's announcement. This is largely due to rule changes under the previous government preventing some workers bringing family members to the UK. There were around 370,000 work visas issued in 2024, a 40% drop compared to 2023, when around 614,000 were issued - the highest number on record. When these latest statistics were released, Sir Keir Starmer's government was keen to take credit for overseeing a fall in immigration. But, in reality, most of the drop was driven by changes earlier in the year under Rishi Sunak's government, which themselves were an attempt to undo large immigration rises during Boris Johnson's leadership. Read more:What are Starmer's new immigration rules?Restricting staffing during shortage has care sector worried Of the 278,000 visas issued to dependants of the main applicant in 2023, nearly three quarters of those were in the health and care worker category. As rule changes came into effect in early 2024, limiting health and care dependants, both the number of main applicants as well as the number of dependants decreased by more than half, while visas for other workers remained fairly stable. Still, there may be advantages to the announcement to entirely close the route, which has been plagued with issues including worker exploitation. \"In terms of numbers, a lot of that decrease has already happened. But what's really important to consider here is that there have been significant issues with the care route beyond just the numbers,\" Mihnea Cuibis, researcher at the Migration Observatory, told Sky News. \"We have had very numerous reports of exploitation of migrants and have seen the Home Office struggle to manage this route. So one advantage to the Home Office is that it will close down a route that has been problematic.\" It may also be positive for those care workers who have already emigrated to the UK, but found the job they came for was non-existent or not as advertised, he added. The care sector can continue to hire from this pool of workers until 2027. Recruitment issues in the care sector have persisted in spite of large levels of international recruitment. The latest data from industry body Skills for Care on the care workforce in England showed that recruitment had improved in recent years - though as this data is on a lag it does not show the impact of recent rule tightening from 2024 onwards. In spite of an increased number of 'filled posts', the number of vacancies remains higher than in 2020, as demand for carers has continued to rise. \"For the care sector, of course, there's continuing issues around recruitment, mostly because of problems with pay and conditions. And these restrictions that are introduced are not going to affect that,\" Mr Cuibis explained. The government has also hinted at exemptions for other sectors, including in construction, where international recruitment could contribute to growth targets. Significant workforce shortages will need to be overcome if the government is to meet its housebuilding targets, with around 240,000 recruits needed across the sector by 2027, including 20,000 bricklayers, 20,000 ground workers, and 2,400 electricians, according to a recent report from the Home Builders Federation. In 2024, only 11,000 construction worker visas were issued, hardly close to the number needed to fill workforce gaps. But again, this is an area where the government says it wants to see an increase in homegrown skills and training. Mr Cuibis added that many questions around how the new system will operate remain unanswered, and that the \"devil will be in the details\". The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Prison officer 'will be killed if government does not get a grip' after recent attacks, Robert Jenrick warns",
        "description": "A prison officer will be killed if the government does not get a grip following recent attacks, the shadow justice secretary said.",
        "url": "https://news.sky.com/story/prison-officer-will-be-killed-if-government-does-not-get-a-grip-after-recent-attacks-robert-jenrick-warns-13366771",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-12 15:46:00",
        "Headline": "Southport child killer Axel Rudakubana allegedly threw boiling water over an officer and Manchester Arena plotter Hashem Abedi threw hot oil and used a makeshift weapon to stab officers.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A prison officer will be killed if the government does not get a grip following recent attacks, the shadow justice secretary said. Robert Jenrick said violence against prison officers has \"spiralled out of control in just the past month\" after several were injured, by Axel Rudakubana at HMP Belmarsh last week, and by Hashem Abedi at HMP Frankland on 12 April. Southport triple child killer Rudakubana allegedly threw boiling water from a kettle at a prison officer through a hatch in his cell door on Friday. Manchester Arena bomb plotter Abedi threw hot cooking oil at three officers and stabbed them with improvised blades at a kitchen in a separation centre holding seven prisoners with extremist views, including extremist preacher Anjem Choudary. Politics latest: MPs condemn Starmer's migration speech Asking an urgent question for a response to Rudakubana's attack, Mr Jenrick queried why a \"snap review\" into prison safety ordered by the government after Abedi's attack three weeks ago still has no answers. \"I'm warning now, if the government doesn't get a grip, a prison officer will be killed,\" he told the Commons. \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  What are Sir Keir Starmer's new immigration rules?\n                 \n                  Islamic State fighters who return to the UK must face justice, committee says\n                 \"We've had enough reviews, we need action. That's the least prison officers deserve.\" Mr Jenrick said every prison officer dealing with dangerous inmates should be provided with a stab vest \"not in June, but now\". He also called for justice minister Sir Nicholas Dakin to order the removal of \"every kettle from high-risk prisoners\" now, as he said officers have told him attacks with boiling water are \"not uncommon\". \"I couldn't care less if Rudakubana never had a hot drink again, nor would the British public,\" he said. Read more:What are Starmer's new immigration rules?Fire at Starmer's north London house Sir Nicholas refused to ban kettles straight away, saying if a \"risk is identified regarding kettle use, or intelligence is received that one might be used in assault, the kettle will be withdrawn\". However, he said access to kitchens was withdrawn straight after Abedi's attack, but the review into removing equipment, such as kettles, is complex. He said the reviews, including one into Rudakubana's attack, are being done \"in fast time but they need to be done properly\". Sir Nicholas said overcrowded prisons are causing increased violence to prison officers, an issue he accused the previous Conservative government of failing to tackle. North Durham Labour MP Luke Akehurst said many of his constituents are officers at HMP Frankland and revealed that during the attack by Abedi, they were unable to use batons as the space was too small to wield them, and the convicted murderer was \"so enraged\" pepper spray had no effect on him. \"Clearly, they need additional equipment,\" he said. Sir Nicholas added a trial into two types of tasers will be launched this summer for specialised officers, with the findings to inform any future use of them in prison \"so that we can get it right in the future\"."
    },
    {
        "title": "Migration - Is Labour Reform-ing?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>       ",
        "url": "https://news.sky.com/story/migration-8211-is-labour-reform-ing-13366762",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-daily-migration_6914314.png?20250512162628",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-12 15:06:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  The prime minister has announced a plan to reduce net migration as he warned the UK risks becoming an \"island of strangers\".  Sir Keir Starmer wants to bring in tougher English language tests and restrict overseas carer recruitment as part of his policy overhaul to \"tighten up\" the immigration system. On this episode of the Sky News Daily, host Niall Paterson is joined by our deputy political editor Sam Coates to discuss whether this is a change in direction for the government after suffering losses in the local elections. Producer: Natalie KtenaEditor: Philly Beaumont"
    },
    {
        "title": "Weight loss jabs could almost halve risk of obesity-related cancers beyond slimming down, study suggests",
        "description": "Weight loss injections could help prevent cancer beyond helping people slim down, new research suggests.",
        "url": "https://news.sky.com/story/weight-loss-jabs-could-almost-halve-risk-of-obesity-related-cancers-beyond-slimming-down-study-suggests-13366443",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-ozempic-weight-loss_6598081.jpg?20240704095139",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-12 07:15:00",
        "Headline": "Being overweight or obese is the second biggest cause of cancer in the UK, causing more than one in 20 cancer cases, according to the NHS.",
        "Content": "Weight loss injections could help prevent cancer beyond helping people slim down, new research suggests. The study said that there were similar rates of obesity-related cancer among patients treated with the injections and those given weight loss, or bariatric, surgery. It also found weight loss jabs, officially GLP-1 receptor agonists, could almost halve the risk of related cancers - in addition to the expected health benefits from losing weight. Dr Yael Wolff Sagy, the study's co-lead author from Clalit Health Services in Tel-Aviv, Israel, said a \"direct effect\" of the injections was that they were found \"to be 41% more effective at preventing obesity-related cancer\". She added: \"We do not yet fully understand how GLP-1s work, but this study adds to the growing evidence showing that weight loss alone cannot completely account for the metabolic, anti-cancer, and many other benefits that these medications provide.\" Being overweight or obese is the second biggest cause of cancer in the UK, causing more than one in 20 cancer cases, according to the NHS. Read more:What are the weight loss injections?How easy is it to get weight loss drugs?  In the study, researchers looked at electronic health record data for obese people and those with type 2 diabetes, all with no prior history of cancer, who were treated with first-generation GLP-1 receptor agonists. Over a typical follow-up of seven and a half years, 298 patients were diagnosed with obesity-related cancer, with the most common types being breast, bowel and womb cancer. The analysis found that obesity-related cancer occurred in 150 of 3,178 bariatric surgery patients and in 148 of 3,178 patients taking GLP-1 receptor agonists, despite the \"relative advantage\" of bariatric surgery in weight reduction. Further study suggested the drugs had a direct effect on reducing obesity-related cancer beyond weight loss, with a 41% lower relative risk compared to bariatric surgery. Co-lead Professor Dror Dicker, from Hasharon Hospital, Rabin Medical Centre in Israel, suggested the protective effects of the drugs \"likely arise from multiple mechanisms, including reducing inflammation\". \"New generation, highly potent GLP1-RAs with higher efficacy in weight reduction may convey an even greater advantage in reducing the risk of obesity-related cancers,\" he added, before warning that future research is needed \"to make sure that these drugs do not increase the risk for non-obesity-related cancers\". Naveed Sattar, professor of cardiometabolic medicine at the University of Glasgow, also cautioned that the study \"cannot confirm or refute any links of incretin-based therapies [medicines to treat type 2 diabetes] with cancer as the design was not a trial but rather observational\". Read more from Sky News:Hamas says it will release American-Israeli hostageWoman reveals devastating impact of little-known disorder The study was published in the journal eClinicalMedicine, and was presented at the European Congress on Obesity in Malaga. It comes as the NHS weighs up offering weight loss drugs from pharmacies at the cost of a standard prescription - £9.90. At the moment, there is a two-year waiting list for Wegovy on the NHS - and last year, research by Sky News showed the rollout is happening far more slowly than planned."
    },
    {
        "title": "'Simple' MRI test can identify heart disease risk 10 years early - study",
        "description": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study.",
        "url": "https://news.sky.com/story/simple-mri-test-can-identify-heart-disease-risk-10-years-early-study-13366703",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-heart-attack-cardio_6914241.jpg?20250512150219",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-12 13:49:00",
        "Headline": "Researchers say the finding could \"save vast numbers of lives\" and mean patients get pre-emptive treatment years in advance.",
        "Content": "An MRI scan can spot people at risk of heart disease a decade before a potential stroke or heart attack, according to a study. University of Dundee researchers collected data from 5,015 volunteers between 2008 and 2013. At the time, none had a history of heart disease or were at immediate risk. However, 10 years on, they found an increased (but normal) mass of the heart's left ventricle was a \"clear indicator\" of the risk of future cardiovascular disease. The risk was the same even if the organ was functioning as expected at the time of the tests. The study also found men and women had different risk factors: A larger left ventricle was linked with diastolic blood pressure in men, but in women it was linked with cholesterol. Ventricles are the lower two chambers of the heart - blood is pumped through them, aided by four valves. Professor Jill Belch, who led the study, said a \"simple\" MRI scan could be used to identify people at risk years before a potential heart attack or stroke. \n                  Police investigating fire at Sir Keir Starmer's house - and possible links with two other blazes\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  London Underground stations shut and lines suspended as power cut hits Tube\n                 \"The ability to provide pre-emptive treatment for patients at a stage where their heart is working perfectly well could save vast numbers of lives,\" she said. Read more from Sky News:Weight loss jabs could almost halve risk of cancers - studyFirst moon rocks on Earth in half a century arrive in UK Prof Belch added: \"The volunteers who took part in this study had no immediate risk of heart disease. \"This is exciting as it allows us to pick up people, and treat them, before any organ damage has occurred.\" Lifestyle factors such as obesity, smoking, bad diet and lack of exercise can increase the risk of cardiovascular disease - but some people are also genetically more susceptible. The study appears in the journal Radiology."
    },
    {
        "title": "Sean 'Diddy' Combs forced women into 'freak offs', jurors told - as hotel CCTV is played in court",
        "description": "Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial.",
        "url": "https://news.sky.com/story/sean-diddy-combs-forced-women-into-freak-offs-jurors-told-as-hotel-cctv-is-played-in-court-13366806",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-brian-steel-sean-combs_6914116.jpg?20250512133129",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-12 16:42:00",
        "Headline": "In the courtroom in Manhattan, New York, Sean Combs blew a kiss to his mother and family members supporting him. He listened intently as both the prosecution and defence outlined the details of his high-profile case, and two witnesses gave evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs's public persona was that of a \"charismatic\" hip-hop mogul - but behind the scenes he forced women into \"freak off\" sexual encounters with escorts and blackmailed them with videos, prosecutors alleged during the first day of his trial. In the courtroom in Manhattan, New York, Combs blew a kiss to his mother and family members supporting him, before listening intently as opening statements from the prosecution and defence outlined the details of the high-profile case. The hip-hop mogul, 55, has pleaded not guilty to charges of sex trafficking, racketeering conspiracy and transportation to engage in prostitution, and strenuously denied all allegations of sexual abuse.  His defence lawyers say all sexual encounters were consensual and that the case is really about nothing more than Combs's sexual preferences, which they say should remain private. Combs is a \"flawed individual\", they argue, but not a racketeer or a sex trafficker. The court also heard evidence from two witnesses - a former hotel security guard and a male escort. But first, prosecutor Emily Johnson gave her opening statement. \"To the public, he was Puff Daddy or Diddy,\" she told the court, describing Combs as a \"business icon\" and \"larger than life\". However, there was another side to the rapper, she says - a side that \"ran a criminal enterprise\", she said. He sometimes \"called himself the king\", Ms Johnson said, and expected to be treated like one. \"This is Sean Combs,\" Ms Johnson told jurors as she pointed at Combs, who leaned back in his chair. \"During this trial you are going to hear about 20 years of the defendant's crimes.\" Those crimes, she said, included kidnapping, arson, drugs, sex crimes, bribery and obstruction. Ms Johnson said Combs beat and sexually exploited his former long-term girlfriend Cassie, who was named in court, and compelled the singer and other women to take drugs and have sex with male escorts. He threatened to ruin Cassie's career by publicly releasing videos of these sexual encounters, which were dubbed \"freak offs\", jurors heard. \"Her livelihood depended on keeping him happy,\" the prosecutor said. Jurors will hear testimonies from alleged victims who will talk about \"some of the most painful experiences of their lives\", Ms Johnson continued. \"The days they spent in hotel rooms, high on drugs, dressed in costumes to perform the defendant's sexual fantasies.\" 'This is not a complicated case' But Teny Geragos, who is on Combs's defence team, painted a very different picture. \"Sean Combs is a complicated man,\" she told the court. \"But this is not a complicated case. This case is about love, jealousy, infidelity and money.\" Ms Geragos conceded that Combs could be violent and said she understood some jurors might not condone this, nor his \"kinky sex\". But the rapper is \"not charged with being mean\", she said, and his lifestyle may have been indulgent, but it was not illegal. She also claimed Combs's accusers were motivated by money. Cassie hotel footage shown in court After the opening statements, the first witness, Israel Florez, was called to the stand. Now a police officer in LA, in March 2016, Mr Florez worked as a security guard at a hotel in Los Angeles, where Combs was filmed on CCTV seemingly attacking R&B singer and model Cassie, whose full name is Casandra Ventura. After CNN aired video of the attack last year, the rapper apologised in a video on social media and said he was \"disgusted\" by his actions. Video footage of this incident was shown in court as Mr Florez gave his testimony. He told the court he recognised Combs after responding to a call of a woman in distress on the sixth floor of the hotel. The rapper was wearing only a towel and socks, Mr Florez told the court, and had \"a blank stare, like a devilish stare, just looking at me\". He said that as he was escorting Ms Ventura and Combs to their room, she indicated she wanted to leave and the rapper told her: \"You're not going to leave.\" Combs then offered him money and told him \"don't tell nobody\", Mr Florez said. Read more:The rise and fall of Sean CombsDiddy - a timeline of allegationsEverything you need to know about the trial The second witness, Daniel Phillip, used to work as a male escort, the court was told. He said he met Ms Ventura at a hotel in Manhattan, where he thought he was attending a bachelorette party. However, he said he ended up having sex with Ms Ventura as Combs watched and masturbated, and that he was paid several thousand dollars. Mr Phillip said he had several subsequent encounters with the then couple, which lasted between an hour and 10 hours, and that he witnessed or heard the rapper being violent on two occasions. He told the court he did not intervene as Combs was powerful, and that he feared for his life. His evidence will continue tomorrow. The trial is expected to last about eight weeks. Combs faces up to life in prison if he is convicted."
    },
    {
        "title": "Father Ted co-creator Graham Linehan denies harassing transgender woman",
        "description": "Father Ted co-creator Graham Linehan has pleaded not guilty to harassing a transgender woman and damaging her phone.",
        "url": "https://news.sky.com/story/father-ted-co-creator-graham-linehan-denies-harassing-transgender-woman-13366724",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-graham-linehan-court_6914253.jpg?20250512155139",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-12 14:28:00",
        "Headline": "Linehan, 56, said in a post on X in April that the allegations were related to an incident at a conference in London last October.",
        "Content": "Father Ted co-creator Graham Linehan has pleaded not guilty to harassing a transgender woman and damaging her phone. The Bafta-winning writer, who also came up with TV sitcoms The IT Crowd and Black Books, appeared at Westminster Magistrates' Court on Monday to deny the charges of harassing Sophia Brooks on social media and damaging her mobile in October. Linehan, 56, who created the three-season sitcom Father Ted in the 1990s with fellow Irish writer Arthur Mathews, said in a post on X in April that the allegations were related to an incident at the Battle of Ideas conference in London on 19 October. Court documents show Linehan is charged with harassing the alleged victim, a transgender activist, by posting abusive comments about her on social media between 11 October and 27 October, and damaging her phone to the value of £369 on the day of the conference. Outside court after the short hearing, he wore a T-shirt with a picture of a Daily Telegraph front page with the headline 'Trans women are not women', and said: \"For six years, ever since I began defending the rights of women and children against a dangerous ideology, I have faced harassment, abuse and threats. \"I've lost a great deal, but I am still here, and I will not waver in my resolve.\" Read more from Sky News:Green Party co-leader denies split over trans rightsThousands attend trans rights protests following Supreme Court ruling Deputy District Judge Louise Balmain told Linehan his trial would take place on 4 September this year at the same court. Linehan has become a strong vocal critic of the trans rights movement in recent years. He was freed on bail with the condition not to contact the complainant directly or indirectly."
    }
]