[
    {
        "title": "US trade court blocks Donald Trump from imposing sweeping global tariffs - claiming he exceeded his authority",
        "description": "A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports.",
        "url": "https://news.sky.com/story/us-trade-court-blocks-donald-trump-from-imposing-sweeping-global-tariffs-claiming-he-exceeded-his-authority-13376237",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tariffs-trump-trade_6883640.jpg?20250412104019",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 23:44:00",
        "Headline": "The White House is vowing to appeal the ruling - and it's currently unclear how the verdict will affect the recently signed UK-US trade deal.",
        "Content": " A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports. A three-judge panel concluded that the US president exceeded his authority when he unveiled additional taxes on foreign-made goods. Tariffs must typically be approved by Congress - but Trump has argued he had power to act because it was a \"national emergency\". The controversial measures unveiled on \"Liberation Day\" in April, which included a 10% tariff on UK imports, had caused aggressive sell-offs in the stock market. Minutes after the Court of International Trade delivered its verdict, the Trump administration filed a notice of appeal - meaning the battle could escalate to the Supreme Court. Several lawsuits have been filed against the president's tariffs - and this ruling relates to a case brought on behalf of five small businesses that import goods from other countries. The companies, which sell everything from wine to musical instruments, had argued they were struggling to survive because of these additional costs. \n                  Elon Musk leaving role in the Trump administration\n                 \n                  Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks\n                 \n                  Trump administration halts international student visa applications\n                  The ruling came shortly before Elon Musk confirmed he was leaving his role in the Trump administration. Trump's deputy chief of staff Stephen Miller criticised the court on social media, writing: \"The judicial coup is out of control.\" And in a fiery statement, the White House added: \"It is not for unelected judges to decide how to properly address a national emergency.\" Spokesperson Kush Desai went on to say that trade deficits - where the US imports more from a country than it exports - have \"decimated American communities and left our workers behind\". But Oregon's attorney general, Dan Rayfield, welcomed the ruling and described Trump's tariffs as unlawful, reckless and economically devastating. And Ron Wyden - the top Democrat on the Senate Finance Committee - said the president's actions had \"jacked up prices on groceries and cars, threatened shortages of essential goods, and wrecked supply chains for American businesses large and small\".  Before the court's intervention, flat tariffs of 10% worldwide were in force - with higher rates for specific countries due to be implemented on 9 July. Economists had expressed fears that the tariffs could exacerbate inflation, and even cause a recession. The US dollar strengthened as investors digested the news - with stock market futures also rallying higher. \"We're just trying to work out what it might mean basically but obviously the market is doing a kneejerk reaction so I guess it's reversing a lot of the moves that we've seen,\" National Australia Bank's head of FX strategy Ray Attrill said. One of the three judges who heard the case was appointed by the Trump administration, while the other two were named by Ronald Reagan and Barack Obama during their terms in the Oval Office.  Earlier this month, the UK and US agreed a trade deal that would lower tariffs on British cars sold in the US from 27.5% to 10% - and eliminate duties on UK steel and aluminium altogether. At this stage, it is unclear how the trade court's ruling will affect this arrangement."
    },
    {
        "title": "Liverpool fan says his baby was flung 15ft in his pram and his partner run over during trophy parade",
        "description": "A father has told Sky News how his partner was driven over, and his baby son was flung 15ft in his pram, after they were hit by a vehicle during the Liverpool parade collision.",
        "url": "https://news.sky.com/story/liverpool-fan-says-his-baby-was-flung-15ft-in-his-pram-and-his-partner-run-over-during-trophy-parade-13376118",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-attack-liverpool_6929832.jpg?20250528223531",
        "type": "Home",
        "Author": "Lisa Dowd",
        "Date Published": "2025-05-28 17:16:00",
        "Headline": "Daniel Eveson says he was clinging on \"for dear life\" when both he and partner Sheree were hit by a car during the victory parade. A 53-year-old man has been arrested.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  A father has told Sky News how his partner was driven over, and his baby son was flung 15ft in his pram, after they were hit by a vehicle during the Liverpool parade collision. Daniel Eveson, 36, had been with Sheree Aldridge and their five-month-old baby, Teddy, at Liverpool FC's victory parade on Monday. \"The best day of my life turned into worst\", said Daniel, a lifelong fan of 'The Reds'. Daniel described the moment the car came towards him and his family. \"I tried to hold on to the front of the car and try and stop it, push it, do whatever I could [to stop it] from hitting my partner and my baby. \"Me and my partner were flat on the roof, on the bonnet… we were just both trying to hold on for dear life with Ted next to us. \"And my partner went under the wheels of the car, of the front of the car, and it rolled over her leg, and I just bounced off to the side, but my boy and his pram got bounced totally in the opposite direction - about 15ft down the road. Read more on Sky News:Andrew Tate and his brother charged with rapeTrump issues Putin warning \"As soon as that happened, I just started screaming for my partner, and I found her and I asked where Teddy was, and she didn't know… and I found him and he was okay, thank God. \"He was in the road, in his pram, on his back, and I grabbed him. I chucked the pushchair to the side and I ran up to some paramedics with him.\"  Daniel, from Telford, said he felt like he was in \"hell\" as he rushed back to find Sheree. \"I had to carry her up the road with four police officers holding her while she was screaming and crying. At that point, I didn't know what was wrong with her, but I could see the injuries to her leg,\" he explained. Sheree, 36, is recovering at Aintree University Hospital after suffering muscle tissue damage. Daniel has been allowed to return home with Teddy after he was assessed at Alder Hey Children's Hospital. \"I feel a lot of emotions right now. Upset, angry, traumatised. A lot of unanswered questions that need to be answered. \"To me, it just wasn't handled properly - the situation with the car getting that far into the crowd, in my opinion, he should not have got anywhere near us.\" Merseyside Police have now been given more time to question a 53-year-old arrested after a car struck a crowd at Liverpool FC's victory parade on Monday. The suspect, who police have described as a white British man from the local area, is being held on suspicion of attempted murder, dangerous driving, and drug driving. Police have said the extra time they have been given to question the suspect runs into Thursday."
    },
    {
        "title": "Dua Lipa, Gary Lineker, and Benedict Cumberbatch join more than 300 figures urging PM to 'end UK complicity' in Gaza",
        "description": "Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza.",
        "url": "https://news.sky.com/story/dua-lipa-gary-lineker-and-benedict-cumberbatch-join-more-than-300-figures-urging-pm-to-end-uk-complicity-in-gaza-13376183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dua-lipa-gary-lineker_6929982.jpg?20250528235229",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-28 20:11:00",
        "Headline": "Famous names from the arts and media world have joined doctors, academics and a Holocaust survivor to urge Sir Keir Starmer to end arms sales.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza. In an open letter addressed to Sir Keir Starmer, seen exclusively by Sky News, famous names from the world of media and the arts have joined leading doctors, academics, campaign groups, and a Holocaust survivor. They have accused the British government of continuing to allow UK arms to be sold to Israel and to providing licences for arms. The letter, led by refugee charity Choose Love, demands an immediate suspension of all UK arms sales to Israel, immediate humanitarian access for experienced aid agencies, and urges the government to commit to brokering a ceasefire for \"the children of Gaza\". In September 2024, the UK suspended 30 arms licences from about 350 involved in items that go to Israel. Last week, Sir Keir joined the French and Canadian leaders to warn Israel they will take \"concrete actions\" if it continues an \"egregious\" expansion of military operations in Gaza. The PM also told MPs last week the level of suffering in Gaza, especially among innocent children, was \"intolerable\" and called Israel's decision to allow a small amount of aid in \"utterly inadequate\". The letter says: \"We urge you to take immediate action to end the UK's complicity in the horrors in Gaza.\" It says children in Gaza are starving while food and medicine \"sit just minutes away\" in reference to Israel's 11-week blockade of food and other supplies into Gaza, which was lifted last week. A new foundation backed by Israel and the US has set up an aid distribution site this week, but the UN has rejected the system as it says it cannot meet the needs of Gaza's 2.1 million people. The UN, which has warned the population is facing catastrophic levels of hunger, said it believes 47 people were injured on Tuesday when crowds overwhelmed the aid distribution centre, but Israel said its troops only fired \"warning shots\" into the air. Among the famous people to put their names to the letter are singers Dua Lipa, Annie Lennox, Paloma Faith, Massive Attack and Primal Scream. Actors include Benedict Cumberbatch, Riz Ahmed, Game of Thrones actress Lena Headey, Tilda Swinton, Maxine Peake, Marvel actress Zawe Ashton, Bridgerton actress Nicola Coughlan, and director Danny Boyle. TV stars include Dermot O'Leary, Gary Lineker, Chicken Shop Date creator Amelia Dimoldenberg, and presenter Laura Whitmore. Lineker finished his 26-year stint as Match of the Day presenter this week, after apologising for sharing a social media post from the Palestine Lobby group titled: \"Zionism explained in two minutes.\" The Instagram post was illustrated with a rat, which has been used to represent Jewish people in antisemitic propaganda - including Nazi Germany. Lineker \"apologised unreservedly\" for sharing it, saying he was unaware of the reference and it was a mistake. He maintained the importance of \"speaking out on humanitarian issues, including the tragedy unfolding in Gaza\".  Photographer and activist Misan Harriman, writer, model and activist Munroe Bergdorf, artist Tracey Emin and model Lily Cole have also signed the letter. Holocaust survivor Stephen Kapos has signed the letter, which says 71,000 children under four years old are \"acutely malnourished\" and they \"cry until they can't cry anymore - until hunger takes even their voices\". It says they wake up to bombs falling on them, \"violence stamped with UK inaction - flown with parts shipped from British factories to Israel\".  The letter warns Sir Keir: \"You can't call it 'intolerable', yet do nothing. \"The world is watching and history will not forget. The children of Gaza cannot wait another minute. \"Prime minister, what will you choose? Complicity in war crimes, or the courage to act?\" The letter comes just days after 828 UK-based or qualified legal experts, among them former Supreme Court justices, signed a letter to Sir Keir warning \"genocide is being perpetrated in Gaza\". Israel has repeatedly denied that it is committing genocide in Gaza. A government spokesperson said: \"We strongly oppose the expansion of military operations in Gaza and call on the Israeli Government to cease its offensive and immediately allow for unfettered access to humanitarian aid. \"The denial of essential humanitarian assistance to the civilian population in Gaza is unacceptable and risks breaching International Humanitarian Law. \"Last year, we suspended export licences to Israel for items used in military operations in Gaza and continue to refuse licences for military goods that could be used by Israel in the current conflict. \"We urge all parties to urgently agree a ceasefire agreement and work towards a permanent and sustainable peace.\""
    },
    {
        "title": "Andrew Tate and his brother Tristan charged with rape in the UK",
        "description": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK.",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-charged-with-rape-in-the-uk-13376089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 16:05:00",
        "Headline": "Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\",  said to have occurred between 2012 and 2015.",
        "Content": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK. Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman – including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. They are due to be extradited to the UK following the conclusion of proceedings in Romania. A Crown Prosecution Service (CPS) spokesperson said: \"We can confirm that we have authorised charges against Andrew and Tristan Tate for offences including rape, human trafficking, controlling prostitution and actual bodily harm against three women. \"These charging decisions followed receipt of a file of evidence from Bedfordshire Police. \"A European Arrest Warrant was issued in England in 2024, and as a result the Romanian courts ordered the extradition to the UK of Andrew and Tristan Tate.\" The spokesperson added: \"However, the domestic criminal matters in Romania must be settled first. \"The Crown Prosecution Service reminds everyone that criminal proceedings are active, and the defendants have the right to a fair trial. \"It is extremely important that there be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record Representatives for Andrew Tate have been contacted by Sky News for comment. Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK – they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" The allegations were subject to a police investigation, which was closed in 2019."
    },
    {
        "title": "Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks",
        "description": "Donald Trump has doubled down on his criticism of Vladimir Putin &#8211; adding he will know soon if the Russian leader is just \"tapping\" him along.",
        "url": "https://news.sky.com/story/trump-doubles-down-on-putin-criticism-as-russia-offers-ukraine-a-date-and-location-for-peace-talks-13376149",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-firefighter-ukrainian_6929352.jpg?20250528082629",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 18:42:00",
        "Headline": "The US president told reporters he would know soon whether his Russian counterpart was \"tapping us along\". It came as the Kremlin offered to hold fresh negotiations with Kyiv officials in Istanbul.",
        "Content": "Donald Trump has doubled down on his criticism of Vladimir Putin – adding he will know soon if the Russian leader is just \"tapping\" him along. The US president told reporters at the White House that he believed his counterpart in Moscow may be intentionally delaying ceasefire talks, while he also expressed disappointment at heavy Russian bombing over the weekend. While Mr Trump has so far stopped short of imposing sanctions – to avoid, he says, \"screwing up\" negotiations – he warned his stance could change. Ukraine Q&A: Are we any closer to war ending? The president said: \"We're going to find out whether or not he's tapping us along or not, and if he is, we'll respond a little differently,\" adding that he \"can't tell you\" if Mr Putin wanted peace. His comments in the Oval Office came minutes after Russia's foreign minister announced that the Kremlin had offered Ukraine a second round of talks on 2 June in Istanbul. Kyiv did not immediately respond to the proposal, which Sergei Lavrov said would see Moscow hand their proposals for a potential peace deal directly to Ukraine. \"We hope that all those who are sincerely, and not just in words, interested in the success of the peace process will support holding a new round of direct Russian-Ukrainian talks in Istanbul,\" Mr Lavrov added. Later on Wednesday, Ukraine's defence minister Rustem Umerov said his government was \"not against\" further meetings, but called for Russia to deliver its memorandum to Kyiv beforehand. Moscow correspondent By being the first to propose a date and location for the second round of direct talks, Russia is trying to portray itself as the principal driver towards peace. Its recent barrage of attacks on Ukraine have drawn harsh words from Donald Trump. This is an attempt to soothe his concerns and to show Washington that Moscow is still interested in a deal. But it feels much more performative than anything else, because Foreign Minister Sergei Lavrov's statement makes it clear that Russia's position hasn't softened one bit. Referring to a memorandum outlining the contours of a settlement, he said it details \"all aspects of reliably overcoming the root causes of the crisis\". In Moscow's opinion, the \"root causes\" of the conflict were NATO expansion and the persecution of Russian speakers in eastern Ukraine. So, if that's the basis of its memorandum, then the document will essentially be a list of Moscow's maximalist demands, including permanent neutrality for Ukraine. Lavrov also confirmed that Russia's delegation will again be led by Kremlin aide Vladimir Medinsky, who Kyiv last time dismissed as being too junior for the talks to achieve anything meaningful. Expectations of a breakthrough at round two will be similarly low. Meanwhile, Mr Lavrov also hit out at Germany for agreeing to finance the production of long-range missiles in Ukraine, accusing Berlin of showing it is \"already a participant in the war\". However, German leader Friedrich Merz declined to say that his country would hand over the Taurus missiles that Ukraine's president Volodymyr Zelenskyy – who was in Berlin on Wednesday – has long wanted. Ukraine's need for ammunition has become all the more urgent after Russia launched some of the largest aerial assaults of the war so far over the weekend. Read more:Would 'smart' missiles allow Ukraine to hit key bridge?Lavrov accuses West of secrecy over strikes Russia said it had downed 296 Ukrainian drones over 13 regions overnight, while Ukraine said it had struck several weapon production sites. Kyiv, in turn, said Moscow had launched 88 drones and five ballistic missiles since Tuesday."
    },
    {
        "title": "Hamas's Gaza chief 'eliminated', says Netanyahu - but military sources say they cannot confirm death ",
        "description": "Hamas's Gaza chief Mohammed Sinwar has been \"eliminated\", according to Israel's Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/hamass-gaza-chief-mohammad-sinwar-has-been-eliminated-says-netanyahu-13375691",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-mohammed-sinwar-hamas_6396557.jpg?20231218063131",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 13:00:00",
        "Headline": "Mohammed Sinwar is the younger brother of the militant group's former leader Yahya Sinwar, the mastermind of the October 7 2023 attack on Israel, who was killed last year.",
        "Content": "Hamas's Gaza chief Mohammed Sinwar has been \"eliminated\", according to Israel's Prime Minister Benjamin Netanyahu. But Israeli military sources have said they are not yet able to confirm the death. Hamas has also not yet confirmed the apparent killing of its leader. Meanwhile, with Gaza on the brink of famine, the Palestinian ambassador to the United Nations broke down in tears as he spoke of the suffering of its people.  Riyah Mansour told the Security Council: \"Children are dying of starvation. The images of mothers embracing their motionless bodies. Caressing their hair, talking to them, apologising to them, is unbearable.\" He added: \"I have grandchildren. I know what they mean to their families. And to see this situation over the Palestinians without us having hearts to do something is beyond the ability of any normal human being to tolerate. Flames and hunger are devouring Palestinian children. This is why we are so outraged as Palestinians everywhere.\" Sinwar was one of Israel's most wanted and the younger brother of the Palestinian militant group's former leader Yahya Sinwar. The older sibling was the mastermind of the October 7 2023 attack, which killed 1,200 people in Israel, with around 250 others taken hostage into Gaza. The attack triggered Israel's assault on Gaza which decimated the territory, with more than 53,000 people killed, mostly women and children, and over two million displaced, according to health officials, who do not distinguish between civilians and combatants in their tally of fatalities.  Yahya Sinwar was killed in a gun battle with Israeli troops in Gaza last October. His younger sibling was believed to have then become the head of Hamas's armed wing. Speaking to the Knesset on Wednesday, Mr Netanyahu included Mohammed Sinwar in a list of Hamas leaders killed in Israeli strikes. Later, Israel Defence Forces (IDF) sources said they were not yet able to confirm the death. The prime minister said: \"We have killed tens of thousands of terrorists. We killed (Mohammed) Deif, (Ismail) Haniyeh, Yahya Sinwar and Mohammed Sinwar.\" He did not elaborate. Mohammed Sinwar had reportedly been the target of an Israeli strike on a hospital in southern Gaza on 13 May and Mr Netanyahu said on 21 May that it was likely he had been killed. The Israeli military had said it struck a Hamas command centre under the European Hospital in the Sinwars' hometown of Khan Younis, and it declined to comment on whether Sinwar was targeted or killed. At least six people were killed in the strike and 40 wounded, Gaza's health ministry said at the time. Sinwar rose through ranks Like his older brother, Mohammed Sinwar joined Hamas after it was founded in the late 1980s as the Palestinian branch of the Muslim Brotherhood. He became a member of the group's military wing, known as the Qassam Brigades. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Sinwar rose through the ranks to become a member of its so-called joint chiefs of staff, bringing him close to its longtime commander, Deif, who was killed in a strike last year. Read more from Sky News:Humanitarian chief talks of Gaza 'catastrophe'UN boss condemns 'teaspoon' of aid allowed into Gaza \"In the last two days, we have been in a dramatic turn towards a complete defeat of Hamas,\" the Israeli leader told the Knesset. Mr Netanyahu also spoke about how Israel was \"taking control of food distribution\", a reference to a new aid distribution system that has been criticised and boycotted by humanitarian groups and the UN. One killed at site of aid hub The development comes after one person was killed and 48 others injured when forces opened fire on a crowd that overwhelmed an aid hub in Gaza, according to local health officials. Palestinians have become increasingly desperate for food after almost three months of Israeli border closures. A blockade has recently been eased. Israeli ambassador criticises UN agencies Danny Danon, Israel's ambassador to the United Nations, has criticised UN agencies facilitating aid in Gaza, accusing the international body, without evidence, of holding up aid at border crossings. \"As we speak, there are more than 400 trucks already on the other side of the fence, waiting to be distributed, but the UN has failed to pick them up,\" Mr Danon told reporters. \"We opened the crossings. We provided safe routes for those truck. But the UN did not show up.\" People broke through fences around the distribution site on Wednesday, and a journalist with the Associated Press said they heard Israeli tank and gunfire, and saw a military helicopter firing flares. It was not yet known whether the death and injuries were caused by Israeli forces, private contractors or others. The Israeli and US-backed Gaza Humanitarian Foundation, which set up the hub outside Rafah, said its military contractors had not fired on the crowd but \"fell back\" before resuming aid operations. Israel said its troops nearby had fired warning shots. The UN and other humanitarian organisations have rejected the new system, saying it will not meet the needs of Gaza's 2.3 million people and allows Israel to use food to control the population. Israel has vowed to seize control of Gaza and fight until Hamas is destroyed or disarmed and exiled, and until the militant group returns the last 58 hostages, including around a third thought to be still alive. 'This is a man-made catastrophe' Meanwhile, a US trauma surgeon who has been working in Gaza urged the UN Security Council to not \"claim ignorance\" about the humanitarian devastation. Dr Feroze Sidhwa said: \"Let's not forget, this is a man-made catastrophe. It is entirely preventable. Participating in it or not allowing it to happen is a choice. \"This is a deliberate denial of conditions necessary for life: food, shelter, water and medicine.\" The UN World Health Organization has documented around 700 attacks on healthcare facilities in Gaza during the war. Israel accuses Hamas of using hospitals as command centres and to hide fighters."
    },
    {
        "title": "Sean 'Diddy' Combs's ex Cassie gives birth two weeks after testifying against him – as his bid for mistrial is dismissed",
        "description": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him &#8211; as his legal team failed in a bid to declare a mistrial.",
        "url": "https://news.sky.com/story/sean-diddy-combss-ex-cassie-gives-birth-two-weeks-after-testifying-against-him-8211-as-his-bid-for-mistrial-is-dismissed-13376112",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 17:05:00",
        "Headline": "Cassie Ventura, 38, has welcomed her third child with partner Alex Fine, her friend Deonte Nash told a court on Wednesday.",
        "Content": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him – as his legal team failed in a bid to declare a mistrial. Cassie Ventura gave birth to her third child with partner Alex Fine after going into labour on Tuesday, a close source told Sky's US partner network NBC News on Wednesday. The news was later confirmed by her friend and former stylist Deonte Nash, who told Diddy's trial that he last spoke to her \"after she had the baby yesterday [Tuesday]\". Diddy trial day eleven – as it happened Combs, 55, is accused of two counts of sex trafficking by force, fraud, or coercion, two counts of transportation to engage in prostitution, and one of conspiring to racketeer. He denies all the charges. Cassie had given evidence while she was more than eight months pregnant. The 38-year-old told the trial that Diddy subjected her to physical, sexual and mental abuse for much of their 11-year relationship. She alleged he forced her into \"hundreds\" of drug-fuelled sex sessions with male escorts while he watched, which he referred to as \"freak offs\". News of the birth came on the same day Combs's legal team tried in vain to get the judge to declare a mistrial. Alexandra Shapiro, one of Diddy's attorneys, moved for the mistrial just before the court broke for lunch, during evidence by Los Angeles Fire Department (LAFD) arson investigator Lance Jiminez. According to Ms Shapiro, Mr Jiminez's claim that police destroyed fingerprint evidence collected at the scene of an alleged 2012 Molotov cocktail attack on rapper Kid Cudi's car would lead the jury to believe Combs had something to do with it. She accused the prosecution of \"misconduct\" and claimed their questioning of Mr Jiminez was \"designed to play into that\" narrative. Another of Diddy's defence lawyers Marc Agnifilo described the prosecution's conduct as \"outrageous\". However, prosecution attorney Christy Slavik hit back by saying a mistrial was \"completely unwarranted\". She insisted questions about the destruction of evidence were asked to highlight the poor quality of the police investigation. Judge Arun Subramanian dismissed the motion and instead told jurors to disregard any reference to the fingerprints. Earlier on Wednesday, Los Angeles Police Department (LAPD) officer Chris Ignacio detailed the alleged break-in at Kid Cudi's home in December 2011. He was called to the scene and noticed a Cadillac Escalade parked in front of the property, the number plate for which later transpired to be registered to Bad Boy Productions, Diddy's record label. During his evidence, Cudi alleged it was Diddy who was behind the break-in. Mr Jiminez then testified about an alleged Molotov cocktail attack on Cudi's car the following month. Having investigated the incident, he concluded it was \"not a random act\" and that the makeshift firebomb had been placed there deliberately, in line with Cudi's claims. When Diddy and Cassie's former stylist Mr Nash took to the stand, he detailed several incidents of alleged violence inflicted on the singer by her then partner. On one occasion, Diddy turned up at her LA flat, \"grabbed her by the hair\", \"kicked her\" and \"hit her pretty hard\", he claimed. When she hit her head on a bed frame, she suffered a gash to her forehead and eyebrow, he said. Both he and Mia, a second alleged witness, jumped on the rapper's back to get him to stop, he told the court. Following another incident when Diddy demanded to see Cassie, she threatened to \"go over the balcony\", Mr Nash told the jury. Diddy was violent towards him too, he said, once choking him against a car and threatening him not to go out with Cassie and without him. Despite all this, Mr Nash said he \"doesn't hate\" Diddy – and that he had been compelled to give evidence as part of a subpoena. Mia, which is a pseudonym used to protect her identity, was due to start her evidence on Wednesday but Mr Nash's testimony overran. He will resume giving evidence on Thursday, with Mia's evidence due to last until the court breaks for the weekend. The trial continues."
    },
    {
        "title": "Chelsea win UEFA Conference League with 4-1 win over Real Betis",
        "description": "Chelsea have won the UEFA Conference League with a 4-1 victory over Real Betis in the final.",
        "url": "https://news.sky.com/story/chelsea-win-uefa-conference-league-with-4-1-win-over-real-betis-13376091",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chelsea-reece-james_6929950.jpg?20250528223424",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-28 16:01:00",
        "Headline": "Their win came thanks to goals from Enzo Fernandez, Nicolas Jackson, Jadon Sancho, and Moises Caicedo.",
        "Content": "Chelsea have won the UEFA Conference League with a 4-1 victory over Real Betis in the final. Their win over the Spanish side in the Polish city of Wroclaw on Wednesday came thanks to goals from Enzo Fernandez, Nicolas Jackson, Jadon Sancho, and Moises Caicedo. It means a trophy in his first season for Chelsea boss Enzo Maresca, who also guided the west London side to fourth place in the Premier League, with the youngest squad in the competition's history. Their victory over Nottingham Forest in their final league match of the season on Sunday meant they had already qualified for next season's Champions League. The Conference League win is Chelsea's seventh European trophy from the current crop, to go with a pair of Champions Leagues, Europa Leagues, and UEFA Super Cups - and ninth when including the two UEFA Cup Winners' Cups won in the 1970s and 1990s. It also makes Chelsea the first club to win all four of the current crop of European competitions. The win also delivers the first trophy under the ownership of Clearlake Capital - which bought Chelsea from Russian billionaire Roman Abramovich in 2022. Prior to this, during the 2022-23 and 2023-24 seasons, Chelsea failed to secure any major trophies. Read more on Sky News:Trump doubles down on Putin criticismHamas's Gaza chief 'eliminated', says Netanyahu Chelsea had Cole Palmer to thank for their comeback victory over Real Betis, having gone 1-0 down to a goal from Abde Ezzalzouli inside 10 minutes. The midfielder took the game by the scruff of the neck in the second half, setting up Fernandez for Chelsea's equaliser with a perfectly weighted cross from deep. A skilful turn on the edge of the area then allowed space for him to set up Jackson five minutes later, before Sancho and Caicedo secured the victory. Former Chelsea winger Joe Cole described Palmer as an \"absolute genius\" after the game."
    },
    {
        "title": "Liverpool fan says his baby was flung 15ft in his pram and his partner run over during trophy parade",
        "description": "A father has told Sky News how his partner was driven over, and his baby son was flung 15ft in his pram, after they were hit by a vehicle during the Liverpool parade collision.",
        "url": "https://news.sky.com/story/liverpool-fan-says-his-baby-was-flung-15ft-in-his-pram-and-his-partner-run-over-during-trophy-parade-13376118",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-attack-liverpool_6929832.jpg?20250528223531",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-05-28 17:16:00",
        "Headline": "Daniel Eveson says he was clinging on \"for dear life\" when both he and partner Sheree were hit by a car during the victory parade. A 53-year-old man has been arrested.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  A father has told Sky News how his partner was driven over, and his baby son was flung 15ft in his pram, after they were hit by a vehicle during the Liverpool parade collision. Daniel Eveson, 36, had been with Sheree Aldridge and their five-month-old baby, Teddy, at Liverpool FC's victory parade on Monday. \"The best day of my life turned into worst\", said Daniel, a lifelong fan of 'The Reds'. Daniel described the moment the car came towards him and his family. \"I tried to hold on to the front of the car and try and stop it, push it, do whatever I could [to stop it] from hitting my partner and my baby. \"Me and my partner were flat on the roof, on the bonnet… we were just both trying to hold on for dear life with Ted next to us. \"And my partner went under the wheels of the car, of the front of the car, and it rolled over her leg, and I just bounced off to the side, but my boy and his pram got bounced totally in the opposite direction - about 15ft down the road. Read more on Sky News:Andrew Tate and his brother charged with rapeTrump issues Putin warning \"As soon as that happened, I just started screaming for my partner, and I found her and I asked where Teddy was, and she didn't know… and I found him and he was okay, thank God. \"He was in the road, in his pram, on his back, and I grabbed him. I chucked the pushchair to the side and I ran up to some paramedics with him.\"  Daniel, from Telford, said he felt like he was in \"hell\" as he rushed back to find Sheree. \"I had to carry her up the road with four police officers holding her while she was screaming and crying. At that point, I didn't know what was wrong with her, but I could see the injuries to her leg,\" he explained. Sheree, 36, is recovering at Aintree University Hospital after suffering muscle tissue damage. Daniel has been allowed to return home with Teddy after he was assessed at Alder Hey Children's Hospital. \"I feel a lot of emotions right now. Upset, angry, traumatised. A lot of unanswered questions that need to be answered. \"To me, it just wasn't handled properly - the situation with the car getting that far into the crowd, in my opinion, he should not have got anywhere near us.\" Merseyside Police have now been given more time to question a 53-year-old arrested after a car struck a crowd at Liverpool FC's victory parade on Monday. The suspect, who police have described as a white British man from the local area, is being held on suspicion of attempted murder, dangerous driving, and drug driving. Police have said the extra time they have been given to question the suspect runs into Thursday."
    },
    {
        "title": "Andrew Tate and his brother Tristan charged with rape in the UK",
        "description": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK.",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-charged-with-rape-in-the-uk-13376089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 16:05:00",
        "Headline": "Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\",  said to have occurred between 2012 and 2015.",
        "Content": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK. Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman – including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. They are due to be extradited to the UK following the conclusion of proceedings in Romania. A Crown Prosecution Service (CPS) spokesperson said: \"We can confirm that we have authorised charges against Andrew and Tristan Tate for offences including rape, human trafficking, controlling prostitution and actual bodily harm against three women. \"These charging decisions followed receipt of a file of evidence from Bedfordshire Police. \"A European Arrest Warrant was issued in England in 2024, and as a result the Romanian courts ordered the extradition to the UK of Andrew and Tristan Tate.\" The spokesperson added: \"However, the domestic criminal matters in Romania must be settled first. \"The Crown Prosecution Service reminds everyone that criminal proceedings are active, and the defendants have the right to a fair trial. \"It is extremely important that there be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record Representatives for Andrew Tate have been contacted by Sky News for comment. Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK – they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" The allegations were subject to a police investigation, which was closed in 2019."
    },
    {
        "title": "Dua Lipa, Gary Lineker, and Benedict Cumberbatch join more than 300 figures urging PM to 'end UK complicity' in Gaza",
        "description": "Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza.",
        "url": "https://news.sky.com/story/dua-lipa-gary-lineker-and-benedict-cumberbatch-join-more-than-300-figures-urging-pm-to-end-uk-complicity-in-gaza-13376183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dua-lipa-gary-lineker_6929982.jpg?20250528235229",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-28 20:11:00",
        "Headline": "Famous names from the arts and media world have joined doctors, academics and a Holocaust survivor to urge Sir Keir Starmer to end arms sales.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza. In an open letter addressed to Sir Keir Starmer, seen exclusively by Sky News, famous names from the world of media and the arts have joined leading doctors, academics, campaign groups, and a Holocaust survivor. They have accused the British government of continuing to allow UK arms to be sold to Israel and to providing licences for arms. The letter, led by refugee charity Choose Love, demands an immediate suspension of all UK arms sales to Israel, immediate humanitarian access for experienced aid agencies, and urges the government to commit to brokering a ceasefire for \"the children of Gaza\". In September 2024, the UK suspended 30 arms licences from about 350 involved in items that go to Israel. Last week, Sir Keir joined the French and Canadian leaders to warn Israel they will take \"concrete actions\" if it continues an \"egregious\" expansion of military operations in Gaza. The PM also told MPs last week the level of suffering in Gaza, especially among innocent children, was \"intolerable\" and called Israel's decision to allow a small amount of aid in \"utterly inadequate\". The letter says: \"We urge you to take immediate action to end the UK's complicity in the horrors in Gaza.\" It says children in Gaza are starving while food and medicine \"sit just minutes away\" in reference to Israel's 11-week blockade of food and other supplies into Gaza, which was lifted last week. A new foundation backed by Israel and the US has set up an aid distribution site this week, but the UN has rejected the system as it says it cannot meet the needs of Gaza's 2.1 million people. The UN, which has warned the population is facing catastrophic levels of hunger, said it believes 47 people were injured on Tuesday when crowds overwhelmed the aid distribution centre, but Israel said its troops only fired \"warning shots\" into the air. Among the famous people to put their names to the letter are singers Dua Lipa, Annie Lennox, Paloma Faith, Massive Attack and Primal Scream. Actors include Benedict Cumberbatch, Riz Ahmed, Game of Thrones actress Lena Headey, Tilda Swinton, Maxine Peake, Marvel actress Zawe Ashton, Bridgerton actress Nicola Coughlan, and director Danny Boyle. TV stars include Dermot O'Leary, Gary Lineker, Chicken Shop Date creator Amelia Dimoldenberg, and presenter Laura Whitmore. Lineker finished his 26-year stint as Match of the Day presenter this week, after apologising for sharing a social media post from the Palestine Lobby group titled: \"Zionism explained in two minutes.\" The Instagram post was illustrated with a rat, which has been used to represent Jewish people in antisemitic propaganda - including Nazi Germany. Lineker \"apologised unreservedly\" for sharing it, saying he was unaware of the reference and it was a mistake. He maintained the importance of \"speaking out on humanitarian issues, including the tragedy unfolding in Gaza\".  Photographer and activist Misan Harriman, writer, model and activist Munroe Bergdorf, artist Tracey Emin and model Lily Cole have also signed the letter. Holocaust survivor Stephen Kapos has signed the letter, which says 71,000 children under four years old are \"acutely malnourished\" and they \"cry until they can't cry anymore - until hunger takes even their voices\". It says they wake up to bombs falling on them, \"violence stamped with UK inaction - flown with parts shipped from British factories to Israel\".  The letter warns Sir Keir: \"You can't call it 'intolerable', yet do nothing. \"The world is watching and history will not forget. The children of Gaza cannot wait another minute. \"Prime minister, what will you choose? Complicity in war crimes, or the courage to act?\" The letter comes just days after 828 UK-based or qualified legal experts, among them former Supreme Court justices, signed a letter to Sir Keir warning \"genocide is being perpetrated in Gaza\". Israel has repeatedly denied that it is committing genocide in Gaza. A government spokesperson said: \"We strongly oppose the expansion of military operations in Gaza and call on the Israeli Government to cease its offensive and immediately allow for unfettered access to humanitarian aid. \"The denial of essential humanitarian assistance to the civilian population in Gaza is unacceptable and risks breaching International Humanitarian Law. \"Last year, we suspended export licences to Israel for items used in military operations in Gaza and continue to refuse licences for military goods that could be used by Israel in the current conflict. \"We urge all parties to urgently agree a ceasefire agreement and work towards a permanent and sustainable peace.\""
    },
    {
        "title": "Police given more time to question Liverpool parade collision suspect",
        "description": "Merseyside Police has been given more time to question a 53-year-old man arrested over the Liverpool parade collision.",
        "url": "https://news.sky.com/story/police-given-more-time-to-question-liverpool-parade-collision-suspect-13375266",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-car-reverses-liverpool_6929250.jpg?20250527230647",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 01:00:00",
        "Headline": "The development comes after new footage emerged showing a car being driven into a crowd as panicked fans watched in horror and tried to avoid being hit.",
        "Content": " Merseyside Police has been given more time to question a 53-year-old man arrested over the Liverpool parade collision. The suspect is being held on suspicion of attempted murder, dangerous driving and drug driving after a car was driven into a crowd at Liverpool FC's victory parade on Monday. Police have said the extra time they have been given to question the suspect runs into Thursday. The force believes the vehicle which struck pedestrians on Water Street had followed an ambulance crew that was attending to someone suffering a heart attack, after a road block was temporarily lifted. Earlier, new footage emerged showing a car being driven into the crowd as panicked fans watched in horror and tried to avoid being hit. The CCTV footage showed supporters attempting to move out of the way as the vehicle ploughed into supporters. Cries could be heard from the crowd - before police and members of the public chased after the car. In an update on Wednesday, Merseyside Police said it was in contact with 79 people who were injured in the crash - an increase on the 65 people who were confirmed injured in the force's previous update. Seven people remain in hospital in a stable condition following the collision, the force added.  Detective Superintendent Rachel Wilson said: \"I'm pleased to say that the number of people in hospital is reducing as they continue to recover from the awful incident. \"We continue to support those still receiving treatment and as part of our ongoing enquiries we are identifying more people who were injured. \"I want to reassure the public of Merseyside that detectives are making significant progress as we seek to establish the full circumstances that led to what happened.\" DS Wilson said that \"extensive CCTV enquiries\" were being carried out across Liverpool to \"establish the movements of the car, a Ford Galaxy, before the incident took place\". She added: \"We have already had an incredible response from many of those who were there on the day, and I thank them for their co-operation with our investigation. \"I would encourage anyone who has not yet contacted police who may have information on this incident to do so. \"An extensive investigation into the precise circumstances of the incident is ongoing, and we continue to ask people not to speculate on the circumstances surrounding the incident and refrain from sharing distressing content online.\" Read more:Liverpool parade reconstructedWhy police released 'unprecedented' details about suspectParade victim says he's been left 'traumatised' It comes after Water Street was reopened to vehicles and pedestrians on Wednesday after the police cordon was lifted. Street cleaning teams worked overnight to clear the road, which had been littered with bottles, cans and football scarves and flags. One remaining Liverpool flag was removed from the top of a set of traffic lights by a worker wearing hi-vis. 👉 Listen to Sky News Daily on your podcast app 👈 On Tuesday night, Liverpool manager Arne Slot decided not to attend the League Managers Association's annual awards ceremony \"in solidarity with those affected by the incident on Monday\". Meanwhile, speaking at an awards ceremony on Tuesday, former Liverpool boss Jurgen Klopp said the collision on Water Street \"showed the two faces of life\".  He said: \"The most beautiful face for a long, long time: the parade was incredible, the mood was incredible and from one second to another everything changed and we learned again there are more serious things in the world than football. \"Thoughts and prayers go to the injured people and their families as well. \"It should have been one of the greatest days in the history of the city, after a long, long time, because we didn't have the opportunity to do it last time. I don't know how and why it happened but we know what happened and that's very bad.\""
    },
    {
        "title": "Althorp: Arson suspected after fire destroys farmhouse at Princess Diana's family home",
        "description": "A farmhouse at the former family home of Princess Diana has been burnt down in a suspected arson attack, her brother has said.",
        "url": "https://news.sky.com/story/althorp-arson-suspected-after-fire-destroys-farmhouse-at-princess-dianas-family-home-13376047",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-northants-fire-and-rescue_6929744.jpg?20250528162748",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 14:20:00",
        "Headline": "Earl Spencer, the late princess's brother, posted pictures on social media of the building on fire and the aftermath, saying he was \"stunned\" to find out it had been \"apparently burnt down by vandals\".",
        "Content": "A farmhouse at the former family home of Princess Diana has been burnt down in a suspected arson attack, her brother has said. Earl Spencer posted pictures on social media of the building on fire and its gutted remains the next morning, saying he was \"stunned\" to find out it had been \"apparently burnt down by vandals\". The building was unoccupied at the time, he said. He thanked firefighters for \"doing their very best\", and lamented it was \"so very sad that anyone would think this a fun thing to do\". Firefighters were called to the scene in Mill Lane, Kingsthorpe, at about 1.30am on Wednesday and found a derelict two-storey property fully on fire, Northamptonshire Fire and Rescue Service said. \"Crews arrived to find a derelict two-storey property fully on fire. \"At the height of the fire, four crews from across the service wearing breathing apparatus used hose-reel jets to contain the blaze and prevent it from spreading further,\" the service added. \"One crew remained on the scene into this afternoon with a water bowser to continue dampening down any remaining hotspots, and then returned to their station shortly before 1pm.\""
    },
    {
        "title": "Police officers who pepper-sprayed and tasered 92-year-old amputee in care home cleared of assault",
        "description": "Two police officers who pepper-sprayed and tasered a 92-year-old disabled man at a care home have been cleared of assault.",
        "url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 14:08:00",
        "Headline": "A jury found 51-year-old PC Stephen Smith not guilty of two counts of assault for using Pava spray - similar to pepper spray - and a baton. PC Rachel Comotto, 36, was found not guilty of one count of assault for deploying her Taser.",
        "Content": "Two police officers who pepper-sprayed and tasered a 92-year-old disabled man at a care home have been cleared of assault. Sussex police officers PC Stephen Smith and PC Rachel Comotto went on trial in London over the incident involving Donald Burgess, a single-leg amputee and wheelchair user. The officers were accused of using excessive force on Mr Burgess during a confrontation at Park Beck care home in St Leonards-on-Sea, East Sussex, on 21 June 2022. The pair had denied the charges. A jury at Southwark Crown Court found 51-year-old Smith not guilty of two counts of assault for using Pava spray and a baton. Comotto, 36, was found not guilty of one count of assault for deploying her Taser. The care home had called emergency services after Mr Burgess reportedly threatened to stab staff with a knife he was given to cut his food. Within less than a minute and a half of going into Mr Burgess's room, Smith sprayed synthetic Pava pepper spray into the pensioner's face and used his baton to try and knock the knife out of his hand, while Comotto deployed her Taser. The court heard both Smith and Comotto repeatedly asked Mr Burgess to drop the knife, with Smith warning him: \"Put the knife down mate, or you will be sprayed or tasered. That's up to you.\" Smith then discharged the spray directly into Mr Burgess's face, bodycam footage played to the jury showed. Mr Burgess raised the knife a couple of times as Smith used his baton to try and get the knife out of his hand. When that failed, Comotto deployed her Taser. What did the defendants say in court? Smith previously told jurors he did not see that the pensioner was disabled and using a wheelchair until after the incident, as he was focused on the knife. In his evidence, Smith also denied hitting Mr Burgess with a baton, claiming he flicked it towards the pensioner's wrist to \"knock the knife out\" of his hand. Meanwhile, Comotto said she believed using the Taser was the safest way to \"protect\" Mr Burgess as she feared her colleague using the baton again would cause more harm. Read more from Sky News:Police get more time to quiz Liverpool parade collision suspectActor died after taking cocktail of drugs, coroner rules Care home manager Steve Cooper previously told the court that workers had been under threat from Mr Burgess for more than 30 minutes before they decided to phone 999. 'He wasn't the Donald I knew' Mr Cooper said: \"He was very aggressive and threatening to hurt my members of staff. He had a look in his eyes I've never seen before - he wasn't the Donald I knew.\" Mr Burgess jabbed the knife towards the manager and told him: \"I'm going to murder you, and I'll enjoy it,\" according to Mr Cooper. Mr Burgess's knife movements were described as \"extremely quick\" by deputy care home manager Donna Gardner, the court earlier heard. The pensioner had a urinary tract infection Judge Christopher Hehir told the jury: \"The reason for his behaviour that day, we now know, is that he was delirious as a result of a urinary tract infection.\" Following the incident, Mr Burgess was taken to hospital and he later got COVID-19. He died about three weeks after that. The jurors took around two hours to reach their verdicts on the two officers. Both officers will face proceedings for gross misconduct, Assistant Chief Constable Paul Court, from Sussex Police, said in a statement. He said: \"Police officers can find themselves in challenging and unpredictable situations where they must make split-second decisions to keep the public safe, and to do so with measure, compassion and skill. \"We support them to do this and this is what our communities expect. \"Use of force must be reasonable, necessary and proportionate and officers know they will be held accountable every time. \"The officers in this case have been held accountable to a criminal threshold and we respect the jury's decision. \"While this concludes the criminal investigation, both officers will now face gross misconduct proceedings.\" The Independent Office for Police Conduct (IOPC) said that both officers should face a gross misconduct hearing for potential breaches of the police standards of professional behaviour relating to use of force, and authority, respect and courtesy. PC Comotto faces a further misconduct allegation relating to comments she made on social media after the incident."
    },
    {
        "title": "Cole Cooper: Search for teenager missing for three weeks - as mum says 'I just want answers'",
        "description": "The heartbroken mother of a Scottish teenager who vanished three weeks ago has told Sky News she fears he could have been \"picked up in a car\".",
        "url": "https://news.sky.com/story/cole-cooper-search-for-teenager-missing-for-three-weeks-as-mum-says-i-just-want-answers-13375806",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-scotland-missing_6929391.jpg?20250528090545",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-05-28 07:57:00",
        "Headline": "Cole Cooper, 19, was last seen on 7 May in Longcroft near Falkirk and police are carrying out extensive searches and door-to-door enquiries.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  The heartbroken mother of a Scottish teenager who vanished three weeks ago has told Sky News she fears he could have been \"picked up in a car\". Cole Cooper, 19, was last seen by an old school friend on Wednesday 7 May in the village of Longcroft near Falkirk. Prior to that, he was captured on CCTV a few days earlier after leaving a house party in the area. His mum, Wendy Stewart, 42, allowed Sky News into her home as she revealed the pain her family is enduring. Wiping away tears, Ms Stewart said: \"I don't know what's happened. He has not been seen. Is it a possibility he has been picked up by a car? \"I don't want to start speculating but I just want answers. Somebody please come and tell us.\" She added: \"It's total heartache. It's just so surreal. Is this actually happening? I have been wanting to wake up and it's just been a big nightmare.\" Cole's family say the joinery apprentice recently started up his own fencing and decking business, which was thriving. His aunt Aimee Tennie who has arranged community searches and erected missing posters, has said he is a popular young man who enjoys karaoke. The 32-year-old told Sky News: \"He is well liked. He is well respected. He is a lovely boy. If he is out there, we want you to come home. \"We want answers. We miss you. We love you.\" Police Scotland said more than 220 properties have been visited and more than 1,000 hours of CCTV footage collected as part of the force's efforts to find the teenager. Specialist resources from across the country have been mobilised to help, including the police helicopter and drones from the air support unit, as well as officers from the dive and marine unit. Ms Stewart said she would not lose hope of finding her son. She said: \"I am still praying that we get the outcome that we want which is Cole to come back home with us and to make more happy memories.\" Read more from Sky News:New footage shows Liverpool parade collisionHunt for man wanted in connection with murder Cole was reported missing on Friday 9 May. Police said he was earlier captured on CCTV in the Longcroft area at about 6am on Sunday 4 May. The last confirmed sighting was at 8.45pm on the A803 at its intersection with Cumbernauld Road, Longcroft, on Wednesday 7 May. Police Scotland said an incident and welfare support unit will remain in the area while extensive searches and door-to-door enquiries continue. An online portal has also been set up to allow members of the public to submit information directly to the investigating officers. Cole - who has links to the Denny, Cumbernauld and Paisley areas - has been described as around 5ft 10in, of medium build, with short brown hair. He was last seen wearing a black puffer-style jacket with black jogging bottoms. Chief Inspector Alex Hatrick said there was \"a lot of work going on behind the scenes\" to find the teenager. He added: \"While this may not be as visible, please be assured we are working tirelessly to find Cole.\" Speaking to Sky News, the police chief said there had been no evidence of criminality. \"This is very much a missing person enquiry,\" he added. \"There's no information to suggest that Cole's come to any harm at this time. Our focus is very much on tracing Cole safe and well.\""
    },
    {
        "title": "Chelsea win UEFA Conference League with 4-1 win over Real Betis",
        "description": "Chelsea have won the UEFA Conference League with a 4-1 victory over Real Betis in the final.",
        "url": "https://news.sky.com/story/chelsea-win-uefa-conference-league-with-4-1-win-over-real-betis-13376091",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chelsea-reece-james_6929950.jpg?20250528223424",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 16:01:00",
        "Headline": "Their win came thanks to goals from Enzo Fernandez, Nicolas Jackson, Jadon Sancho, and Moises Caicedo.",
        "Content": "Chelsea have won the UEFA Conference League with a 4-1 victory over Real Betis in the final. Their win over the Spanish side in the Polish city of Wroclaw on Wednesday came thanks to goals from Enzo Fernandez, Nicolas Jackson, Jadon Sancho, and Moises Caicedo. It means a trophy in his first season for Chelsea boss Enzo Maresca, who also guided the west London side to fourth place in the Premier League, with the youngest squad in the competition's history. Their victory over Nottingham Forest in their final league match of the season on Sunday meant they had already qualified for next season's Champions League. The Conference League win is Chelsea's seventh European trophy from the current crop, to go with a pair of Champions Leagues, Europa Leagues, and UEFA Super Cups - and ninth when including the two UEFA Cup Winners' Cups won in the 1970s and 1990s. It also makes Chelsea the first club to win all four of the current crop of European competitions. The win also delivers the first trophy under the ownership of Clearlake Capital - which bought Chelsea from Russian billionaire Roman Abramovich in 2022. Prior to this, during the 2022-23 and 2023-24 seasons, Chelsea failed to secure any major trophies. Read more on Sky News:Trump doubles down on Putin criticismHamas's Gaza chief 'eliminated', says Netanyahu Chelsea had Cole Palmer to thank for their comeback victory over Real Betis, having gone 1-0 down to a goal from Abde Ezzalzouli inside 10 minutes. The midfielder took the game by the scruff of the neck in the second half, setting up Fernandez for Chelsea's equaliser with a perfectly weighted cross from deep. A skilful turn on the edge of the area then allowed space for him to set up Jackson five minutes later, before Sancho and Caicedo secured the victory. Former Chelsea winger Joe Cole described Palmer as an \"absolute genius\" after the game."
    },
    {
        "title": "Paul Danan: Former Hollyoaks actor died by misadventure after taking cocktail of drugs, coroner rules",
        "description": "Former Hollyoaks star Paul Danan died by misadventure after taking a cocktail of drugs, a coroner has ruled.",
        "url": "https://news.sky.com/story/hollyoaks-actor-paul-danan-died-by-misadventure-after-taking-cocktail-of-drugs-coroner-rules-13375978",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-danan-hollyoaks_6929618.jpg?20250528145311",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-28 12:16:00",
        "Headline": "A post-mortem examination concluded the actor's death was due to the combined toxicity of heroin, methadone, codeine, pregabalin, cocaine and zopiclone, contributed to by benzodiazepine use.",
        "Content": "Former Hollyoaks star Paul Danan died by misadventure after taking a cocktail of drugs, a coroner has ruled. The 46-year-old played Sol Patrick on the Channel 4 soap from 1997 to 2001 and was later known for his reality TV appearances on Celebrity Big Brother and Celebrity Love Island. An inquest into Danan's death was told he was found unresponsive and slumped on his sofa in front of the TV at his home in Brislington, Bristol, on 15 January. Emergency services attended and confirmed he had died, with his body being identified at the scene by his partner Melissa Crooks. A post-mortem examination concluded his death was due to the combined toxicity of heroin, methadone, codeine, pregabalin, cocaine and zopiclone, contributed to by benzodiazepine use. Assistant Coroner Debbie Rookes reached the conclusion Danan had died by misadventure after hearing written statements from emergency services doctors and his mother Beverley Danan. In a statement, Mrs Danan said: \"Paul helped so many people from all walks of life but just couldn't help himself in the same way. \"His smiling face and love of life will always be remembered.\" Ms Rookes concluded Danan had died from the combined effects of prescribed and illicit drugs. She told the hearing at Avon Coroner's Court in Flax Bourton, near Bristol, that there was no evidence Danan, who suffered an accidental overdose in May 2024, had intended to take his own life. A previous hearing was told Danan did not leave a note. Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record The coroner said: \"Paul Danan was clearly much loved and is very much missed. \"Mr Danan had a long history of drug misuse and struggles with his mental health. His death was caused by a combination of drugs, both prescription and illicit. \"Paul had struggled with his mental health for many years. He had taken an overdose in May 2024 but he was adamant that this was accidental and he didn't have any intention to end his life. \"Although he had occasional suicidal thoughts, he didn't have any active plans. I don't have any evidence before me that Paul intended to take his own life at this time. \"Therefore, the conclusion is misadventure.\" The coroner said none of the drugs Danan had taken were found in high levels but their combined effect resulted in \"fatal respiratory depression\". Danan had previously spoken about his struggles with addiction and going into rehab. The actor had been due to appear for a plea hearing at Warrington Magistrates' Court on 16 January after being charged with possession of cocaine and cannabis, according to court documents. He was also accused of driving while under the influence of drugs in Warrington, Cheshire, on 2 October last year."
    },
    {
        "title": "US trade court blocks Donald Trump from imposing sweeping global tariffs - claiming he exceeded his authority",
        "description": "A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports.",
        "url": "https://news.sky.com/story/us-trade-court-blocks-donald-trump-from-imposing-sweeping-global-tariffs-claiming-he-exceeded-his-authority-13376237",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tariffs-trump-trade_6883640.jpg?20250412104019",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 23:44:00",
        "Headline": "The White House is vowing to appeal the ruling - and it's currently unclear how the verdict will affect the recently signed UK-US trade deal.",
        "Content": " A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports. A three-judge panel concluded that the US president exceeded his authority when he unveiled additional taxes on foreign-made goods. Tariffs must typically be approved by Congress - but Trump has argued he had power to act because it was a \"national emergency\". The controversial measures unveiled on \"Liberation Day\" in April, which included a 10% tariff on UK imports, had caused aggressive sell-offs in the stock market. Minutes after the Court of International Trade delivered its verdict, the Trump administration filed a notice of appeal - meaning the battle could escalate to the Supreme Court. Several lawsuits have been filed against the president's tariffs - and this ruling relates to a case brought on behalf of five small businesses that import goods from other countries. The companies, which sell everything from wine to musical instruments, had argued they were struggling to survive because of these additional costs. \n                  Elon Musk leaving role in the Trump administration\n                 \n                  Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks\n                 \n                  Trump administration halts international student visa applications\n                  The ruling came shortly before Elon Musk confirmed he was leaving his role in the Trump administration. Trump's deputy chief of staff Stephen Miller criticised the court on social media, writing: \"The judicial coup is out of control.\" And in a fiery statement, the White House added: \"It is not for unelected judges to decide how to properly address a national emergency.\" Spokesperson Kush Desai went on to say that trade deficits - where the US imports more from a country than it exports - have \"decimated American communities and left our workers behind\". But Oregon's attorney general, Dan Rayfield, welcomed the ruling and described Trump's tariffs as unlawful, reckless and economically devastating. And Ron Wyden - the top Democrat on the Senate Finance Committee - said the president's actions had \"jacked up prices on groceries and cars, threatened shortages of essential goods, and wrecked supply chains for American businesses large and small\".  Before the court's intervention, flat tariffs of 10% worldwide were in force - with higher rates for specific countries due to be implemented on 9 July. Economists had expressed fears that the tariffs could exacerbate inflation, and even cause a recession. The US dollar strengthened as investors digested the news - with stock market futures also rallying higher. \"We're just trying to work out what it might mean basically but obviously the market is doing a kneejerk reaction so I guess it's reversing a lot of the moves that we've seen,\" National Australia Bank's head of FX strategy Ray Attrill said. One of the three judges who heard the case was appointed by the Trump administration, while the other two were named by Ronald Reagan and Barack Obama during their terms in the Oval Office.  Earlier this month, the UK and US agreed a trade deal that would lower tariffs on British cars sold in the US from 27.5% to 10% - and eliminate duties on UK steel and aluminium altogether. At this stage, it is unclear how the trade court's ruling will affect this arrangement."
    },
    {
        "title": "Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks",
        "description": "Donald Trump has doubled down on his criticism of Vladimir Putin &#8211; adding he will know soon if the Russian leader is just \"tapping\" him along.",
        "url": "https://news.sky.com/story/trump-doubles-down-on-putin-criticism-as-russia-offers-ukraine-a-date-and-location-for-peace-talks-13376149",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-firefighter-ukrainian_6929352.jpg?20250528082629",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 18:42:00",
        "Headline": "The US president told reporters he would know soon whether his Russian counterpart was \"tapping us along\". It came as the Kremlin offered to hold fresh negotiations with Kyiv officials in Istanbul.",
        "Content": "Donald Trump has doubled down on his criticism of Vladimir Putin – adding he will know soon if the Russian leader is just \"tapping\" him along. The US president told reporters at the White House that he believed his counterpart in Moscow may be intentionally delaying ceasefire talks, while he also expressed disappointment at heavy Russian bombing over the weekend. While Mr Trump has so far stopped short of imposing sanctions – to avoid, he says, \"screwing up\" negotiations – he warned his stance could change. Ukraine Q&A: Are we any closer to war ending? The president said: \"We're going to find out whether or not he's tapping us along or not, and if he is, we'll respond a little differently,\" adding that he \"can't tell you\" if Mr Putin wanted peace. His comments in the Oval Office came minutes after Russia's foreign minister announced that the Kremlin had offered Ukraine a second round of talks on 2 June in Istanbul. Kyiv did not immediately respond to the proposal, which Sergei Lavrov said would see Moscow hand their proposals for a potential peace deal directly to Ukraine. \"We hope that all those who are sincerely, and not just in words, interested in the success of the peace process will support holding a new round of direct Russian-Ukrainian talks in Istanbul,\" Mr Lavrov added. Later on Wednesday, Ukraine's defence minister Rustem Umerov said his government was \"not against\" further meetings, but called for Russia to deliver its memorandum to Kyiv beforehand. Moscow correspondent By being the first to propose a date and location for the second round of direct talks, Russia is trying to portray itself as the principal driver towards peace. Its recent barrage of attacks on Ukraine have drawn harsh words from Donald Trump. This is an attempt to soothe his concerns and to show Washington that Moscow is still interested in a deal. But it feels much more performative than anything else, because Foreign Minister Sergei Lavrov's statement makes it clear that Russia's position hasn't softened one bit. Referring to a memorandum outlining the contours of a settlement, he said it details \"all aspects of reliably overcoming the root causes of the crisis\". In Moscow's opinion, the \"root causes\" of the conflict were NATO expansion and the persecution of Russian speakers in eastern Ukraine. So, if that's the basis of its memorandum, then the document will essentially be a list of Moscow's maximalist demands, including permanent neutrality for Ukraine. Lavrov also confirmed that Russia's delegation will again be led by Kremlin aide Vladimir Medinsky, who Kyiv last time dismissed as being too junior for the talks to achieve anything meaningful. Expectations of a breakthrough at round two will be similarly low. Meanwhile, Mr Lavrov also hit out at Germany for agreeing to finance the production of long-range missiles in Ukraine, accusing Berlin of showing it is \"already a participant in the war\". However, German leader Friedrich Merz declined to say that his country would hand over the Taurus missiles that Ukraine's president Volodymyr Zelenskyy – who was in Berlin on Wednesday – has long wanted. Ukraine's need for ammunition has become all the more urgent after Russia launched some of the largest aerial assaults of the war so far over the weekend. Read more:Would 'smart' missiles allow Ukraine to hit key bridge?Lavrov accuses West of secrecy over strikes Russia said it had downed 296 Ukrainian drones over 13 regions overnight, while Ukraine said it had struck several weapon production sites. Kyiv, in turn, said Moscow had launched 88 drones and five ballistic missiles since Tuesday."
    },
    {
        "title": "Andrew Tate and his brother Tristan charged with rape in the UK",
        "description": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK.",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-charged-with-rape-in-the-uk-13376089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 16:05:00",
        "Headline": "Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\",  said to have occurred between 2012 and 2015.",
        "Content": "Andrew Tate and his brother Tristan Tate have been charged with rape and other offences in the UK. Andrew Tate, 38, faces 10 charges, including rape, actual bodily harm, human trafficking and controlling prostitution for gain, relating to three women. His brother Tristan Tate, 36, faces 11 charges relating to one woman – including rape, actual bodily harm and human trafficking. The charges were authorised in January 2024, but full details have only been released now. Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they \"unequivocally deny\", said to have occurred between 2012 and 2015. The Tate brothers are facing separate allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. They are also accused of human trafficking and forming a criminal gang to sexually exploit women in a different case, which has been sent back to prosecutors. They are due to be extradited to the UK following the conclusion of proceedings in Romania. A Crown Prosecution Service (CPS) spokesperson said: \"We can confirm that we have authorised charges against Andrew and Tristan Tate for offences including rape, human trafficking, controlling prostitution and actual bodily harm against three women. \"These charging decisions followed receipt of a file of evidence from Bedfordshire Police. \"A European Arrest Warrant was issued in England in 2024, and as a result the Romanian courts ordered the extradition to the UK of Andrew and Tristan Tate.\" The spokesperson added: \"However, the domestic criminal matters in Romania must be settled first. \"The Crown Prosecution Service reminds everyone that criminal proceedings are active, and the defendants have the right to a fair trial. \"It is extremely important that there be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record Representatives for Andrew Tate have been contacted by Sky News for comment. Lawyer Matt Jury, of McCue Jury & Partners, representing several alleged British victims of Andrew Tate, said: \"We welcome the clarity from the Crown Prosecution Service that our authorities are working to ensure the Tates face justice here in the UK – they cannot be allowed to escape extradition. \"At the same time, we ask once more that CPS admit its mistake in failing to prosecute Tate when he lived in the UK and finally charge him for the rape and assault of the other three women, our clients, who originally filed criminal complaints against him as long ago as 2014 but were failed by the system. \"They deserve justice, too.\" The allegations were subject to a police investigation, which was closed in 2019."
    },
    {
        "title": "Zelenskyy had hoped for Taurus missiles from Germany - but he's left Berlin far from empty-handed",
        "description": "When Ukraine's president Volodymyr Zelenskyy came to Berlin today, the big question was whether he would be leaving with a promise from Germany to supply Taurus long-range missiles.",
        "url": "https://news.sky.com/story/zelenskyy-had-hoped-for-taurus-missiles-from-germany-but-hes-left-berlin-far-from-empty-handed-13376053",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-merz-zelenskyy_6929733.jpg?20250528160527",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-05-28 14:43:00",
        "Headline": "The support package includes a promise to help Ukraine produce its own long-range weapons, a significant amount of which the German government says could be produced before the end of the year.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n When Ukraine's president Volodymyr Zelenskyy came to Berlin today, the big question was whether he would be leaving with a promise from Germany to supply Taurus long-range missiles. On this, German Chancellor Friedrich Merz remained tight-lipped, in public at least. But the Ukrainian leader left far from empty-handed. Follow the latest: Kremlin hits out at Germany Germany has pledged another military support package, which it says is worth around €5bn (£4.2bn). It includes a promise to help Ukraine produce its own long-range weapons, a significant amount of which the German government says could be produced before the end of the year. The fact that some of these weapons are already used by the Ukrainian military means no extra training is needed. This also means, in theory, they could be used much more quickly than the Taurus system, which would involve extra instruction. Mr Merz wouldn't give a run-down of the weapons included to avoid giving Moscow a heads up, but he did reiterate that range restrictions on weapons would be lifted to allow Kyiv to hit military targets in Russia. Explainer: Would 'smart' missiles from Germany allow Ukraine to finally destroy Crimea bridge? This is a big step for Germany, which has been cautious about doing anything to provoke nuclear-armed Moscow. The Kremlin was quick to respond, calling Germany's announcement a further provocation. While the support package isn't entirely new and has already been signed off by the German parliament, the details of what it includes are.  In addition to helping with weapons production, there will be cash for continued Starlink connection and the delivery of air defence systems and ammunition. This is the fourth time Mr Zelenskyy has visited Berlin, but his first meeting with the new chancellor in the city. The direct tone of Mr Merz felt like a huge departure from his more cautious predecessor, Olaf Scholz. Read more from Sky News:Surgeon jailed after sexually abusing childrenOne dead after gunfire at aid hub in Gaza Mr Merz was quick in his criticism of Russia and what he said was a lack of commitment to peace talks. Ukraine has always been grateful for the huge amount of aid Germany has provided, but in the past appeared frustrated by the time it took for some decisions to be made. Mr Merz is known for shooting from the hip, a style which so far appears to be well-received in Kyiv."
    },
    {
        "title": "Hamas's Gaza chief 'eliminated', says Netanyahu - but military sources say they cannot confirm death ",
        "description": "Hamas's Gaza chief Mohammed Sinwar has been \"eliminated\", according to Israel's Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/hamass-gaza-chief-mohammad-sinwar-has-been-eliminated-says-netanyahu-13375691",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-mohammed-sinwar-hamas_6396557.jpg?20231218063131",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 13:00:00",
        "Headline": "Mohammed Sinwar is the younger brother of the militant group's former leader Yahya Sinwar, the mastermind of the October 7 2023 attack on Israel, who was killed last year.",
        "Content": "Hamas's Gaza chief Mohammed Sinwar has been \"eliminated\", according to Israel's Prime Minister Benjamin Netanyahu. But Israeli military sources have said they are not yet able to confirm the death. Hamas has also not yet confirmed the apparent killing of its leader. Meanwhile, with Gaza on the brink of famine, the Palestinian ambassador to the United Nations broke down in tears as he spoke of the suffering of its people.  Riyah Mansour told the Security Council: \"Children are dying of starvation. The images of mothers embracing their motionless bodies. Caressing their hair, talking to them, apologising to them, is unbearable.\" He added: \"I have grandchildren. I know what they mean to their families. And to see this situation over the Palestinians without us having hearts to do something is beyond the ability of any normal human being to tolerate. Flames and hunger are devouring Palestinian children. This is why we are so outraged as Palestinians everywhere.\" Sinwar was one of Israel's most wanted and the younger brother of the Palestinian militant group's former leader Yahya Sinwar. The older sibling was the mastermind of the October 7 2023 attack, which killed 1,200 people in Israel, with around 250 others taken hostage into Gaza. The attack triggered Israel's assault on Gaza which decimated the territory, with more than 53,000 people killed, mostly women and children, and over two million displaced, according to health officials, who do not distinguish between civilians and combatants in their tally of fatalities.  Yahya Sinwar was killed in a gun battle with Israeli troops in Gaza last October. His younger sibling was believed to have then become the head of Hamas's armed wing. Speaking to the Knesset on Wednesday, Mr Netanyahu included Mohammed Sinwar in a list of Hamas leaders killed in Israeli strikes. Later, Israel Defence Forces (IDF) sources said they were not yet able to confirm the death. The prime minister said: \"We have killed tens of thousands of terrorists. We killed (Mohammed) Deif, (Ismail) Haniyeh, Yahya Sinwar and Mohammed Sinwar.\" He did not elaborate. Mohammed Sinwar had reportedly been the target of an Israeli strike on a hospital in southern Gaza on 13 May and Mr Netanyahu said on 21 May that it was likely he had been killed. The Israeli military had said it struck a Hamas command centre under the European Hospital in the Sinwars' hometown of Khan Younis, and it declined to comment on whether Sinwar was targeted or killed. At least six people were killed in the strike and 40 wounded, Gaza's health ministry said at the time. Sinwar rose through ranks Like his older brother, Mohammed Sinwar joined Hamas after it was founded in the late 1980s as the Palestinian branch of the Muslim Brotherhood. He became a member of the group's military wing, known as the Qassam Brigades. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Sinwar rose through the ranks to become a member of its so-called joint chiefs of staff, bringing him close to its longtime commander, Deif, who was killed in a strike last year. Read more from Sky News:Humanitarian chief talks of Gaza 'catastrophe'UN boss condemns 'teaspoon' of aid allowed into Gaza \"In the last two days, we have been in a dramatic turn towards a complete defeat of Hamas,\" the Israeli leader told the Knesset. Mr Netanyahu also spoke about how Israel was \"taking control of food distribution\", a reference to a new aid distribution system that has been criticised and boycotted by humanitarian groups and the UN. One killed at site of aid hub The development comes after one person was killed and 48 others injured when forces opened fire on a crowd that overwhelmed an aid hub in Gaza, according to local health officials. Palestinians have become increasingly desperate for food after almost three months of Israeli border closures. A blockade has recently been eased. Israeli ambassador criticises UN agencies Danny Danon, Israel's ambassador to the United Nations, has criticised UN agencies facilitating aid in Gaza, accusing the international body, without evidence, of holding up aid at border crossings. \"As we speak, there are more than 400 trucks already on the other side of the fence, waiting to be distributed, but the UN has failed to pick them up,\" Mr Danon told reporters. \"We opened the crossings. We provided safe routes for those truck. But the UN did not show up.\" People broke through fences around the distribution site on Wednesday, and a journalist with the Associated Press said they heard Israeli tank and gunfire, and saw a military helicopter firing flares. It was not yet known whether the death and injuries were caused by Israeli forces, private contractors or others. The Israeli and US-backed Gaza Humanitarian Foundation, which set up the hub outside Rafah, said its military contractors had not fired on the crowd but \"fell back\" before resuming aid operations. Israel said its troops nearby had fired warning shots. The UN and other humanitarian organisations have rejected the new system, saying it will not meet the needs of Gaza's 2.3 million people and allows Israel to use food to control the population. Israel has vowed to seize control of Gaza and fight until Hamas is destroyed or disarmed and exiled, and until the militant group returns the last 58 hostages, including around a third thought to be still alive. 'This is a man-made catastrophe' Meanwhile, a US trauma surgeon who has been working in Gaza urged the UN Security Council to not \"claim ignorance\" about the humanitarian devastation. Dr Feroze Sidhwa said: \"Let's not forget, this is a man-made catastrophe. It is entirely preventable. Participating in it or not allowing it to happen is a choice. \"This is a deliberate denial of conditions necessary for life: food, shelter, water and medicine.\" The UN World Health Organization has documented around 700 attacks on healthcare facilities in Gaza during the war. Israel accuses Hamas of using hospitals as command centres and to hide fighters."
    },
    {
        "title": "One person missing after mudslide buries Swiss mountain village",
        "description": "One person is missing after a deluge of rock, mud and ice buried 90% of a Swiss mountain village, officials have said. ",
        "url": "https://news.sky.com/story/one-person-missing-after-mudslide-buries-swiss-mountain-village-13376132",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-switzerland-avalanche_6929846.jpg?20250528192916",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 17:57:00",
        "Headline": "Approximately 300 residents were evacuated from Blatten on 19 May after geologists warned that a glacier overlooking the village was at risk of an imminent collapse.",
        "Content": "One person is missing after a deluge of rock, mud and ice buried 90% of a Swiss mountain village, officials have said.  It came after a glacier overlooking the settlement of Blatten, in southern Switzerland, partially collapsed on Wednesday, sending the debris raining down. \"An unbelievable amount of material thundered down into the valley,\" Matthias Ebener, a spokesman for local authorities in the Valais canton. He also confirmed one person was missing. Approximately 300 residents, as well as livestock, were evacuated from the area on 19 May after geologists warned that a 1.5 million cubic meter (52 million cubic feet) glacier overlooking the village was at risk of imminent collapse. Local councillor Stephane Ganzer told Swiss media that the mud and rockslide \"at first glance covered 90% of the village\". Footage shared on social media showed the moment the debris came down, leaving behind destroyed buildings and other infrastructure in the village, which is nestled in the Loetschental valley. Emergency services warned people that the area was hazardous and urged them to stay away. Read more from Sky News:Andrew Tate charged with rapeSurgeon jailed for abusing childrenUK has sunniest spring on record Swiss President Karin Keller-Sutter expressed her solidarity with villagers. 'It's terrible to lose your home,\" she said in a social media post. \"In these hours, I feel for the residents of Blatten.\""
    },
    {
        "title": "Joel Le Scouarnec: French surgeon who sexually abused hundreds of children is jailed",
        "description": "A former surgeon who sexually abused hundreds of children in France has been sentenced to 20 years in prison.",
        "url": "https://news.sky.com/story/joel-le-scouarnec-french-surgeon-who-admitted-sexually-abusing-hundreds-of-children-is-jailed-13375805",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-france-surgeon_6832657.png?20250528100328",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 07:56:00",
        "Headline": "Prosecutors described Le Scouarnec as \"a devil in a white coat\", with most of his victims abused while under anaesthesia or waking up from operations.",
        "Content": " A former surgeon who sexually abused hundreds of children in France has been sentenced to 20 years in prison. Joel Le Scouarnec, 74, was found guilty of raping and sexually assaulting 299 children in one of France's largest-ever child sex abuse cases. Most of the victims were abused while under anaesthesia or waking up from operations, with an almost equal number of boys and girls. Two victims took their own lives years before the trial. He was accused of 300 separate offences - 111 rapes and 189 sexual assaults - in more than a dozen hospitals between 1989 and 2014. Le Scouarnec is already serving a 15-year prison sentence for a 2020 conviction for the rape and sexual assault of four children. During the trial in Morbihan, in western France, prosecutors described Le Scouarnec as \"a devil in a white coat\" and requested the maximum sentence of 20 years in prison. \"I'm aware that the harm I've caused is beyond repair,\" Le Scouarnec said at the opening of the trial in February. \"I owe it to all these people and their loved ones to admit my actions and their consequences, which they've endured and will keep having to endure all their lives.\" The court ordered Le Scouarnec should serve at least two-thirds of the sentence before he can be eligible for release. Presiding Judge Aude Buresi said Le Scouarnec had preyed on victims when they were at their most vulnerable. \"Your acts were a blind spot in the medical world, to the extent that your colleagues, the medical authorities, were incapable of stopping your actions,\" the judge told Le Scouarnec. Read more:A monster who lived among us - and got away with itHow did surgeon carry out abuse unchecked for decades?  Le Scouarnec had confessed to all the sexual abuse, as well as to other assaults that are now beyond the statute of limitations. He kept detailed records of the abuse he inflicted in notebooks and diaries and some only became aware they had been abused when contacted by investigators after their names appeared in his journals. Others only realised they had been admitted to hospital at the time by checking their medical journals. \"I didn't see them as people,\" Le Scouarnec told the court during the trial. \"They were the destination of my fantasies. As the trial went on, I began to see them as individuals, with emotions, anger, suffering and distress.\" Le Scouarnec was never investigated during his career, despite being sentenced in 2005 for owning child sexual abuse images. He was only apprehended after he retired in 2017 when a girl told her mother that Le Scouarnec had sexually abused her while she was playing in the garden of her home. When the police searched Le Scouarnec's house they found 300,000 indecent photos and videos of children, 70 child-sized dolls and hundreds of notebooks and diaries detailing his acts of abuse. Dozens of victims and rights campaigners gathered outside the courthouse in Brittany ahead of the verdict, with a banner made of hundreds of pieces of white paper with black silhouettes - one for each victim. Some papers featured a first name and age, while others referred to the victim as \"Anonymous\". The local prosecutor has opened a separate investigation to determine if there was any criminal liability by agencies or individuals who could have prevented the abuse. A group of victims said in a statement before the verdict: \"This trial, which could have served as an open-air laboratory to expose the serious failings of our institutions, seems to leave no mark on the government, the medical community, or society at large.\""
    },
    {
        "title": "Joel Le Scouarnec: A monster who lived among us - and got away with it",
        "description": "There are so many aspects to the crimes of Joel Le Scouarnec that it can feel bewildering. Not just the volume of his offences, but also the failings that allowed him to get away with such horrendous abuse for so long.",
        "url": "https://news.sky.com/story/joel-le-scouarnec-a-monster-who-lived-among-us-and-got-away-with-it-13375900",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-joel-le-scouarnec-court_6831352.jpg?20250217092639",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-05-28 10:13:00",
        "Headline": "Far too many of Le Scouarnec's victims feel as if they have been left behind and forgotten - and that their nation is ignoring their suffering.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n There are so many aspects to the crimes of Joel Le Scouarnec that it can feel bewildering. Not just the volume of his offences, but also the failings that allowed him to get away with such horrendous abuse for so long. A monster who lived among us, and got away with it. There are the questions about whether French society puts some people on such a lofty pedestal they become beyond reproach. The way in which police treat victims, and the support those people get - or don't get - when they come to terms with offences that happened to them, and often changed their lives. But perhaps the most troubling side of this whole trial has been the relative indifference that has greeted it. You might imagine Le Scouarnec's crimes would lead to a searing national debate, a public inquiry and government soul-searching. That, after all, is what happened following the trial of Dominique Pelicot who was found guilty of inviting dozens of men to rape or sexually abuse his wife Gisele over the course of a decade. She, like many of Le Scouarnec's victims, was unaware of what had happened to her - Gisele was drugged; Le Scouarnec preyed on children still recovering from anaesthetic. In the Pelicot case, there was one victim and dozens of perpetrators. Le Scouarnec is the reverse - one man who attacked hundreds of people. And yet the reception has been so different. Pelicot's case was followed around the world, and its verdict echoed through French society. Le Scouarnec's victims have complained about being ignored and forgotten. Read more:How did surgeon carry out abuse unchecked for decades?  So what's happened? Perhaps Le Scouarnec's crimes are simply too horrendous - maybe we find his level of child abuse simply too dreadful to confront and instead turn away. Possibly there is the argument that child abuse is a crime with which we are all too familiar, whereas the actions of Dominique Pelicot - drugging his own wife to allow strangers to rape her - were something horrendously new. And then there is Gisele Pelicot - a totemic character who chose to reveal her identity and to own, and so mould, the story of what happened to her. For many, she is a heroic figure - a sign of hope amid the horror. In the case of Le Scouarnec, there is very little sign of redemption. Everything seems bleak. Or is it simply that the French establishment does not want to accept the crimes of Le Scouarnec were enabled by terrible mistakes - that opportunities to stop him were repeatedly missed. Whatever the reasons, far, far too many of Le Scouarnec's victims feel as if they have been left behind and forgotten; that their nation is ignoring their suffering. And that, if nothing else, should give France reason to pause and to think."
    },
    {
        "title": "Could a ceasefire deal in Gaza be close?",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈</a>",
        "url": "https://news.sky.com/story/could-a-ceasefire-deal-in-gaza-be-close-13375591",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-the-world-vodcast_6915914.jpg?20250521204722",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 04:10:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 As international criticism of Israel's latest military offensive in Gaza mounts, Richard and Yalda ask how likely a ceasefire is in the coming weeks. Also, one of Richard's contacts tells him how Israel is using talking drones in Gaza which he describes as 'like something from Black Mirror'. Yalda unpacks her interview with a Hamas official, who has an interesting revelation about negotiations. Meanwhile, Richard gives his thoughts on a possible US-Iran nuclear deal. He also unveils the life of the super-rich in Iran's capital. Later on, they both try to make sense of the latest drama between Donald Trump and Vladimir Putin. To get in touch or to share questions for Richard and Yalda, email theworld@sky.uk. Episodes of The World With Richard Engel And Yalda Hakim will be available every Wednesday on all podcast platforms."
    },
    {
        "title": "One dead and dozens injured after gunfire at aid hub in Gaza",
        "description": "One person has been killed and 48 others injured after a crowd overwhelmed an aid hub in Gaza, according to local health officials.",
        "url": "https://news.sky.com/story/one-dead-and-dozens-injured-after-gunfire-at-aid-hub-in-gaza-13375792",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-palestinians-boxes_6929364.jpg?20250528083833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-28 07:15:00",
        "Headline": "Ajith Sunghay, head of the UN Human Rights Office for the Palestinian territories, said it appeared that Israeli army gunfire had caused most of the injuries. Palestinians have become desperate for food after nearly three months of an Israeli blockade.",
        "Content": " One person has been killed and 48 others injured after a crowd overwhelmed an aid hub in Gaza, according to local health officials. Gaza's Hamas-run health ministry said forces opened fire on crowds of Palestinians over-running an aid distribution site set up by an Israeli and US-backed aid group called the Gaza Humanitarian Foundation (GHF). People broke through the fences, and an Associated Press journalist heard Israeli tank and gunfire, and saw a military helicopter firing flares.  Ajith Sunghay, head of the UN Human Rights Office for the Palestinian territories, said it appeared that Israeli army gunfire had caused most of the injuries. Speaking from Switzerland, Mr Sunghay said earlier: \"The information that we have is that about 47 people have been injured, it is through gunshots. \"We're still gathering information, the numbers could go up. \"What we know is that it was shooting from the IDF [Israeli Defence Forces]. But again, this is a job we are continuing to do at this time.\" The GHF said its military contractors did not fire on the crowd but \"fell back\" before later resuming operations. Israel said its troops nearby had fired warning shots. Prime Minister Benjamin Netanyahu said that there had been \"some loss of control momentarily\" at the hub, but \"happily, we brought it under control\". He repeated Israel's plan to relocate Gaza's population to a \"sterile zone\" at the southern end of the territory while it fights Hamas elsewhere. In the meantime, its strikes on Gaza have continued. The head of the UN agency for Palestinian refugees said the new model for providing aid to Gaza was wasteful and a \"distraction from atrocities\". 👉Listen to The World on your podcast app👈 'Teaspoon' of aid Palestinians have become desperate for food after nearly three months of an Israeli blockade, which has pushed Gaza to the brink of famine. UN secretary general Antonio Guterres said last week Israel had only authorised for Gaza what amounts to a \"teaspoon\" of aid and more people will die unless there is \"rapid, reliable, safe and sustained aid access\". The UN and other humanitarian organisations have rejected the new aid system. They have warned that it will not be able to meet the needs of Gaza's 2.3 million people and allows Israel to use food as a weapon to control the population. Israel said it has established the new aid system to stop Hamas from siphoning off supplies. It has provided no evidence of systemic diversion, and UN agencies have said they have mechanisms in place to prevent this. Read more:Surgeon: Gaza has become 'a slaughterhouse'Stand-off between Israel and its Western alliesIsraeli strike on shelter leaves at least 31 dead The Gaza Humanitarian Foundation publicly launched earlier this year and is run by a group of American security contractors, ex-military officers and humanitarian aid officials. Until his resignation, Jake Wood was the face of the foundation. The US military veteran said on Sunday he quit because it was clear the group would not be allowed to operate independently. It is not clear who will run the GHF now. The US and Israeli-backed group is the linchpin of a new aid system, despite opposition from the UN and most humanitarian groups. It has set up a number of hubs under the guard of armed contractors, instead of taking aid to where Palestinians are. The GHF moved food to its hubs on Monday and began distribution. It said flows would be \"increasing each day\" and it had plans to reach more than one million Palestinians by the end of the week. The Israeli military said two of the four hubs had begun distributing food, both in Rafah. The foundation has said it will create more hubs within 30 days, including in the north. Sanaa airstrikes Elsewhere in the region, Israel said it had carried out airstrikes on the international airport in Yemen's capital, Sanaa. It came after Iran-backed Houthi rebels fired several missiles at the country in recent days. Israel last struck the airport on 6 May. During that attack, it destroyed the airport's terminal and left its runway riddled with craters. Some flights resumed to Sanaa on 17 May. Israel said it had struck Houthi targets, including the last remaining plane used by the group, at the airport."
    },
    {
        "title": "US trade court blocks Donald Trump from imposing sweeping global tariffs - claiming he exceeded his authority",
        "description": "A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports.",
        "url": "https://news.sky.com/story/us-trade-court-blocks-donald-trump-from-imposing-sweeping-global-tariffs-claiming-he-exceeded-his-authority-13376237",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tariffs-trump-trade_6883640.jpg?20250412104019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-28 23:44:00",
        "Headline": "The White House is vowing to appeal the ruling - and it's currently unclear how the verdict will affect the recently signed UK-US trade deal.",
        "Content": " A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports. A three-judge panel concluded that the US president exceeded his authority when he unveiled additional taxes on foreign-made goods. Tariffs must typically be approved by Congress - but Trump has argued he had power to act because it was a \"national emergency\". The controversial measures unveiled on \"Liberation Day\" in April, which included a 10% tariff on UK imports, had caused aggressive sell-offs in the stock market. Minutes after the Court of International Trade delivered its verdict, the Trump administration filed a notice of appeal - meaning the battle could escalate to the Supreme Court. Several lawsuits have been filed against the president's tariffs - and this ruling relates to a case brought on behalf of five small businesses that import goods from other countries. The companies, which sell everything from wine to musical instruments, had argued they were struggling to survive because of these additional costs. \n                  Elon Musk leaving role in the Trump administration\n                 \n                  Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks\n                 \n                  Trump administration halts international student visa applications\n                  The ruling came shortly before Elon Musk confirmed he was leaving his role in the Trump administration. Trump's deputy chief of staff Stephen Miller criticised the court on social media, writing: \"The judicial coup is out of control.\" And in a fiery statement, the White House added: \"It is not for unelected judges to decide how to properly address a national emergency.\" Spokesperson Kush Desai went on to say that trade deficits - where the US imports more from a country than it exports - have \"decimated American communities and left our workers behind\". But Oregon's attorney general, Dan Rayfield, welcomed the ruling and described Trump's tariffs as unlawful, reckless and economically devastating. And Ron Wyden - the top Democrat on the Senate Finance Committee - said the president's actions had \"jacked up prices on groceries and cars, threatened shortages of essential goods, and wrecked supply chains for American businesses large and small\".  Before the court's intervention, flat tariffs of 10% worldwide were in force - with higher rates for specific countries due to be implemented on 9 July. Economists had expressed fears that the tariffs could exacerbate inflation, and even cause a recession. The US dollar strengthened as investors digested the news - with stock market futures also rallying higher. \"We're just trying to work out what it might mean basically but obviously the market is doing a kneejerk reaction so I guess it's reversing a lot of the moves that we've seen,\" National Australia Bank's head of FX strategy Ray Attrill said. One of the three judges who heard the case was appointed by the Trump administration, while the other two were named by Ronald Reagan and Barack Obama during their terms in the Oval Office.  Earlier this month, the UK and US agreed a trade deal that would lower tariffs on British cars sold in the US from 27.5% to 10% - and eliminate duties on UK steel and aluminium altogether. At this stage, it is unclear how the trade court's ruling will affect this arrangement."
    },
    {
        "title": "Sean 'Diddy' Combs's ex Cassie gives birth two weeks after testifying against him – as his bid for mistrial is dismissed",
        "description": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him &#8211; as his legal team failed in a bid to declare a mistrial.",
        "url": "https://news.sky.com/story/sean-diddy-combss-ex-cassie-gives-birth-two-weeks-after-testifying-against-him-8211-as-his-bid-for-mistrial-is-dismissed-13376112",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-28 17:05:00",
        "Headline": "Cassie Ventura, 38, has welcomed her third child with partner Alex Fine, her friend Deonte Nash told a court on Wednesday.",
        "Content": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him – as his legal team failed in a bid to declare a mistrial. Cassie Ventura gave birth to her third child with partner Alex Fine after going into labour on Tuesday, a close source told Sky's US partner network NBC News on Wednesday. The news was later confirmed by her friend and former stylist Deonte Nash, who told Diddy's trial that he last spoke to her \"after she had the baby yesterday [Tuesday]\". Diddy trial day eleven – as it happened Combs, 55, is accused of two counts of sex trafficking by force, fraud, or coercion, two counts of transportation to engage in prostitution, and one of conspiring to racketeer. He denies all the charges. Cassie had given evidence while she was more than eight months pregnant. The 38-year-old told the trial that Diddy subjected her to physical, sexual and mental abuse for much of their 11-year relationship. She alleged he forced her into \"hundreds\" of drug-fuelled sex sessions with male escorts while he watched, which he referred to as \"freak offs\". News of the birth came on the same day Combs's legal team tried in vain to get the judge to declare a mistrial. Alexandra Shapiro, one of Diddy's attorneys, moved for the mistrial just before the court broke for lunch, during evidence by Los Angeles Fire Department (LAFD) arson investigator Lance Jiminez. According to Ms Shapiro, Mr Jiminez's claim that police destroyed fingerprint evidence collected at the scene of an alleged 2012 Molotov cocktail attack on rapper Kid Cudi's car would lead the jury to believe Combs had something to do with it. She accused the prosecution of \"misconduct\" and claimed their questioning of Mr Jiminez was \"designed to play into that\" narrative. Another of Diddy's defence lawyers Marc Agnifilo described the prosecution's conduct as \"outrageous\". However, prosecution attorney Christy Slavik hit back by saying a mistrial was \"completely unwarranted\". She insisted questions about the destruction of evidence were asked to highlight the poor quality of the police investigation. Judge Arun Subramanian dismissed the motion and instead told jurors to disregard any reference to the fingerprints. Earlier on Wednesday, Los Angeles Police Department (LAPD) officer Chris Ignacio detailed the alleged break-in at Kid Cudi's home in December 2011. He was called to the scene and noticed a Cadillac Escalade parked in front of the property, the number plate for which later transpired to be registered to Bad Boy Productions, Diddy's record label. During his evidence, Cudi alleged it was Diddy who was behind the break-in. Mr Jiminez then testified about an alleged Molotov cocktail attack on Cudi's car the following month. Having investigated the incident, he concluded it was \"not a random act\" and that the makeshift firebomb had been placed there deliberately, in line with Cudi's claims. When Diddy and Cassie's former stylist Mr Nash took to the stand, he detailed several incidents of alleged violence inflicted on the singer by her then partner. On one occasion, Diddy turned up at her LA flat, \"grabbed her by the hair\", \"kicked her\" and \"hit her pretty hard\", he claimed. When she hit her head on a bed frame, she suffered a gash to her forehead and eyebrow, he said. Both he and Mia, a second alleged witness, jumped on the rapper's back to get him to stop, he told the court. Following another incident when Diddy demanded to see Cassie, she threatened to \"go over the balcony\", Mr Nash told the jury. Diddy was violent towards him too, he said, once choking him against a car and threatening him not to go out with Cassie and without him. Despite all this, Mr Nash said he \"doesn't hate\" Diddy – and that he had been compelled to give evidence as part of a subpoena. Mia, which is a pseudonym used to protect her identity, was due to start her evidence on Wednesday but Mr Nash's testimony overran. He will resume giving evidence on Thursday, with Mia's evidence due to last until the court breaks for the weekend. The trial continues."
    },
    {
        "title": "Trump administration halts international student visa applications",
        "description": "The Trump administration has stopped the scheduling of new visa interviews for foreign students hoping to study in the US while it prepares to expand social media vetting of applicants.",
        "url": "https://news.sky.com/story/trump-administration-halts-international-student-visa-applications-13375759",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-harvard-students_6929332.jpg?20250528083148",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-28 05:56:00",
        "Headline": "The move comes days after the Trump administration tried to revoke Harvard University's ability to enrol international students - an effort blocked by a federal judge.",
        "Content": "The Trump administration has stopped the scheduling of new visa interviews for foreign students hoping to study in the US while it prepares to expand social media vetting of applicants. A US official said on Tuesday the suspension is intended to be temporary and does not apply to applicants who already have visa interviews scheduled. The official spoke on the condition of anonymity to discuss an internal administration document. A downturn in enrolment of international students could hurt university budgets in the US. To make up for cuts in federal research funding, some colleges previously shifted to enrolling more international students, who often pay full tuition. Now, an internal cable signed by US Secretary of State Marco Rubio and seen by the Associated Press news agency shows how new student visa interviews are being halted as the US State Department plans to issue guidance on expanded social media vetting. The cable says that \"in preparation for an expansion of required social media screening and vetting, consulate sections should not add any additional student or exchange visitor visa appointment capacity\" until the guidance is issued. It also says the halting of new visa interviews is \"effective immediately\". 👉 Follow Trump100 on your podcast app 👈 Asked about the suspension at a briefing on Tuesday, State Department spokesperson Tammy Bruce said the US uses every available resource to vet people applying for visas. \"We will continue to use every tool we can to assess who it is that's coming here, whether they are students or otherwise,\" Ms Bruce said. The move, first reported by Politico, is the latest in the White House's crackdown on international students. Last week, the Trump administration revoked Harvard University's ability to enrol international students, removing the college from the programme that allows schools to sponsor foreign students for visas. That effort was quickly challenged in court and for now is blocked by a federal judge. Read more US news:Diddy 'kidnapped aide at gunpoint'SpaceX rocket spins out of controlEnvoy 'regrets' association with Epstein  This spring the Trump administration also revoked the legal status of thousands of international students already in the country, leading some to leave the US out of fear of deportation. After many students filed successful legal challenges, the administration said it was restoring the students' legal status. But the government also expanded the grounds for terminating international students' legal status going forward. US President Donald Trump's previous administration stepped up scrutiny of all visa applicants, introducing reviews of their social media accounts. The policy remained during President Joe Biden's administration. An extended pause in scheduling student visas could lead to delays that may disrupt college, boarding school or exchange students' plans to enrol in summer and autumn terms."
    },
    {
        "title": "Trump vs universities: Could social media deny students entry to US?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>      ",
        "url": "https://news.sky.com/story/trump-vs-universities-could-social-media-deny-students-entry-to-us-13375747",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-28 04:40:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    The Trump administration has ordered embassies to stop scheduling student visa appointments as it prepares to implement strict social media vetting. US correspondents Martha Kelner and James Matthews discuss why the administration is introducing the drastic measures and what a ban on international students could mean for the US. Plus, Trump has threatened to pull California's federal funding over one high school trans athlete. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "What Starship failure means for Elon Musk's Mars plans",
        "description": "Elon Musk's plans to go to Mars may not have come crashing down to Earth but they've certainly suffered a significant setback.",
        "url": "https://news.sky.com/story/what-starship-failure-means-for-elon-musks-mars-plans-13375824",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-spacex-space-x_6929550.jpg?20250528121532",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2025-05-28 08:42:00",
        "Headline": "Musk has a reputation for over-promising on timings but ultimately delivering era-defining technology - but is this an early sign he has finally reached too far?",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Elon Musk's plans to go to Mars may not have come crashing down to Earth but they've certainly suffered a significant setback. The ninth test flight of Starship, the SpaceX spacecraft specifically designed to make \"humans an interplanetary species\", ended with it spinning out of control over the Indian Ocean. This was Starship's third consecutive failure. The machine that was touted as taking humans as far as Mars as soon as 2028 has yet to make an orbit of Earth. Musk's near-term Mars plans look even more like science fiction. No surprise then that a much-trailed update from Musk laying out the detail of his Mars programme scheduled to coincide with the test flight was cancelled. He posted shortly after the test, as he typically does, about how much had been learned from the test flight and how the programme would ramp up from now on. Musk's \"fail fast\" approach to rocket development has been central to SpaceX becoming, by a large margin, the most successful space launch business in history. Whether it's electric cars or rockets, Musk has a reputation for over-promising on timings but ultimately delivering era-defining technology. But is this an early sign that when it comes to Starship, he has finally reached too far? As well as trying to overcome two spectacular failures of Starship in tests earlier this year, it was the first attempt to fly a reused Super Heavy booster. Recycling rockets is what has allowed SpaceX to dominate the launch business with its Falcon 9 and Falcon Heavy machines. It's also essential for the commercial viability of the Starship system. The reconditioned booster performed almost perfectly, in that it delivered Starship to space. But it exploded while conducting its \"landing burn\" - not the outcome engineers trying to demonstrate reusability would have wanted. Read more tech news:'I've been turned into an AI train announcer'How long before the UK is launching rockets?Mum allowed to sue chatbot firm Aside from helping Donald Trump deliver on a promise to put Americans on Mars during his presidency, Musk's plans for Mars are largely a personal project. But this latest failure may have a wider impact on Musk's fortunes. Investors were left panicking after Musk's chainsaw-wielding, questionable hand-gesturing detour into US politics. Has his time away from his electric car, space, robotics and AI companies harmed their performance? And while Starship is an experimental programme, very separate from the successful Falcon launch business, is it a viable design and, even if it is, how much of a drain will its fraught testing programme be on the wider company? SpaceX and Starship are central to NASA's plans to put Americans back on the moon as soon as 2030. The fact Starship has yet to orbit Earth, let alone land back on it again, means the US space agency must look more seriously to Musk's competitors like Amazon founder Jeff Bezos's Blue Origin space business to step up. Musk also wants to use Starship's heavy-lifting capability to win major defence contracts like Trump's \"golden dome\" missile defence shield. It would be a bold investor who would bet against Musk's ability to ultimately bend technology to his will. But even the world's richest man can't change time, or the laws of physics, to suit his ambitions."
    },
    {
        "title": "US trade court blocks Donald Trump from imposing sweeping global tariffs - claiming he exceeded his authority",
        "description": "A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports.",
        "url": "https://news.sky.com/story/us-trade-court-blocks-donald-trump-from-imposing-sweeping-global-tariffs-claiming-he-exceeded-his-authority-13376237",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tariffs-trump-trade_6883640.jpg?20250412104019",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-28 23:44:00",
        "Headline": "The White House is vowing to appeal the ruling - and it's currently unclear how the verdict will affect the recently signed UK-US trade deal.",
        "Content": " A trade court in the US has blocked Donald Trump from imposing sweeping global tariffs on imports. A three-judge panel concluded that the US president exceeded his authority when he unveiled additional taxes on foreign-made goods. Tariffs must typically be approved by Congress - but Trump has argued he had power to act because it was a \"national emergency\". The controversial measures unveiled on \"Liberation Day\" in April, which included a 10% tariff on UK imports, had caused aggressive sell-offs in the stock market. Minutes after the Court of International Trade delivered its verdict, the Trump administration filed a notice of appeal - meaning the battle could escalate to the Supreme Court. Several lawsuits have been filed against the president's tariffs - and this ruling relates to a case brought on behalf of five small businesses that import goods from other countries. The companies, which sell everything from wine to musical instruments, had argued they were struggling to survive because of these additional costs. \n                  Elon Musk leaving role in the Trump administration\n                 \n                  Trump doubles down on Putin criticism - as Russia offers Ukraine a date and location for peace talks\n                 \n                  Trump administration halts international student visa applications\n                  The ruling came shortly before Elon Musk confirmed he was leaving his role in the Trump administration. Trump's deputy chief of staff Stephen Miller criticised the court on social media, writing: \"The judicial coup is out of control.\" And in a fiery statement, the White House added: \"It is not for unelected judges to decide how to properly address a national emergency.\" Spokesperson Kush Desai went on to say that trade deficits - where the US imports more from a country than it exports - have \"decimated American communities and left our workers behind\". But Oregon's attorney general, Dan Rayfield, welcomed the ruling and described Trump's tariffs as unlawful, reckless and economically devastating. And Ron Wyden - the top Democrat on the Senate Finance Committee - said the president's actions had \"jacked up prices on groceries and cars, threatened shortages of essential goods, and wrecked supply chains for American businesses large and small\".  Before the court's intervention, flat tariffs of 10% worldwide were in force - with higher rates for specific countries due to be implemented on 9 July. Economists had expressed fears that the tariffs could exacerbate inflation, and even cause a recession. The US dollar strengthened as investors digested the news - with stock market futures also rallying higher. \"We're just trying to work out what it might mean basically but obviously the market is doing a kneejerk reaction so I guess it's reversing a lot of the moves that we've seen,\" National Australia Bank's head of FX strategy Ray Attrill said. One of the three judges who heard the case was appointed by the Trump administration, while the other two were named by Ronald Reagan and Barack Obama during their terms in the Oval Office.  Earlier this month, the UK and US agreed a trade deal that would lower tariffs on British cars sold in the US from 27.5% to 10% - and eliminate duties on UK steel and aluminium altogether. At this stage, it is unclear how the trade court's ruling will affect this arrangement."
    },
    {
        "title": "'Leicester is embargoed': City's clothing industry in crisis",
        "description": "You probably recall the stories about Leicester's clothing industry in recent years: grim labour conditions, pay below the minimum wage, \"dark factories\" serving the fast fashion sector. What is less well known is what happened next. In short, the industry has cratered.",
        "url": "https://news.sky.com/story/sweatshop-scandals-have-left-leicesters-once-thriving-clothing-industry-in-existential-crisis-13375393",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ed-conway-leicester_6929439.jpg?20250528101000",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-05-28 03:10:00",
        "Headline": "In the wake of the recurrent scandals over \"sweatshop\" conditions in Leicester, the majority of major brands have now abandoned the city, triggering an implosion in production in the place that once boasted that it \"clothed the world\".",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  You probably recall the stories about Leicester's clothing industry in recent years: grim labour conditions, pay below the minimum wage, \"dark factories\" serving the fast fashion sector. What is less well known is what happened next. In short, the industry has cratered. In the wake of the recurrent scandals over \"sweatshop\" conditions in Leicester, the majority of major brands have now abandoned the city, triggering an implosion in production in the place that once boasted that it \"clothed the world\". And now Leicester faces a further existential double-threat: competition from Chinese companies like Shein and Temu, and the impending arrival of cheap imports from India, following the recent trade deal signed with the UK. Many worry it could spell an end for the city's fashion business altogether. Gauging the scale of the recent collapse is challenging because many of the textile and apparel factories in Leicester are small operations that can start up and shut down rapidly, but according to data provided to Sky News by SP&KO, a consultancy founded by fashion sector veterans Kathy O'Driscoll and Simon Platts, the number has fallen from 1,500 in 2017 to just 96 this year. This 94% collapse comes amid growing concerns that British clothes-making more broadly is facing an existential crisis. More on this story:The modern slaves making our clothes in LeicesterHow Leicester's textile workers are being exploitedBoohoo failed in Leicester supply chain malpractice In an in-depth investigation carried out over recent months, Sky News has visited sites in the city shut down in the face of a collapse of demand. Thousands of fashion workers are understood to have lost their jobs. Many factories lie empty, their machines gathering dust. The vast majority of high street and fast fashion brands that once sourced their clothes in Leicester have now shifted their supply chains to North Africa and South Asia. And a new report from UKFT - Britain's fashion and textiles lobby group - has found that a staggering 95% of clothes companies have either trimmed or completely eliminated clothes manufacturing in the UK. Some 58% of brands, by turnover, now have an explicit policy not to source clothes from the UK. Jenny Holloway, chair of the Apparel & Textile Manufacturers Association, said: \"We know of factories that were asked to become a potential supplier [to high street brands], got so far down the line, invested on sampling, invested time and money, policies, and then it's like: 'oh, sorry, we can't use you, because Leicester is embargoed.'\" Tejas Shah, a third-generation manufacturer whose family company Shahtex used to make materials for Marks & Spencer, said: \"I've spoken to brands in the past who, if I moved my factory 15 miles north into Loughborough, would be happy to work with me. But because I have an LE1, LE4 postcode, they don't want to work for me.\" Threat of Chinese brands Shein and Temu That pain has been exacerbated by a new phenomenon: the rise of Chinese fast fashion brands Shein and Temu. They offer consumers ultra-cheap clothes and goods, made in Chinese factories and flown direct to UK households. And, thanks to a customs loophole known as \"de minimis\", those goods don't even incur tariffs when they arrive in the country. According to Satvir Singh, who runs Our Fashion, one of the last remaining knitwear producers in the city, this threat could prove the final straw for Leicester's garments sector. \"It is having an impact on our production - and I think the whole retail sector, at least for clothing, are feeling that pinch.\" While Donald Trump has threatened to abolish the loophole in the US, the UK has only announced a review with no timeline. \"If we look at what Trump's done, he's just thinking more about his local economy because he can see the long-term effects,\" said Mr Singh. \"I think [abolishing de minimis exceptions] will make a huge difference. I think ultimately it's about a level playing field.\" A spokesperson for Temu told Sky News: \"We welcome UK manufacturers and businesses to explore a low-cost way to grow with us. By the end of 2025, we expect half our UK sales to come from local sellers and local warehouses.\""
    },
    {
        "title": "Thames Water hit with largest-ever fine issued by regulator Ofwat",
        "description": "Thames Water, the UK's biggest water provider, has been hit by a record fine by regulator Ofwat. ",
        "url": "https://news.sky.com/story/thames-water-hit-with-largest-ever-fine-issued-by-regulator-ofwat-13375757",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-thameswater_6929423.jpg?20250528094500",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-28 06:01:00",
        "Headline": "The UK's biggest water provider is fined nearly £123m after investigations related to its wastewater operations and dividend payouts.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Thames Water, the UK's biggest water provider, has been hit by a record fine by regulator Ofwat.  The company has been fined £122.7m following Ofwat's \"biggest and most complex\" investigation. It follows two investigations related to Thames Water's wastewater operations and dividend payouts. Of the total fine, £104.5m - 9% of Thames Water's turnover - has been levied for breaches of wastewater rules - just below the maximum 10% of turnover that Ofwat could have applied. Money blog: Inside the booming one-bed flat market Another £18.2m penalty will be paid for breaches of dividend payment rules. It is the first time Ofwat has fined a company for shareholders' payments which do not \"properly reflect\" its performance for customers and the environment. The fine will be paid by Thames Water and its shareholders, Ofwat said, rather than customers. 'Unacceptable' environmental impact The regulator was highly critical of Thames Water's handling of wastewater, describing it as having an \"unacceptable\" impact on the environment. Its investigation of treatment works and the wider wastewater network uncovered failings which \"amounted to a significant breach of the company's legal obligations\" and caused that unacceptable environmental impact. The company announced a 40% spike in sewage spills in December for the period from January to September 2024.  The fine was so large because Ofwat's chief executive, David Black, said Thames Water \"failed to come up with an acceptable redress package that would have benefited the environment\". \"This is a clear-cut case where Thames Water has let down its customers and failed to protect the environment,\" Mr Black said. \"Our investigation has uncovered a series of failures by the company to build, maintain and operate adequate infrastructure to meet its obligations.\" As a result, Thames Water is required to agree to a remediation plan with Ofwat within six months. Another investigation by the Environment Agency into environmental permits at sewage treatment works is ongoing. Bad news for Thames Water finances Thames Water serves 16 million customers across London and the South East and has just about fended off effective nationalisation, having secured an emergency £3bn loan. Its debts now top £19bn. Ofwat's fines were not factored into Thames Water's financial planning for the next five years. The company's chief executive, Chris Weston, told a recent sitting of the Environment, Food and Rural Affairs select committee that Thames Water's future was dependent on Ofwat being lenient with fines. A Thames Water spokesperson said: \"We take our responsibility towards the environment very seriously and note that Ofwat acknowledges we have already made progress to address issues raised in the investigation relating to storm overflows. \"The dividends were declared following a consideration of the company's legal and regulatory obligations. Our lenders continue to support our liquidity position and our equity raise process continues.\" Environment Secretary, Steve Reed said the government has launched the \"toughest crackdown on water companies in history\".\"The era of profiting from failure is over. The government is cleaning up our rivers, lakes and seas for good.\""
    },
    {
        "title": "Daily Mail chief to pay £35m for Telegraph stake",
        "description": "The owner of the Daily Mail is to pay more than &#163;30m for a minority stake in rival right-leaning newspaper The Daily Telegraph as the latter's prospective owners assemble a consortium of strategic backers.",
        "url": "https://news.sky.com/story/daily-mail-chief-to-pay-16335m-for-telegraph-stake-13375962",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-telegraph-daily-front-page_6432063.jpg?20240124172909",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-28 11:59:00",
        "Headline": "Lord Rothermere's DMGT is being advised by bankers at Goldman Sachs on the acquisition of a near-10% stake in the Daily and Sunday Telegraph newspapers, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of the Daily Mail is to pay more than £30m for a minority stake in rival right-leaning newspaper The Daily Telegraph as the latter's prospective owners assemble a consortium of strategic backers. Sky News has learnt that Lord Rothermere's Daily Mail and General Trust is to fork out just under £35m for a shareholding of about 10% in the Telegraph titles, implying an equity value of roughly £350m. Banking sources said that Goldman Sachs had been enlisted to provide advice to DMGT on the investment. A deal is expected to be struck imminently, according to insiders. RedBird Capital, the US-based investment firm, confirmed last week that it was exercising an option to take majority control of the newspapers, with Abu Dhabi state-backed vehicle IMI expected to acquire the maximum 15% stake permitted under proposed new media ownership rules. The government's decision to set the ownership threshold at 15% follows an intensive lobbying campaign by newspaper industry executives concerned that a permanent outright ban could cut off a vital source of funding to an already-embattled industry. However, it faces continued opposition from parliamentarians. Read more from Sky News:'Leicester is embargoed': City's clothing industry in crisisWater company hit with largest-ever fine issued by Ofwat Dovid Efune, owner of The New York Sun, is meanwhile continuing to assemble a rival bid for the Telegraph, having secured backing from Jeremy Hosking, the prominent City investor. RedBird IMI paid £600m in 2023 to acquire a call option that was intended to convert into ownership of the Telegraph newspapers and The Spectator magazine. That objective was thwarted by a change in media ownership laws - which banned any form of foreign state ownership. The Spectator was then sold last year for £100m to Sir Paul Marshall, the hedge fund billionaire, who has installed Lord Gove, the former cabinet minister, as its editor. DMGT did not respond to a request for comment."
    },
    {
        "title": "Heathrow chief's phone was on silent as power cut fire unfolded, inquiry reveals",
        "description": "Heathrow's chief executive could not be reached to tell him about the airport's closure after a power outage because his phone was on silent, an inquiry has revealed.",
        "url": "https://news.sky.com/story/heathrow-chiefs-phone-was-on-silent-as-power-cut-fire-unfolded-inquiry-reveals-13376071",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thomas-woldbye-heathrow_6929849.jpg?20250528193136",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-28 15:22:00",
        "Headline": "An internal review into the airport's disruptive closure earlier this year said that communication at the site could be improved but found that the decision to suspend operations was \"correctly made\".",
        "Content": "Heathrow's chief executive could not be reached to tell him about the airport's closure after a power outage because his phone was on silent, an inquiry has revealed. Thomas Woldbye was asleep when chief operating officer Javier Echave decided to suspend operations at 1.15am on 21 March after a fire at a substation in west London affected the supply of electricity to the site, it has emerged. The airport closed for around 16 hours, cancelling about 1,300 flights and causing travel chaos for nearly 300,000 passengers. Heathrow commissioned an inquiry into what happened, led by former transport secretary Ruth Kelly, who is an independent member on the airport's board. The inquiry's report, published on Wednesday, found that Mr Woldbye \"was not involved\" in the decision to suspend operations as he was unaware of several attempts to reach him due to his phone being on silent mode until 6.45am on 21 March. \"Although his phone was on his bedside table, Mr Woldbye reported that it did not alert him to the F24 alarms [to activate emergency procedures] or to Mr Echave's other calls because the phone had gone into a silent mode, without him being aware it had done so and he was asleep at the time,\" the report stated.  Mr Woldbye expressed \"his deep regret at not being contactable during the night of the incident\", according to the review. The inquiry recommended that Heathrow should consider having a \"second means of contact\" to notify key individuals about critical incidents. However, it also found that the decision to suspend operations was \"correctly made\" as it was \"essential to protect the safety and security of people, as well as the integrity of the airport and the UK border\". Ms Kelly said: \"The evidence confirms that Heathrow made the right decisions in exceptionally difficult circumstances. \"Whilst the disruption was significant, alternative choices on the day would not have materially changed the outcome. \"The airport had contingency plans in place, and the report highlights that further planned investment in energy resilience will be key to reducing the impact of any similar events in the future.\" But Nigel Wicking, the chief executive of Heathrow Airline Operators' Committee (AOC), described the report as \"back patting\" because it did not \"recognise the significant cost impact\" borne by airlines.  He told MPs on the Transport Select Committee he had warned Heathrow bosses the power supply was vulnerable less than a week before the outage. Heathrow AOC, which has more than 90 members including Virgin Atlantic and British Airways, criticised the handling of the closure, saying flights could have taken off earlier on Friday and that communication was \"appalling\". The inquiry found there \"may have been opportunities to open parts of the airport slightly sooner\" on 21 March but this \"likely would have been only by a maximum of a couple of hours or so\". It started accepting limited flight arrivals from 4pm and departures from 8pm that day. Mr Wicking told Sky News' business and economics reporter Sarah Taaffe-Maguire on Wednesday that the review did not help to better understand whether the airport had the resources it needed. Instead, he said he was looking to the full National Energy System Operator report, expected to be released by the end of June. Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record A spokesperson for the Heathrow Reimagined campaign group, whose supporters include British Airways's owner International Airlines Group and Virgin Atlantic, said: \"Lessons must be learnt from the closure of Heathrow during March's power outage, but the internal Kelly Review allows Heathrow to set and judge by its own standards. \"It fails to properly tackle the poor contingency planning and years of inefficient spending that left Heathrow vulnerable.\""
    },
    {
        "title": "Tens of thousands to get compensation over forced prepayment meters",
        "description": "People who had prepayment meters forcibly installed in their homes are in line for compensation of up to &#163;1,000 after energy companies signed up to pay &#163;18.6m in debt cancellation and customer payments.",
        "url": "https://news.sky.com/story/tens-of-thousands-to-get-compensation-over-forced-prepayment-meters-13375816",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-pre-payment-metre-becky-johnson_6033094.jpg?20230122220036",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-28 08:23:00",
        "Headline": "Millions in compensation and debt write-offs will be issued after energy regulator Ofgem's \"most wide-reaching\" investigation.",
        "Content": "People who had prepayment meters forcibly installed in their homes are in line for compensation of up to £1,000 after energy companies signed up to pay £18.6m in debt cancellation and customer payments. The announcement follows energy regulator Ofgem's review of companies forcibly entering the homes of indebted, vulnerable customers to fit prepay meters to prevent them accruing further arrears. Thousands of people were affected and are to receive the debt write-offs and, in some cases, payments from eight providers: Scottish Power, EDF, E.ON, Utility Warehouse, Good Energy, TruEnergy and Ecotricity. At least 40,000 customers are due to receive the awards following the completion of one of Ofgem's \"most wide-reaching reviews\", which included more than 150,000 cases where meters were forcibly and also remotely installed without the billpayers' permission. Energy providers will pay £5.6m in compensation for the involuntary installation and issues like poor record-keeping and data quality. These issues meant customers didn't get the support they needed. A further £13m of energy debt will be cancelled.  Ofgem had already provided £55m in financial support, such as hardship payments and arrears write-offs to affected consumers. There were only \"limited\" times - fewer than 1% of cases - when a prepayment meter was fitted under warrant when it wasn't safe or reasonably practicable to do so, the review found, during the assessment period of 1 January 2022 to 31 January 2023. Despite this, Ofgem said \"one case is too many\". Separate investigations into involuntary installations by British Gas, OVO and Utilita are still ongoing. \"This has been one of the most detailed reviews of supplier practices in Ofgem's history,\" its director general of markets Tim Jarvis said. \"Our review also found wider issues with the processes suppliers had in place, which is why we've put in place clearer, tougher rules to protect customers in vulnerable situations. \"We know that [prepayment meters] can be an effective tool in helping customers manage their costs and debt. \"However, customers must always be treated fairly and compassionately, and we are confident that the changes we have made are a significant step to ensure that happens.\" The forced installation practice was uncovered by The Times in February 2023. Rules around their fitting have since been enacted by Ofgem. Read more:'Leicester is embargoed': City's clothing industry in crisisWater company hit with largest-ever fine issued by Ofwat Households have been struggling with high energy costs, which skyrocketed following Russia's invasion of Ukraine. Energy Secretary Ed Miliband said: \"The government has campaigned tirelessly on this issue and are pleased to see the level of compensation increase to £18.6m, up from £420,000 under the previous government. \"Consumers must come first, which is why we are reforming the energy market to stamp out bad practice and make it easier to access proper redress when things go wrong, through our comprehensive review of Ofgem. \"This increased compensation package is a good start, and we will be announcing further reforms in the weeks ahead.\""
    },
    {
        "title": "'She's a goner': Dominic Cummings predicts timing of Kemi Badenoch's downfall",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a> ",
        "url": "https://news.sky.com/story/nigel-farage-could-definitely-become-pm-if-he-listens-to-me-dominic-cummings-says-13375541",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-dominic-cummings_6929288.jpg?20250528072417",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-05-28 04:00:00",
        "Headline": "Boris Johnson's former top aide - who played a key role in the 2016 Brexit campaign - also told Sky News he has advised Nigel Farage on how to become prime minister.",
        "Content": "\n          Political correspondent\n              @wizbates\n 👉 Listen to Sky News Daily on your podcast app 👈  Kemi Badenoch will be gone as Tory leader within a year - and there are plots already under way to oust her, Dominic Cummings has said. The former Number 10 aide also claimed the Conservative Party \"might be dead\". His remarks came in a wide-ranging interview with Sky News, in which the controversial figure, who served as Boris Johnson's chief adviser from 2019 to 2020, said Nigel Farage could \"definitely\" become the next prime minister. On Ms Badenoch, who won the Tory leadership race last November, Mr Cummings said: \"Kemi is going to go, probably this year. \"There's already people who are organising to get rid of her, and I think that that will work. If it doesn't work this year, it will definitely happen after next May. \"She's a goner, so there's going to be a big transition there.\"  In a damning indictment of the party he served, he said: \"It's quite possible the Tories have just, kind of, crossed the event horizon and actually aren't salvageable. \"Like, everyone sort of assumes that because they've always been around, then somehow there must be at least one last chance for them to turn things around, but it's possible that chance is in their past and doesn't exist. \"It might be dead.\"  Politics Hub: Follow live updates from Westminster Mr Cummings revealed he has held meetings with Mr Farage and advised him on how to go from \"one man and an iPhone\" to entering Downing Street. Asked if the Reform UK leader could be prime minister, he said: \"It could definitely happen now, yeah, because the old system's just so completely broken. \"If he does what I'm suggesting, and actually sets out a path for how Reform is going to change, how Reform is going to bring in people, how it's structurally going to alter, what it's going to build, how it is going to do policy, how it can recruit MPs, etc. \"If he does that, then there'll be a huge surge of interest and support into the whole thing.\"  'One man and an iPhone' He added: \"Reform has been a one-man band. It's been Nigel and an iPhone. \"They can win 50, 100, 150 seats with Reform as Nigel and an iPhone. \"But they can't win an overall general election and have a plan for government and have a serious team able to take over in Downing Street and govern and control Whitehall with one man and an iPhone.\" Read more from Sky News:Farage: Abortion law 'totally out of date'Ministers could scrap two-child benefit capIMF upgrades UK economic growth forecast However, the ex-Downing Street aide was also scathing about Mr Farage's personal appeal, saying it was his party, not him, that had become an outlet for anti-establishment feeling. \"It's not exactly correlated with what people think about Nigel himself,\" he said. \"Reform is a vehicle for people to say: 'We despise you, Westminster. We hate both the old parties, we hate Whitehall, we hate the old media, we hate the whole f***ing lot of you.' \"And Farage going up in the polls is the expression of that core feeling.\" Mr Cummings left his Downing Street role in November 2020 after attracting controversy during the coronavirus lockdown when he drove to Barnard Castle in County Durham and claimed he was testing his eyesight."
    },
    {
        "title": "Dua Lipa, Gary Lineker, and Benedict Cumberbatch join more than 300 figures urging PM to 'end UK complicity' in Gaza",
        "description": "Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza.",
        "url": "https://news.sky.com/story/dua-lipa-gary-lineker-and-benedict-cumberbatch-join-more-than-300-figures-urging-pm-to-end-uk-complicity-in-gaza-13376183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dua-lipa-gary-lineker_6929982.jpg?20250528235229",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-28 20:11:00",
        "Headline": "Famous names from the arts and media world have joined doctors, academics and a Holocaust survivor to urge Sir Keir Starmer to end arms sales.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza. In an open letter addressed to Sir Keir Starmer, seen exclusively by Sky News, famous names from the world of media and the arts have joined leading doctors, academics, campaign groups, and a Holocaust survivor. They have accused the British government of continuing to allow UK arms to be sold to Israel and to providing licences for arms. The letter, led by refugee charity Choose Love, demands an immediate suspension of all UK arms sales to Israel, immediate humanitarian access for experienced aid agencies, and urges the government to commit to brokering a ceasefire for \"the children of Gaza\". In September 2024, the UK suspended 30 arms licences from about 350 involved in items that go to Israel. Last week, Sir Keir joined the French and Canadian leaders to warn Israel they will take \"concrete actions\" if it continues an \"egregious\" expansion of military operations in Gaza. The PM also told MPs last week the level of suffering in Gaza, especially among innocent children, was \"intolerable\" and called Israel's decision to allow a small amount of aid in \"utterly inadequate\". The letter says: \"We urge you to take immediate action to end the UK's complicity in the horrors in Gaza.\" It says children in Gaza are starving while food and medicine \"sit just minutes away\" in reference to Israel's 11-week blockade of food and other supplies into Gaza, which was lifted last week. A new foundation backed by Israel and the US has set up an aid distribution site this week, but the UN has rejected the system as it says it cannot meet the needs of Gaza's 2.1 million people. The UN, which has warned the population is facing catastrophic levels of hunger, said it believes 47 people were injured on Tuesday when crowds overwhelmed the aid distribution centre, but Israel said its troops only fired \"warning shots\" into the air. Among the famous people to put their names to the letter are singers Dua Lipa, Annie Lennox, Paloma Faith, Massive Attack and Primal Scream. Actors include Benedict Cumberbatch, Riz Ahmed, Game of Thrones actress Lena Headey, Tilda Swinton, Maxine Peake, Marvel actress Zawe Ashton, Bridgerton actress Nicola Coughlan, and director Danny Boyle. TV stars include Dermot O'Leary, Gary Lineker, Chicken Shop Date creator Amelia Dimoldenberg, and presenter Laura Whitmore. Lineker finished his 26-year stint as Match of the Day presenter this week, after apologising for sharing a social media post from the Palestine Lobby group titled: \"Zionism explained in two minutes.\" The Instagram post was illustrated with a rat, which has been used to represent Jewish people in antisemitic propaganda - including Nazi Germany. Lineker \"apologised unreservedly\" for sharing it, saying he was unaware of the reference and it was a mistake. He maintained the importance of \"speaking out on humanitarian issues, including the tragedy unfolding in Gaza\".  Photographer and activist Misan Harriman, writer, model and activist Munroe Bergdorf, artist Tracey Emin and model Lily Cole have also signed the letter. Holocaust survivor Stephen Kapos has signed the letter, which says 71,000 children under four years old are \"acutely malnourished\" and they \"cry until they can't cry anymore - until hunger takes even their voices\". It says they wake up to bombs falling on them, \"violence stamped with UK inaction - flown with parts shipped from British factories to Israel\".  The letter warns Sir Keir: \"You can't call it 'intolerable', yet do nothing. \"The world is watching and history will not forget. The children of Gaza cannot wait another minute. \"Prime minister, what will you choose? Complicity in war crimes, or the courage to act?\" The letter comes just days after 828 UK-based or qualified legal experts, among them former Supreme Court justices, signed a letter to Sir Keir warning \"genocide is being perpetrated in Gaza\". Israel has repeatedly denied that it is committing genocide in Gaza. A government spokesperson said: \"We strongly oppose the expansion of military operations in Gaza and call on the Israeli Government to cease its offensive and immediately allow for unfettered access to humanitarian aid. \"The denial of essential humanitarian assistance to the civilian population in Gaza is unacceptable and risks breaching International Humanitarian Law. \"Last year, we suspended export licences to Israel for items used in military operations in Gaza and continue to refuse licences for military goods that could be used by Israel in the current conflict. \"We urge all parties to urgently agree a ceasefire agreement and work towards a permanent and sustainable peace.\""
    },
    {
        "title": "Dominic Cummings: If Farage listens to me, he'll be the next PM ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>     ",
        "url": "https://news.sky.com/story/dominic-cummings-if-farage-listens-to-me-hell-be-the-next-pm-13376043",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-daily-podcast-dominic-cummings_6929698.png?20250528150951",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-28 14:06:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  Nigel Farage could \"definitely\" become prime minister at the next general election. That's according to Dominic Cummings, Boris Johnson's former chief advisor, who says he has held meetings with the Reform UK leader and advised him on how to go from \"one man and an iPhone\" to holding the keys to Downing Street. On the Sky News Daily, Liz Bates speaks to Mr Cummings about the current state of British politics, why the public feels let down, and who Mr Farage needs to recruit if he wants to be the next prime minister. Warning: This podcast contains strong language."
    },
    {
        "title": "Arctic warming 3.5 times faster than rest of world - as security threats to UK 'fundamentally changing'",
        "description": "The Arctic is warming 3.5 times faster than the global average, scientists have warned, raising new security threats for the UK.",
        "url": "https://news.sky.com/story/arctic-warming-35-times-faster-than-rest-of-world-as-security-threats-to-uk-fundamentally-changing-13375508",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-climate-arctic-teaser_6929182.jpg?20250527221139",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-05-28 04:00:00",
        "Headline": "The rapidly melting Arctic is opening up an unspoilt region to shipping, military and oil and minerals activity, experts have warned - as Foreign Secretary David Lammy tours the region to assess changing security threats.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The Arctic is warming 3.5 times faster than the global average, scientists have warned, raising new security threats for the UK. Melting Arctic ice is opening up more routes for shipping and military vessels, and the potential to drill for new reserves of gas, oil and natural minerals in an otherwise virtually unspoilt ecosystem. The continent has long been warming faster than the rest of the world. As the sea ice disappears, its white surface that reflects sunlight gives way to darker ocean underneath that absorbs the heat instead. Today the United Nations' World Meteorological Organisation (WMO) warned the Arctic is on course to warm 3.5 times faster than the rest of the world over the next five years, making it at least 2.4C warmer than the recent average. It comes as the UK's Foreign Secretary David Lammy tours the region to assess threats from Russia and climate change, calling it an \"increasingly important frontier for geopolitical competition and trade\". On Tuesday he announced new UK funding to work with Iceland on monitoring Arctic waters, for AI to detect hostile state activity and for research on the impact on the UK. \n                  SpaceX Starship rocket spins out of control on test flight, marking third failure in a row\n                 \n                  What Starship failure means for Elon Musk's Mars plans\n                 \n                  NHS trusts' data 'stolen' in cyberattack\n                 Arctic melt is expected to push up sea levels around Britain's coastline and fuel worse coastal flooding. It will shift the jet stream, disrupting the UK's weather system in ways not yet fully understood. Read more: Melting Arctic ice caps helps predict UK heatwaves Security threat 'fundamentally changed' Klaus Dodds, geopolitics professor at Royal Holloway, said less sea ice in the Arctic will likely attract \"heightened commercial and military activity by third parties that are not allies of the UK, primarily Russia and China\". He said the UK should prepare to operate in the region without the US as a reliable ally, while Russia will \"continue to target critical infrastructure in the North Atlantic and European Arctic - all of which maybe ever more accessible\". Ed Arnold from security thinktank RUSI said further melt will mean \"that the Russians would have more control over [the Northern Sea Route]\" via which ships can access waters around Britain. The security threat is changing \"pretty fundamentally\" as vessels can more easily travel through the Arctic to waters containing gas pipelines or data cables supplying Europe, he added.  'Shocking, but not shocking' The WMO report also warned a dangerous new warming threshold was on the horizon for the first time. Ten years ago, under the landmark Paris Agreement, world leaders promised to try to limit warming to no more than 2C above pre-industrial levels, and ideally stick to 1.5C. At the time, both those thresholds felt a long way off. But just 10 years later, today's report forecasts for the first time ever a chance of breaching 2C of warming at some point in the next five years. The chances are \"exceptionally unlikely\", probably no more than 1%, said Prof Adam Scaife from the Met Office Hadley Centre, who worked on the report. But such a forecast would have been \"effectively impossible\" just a few years ago, in a sign of how quickly the climate is changing. Prof Scaife added: \"It is shocking in that sense that two degrees is possible. However, it's not shocking [because]… we thought it might be plausible at this stage, and indeed it is.\" And unless something changes dramatically, 2C will become increasingly likely, increasingly soon, the authors warned, driving more extreme weather and migration as homelands become unliveable. The WMO also warned temperatures are likely to again hit 1.5C above pre-industrial levels over the next five years - after doing so temporarily in 2024."
    },
    {
        "title": "What Starship failure means for Elon Musk's Mars plans",
        "description": "Elon Musk's plans to go to Mars may not have come crashing down to Earth but they've certainly suffered a significant setback.",
        "url": "https://news.sky.com/story/what-starship-failure-means-for-elon-musks-mars-plans-13375824",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-spacex-space-x_6929550.jpg?20250528121532",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-05-28 08:42:00",
        "Headline": "Musk has a reputation for over-promising on timings but ultimately delivering era-defining technology - but is this an early sign he has finally reached too far?",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Elon Musk's plans to go to Mars may not have come crashing down to Earth but they've certainly suffered a significant setback. The ninth test flight of Starship, the SpaceX spacecraft specifically designed to make \"humans an interplanetary species\", ended with it spinning out of control over the Indian Ocean. This was Starship's third consecutive failure. The machine that was touted as taking humans as far as Mars as soon as 2028 has yet to make an orbit of Earth. Musk's near-term Mars plans look even more like science fiction. No surprise then that a much-trailed update from Musk laying out the detail of his Mars programme scheduled to coincide with the test flight was cancelled. He posted shortly after the test, as he typically does, about how much had been learned from the test flight and how the programme would ramp up from now on. Musk's \"fail fast\" approach to rocket development has been central to SpaceX becoming, by a large margin, the most successful space launch business in history. Whether it's electric cars or rockets, Musk has a reputation for over-promising on timings but ultimately delivering era-defining technology. But is this an early sign that when it comes to Starship, he has finally reached too far? As well as trying to overcome two spectacular failures of Starship in tests earlier this year, it was the first attempt to fly a reused Super Heavy booster. Recycling rockets is what has allowed SpaceX to dominate the launch business with its Falcon 9 and Falcon Heavy machines. It's also essential for the commercial viability of the Starship system. The reconditioned booster performed almost perfectly, in that it delivered Starship to space. But it exploded while conducting its \"landing burn\" - not the outcome engineers trying to demonstrate reusability would have wanted. Read more tech news:'I've been turned into an AI train announcer'How long before the UK is launching rockets?Mum allowed to sue chatbot firm Aside from helping Donald Trump deliver on a promise to put Americans on Mars during his presidency, Musk's plans for Mars are largely a personal project. But this latest failure may have a wider impact on Musk's fortunes. Investors were left panicking after Musk's chainsaw-wielding, questionable hand-gesturing detour into US politics. Has his time away from his electric car, space, robotics and AI companies harmed their performance? And while Starship is an experimental programme, very separate from the successful Falcon launch business, is it a viable design and, even if it is, how much of a drain will its fraught testing programme be on the wider company? SpaceX and Starship are central to NASA's plans to put Americans back on the moon as soon as 2030. The fact Starship has yet to orbit Earth, let alone land back on it again, means the US space agency must look more seriously to Musk's competitors like Amazon founder Jeff Bezos's Blue Origin space business to step up. Musk also wants to use Starship's heavy-lifting capability to win major defence contracts like Trump's \"golden dome\" missile defence shield. It would be a bold investor who would bet against Musk's ability to ultimately bend technology to his will. But even the world's richest man can't change time, or the laws of physics, to suit his ambitions."
    },
    {
        "title": "Neanderthals may have made art just like modern humans, say researchers",
        "description": "Neanderthals may have made art just like modern humans do, researchers in Spain have said.",
        "url": "https://news.sky.com/story/neanderthals-may-have-made-art-just-like-modern-humans-say-researchers-13375980",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-neanderthal-humans_6929639.jpg?20250528135147",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-28 12:23:00",
        "Headline": "Close examination of a pebble excavated in central Spain suggests it may have been painted to look like a face tens of thousands of years ago.",
        "Content": "Neanderthals may have made art just like modern humans do, researchers in Spain have said. The findings, published in the Archaeological and Anthropological Sciences journal, challenge existing assumptions that art began with homo sapiens. Researchers said a pebble excavated from central Spain in 2022 seemed to have been made to look like a face by having a painted dot where a nose would be – suggesting it may be an early artwork. \"It has gradually been determined that the origin of symbolic behaviour and apparently also of art was not exclusive to modern humans but can also be attributed to Neanderthals,\" the researchers said. \"From the outset, we could tell it was peculiar,\" David Alvarez-Alonso, lead author on the paper, told Sky News' US partner NBC News. The pebble dates back between 42,000 and 43,000 years and was found in the San Lazaro rock shelter in modern-day Segovia. It was thought to have been deliberately brought to the shelter and found in a space where humans lived. The red dot was confirmed by Spain's forensic police to be a fingerprint, offering another level to the discovery, as it is one of the most complete Neanderthal fingerprints identified to date. Read more from Sky News:UK has sunniest ever springWater company hit with record fineNHS trusts' data 'stolen' in cyberattack \"This pebble could thus represent one of the oldest known abstractions of a human face in the prehistoric record,\" the researchers said. They added: \"The pebble was selected because of its appearance and then marked with ochre [showing] that there was a human mind capable of symbolising, imagining, idealising and projecting his or her thoughts on an object... in creating art.\" Neanderthals were a distinct species of early humans that went extinct around 40,000 years ago but lived alongside modern humans in Europe, Asia and the Middle East."
    },
    {
        "title": "Dua Lipa, Gary Lineker, and Benedict Cumberbatch join more than 300 figures urging PM to 'end UK complicity' in Gaza",
        "description": "Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza.",
        "url": "https://news.sky.com/story/dua-lipa-gary-lineker-and-benedict-cumberbatch-join-more-than-300-figures-urging-pm-to-end-uk-complicity-in-gaza-13376183",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dua-lipa-gary-lineker_6929982.jpg?20250528235229",
        "type": "Entertainment",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-28 20:11:00",
        "Headline": "Famous names from the arts and media world have joined doctors, academics and a Holocaust survivor to urge Sir Keir Starmer to end arms sales.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Benedict Cumberbatch, Annie Lennox, Gary Lineker and Dua Lipa have joined more than 300 public figures calling on the prime minister to \"end the UK's complicity\" in Gaza. In an open letter addressed to Sir Keir Starmer, seen exclusively by Sky News, famous names from the world of media and the arts have joined leading doctors, academics, campaign groups, and a Holocaust survivor. They have accused the British government of continuing to allow UK arms to be sold to Israel and to providing licences for arms. The letter, led by refugee charity Choose Love, demands an immediate suspension of all UK arms sales to Israel, immediate humanitarian access for experienced aid agencies, and urges the government to commit to brokering a ceasefire for \"the children of Gaza\". In September 2024, the UK suspended 30 arms licences from about 350 involved in items that go to Israel. Last week, Sir Keir joined the French and Canadian leaders to warn Israel they will take \"concrete actions\" if it continues an \"egregious\" expansion of military operations in Gaza. The PM also told MPs last week the level of suffering in Gaza, especially among innocent children, was \"intolerable\" and called Israel's decision to allow a small amount of aid in \"utterly inadequate\". The letter says: \"We urge you to take immediate action to end the UK's complicity in the horrors in Gaza.\" It says children in Gaza are starving while food and medicine \"sit just minutes away\" in reference to Israel's 11-week blockade of food and other supplies into Gaza, which was lifted last week. A new foundation backed by Israel and the US has set up an aid distribution site this week, but the UN has rejected the system as it says it cannot meet the needs of Gaza's 2.1 million people. The UN, which has warned the population is facing catastrophic levels of hunger, said it believes 47 people were injured on Tuesday when crowds overwhelmed the aid distribution centre, but Israel said its troops only fired \"warning shots\" into the air. Among the famous people to put their names to the letter are singers Dua Lipa, Annie Lennox, Paloma Faith, Massive Attack and Primal Scream. Actors include Benedict Cumberbatch, Riz Ahmed, Game of Thrones actress Lena Headey, Tilda Swinton, Maxine Peake, Marvel actress Zawe Ashton, Bridgerton actress Nicola Coughlan, and director Danny Boyle. TV stars include Dermot O'Leary, Gary Lineker, Chicken Shop Date creator Amelia Dimoldenberg, and presenter Laura Whitmore. Lineker finished his 26-year stint as Match of the Day presenter this week, after apologising for sharing a social media post from the Palestine Lobby group titled: \"Zionism explained in two minutes.\" The Instagram post was illustrated with a rat, which has been used to represent Jewish people in antisemitic propaganda - including Nazi Germany. Lineker \"apologised unreservedly\" for sharing it, saying he was unaware of the reference and it was a mistake. He maintained the importance of \"speaking out on humanitarian issues, including the tragedy unfolding in Gaza\".  Photographer and activist Misan Harriman, writer, model and activist Munroe Bergdorf, artist Tracey Emin and model Lily Cole have also signed the letter. Holocaust survivor Stephen Kapos has signed the letter, which says 71,000 children under four years old are \"acutely malnourished\" and they \"cry until they can't cry anymore - until hunger takes even their voices\". It says they wake up to bombs falling on them, \"violence stamped with UK inaction - flown with parts shipped from British factories to Israel\".  The letter warns Sir Keir: \"You can't call it 'intolerable', yet do nothing. \"The world is watching and history will not forget. The children of Gaza cannot wait another minute. \"Prime minister, what will you choose? Complicity in war crimes, or the courage to act?\" The letter comes just days after 828 UK-based or qualified legal experts, among them former Supreme Court justices, signed a letter to Sir Keir warning \"genocide is being perpetrated in Gaza\". Israel has repeatedly denied that it is committing genocide in Gaza. A government spokesperson said: \"We strongly oppose the expansion of military operations in Gaza and call on the Israeli Government to cease its offensive and immediately allow for unfettered access to humanitarian aid. \"The denial of essential humanitarian assistance to the civilian population in Gaza is unacceptable and risks breaching International Humanitarian Law. \"Last year, we suspended export licences to Israel for items used in military operations in Gaza and continue to refuse licences for military goods that could be used by Israel in the current conflict. \"We urge all parties to urgently agree a ceasefire agreement and work towards a permanent and sustainable peace.\""
    },
    {
        "title": "Sean 'Diddy' Combs's ex Cassie gives birth two weeks after testifying against him – as his bid for mistrial is dismissed",
        "description": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him &#8211; as his legal team failed in a bid to declare a mistrial.",
        "url": "https://news.sky.com/story/sean-diddy-combss-ex-cassie-gives-birth-two-weeks-after-testifying-against-him-8211-as-his-bid-for-mistrial-is-dismissed-13376112",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-diddy_6918508.jpg?20250516164535",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-28 17:05:00",
        "Headline": "Cassie Ventura, 38, has welcomed her third child with partner Alex Fine, her friend Deonte Nash told a court on Wednesday.",
        "Content": "Sean 'Diddy' Combs's ex-partner has given birth two weeks after testifying against him – as his legal team failed in a bid to declare a mistrial. Cassie Ventura gave birth to her third child with partner Alex Fine after going into labour on Tuesday, a close source told Sky's US partner network NBC News on Wednesday. The news was later confirmed by her friend and former stylist Deonte Nash, who told Diddy's trial that he last spoke to her \"after she had the baby yesterday [Tuesday]\". Diddy trial day eleven – as it happened Combs, 55, is accused of two counts of sex trafficking by force, fraud, or coercion, two counts of transportation to engage in prostitution, and one of conspiring to racketeer. He denies all the charges. Cassie had given evidence while she was more than eight months pregnant. The 38-year-old told the trial that Diddy subjected her to physical, sexual and mental abuse for much of their 11-year relationship. She alleged he forced her into \"hundreds\" of drug-fuelled sex sessions with male escorts while he watched, which he referred to as \"freak offs\". News of the birth came on the same day Combs's legal team tried in vain to get the judge to declare a mistrial. Alexandra Shapiro, one of Diddy's attorneys, moved for the mistrial just before the court broke for lunch, during evidence by Los Angeles Fire Department (LAFD) arson investigator Lance Jiminez. According to Ms Shapiro, Mr Jiminez's claim that police destroyed fingerprint evidence collected at the scene of an alleged 2012 Molotov cocktail attack on rapper Kid Cudi's car would lead the jury to believe Combs had something to do with it. She accused the prosecution of \"misconduct\" and claimed their questioning of Mr Jiminez was \"designed to play into that\" narrative. Another of Diddy's defence lawyers Marc Agnifilo described the prosecution's conduct as \"outrageous\". However, prosecution attorney Christy Slavik hit back by saying a mistrial was \"completely unwarranted\". She insisted questions about the destruction of evidence were asked to highlight the poor quality of the police investigation. Judge Arun Subramanian dismissed the motion and instead told jurors to disregard any reference to the fingerprints. Earlier on Wednesday, Los Angeles Police Department (LAPD) officer Chris Ignacio detailed the alleged break-in at Kid Cudi's home in December 2011. He was called to the scene and noticed a Cadillac Escalade parked in front of the property, the number plate for which later transpired to be registered to Bad Boy Productions, Diddy's record label. During his evidence, Cudi alleged it was Diddy who was behind the break-in. Mr Jiminez then testified about an alleged Molotov cocktail attack on Cudi's car the following month. Having investigated the incident, he concluded it was \"not a random act\" and that the makeshift firebomb had been placed there deliberately, in line with Cudi's claims. When Diddy and Cassie's former stylist Mr Nash took to the stand, he detailed several incidents of alleged violence inflicted on the singer by her then partner. On one occasion, Diddy turned up at her LA flat, \"grabbed her by the hair\", \"kicked her\" and \"hit her pretty hard\", he claimed. When she hit her head on a bed frame, she suffered a gash to her forehead and eyebrow, he said. Both he and Mia, a second alleged witness, jumped on the rapper's back to get him to stop, he told the court. Following another incident when Diddy demanded to see Cassie, she threatened to \"go over the balcony\", Mr Nash told the jury. Diddy was violent towards him too, he said, once choking him against a car and threatening him not to go out with Cassie and without him. Despite all this, Mr Nash said he \"doesn't hate\" Diddy – and that he had been compelled to give evidence as part of a subpoena. Mia, which is a pseudonym used to protect her identity, was due to start her evidence on Wednesday but Mr Nash's testimony overran. He will resume giving evidence on Thursday, with Mia's evidence due to last until the court breaks for the weekend. The trial continues."
    },
    {
        "title": "Kneecap 'removed' from performing at TRNSMT music festival amid police 'safety concerns'",
        "description": "Kneecap say they have been \"removed\" from playing at a music festival in Scotland this July.",
        "url": "https://news.sky.com/story/kneecap-removed-from-performing-at-trnsmt-music-festival-amid-police-safety-concerns-13376139",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250522091425",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-28 18:04:00",
        "Headline": "Kneecap said they will instead play their own solo headline show at the 02 Academy in Glasgow three days before TRNSMT.",
        "Content": "Kneecap say they have been \"removed\" from playing at a music festival in Scotland this July. It comes after the organisers of TRNSMT said the group, made up of Liam Og O hAnnaidh, Naoise O Caireallain, and JJ O Dochartaigh, will \"no longer perform\" at the event following \"safety concerns\" raised by the police. Last Wednesday, the Metropolitan Police said O hAnnaidh, who performs under the stage name Mo Chara, was charged with a terror offence over the alleged display of a Hezbollah flag at a gig in Kentish Town, north London, in November 2024. The hip hop trio from Belfast had been due to perform at the Glasgow festival on Friday, 11 July. However, in a statement posted on social media, the rappers said they will instead play their own solo headline show at the 02 Academy in the Scottish city three days before TRNSMT. The Irish language group said: \"To the thousands of people who bought tickets, flights and hotels to see us play, we are sorry...it is out of our hands. Glasgow has always been a huge city for us. \"We've played there many, many times, with no issues - ever. Make of that what you will. \"To try to make up for it, we will be at your O2 Academy on Tuesday, 8 July.\" They also quoted a statement from TRNSMT, which a festival spokeswoman confirmed via email, saying: \"Due to concerns expressed by the police about safety at the event, Kneecap will no longer perform at TRNSMT on Friday, 11 July. \"We thank fans for their understanding.\" Later on Wednesday, the group shared a news story on X which said they had \"pulled out\" and added: \"Kneecap didn't 'pull out' of TRNSMT - Kneecap were removed.\" What have the police said? A Police Scotland spokesman said: \"Any decision on the line-up at TRNSMT is for the organisers and there was no prior consultation with Police Scotland before acts were booked. \"Officers have highlighted the potential reaction of such a large audience to this band would require a significant policing operation in order to support the delivery of a safe event. \"We have also passed on information from the public around safety concerns to allow organisers to make an informed decision on the running of the festival.\" Kneecap member faces terror charge Last week, the Metropolitan Police charged O hAnnaidh, 27, with displaying a flag in support of Hezbollah. Hezbollah, an Islamist militant group based in Lebanon, is a proscribed terror organisation in the UK. He is due to appear at Westminster Magistrates' Court on 18 June. Kneecap release new song On Friday, Kneecap shared a link to their new song The Recap - which opens with Sky News presenter Wilfred Frost reporting about the counter terror police investigation - on Instagram, linking to their WhatsApp channel. Last year, Kneecap won a discrimination case against the UK government in Belfast High Court after former business secretary Kemi Badenoch tried to refuse them a £14,250 funding award when she was a minister. Ms Badenoch, who is now leader of the Conservative Party, has called for Kneecap to be banned and suggested they should be dropped from the Glastonbury Festival line-up. Some other politicians have made the same demand. The new track mocks Ms Badenoch's attempts to block their arts funding and the Conservative Party's election loss. It features DJ Mozey."
    },
    {
        "title": "Paul Danan: Former Hollyoaks actor died by misadventure after taking cocktail of drugs, coroner rules",
        "description": "Former Hollyoaks star Paul Danan died by misadventure after taking a cocktail of drugs, a coroner has ruled.",
        "url": "https://news.sky.com/story/hollyoaks-actor-paul-danan-died-by-misadventure-after-taking-cocktail-of-drugs-coroner-rules-13375978",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-danan-hollyoaks_6929618.jpg?20250528145311",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-28 12:16:00",
        "Headline": "A post-mortem examination concluded the actor's death was due to the combined toxicity of heroin, methadone, codeine, pregabalin, cocaine and zopiclone, contributed to by benzodiazepine use.",
        "Content": "Former Hollyoaks star Paul Danan died by misadventure after taking a cocktail of drugs, a coroner has ruled. The 46-year-old played Sol Patrick on the Channel 4 soap from 1997 to 2001 and was later known for his reality TV appearances on Celebrity Big Brother and Celebrity Love Island. An inquest into Danan's death was told he was found unresponsive and slumped on his sofa in front of the TV at his home in Brislington, Bristol, on 15 January. Emergency services attended and confirmed he had died, with his body being identified at the scene by his partner Melissa Crooks. A post-mortem examination concluded his death was due to the combined toxicity of heroin, methadone, codeine, pregabalin, cocaine and zopiclone, contributed to by benzodiazepine use. Assistant Coroner Debbie Rookes reached the conclusion Danan had died by misadventure after hearing written statements from emergency services doctors and his mother Beverley Danan. In a statement, Mrs Danan said: \"Paul helped so many people from all walks of life but just couldn't help himself in the same way. \"His smiling face and love of life will always be remembered.\" Ms Rookes concluded Danan had died from the combined effects of prescribed and illicit drugs. She told the hearing at Avon Coroner's Court in Flax Bourton, near Bristol, that there was no evidence Danan, who suffered an accidental overdose in May 2024, had intended to take his own life. A previous hearing was told Danan did not leave a note. Read more from Sky News:New footage of Liverpool collisionCummings says Badenoch will be oustedUK has sunniest spring on record The coroner said: \"Paul Danan was clearly much loved and is very much missed. \"Mr Danan had a long history of drug misuse and struggles with his mental health. His death was caused by a combination of drugs, both prescription and illicit. \"Paul had struggled with his mental health for many years. He had taken an overdose in May 2024 but he was adamant that this was accidental and he didn't have any intention to end his life. \"Although he had occasional suicidal thoughts, he didn't have any active plans. I don't have any evidence before me that Paul intended to take his own life at this time. \"Therefore, the conclusion is misadventure.\" The coroner said none of the drugs Danan had taken were found in high levels but their combined effect resulted in \"fatal respiratory depression\". Danan had previously spoken about his struggles with addiction and going into rehab. The actor had been due to appear for a plea hearing at Warrington Magistrates' Court on 16 January after being charged with possession of cocaine and cannabis, according to court documents. He was also accused of driving while under the influence of drugs in Warrington, Cheshire, on 2 October last year."
    }
]