[
    {
        "title": "Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms",
        "description": "Home Secretary Shabana Mahmood plans to impose Trump-style visa bans&#160;on three African countries&#160;if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system.",
        "url": "https://news.sky.com/story/home-secretary-to-announce-largest-shake-up-of-uk-immigration-in-modern-times-13471410",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-channel-crossings_7083692.jpg?20251116231759",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 22:44:00",
        "Headline": "Shabana Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War.",
        "Content": " Home Secretary Shabana Mahmood plans to impose Trump-style visa bans on three African countries if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system. Angola, Namibia and the Democratic Republic of Congo will face visa sanctions, blocking their tourists, VIPs and business people from travelling to Britain if they do not improve co-operation on removals. Ms Mahmood said: \"In Britain, we play by the rules. When I said there would be penalties for countries that do not take back criminals and illegal immigrants, I meant it. \"My message to foreign governments today is clear: accept the return of your citizens or lose the privilege of entering our country.\" The move was reportedly inspired by President Trump's homeland security secretary, Kristi Noem, who has overseen the mass deportation policy in the US, according to the Times. Ms Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War. Modelled on the Danish system, the aim of the reforms is to make the UK less attractive for illegal immigrants and make it easier to deport them. \n                  Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 Under the plans, she will bring forward a bill to change how article 8 of the European Convention on Human Rights (ECHR), the right to family life, is applied in migration court cases. Read more:Shabana Mahmood is the new hard woman of British politicsHere's how the Danish migration model works That's as the Home Office claimed it had seen a rise in the use of rights-based appeals in recent years as a means of avoiding deportation. The changes would see only those with immediate family in the UK, such as a parent or child, being able to use article 8 as grounds to stay in future.  The home secretary, who has been in the job for 73 days, also plans to change the law so that multiple attempts to appeal against refusals for asylum will no longer be allowed. Furthermore, refugees will face a 20-year wait before they can apply for permanent settlement as part of the government's plans. The Home Office said the \"golden ticket\" deal has seen asylum claims surge in the UK, drawing people across Europe, through safe countries, on to dangerous small boats. Political correspondent We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises. The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. Read more Under the proposals, refugee status will become temporary and subject to regular review, with refugees removed once their home countries are deemed safe. Housing and weekly allowances will no longer be guaranteed for asylum seekers.  But the shake-up will also see the introduction of safe and legal routes to the UK in a bid to cut dangerous journeys in small boats across the Channel. A new independent body - similar to one in operation in Denmark - will be set up to fast-track the removal of dangerous criminals, and last-minute appeals will be expedited. Ms Mahmood has denied that her plans to clamp down on illegal immigration are \"racist\" - instead describing them as a \"moral mission\". She said illegal immigration was causing \"huge divides\" in the UK, and added: \"I do believe we need to act if we are to retain public consent for having an asylum system at all.\"  Speaking on Sunday Morning with Trevor Phillips, Ms Mahmood said she had observed how illegal migration had been \"creating division across our country\". She added: \"I can see that it is polarising communities across the country. I can see that it is dividing people and making them estranged from one another. I don't want to stand back and watch that happen in my country.\" Prime Minister Sir Keir Starmer said: \"Britain has always been a fair, tolerant and compassionate country - and this government will always defend those values. \"But in a more volatile world, people need to know our borders are secure and rules are enforced. These reforms will block endless appeals, stop last-minute claims and scale up removals of those with no right to be here.\"  Conservative Party leader Kemi Badenoch welcomed Ms Mahmood \"finally talking seriously about tackling illegal immigration\", but described the home secretary's proposed plans as \"a few weak changes\". She said: \"If the home secretary actually wants to cut illegal immigration, she should take up my offer to sit down with her and work on a plan that will actually stop the boats, rather than a few weak changes that will meet the approval of Labour MPs.\" Speaking earlier on Sunday, Reform UK leader Nigel Farage said: \"The home secretary sounds like a Reform supporter.\" \"Sadly with the Human Rights Act and ECHR membership, the changes won't survive the courts or probably even her own backbenchers,\" he added. Latest Home Office figures show 39,075 people have arrived in the UK after crossing the English Channel in small boats so far this year. The arrivals have already passed the number for the whole of 2024 (36,816) and 2023 (29,437), but the number is below the total for 2022 (45,774)."
    },
    {
        "title": "Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer",
        "description": "We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\".",
        "url": "https://news.sky.com/story/shabana-mahmood-is-the-new-hard-woman-of-british-politics-and-potential-successor-to-starmer-13471232",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-crossings-asylum-seekers_7083695.jpg?20251116234532",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-16 13:58:00",
        "Headline": "In a warning to Labour MPs who will be uncomfortable with her approach, Ms Mahmood has warned it is \"the last chance for decent, moderate politics\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n  We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Politics latest: Mahmood dismisses 'tittle-tattle' over leadership rumours Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises.  The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. \n                  Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 But speaking to Sir Trevor Phillips on Sky News, Ms Mahmood firmly hit back at suggestions today's announcements are pandering to a racist narrative from the far right. \"It's not right-wing talking points or fake news or misinformation that is suggesting that we've got a problem,\" she said. \"I know, because I have now seen this system inside out. It is a broken system. We have a genuine problem to fix. People are angry about something that is real.  \"It is my job, therefore, to think of a proper solution to this very real problem, to do so in line with my values as a Labour politician, but also as a British citizen, and to have solutions that work so that I can unite a divided country.\" There are many striking elements to this. While she's not been in the job for all that long, her government has been in power for 16 months. Her own press release highlights that over the past full calendar year asylum claims here have gone up by 18% - compared with a drop of 13% elsewhere in the EU. The UK, she argues, has become a \"golden ticket\" for asylum seekers due to \"far more generous terms\" than other countries in Europe. While she politely insists that her predecessor's policies - the one in one out deal with France, closer partnership with law enforcement across Europe - are beginning to take effect, the message is clear. No one in office before Shabana has had the stomach to grasp the nettle.  The Home Office is determined to present their boss as the new hard woman of British politics. In a bleak warning to those in her party who will be deeply uncomfortable with this unflinching approach, we're told she believes this is \"the last chance for decent, moderate politics\". \"If these moderate forces fail, something darker will follow…. if you don't like this, you won't like what follows me.\" That's a clear reference to the anti-asylum policies of Reform and the Conservatives, who are pledging to leave the European Convention on Human Rights and deport all illegal arrivals. Both parties have responded by effectively claiming they don't trust Labour to deliver on this, given they believe the government has lost control of our borders and overseen a surge in asylum claims. That much Ms Mahmood herself has already acknowledged. It's unusual to hear a Conservative shadow minister like Chris Philp responding to a government announcement by claiming they will support the \"sensible steps\" the Home Office is making. Unsurprisingly, he went on to belittle her ideas as \"very small steps\" combined with \"gimmicks\" - but the main thrust of his critique was that Labour lacks the authority to push these kinds of measures through parliament, given the likely opposition from their own left wingers. It's a fair point - but the lack of fundamental disagreement highlights the threat these plans pose to her opponents. If the government looks like it might actually succeed in bringing down the numbers - and of course that's a colossal if - Ms Mahmood will effectively have outflanked and neutralised much of the threat from both the Tories and Reform. That's why she's so keen to mention her Danish inspiration - a centre-left government which managed to see off the threat from right-wing parties through its tough approach to migration, without having to leave the ECHR. Read more:Migrants shopping for life jackets: Inside the route to the ChannelHere's how the Danish migration model works The Home Office is planning further announcements on new safe and legal routes. But refugee charities have described the new measures as harsh, claiming they will scapegoat genuine refugees, fail to integrate them into society, and fail to function as a deterrent either. There will surely be an almighty internal row among Labour MPs about the principle of ripping up the post-war settlement for refugees. For a government floundering after the political chaos of the last few weeks and months, Ms Mahmood is a voice of certainty and confidence. At a moment of such intense backroom debate over the party's future direction, it's hard to avoid seeing her performance this weekend as a starting pitch for the leadership."
    },
    {
        "title": "Three men and two women in their 20s have died in car crash in Co Louth, Irish police say",
        "description": "Three men and two women died in a \"shocking\" and \"devastating\" road crash involving two cars in Co Louth on Saturday night, Irish police said.",
        "url": "https://news.sky.com/story/three-men-and-two-women-in-their-20s-have-died-in-car-crash-in-co-louth-irish-police-say-13471168",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ireland-louth-dundalk_7083704.jpg?20251117020649",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 10:42:00",
        "Headline": "The five victims had been in the same vehicle, a Volkswagen Golf, which was in a collision with a Toyota Land Cruiser.",
        "Content": " Three men and two women died in a \"shocking\" and \"devastating\" road crash involving two cars in Co Louth on Saturday night, Irish police said. The victims were Chloe McGee, 23, and Shay Duffy, 21, both from Carrickmacross in Co Monaghan; Alan McCluskey, 23, from Drumconrath in Co Meath; and Dylan Commins, 23, from Ardee in Co Louth, and Chloe Hipson, 21, from Lanarkshire in Scotland. The collision happened on the L3168 in Gibstown, Dundalk, shortly after 9pm. The five were travelling together in a Volkswagen Golf while on their way to Dundalk for a night out, police believe. They were pronounced dead at the scene. Another man, also in his 20s, was \"removed\" from the car and taken to Our Lady of Lourdes Hospital in Drogheda, where he was treated for \"serious non-life-threatening injuries\", said Superintendent Charlie Armstrong. The Golf was in a collision with a Toyota Land Cruiser. A man and a woman in the second vehicle were also taken to the same hospital. Their injuries are described as \"non-life-threatening\". Praise for emergency response Superintendent Armstrong said an investigation into the road crash was under way, as he praised the emergency services. He said: \"The scene was very difficult, in adverse weather conditions, and the professionalism shown by all first responders and the care and respect shown to the five deceased was exemplary.\" \"This is a shocking, devastating event for these families, their communities and the community here in Dundalk,\" he added. He also said family liaison officers have been appointed to each of the families and police will keep them updated. 'Veil of deep sadness' Ireland's prime minister Micheal Martin said he was \"numbed and shocked\" at the news, while his deputy, Simon Harris, said a \"veil of deep sadness\" had come over the country. Mr Martin said: \"Our thoughts and prayers are with the families and friends of these young people, and those injured. \"We also think of our first responders, who worked so professionally in truly devastating circumstances.\" Mr Harris said of the emergency services: \"One cannot even imagine the extraordinarily difficult and tragic circumstances in which they found themselves working last night as they set about trying to help in the most harrowing of situations.\" Read more from Sky News:Temperatures could fall to -7C in cold snapThousands march in Gen Z protests in Mexico Superintendent Armstrong urged anyone with information about the collision to contact the investigation team. He said: \"I am appealing to any person who was on the L3168 between 8.30pm and 9.15pm, last night Saturday November 15 2025, to contact the Garda investigation team. \"I am appealing to any person who might have any camera footage or images from the L3168, Gibstown area, between 8.30pm and 9.15pm last night, to give that footage or images to the investigation team at Dundalk Garda Station.\" The L3168 was closed between the N52 and the R171 as forensic experts investigated, and traffic diversions were in place."
    },
    {
        "title": "UK weather: Coldest night since March recorded - as Arctic air to bring risk of snow and ice this week",
        "description": "The UK has recorded its coldest night since March with a cold snap forecast to grip the country in the coming days, as some areas recover from Storm Claudia.",
        "url": "https://news.sky.com/story/uk-weather-coldest-night-since-march-as-cold-snap-follows-storm-claudia-with-chance-of-snow-13471064",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cold-weather-wrap-up_7083219.jpg?20251116103627",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 00:30:00",
        "Headline": "Arctic air will sweep across the UK this week, bringing with it a risk of snow and ice.",
        "Content": "The UK has recorded its coldest night since March with a cold snap forecast to grip the country in the coming days, as some areas recover from Storm Claudia. Temperatures dropped to -7C (19.4F) in Tulloch Bridge in the Highlands on Saturday night, the lowest since 20 March, according to the Met Office. It's set to get colder at the start of the week, with the weather agency raising the possibility of snow ahead, and a \"marked wind chill\" expected across much of the country. Storm Claudia brought heavy rain across the south of England and Wales, with a major incident declared in Monmouth on Saturday after severe flooding. Check the weather forecast where you are  According to the Sky Weather team, by early next week, daytime temperatures will be around 10C lower in parts of the south. Met Office deputy chief meteorologist Dan Holley said high pressure to the northwest \"will drive a cold northerly flow from the Arctic\", bringing with it \"much colder conditions than of late\". \n                  Video shows Storm Claudia's impact in Portugal as 'tornado' devastates Algarve\n                 \n                  Storm Claudia latest: Major incident declared due to severe flooding; British woman killed in Albufeira\n                 \n                  Major incident declared after flooding in Wales - as cold weather alert issued\n                 \"There will be widespread frosts across the UK, with temperatures dipping as low as -7C in places next week, and daytime temperatures staying in single figures across the country,\" he added. \"Couple this with a brisk northerly wind, and there will be a marked wind chill. This will be a notable change in our weather after a prolonged spell of above-average temperatures.\" Mr Holley also said \"there will be a risk of wintry hazards, such as snow and ice\". Cold weather warnings next week It comes after the UK Health Security Agency issued a cold weather warning for parts of the Midlands and northern England from Monday. The cold weather alert is in place from 8am on Monday until 8am on Friday. It covers the East Midlands, West Midlands, North East, North West and Yorkshire and The Humber. Read more from Sky News:Video shows Storm Claudia's impact in PortugalWhy Trump might struggle to win BBC lawsuit Flood warnings follow Storm Claudia Meanwhile, the Environment Agency has warned that flooding will continue throughout the remainder of the weekend as the remnants of Storm Claudia move south. Some 119.6mm of rainfall was recorded at a Natural Resources Wales rain gauge in southeast Wales, in the 12 hours to 6am on Saturday while 80.6mm was recorded over the same period at Suckley, Worcestershire."
    },
    {
        "title": "Inside Jordan warehouse where Gaza aid held 'after being refused entry by Israel'",
        "description": "Sky News has seen multiple warehouses in the Jordanian capital Amman, packed full of critical aid earmarked for the Gaza Strip.",
        "url": "https://news.sky.com/story/inside-jordan-warehouse-where-gaza-aid-held-after-being-refused-entry-by-israel-13471266",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-warehouse-amman-jordan_7083467.jpg?20251116164550",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 19:10:00",
        "Headline": "Jordanian authorities and the UN say the majority of aid collected has been sitting in Jordan since March, with only a negligible amount of aid being allowed into Gaza because of Israeli restrictions on aid going into the Strip.",
        "Content": " Sky News has seen multiple warehouses in the Jordanian capital Amman, packed full of critical aid earmarked for the Gaza Strip. There are three other similar locations in the country and run by the Jordanian authorities holding aid intended for Gaza. There are also large amounts of aid being stored separately by the United Nations in Jordan. Both the Jordanian authorities and the UN say the majority of aid collected has been sitting in Jordan since March, with only a negligible amount of aid being allowed into Gaza because of Israeli restrictions on aid going into the Strip. The news comes as tens of thousands of families living in tents in Gaza have been affected by flooding following heavy rains across the region. The stored aid is equivalent to thousands of trucks' worth of aid - in Jordan alone. And the United Nations says there's even more aid being held back in Egypt too - in total, enough aid to provide food for the entire Gaza population for about three months, according to the deputy commissioner general for UNRWA, Natalie Boucly, who was interviewed by The Guardian. \n                  British journalist Sami Hamdi being held by US immigration to be freed, his family say\n                 \n                  Trump's son-in-law and Netanyahu meet to discuss next stage of Gaza ceasefire\n                 \n                  Hadar Goldin: Remains of Israeli soldier killed in Gaza returned - 11 years later \n                 Sky's special correspondent Alex Crawford, who is in Amman, said: \"The aid in Jordan alone includes critical supplies such as tents and tarpaulins as well as blankets, mattresses, medicines like paracetamol as well as baby formula... all being stored here and held back, according to the UN here in Jordan and the Jordanian authorities, all being refused entry by the Israelis.\" What has UNICEF said? The UN aid agency for children has called on Israel to allow all of its supplies into Gaza. Writing on X, UNICEF said it had already distributed more than 5,000 tents, 220,000 tarps and 29,000 winter clothes kits. The Israeli defence body in charge of humanitarian aid in Gaza, COGAT, has said it is allowing in winter materials including blankets and tarps, which are water-resistant sheets made of canvas or plastic used for protection from the elements. But aid organisations have warned the efforts are completely inadequate and vastly outnumbered by those in need - an estimated 1.4 million people are classified as vulnerable by aid agencies. In contrast, on X, COGAT said it had \"facilitated close to 140,000 tarpaulins directly to the residents of the Gaza Strip\" and had spent the past few months coordinating with the international community. It went on: \"We call on international organisations to coordinate more tents and tarpaulins and other winter humanitarian responses.\" Read more from Sky News:Five young adults dead after car crashSearch for missing sailor linked to Navy ends But the UN insists Israel is in breach of international humanitarian law and has the responsibility as the occupying force to ensure the safe distribution and coordination of life-saving aid. What does the Israeli military say? An Israeli military official told Sky News that aid was stopped from Jordan after the main border crossing with Israel was closed following an attack there in September, which saw a Jordanian truck driver kill two Israeli soldiers. Although both Jordanian officials and UN figures in the country say hardly any aid - a \"negligible\" amount - was allowed into Gaza from Jordan many months before this, dating back to March. The Israeli military official said the crossing will not be opened until an investigation is concluded into the incident. They pointed out that there are other routes for aid to enter Gaza along the Egypt border, and hundreds of trucks enter the strip every day under the Israel-Hamas ceasefire agreement. However, the UN and multiple aid organisations say this is a fraction of what is required to meet the huge need inside Gaza and there are thousands of trucks' worth of aid also piled up and waiting to be allowed over from Egypt too. Meanwhile, in the sprawling Muwasi tent camp in Gaza, winter's first strong rainfall sent water cascading through the flimsy tents, which are now homes to tens of thousands of displaced families. Residents tried to dig trenches to keep the water from flooding their tents, as intermittent rains that began on Friday poured through tears in tarpaulins and makeshift shelters. 'Water puddles are inches high' Assil Naggar said he \"spent all (Friday) pushing water out of my tent\", adding his neighbours' tents and belongings were wrecked. \"Water puddles are inches high, and there is no proper drainage,\" he continued. The UN said Muwasi was sheltering up to 425,000 displaced Palestinians earlier this year, the vast majority in makeshift temporary tents, after Israel's war with Hamas displaced most of Gaza's population of more than two million people. The bulk of Gaza's infrastructure is estimated to have been destroyed or badly damaged during the Israeli bombardment. What's the latest with the ceasefire? The first stage of the ceasefire agreement between Israel and Hamas, which took effect on 10 October, is now nearing its end with Israeli forces pulling back to a 'yellow line' and Hamas releasing all living Israeli captives who were held in Gaza. Hamas has yet to return the remains of three more hostages, which Israel is demanding before progressing to the second stage, which includes an international stabilisation force to oversee security in Gaza. On Monday, the UN Security Council is expected to vote on a US proposal for a UN mandate for such a force despite opposition from Russia, China and some Arab countries. The Israeli bombardment of Gaza has gone on for more than two years, killing nearly 70,000 Palestinians, mostly women and children, according to the Palestinian territory's ministry of health, which does not distinguish between civilians and combatants. The Israeli military campaign came in response to attacks inside southern Israel by Hamas militants on October 7 2023, which saw 1,200 people killed and 251 taken hostage."
    },
    {
        "title": "Extensive search off Ireland's coast for missing Royal Fleet Auxiliary sailor ends",
        "description": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said.",
        "url": "https://news.sky.com/story/extensive-search-off-irelands-coast-for-missing-royal-fleet-auxiliary-sailor-ends-13471276",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rnli-lifeboat-search_7083430.jpg?20251116160729",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 15:21:00",
        "Headline": "The Irish Coast Guard said they had received a distress call on Saturday morning from a UK naval support vessel.  The Ministry of Defence say they are investigating the incident.",
        "Content": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said. The Royal Fleet Auxiliary (RFA) Tidesurge crew member was last seen at about 10.30pm on Friday. The search has been taking place in the sea off the northwest coast between Tory Island, Co Donegal, and Eagle Island, Co Mayo. Defence Secretary John Healey said: \"After an extensive search, it is with deep sadness that we confirm the missing crew member of RFA Tidesurge has not been found. \"My thoughts are with their family during this tragic time, as well as their fellow crew members. \"I am hugely grateful to the Irish authorities, the RNLI, Royal Air Force and Royal Navy who have responded rapidly to this incident and have worked tirelessly on the search.\" No further details have been released about the crew member and their family has requested privacy. \n                  Two-thirds of woman in armed forces have experienced sexualised behaviour, damning internal survey finds\n                 \n                  Royal Navy destroyer intercepts Russian warship off UK coast\n                 \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 The Irish Coast Guard said they received a distress call before 9am on Saturday from a UK naval support vessel. They immediately launched a search and rescue operation after the serviceperson was declared missing. The RFA comprises sailors - officers and ratings - who are employed as civil servants rather than members of the armed forces. Its ships provide vital support to the Royal Navy. A Ministry of Defence spokesman said: \"After an extensive search for a missing crew member of a Royal Fleet Auxiliary (RFA) ship's company, the individual has not been found, and the search has now ended. \"The individual's family have been informed, and an investigation is now under way into the incident. No other individuals have been harmed or reported missing.\" Read more:Five dead after car crash in IrelandThousands march in Mexico protests The search, which involved the Irish Coast Guard, Royal Navy, Royal Air Force, RNLI and Irish authorities, was coordinated by the Irish Coast Guard's maritime rescue sub centre at Malin, a village in County Donegal. Ireland's Department of Transport previously said this had involved UK naval support vessels and three RNLI all weather lifeboats based at Ballyglass, Arranmore Island and Lough Swilly. The Irish Coast Guard also deployed two planes and a helicopter to assist from the air."
    },
    {
        "title": "Kidlington fly-tipping: Drone footage shows scale of 'revolting' 60m-long mountain of waste next to river",
        "description": "Drone footage has shown hundreds of tonnes of \"revolting\" illegal waste, fly-tipped in a field next to the River Cherwell near Kidlington in Oxfordshire.",
        "url": "https://news.sky.com/story/kidlington-fly-tipping-drone-footage-shows-scale-of-revolting-60m-long-mountain-of-waste-next-to-river-13471314",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-river-cherwell-kidlington_7083471.jpg?20251116165151",
        "type": "Home",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-11-16 17:33:00",
        "Headline": "The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m.",
        "Content": "By Bethany Minelle, news reporter   Drone footage has shown hundreds of tonnes of \"revolting\" illegal waste, fly-tipped in a field next to the River Cherwell near Kidlington in Oxfordshire. The Sky News video shows the mass of rubbish, which is at least 60m long, 15m wide and stacked 10m high, and weighs hundreds of tonnes. Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News it was the first time he had seen anything on this scale, questioning whether the Environmental Agency had the resources to deal with it. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m. With the site on a floodplain, Mr Miller listed what he saw as the three major environmental risks - waste being washed into the waterways, rain seeping through the waste and carrying toxins into the water and the danger of decomposing chemicals presenting a fire risk. He said the police had used a helicopter with a heat-seeking camera, and could see that some of the waste was indeed starting to decompose. The site is adjacent to the A34, a busy road running through cities including Oxford and Birmingham. Mr Miller said he believed the Environment Agency was first made aware of the issue back in July. He said he believed it was the work of \"organised criminal gangs\" and raised a \"bigger systemic problem around the country\", with \"dumps are cropping up in more and more places\". He went on: \"My concern is the Environmental Agency lacks the resources to deal with criminal activity on this scale. I'm calling on the government to take action and ensure those who are dealing with such incidents have the powers they need to tackle it at source.\" Friends of the Thames's chief executive officer, Laura Reineke, told Sky News she became aware of the dumping site around 10 days ago, calling it \"the biggest ecological disaster that's happened on an inland waterway in this country\". The head of the charity dedicated to protecting, restoring and celebrating the River Thames, said the fact that the area had been prepared with large earth-moving vehicles and that the rubbish was \"pre-shredded\", then dumped so neatly showed the operation had been \"very well organised\". The culprits are yet to be caught. Ms Reineke went on: \"What is most horrifying is that the Environment Agency have known about this since 10 September, and they have done nothing about it.\" She also questioned the Environmental Agency's management of the situation, calling it \"a story of total incompetence\". Ms Reineke called the delay \"a death sentence for the River Cherwell and the wider Thames catchment\", labelling it \"ecocide on an epic scale\". She added: \"This dump isn't only a catastrophe for the freshwater species in our waterways, it's also a public health issue. We don't know what these chemicals are, they should have been tested.\" The Environment Agency told Sky News it has obtained a court order to close the site to all public access for at least six months. A spokesperson said: \"Specialist officers are investigating waste dumped near the A34 at Kidlington. Their role will be to find who left the waste there and take appropriate action. \"We share the public's anger about incidents like this, which is why we take action against those responsible for waste crime,\" asking anyone with information to call their 24-hour incident hotline. This summer, Sky News produced an exclusive report on the growing problem of waste crime, followed up in October by a report into an illegal dump in Wigan. In a report released last month, the Lords Environment and Climate Change Committee warned that organised crime gangs are illegally dumping millions of tonnes of waste across the countryside every year. The committee identified incompetence at the Environment Agency as a factor in the growing crisis. Philip Duffy, the agency's chief executive, hit back, saying: \"I think it's very unfair on my hardworking staff to be accused of incompetence.\""
    },
    {
        "title": "Marjorie Taylor Greene 'open to moving forward' after row with Donald Trump",
        "description": "Republican congresswoman Marjorie Taylor Greene has said she is ready to mend relations with Donald Trump after a high-profile row between the pair.",
        "url": "https://news.sky.com/story/marjorie-taylor-greene-open-to-moving-forward-after-row-with-donald-trump-13471445",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-marjorie-taylor-greene_7082456.jpg?20251115031920",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 20:32:00",
        "Headline": "The Georgia representative and Mr Trump had a very public falling out over the release of the Epstein files - but now she says she wants to move on.",
        "Content": " Republican congresswoman Marjorie Taylor Greene has said she is ready to mend relations with Donald Trump after a high-profile row between the pair. The former MAGA ally had said the US president was \"coming after me hard\" to prevent her efforts to release more files about Jeffrey Epstein. But writing on X on Sunday, she said forgiveness was a \"major part\" of her Christian faith. \"I'm here to show how it's possible to settle our differences and move forward as Americans,\" she wrote. \"That's why I'm always willing to go on shows with different viewpoints. \"I truly believe in forgiveness and I am open to moving forward with the President.\" A day earlier, Ms Greene claimed she was facing threats after a barrage of personal criticism from Mr Trump. She said she'd received warnings about her safety and that \"a hotbed of threats\" were \"being fuelled and egged on by the most powerful man in the world\". \n                  Most advanced US aircraft carrier arrives close to Venezuela as Donald Trump administration builds-up forces\n                 \n                  Marjorie Taylor Greene says she's received threats over Trump feud\n                 \n                  Trump to push ahead with BBC lawsuit: Three experts on why he might struggle to win\n                  \"As a woman, I take threats from men seriously,\" Ms Greene added. \"I now have a small understanding of the fear and pressure the women, who are victims of Jeffrey Epstein and his cabal, must feel.\" The congresswoman said Mr Trump's \"aggression against me\" - considering she was a staunch supporter of his policies - was \"completely shocking to everyone\".  Read more:Who is MAGA ally Marjorie Taylor Greene?Trump goes to war with the BBC The fight began when a petition to vote on the full release of the Epstein files received enough signatures - including Ms Greene's - to bring it to a vote in the House of Representatives. Mr Trump rescinded his support for Ms Greene, dubbed her a \"RINO\" (Republican In Name Only), and suggested he could support a challenge against her.  Ms Greene claimed text messages she sent to the president about the Epstein files had \"sent him over the edge\". She wrote on social media: \"Of course he's coming after me hard to make an example to scare all the other Republicans before next week's vote to release the Epstein files.\" High-profile figures, including Mr Trump, have been referenced in some of the documents. The White House has said the \"selectively leaked emails\" were an attempt to \"create a fake narrative to smear President Trump\", who has consistently denied any involvement or knowledge about Epstein's sex trafficking operation. Mr Trump has called the Epstein files a \"hoax\" created by the Democrats to \"deflect\" from the US government shutdown. Epstein took his own life in prison in 2019 while awaiting trial for sex trafficking charges."
    },
    {
        "title": "Arrest over car blast that killed eight in New Delhi ",
        "description": "A resident of Kashmir has been arrested over a car&#160;blast that killed eight people and wounded at least 20 others in New Delhi last week,&#160;India's National Investigation Agency has said.&#160;",
        "url": "https://news.sky.com/story/arrest-over-car-blast-that-killed-eight-in-new-delhi-13471242",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-delhi-india-explosion_7078337.jpg?20251110155412",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-16 14:15:00",
        "Headline": "Amir Rashid Ali was arrested in Delhi, India's National Investigation Agency said on Sunday, adding the car used in the attack on 10 November was registered in his name. ",
        "Content": "A resident of Kashmir has been arrested over a car blast that killed eight people and wounded at least 20 others in New Delhi last week, India's National Investigation Agency has said.  Amir Rashid Ali was arrested in Delhi, the agency said on Sunday, adding the car used in the attack on 10 November was registered in his name. The National Investigation Agency, which is India's federal anti-terror agency, accused him of conspiring with the alleged suicide bomber, who it identified as Umar Un Nabi, a resident of south Kashmir's Pulwama district. It said Ali came to Delhi to facilitate the purchase of the car which was used as a \"vehicle-borne Improvised ExplosiveDevice to trigger the blast\". The car blast is being treated as a \"terror incident\", the Indian government said last week. The blast, which triggered a fire that damaged several parked vehicles, happened near the gates of the metro station for the Red Fort, a former imperial palace and busy tourist spot. At the time of the incident, the fire service reported that at least six vehicles and three autorickshaws had caught fire. \n                  India: At least eight people killed in car explosion in New Delhi, police say\n                 \n                  Nine dead in crowd crush at temple in India\n                 \n                  India's first climate refugees face losing their sanctuary once again\n                  Read more from Sky News:Investigators in India sift through debris after India blastModi promises 'justice' after Delhi car blast outside historic Red Fort The explosion outside the Red Fort was the first such blast in the heavily guarded city since 2011. India's Prime Minister Narendra Modi offered his condolences to those who lost their loved ones in the blast. Following the attack last Monday, he posted on X: \"May the injured recover at the earliest. Those affected are being assisted by authorities. \"Reviewed the situation with Home Minister Amit Shah Ji and other officials.\""
    },
    {
        "title": "'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?",
        "description": "This week, many of the tech world's glitterati gathered in Lisbon for Web Summit, a sprawling conference showcasing everything from dancing robots to the influencer economy.&#160;",
        "url": "https://news.sky.com/story/are-we-becoming-too-cautious-around-ai-13470262",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-necklace_7082070.jpg?20251114172522",
        "type": "Home",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "One of the inventors of Siri, the original AI agent, wants you to \"handle with care\" when it comes to artificial intelligence. But are we becoming too cautious around AI in Europe and risking our future?",
        "Content": "\n          Science and technology reporter\n        This week, many of the tech world's glitterati gathered in Lisbon for Web Summit, a sprawling conference showcasing everything from dancing robots to the influencer economy.  In the pavilions - warehouse-sized rooms chock full of stages, booths and people networking - the phrase \"agentic AI\" was everywhere. There were AI agents that hung around your neck in jewellery, software to build agents into your workflows and more than 20 panel discussions on the topic. Agentic AI is essentially artificial intelligence that can do specific tasks by itself, like book your flights or order an Uber or help a customer. It's the industry's current buzzword and has even crept into the real world, with the Daily Mail listing \"agentic\" as an 'in' word for Gen Z last week. But AI agents aren't new. In fact, Babak Hodjat, now chief AI officer at Cognizant, invented the technology behind one of the most famous AI agents, Siri, in the 1990s. \"Back then, the fact that Siri itself was multi-agentic was a detail that we didn't even talk about - but it was,\" he told Sky News from Lisbon. \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 \n                  Ex-Starmer adviser's start-ups backer nears £1bn valuation\n                 \"Historically, the first person that talked about something like an agent was Alan Turing.\" New or not, AI agents are thought to come with even more risks than general-purpose AI, because they interact with and modify real-world scenarios.  The risks that come with AI, like bias in its data or unforeseen circumstances in how it interacts with humans, are magnified by agentic AI because it interacts with the world by itself. \"Agentic AI introduces new risks and challenges,\" wrote the IBM Responsible Technology Board in their 2025 report on the technology. \"For example, one new emerging risk involves data bias: an AI agent might modify a dataset or database in a way that introduces bias. \"Here, the AI agent takes an action that potentially impacts the world and could be irreversible if the introduced bias scales undetected.\" But for Mr Hodjat, it's not AI agents we need to worry about. \"People are over-trusting [AI] and taking their responses on face value without digging in and making sure that it's not just some hallucination that's coming up. \"It is incumbent upon all of us to learn what the boundaries are, the art of the possible, where we can trust these systems and where we cannot, and educate not just ourselves, but also our children.\" His warning will feel familiar, particularly in Europe, where there's an increased wariness around AI compared to the US. But have we become too cautious when it comes to AI - at the risk of a far more existential threat in the future? Jarek Kutylowski, chief executive of German AI language giant DeepL, certainly thinks so. This year, the EU AI Act came into force, strict regulations about how companies can and can't use AI. In the UK, companies are governed by existing legislation like GDPR and there's uncertainty about how strict our rules will be in the future. When asked if we needed to slow down AI innovation in order to put stricter regulations in place, Mr Kutylowski said it was a question worth grappling with… but in Europe, we are taking it too far. Read more from science and technology:NASA cancels space launchJeff Bezos's rocket lands on EarthNew law could help tackle AI-generated child abuse at source \"Looking at the apparent risks is easy, looking at the risks like what are we going to miss out on if we don't have the technology, if we are not successful enough in adopting that technology, that is probably the bigger risk,\" said Mr Kutylowski. \"I see definitely a much larger risk in Europe being left behind in the AI race. \"You won't see it until we start falling behind and until our economies cannot capitalise on those productivity gains that maybe other parts of the world will see. \"I do not believe personally that technological progress can be stopped in any way, so it is more of a question of 'how do we pragmatically embrace what is coming ahead?\""
    },
    {
        "title": "Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms",
        "description": "Home Secretary Shabana Mahmood plans to impose Trump-style visa bans&#160;on three African countries&#160;if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system.",
        "url": "https://news.sky.com/story/home-secretary-to-announce-largest-shake-up-of-uk-immigration-in-modern-times-13471410",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-channel-crossings_7083692.jpg?20251116231759",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-16 22:44:00",
        "Headline": "Shabana Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War.",
        "Content": " Home Secretary Shabana Mahmood plans to impose Trump-style visa bans on three African countries if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system. Angola, Namibia and the Democratic Republic of Congo will face visa sanctions, blocking their tourists, VIPs and business people from travelling to Britain if they do not improve co-operation on removals. Ms Mahmood said: \"In Britain, we play by the rules. When I said there would be penalties for countries that do not take back criminals and illegal immigrants, I meant it. \"My message to foreign governments today is clear: accept the return of your citizens or lose the privilege of entering our country.\" The move was reportedly inspired by President Trump's homeland security secretary, Kristi Noem, who has overseen the mass deportation policy in the US, according to the Times. Ms Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War. Modelled on the Danish system, the aim of the reforms is to make the UK less attractive for illegal immigrants and make it easier to deport them. \n                  Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 Under the plans, she will bring forward a bill to change how article 8 of the European Convention on Human Rights (ECHR), the right to family life, is applied in migration court cases. Read more:Shabana Mahmood is the new hard woman of British politicsHere's how the Danish migration model works That's as the Home Office claimed it had seen a rise in the use of rights-based appeals in recent years as a means of avoiding deportation. The changes would see only those with immediate family in the UK, such as a parent or child, being able to use article 8 as grounds to stay in future.  The home secretary, who has been in the job for 73 days, also plans to change the law so that multiple attempts to appeal against refusals for asylum will no longer be allowed. Furthermore, refugees will face a 20-year wait before they can apply for permanent settlement as part of the government's plans. The Home Office said the \"golden ticket\" deal has seen asylum claims surge in the UK, drawing people across Europe, through safe countries, on to dangerous small boats. Political correspondent We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises. The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. Read more Under the proposals, refugee status will become temporary and subject to regular review, with refugees removed once their home countries are deemed safe. Housing and weekly allowances will no longer be guaranteed for asylum seekers.  But the shake-up will also see the introduction of safe and legal routes to the UK in a bid to cut dangerous journeys in small boats across the Channel. A new independent body - similar to one in operation in Denmark - will be set up to fast-track the removal of dangerous criminals, and last-minute appeals will be expedited. Ms Mahmood has denied that her plans to clamp down on illegal immigration are \"racist\" - instead describing them as a \"moral mission\". She said illegal immigration was causing \"huge divides\" in the UK, and added: \"I do believe we need to act if we are to retain public consent for having an asylum system at all.\"  Speaking on Sunday Morning with Trevor Phillips, Ms Mahmood said she had observed how illegal migration had been \"creating division across our country\". She added: \"I can see that it is polarising communities across the country. I can see that it is dividing people and making them estranged from one another. I don't want to stand back and watch that happen in my country.\" Prime Minister Sir Keir Starmer said: \"Britain has always been a fair, tolerant and compassionate country - and this government will always defend those values. \"But in a more volatile world, people need to know our borders are secure and rules are enforced. These reforms will block endless appeals, stop last-minute claims and scale up removals of those with no right to be here.\"  Conservative Party leader Kemi Badenoch welcomed Ms Mahmood \"finally talking seriously about tackling illegal immigration\", but described the home secretary's proposed plans as \"a few weak changes\". She said: \"If the home secretary actually wants to cut illegal immigration, she should take up my offer to sit down with her and work on a plan that will actually stop the boats, rather than a few weak changes that will meet the approval of Labour MPs.\" Speaking earlier on Sunday, Reform UK leader Nigel Farage said: \"The home secretary sounds like a Reform supporter.\" \"Sadly with the Human Rights Act and ECHR membership, the changes won't survive the courts or probably even her own backbenchers,\" he added. Latest Home Office figures show 39,075 people have arrived in the UK after crossing the English Channel in small boats so far this year. The arrivals have already passed the number for the whole of 2024 (36,816) and 2023 (29,437), but the number is below the total for 2022 (45,774)."
    },
    {
        "title": "Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer",
        "description": "We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\".",
        "url": "https://news.sky.com/story/shabana-mahmood-is-the-new-hard-woman-of-british-politics-and-potential-successor-to-starmer-13471232",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-crossings-asylum-seekers_7083695.jpg?20251116234532",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-16 13:58:00",
        "Headline": "In a warning to Labour MPs who will be uncomfortable with her approach, Ms Mahmood has warned it is \"the last chance for decent, moderate politics\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n  We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Politics latest: Mahmood dismisses 'tittle-tattle' over leadership rumours Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises.  The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. \n                  Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 But speaking to Sir Trevor Phillips on Sky News, Ms Mahmood firmly hit back at suggestions today's announcements are pandering to a racist narrative from the far right. \"It's not right-wing talking points or fake news or misinformation that is suggesting that we've got a problem,\" she said. \"I know, because I have now seen this system inside out. It is a broken system. We have a genuine problem to fix. People are angry about something that is real.  \"It is my job, therefore, to think of a proper solution to this very real problem, to do so in line with my values as a Labour politician, but also as a British citizen, and to have solutions that work so that I can unite a divided country.\" There are many striking elements to this. While she's not been in the job for all that long, her government has been in power for 16 months. Her own press release highlights that over the past full calendar year asylum claims here have gone up by 18% - compared with a drop of 13% elsewhere in the EU. The UK, she argues, has become a \"golden ticket\" for asylum seekers due to \"far more generous terms\" than other countries in Europe. While she politely insists that her predecessor's policies - the one in one out deal with France, closer partnership with law enforcement across Europe - are beginning to take effect, the message is clear. No one in office before Shabana has had the stomach to grasp the nettle.  The Home Office is determined to present their boss as the new hard woman of British politics. In a bleak warning to those in her party who will be deeply uncomfortable with this unflinching approach, we're told she believes this is \"the last chance for decent, moderate politics\". \"If these moderate forces fail, something darker will follow…. if you don't like this, you won't like what follows me.\" That's a clear reference to the anti-asylum policies of Reform and the Conservatives, who are pledging to leave the European Convention on Human Rights and deport all illegal arrivals. Both parties have responded by effectively claiming they don't trust Labour to deliver on this, given they believe the government has lost control of our borders and overseen a surge in asylum claims. That much Ms Mahmood herself has already acknowledged. It's unusual to hear a Conservative shadow minister like Chris Philp responding to a government announcement by claiming they will support the \"sensible steps\" the Home Office is making. Unsurprisingly, he went on to belittle her ideas as \"very small steps\" combined with \"gimmicks\" - but the main thrust of his critique was that Labour lacks the authority to push these kinds of measures through parliament, given the likely opposition from their own left wingers. It's a fair point - but the lack of fundamental disagreement highlights the threat these plans pose to her opponents. If the government looks like it might actually succeed in bringing down the numbers - and of course that's a colossal if - Ms Mahmood will effectively have outflanked and neutralised much of the threat from both the Tories and Reform. That's why she's so keen to mention her Danish inspiration - a centre-left government which managed to see off the threat from right-wing parties through its tough approach to migration, without having to leave the ECHR. Read more:Migrants shopping for life jackets: Inside the route to the ChannelHere's how the Danish migration model works The Home Office is planning further announcements on new safe and legal routes. But refugee charities have described the new measures as harsh, claiming they will scapegoat genuine refugees, fail to integrate them into society, and fail to function as a deterrent either. There will surely be an almighty internal row among Labour MPs about the principle of ripping up the post-war settlement for refugees. For a government floundering after the political chaos of the last few weeks and months, Ms Mahmood is a voice of certainty and confidence. At a moment of such intense backroom debate over the party's future direction, it's hard to avoid seeing her performance this weekend as a starting pitch for the leadership."
    },
    {
        "title": "Kidlington fly-tipping: Drone footage shows scale of 'revolting' 60m-long mountain of waste next to river",
        "description": "Drone footage has shown hundreds of tonnes of \"revolting\" illegal waste, fly-tipped in a field next to the River Cherwell near Kidlington in Oxfordshire.",
        "url": "https://news.sky.com/story/kidlington-fly-tipping-drone-footage-shows-scale-of-revolting-60m-long-mountain-of-waste-next-to-river-13471314",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-river-cherwell-kidlington_7083471.jpg?20251116165151",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-11-16 17:33:00",
        "Headline": "The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m.",
        "Content": "By Bethany Minelle, news reporter   Drone footage has shown hundreds of tonnes of \"revolting\" illegal waste, fly-tipped in a field next to the River Cherwell near Kidlington in Oxfordshire. The Sky News video shows the mass of rubbish, which is at least 60m long, 15m wide and stacked 10m high, and weighs hundreds of tonnes. Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News it was the first time he had seen anything on this scale, questioning whether the Environmental Agency had the resources to deal with it. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m. With the site on a floodplain, Mr Miller listed what he saw as the three major environmental risks - waste being washed into the waterways, rain seeping through the waste and carrying toxins into the water and the danger of decomposing chemicals presenting a fire risk. He said the police had used a helicopter with a heat-seeking camera, and could see that some of the waste was indeed starting to decompose. The site is adjacent to the A34, a busy road running through cities including Oxford and Birmingham. Mr Miller said he believed the Environment Agency was first made aware of the issue back in July. He said he believed it was the work of \"organised criminal gangs\" and raised a \"bigger systemic problem around the country\", with \"dumps are cropping up in more and more places\". He went on: \"My concern is the Environmental Agency lacks the resources to deal with criminal activity on this scale. I'm calling on the government to take action and ensure those who are dealing with such incidents have the powers they need to tackle it at source.\" Friends of the Thames's chief executive officer, Laura Reineke, told Sky News she became aware of the dumping site around 10 days ago, calling it \"the biggest ecological disaster that's happened on an inland waterway in this country\". The head of the charity dedicated to protecting, restoring and celebrating the River Thames, said the fact that the area had been prepared with large earth-moving vehicles and that the rubbish was \"pre-shredded\", then dumped so neatly showed the operation had been \"very well organised\". The culprits are yet to be caught. Ms Reineke went on: \"What is most horrifying is that the Environment Agency have known about this since 10 September, and they have done nothing about it.\" She also questioned the Environmental Agency's management of the situation, calling it \"a story of total incompetence\". Ms Reineke called the delay \"a death sentence for the River Cherwell and the wider Thames catchment\", labelling it \"ecocide on an epic scale\". She added: \"This dump isn't only a catastrophe for the freshwater species in our waterways, it's also a public health issue. We don't know what these chemicals are, they should have been tested.\" The Environment Agency told Sky News it has obtained a court order to close the site to all public access for at least six months. A spokesperson said: \"Specialist officers are investigating waste dumped near the A34 at Kidlington. Their role will be to find who left the waste there and take appropriate action. \"We share the public's anger about incidents like this, which is why we take action against those responsible for waste crime,\" asking anyone with information to call their 24-hour incident hotline. This summer, Sky News produced an exclusive report on the growing problem of waste crime, followed up in October by a report into an illegal dump in Wigan. In a report released last month, the Lords Environment and Climate Change Committee warned that organised crime gangs are illegally dumping millions of tonnes of waste across the countryside every year. The committee identified incompetence at the Environment Agency as a factor in the growing crisis. Philip Duffy, the agency's chief executive, hit back, saying: \"I think it's very unfair on my hardworking staff to be accused of incompetence.\""
    },
    {
        "title": "Extensive search off Ireland's coast for missing Royal Fleet Auxiliary sailor ends",
        "description": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said.",
        "url": "https://news.sky.com/story/extensive-search-off-irelands-coast-for-missing-royal-fleet-auxiliary-sailor-ends-13471276",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rnli-lifeboat-search_7083430.jpg?20251116160729",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-16 15:21:00",
        "Headline": "The Irish Coast Guard said they had received a distress call on Saturday morning from a UK naval support vessel.  The Ministry of Defence say they are investigating the incident.",
        "Content": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said. The Royal Fleet Auxiliary (RFA) Tidesurge crew member was last seen at about 10.30pm on Friday. The search has been taking place in the sea off the northwest coast between Tory Island, Co Donegal, and Eagle Island, Co Mayo. Defence Secretary John Healey said: \"After an extensive search, it is with deep sadness that we confirm the missing crew member of RFA Tidesurge has not been found. \"My thoughts are with their family during this tragic time, as well as their fellow crew members. \"I am hugely grateful to the Irish authorities, the RNLI, Royal Air Force and Royal Navy who have responded rapidly to this incident and have worked tirelessly on the search.\" No further details have been released about the crew member and their family has requested privacy. \n                  Two-thirds of woman in armed forces have experienced sexualised behaviour, damning internal survey finds\n                 \n                  Royal Navy destroyer intercepts Russian warship off UK coast\n                 \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 The Irish Coast Guard said they received a distress call before 9am on Saturday from a UK naval support vessel. They immediately launched a search and rescue operation after the serviceperson was declared missing. The RFA comprises sailors - officers and ratings - who are employed as civil servants rather than members of the armed forces. Its ships provide vital support to the Royal Navy. A Ministry of Defence spokesman said: \"After an extensive search for a missing crew member of a Royal Fleet Auxiliary (RFA) ship's company, the individual has not been found, and the search has now ended. \"The individual's family have been informed, and an investigation is now under way into the incident. No other individuals have been harmed or reported missing.\" Read more:Five dead after car crash in IrelandThousands march in Mexico protests The search, which involved the Irish Coast Guard, Royal Navy, Royal Air Force, RNLI and Irish authorities, was coordinated by the Irish Coast Guard's maritime rescue sub centre at Malin, a village in County Donegal. Ireland's Department of Transport previously said this had involved UK naval support vessels and three RNLI all weather lifeboats based at Ballyglass, Arranmore Island and Lough Swilly. The Irish Coast Guard also deployed two planes and a helicopter to assist from the air."
    },
    {
        "title": "Brazil 'surprised' UK not investing in new rainforest fund it helped design",
        "description": "Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.&#160;",
        "url": "https://news.sky.com/story/brazil-surprised-uk-not-investing-in-new-rainforest-fund-it-helped-design-13470462",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-amazon-rainforest-brazil_7082402.png?20251114231936",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "Brazil is touting what could be a radical new solution to tackle deforestation, flipping the economics in favour of protecting the forest. But it needs more cash to get it off the ground.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.  The Amazon nation has used its role as host of the COP30 climate talks to tout its new scheme, which it drew up with the help of countries including the UK and Indonesia. With Britain's budget day looming, Prime Minister Sir Keir Starmer decided against chipping in when he visited the Amazonian city of Belem this month. The news came out the day before Brazil was about to launch it. \"The Brazilians were livid\" about the timing, one source told Sky News. Garo Batmanian, director-general of the Brazilian Forestry Service and coordinator of the new scheme, said: \"We were expecting [Britain to pay in] because the UK was the very first one to support us.\" The so-called Tropical Forests Forever Facility (TFFF) was drawn up with the help of \"very bright people from the UK\", according to Mr Batmanian. \n                  'A ray of hope': Forest destruction in Brazil and Colombia has fallen 'dramatically'\n                 \n                  Deforestation report: UK's 'unsustainable' consumption putting 'enormous pressure' on world's forests, MPs warn\n                 \n                  Eight Latin American countries have met to talk about the Amazon - this is why it's so important to protect it\n                 \"So we are a bit surprised, but we expect that once internal situations get better, hopefully they will come through,\" he added. The UK's climate envoy, Rachel Kyte, told Sky News: \"The PM agreed the decision was about not doing it now, as opposed to not ever. \"We will look at the TFFF after the budget and are carefully tracking how others are investing.\" The fund has been hailed as a breakthrough - if Brazil can get if off the ground. Paul Polman, former Unilever boss and now co-vice chair of Planetary Guardians, said it could be the \"first forest-finance plan big enough to change the game\". Why do tropical forests need help? At their best, tropical forests like the Amazon and the Congo Basin provide food, rainfall and clean air for millions of people around the world. They soak up carbon dioxide - the main driver of climate change - providing a cooling effect on a heating planet. But they are being nibbled away at by extractive industries like oil, logging, soy and gold. Parts of the Amazon rainforest already emit more carbon dioxide than they store. Other pockets are expected to collapse in the next few decades, meaning they'd no longer be rainforests at all. Read more from COP30:Climate protest in Brazilian city aims to hold governments' feet to the fireAre climate summits saving the world - or just hot air?COP30 - why is it so controversial? Cristiane Mazzetti, senior forest campaigner at Greenpeace Brazil, said: \"Science is saying we need to immediately stop deforestation and start restoring what was once lost. \"And in Brazil, we already have enough open land that could be better used for agricultural expansion... There is no need [to open up] new areas.\" Can Brazil's new investment fund save the world's rainforests? For decades, forests have been worth more dead than alive. Successive attempts to save them have fallen flat because they've not been able to flip the economics in favour of conservation, or ensure a long-term stream of cash. Brazil hopes the TFFF, if it launches, would make forests worth more standing than cut down, and pay out to countries and communities making that happen. \"We don't pay only for carbon, we are paying for a hectare of standing forest. The more forests you have, the more you are paid,\" said Mr Batmanian. The other \"innovation\" is to stop relying on aid donations, he said. \"There is a lot of demand for overseas development assistance. It's normal to have that. We have a lot of crisis, pandemics, epidemics out there.\" Instead, the TFFF is an investment fund that would compete with other commercial propositions. Mr Polman said: \"This isn't charity, it's smart economic infrastructure to protect the Amazon and keep our planet safe.\" How does the TFFF raise money? The idea is to raise a first tranche of cash from governments that can de-risk the fund for private investors. Every $1 invested by governments could attract a further $4 of private cash. The TFFF would then be able to take a higher amount of risk to raise above-market returns, Brazil hopes. That means it could generate enough cash to pay competitive returns to investors and payments to the eligible countries and communities keeping their tropical trees upright. At least 20% of the payments has been earmarked for indigenous communities, widely regarded as the best stewards of the land. Many, but not all, have welcomed the idea. Will the TFFF work? The proposal needs at least $10-25bn of government money to get off the ground. So far it has raised $5.5bn from the likes of Norway, France, and Indonesia. And the World Bank has agreed to host it, signalling strong credibility. But it's a hard task to generate enough money to compete with lucrative industries like gold and oil, many of which governments already invest in. Dr Andreza Aruska de Souza Santos, director of King's College London's Brazil Institute, said TFFF has the potential to make it \"very financially viable to have a forest as a forest\". \"But the problem is that TFFF would need to compete with these very profitable industries... because you need to capture as much money from governments, from investors. \"And so far it's not quite balancing the competitiveness of other sectors that are potentially harmful for forests.\""
    },
    {
        "title": "UK weather: Coldest night since March recorded - as Arctic air to bring risk of snow and ice this week",
        "description": "The UK has recorded its coldest night since March with a cold snap forecast to grip the country in the coming days, as some areas recover from Storm Claudia.",
        "url": "https://news.sky.com/story/uk-weather-coldest-night-since-march-as-cold-snap-follows-storm-claudia-with-chance-of-snow-13471064",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cold-weather-wrap-up_7083219.jpg?20251116103627",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-16 00:30:00",
        "Headline": "Arctic air will sweep across the UK this week, bringing with it a risk of snow and ice.",
        "Content": "The UK has recorded its coldest night since March with a cold snap forecast to grip the country in the coming days, as some areas recover from Storm Claudia. Temperatures dropped to -7C (19.4F) in Tulloch Bridge in the Highlands on Saturday night, the lowest since 20 March, according to the Met Office. It's set to get colder at the start of the week, with the weather agency raising the possibility of snow ahead, and a \"marked wind chill\" expected across much of the country. Storm Claudia brought heavy rain across the south of England and Wales, with a major incident declared in Monmouth on Saturday after severe flooding. Check the weather forecast where you are  According to the Sky Weather team, by early next week, daytime temperatures will be around 10C lower in parts of the south. Met Office deputy chief meteorologist Dan Holley said high pressure to the northwest \"will drive a cold northerly flow from the Arctic\", bringing with it \"much colder conditions than of late\". \n                  Video shows Storm Claudia's impact in Portugal as 'tornado' devastates Algarve\n                 \n                  Storm Claudia latest: Major incident declared due to severe flooding; British woman killed in Albufeira\n                 \n                  Major incident declared after flooding in Wales - as cold weather alert issued\n                 \"There will be widespread frosts across the UK, with temperatures dipping as low as -7C in places next week, and daytime temperatures staying in single figures across the country,\" he added. \"Couple this with a brisk northerly wind, and there will be a marked wind chill. This will be a notable change in our weather after a prolonged spell of above-average temperatures.\" Mr Holley also said \"there will be a risk of wintry hazards, such as snow and ice\". Cold weather warnings next week It comes after the UK Health Security Agency issued a cold weather warning for parts of the Midlands and northern England from Monday. The cold weather alert is in place from 8am on Monday until 8am on Friday. It covers the East Midlands, West Midlands, North East, North West and Yorkshire and The Humber. Read more from Sky News:Video shows Storm Claudia's impact in PortugalWhy Trump might struggle to win BBC lawsuit Flood warnings follow Storm Claudia Meanwhile, the Environment Agency has warned that flooding will continue throughout the remainder of the weekend as the remnants of Storm Claudia move south. Some 119.6mm of rainfall was recorded at a Natural Resources Wales rain gauge in southeast Wales, in the 12 hours to 6am on Saturday while 80.6mm was recorded over the same period at Suckley, Worcestershire."
    },
    {
        "title": "Three men and two women in their 20s have died in car crash in Co Louth, Irish police say",
        "description": "Three men and two women died in a \"shocking\" and \"devastating\" road crash involving two cars in Co Louth on Saturday night, Irish police said.",
        "url": "https://news.sky.com/story/three-men-and-two-women-in-their-20s-have-died-in-car-crash-in-co-louth-irish-police-say-13471168",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ireland-crash-dundalk_7083705.jpg?20251117022042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 10:42:00",
        "Headline": "The five victims had been in the same vehicle, a Volkswagen Golf, which was in a collision with a Toyota Land Cruiser.",
        "Content": " Three men and two women died in a \"shocking\" and \"devastating\" road crash involving two cars in Co Louth on Saturday night, Irish police said. The victims were Chloe McGee, 23, and Shay Duffy, 21, both from Carrickmacross in Co Monaghan; Alan McCluskey, 23, from Drumconrath in Co Meath; and Dylan Commins, 23, from Ardee in Co Louth, and Chloe Hipson, 21, from Lanarkshire in Scotland. The collision happened on the L3168 in Gibstown, Dundalk, shortly after 9pm. The five were travelling together in a Volkswagen Golf while on their way to Dundalk for a night out, police believe. They were pronounced dead at the scene. Another man, also in his 20s, was \"removed\" from the car and taken to Our Lady of Lourdes Hospital in Drogheda, where he was treated for \"serious non-life-threatening injuries\", said Superintendent Charlie Armstrong. The Golf was in a collision with a Toyota Land Cruiser. A man and a woman in the second vehicle were also taken to the same hospital. Their injuries are described as \"non-life-threatening\". Praise for emergency response Superintendent Armstrong said an investigation into the road crash was under way, as he praised the emergency services. He said: \"The scene was very difficult, in adverse weather conditions, and the professionalism shown by all first responders and the care and respect shown to the five deceased was exemplary.\" \"This is a shocking, devastating event for these families, their communities and the community here in Dundalk,\" he added. He also said family liaison officers have been appointed to each of the families and police will keep them updated. 'Veil of deep sadness' Ireland's prime minister Micheal Martin said he was \"numbed and shocked\" at the news, while his deputy, Simon Harris, said a \"veil of deep sadness\" had come over the country. Mr Martin said: \"Our thoughts and prayers are with the families and friends of these young people, and those injured. \"We also think of our first responders, who worked so professionally in truly devastating circumstances.\" Mr Harris said of the emergency services: \"One cannot even imagine the extraordinarily difficult and tragic circumstances in which they found themselves working last night as they set about trying to help in the most harrowing of situations.\" Read more from Sky News:Temperatures could fall to -7C in cold snapThousands march in Gen Z protests in Mexico Superintendent Armstrong urged anyone with information about the collision to contact the investigation team. He said: \"I am appealing to any person who was on the L3168 between 8.30pm and 9.15pm, last night Saturday November 15 2025, to contact the Garda investigation team. \"I am appealing to any person who might have any camera footage or images from the L3168, Gibstown area, between 8.30pm and 9.15pm last night, to give that footage or images to the investigation team at Dundalk Garda Station.\" The L3168 was closed between the N52 and the R171 as forensic experts investigated, and traffic diversions were in place."
    },
    {
        "title": "Inside Jordan warehouse where Gaza aid held 'after being refused entry by Israel'",
        "description": "Sky News has seen multiple warehouses in the Jordanian capital Amman, packed full of critical aid earmarked for the Gaza Strip.",
        "url": "https://news.sky.com/story/inside-jordan-warehouse-where-gaza-aid-held-after-being-refused-entry-by-israel-13471266",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-warehouse-amman-jordan_7083467.jpg?20251116164550",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 19:10:00",
        "Headline": "Jordanian authorities and the UN say the majority of aid collected has been sitting in Jordan since March, with only a negligible amount of aid being allowed into Gaza because of Israeli restrictions on aid going into the Strip.",
        "Content": " Sky News has seen multiple warehouses in the Jordanian capital Amman, packed full of critical aid earmarked for the Gaza Strip. There are three other similar locations in the country and run by the Jordanian authorities holding aid intended for Gaza. There are also large amounts of aid being stored separately by the United Nations in Jordan. Both the Jordanian authorities and the UN say the majority of aid collected has been sitting in Jordan since March, with only a negligible amount of aid being allowed into Gaza because of Israeli restrictions on aid going into the Strip. The news comes as tens of thousands of families living in tents in Gaza have been affected by flooding following heavy rains across the region. The stored aid is equivalent to thousands of trucks' worth of aid - in Jordan alone. And the United Nations says there's even more aid being held back in Egypt too - in total, enough aid to provide food for the entire Gaza population for about three months, according to the deputy commissioner general for UNRWA, Natalie Boucly, who was interviewed by The Guardian. \n                  British journalist Sami Hamdi being held by US immigration to be freed, his family say\n                 \n                  Trump's son-in-law and Netanyahu meet to discuss next stage of Gaza ceasefire\n                 \n                  Hadar Goldin: Remains of Israeli soldier killed in Gaza returned - 11 years later \n                 Sky's special correspondent Alex Crawford, who is in Amman, said: \"The aid in Jordan alone includes critical supplies such as tents and tarpaulins as well as blankets, mattresses, medicines like paracetamol as well as baby formula... all being stored here and held back, according to the UN here in Jordan and the Jordanian authorities, all being refused entry by the Israelis.\" What has UNICEF said? The UN aid agency for children has called on Israel to allow all of its supplies into Gaza. Writing on X, UNICEF said it had already distributed more than 5,000 tents, 220,000 tarps and 29,000 winter clothes kits. The Israeli defence body in charge of humanitarian aid in Gaza, COGAT, has said it is allowing in winter materials including blankets and tarps, which are water-resistant sheets made of canvas or plastic used for protection from the elements. But aid organisations have warned the efforts are completely inadequate and vastly outnumbered by those in need - an estimated 1.4 million people are classified as vulnerable by aid agencies. In contrast, on X, COGAT said it had \"facilitated close to 140,000 tarpaulins directly to the residents of the Gaza Strip\" and had spent the past few months coordinating with the international community. It went on: \"We call on international organisations to coordinate more tents and tarpaulins and other winter humanitarian responses.\" Read more from Sky News:Five young adults dead after car crashSearch for missing sailor linked to Navy ends But the UN insists Israel is in breach of international humanitarian law and has the responsibility as the occupying force to ensure the safe distribution and coordination of life-saving aid. What does the Israeli military say? An Israeli military official told Sky News that aid was stopped from Jordan after the main border crossing with Israel was closed following an attack there in September, which saw a Jordanian truck driver kill two Israeli soldiers. Although both Jordanian officials and UN figures in the country say hardly any aid - a \"negligible\" amount - was allowed into Gaza from Jordan many months before this, dating back to March. The Israeli military official said the crossing will not be opened until an investigation is concluded into the incident. They pointed out that there are other routes for aid to enter Gaza along the Egypt border, and hundreds of trucks enter the strip every day under the Israel-Hamas ceasefire agreement. However, the UN and multiple aid organisations say this is a fraction of what is required to meet the huge need inside Gaza and there are thousands of trucks' worth of aid also piled up and waiting to be allowed over from Egypt too. Meanwhile, in the sprawling Muwasi tent camp in Gaza, winter's first strong rainfall sent water cascading through the flimsy tents, which are now homes to tens of thousands of displaced families. Residents tried to dig trenches to keep the water from flooding their tents, as intermittent rains that began on Friday poured through tears in tarpaulins and makeshift shelters. 'Water puddles are inches high' Assil Naggar said he \"spent all (Friday) pushing water out of my tent\", adding his neighbours' tents and belongings were wrecked. \"Water puddles are inches high, and there is no proper drainage,\" he continued. The UN said Muwasi was sheltering up to 425,000 displaced Palestinians earlier this year, the vast majority in makeshift temporary tents, after Israel's war with Hamas displaced most of Gaza's population of more than two million people. The bulk of Gaza's infrastructure is estimated to have been destroyed or badly damaged during the Israeli bombardment. What's the latest with the ceasefire? The first stage of the ceasefire agreement between Israel and Hamas, which took effect on 10 October, is now nearing its end with Israeli forces pulling back to a 'yellow line' and Hamas releasing all living Israeli captives who were held in Gaza. Hamas has yet to return the remains of three more hostages, which Israel is demanding before progressing to the second stage, which includes an international stabilisation force to oversee security in Gaza. On Monday, the UN Security Council is expected to vote on a US proposal for a UN mandate for such a force despite opposition from Russia, China and some Arab countries. The Israeli bombardment of Gaza has gone on for more than two years, killing nearly 70,000 Palestinians, mostly women and children, according to the Palestinian territory's ministry of health, which does not distinguish between civilians and combatants. The Israeli military campaign came in response to attacks inside southern Israel by Hamas militants on October 7 2023, which saw 1,200 people killed and 251 taken hostage."
    },
    {
        "title": "Mexico: Thousands march against crime and corruption in Generation Z protests, with 100 police injured",
        "description": "Thousands have taken to the streets of Mexico City to protest against crime and corruption - with 120 people left injured, according to authorities.",
        "url": "https://news.sky.com/story/mexico-thousands-march-against-crime-and-corruption-in-generation-z-protests-with-100-police-injured-13471071",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gen-z-mexico-mexico-city_7083069.jpg?20251116043811",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 03:53:00",
        "Headline": "Mexico has seen a recent spate of high-profile murders, including the fatal shooting of the mayor of the Uruapan municipality during Day Of The Dead festivities at the start of the month.",
        "Content": " Thousands have taken to the streets of Mexico City to protest against crime and corruption - with 120 people left injured, according to authorities. Pablo Vazquez, security secretary for Mexico's capital, said that of those injured, 100 were police officers with 40 hospitalised, while 20 people were arrested. The demonstration, which was mostly peaceful but ended with some clashes with officers, was organised by young people under the banner Generation Z. Clara Brugada, mayor of Mexico City, said on X that \"violent expression violates the rights of others\" and condemned any act \"carried out by a radical group of protesters\". One group, calling itself Generation Z Mexico, called for the protests and said in a \"manifesto\" circulating on social media that it represents Mexican youth fed up with violence, corruption and abuse of power. Generation Z - or Gen Z for short - refers to an age demographic of people born between the late 1990s and early 2010s. While the exact years vary depending on who is recording it, those considered Gen Z were typically born between 1997 and 2012, so would be between 28 and 13 years old. Mexico has seen a recent spate of high-profile murders, including the fatal shooting of the mayor of the Uruapan municipality during Day Of The Dead festivities at the start of the month. Supporters of Carlos Alberto Manzo Rodriguez, an outspoken critic of organised crime, were seen on Saturday wearing straw hats - a symbol of the mayor's political movement. Eyewitnesses told the Reuters news agency that a small group of protesters tore down fences around the National Palace where Mexican President Claudia Sheinbaum lives, leading to clashes with riot police who used tear gas. Some demonstrators in Mexico City protested against Ms Sheinbaum's party, while others called for stronger state efforts to stop crime and violence, shouting: \"Carlos did not die, the government killed him.\" Other marches took place across Mexico, including in the western state of Michoacan, where Mr Manzo was murdered. Reuters reported that Mexico's government is claiming that the protests on Saturday were organised largely by right-leaning political opponents, and were promoted by bots on social media. Read more from Sky News:Mexico's president presses charges after groping incidentAre we becoming too reliant on AI - or too cautious? It marks the latest instance of mass protests from young people, after a Gen Z uprising ousted the president of Madagascar, Andry Rajoelina, earlier this month. And in September, anti-government protests that exploded after Nepalese authorities blocked several social media platforms led to mass unrest and the resignation of the prime minister KP Sharma Oli."
    },
    {
        "title": "Arrest over car blast that killed eight in New Delhi ",
        "description": "A resident of Kashmir has been arrested over a car&#160;blast that killed eight people and wounded at least 20 others in New Delhi last week,&#160;India's National Investigation Agency has said.&#160;",
        "url": "https://news.sky.com/story/arrest-over-car-blast-that-killed-eight-in-new-delhi-13471242",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-delhi-india-explosion_7078337.jpg?20251110155412",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 14:15:00",
        "Headline": "Amir Rashid Ali was arrested in Delhi, India's National Investigation Agency said on Sunday, adding the car used in the attack on 10 November was registered in his name. ",
        "Content": "A resident of Kashmir has been arrested over a car blast that killed eight people and wounded at least 20 others in New Delhi last week, India's National Investigation Agency has said.  Amir Rashid Ali was arrested in Delhi, the agency said on Sunday, adding the car used in the attack on 10 November was registered in his name. The National Investigation Agency, which is India's federal anti-terror agency, accused him of conspiring with the alleged suicide bomber, who it identified as Umar Un Nabi, a resident of south Kashmir's Pulwama district. It said Ali came to Delhi to facilitate the purchase of the car which was used as a \"vehicle-borne Improvised ExplosiveDevice to trigger the blast\". The car blast is being treated as a \"terror incident\", the Indian government said last week. The blast, which triggered a fire that damaged several parked vehicles, happened near the gates of the metro station for the Red Fort, a former imperial palace and busy tourist spot. At the time of the incident, the fire service reported that at least six vehicles and three autorickshaws had caught fire. \n                  India: At least eight people killed in car explosion in New Delhi, police say\n                 \n                  Nine dead in crowd crush at temple in India\n                 \n                  India's first climate refugees face losing their sanctuary once again\n                  Read more from Sky News:Investigators in India sift through debris after India blastModi promises 'justice' after Delhi car blast outside historic Red Fort The explosion outside the Red Fort was the first such blast in the heavily guarded city since 2011. India's Prime Minister Narendra Modi offered his condolences to those who lost their loved ones in the blast. Following the attack last Monday, he posted on X: \"May the injured recover at the earliest. Those affected are being assisted by authorities. \"Reviewed the situation with Home Minister Amit Shah Ji and other officials.\""
    },
    {
        "title": "Iran says it's no longer enriching uranium at any site in the country",
        "description": "Iran has said it is no longer enriching uranium at any site in the country.",
        "url": "https://news.sky.com/story/iran-says-its-no-longer-enriching-uranium-at-any-site-in-the-country-13471196",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-abbas-araghchi-iran_7083296.jpg?20251116130028",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 12:34:00",
        "Headline": "During the three-day summit, Tehran said Washington hadn't shown readiness for \"equal and fair negotiations\".",
        "Content": "Iran has said it is no longer enriching uranium at any site in the country. Speaking at a Tehran conference named \"international law under assault,\" Foreign Minister Abbas Araghchi told Associated Press: \"There is no undeclared nuclear enrichment in Iran. All of our facilities are under the safeguards and monitoring [of the International Atomic Energy]. \"There is no enrichment right now because our enrichment facilities have been attacked.\" In June, three of Iran's main nuclear facilities - Fordow, Natanz and Isfahan - were targeted by unprecedented US strikes using 30,000lb bunker-busting bombs. Satellite imagery showed major damage, but because some of the facilities are positioned deep under mountains, it was hard to determine exactly how much was inflicted. In September, Iran's nuclear chief, Mohammad Eslami, told Sky News some of his country's nuclear facilities had been \"destroyed\" in the US strikes. Mr Araghchi said Washington's current approach to Tehran did not indicate any readiness for \"equal and fair negotiations\". \n                  From New York to Iran: How are young people upsetting the establishment?\n                 \n                  Lindsay and Craig Foreman: Iranian court hearing for detained British couple did 'not go well', says son\n                 \n                  Briton detained in Iran moved to prison where husband is being held, says son\n                 Since the attacks, attempts at renewing dialogue on Tehran's nuclear programme have failed. The US, its European allies and Israel accuse Tehran of using its nuclear programme as a veil for efforts to develop the capability to produce weapons.  'Peaceful use of nuclear technology' Asked what it would take for Iran to continue negotiations with the US and others, Mr Araghchi said that Iran's message on its nuclear program remains \"clear.\" He said: \"Iran's right for enrichment, for peaceful use of nuclear technology, including enrichment, is undeniable. \"We have this right, and we continue to exercise that, and we hope that the international community, including the United States, recognise our rights and understand that this is an inalienable right of Iran and we would never give up our rights.\" During the same conference, deputy foreign minister Saeed Khatibzadeh also accused Washington of pursuing its wartime goals with \"negotiations as a show\".  The 12-day Israel-Iran war Iran's government issued three-day visas for British journalists and other media outlets to attend the summit, which was hosted by Iran's Institute for Political and International Studies, affiliated with the country's Foreign Ministry. Titled \"International Law Under Assault: Aggression and Self-Defense,\" it was held inside the Martyr General Qassem Soleimani Building, named for the Revolutionary Guard expeditionary leader killed by a US drone strike in 2020. The conference included papers by Iranian political analysts offering Tehran's view of the 12-day war in June. The conflict started on 13 June 2025 with Israel launching airstrikes on Iranian nuclear sites and ended on 23 June 2025 when a ceasefire was announced. During the entire conflict, Israel said 28 people were killed, while Tehran said 627 died in Iran. Iran finds itself in a difficult moment after the war, which decimated the country's air defence systems. Meanwhile, economic pressures and societal change continue to challenge Iran's Shiite theocracy, which so far has held off on making decisions on whether to enforce its mandatory hijab laws or raise the price of government-subsidised petrol, both of which have sparked nationwide protests in the past."
    },
    {
        "title": "Nearly 70 schools to close in Australia over fears of asbestos in play sand",
        "description": "Dozens of schools in the Australian Capital Territory (ACT) will be closed on Monday following a recall of coloured play sand, which authorities have warned poses an asbestos risk.",
        "url": "https://news.sky.com/story/nearly-70-schools-to-close-in-australia-over-fears-of-asbestos-in-play-sand-13471202",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-school-classroom-education_6890045.jpg?20250418165655",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 12:39:00",
        "Headline": "Store chains Kmart and Target have recalled a sand product after traces of asbestos were detected, with authorities saying a comprehensive assessment is under way. ",
        "Content": "Dozens of schools in the Australian Capital Territory (ACT) will be closed on Monday following a recall of coloured play sand, which authorities have warned poses an asbestos risk. A comprehensive audit is under way as the use of the product \"is widespread across ACT public schools,\" the government has said. Store chains Kmart and Target have issued a voluntary recall for one of their sand products, after asbestos was detected in some samples. A total of 69 ACT schools have been identified as stocking this brand of sand, and will be closed on Monday, while 23 schools will remain open. Of the open schools, three have \"small stocks\" of the sand, but \"these are isolated and not impacting learning,\" while the remaining 20 do not have this or any craft sand products, according to the government. \"In line with our regulatory obligations, and in the interest of the safety of our students, staff and community, we have decided to close some schools that have this product to allow for assessment, clean-up, and remediation to occur,\" the government said. The announcement follows previous closures of ACT public schools on Friday and national advice from the Australian Competition and Consumer Commission (ACCC) regarding a different decorative coloured sand, Kadink Decorative Sand, also used in schools. \n                  Three men and two women in their 20s have died in car crash in Co Louth, Irish police say\n                 \n                  Inside Jordan warehouse where Gaza aid held 'after being refused entry by Israel'\n                 \n                  Mexico: Thousands march against crime and corruption in Generation Z protests, with 100 police injured\n                 The government said this sand was found to contain traces of chrysotile asbestos. The recall is \"a precautionary action based on preliminary results, and more comprehensive scientific testing is under way,\" the government said. Read more from Sky News:UK temperatures could fall to -7C as cold snap follows stormUK not investing in Brazil rainforest fund it helped design \"Regulatory authorities are taking a precautionary approach to minimise any potential risk. This includes advice to stop using any identified products and to follow recall and disposal instructions,\" the government said. \"Based on currently available information, the risk to human health from exposure to these products is assessed as low,\" it said, adding it does not recommend \"any clinical assessment for those who may have been in contact with this product\". Yvette Berry, the Deputy Chief Minister and Labor member for the district of Ginninderra, north of Canberra, said on Sunday afternoon that authorities continue to assess the situation. \"I know that this has been worrying for our families and staff,\" Ms Berry said in a post on Facebook, adding that \"based on currently available information, the risk to human health from exposure to these products is assessed as low.\" \"Thank you to our community - we appreciate your patience and your understanding.\""
    },
    {
        "title": "Extensive search off Ireland's coast for missing Royal Fleet Auxiliary sailor ends",
        "description": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said.",
        "url": "https://news.sky.com/story/extensive-search-off-irelands-coast-for-missing-royal-fleet-auxiliary-sailor-ends-13471276",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rnli-lifeboat-search_7083430.jpg?20251116160729",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-16 15:21:00",
        "Headline": "The Irish Coast Guard said they had received a distress call on Saturday morning from a UK naval support vessel.  The Ministry of Defence say they are investigating the incident.",
        "Content": "An extensive multi-agency search off Ireland's coast for a missing sailor linked to the Royal Navy has ended without success, the Ministry of Defence has said. The Royal Fleet Auxiliary (RFA) Tidesurge crew member was last seen at about 10.30pm on Friday. The search has been taking place in the sea off the northwest coast between Tory Island, Co Donegal, and Eagle Island, Co Mayo. Defence Secretary John Healey said: \"After an extensive search, it is with deep sadness that we confirm the missing crew member of RFA Tidesurge has not been found. \"My thoughts are with their family during this tragic time, as well as their fellow crew members. \"I am hugely grateful to the Irish authorities, the RNLI, Royal Air Force and Royal Navy who have responded rapidly to this incident and have worked tirelessly on the search.\" No further details have been released about the crew member and their family has requested privacy. \n                  Two-thirds of woman in armed forces have experienced sexualised behaviour, damning internal survey finds\n                 \n                  Royal Navy destroyer intercepts Russian warship off UK coast\n                 \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 The Irish Coast Guard said they received a distress call before 9am on Saturday from a UK naval support vessel. They immediately launched a search and rescue operation after the serviceperson was declared missing. The RFA comprises sailors - officers and ratings - who are employed as civil servants rather than members of the armed forces. Its ships provide vital support to the Royal Navy. A Ministry of Defence spokesman said: \"After an extensive search for a missing crew member of a Royal Fleet Auxiliary (RFA) ship's company, the individual has not been found, and the search has now ended. \"The individual's family have been informed, and an investigation is now under way into the incident. No other individuals have been harmed or reported missing.\" Read more:Five dead after car crash in IrelandThousands march in Mexico protests The search, which involved the Irish Coast Guard, Royal Navy, Royal Air Force, RNLI and Irish authorities, was coordinated by the Irish Coast Guard's maritime rescue sub centre at Malin, a village in County Donegal. Ireland's Department of Transport previously said this had involved UK naval support vessels and three RNLI all weather lifeboats based at Ballyglass, Arranmore Island and Lough Swilly. The Irish Coast Guard also deployed two planes and a helicopter to assist from the air."
    },
    {
        "title": "Brazil 'surprised' UK not investing in new rainforest fund it helped design",
        "description": "Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.&#160;",
        "url": "https://news.sky.com/story/brazil-surprised-uk-not-investing-in-new-rainforest-fund-it-helped-design-13470462",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-amazon-rainforest-brazil_7082402.png?20251114231936",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "Brazil is touting what could be a radical new solution to tackle deforestation, flipping the economics in favour of protecting the forest. But it needs more cash to get it off the ground.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.  The Amazon nation has used its role as host of the COP30 climate talks to tout its new scheme, which it drew up with the help of countries including the UK and Indonesia. With Britain's budget day looming, Prime Minister Sir Keir Starmer decided against chipping in when he visited the Amazonian city of Belem this month. The news came out the day before Brazil was about to launch it. \"The Brazilians were livid\" about the timing, one source told Sky News. Garo Batmanian, director-general of the Brazilian Forestry Service and coordinator of the new scheme, said: \"We were expecting [Britain to pay in] because the UK was the very first one to support us.\" The so-called Tropical Forests Forever Facility (TFFF) was drawn up with the help of \"very bright people from the UK\", according to Mr Batmanian. \n                  'A ray of hope': Forest destruction in Brazil and Colombia has fallen 'dramatically'\n                 \n                  Deforestation report: UK's 'unsustainable' consumption putting 'enormous pressure' on world's forests, MPs warn\n                 \n                  Eight Latin American countries have met to talk about the Amazon - this is why it's so important to protect it\n                 \"So we are a bit surprised, but we expect that once internal situations get better, hopefully they will come through,\" he added. The UK's climate envoy, Rachel Kyte, told Sky News: \"The PM agreed the decision was about not doing it now, as opposed to not ever. \"We will look at the TFFF after the budget and are carefully tracking how others are investing.\" The fund has been hailed as a breakthrough - if Brazil can get if off the ground. Paul Polman, former Unilever boss and now co-vice chair of Planetary Guardians, said it could be the \"first forest-finance plan big enough to change the game\". Why do tropical forests need help? At their best, tropical forests like the Amazon and the Congo Basin provide food, rainfall and clean air for millions of people around the world. They soak up carbon dioxide - the main driver of climate change - providing a cooling effect on a heating planet. But they are being nibbled away at by extractive industries like oil, logging, soy and gold. Parts of the Amazon rainforest already emit more carbon dioxide than they store. Other pockets are expected to collapse in the next few decades, meaning they'd no longer be rainforests at all. Read more from COP30:Climate protest in Brazilian city aims to hold governments' feet to the fireAre climate summits saving the world - or just hot air?COP30 - why is it so controversial? Cristiane Mazzetti, senior forest campaigner at Greenpeace Brazil, said: \"Science is saying we need to immediately stop deforestation and start restoring what was once lost. \"And in Brazil, we already have enough open land that could be better used for agricultural expansion... There is no need [to open up] new areas.\" Can Brazil's new investment fund save the world's rainforests? For decades, forests have been worth more dead than alive. Successive attempts to save them have fallen flat because they've not been able to flip the economics in favour of conservation, or ensure a long-term stream of cash. Brazil hopes the TFFF, if it launches, would make forests worth more standing than cut down, and pay out to countries and communities making that happen. \"We don't pay only for carbon, we are paying for a hectare of standing forest. The more forests you have, the more you are paid,\" said Mr Batmanian. The other \"innovation\" is to stop relying on aid donations, he said. \"There is a lot of demand for overseas development assistance. It's normal to have that. We have a lot of crisis, pandemics, epidemics out there.\" Instead, the TFFF is an investment fund that would compete with other commercial propositions. Mr Polman said: \"This isn't charity, it's smart economic infrastructure to protect the Amazon and keep our planet safe.\" How does the TFFF raise money? The idea is to raise a first tranche of cash from governments that can de-risk the fund for private investors. Every $1 invested by governments could attract a further $4 of private cash. The TFFF would then be able to take a higher amount of risk to raise above-market returns, Brazil hopes. That means it could generate enough cash to pay competitive returns to investors and payments to the eligible countries and communities keeping their tropical trees upright. At least 20% of the payments has been earmarked for indigenous communities, widely regarded as the best stewards of the land. Many, but not all, have welcomed the idea. Will the TFFF work? The proposal needs at least $10-25bn of government money to get off the ground. So far it has raised $5.5bn from the likes of Norway, France, and Indonesia. And the World Bank has agreed to host it, signalling strong credibility. But it's a hard task to generate enough money to compete with lucrative industries like gold and oil, many of which governments already invest in. Dr Andreza Aruska de Souza Santos, director of King's College London's Brazil Institute, said TFFF has the potential to make it \"very financially viable to have a forest as a forest\". \"But the problem is that TFFF would need to compete with these very profitable industries... because you need to capture as much money from governments, from investors. \"And so far it's not quite balancing the competitiveness of other sectors that are potentially harmful for forests.\""
    },
    {
        "title": "Marjorie Taylor Greene 'open to moving forward' after row with Donald Trump",
        "description": "Republican congresswoman Marjorie Taylor Greene has said she is ready to mend relations with Donald Trump after a high-profile row between the pair.",
        "url": "https://news.sky.com/story/marjorie-taylor-greene-open-to-moving-forward-after-row-with-donald-trump-13471445",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-marjorie-taylor-greene_7082456.jpg?20251115031920",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-16 20:32:00",
        "Headline": "The Georgia representative and Mr Trump had a very public falling out over the release of the Epstein files - but now she says she wants to move on.",
        "Content": " Republican congresswoman Marjorie Taylor Greene has said she is ready to mend relations with Donald Trump after a high-profile row between the pair. The former MAGA ally had said the US president was \"coming after me hard\" to prevent her efforts to release more files about Jeffrey Epstein. But writing on X on Sunday, she said forgiveness was a \"major part\" of her Christian faith. \"I'm here to show how it's possible to settle our differences and move forward as Americans,\" she wrote. \"That's why I'm always willing to go on shows with different viewpoints. \"I truly believe in forgiveness and I am open to moving forward with the President.\" A day earlier, Ms Greene claimed she was facing threats after a barrage of personal criticism from Mr Trump. She said she'd received warnings about her safety and that \"a hotbed of threats\" were \"being fuelled and egged on by the most powerful man in the world\". \n                  Most advanced US aircraft carrier arrives close to Venezuela as Donald Trump administration builds-up forces\n                 \n                  Marjorie Taylor Greene says she's received threats over Trump feud\n                 \n                  Trump to push ahead with BBC lawsuit: Three experts on why he might struggle to win\n                  \"As a woman, I take threats from men seriously,\" Ms Greene added. \"I now have a small understanding of the fear and pressure the women, who are victims of Jeffrey Epstein and his cabal, must feel.\" The congresswoman said Mr Trump's \"aggression against me\" - considering she was a staunch supporter of his policies - was \"completely shocking to everyone\".  Read more:Who is MAGA ally Marjorie Taylor Greene?Trump goes to war with the BBC The fight began when a petition to vote on the full release of the Epstein files received enough signatures - including Ms Greene's - to bring it to a vote in the House of Representatives. Mr Trump rescinded his support for Ms Greene, dubbed her a \"RINO\" (Republican In Name Only), and suggested he could support a challenge against her.  Ms Greene claimed text messages she sent to the president about the Epstein files had \"sent him over the edge\". She wrote on social media: \"Of course he's coming after me hard to make an example to scare all the other Republicans before next week's vote to release the Epstein files.\" High-profile figures, including Mr Trump, have been referenced in some of the documents. The White House has said the \"selectively leaked emails\" were an attempt to \"create a fake narrative to smear President Trump\", who has consistently denied any involvement or knowledge about Epstein's sex trafficking operation. Mr Trump has called the Epstein files a \"hoax\" created by the Democrats to \"deflect\" from the US government shutdown. Epstein took his own life in prison in 2019 while awaiting trial for sex trafficking charges."
    },
    {
        "title": "Most advanced US aircraft carrier arrives close to Venezuela as Donald Trump administration builds-up forces",
        "description": "The most advanced US aircraft carrier has travelled to the Caribbean Sea in what has been interpreted as a show of military power and a possible threat to Venezuela's Nicolas Maduro regime. ",
        "url": "https://news.sky.com/story/most-advanced-us-aircraft-carrier-arrives-close-to-venezuela-as-donald-trump-administration-builds-up-forces-13471399",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-uss-gerald-r-ford-navy_7083555.jpg?20251116190454",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-16 21:44:00",
        "Headline": "The American government has claimed that it is working to prevent criminal cartels from smuggling drugs. Some believe it is aiming to force the Nicolas Maduro regime from power.",
        "Content": "The most advanced US aircraft carrier has travelled to the Caribbean Sea in what has been interpreted as a show of military power and a possible threat to Venezuela's Nicolas Maduro regime.  The USS Gerald R. Ford and other warships arrived in the area with a new influx of troops and weaponry on Sunday. It is the latest step in a military build-up that the Donald Trump administration claims is aimed at preventing criminal cartels from smuggling drugs to America. Since early September, US strikes have killed at least 80 people in 20 attacks on small boats accused of transporting narcotics in the Caribbean and eastern Pacific Ocean. Mr Trump has indicated that military action would expand beyond strikes by sea, saying the US would \"stop the drugs coming in by land\". The US government has released no evidence to support its assertions that those killed in the boats were \"narcoterrorists\", however. The arrival of the USS Gerald R. Ford now rounds off the largest increase in US firepower in the region in generations. \n                  Marjorie Taylor Greene 'open to moving forward' after row with Donald Trump\n                 \n                  Marjorie Taylor Greene says she's received threats over Trump feud\n                 \n                  Trump to push ahead with BBC lawsuit: Three experts on why he might struggle to win\n                 With its arrival, the \"Operation Southern Spear\" mission includes nearly a dozen navy ships and about 12,000 sailors and marines. Rear Admiral Paul Lanzilotta, who commands the strike group, said it will bolster an already large force of American warships to \"protect our nation's security and prosperity against narco-terrorism in the Western Hemisphere\". Admiral Alvin Holsey, the US commander who oversees the Caribbean and Latin America, said in a statement that the American forces \"stand ready to combat the transnational threats that seek to destabilise our region\". Government officials in Trinidad and Tobago have announced that they have already begun \"training exercises\" with the US military that are due to run over the next week. The island is just seven miles from Venezuela at its closest point. The country's minister of foreign affairs, Sean Sobers, said the exercises were aimed at tackling violent crime in Trinidad and Tobago, which is frequently used by drug traffickers as a stopover on their journey to Europe or North America. Venezuela's government has described the training exercises as an act of aggression.  They had no immediate comment on Sunday regarding the arrival of the USS Gerald R. Ford. The US has long used aircraft carriers to pressure and deter aggression by other nations because its warplanes can strike targets deep inside another country. Read more:Satellite images show US military edging closer to VenezuelaTrump ally 'now receiving threats' after falling out with presidentUS president will sue Panorama Some experts say the Ford is ill-suited to fighting cartels, but it could be an effective instrument of intimidation to push Mr Maduro, who faces charges of narcoterrorism in the US, to step down. Mr Maduro has said the US government is \"fabricating\" a war against him. The US president has justified the attacks on drug boats by saying the country is in \"armed conflict\" with drug cartels, while claiming the boats are operated by foreign terrorist organisations. US politicians have pressed Mr Trump for more information on who is being targeted and the legal justification for the boat strikes. Elizabeth Dickinson, the International Crisis Group's senior analyst for the Andes region, said: \"This is the anchor of what it means to have US military power once again in Latin America. \"And it has raised a lot of anxieties in Venezuela but also throughout the region. I think everyone is watching this with sort of bated breath to see just how willing the US is to really use military force.\""
    },
    {
        "title": "Interpath-owner to kick off £900m sale of Claire's administrator",
        "description": "The restructuring firm drafted in to advise Sir Jim Ratcliffe on a radical cost-cutting programme at Manchester United Football Club will this week be put up for sale with a &#163;900m price tag.",
        "url": "https://news.sky.com/story/interpath-owner-to-kick-off-163900m-sale-of-claire8217s-administrator-13471170",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-accessories-claires-accessories_6965200.jpg?20250720165751",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-16 10:50:00",
        "Headline": "HIG Europe will on Monday begin courting bidders for KPMG’s former restructuring arm, which has advised Sir Jim Ratcliffe on a far-reaching cost-cutting exercise at Old Trafford, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The restructuring firm drafted in to advise Sir Jim Ratcliffe on a radical cost-cutting programme at Manchester United Football Club will this week be put up for sale with a £900m price tag. Sky News has learnt that advisers to HIG Europe, the majority shareholder in Interpath Advisory, will on Monday begin circulating information about the business to potential buyers.  City insiders said on Sunday that HIG had received a large volume of inbound enquiries from prospective suitors since it emerged that it was in the process of appointing bankers at Moelis to handle an auction.  Blackstone, Bridgepoint, Onex, PAI Partners and Permira are among the buyout firms expected to show an interest in buying Interpath, according to banking sources.  \n                  Former chancellor Osborne is shock contender to head HSBC\n                 \n                  Telegraph future in limbo again as RedBird abandons £500m deal\n                 \n                  The cheapest holiday months are coming - experts give their recommendations | Money blog\n                 Interpath was spun out of KPMG UK in 2021 in a deal triggered by the changing regulatory climate in the audit profession.  Growing concerns over conflicts of interest between accountancy giants' audit and consulting arms had been exacerbated by the collapse of companies such as BHS and Carillion, prompting a number of disposals by 'big four' firms.  Interpath has advised on a string of prominent restructuring and cost-saving mandates for clients, including acting as administrator to the UK and Ireland subsidiaries of Claire's, the accessories retailer which collapsed during the summer.  Sources said that Interpath had doubled its earnings before interest, tax, depreciation and amortisation since HIG Europe acquired the business four-and-a-half years ago.  It is also said to be on track to record a 20% increase in annual revenues in the current financial year.  A sale of Interpath is expected to be agreed during the first quarter of 2026.  HIG declined to comment."
    },
    {
        "title": "Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms",
        "description": "Home Secretary Shabana Mahmood plans to impose Trump-style visa bans&#160;on three African countries&#160;if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system.",
        "url": "https://news.sky.com/story/home-secretary-to-announce-largest-shake-up-of-uk-immigration-in-modern-times-13471410",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-channel-crossings_7083692.jpg?20251116231759",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-16 22:44:00",
        "Headline": "Shabana Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War.",
        "Content": " Home Secretary Shabana Mahmood plans to impose Trump-style visa bans on three African countries if they fail to take back illegal migrants as part of \"sweeping reforms\" of the UK's immigration system. Angola, Namibia and the Democratic Republic of Congo will face visa sanctions, blocking their tourists, VIPs and business people from travelling to Britain if they do not improve co-operation on removals. Ms Mahmood said: \"In Britain, we play by the rules. When I said there would be penalties for countries that do not take back criminals and illegal immigrants, I meant it. \"My message to foreign governments today is clear: accept the return of your citizens or lose the privilege of entering our country.\" The move was reportedly inspired by President Trump's homeland security secretary, Kristi Noem, who has overseen the mass deportation policy in the US, according to the Times. Ms Mahmood will address the House of Commons today to lay out \"the most sweeping reforms to tackle illegal migration in modern times\", effectively since the Second World War. Modelled on the Danish system, the aim of the reforms is to make the UK less attractive for illegal immigrants and make it easier to deport them. \n                  Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 Under the plans, she will bring forward a bill to change how article 8 of the European Convention on Human Rights (ECHR), the right to family life, is applied in migration court cases. Read more:Shabana Mahmood is the new hard woman of British politicsHere's how the Danish migration model works That's as the Home Office claimed it had seen a rise in the use of rights-based appeals in recent years as a means of avoiding deportation. The changes would see only those with immediate family in the UK, such as a parent or child, being able to use article 8 as grounds to stay in future.  The home secretary, who has been in the job for 73 days, also plans to change the law so that multiple attempts to appeal against refusals for asylum will no longer be allowed. Furthermore, refugees will face a 20-year wait before they can apply for permanent settlement as part of the government's plans. The Home Office said the \"golden ticket\" deal has seen asylum claims surge in the UK, drawing people across Europe, through safe countries, on to dangerous small boats. Political correspondent We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises. The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. Read more Under the proposals, refugee status will become temporary and subject to regular review, with refugees removed once their home countries are deemed safe. Housing and weekly allowances will no longer be guaranteed for asylum seekers.  But the shake-up will also see the introduction of safe and legal routes to the UK in a bid to cut dangerous journeys in small boats across the Channel. A new independent body - similar to one in operation in Denmark - will be set up to fast-track the removal of dangerous criminals, and last-minute appeals will be expedited. Ms Mahmood has denied that her plans to clamp down on illegal immigration are \"racist\" - instead describing them as a \"moral mission\". She said illegal immigration was causing \"huge divides\" in the UK, and added: \"I do believe we need to act if we are to retain public consent for having an asylum system at all.\"  Speaking on Sunday Morning with Trevor Phillips, Ms Mahmood said she had observed how illegal migration had been \"creating division across our country\". She added: \"I can see that it is polarising communities across the country. I can see that it is dividing people and making them estranged from one another. I don't want to stand back and watch that happen in my country.\" Prime Minister Sir Keir Starmer said: \"Britain has always been a fair, tolerant and compassionate country - and this government will always defend those values. \"But in a more volatile world, people need to know our borders are secure and rules are enforced. These reforms will block endless appeals, stop last-minute claims and scale up removals of those with no right to be here.\"  Conservative Party leader Kemi Badenoch welcomed Ms Mahmood \"finally talking seriously about tackling illegal immigration\", but described the home secretary's proposed plans as \"a few weak changes\". She said: \"If the home secretary actually wants to cut illegal immigration, she should take up my offer to sit down with her and work on a plan that will actually stop the boats, rather than a few weak changes that will meet the approval of Labour MPs.\" Speaking earlier on Sunday, Reform UK leader Nigel Farage said: \"The home secretary sounds like a Reform supporter.\" \"Sadly with the Human Rights Act and ECHR membership, the changes won't survive the courts or probably even her own backbenchers,\" he added. Latest Home Office figures show 39,075 people have arrived in the UK after crossing the English Channel in small boats so far this year. The arrivals have already passed the number for the whole of 2024 (36,816) and 2023 (29,437), but the number is below the total for 2022 (45,774)."
    },
    {
        "title": "Shabana Mahmood is the new hard woman of British politics - and potential successor to Starmer",
        "description": "We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\".",
        "url": "https://news.sky.com/story/shabana-mahmood-is-the-new-hard-woman-of-british-politics-and-potential-successor-to-starmer-13471232",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-migrant-crossings-asylum-seekers_7083695.jpg?20251116234532",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-16 13:58:00",
        "Headline": "In a warning to Labour MPs who will be uncomfortable with her approach, Ms Mahmood has warned it is \"the last chance for decent, moderate politics\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n  We're told that Shabana Mahmood, the still new home secretary, is \"a woman in a hurry\". She's been in the job for 73 days - and is now announcing \"the most sweeping reforms to tackle illegal migration in modern times\" - effectively since the Second World War. Politics latest: Mahmood dismisses 'tittle-tattle' over leadership rumours Her language is not just tough - it's radical. Not what you'd have expected to hear from a Labour home secretary even just a few months ago. \"Illegal migration\", she believes, \"is tearing our country apart. The crisis at our borders is out of control\". Her team argues that those never-ending images of people crossing the Channel in small boats have led to a complete loss of faith in the government's ability to take any action at all - let alone deliver on its promises.  The political reality is that successive failures of Tory and Labour ministers have fuelled the inexorable rise of Reform. \n                  Home secretary threatens Trump-style visa ban on three countries as part of radical asylum reforms\n                 \n                  Changes needed to fix 'broken system', as illegal migration 'creating division across our country', says home secretary\n                 \n                  Home secretary vows to end UK's 'golden ticket' for asylum seekers - as Denmark-based reforms to be unveiled\n                 But speaking to Sir Trevor Phillips on Sky News, Ms Mahmood firmly hit back at suggestions today's announcements are pandering to a racist narrative from the far right. \"It's not right-wing talking points or fake news or misinformation that is suggesting that we've got a problem,\" she said. \"I know, because I have now seen this system inside out. It is a broken system. We have a genuine problem to fix. People are angry about something that is real.  \"It is my job, therefore, to think of a proper solution to this very real problem, to do so in line with my values as a Labour politician, but also as a British citizen, and to have solutions that work so that I can unite a divided country.\" There are many striking elements to this. While she's not been in the job for all that long, her government has been in power for 16 months. Her own press release highlights that over the past full calendar year asylum claims here have gone up by 18% - compared with a drop of 13% elsewhere in the EU. The UK, she argues, has become a \"golden ticket\" for asylum seekers due to \"far more generous terms\" than other countries in Europe. While she politely insists that her predecessor's policies - the one in one out deal with France, closer partnership with law enforcement across Europe - are beginning to take effect, the message is clear. No one in office before Shabana has had the stomach to grasp the nettle.  The Home Office is determined to present their boss as the new hard woman of British politics. In a bleak warning to those in her party who will be deeply uncomfortable with this unflinching approach, we're told she believes this is \"the last chance for decent, moderate politics\". \"If these moderate forces fail, something darker will follow…. if you don't like this, you won't like what follows me.\" That's a clear reference to the anti-asylum policies of Reform and the Conservatives, who are pledging to leave the European Convention on Human Rights and deport all illegal arrivals. Both parties have responded by effectively claiming they don't trust Labour to deliver on this, given they believe the government has lost control of our borders and overseen a surge in asylum claims. That much Ms Mahmood herself has already acknowledged. It's unusual to hear a Conservative shadow minister like Chris Philp responding to a government announcement by claiming they will support the \"sensible steps\" the Home Office is making. Unsurprisingly, he went on to belittle her ideas as \"very small steps\" combined with \"gimmicks\" - but the main thrust of his critique was that Labour lacks the authority to push these kinds of measures through parliament, given the likely opposition from their own left wingers. It's a fair point - but the lack of fundamental disagreement highlights the threat these plans pose to her opponents. If the government looks like it might actually succeed in bringing down the numbers - and of course that's a colossal if - Ms Mahmood will effectively have outflanked and neutralised much of the threat from both the Tories and Reform. That's why she's so keen to mention her Danish inspiration - a centre-left government which managed to see off the threat from right-wing parties through its tough approach to migration, without having to leave the ECHR. Read more:Migrants shopping for life jackets: Inside the route to the ChannelHere's how the Danish migration model works The Home Office is planning further announcements on new safe and legal routes. But refugee charities have described the new measures as harsh, claiming they will scapegoat genuine refugees, fail to integrate them into society, and fail to function as a deterrent either. There will surely be an almighty internal row among Labour MPs about the principle of ripping up the post-war settlement for refugees. For a government floundering after the political chaos of the last few weeks and months, Ms Mahmood is a voice of certainty and confidence. At a moment of such intense backroom debate over the party's future direction, it's hard to avoid seeing her performance this weekend as a starting pitch for the leadership."
    },
    {
        "title": "'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?",
        "description": "This week, many of the tech world's glitterati gathered in Lisbon for Web Summit, a sprawling conference showcasing everything from dancing robots to the influencer economy.&#160;",
        "url": "https://news.sky.com/story/are-we-becoming-too-cautious-around-ai-13470262",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-necklace_7082070.jpg?20251114172522",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "One of the inventors of Siri, the original AI agent, wants you to \"handle with care\" when it comes to artificial intelligence. But are we becoming too cautious around AI in Europe and risking our future?",
        "Content": "\n          Science and technology reporter\n        This week, many of the tech world's glitterati gathered in Lisbon for Web Summit, a sprawling conference showcasing everything from dancing robots to the influencer economy.  In the pavilions - warehouse-sized rooms chock full of stages, booths and people networking - the phrase \"agentic AI\" was everywhere. There were AI agents that hung around your neck in jewellery, software to build agents into your workflows and more than 20 panel discussions on the topic. Agentic AI is essentially artificial intelligence that can do specific tasks by itself, like book your flights or order an Uber or help a customer. It's the industry's current buzzword and has even crept into the real world, with the Daily Mail listing \"agentic\" as an 'in' word for Gen Z last week. But AI agents aren't new. In fact, Babak Hodjat, now chief AI officer at Cognizant, invented the technology behind one of the most famous AI agents, Siri, in the 1990s. \"Back then, the fact that Siri itself was multi-agentic was a detail that we didn't even talk about - but it was,\" he told Sky News from Lisbon. \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 \n                  Ex-Starmer adviser's start-ups backer nears £1bn valuation\n                 \"Historically, the first person that talked about something like an agent was Alan Turing.\" New or not, AI agents are thought to come with even more risks than general-purpose AI, because they interact with and modify real-world scenarios.  The risks that come with AI, like bias in its data or unforeseen circumstances in how it interacts with humans, are magnified by agentic AI because it interacts with the world by itself. \"Agentic AI introduces new risks and challenges,\" wrote the IBM Responsible Technology Board in their 2025 report on the technology. \"For example, one new emerging risk involves data bias: an AI agent might modify a dataset or database in a way that introduces bias. \"Here, the AI agent takes an action that potentially impacts the world and could be irreversible if the introduced bias scales undetected.\" But for Mr Hodjat, it's not AI agents we need to worry about. \"People are over-trusting [AI] and taking their responses on face value without digging in and making sure that it's not just some hallucination that's coming up. \"It is incumbent upon all of us to learn what the boundaries are, the art of the possible, where we can trust these systems and where we cannot, and educate not just ourselves, but also our children.\" His warning will feel familiar, particularly in Europe, where there's an increased wariness around AI compared to the US. But have we become too cautious when it comes to AI - at the risk of a far more existential threat in the future? Jarek Kutylowski, chief executive of German AI language giant DeepL, certainly thinks so. This year, the EU AI Act came into force, strict regulations about how companies can and can't use AI. In the UK, companies are governed by existing legislation like GDPR and there's uncertainty about how strict our rules will be in the future. When asked if we needed to slow down AI innovation in order to put stricter regulations in place, Mr Kutylowski said it was a question worth grappling with… but in Europe, we are taking it too far. Read more from science and technology:NASA cancels space launchJeff Bezos's rocket lands on EarthNew law could help tackle AI-generated child abuse at source \"Looking at the apparent risks is easy, looking at the risks like what are we going to miss out on if we don't have the technology, if we are not successful enough in adopting that technology, that is probably the bigger risk,\" said Mr Kutylowski. \"I see definitely a much larger risk in Europe being left behind in the AI race. \"You won't see it until we start falling behind and until our economies cannot capitalise on those productivity gains that maybe other parts of the world will see. \"I do not believe personally that technological progress can be stopped in any way, so it is more of a question of 'how do we pragmatically embrace what is coming ahead?\""
    },
    {
        "title": "Brazil 'surprised' UK not investing in new rainforest fund it helped design",
        "description": "Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.&#160;",
        "url": "https://news.sky.com/story/brazil-surprised-uk-not-investing-in-new-rainforest-fund-it-helped-design-13470462",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-amazon-rainforest-brazil_7082402.png?20251114231936",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "Brazil is touting what could be a radical new solution to tackle deforestation, flipping the economics in favour of protecting the forest. But it needs more cash to get it off the ground.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Brazil was \"a bit surprised\" Britain hasn't contributed to a new investment fund to protect tropical forests, despite having helped to design it, a senior official has told Sky News.  The Amazon nation has used its role as host of the COP30 climate talks to tout its new scheme, which it drew up with the help of countries including the UK and Indonesia. With Britain's budget day looming, Prime Minister Sir Keir Starmer decided against chipping in when he visited the Amazonian city of Belem this month. The news came out the day before Brazil was about to launch it. \"The Brazilians were livid\" about the timing, one source told Sky News. Garo Batmanian, director-general of the Brazilian Forestry Service and coordinator of the new scheme, said: \"We were expecting [Britain to pay in] because the UK was the very first one to support us.\" The so-called Tropical Forests Forever Facility (TFFF) was drawn up with the help of \"very bright people from the UK\", according to Mr Batmanian. \n                  'A ray of hope': Forest destruction in Brazil and Colombia has fallen 'dramatically'\n                 \n                  Deforestation report: UK's 'unsustainable' consumption putting 'enormous pressure' on world's forests, MPs warn\n                 \n                  Eight Latin American countries have met to talk about the Amazon - this is why it's so important to protect it\n                 \"So we are a bit surprised, but we expect that once internal situations get better, hopefully they will come through,\" he added. The UK's climate envoy, Rachel Kyte, told Sky News: \"The PM agreed the decision was about not doing it now, as opposed to not ever. \"We will look at the TFFF after the budget and are carefully tracking how others are investing.\" The fund has been hailed as a breakthrough - if Brazil can get if off the ground. Paul Polman, former Unilever boss and now co-vice chair of Planetary Guardians, said it could be the \"first forest-finance plan big enough to change the game\". Why do tropical forests need help? At their best, tropical forests like the Amazon and the Congo Basin provide food, rainfall and clean air for millions of people around the world. They soak up carbon dioxide - the main driver of climate change - providing a cooling effect on a heating planet. But they are being nibbled away at by extractive industries like oil, logging, soy and gold. Parts of the Amazon rainforest already emit more carbon dioxide than they store. Other pockets are expected to collapse in the next few decades, meaning they'd no longer be rainforests at all. Read more from COP30:Climate protest in Brazilian city aims to hold governments' feet to the fireAre climate summits saving the world - or just hot air?COP30 - why is it so controversial? Cristiane Mazzetti, senior forest campaigner at Greenpeace Brazil, said: \"Science is saying we need to immediately stop deforestation and start restoring what was once lost. \"And in Brazil, we already have enough open land that could be better used for agricultural expansion... There is no need [to open up] new areas.\" Can Brazil's new investment fund save the world's rainforests? For decades, forests have been worth more dead than alive. Successive attempts to save them have fallen flat because they've not been able to flip the economics in favour of conservation, or ensure a long-term stream of cash. Brazil hopes the TFFF, if it launches, would make forests worth more standing than cut down, and pay out to countries and communities making that happen. \"We don't pay only for carbon, we are paying for a hectare of standing forest. The more forests you have, the more you are paid,\" said Mr Batmanian. The other \"innovation\" is to stop relying on aid donations, he said. \"There is a lot of demand for overseas development assistance. It's normal to have that. We have a lot of crisis, pandemics, epidemics out there.\" Instead, the TFFF is an investment fund that would compete with other commercial propositions. Mr Polman said: \"This isn't charity, it's smart economic infrastructure to protect the Amazon and keep our planet safe.\" How does the TFFF raise money? The idea is to raise a first tranche of cash from governments that can de-risk the fund for private investors. Every $1 invested by governments could attract a further $4 of private cash. The TFFF would then be able to take a higher amount of risk to raise above-market returns, Brazil hopes. That means it could generate enough cash to pay competitive returns to investors and payments to the eligible countries and communities keeping their tropical trees upright. At least 20% of the payments has been earmarked for indigenous communities, widely regarded as the best stewards of the land. Many, but not all, have welcomed the idea. Will the TFFF work? The proposal needs at least $10-25bn of government money to get off the ground. So far it has raised $5.5bn from the likes of Norway, France, and Indonesia. And the World Bank has agreed to host it, signalling strong credibility. But it's a hard task to generate enough money to compete with lucrative industries like gold and oil, many of which governments already invest in. Dr Andreza Aruska de Souza Santos, director of King's College London's Brazil Institute, said TFFF has the potential to make it \"very financially viable to have a forest as a forest\". \"But the problem is that TFFF would need to compete with these very profitable industries... because you need to capture as much money from governments, from investors. \"And so far it's not quite balancing the competitiveness of other sectors that are potentially harmful for forests.\""
    },
    {
        "title": "Sherlock star Benedict Cumberbatch's 'very odd job' - acting opposite an enormous bird in The Thing With Feathers",
        "description": "He's&#160;played Sherlock Holmes, Doctor Strange, and even voiced The&#160;Grinch&#160;but acting opposite a seven-foot (2.1m) crow may be one of the strangest roles Benedict Cumberbatch has taken on.&#160;",
        "url": "https://news.sky.com/story/sherlock-star-benedict-cumberbatchs-very-odd-job-acting-opposite-an-enormous-bird-in-the-thing-with-feathers-13470306",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-the-thing-with-feathers_7082211.jpg?20251114174113",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-16 00:01:00",
        "Headline": "The Dr Strange star plays a man whose wife dies suddenly, leaving him with their two young boys, who starts imagining a crow, a sort of \"unhinged Freudian therapist\" for him in his time of need, helping him process his grief.",
        "Content": "\n          Arts and entertainment correspondent\n        He's played Sherlock Holmes, Doctor Strange, and even voiced The Grinch but acting opposite a seven-foot (2.1m) crow may be one of the strangest roles Benedict Cumberbatch has taken on.  Speaking about his new film, The Thing With Feathers, he admits it's \"a very odd job, there's no getting away from it\". If the vision of Cumberbatch wrestling with a giant bird sounds like the sort of amusingly surreal movie you fancy taking a look at next week, it's important to understand that this is no comedy. While the film, based on Max Porter's eclectic novella Grief Is The Thing With Feathers, the film is at times disturbingly funny, but mostly it is an incredibly emotional take on the heartbreaking way we all process grief. Cumberbatch plays a man whose wife has died suddenly, leaving him with their two young boys. The story itself is split into three parts - dad, boys and crow. Crow - voiced by David Thewlis - is a figment of dad's imagination, a sort of \"unhinged Freudian therapist\" for him, according to Porter. Cumberbatch, a father of three, said this certainly wasn't a role he wanted to think about when he returned to his own family each night. \n                  'I'm shocked at how fragile I am still': Cumberbatch and Colman on protecting their sanity from perils of social media\n                 \n                  Benedict Cumberbatch and Gaby Hoffmann on Netflix series Eric\n                 \n                  Benedict Cumberbatch: 'I want to give them stability' - British actor says Ukrainian family will stay in his home\n                 \"I didn't take it home, I didn't talk about it…You have to work fast when you're a father of three with a busy home life, you know, it's very immediate the need they have of you, so you don't go in and talk about your day crying your eyes out on a sofa with a crow punching you in the face.\" Since Porter's award-winning work was first published in 2015 it has built a cult following. Using text, dialogue and poetry to explore grief from various characters' perspectives, the author says the subject matter is universal. \"Most of us are deeply eccentric in one way or another, like my father-in-law, apparently a very rational, blokey bloke, who's like 'when my mum died, a wren landed on the window and I knew it was my mum'. \"Grief puts us into these states where we are more attuned to the natural world and particularly more attuned to symbols and signs. So, imagining a crow moving in with the family actually makes a lot of sense to people, whereas, weirdly, five steps to getting better or get well soon or a hallmark card or whatever doesn't make much sense to the people when you're in that storm of pain.\" Read more from entertainment news:Wicked star 'felt really scared' growing up gay in schoolPope Leo meets with film stars and directors at Vatican While the film sees Cumberbatch portray a firestorm of emotions, he says he feels it's important to tackle weighty issues on screen. \"It is a universal experience, in one way or another you're 'gonna lose someone that you love during your life.\" The film, he says, explores grief through a male prism. \"At a time when there's a lot of very troubling influences on men without female presence in their lives, this thing of scapegoating and seeing the other as a threat, all of that comes into play within the allowance of grief to be a messy, scary, intimidating, chaotic, unruly and out of control place to exist as a man. \"This is a film that just leans into the idea that it's alright to have feelings, you bury them or hide them at your peril.\" The Thing With Feathers is out in cinemas in the UK and Ireland on 21 November."
    },
    {
        "title": "Hollywood icons meet Pope Leo - after agents were assured invites were not a hoax",
        "description": "The Pope met with film stars and directors at a special Vatican audience to celebrate cinema.",
        "url": "https://news.sky.com/story/pope-leo-meets-with-film-stars-and-directors-at-vatican-and-gets-a-basketball-jersey-from-spike-lee-13471069",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pope-leo-xiv-vatican_7083064.jpg?20251116033949",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-16 02:41:00",
        "Headline": "Dozens of Hollywood stars - including Spike Lee, Cate Blanchett, and Greta Gerwig, among others - were invited to an audience with the Pope at the Vatican.",
        "Content": " The Pope met with film stars and directors at a special Vatican audience to celebrate cinema. Welcoming dozens of Hollywood icons - including Spike Lee, Cate Blanchett, and Greta Gerwig, among others - to an audience hall, Leo XIV called film \"a popular art in the noblest sense, intended for and accessible to all\". The Vatican's culture ministry organised the occasion as part of its efforts to reach out to the secular world. \"When cinema is authentic, it does not merely console, but challenges,\" the Pope, who was elected earlier this year after the death of Pope Francis, told those in attendance. \"It articulates the questions that dwell within us, and sometimes, even provokes tears that we didn't know we needed to shed.\" Lee, best known for directing 1989's Do The Right Thing, told reporters that \"it was a surprise to me that I even got invited\", and gifted the pontiff a New York Knicks basketball jersey. Blanchett also said that the Pope's comments were inspiring, adding: \"Filmmaking is about entertainment, but it's about including voices that are often marginalised and not shy away from the pain and complexity that we're all living through right now.\" \n                  Royals visit to meet Pope Leo at Vatican is welcome relief for King Charles engulfed in Prince Andrew revelations\n                 \n                  King's Vatican visit latest: Pope gifts Charles specially crafted chair - as they pray together in 500-year first\n                 \n                  King and Queen arrive in Rome ahead of Pope Leo meeting\n                 Archbishop Paul Tighe, the deputy at the Vatican's culture ministry, said the guest list was put together over the last three months with the help of a handful of Hollywood contacts, including Martin Scorsese. Read more from Sky News:Pope and King pray together in 500-year first - as it happenedLeo's hug with brother shows how his life has changed forever Mr Tighe admitted that the Vatican had to convince Hollywood agents that the invitation to come meet Leo wasn't a hoax. \"It's an industry where people have their commitments months in advance and years in advance, so obviously it was a little hit and miss, but we're very pleased and very proud\" by the turnout, he said. Earlier this month, the Pope shared his top four favourite movies: 1946's It's a Wonderful Life, 1965's The Sound of Music, 1980's Ordinary People, and 1997's Life Is Beautiful."
    }
]