[
    {
        "title": "League table of foreign criminals awaiting deportation and their offences set to be published",
        "description": "A league table of foreign criminals and their offences is set to be published for the first time.",
        "url": "https://news.sky.com/story/league-table-of-foreign-criminals-awaiting-deportation-and-their-offences-set-to-be-published-13353517",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-generic-man-handcuffs_6300583.jpg?20230928072810",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 23:31:00",
        "Headline": "The Conservatives believe the figures will show the \"hard reality that mass migration is fuelling crime across our country\".",
        "Content": "A league table of foreign criminals and their offences is set to be published for the first time. The plans, due to be announced on Tuesday, will reportedly focus on those offenders awaiting deportation from the UK. The latest data shows there were 19,244 foreign offenders awaiting deportation at the end of 2024, a rise from 17,907 when the Conservatives left office in July and 14,640 at the end of 2022. Despite more offenders being deported since Labour came to power, the number waiting to be removed from the UK has been growing. Factors are understood to include the early release of inmates due to prison overcrowding, instability and diplomatic problems in some countries and a backlog of legal cases appealing deportation. Shadow home secretary Chris Philp said the decision to publish the nationalities of foreign criminals showed Labour had \"buckled\" under pressure from the Conservatives to disclose the data. The latest government statistics show there were 10,355 foreign nationals held in custody in England and Wales at the end of 2024, representing 12% of the prison population. \n                  Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report\n                 \n                  The Godfather-style gang war gripping two major cities - with brutal attacks caught on camera\n                 \n                  James McCall: Sales manager who sexually assaulted women while they slept jailed for 12 years\n                 The most common nationalities after British nationals were Albanian (11%), Polish (8%), Romanian (7%), which also represented the top three nationalities who were deported from the UK in 2024, according to Home Office figures. Home Secretary Yvette Cooper is understood to have ordered officials to release the details by the end of the year, according to The Daily Telegraph. The newspaper reported Ms Cooper overruled Home Office officials, who previously claimed it was too difficult to provide quality data on foreign criminals. A Home Office source said: \"Not only are we deporting foreign criminals at a rate never seen when Chris Philp and Robert Jenrick were in charge at the Home Office, but we will also be publishing far more information about that cohort of offenders than the Tories ever did.\" The source added that ministers wanted \"to ensure the public is kept better informed about the number of foreign criminals awaiting deportation, where they are from and the crimes they have committed\". In March, the government announced £5m in funding to deploy staff to 80 jails in England and Wales to speed up the deportation of foreign offenders. Read more from Sky News:'Return hubs' get UN backingSex offender allowed to stay in UKWoman born in UK faces being deported Foreign nationals sentenced to 12 months or more in prison are subject to automatic deportation, but the home secretary can also remove criminals if their presence in the UK is not considered desirable. Shadow justice secretary Robert Jenrick welcomed the news, saying: \"We will finally see the hard reality that mass migration is fuelling crime across our country... Frankly, the public deserved to know this [detail on foreign criminals] long ago.\""
    },
    {
        "title": "Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport",
        "description": "Hundreds of passengers have been taken off a plane after one of its engines caught fire as it was about to take off, airport officials have said.",
        "url": "https://news.sky.com/story/hundreds-of-passengers-evacuated-after-delta-air-lines-airbus-a330-engine-catches-fire-at-orlando-international-airport-13353450",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-plane-fire-delta-airlines_6893243.jpg?20250421190122",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 19:08:00",
        "Headline": "More than 280 people were taken off the flight after smoke began to appear from the engine as the plane was pushing back from the gate at Orlando International Airport.",
        "Content": "Hundreds of passengers have been taken off a plane after one of its engines caught fire as it was about to take off, airport officials have said. The Delta Air Lines plane carrying nearly 300 people was pushing back from the gate at Orlando International Airport in Florida when smoke began to appear from the engine on its right wing on Monday. There were no initial reports of injuries, the airline said. Pictures and video published on social media showed flames and smoke rising from the Airbus A330 and passengers sliding down an escape chute as they left the aircraft. Pope dies latest: King Charles leads tributes The plane was heading for Atlanta, a journey of more than 400 miles with a flight time of around one hour and 40 minutes. The Federal Aviation Administration said it is going to investigate what happened. Flight 1213 had 282 passengers and 12 crew members, Delta said. The airline said its flight crews \"followed procedures to evacuate the passenger cabin when flames in the tailpipe of one of the aircraft's two engines were observed\". A social media user posted a video of what appeared to be a serious fire and flames coming from the Airbus plane, and another video of passengers exiting the plane via a slide. Orlando International Airport said on X that the fire was on the ramp area and that the airport's aircraft rescue and firefighting team responded quickly. Airbus did not immediately comment. Delta said maintenance teams will check the aircraft, and the airline will bring in additional aircraft to help customers reach their final destinations on Monday. It's the latest in a series of high-profile aviation incidents that have raised questions about how safe flying is in the US. Read more:Sky News journalists 'deepfaked'Worst UK airports for delaysWhat are your rights if your flight is delayed or cancelled? Last month, an engine on an American Airlines jet caught fire after the plane diverted to Denver, forcing the evacuation of passengers onto the wing of the aeroplane. The engine caught fire while taxiing to the gate. In January, 67 people died after a mid-air collision between an American Airlines regional jet and an Army helicopter near Reagan Washington National Airport."
    },
    {
        "title": "'British man' dies after being dragged out of police station in Ecuador - reports",
        "description": "A \"British man\" has died after being beaten and set on fire by a mob in Ecuador, according to reports by media in the South American country.",
        "url": "https://news.sky.com/story/british-man-dies-after-being-dragged-out-of-police-station-in-ecuador-reports-13352990",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ecuador-police_6892912.jpg?20250421150013",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:21:00",
        "Headline": "The man died from his burns after being dragged out of a police station by a group of people, according to local media.",
        "Content": "A \"British man\" has died after being beaten and set on fire by a mob in Ecuador, according to reports by media in the South American country. According to reports, the man - who has not been officially identified - had been detained by police after being accused of being involved in a fatal shooting. Ecuadorian news outlet Ecuavisa reported that the man had been taken to a police station Playas del Cuyabeno, a remote village in the Amazon rainforest. While there, a group broke into the station and took the man away. He was then set on fire in the street, it is reported, and died from his burns. Another local report, from EXTRA.ec, said that specialist police units had been slow to arrive due to the geographical conditions of the area - which is accessible by river. Read more from Sky News:IDF finds 'failings' over attack on aid workersPope blesses Easter crowds from popemobile According to reports, police officers at the station apparently decided they could not intervene when the mob arrived out of concerns for their own safety. It is understood the UK Foreign Office is following up reports about the incident and working with local authorities to confirm the details."
    },
    {
        "title": "Rachel Reeves to head to Washington amid hopes of US trade deal",
        "description": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal.",
        "url": "https://news.sky.com/story/rachel-reeves-to-head-to-washington-amid-hopes-of-us-trade-deal-13353134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6890421.jpg?20250419022550",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 21:00:00",
        "Headline": "The chancellor will hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Donald Trump's tariffs.",
        "Content": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal. The chancellor will fly to the US capital for her spring meetings of the International Monetary Fund (IMF), the first of which began on Sunday. During her three-day visit, Ms Reeves is set to hold meetings with G7, G20 and IMF counterparts about the changing global economy and is expected to make the case for open trade. Politics latest: Tributes paid to Pope Francis Her visit comes after Donald Trump imposed blanket 10% tariffs on all imports into the US, including from the UK, and as talks about reaching a trade deal intensified. The chancellor will also hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Mr Trump's tariffs. In addition to the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports. Ms Reeves will also be hoping to encourage fellow European finance ministers to increase their defence spending and discuss the best ways to support Ukraine in its war against Russia. Read more:Mission: Impossible? Chancellor heads to the IMFStarmer and the King pay tribute to Pope Francis Speaking ahead of her visit, Ms Reeves said: \"The world has changed, and we are in a new era of global trade. I am in no doubt that the imposition of tariffs will have a profound impact on the global economy and the economy at home. \"This changing world is unsettling for families who are worried about the cost of living and businesses concerned about what tariffs will mean for them. But our task as a government is not to be knocked off course or to take rash action which risks undermining people's security. \"Instead, we must rise to meet the moment and I will always act to defend British interests as part of our plan for change. \"We need a world economy that provides stability and fairness for businesses wanting to invest and trade, more trade and global partnerships between nations with shared interests, and security for working people who want to get on with their lives.\""
    },
    {
        "title": "Murder arrest after woman stabbed to death in Enfield - as victim named",
        "description": "A woman who was stabbed to death in north London has been named by police - as a man was arrested on suspicion of murder.",
        "url": "https://news.sky.com/story/murder-arrest-after-woman-stabbed-to-death-in-enfield-as-victim-named-13353183",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pamela-munro-london_6892938.jpg?20250421153916",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 14:39:00",
        "Headline": "Pamela Munro, 45, was found with a stab wound and died at the scene on Saturday evening, the Metropolitan Police said.",
        "Content": "A woman who was stabbed to death in north London has been named by police - as a man was arrested on suspicion of murder. Pamela Munro, 45, was found with a stab wound and died at the scene in Ayley Croft, Enfield, on Saturday evening, the Metropolitan Police said. A 29-year-old man was arrested on suspicion of murder on Monday and is in custody, the force added. Detective Chief Inspector Neil John said: \"Investigating officers have worked relentlessly across the weekend to investigate the circumstances around Pamela's death. \"We continue to support her family who are understandably devastated.\" Read more from Sky News:Fresh appeal over student's murder100 firefighters battle flats blaze The Met Police has asked anyone with information or who was driving through Ayley Court between 6.30pm and 7.30pm on Saturday and may have dashcam footage to contact the force."
    },
    {
        "title": "Starmer and Zelenskyy discuss ending Russia's 'brutal war' - as Putin says says he is open to bilateral talks on longer ceasefire",
        "description": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks.",
        "url": "https://news.sky.com/story/starmer-and-zelenskyy-discuss-ending-russias-brutal-war-as-putin-says-says-he-is-open-to-bilateral-talks-on-longer-ceasefire-13353371",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6893268.jpg?20250421192647",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 17:04:00",
        "Headline": "Asked by a state TV reporter about Volodymyr Zelenskyy's call for a 30-day ceasefire on civilian targets, Vladimir Putin said talks could be held bilaterally and added \"we do not rule this out\".",
        "Content": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks. The prime minister and Ukrainian president spoke on Monday afternoon, when Sir Keir \"reiterated his iron-clad support for Ukraine\". A Downing Street spokesperson added that the prime minister \"said that the UK supports Ukraine's calls for Russia to commit to a full ceasefire and that now is the time for Putin to show he is serious about ending his brutal war\". \"They discussed the latest developments on the Coalition of the Willing, and looked forward to further progress towards a just and lasting peace,\" the spokesperson added. Mr Zelenskyy later said on social media that he had a \"good and detailed conversation\" with the prime minister, and added Ukrainian officials will be in London for talks on ending the war with Russia on Wednesday. \"We are ready to move forward as constructively as possible, just as we have done before, to achieve an unconditional ceasefire, followed by the establishment of a real and lasting peace,\" he added. The Ukrainian president added that the 30-hour Easter truce, which both Kyiv and Moscow accuse the other of violating, showed that Russia \"are prolonging the war\". It comes as Mr Putin proposed bilateral talks with Ukraine on a longer ceasefire, which would mark the first time Russia held such talks since a failed peace deal soon after the invasion in 2022. Speaking to a state TV reporter, the Russian president said: \"We always have a positive attitude towards a truce, which is why we came up with such an initiative (the Easter truce), especially since we are talking about the bright Easter days.\" When asked about Mr Zelenskyy's calls to extend the 30-hour ceasefire into a 30-day pause on civilian targets, he added: \"This is all a subject for careful study, perhaps even bilaterally. We do not rule this out.\" The Ukrainian president said on Sunday evening that the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day, and accused Russia of \"failing\" to \"uphold its own promise of a ceasefire\".  It also comes after Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week,\" after he and his secretary of state Marco Rubio warned that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said on his Truth Social platform that both countries would \"start to do big business\" with the US after ending the war. Read more from Sky News:Murder arrest after woman stabbed to deathWho could be the next pope? Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce, but Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He then said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "JD Vance and his family arrive in India after Trump called country 'big abuser' on trade",
        "description": "US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties. ",
        "url": "https://news.sky.com/story/jd-vance-and-his-family-arrive-in-india-after-trump-called-country-big-abuser-on-trade-13353101",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jd-vance-india_6892777.jpg?20250421150551",
        "type": "Home",
        "Author": "Neville Lazarus",
        "Date Published": "2025-04-21 11:26:00",
        "Headline": "The US vice president has met with India's Prime Minister Narendra Modi at his residence for official talks.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties.  Mr Vance was accompanied by his wife Usha - whose parents moved from India to the US - their three children Ewan, Vivek and Mirabel and fellow government officials as he landed on Monday morning. The visit comes weeks after US President Donald Trump imposed and then paused a sweeping tariff regime against around 60 countries, including India. In a statement after their meeting in New Delhi, Prime Minister Narendra Modi's office said he \"welcomed the significant progress\" in negotiations for an expected trade deal between the US and India. It added that he and Mr Vance \"noted continued efforts towards enhancing cooperation in energy, defence, strategic technologies and other areas\", and also \"exchanged views on various regional and global issues of mutual interest, and called for dialogue and diplomacy as the way forward\". Mr Modi also \"conveyed his warm greetings to President Trump\" ahead of his visit to India later this year. An announcement was expected on the countries' TRUST (Transforming Relationship Utilising Strategic Technology) partnership, a programme aimed at strengthening their cooperation in defence, critical minerals, AI, semiconductors, pharmaceuticals, energy and space. The Trump administration is also pushing India to buy defence equipment. The US is India's largest trading partner, with bilateral trade valued at $190bn, with a trade deficit of about $46bn in India's favour. Both countries are engaged in negotiating a bilateral trade agreement and aim to double trade to $500bn by 2030. Mr Trump has previously labelled India a \"tariff king\" and a \"big abuser\" on trade. He also recently shared a report which stated Indian tariffs on agricultural products were among the highest in the world. The US president had slapped a 26% tariff on India, calling it a discounted rate against an average 52% duty on American products. Over the weekend, Mr Vance met Pope Francis in one of the pontiff's last public appearances before his death on Easter Monday.  Visit comes amid rising tensions with China Mr Vance's visit is also aimed at strategically balancing China's growing influence in the Indo-Pacific region, with India seen as a counterweight of the two most populous countries. China has warned it will take \"resolute and reciprocal\" countermeasures against countries that strike deals with the US at the expense of Chinese interests. Relations between India and China have been tense over the years. The two countries, separated by the Himalayan mountain range, share a 2,000-mile border, most of which is not demarcated. In 2020, in Galwan, soldiers of both countries had a face-off in which 20 Indian soldiers were killed. There was a national uproar and since then diplomatic relations have been low. High-level military talks have been taking place to sort the border disputes, but have so far been inconclusive. India's move to strengthen ties with the US will increase friction with its northern neighbour, as China sees itself being isolated and targeted by the Trump administration. Last week, China's President Xi Jinping embarked on a tour of Vietnam, Malaysia and Cambodia, and said: \"There are no winners in trade wars and tariff wars.\" Meanwhile, India has raised concerns over the treatment of Indian students who have received visa revocation notices in the US. A survey by the American Immigration Lawyers Association found 50% of those reporting revocations were Indian. The US government has denied targeting Indians specifically with its actions."
    },
    {
        "title": "Three men charged over death of woman struck by van at golf course after police chase",
        "description": "Three men have been charged with manslaughter over the death of a woman who was struck by a van at a golf course following a police pursuit.",
        "url": "https://news.sky.com/story/three-men-charged-over-death-of-woman-struck-by-van-at-golf-course-after-police-chase-13353115",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-suzanne-cherry_6891844.jpg?20250420170512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 11:56:00",
        "Headline": "Suzanne Cherry died in hospital four days after she was hit by the vehicle on the morning of 11 April.",
        "Content": "Three men have been charged with manslaughter over the death of a woman who was struck by a van at a golf course following a police pursuit. Suzanne Cherry died in hospital four days after she was struck by the vehicle on the morning of 11 April. Two police cars had been following a grey Nissan van in Lichfield, Birmingham, after receiving reports of suspicious activity, the Independent Office for Police Conduct (IOPC) said. However, they stopped chasing the van when it went off-road and up an embankment at Aston Wood Golf Club, where it hit Ms Cherry, of Aldridge, Walsall. West Midlands Police said John McDonald, 51, of Bloxwich, has been charged with manslaughter, assault by beating and failing to stop a vehicle when directed by a constable. Johnny McDonald, 22, of Dudley, and Brett Delaney, 34, of Darlaston, Walsall, have also been charged with manslaughter. They are due to appear at North Staffordshire Justice Centre on 21 April. Three other men who had been arrested have been bailed with conditions. Read more from Sky News:Woman, 45, stabbed to deathThe 10 worst airports for flight delaysJust 303 DeLoreans left on Britain's roads Following Ms Cherry's death, her husband paid tribute to his \"beautiful wife\" and described how he watched in \"helpless horror\" during the incident. \"Suzanne leaves a legacy and an unfillable void in the lives of her mother Maureen, her three adult children, two step-children and countless others from her work, her sporting activities and social circle,\" he added. The IOPC continues to investigate the circumstances prior to the crash."
    },
    {
        "title": "Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report",
        "description": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned.",
        "url": "https://news.sky.com/story/gangs-behind-billion-pound-cyber-scam-industry-expanding-as-they-try-to-dodge-government-crackdowns-new-un-report-13352989",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-myanmar-scams-thailan_6892544.jpg?20250421071533",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:18:00",
        "Headline": "South East Asian crime syndicates behind a multibillion-pound cyber scam industry are expanding targets and growing their business, a UN agency warned, adding that countries were reaching an \"inflection point\" to tackle the issue.",
        "Content": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned. As they expand business, countries in South America, Africa and Eastern Europe are now being targeted, the United Nations Office on Drugs and Crime (UNODC) said. The networks and gangs have emerged in South East Asia in recent years, in sprawling compounds housing tens of thousands of people, many trafficked and forced into work, scamming victims abroad. Sky News previously reported on one of these compounds, and the workers who were tricked, trafficked and forced into working there.  Even as governments in Asia have intensified their crackdowns, the gangs have moved within and beyond the region, the UNODC said. It warned that a \"potentially irreversible spillover has taken place... leaving criminal groups free to pick, choose, and move... as needed\". \"It spreads like a cancer,\" John Wojcik, a regional analyst for UNODC, said. \"Authorities treat it in one area, but the roots never disappear; they simply migrate.\" Even the more conservative estimates indicate there are hundreds of large-scale scam farms around the world, generating tens of billions of pounds, the UNODC warned. The agency called on countries to commit to a more joined-up approach to tackle the international issue. \"The regional cyberfraud industry... has outpaced other transnational crimes, given that it is easily scalable and able to reach millions of potential victims online, with no need to move or traffic illicit goods across borders,\" Mr Wojcik said. South America, Africa and Eastern Europe targeted  The syndicates have moved to expand into new ground, the UN agency warned. In South America, the networks were said to be seeking increased partnerships with drug cartels. Zambia, Angola and Namibia in Africa, and Georgia in Eastern Europe, were also seeing an increasingly established base of scam operations. Gangs have also diversified their workforces, UNODC said, as they recruit people from dozens of nationalities. Citizens of more than 50 countries, from Sri Lanka to Uzbekistan and Brazil to Nigeria, were rescued in recent crackdowns on the Thai-Myanmar border. 'Inflection point' Recent months have seen authorities from China, Thailand and Myanmar all move to crack down on the scam operations that have thrived particularly in the lawless areas of the Thai-Myanmar border. Thailand has moved to cut power, fuel and internet to areas housing the scam compounds. However, the syndicates have adapted and shifted their operations between \"the most remote, vulnerable, and underprepared parts of South East Asia\", UNODC said. This was taking place especially in Laos, Myanmar and Cambodia, where gangs exploited jurisdictions with weak governance and high corruption levels. In Cambodia, the industry is most visible and raids there led to it expanding into \"more remote locations\", including the country's western Koh Kong province, the UN agency said. New sites also continue to be developed in Myanmar - a country gripped by an expanding conflict and recently hit by a deadly earthquake. Read more from Sky News:The Pope has died - what happens next?Deepfake videos of Sky News journalistsTrump told to sack defence secretary UNODC said the international community was at a \"critical inflection point\", with failures to tackle the issue properly now leading to \"unprecedented consequences for Southeast Asia that reverberate globally\". A spokesperson for the Chinese Embassy told Sky News: \"China attaches great importance to engage in international and regional endeavours in a responsible and constructive manner to deal with this cross-border issue. \"Substantial progress has been achieved since this year. China will continue to work with relevant parties to crack down on telecom fraud and other cross-border illegal and criminal activities.\""
    },
    {
        "title": "League table of foreign criminals awaiting deportation and their offences set to be published",
        "description": "A league table of foreign criminals and their offences is set to be published for the first time.",
        "url": "https://news.sky.com/story/league-table-of-foreign-criminals-awaiting-deportation-and-their-offences-set-to-be-published-13353517",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-generic-man-handcuffs_6300583.jpg?20230928072810",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 23:31:00",
        "Headline": "The Conservatives believe the figures will show the \"hard reality that mass migration is fuelling crime across our country\".",
        "Content": "A league table of foreign criminals and their offences is set to be published for the first time. The plans, due to be announced on Tuesday, will reportedly focus on those offenders awaiting deportation from the UK. The latest data shows there were 19,244 foreign offenders awaiting deportation at the end of 2024, a rise from 17,907 when the Conservatives left office in July and 14,640 at the end of 2022. Despite more offenders being deported since Labour came to power, the number waiting to be removed from the UK has been growing. Factors are understood to include the early release of inmates due to prison overcrowding, instability and diplomatic problems in some countries and a backlog of legal cases appealing deportation. Shadow home secretary Chris Philp said the decision to publish the nationalities of foreign criminals showed Labour had \"buckled\" under pressure from the Conservatives to disclose the data. The latest government statistics show there were 10,355 foreign nationals held in custody in England and Wales at the end of 2024, representing 12% of the prison population. \n                  Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report\n                 \n                  The Godfather-style gang war gripping two major cities - with brutal attacks caught on camera\n                 \n                  James McCall: Sales manager who sexually assaulted women while they slept jailed for 12 years\n                 The most common nationalities after British nationals were Albanian (11%), Polish (8%), Romanian (7%), which also represented the top three nationalities who were deported from the UK in 2024, according to Home Office figures. Home Secretary Yvette Cooper is understood to have ordered officials to release the details by the end of the year, according to The Daily Telegraph. The newspaper reported Ms Cooper overruled Home Office officials, who previously claimed it was too difficult to provide quality data on foreign criminals. A Home Office source said: \"Not only are we deporting foreign criminals at a rate never seen when Chris Philp and Robert Jenrick were in charge at the Home Office, but we will also be publishing far more information about that cohort of offenders than the Tories ever did.\" The source added that ministers wanted \"to ensure the public is kept better informed about the number of foreign criminals awaiting deportation, where they are from and the crimes they have committed\". In March, the government announced £5m in funding to deploy staff to 80 jails in England and Wales to speed up the deportation of foreign offenders. Read more from Sky News:'Return hubs' get UN backingSex offender allowed to stay in UKWoman born in UK faces being deported Foreign nationals sentenced to 12 months or more in prison are subject to automatic deportation, but the home secretary can also remove criminals if their presence in the UK is not considered desirable. Shadow justice secretary Robert Jenrick welcomed the news, saying: \"We will finally see the hard reality that mass migration is fuelling crime across our country... Frankly, the public deserved to know this [detail on foreign criminals] long ago.\""
    },
    {
        "title": "Rachel Reeves to head to Washington amid hopes of US trade deal",
        "description": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal.",
        "url": "https://news.sky.com/story/rachel-reeves-to-head-to-washington-amid-hopes-of-us-trade-deal-13353134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6890421.jpg?20250419022550",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 21:00:00",
        "Headline": "The chancellor will hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Donald Trump's tariffs.",
        "Content": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal. The chancellor will fly to the US capital for her spring meetings of the International Monetary Fund (IMF), the first of which began on Sunday. During her three-day visit, Ms Reeves is set to hold meetings with G7, G20 and IMF counterparts about the changing global economy and is expected to make the case for open trade. Politics latest: Tributes paid to Pope Francis Her visit comes after Donald Trump imposed blanket 10% tariffs on all imports into the US, including from the UK, and as talks about reaching a trade deal intensified. The chancellor will also hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Mr Trump's tariffs. In addition to the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports. Ms Reeves will also be hoping to encourage fellow European finance ministers to increase their defence spending and discuss the best ways to support Ukraine in its war against Russia. Read more:Mission: Impossible? Chancellor heads to the IMFStarmer and the King pay tribute to Pope Francis Speaking ahead of her visit, Ms Reeves said: \"The world has changed, and we are in a new era of global trade. I am in no doubt that the imposition of tariffs will have a profound impact on the global economy and the economy at home. \"This changing world is unsettling for families who are worried about the cost of living and businesses concerned about what tariffs will mean for them. But our task as a government is not to be knocked off course or to take rash action which risks undermining people's security. \"Instead, we must rise to meet the moment and I will always act to defend British interests as part of our plan for change. \"We need a world economy that provides stability and fairness for businesses wanting to invest and trade, more trade and global partnerships between nations with shared interests, and security for working people who want to get on with their lives.\""
    },
    {
        "title": "Murder arrest after woman stabbed to death in Enfield - as victim named",
        "description": "A woman who was stabbed to death in north London has been named by police - as a man was arrested on suspicion of murder.",
        "url": "https://news.sky.com/story/murder-arrest-after-woman-stabbed-to-death-in-enfield-as-victim-named-13353183",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pamela-munro-london_6892938.jpg?20250421153916",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 14:39:00",
        "Headline": "Pamela Munro, 45, was found with a stab wound and died at the scene on Saturday evening, the Metropolitan Police said.",
        "Content": "A woman who was stabbed to death in north London has been named by police - as a man was arrested on suspicion of murder. Pamela Munro, 45, was found with a stab wound and died at the scene in Ayley Croft, Enfield, on Saturday evening, the Metropolitan Police said. A 29-year-old man was arrested on suspicion of murder on Monday and is in custody, the force added. Detective Chief Inspector Neil John said: \"Investigating officers have worked relentlessly across the weekend to investigate the circumstances around Pamela's death. \"We continue to support her family who are understandably devastated.\" Read more from Sky News:Fresh appeal over student's murder100 firefighters battle flats blaze The Met Police has asked anyone with information or who was driving through Ayley Court between 6.30pm and 7.30pm on Saturday and may have dashcam footage to contact the force."
    },
    {
        "title": "Starmer and Zelenskyy discuss ending Russia's 'brutal war' - as Putin says says he is open to bilateral talks on longer ceasefire",
        "description": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks.",
        "url": "https://news.sky.com/story/starmer-and-zelenskyy-discuss-ending-russias-brutal-war-as-putin-says-says-he-is-open-to-bilateral-talks-on-longer-ceasefire-13353371",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6893268.jpg?20250421192647",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 17:04:00",
        "Headline": "Asked by a state TV reporter about Volodymyr Zelenskyy's call for a 30-day ceasefire on civilian targets, Vladimir Putin said talks could be held bilaterally and added \"we do not rule this out\".",
        "Content": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks. The prime minister and Ukrainian president spoke on Monday afternoon, when Sir Keir \"reiterated his iron-clad support for Ukraine\". A Downing Street spokesperson added that the prime minister \"said that the UK supports Ukraine's calls for Russia to commit to a full ceasefire and that now is the time for Putin to show he is serious about ending his brutal war\". \"They discussed the latest developments on the Coalition of the Willing, and looked forward to further progress towards a just and lasting peace,\" the spokesperson added. Mr Zelenskyy later said on social media that he had a \"good and detailed conversation\" with the prime minister, and added Ukrainian officials will be in London for talks on ending the war with Russia on Wednesday. \"We are ready to move forward as constructively as possible, just as we have done before, to achieve an unconditional ceasefire, followed by the establishment of a real and lasting peace,\" he added. The Ukrainian president added that the 30-hour Easter truce, which both Kyiv and Moscow accuse the other of violating, showed that Russia \"are prolonging the war\". It comes as Mr Putin proposed bilateral talks with Ukraine on a longer ceasefire, which would mark the first time Russia held such talks since a failed peace deal soon after the invasion in 2022. Speaking to a state TV reporter, the Russian president said: \"We always have a positive attitude towards a truce, which is why we came up with such an initiative (the Easter truce), especially since we are talking about the bright Easter days.\" When asked about Mr Zelenskyy's calls to extend the 30-hour ceasefire into a 30-day pause on civilian targets, he added: \"This is all a subject for careful study, perhaps even bilaterally. We do not rule this out.\" The Ukrainian president said on Sunday evening that the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day, and accused Russia of \"failing\" to \"uphold its own promise of a ceasefire\".  It also comes after Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week,\" after he and his secretary of state Marco Rubio warned that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said on his Truth Social platform that both countries would \"start to do big business\" with the US after ending the war. Read more from Sky News:Murder arrest after woman stabbed to deathWho could be the next pope? Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce, but Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He then said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "'British man' dies after being dragged out of police station in Ecuador - reports",
        "description": "A \"British man\" has died after being beaten and set on fire by a mob in Ecuador, according to reports by media in the South American country.",
        "url": "https://news.sky.com/story/british-man-dies-after-being-dragged-out-of-police-station-in-ecuador-reports-13352990",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ecuador-police_6892912.jpg?20250421150013",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:21:00",
        "Headline": "The man died from his burns after being dragged out of a police station by a group of people, according to local media.",
        "Content": "A \"British man\" has died after being beaten and set on fire by a mob in Ecuador, according to reports by media in the South American country. According to reports, the man - who has not been officially identified - had been detained by police after being accused of being involved in a fatal shooting. Ecuadorian news outlet Ecuavisa reported that the man had been taken to a police station Playas del Cuyabeno, a remote village in the Amazon rainforest. While there, a group broke into the station and took the man away. He was then set on fire in the street, it is reported, and died from his burns. Another local report, from EXTRA.ec, said that specialist police units had been slow to arrive due to the geographical conditions of the area - which is accessible by river. Read more from Sky News:IDF finds 'failings' over attack on aid workersPope blesses Easter crowds from popemobile According to reports, police officers at the station apparently decided they could not intervene when the mob arrived out of concerns for their own safety. It is understood the UK Foreign Office is following up reports about the incident and working with local authorities to confirm the details."
    },
    {
        "title": "Three men charged over death of woman struck by van at golf course after police chase",
        "description": "Three men have been charged with manslaughter over the death of a woman who was struck by a van at a golf course following a police pursuit.",
        "url": "https://news.sky.com/story/three-men-charged-over-death-of-woman-struck-by-van-at-golf-course-after-police-chase-13353115",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-suzanne-cherry_6891844.jpg?20250420170512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 11:56:00",
        "Headline": "Suzanne Cherry died in hospital four days after she was hit by the vehicle on the morning of 11 April.",
        "Content": "Three men have been charged with manslaughter over the death of a woman who was struck by a van at a golf course following a police pursuit. Suzanne Cherry died in hospital four days after she was struck by the vehicle on the morning of 11 April. Two police cars had been following a grey Nissan van in Lichfield, Birmingham, after receiving reports of suspicious activity, the Independent Office for Police Conduct (IOPC) said. However, they stopped chasing the van when it went off-road and up an embankment at Aston Wood Golf Club, where it hit Ms Cherry, of Aldridge, Walsall. West Midlands Police said John McDonald, 51, of Bloxwich, has been charged with manslaughter, assault by beating and failing to stop a vehicle when directed by a constable. Johnny McDonald, 22, of Dudley, and Brett Delaney, 34, of Darlaston, Walsall, have also been charged with manslaughter. They are due to appear at North Staffordshire Justice Centre on 21 April. Three other men who had been arrested have been bailed with conditions. Read more from Sky News:Woman, 45, stabbed to deathThe 10 worst airports for flight delaysJust 303 DeLoreans left on Britain's roads Following Ms Cherry's death, her husband paid tribute to his \"beautiful wife\" and described how he watched in \"helpless horror\" during the incident. \"Suzanne leaves a legacy and an unfillable void in the lives of her mother Maureen, her three adult children, two step-children and countless others from her work, her sporting activities and social circle,\" he added. The IOPC continues to investigate the circumstances prior to the crash."
    },
    {
        "title": "Ola Raji: Fresh appeal in unsolved murder of student shot and stabbed as he cycled home",
        "description": "The family of a student who was fatally shot and stabbed while cycling home from a friend's house have appealed for the public's help to get justice a decade after his death.",
        "url": "https://news.sky.com/story/ola-raji-fresh-appeal-in-unsolved-murder-of-student-shot-and-stabbed-as-he-cycled-home-13352995",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ola-raji_6892563.png?20250421075533",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:35:00",
        "Headline": "The charity Crimestoppers is offering a reward of up to £20,000 for information that leads to the identification and prosecution of those responsible for the murder.",
        "Content": "The family of a student who was fatally shot and stabbed while cycling home from a friend's house have appealed for the public's help to get justice a decade after his death. Ola Raji, 21, was shot and stabbed in Peckham in 2015 by two men on the East Surrey Grove estate, near Commercial Way, and later died in hospital. Police say he had been cycling home after watching a football match at a friend's house on the night of Tuesday, 21 April. Three people were arrested on suspicion of murder after the attack, and two others were arrested for perverting the course of justice, but no further action was taken, and no criminal charges were ever brought. Ola's family and the police are appealing for information on the 10-year anniversary of his death, with Crimestoppers offering a reward of up to £20,000 for information that leads to the identification and prosecution of those responsible for the murder. Metropolitan Police say they are particularly interested in speaking to witnesses described as: • A female driving a black Vauxhall Corsa in the area between 9.45pm to 11pm. • Two males who returned to an address in Pear Court at 11.10pm. In the appeal, Ola's sisters Zainab Raji and Ruki Ware said: \"This is a painful reminder of 10 years of loss - our family is not going to get that time back. \"When we get together, there is always that sense of something missing. There are children who never get to know their uncle, who would still be so young even now. The laughter we share is that little less loud. There is a smile absent in the photographs.\" Read more:Woman stabbed to death in Enfield, north LondonHusband describes 'horror' as wife fatally hit by van at golf course Ola's family continued: \"But this is not just about our family. It's about safety on the streets of Peckham and the wider south London area. There is no doubt the people who did this once could carry out similar attacks again. Maybe they already have. \"We are getting closer to the truth - for example, we now know about phone calls Ola received shortly before the attack. Just the smallest piece of evidence from any witnesses or those with knowledge of what happened could be enough to put those responsible behind bars and make the streets safer for the entire community.\" Appealing to potential witnesses, investigation lead DCI Alex Gammampila said: \"Were you out in Peckham that night? Were you also watching the football that night, or were you near Commercial Way? Did you see or hear the shooting or anything that struck you as being unusual? \"No piece of information is too small, and could be the final piece of the puzzle that leads us to identify Ola's attackers.\" Ola was watching a Champion's League football match between Bayern Munich and Porto. Alexa Loukas, London Regional Manager at Crimestoppers, added: \"We know that there may be several witnesses who have information but for whatever reason talking to the police is not an option. We are an independent charity, separate from the police, and we are unable to identify anyone who contacts us.\" Anyone with information can call 101 or message the police at @MetCC on X, giving the reference 2597/16APR25. Information, including photos or videos, can also be easily uploaded to the Met's appeal page. You can provide information anonymously by calling Crimestoppers on 0800 555 111, or by filling out its online form."
    },
    {
        "title": "Pope Francis died from stroke and heart failure, Vatican says",
        "description": "Pope Francis died from a cerebral stroke that led to a coma and irreversible heart failure, the Vatican has said.",
        "url": "https://news.sky.com/story/pope-francis-died-from-stroke-and-heart-failure-vatican-says-13353378",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pope-francis-vatican_6842956.jpg?20250306200112",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 17:04:00",
        "Headline": "The pontiff, who fell into a coma before his death, asked to be buried \"in the ground, without particular ornamentation\" but with the inscription \"Franciscus\".",
        "Content": " Pope Francis died from a cerebral stroke that led to a coma and irreversible heart failure, the Vatican has said. The 88-year-old pontiff's death certificate was released after it was announced he had died on Monday. Follow latest: World leaders pay tribute to Pope Francis The Vatican shared the Pope's final testament, in which he outlined his request to be buried \"in the ground, without particular ornamentation\" but with the inscription \"Franciscus\". Francis said he wished to be buried in Rome's Basilica of Saint Mary Major, rather than at St Peter's Basilica in the Vatican, where many previous pontiffs have been laid to rest. An anonymous benefactor will pay the cost of the funeral, according to the Vatican. The Pope's coffin might be moved to St Peter's Basilica as early as Wednesday morning to allow the faithful to pay their respects, a Vatican spokesman said. Francis had suffered from a chronic lung disease and had part of a lung removed as a young man. Health issues plagued him throughout his later life, and he was admitted to Gemelli hospital in Rome on 14 February for a respiratory crisis that developed into double pneumonia.  This led to a 38-day stay in hospital, the longest of his 12-year papacy. But the leader of the world's Roman Catholics emerged on Easter Sunday, a day before his death, to bless thousands in St Peter's Square. Before the public appearance, the Pope \"exchanged good wishes\" with US vice president JD Vance during a private audience at the Vatican. Bells tolled in church towers across Rome after the announcement of his death.  Francis, the first Jesuit and the first Latin American pontiff, charmed the world with his humble style and concern for the poor, but alienated conservatives with critiques of capitalism and climate change. Seven days of mourning will be observed in his native Argentina, as well as in its heavily-Catholic neighbour, Brazil. Read more:A champion of the deprived - obituaryA life in picturesHow the new pope will be chosen While a date is yet to be set for the funeral, the Vatican said it would normally be expected to take place sometime between Friday and Sunday. Cardinals are due to meet on Tuesday and could set the timetable for the funeral then. Tributes to the Pope have poured from around the world. The King, who met Francis earlier this month during a visit to Italy with the Queen, described him as someone who had \"profoundly touched the lives of so many\". Charles said he and Camilla were \"most deeply saddened\" to learn of the Pope's death and they \"were greatly moved to have been able to visit him\" so recently. Prime Minister Sir Keir Starmer said Francis had been \"a Pope for the poor, the downtrodden and the forgotten\"."
    },
    {
        "title": "Pope's final testament released as he outlines burial wishes - read in full",
        "description": "A \"simple\" tomb \"in the ground\" bearing only the&#160;inscription \"Franciscus\" is among the Pope's wishes for his burial, according to a final testament released by the Vatican.",
        "url": "https://news.sky.com/story/popes-final-testament-released-as-he-outlines-burial-wishes-read-in-full-13353429",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-burial-wishes_6893273.jpg?20250421202757",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 18:36:00",
        "Headline": "Pope Francis asked to be buried \"in the ground, without particular ornamentation\" but with the inscription \"Franciscus\".",
        "Content": " A \"simple\" tomb \"in the ground\" bearing only the inscription \"Franciscus\" is among the Pope's wishes for his burial, according to a final testament released by the Vatican. Pope Francis died at the age of 88 on Monday, a day after appearing on the balcony in St Peter's Square on Easter Sunday. The Vatican said he died from a stroke that led to a coma and irreversible heart failure. Follow latest: Tributes pour in for Pope Francis Below is the Pope's final testament in full, signed 29 June 2022. \"As I sense the approaching twilight of my earthly life, and with firm hope in eternal life, I wish to set out my final wishes solely regarding the place of my burial. \"Throughout my life, and during my ministry as a priest and bishop, I have always entrusted myself to the Mother of Our Lord, the Blessed Virgin Mary. For this reason, I ask that my mortal remains rest - awaiting the day of the Resurrection - in the Papal Basilica of Saint Mary Major. \"I wish my final earthly journey to end precisely in this ancient Marian sanctuary, where I would always stop to pray at the beginning and end of every Apostolic Journey, confidently entrusting my intentions to the Immaculate Mother, and giving thanks for her gentle and maternal care. \"I ask that my tomb be prepared in the burial niche in the side aisle between the Pauline Chapel (Chapel of the Salus Populi Romani) and the Sforza Chapel of the Basilica, as shown in the attached plan. \"The tomb should be in the ground; simple, without particular ornamentation, bearing only the inscription: Franciscus. \"The cost of preparing the burial will be covered by a sum provided by a benefactor, which I have arranged to be transferred to the Papal Basilica of Saint Mary Major. \"I have given the necessary instructions regarding this to Cardinal Rolandas Makrickas, Extraordinary Commissioner of the Liberian Basilica. \"May the Lord grant a fitting reward to all those who have loved me and who continue to pray for me. \"The suffering that has marked the final part of my life, I offer to the Lord, for peace in the world and for fraternity among peoples.\" Read more:Pope Francis: A life in picturesHow Pope remained driving force behind his hectic scheduleFrancis was an outspoken champion of the deprived - obituary"
    },
    {
        "title": "Pope Francis phoned Gaza's only Catholic church 'every day' - as priest reveals details of last call",
        "description": "Christians from Gaza's only Catholic church have paid tribute to Pope Francis who called them \"every day\" during the Israel-Hamas war.",
        "url": "https://news.sky.com/story/pope-francis-phoned-gazas-only-catholic-church-every-day-as-priest-reveals-details-of-last-call-13353447",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/3dbbfb5dbd37b8d68d99af46739def499401f926476f29095e15fc7589cc468b_6893375.jpg?20250421212017",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 19:03:00",
        "Headline": "Speaking outside the Holy Family Church, Father Gabriel Romanelli paid tribute to the Pope and said it was a \"very sad day\".",
        "Content": " Christians from Gaza's only Catholic church have paid tribute to Pope Francis who called them \"every day\" during the Israel-Hamas war. Speaking outside the Holy Family Church on Easter Monday, Father Gabriel Romanelli revealed details of his last phone call with the Pope, who died on Monday. Follow latest: Tributes pour in for Pope Francis \"It's a very sad day for us,\" Father Romanelli told Sky News. \"We lost him. In the same time, we lost him in Easter - for us as Christians, it's a good sign, a wonderful sign of the mercy of the Lord.\" Father Romanelli said the Pope last called on Saturday and \"told us 'thank you... for all that we made here'.\". \"In the same time, he asked [for] prayer and gave the blessing for all the people, for the Christian community and for all the citizens in Gaza,\" he added. He said Francis \"was a very humble servant of the Lord\". \"All the time he told us, for this period - more than one year and a half, and he called every day, every day - he asked to help people, to protect the children,\" Father Romanelli added. 'Heartbroken' Paying tribute to Pope Francis, George Antone, head of the emergency committee at the Holy Family Church, told the Reuters news agency: \"We lost a saint who taught us every day how to be brave, how to keep patient and stay strong. \"We lost a man who fought every day in every direction to protect this small herd of his. \"We are heartbroken because of the death of Pope Francis, but we know that he is leaving behind a church that cares for us and that knows us by name - every single one of us. \"He used to tell each one: I am with you, don't be afraid.\" Read more:The Pope's legacy in charts and numbersWorld leaders pay tribute to Pope Francis Hamas militants attacked southern Israel on 7 October 2023, killing more than 1,200 people and taking 251 hostage. Since then, the Hamas-run Gaza health ministry said more than 50,000 people have been killed. The health ministry does not distinguish between civilians and combatants in its count. Throughout the war, the Pope has condemned both Hamas and Israeli attacks and called for an immediate ceasefire and for a two-state solution. In 2023, Francis condemned the killing of two Palestinian Christian women, and in November called for an investigation into whether Israel has committed \"genocide\" in Gaza. Israel has strongly denied claims it has committed war crimes in Gaza, and says it takes stringent measures to avoid civilian casualties by warning people to evacuate areas in which it is operating. In his final public message on Easter Sunday, Francis repeated previous calls for an immediate ceasefire in Gaza and for the release of all Israeli hostages."
    },
    {
        "title": "A pope of firsts, Francis was an outspoken champion of the deprived - but left some feeling betrayed",
        "description": "His arrival as pontiff heralded a new kind of leadership for the Catholic Church.",
        "url": "https://news.sky.com/story/a-pope-of-firsts-francis-was-an-outspoken-champion-of-the-deprived-but-left-some-feeling-betrayed-12890356",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-pope-francis-pope-dies_6182538.png?20230609125343",
        "type": "World",
        "Author": "Siobhan Robbins, Europe correspondent and Rhiannon Mills, news correspondent",
        "Date Published": "2025-04-21 08:20:00",
        "Headline": "Pope Francis showed a willingness to welcome those who'd felt shunned by the Catholic faith. But he faced huge criticisms from conservatives within the church, as well as those who questioned his liberal credentials.",
        "Content": "By Siobhan Robbins, Europe correspondent and Rhiannon Mills, news correspondent   His arrival as pontiff heralded a new kind of leadership for the Catholic Church. Described by some as the people's pope, Pope Francis showed a willingness to welcome those who'd felt shunned by the Catholic faith, but as a reformer at heart, he also faced huge criticism from conservatives within the church. The clash between the traditional and the liberal remains the greatest challenge to the legacy he leaves. He was a pope of firsts: the first Latin American pontiff, the first Jesuit pope, the first to choose the name Francis. Selected in just over a day by the papal conclave in March 2013, for some, the archbishop from Argentina, Jorge Mario Bergoglio, was an unexpected choice. Follow latest: Vatican pays tribute to a life 'dedicated to service'Read more: Pope Francis dies, Vatican says The cardinals who chose him said he accepted the post with his trademark good humour. \"When the secretary of state toasted to him, he toasted back to us and said 'I hope God forgives you',\" Cardinal Timothy M Dolan recalled at the time. That sense of humour and his humility were characteristics which set him apart. He chose not to wear the more ostentatious papal clothing and turned down the traditional Vatican apartments for a more modest residence. \"Francis was not shy at all. He would always say funny things - crack a joke. He would also risk saying things that people in the first moment would be feeling as an insult, but then, when they looked at his cheeky face, they would also laugh,\" remembered Professor Felix Koerner SJ, a theologian at Humboldt University in Berlin. Born and raised in Buenos Aires, the son of Italian immigrants, after school he studied to become a scientist before being drawn to religion. Spiritual leader to 1.4 billion Catholics, he was a symbolic figurehead on the world stage, meeting monarchs, presidents and prime ministers as he travelled the globe addressing huge crowds everywhere he went. But while at ease in the presence of the rich and powerful, Pope Francis was never more comfortable than in the company of the poor. His papal name was selected in honour of St Francis of Assisi for this very reason. \"Cardinal Bergoglio had a special place in his heart and his ministry for the poor, for the disenfranchised, for those living on the fringes and facing injustice,\" Vatican deputy spokesman Thomas Rosica explained. Throughout his papacy, he was an outspoken champion of the deprived and a defender of those fleeing war and hunger. Addressing the US Congress in 2015 he said: \"Do unto others as you would have others do unto you, this rule points us in a clear direction; let us treat others with the same passion and compassion with which we want to be treated. Let us seek for others the same possibilities which we seek for ourselves.\" On his numerous foreign trips, he sought out those in need, not afraid to visit struggling or violent areas. In 2016, he washed the feet of refugees from various religious backgrounds at a migrant centre in a \"gesture of humility and service\". From climate change to the balance of wealth in the world, Pope Francis was not afraid to make his views known. In 2015, he wrote Laudato Si (Praised Be), a major document on the need to protect the environment, calling the climate crisis a moral issue. Addressing a congregation in 2023, he said: \"We must side with the victims of environmental and climate injustice, working to put an end to the senseless war against our common home.\" He was widely praised for his commitment to interfaith dialogue and was instrumental in an agreement between the Catholic Church and Islamic faiths. In February 2019, Pope Francis and Sheikh Ahmed el-Tayeb, the Grand Imam of Al-Azhar, signed the Document On Human Fraternity For World Peace And Living Together. He was also the first ever pope to travel to Iraq in 2021, an attempt to build bridges between different communities. But it was his acceptance of the LGBTQ community that was unprecedented. It began with an unexpected remark to reporters on a flight back from Brazil about gay clergy. He said: \"If a person is gay and seeks God and has good will, who am I to judge them?\" He later declared homosexuality was not a crime, part of his mission to make the Catholic Church more welcoming. \"He was great in building relations and in risking being provocative to people. So he will remain in our memories a pope challenging people to live like Christ in simplicity,\" said Professor Koerner. However, events in later years left some feeling betrayed, for example, a landmark declaration allowing clerical blessings for same-sex couples was diluted. In April 2024, he appeared to reiterate the Vatican's staunch opposition to gender reassignment, surrogacy, abortion and euthanasia, by signing the text \"Dignitas Infinita\" (Infinite Dignity). In the same year, his own liberal credentials were questioned after reports he used a homophobic slur behind closed doors. But despite that, others continued to insist he was still going too far with his progressive social views, and steering the Catholic Church away from more traditional values. For the first time in six centuries, Francis had taken over from a living pope when Pope Benedict XVI stepped down due to his health in 2013. His new tone compared to his predecessor, and efforts to reform, would set him on a collision course with his critics for going too far on both finances and policy. Some would argue the opposition severely hampered his ability to go further with reforms around the involvement of women and the gay community. Ruth Gledhill, assistant editor of The Tablet, said Pope Francis \"did go to war with the conservative traditionalist side of the church. And it could be argued that it wasn't entirely an effective battle or entirely a wise battle in some respects. \"I think what people will have to accept is even now in today's world where everything happens so quickly, in the Catholic Church still, nothing happens fast.\" Claims of abuse within the church both in the past and present were a constant shadow for Pope Francis. In 2018, he travelled to Ireland and apologised for the \"crimes\" committed by the church. The victims included the tens of thousands of Irish children sexually and physically abused at Catholic churches, schools and workhouses, and the women who were forced to live and work in laundries and give up their children if they got pregnant out of wedlock. \"We ask forgiveness for those members of the hierarchy who didn't take responsibility for this painful situation, and who kept silence,\" Francis said to a crowd of 300,000 in Dublin. \"May the Lord keep this state of shame and compunction and give us strength so this never happens again, and that there is justice.\" In 2019, he issued a landmark decree making it obligatory for all priests and members of religious orders to report any suspicions of abuse, and holding bishops directly accountable for any attacks they commit or cover-up. In 2023, he extended the sex abuse rules to include lay leaders. But some still feel not enough was done to root out the problem and hold to account known abusers. Luke Coppen, senior correspondent at the Catholic website The Pillar, said: \"Opinions differ about how successful he was or how much attention he paid to it. He certainly took several steps to combat that evil on a global scale. But critics again said that he didn't do enough.\" Occasionally, during his time as pontiff, his temper frayed when he was in pain from illness or overwhelmed by an overexcited crowd. In 2016, he scolded a person who pulled him down in Mexico, and in 2020 slapped the hand of a woman who refused to let go of his arm. For many this only made him more human. At the time of his election, he also faced questions over whether he stayed silent about human rights abuses carried out by Argentina's dictatorship while he lived there. Critics alleged he failed to protect priests who challenged the junta earlier in his career, during the 'dirty war' between 1976 and 1983, and that he has said too little about the complicity of the church during military rule. The Vatican strongly denied the accusations. In his final years, increasing health issues meant more frequent hospital stays and more events cancelled, but even when sick, Francis continued to put others before himself to show the church was more open than before. For example, while receiving treatment in hospital in 2023 he took time to visit ill children, baptise a baby and comfort mourning parents. In 2024, he also invited 200 comedians to an audience at the Vatican and a year later appointed the first woman, Sister Simona Brambilla, to head up a major Vatican office. In 2025, Francis underwent a prolonged stay in hospital after being admitted on 14 February for respiratory issues that developed into double pneumonia. He spent 38 days there - the longest stay in hospital of his 12-year papacy. In his last public appearance on Easter Sunday, a day before his death, Francis appeared in St Peter's Square to bless thousands gathered. He also met US vice president JD Vance over the weekend.  Announcing his death on Easter Monday, Cardinal Farrell of the Vatican said: \"Dearest brothers and sisters, with deep sorrow I must announce the death of our Holy Father Francis. \"At 7.35 this morning, the Bishop of Rome, Francis, returned to the house of the Father. His entire life was dedicated to the service of the Lord and His Church. \"He taught us to live the values ​​of the Gospel with fidelity, courage and universal love, especially in favour of the poorest and most marginalised. \"With immense gratitude for his example as a true disciple of the Lord Jesus, we commend the soul of Pope Francis to the infinite merciful love of the One and Triune God.\" Bells tolled in church towers across Rome after the announcement of his passing. As Catholics now mourn his passing, it is his humanity that Pope Francis will be remembered for; a pope of the people, never happier than when he was among them."
    },
    {
        "title": "Who could be the next pope?",
        "description": "As cardinals prepare to gather for the papal conclave, the process by which a new pontiff is elected, Sky News takes a look at who could replace Pope Francis.",
        "url": "https://news.sky.com/story/who-could-be-the-next-pope-13311775",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graphic-pope-francis_6892841.png?20250421133132",
        "type": "World",
        "Author": "Simone Baglivo, Europe producer in the Vatican City",
        "Date Published": "2025-04-21 11:29:00",
        "Headline": "Following Pope Francis's death, the papal conclave will elect a new pope. Here are some of the contenders to become the next head of the Catholic church.",
        "Content": "By Simone Baglivo, Europe producer in the Vatican City   As cardinals prepare to gather for the papal conclave, the process by which a new pontiff is elected, Sky News takes a look at who could replace Pope Francis. The Pope died on Easter Monday, a day after blessing thousands of people in St Peter's Square. Pope Francis dies - latest updates Surrounded by Michelangelo's world-famous paintings, 137 cardinal electors will attend a College of Cardinals meeting in the Vatican's Sistine Chapel, where they will be tasked with choosing the new leader of the Catholic church. A silent election campaign is always ongoing inside the Vatican City, especially when a pope's health problems arise. Pope Francis, who suffered from chronic lung disease, spent five weeks at Gemelli hospital after being admitted for a respiratory crisis in February that developed into double pneumonia. In 2021, after he had colon surgery and spent 10 days in hospital, he said some people wanted him \"dead\" and were \"preparing the conclave\". Read more:Obituary: Francis was a champion of the deprivedHow is a new pope chosen and what is a papal conclave? It is very hard to predict who the next pope might be. Pope Francis himself was not supposed to be pope - and did not want to be, as he revealed after being elected. According to what Sky News understands, here are some of the possible candidates. Pietro Parolin, 70 If the next pontiff is Italian, Pietro Parolin, the Vatican's secretary of state, is widely considered the frontrunner. A well-known diplomat and a powerful figure at the Vatican, he was sent across the world to bring the Pope's voice to difficult areas. He was a close ally to the late pontiff, and his mediation skills and strong personality would make him capable of continuing the reforms started by Pope Francis. Matteo Zuppi, 69 The president of the Episcopal Conference of Italy and Archbishop of Bologna is another likely candidate. He was the Pope's special envoy for the war in Ukraine, making trips to Kyiv, Moscow, Beijing and Washington. Back in 1992, he also helped end the civil war in Mozambique while mediating the two-year-long Rome-based peace negotiations. He has worked with the Community of Sant'Egidio, the prominent Catholic NGO dedicated to social service, and is regarded as the most progressive among the candidates. Jose Tolentino de Mendonca, 59 The prefect of the Dicastery for Culture and Education is another possible candidate. The Portuguese cardinal is also a member of the Dicastery for the Doctrine of the Faith, the Dicastery for Divine Worship and the Discipline of the Sacraments. He has published numerous collections of poems and spiritual writings. On 16 February, he stood in for Pope Francis during the Vatican's Jubilee of Artists event. Peter Erdo, 72  The Hungarian cardinal was mentioned as a likely papal candidate during the last conclave. He has also served as the president of the Council of the Bishops' Conferences of Europe. Cristobal Lopez Romero, 72 The Spanish Archbishop of Rabat moved to Morocco in 2003 after a long stint of pastoral work in Latin America, particularly in Paraguay. He is a member of the Salesians - a congregation of men in the Catholic church. Pierbattista Pizzaballa, 59 The Latin Patriarch of Jerusalem was made a cardinal by Pope Francis two years ago. He has devoted himself to the Middle East, facing several crises, including the conflict between Israel and Hamas. Last Christmas, he celebrated mass at the Holy Family Church in Gaza. Who chooses the new pope? Only cardinals below the age of 80 can attend the papal conclave. As of today, there are 252 cardinals, 137 of whom are cardinal electors. Read more: How is a new pope chosen? Following the last consistory in December 2024, Pope Francis created 21 new cardinals, while 23 were created by Pope Benedict XVI and five by Pope John Paul II. Pope Francis created cardinals from 72 different countries, and 24 of those nations have never had a cardinal before."
    },
    {
        "title": "How is a new pope chosen and what is a papal conclave?",
        "description": "With the death of Pope Francis, the wheels are in motion to select a new pontiff.",
        "url": "https://news.sky.com/story/how-is-a-new-pope-chosen-and-what-is-a-papal-conclave-13041554",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-pope-rome_6411161.jpg?20240103141401",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-04-21 10:14:00",
        "Headline": "Following the death of Pope Francis, cardinals from around the world will be gathering in Rome to choose a new pontiff.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  With the death of Pope Francis, the wheels are in motion to select a new pontiff. The rituals for choosing a new pope are elaborate and date back centuries. So how does it work? Here's what will be happening at the Vatican. When a pope dies or, more rarely, resigns, the Catholic church enters a period called \"sede vacante\". This means \"empty seat\" – as there is no pope sitting on the throne of St Peter. Pope Francis dies - latest updates The late pope's ring and seal – which are used to dispatch papal documents – are broken to stop anyone else from using them. During this time a cardinal – known as the camerlengo or chamberlain – becomes interim chief of the church with limited powers. \"Sede vacante\" generally lasts several weeks while the pope's body lies in state, his funeral is held and the cardinals prepare to gather for the conclave. Obituary: Francis was a champion of the deprived The conclave The conclave takes place in the Sistine Chapel, the famous Vatican hall whose walls and ceilings are decorated with the works of Michelangelo. The meeting features cardinals from all over the world and lasts until a new pope is chosen. Only cardinals under the age of 80 (cardinal electors) are allowed to participate in the conclave and cast their vote for the new pope. Currently, of the 252 cardinals, there are 135 cardinal electors: 53 from Europe; 23 from Asia; 20 from North America; 18 from Africa; 17 from South America; and four from Oceania. The country with the most cardinals who can vote is Italy with 17, the US has 10 and Brazil has seven. The UK has three. Once the conclave begins, the cardinals will not emerge from the Vatican until a new pope has been elected. The word \"conclave\" comes from Latin, meaning \"with key\" – a reference to the isolation in which the cardinals are kept. They hold voting sessions in the Sistine Chapel and sleep in the Casa Santa Marta hotel inside the Vatican's grounds. The longest conclave lasted nearly three years, between 1268 and 1271. Several have lasted only one day. The one which elected Pope John Paul in 1978 lasted less than three days. Cardinals chose Pope Francis in around two days. While the conclave is ongoing, cardinals are not able to communicate with the outside world. No telephones, internet use or newspapers are allowed. Except for the first day, when only one ballot is held, the cardinals hold two daily balloting sessions until one candidate has a majority of two-thirds plus one. They are all sworn to secrecy about the voting. White smoke? So how do we know if a decision has been reached? Yes, this is the black smoke, white smoke part. If the cardinals have not reached a majority, the cards and the tally sheets are placed in a stove and burned with an additive to produce black smoke, showing the outside world that a pope has not yet been chosen. Watching for the tell-tale smoke arising from the top of the Sistine Chapel is something of a tradition, with Catholics crowding into St Peter's Square for the spectacle. If no result has been reached in three days, the sessions are suspended for a day to allow for prayer and discussion. More ballots are then held until a two-thirds majority is reached. When enough cardinals agree on a candidate for the next pope, that candidate is then asked if he accepts and by which name he wishes to be known. Then the ballots are burned as before, but with an additive to produce white smoke. New pope proclaimed The new pope then dons his new papal vestments – tailors keep large, medium and small sizes ready – and sits on a throne in the Sistine Chapel to receive the other cardinals who file up to pay homage and swear obedience to the church's new leader. The senior cardinal deacon then steps out onto the central balcony of St Peter's Basilica overlooking the square and announces in Latin: \"Annuntio vobis gaudium magnum. Habemus Papam\" (I announce to you a great joy. We have a pope) and reveals the cardinal's name and the name he has chosen. The new pope then appears on the balcony to deliver his first public pontifical greeting and bless the crowds in St Peter's Square. A few days later, the new pope celebrates a mass that marks the beginning of his ministry."
    },
    {
        "title": "The Pope has died - what happens next?",
        "description": "The death of Pope Francis sets off a chain of events, from the breaking of his signet ring and his funeral to the secretive conclave election of his successor.",
        "url": "https://news.sky.com/story/the-pope-has-died-what-happens-next-13353088",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-basilica-pope-francis_6892750.jpg?20250421115328",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 10:39:00",
        "Headline": "Sky News looks at what will be happening in the Holy See in the immediate hours after the death of the Pope, as well as in the coming days and weeks.",
        "Content": "The death of Pope Francis sets off a chain of events, from the breaking of his signet ring and his funeral to the secretive conclave election of his successor. As tributes from around the world pour in for the late pontiff, let's look at what will be happening in the Holy See in the immediate hours after the death of the Pope, as well as in the coming days and weeks. Follow latest: Pope Francis dies aged 88 First steps after the death of a pope The camerlengo, a senior Vatican official, is notified. They are responsible for the formal determination of death. He stands over the papal body and ceremoniously calls the Pope's baptismal name three times - only when there is no response to the calls can the Pope be officially pronounced dead. After this, the death certificate is written. The papal apartments are locked by the Camerlengo, with the papal study and bedroom sealed. The Camerlengo then breaks the pope's signet ring and seal with shears, to prevent them being used by anyone else.  The news is announced The Camerlengo first shares the news with the vicar of Rome, the dean of the College of Cardinals, the ambassadors of the Holy See and the heads of nations. The news is then announced to the public and the bells of St Peter's Basilica ring out. Read more:Conclave: How the new pope will be chosenFrancis: A pope of firsts  Burial For the last 100 years, popes have been buried in St Peter's Basilica in the Vatican. However, Pope Francis instead said he wanted to be buried at Rome's Basilica of St Mary Major, the church where he went to pray before and after each of his foreign trips. He also asked for a simple wooden casket, instead of the centuries-old practice of burying the popes in three interlocking caskets made of cypress, lead and oak. According to church rules, the burial must take place between four and six days after his death. Choosing a new pope Between 15 and 20 days after the pope dies, cardinals from all over the world arrive at the Vatican to choose a successor. Only those under the age of 80 - some 135 cardinals - are eligible to cast votes for the new pope and are shuttered away during the process, which is known as conclave. A cardinal must receive at least two-thirds of the vote to be announced as the new pope. Read more: Who could be the next pope? Ballots and notes are burned after each vote - for every vote that fails, black smoke it released from the Sistine Chapel. White smoke means a new pope has been elected. Once elected, the dean of cardinals asked him if he accepts his election and he has to choose a name. Once chosen, a senior cardinal proclaims the new pope on a balcony overlooking St Peter's Square in Vatican City and declares \"Habemus papa\" (\"We have a pope\" in Latin), and the new pope blesses the crowd."
    },
    {
        "title": "Starmer and Zelenskyy discuss ending Russia's 'brutal war' - as Putin says says he is open to bilateral talks on longer ceasefire",
        "description": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks.",
        "url": "https://news.sky.com/story/starmer-and-zelenskyy-discuss-ending-russias-brutal-war-as-putin-says-says-he-is-open-to-bilateral-talks-on-longer-ceasefire-13353371",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6893268.jpg?20250421192647",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 17:04:00",
        "Headline": "Asked by a state TV reporter about Volodymyr Zelenskyy's call for a 30-day ceasefire on civilian targets, Vladimir Putin said talks could be held bilaterally and added \"we do not rule this out\".",
        "Content": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks. The prime minister and Ukrainian president spoke on Monday afternoon, when Sir Keir \"reiterated his iron-clad support for Ukraine\". A Downing Street spokesperson added that the prime minister \"said that the UK supports Ukraine's calls for Russia to commit to a full ceasefire and that now is the time for Putin to show he is serious about ending his brutal war\". \"They discussed the latest developments on the Coalition of the Willing, and looked forward to further progress towards a just and lasting peace,\" the spokesperson added. Mr Zelenskyy later said on social media that he had a \"good and detailed conversation\" with the prime minister, and added Ukrainian officials will be in London for talks on ending the war with Russia on Wednesday. \"We are ready to move forward as constructively as possible, just as we have done before, to achieve an unconditional ceasefire, followed by the establishment of a real and lasting peace,\" he added. The Ukrainian president added that the 30-hour Easter truce, which both Kyiv and Moscow accuse the other of violating, showed that Russia \"are prolonging the war\". It comes as Mr Putin proposed bilateral talks with Ukraine on a longer ceasefire, which would mark the first time Russia held such talks since a failed peace deal soon after the invasion in 2022. Speaking to a state TV reporter, the Russian president said: \"We always have a positive attitude towards a truce, which is why we came up with such an initiative (the Easter truce), especially since we are talking about the bright Easter days.\" When asked about Mr Zelenskyy's calls to extend the 30-hour ceasefire into a 30-day pause on civilian targets, he added: \"This is all a subject for careful study, perhaps even bilaterally. We do not rule this out.\" The Ukrainian president said on Sunday evening that the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day, and accused Russia of \"failing\" to \"uphold its own promise of a ceasefire\".  It also comes after Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week,\" after he and his secretary of state Marco Rubio warned that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said on his Truth Social platform that both countries would \"start to do big business\" with the US after ending the war. Read more from Sky News:Murder arrest after woman stabbed to deathWho could be the next pope? Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce, but Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He then said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "JD Vance and his family arrive in India after Trump called country 'big abuser' on trade",
        "description": "US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties. ",
        "url": "https://news.sky.com/story/jd-vance-and-his-family-arrive-in-india-after-trump-called-country-big-abuser-on-trade-13353101",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jd-vance-india_6892777.jpg?20250421150551",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-04-21 11:26:00",
        "Headline": "The US vice president has met with India's Prime Minister Narendra Modi at his residence for official talks.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties.  Mr Vance was accompanied by his wife Usha - whose parents moved from India to the US - their three children Ewan, Vivek and Mirabel and fellow government officials as he landed on Monday morning. The visit comes weeks after US President Donald Trump imposed and then paused a sweeping tariff regime against around 60 countries, including India. In a statement after their meeting in New Delhi, Prime Minister Narendra Modi's office said he \"welcomed the significant progress\" in negotiations for an expected trade deal between the US and India. It added that he and Mr Vance \"noted continued efforts towards enhancing cooperation in energy, defence, strategic technologies and other areas\", and also \"exchanged views on various regional and global issues of mutual interest, and called for dialogue and diplomacy as the way forward\". Mr Modi also \"conveyed his warm greetings to President Trump\" ahead of his visit to India later this year. An announcement was expected on the countries' TRUST (Transforming Relationship Utilising Strategic Technology) partnership, a programme aimed at strengthening their cooperation in defence, critical minerals, AI, semiconductors, pharmaceuticals, energy and space. The Trump administration is also pushing India to buy defence equipment. The US is India's largest trading partner, with bilateral trade valued at $190bn, with a trade deficit of about $46bn in India's favour. Both countries are engaged in negotiating a bilateral trade agreement and aim to double trade to $500bn by 2030. Mr Trump has previously labelled India a \"tariff king\" and a \"big abuser\" on trade. He also recently shared a report which stated Indian tariffs on agricultural products were among the highest in the world. The US president had slapped a 26% tariff on India, calling it a discounted rate against an average 52% duty on American products. Over the weekend, Mr Vance met Pope Francis in one of the pontiff's last public appearances before his death on Easter Monday.  Visit comes amid rising tensions with China Mr Vance's visit is also aimed at strategically balancing China's growing influence in the Indo-Pacific region, with India seen as a counterweight of the two most populous countries. China has warned it will take \"resolute and reciprocal\" countermeasures against countries that strike deals with the US at the expense of Chinese interests. Relations between India and China have been tense over the years. The two countries, separated by the Himalayan mountain range, share a 2,000-mile border, most of which is not demarcated. In 2020, in Galwan, soldiers of both countries had a face-off in which 20 Indian soldiers were killed. There was a national uproar and since then diplomatic relations have been low. High-level military talks have been taking place to sort the border disputes, but have so far been inconclusive. India's move to strengthen ties with the US will increase friction with its northern neighbour, as China sees itself being isolated and targeted by the Trump administration. Last week, China's President Xi Jinping embarked on a tour of Vietnam, Malaysia and Cambodia, and said: \"There are no winners in trade wars and tariff wars.\" Meanwhile, India has raised concerns over the treatment of Indian students who have received visa revocation notices in the US. A survey by the American Immigration Lawyers Association found 50% of those reporting revocations were Indian. The US government has denied targeting Indians specifically with its actions."
    },
    {
        "title": "Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report",
        "description": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned.",
        "url": "https://news.sky.com/story/gangs-behind-billion-pound-cyber-scam-industry-expanding-as-they-try-to-dodge-government-crackdowns-new-un-report-13352989",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-myanmar-scams-thailan_6892544.jpg?20250421071533",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:18:00",
        "Headline": "South East Asian crime syndicates behind a multibillion-pound cyber scam industry are expanding targets and growing their business, a UN agency warned, adding that countries were reaching an \"inflection point\" to tackle the issue.",
        "Content": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned. As they expand business, countries in South America, Africa and Eastern Europe are now being targeted, the United Nations Office on Drugs and Crime (UNODC) said. The networks and gangs have emerged in South East Asia in recent years, in sprawling compounds housing tens of thousands of people, many trafficked and forced into work, scamming victims abroad. Sky News previously reported on one of these compounds, and the workers who were tricked, trafficked and forced into working there.  Even as governments in Asia have intensified their crackdowns, the gangs have moved within and beyond the region, the UNODC said. It warned that a \"potentially irreversible spillover has taken place... leaving criminal groups free to pick, choose, and move... as needed\". \"It spreads like a cancer,\" John Wojcik, a regional analyst for UNODC, said. \"Authorities treat it in one area, but the roots never disappear; they simply migrate.\" Even the more conservative estimates indicate there are hundreds of large-scale scam farms around the world, generating tens of billions of pounds, the UNODC warned. The agency called on countries to commit to a more joined-up approach to tackle the international issue. \"The regional cyberfraud industry... has outpaced other transnational crimes, given that it is easily scalable and able to reach millions of potential victims online, with no need to move or traffic illicit goods across borders,\" Mr Wojcik said. South America, Africa and Eastern Europe targeted  The syndicates have moved to expand into new ground, the UN agency warned. In South America, the networks were said to be seeking increased partnerships with drug cartels. Zambia, Angola and Namibia in Africa, and Georgia in Eastern Europe, were also seeing an increasingly established base of scam operations. Gangs have also diversified their workforces, UNODC said, as they recruit people from dozens of nationalities. Citizens of more than 50 countries, from Sri Lanka to Uzbekistan and Brazil to Nigeria, were rescued in recent crackdowns on the Thai-Myanmar border. 'Inflection point' Recent months have seen authorities from China, Thailand and Myanmar all move to crack down on the scam operations that have thrived particularly in the lawless areas of the Thai-Myanmar border. Thailand has moved to cut power, fuel and internet to areas housing the scam compounds. However, the syndicates have adapted and shifted their operations between \"the most remote, vulnerable, and underprepared parts of South East Asia\", UNODC said. This was taking place especially in Laos, Myanmar and Cambodia, where gangs exploited jurisdictions with weak governance and high corruption levels. In Cambodia, the industry is most visible and raids there led to it expanding into \"more remote locations\", including the country's western Koh Kong province, the UN agency said. New sites also continue to be developed in Myanmar - a country gripped by an expanding conflict and recently hit by a deadly earthquake. Read more from Sky News:The Pope has died - what happens next?Deepfake videos of Sky News journalistsTrump told to sack defence secretary UNODC said the international community was at a \"critical inflection point\", with failures to tackle the issue properly now leading to \"unprecedented consequences for Southeast Asia that reverberate globally\". A spokesperson for the Chinese Embassy told Sky News: \"China attaches great importance to engage in international and regional endeavours in a responsible and constructive manner to deal with this cross-border issue. \"Substantial progress has been achieved since this year. China will continue to work with relevant parties to crack down on telecom fraud and other cross-border illegal and criminal activities.\""
    },
    {
        "title": "Trump told to sack Pete Hegseth over reports of second war plans group chat",
        "description": "US Defence Secretary Pete Hegseth has been linked to a second group chat about sensitive military operations, which he reportedly shared with his wife, brother and personal lawyer.",
        "url": "https://news.sky.com/story/trump-told-to-sack-pete-hegseth-over-reports-of-second-war-plans-group-chat-13352966",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pete-hegseth-easter-egg-roll_6892983.jpg?20250421161817",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-21 02:03:00",
        "Headline": "The White House is standing by its claim that no classified information has been disclosed in the group chats. But Democrats insist the Pete Hegseth must now go. ",
        "Content": "US Defence Secretary Pete Hegseth has been linked to a second group chat about sensitive military operations, which he reportedly shared with his wife, brother and personal lawyer. The messages sent via the Signal messaging app are again understood to have contained details of an attack on Yemen's Iran-aligned Houthis in March. The second chat group, initially reported by The New York Times, included about a dozen people. It revealed details of the schedule of the airstrikes, according to the Reuters news agency. Two sources with knowledge of the matter told Sky News' US partner network NBC News there were 13 people in the second chat group, and Mr Hegseth divulged the information despite an aide warning him about using an unsecure communications system. Mr Hegseth's wife, Jennifer, a former Fox News producer, has attended sensitive meetings with foreign military counterparts, while his brother was hired at the Pentagon as a Department of Homeland Security liaison and senior adviser. Military details from the first chat group were revealed by a journalist from The Atlantic magazine who was accidentally added to the Signal app by national security adviser Mike Waltz. Mr Hegseth then shared sensitive information with cabinet officials about last month's airstrike on targets in Yemen, which was later leaked. Read more from Sky News:What is Signal?Who is Pete Hegseth? 'A non-story,' says White House US President Donald Trump insisted he stood behind Mr Hegseth, saying: \"Pete's doing a great job. Everybody's happy with him.\" Asked if he remained confident in Hegseth, Mr Trump replied: \"Oh totally.\" \"Ask the Houthis how he's doing,\" he added, The US military under the Trump administration has ramped up its bombing campaign against the Iran-backed Houthi group. The White House also denied a report that it had started searching for a new defence secretary. White House spokesperson Karoline Leavitt said the National Public Radio story on the search was not true and the president \"stands strongly\" behind Mr Hegseth. The White House has consistently defended Mr Hegseth and Mr Trump dismissed the original leak as \"something that can happen\". Responding to the latest chat group, White House deputy press secretary Anna Kelly said: \"No matter how many times the legacy media tries to resurrect the same non-story, they can't change the fact that no classified information was shared. \"Recently-fired 'leakers' are continuing to misrepresent the truth to soothe their shattered egos and undermine the President's agenda, but the administration will continue to hold them accountable.\" The \"leakers\" referred to in the White House statement are four senior officials who were ousted from the Pentagon last week as part of an internal leak investigation.  'Hegseth put lives at risk' The New York Times reported that the second chat - named \"Defence | Team Huddle\" - was created on Mr Hegseth's private phone. It detailed the same warplane launch times as the first chat. Several former and current officials have said sharing those operational details before a strike would have certainly been classified, and their release could have put pilots in danger. Democratic politicians have repeatedly called for Mr Hegseth to step down. \"We keep learning how Pete Hegseth put lives at risk,\" Senate minority leader Chuck Schumer said in a post on X. \"But [Donald] Trump is still too weak to fire him. Pete Hegseth must be fired.\" The latest claims about Mr Hegseth emerged as Yemen's Houthi rebels reported another wave of US airstrikes on Sunday, including on the capital Sanaa. The Houthis said at least 12 people had been killed, with 30 more injured. The US says its bombing campaign is in response to Houthi attacks on Red Sea shipping lanes."
    },
    {
        "title": "JD Vance and his family arrive in India after Trump called country 'big abuser' on trade",
        "description": "US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties. ",
        "url": "https://news.sky.com/story/jd-vance-and-his-family-arrive-in-india-after-trump-called-country-big-abuser-on-trade-13353101",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jd-vance-india_6892777.jpg?20250421150551",
        "type": "US",
        "Author": "Neville Lazarus",
        "Date Published": "2025-04-21 11:26:00",
        "Headline": "The US vice president has met with India's Prime Minister Narendra Modi at his residence for official talks.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  US vice president JD Vance has arrived in Delhi for a four-day visit to India as the countries look to negotiate on tariffs, a bilateral trade deal and strengthen their ties.  Mr Vance was accompanied by his wife Usha - whose parents moved from India to the US - their three children Ewan, Vivek and Mirabel and fellow government officials as he landed on Monday morning. The visit comes weeks after US President Donald Trump imposed and then paused a sweeping tariff regime against around 60 countries, including India. In a statement after their meeting in New Delhi, Prime Minister Narendra Modi's office said he \"welcomed the significant progress\" in negotiations for an expected trade deal between the US and India. It added that he and Mr Vance \"noted continued efforts towards enhancing cooperation in energy, defence, strategic technologies and other areas\", and also \"exchanged views on various regional and global issues of mutual interest, and called for dialogue and diplomacy as the way forward\". Mr Modi also \"conveyed his warm greetings to President Trump\" ahead of his visit to India later this year. An announcement was expected on the countries' TRUST (Transforming Relationship Utilising Strategic Technology) partnership, a programme aimed at strengthening their cooperation in defence, critical minerals, AI, semiconductors, pharmaceuticals, energy and space. The Trump administration is also pushing India to buy defence equipment. The US is India's largest trading partner, with bilateral trade valued at $190bn, with a trade deficit of about $46bn in India's favour. Both countries are engaged in negotiating a bilateral trade agreement and aim to double trade to $500bn by 2030. Mr Trump has previously labelled India a \"tariff king\" and a \"big abuser\" on trade. He also recently shared a report which stated Indian tariffs on agricultural products were among the highest in the world. The US president had slapped a 26% tariff on India, calling it a discounted rate against an average 52% duty on American products. Over the weekend, Mr Vance met Pope Francis in one of the pontiff's last public appearances before his death on Easter Monday.  Visit comes amid rising tensions with China Mr Vance's visit is also aimed at strategically balancing China's growing influence in the Indo-Pacific region, with India seen as a counterweight of the two most populous countries. China has warned it will take \"resolute and reciprocal\" countermeasures against countries that strike deals with the US at the expense of Chinese interests. Relations between India and China have been tense over the years. The two countries, separated by the Himalayan mountain range, share a 2,000-mile border, most of which is not demarcated. In 2020, in Galwan, soldiers of both countries had a face-off in which 20 Indian soldiers were killed. There was a national uproar and since then diplomatic relations have been low. High-level military talks have been taking place to sort the border disputes, but have so far been inconclusive. India's move to strengthen ties with the US will increase friction with its northern neighbour, as China sees itself being isolated and targeted by the Trump administration. Last week, China's President Xi Jinping embarked on a tour of Vietnam, Malaysia and Cambodia, and said: \"There are no winners in trade wars and tariff wars.\" Meanwhile, India has raised concerns over the treatment of Indian students who have received visa revocation notices in the US. A survey by the American Immigration Lawyers Association found 50% of those reporting revocations were Indian. The US government has denied targeting Indians specifically with its actions."
    },
    {
        "title": "Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport",
        "description": "Hundreds of passengers have been taken off a plane after one of its engines caught fire as it was about to take off, airport officials have said.",
        "url": "https://news.sky.com/story/hundreds-of-passengers-evacuated-after-delta-air-lines-airbus-a330-engine-catches-fire-at-orlando-international-airport-13353450",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-plane-fire-delta-airlines_6893243.jpg?20250421190122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-21 19:08:00",
        "Headline": "More than 280 people were taken off the flight after smoke began to appear from the engine as the plane was pushing back from the gate at Orlando International Airport.",
        "Content": "Hundreds of passengers have been taken off a plane after one of its engines caught fire as it was about to take off, airport officials have said. The Delta Air Lines plane carrying nearly 300 people was pushing back from the gate at Orlando International Airport in Florida when smoke began to appear from the engine on its right wing on Monday. There were no initial reports of injuries, the airline said. Pictures and video published on social media showed flames and smoke rising from the Airbus A330 and passengers sliding down an escape chute as they left the aircraft. Pope dies latest: King Charles leads tributes The plane was heading for Atlanta, a journey of more than 400 miles with a flight time of around one hour and 40 minutes. The Federal Aviation Administration said it is going to investigate what happened. Flight 1213 had 282 passengers and 12 crew members, Delta said. The airline said its flight crews \"followed procedures to evacuate the passenger cabin when flames in the tailpipe of one of the aircraft's two engines were observed\". A social media user posted a video of what appeared to be a serious fire and flames coming from the Airbus plane, and another video of passengers exiting the plane via a slide. Orlando International Airport said on X that the fire was on the ramp area and that the airport's aircraft rescue and firefighting team responded quickly. Airbus did not immediately comment. Delta said maintenance teams will check the aircraft, and the airline will bring in additional aircraft to help customers reach their final destinations on Monday. It's the latest in a series of high-profile aviation incidents that have raised questions about how safe flying is in the US. Read more:Sky News journalists 'deepfaked'Worst UK airports for delaysWhat are your rights if your flight is delayed or cancelled? Last month, an engine on an American Airlines jet caught fire after the plane diverted to Denver, forcing the evacuation of passengers onto the wing of the aeroplane. The engine caught fire while taxiing to the gate. In January, 67 people died after a mid-air collision between an American Airlines regional jet and an Army helicopter near Reagan Washington National Airport."
    },
    {
        "title": "Rachel Reeves to head to Washington amid hopes of US trade deal",
        "description": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal.",
        "url": "https://news.sky.com/story/rachel-reeves-to-head-to-washington-amid-hopes-of-us-trade-deal-13353134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6890421.jpg?20250419022550",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-21 21:00:00",
        "Headline": "The chancellor will hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Donald Trump's tariffs.",
        "Content": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal. The chancellor will fly to the US capital for her spring meetings of the International Monetary Fund (IMF), the first of which began on Sunday. During her three-day visit, Ms Reeves is set to hold meetings with G7, G20 and IMF counterparts about the changing global economy and is expected to make the case for open trade. Politics latest: Tributes paid to Pope Francis Her visit comes after Donald Trump imposed blanket 10% tariffs on all imports into the US, including from the UK, and as talks about reaching a trade deal intensified. The chancellor will also hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Mr Trump's tariffs. In addition to the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports. Ms Reeves will also be hoping to encourage fellow European finance ministers to increase their defence spending and discuss the best ways to support Ukraine in its war against Russia. Read more:Mission: Impossible? Chancellor heads to the IMFStarmer and the King pay tribute to Pope Francis Speaking ahead of her visit, Ms Reeves said: \"The world has changed, and we are in a new era of global trade. I am in no doubt that the imposition of tariffs will have a profound impact on the global economy and the economy at home. \"This changing world is unsettling for families who are worried about the cost of living and businesses concerned about what tariffs will mean for them. But our task as a government is not to be knocked off course or to take rash action which risks undermining people's security. \"Instead, we must rise to meet the moment and I will always act to defend British interests as part of our plan for change. \"We need a world economy that provides stability and fairness for businesses wanting to invest and trade, more trade and global partnerships between nations with shared interests, and security for working people who want to get on with their lives.\""
    },
    {
        "title": "Who is Kevin Farrell? The cardinal who announced Pope Francis' death",
        "description": "The Vatican's announcement of Pope Francis' death on Monday morning came from Cardinal Kevin Farrell.",
        "url": "https://news.sky.com/story/who-is-kevin-farrell-the-cardinal-who-announced-pope-francis-death-13353163",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cardinal-kevin-farrell_6892668.jpg?20250421100518",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-21 13:55:00",
        "Headline": "Irish-born American Cardinal Kevin Farrell is the Camerlengo, meaning he is interim chief of the Catholic Church. What exactly are his responsibilities, and what did he do before getting the role?",
        "Content": " The Vatican's announcement of Pope Francis' death on Monday morning came from Cardinal Kevin Farrell. The Irish-born American offered kind words about the late pontiff, saying: \"He taught us to live the values of the gospel with faithfulness, courage, and universal love, especially for the poorest and most marginalised. \"With immense gratitude for his example as a true disciple of the Lord Jesus, we commend the soul of Pope Francis to the infinite merciful love of God, One and Triune.\" The announcement by Cardinal Farrell was just one aspect of his vital role over the coming days, as the Pope's death made him the interim chief of the Catholic Church. The role is known as the Camerlengo, or chamberlain. Follow latest: Pope Francis dies aged 88 But who is Cardinal Farrell, and what are his responsibilities? Who is Kevin Farrell? Cardinal Farrell was born in Dublin in 1947, and ordained a priest in 1978, having studied at the Pontifical Gregorian University in Rome and entered the Congregation of the Legionaries of Christ in 1966. After being ordained, he served as chaplain of the Regnun Christi Movement at the University of Monterrey in Mexico. In 1984, he was incardinated in the archdiocese of Washington, where he held a number of positions before being appointed as an auxiliary bishop of Washington by Pope John Paul II in 2001. He served as Washington's moderator of the curia and chief vicar general from 2001 until he was appointed as bishop of Dallas in 2007. It was in 2016 that Pope Francis called on him to work at the Vatican as the prefect of the newly established Vatican Dicastery for the Laity, Family and Life. Around three years later, he was nominated by the pope to be Camerlengo of the Holy Roman Church. Since then, he has been entrusted with other jobs of significant responsibility, such as president of the Commission for Confidential Matters and president of the Vatican City State Supreme Court. What are his responsibilities? When a Pope dies or, more rarely, resigns, the Catholic Church enters a period called \"sede vacante\". This means \"empty seat\" - as there is no Pope sitting on the throne of St Peter. During this period, the Camerlengo - in this case, Cardinal Farrell - takes charge. He is the one who was responsible for the formal determination of the Pope's death. He will have stood over the papal body this morning and ceremoniously called the Pope's baptismal name three times. It is only when there is no response to the calls that the Pope is officially pronounced dead. After this, the death certificate is written. The papal apartments are locked by the Camerlengo, with the papal study and bedroom sealed. The Camerlengo then breaks the Pope's signet ring and seal with shears, to prevent them from being used by anyone else. Before announcing his death to the public, Cardinal Farrell will have shared the news with the vicar of Rome, the dean of the College of Cardinals, the ambassadors of the Holy See and the heads of nations. In this sede vacante stage, which usually lasts a few weeks, Cardinal Farrell will run the administrative and financial duties of the Holy See until a new Pope takes over. You can read more about the process to choose a new Pope here."
    },
    {
        "title": "Rachel Reeves to head to Washington amid hopes of US trade deal",
        "description": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal.",
        "url": "https://news.sky.com/story/rachel-reeves-to-head-to-washington-amid-hopes-of-us-trade-deal-13353134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6890421.jpg?20250419022550",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-21 21:00:00",
        "Headline": "The chancellor will hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Donald Trump's tariffs.",
        "Content": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal. The chancellor will fly to the US capital for her spring meetings of the International Monetary Fund (IMF), the first of which began on Sunday. During her three-day visit, Ms Reeves is set to hold meetings with G7, G20 and IMF counterparts about the changing global economy and is expected to make the case for open trade. Politics latest: Tributes paid to Pope Francis Her visit comes after Donald Trump imposed blanket 10% tariffs on all imports into the US, including from the UK, and as talks about reaching a trade deal intensified. The chancellor will also hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Mr Trump's tariffs. In addition to the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports. Ms Reeves will also be hoping to encourage fellow European finance ministers to increase their defence spending and discuss the best ways to support Ukraine in its war against Russia. Read more:Mission: Impossible? Chancellor heads to the IMFStarmer and the King pay tribute to Pope Francis Speaking ahead of her visit, Ms Reeves said: \"The world has changed, and we are in a new era of global trade. I am in no doubt that the imposition of tariffs will have a profound impact on the global economy and the economy at home. \"This changing world is unsettling for families who are worried about the cost of living and businesses concerned about what tariffs will mean for them. But our task as a government is not to be knocked off course or to take rash action which risks undermining people's security. \"Instead, we must rise to meet the moment and I will always act to defend British interests as part of our plan for change. \"We need a world economy that provides stability and fairness for businesses wanting to invest and trade, more trade and global partnerships between nations with shared interests, and security for working people who want to get on with their lives.\""
    },
    {
        "title": "Octopus to get tentacles around Hammond-backed fintech fund",
        "description": "One of Britain's leading venture capital investors is close to unveiling a deal to take over a nascent fintech fund which counted Lord Hammond, the former chancellor, among its advisors.",
        "url": "https://news.sky.com/story/octopus-to-get-tentacles-around-hammond-backed-fintech-fund-13353120",
        "image_url": "https://e3.365dm.com/21/09/1920x1080/skynews-philip-hammond-lord_5521743.jpg?20210923155548",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-21 12:14:00",
        "Headline": "The Fintech Growth Fund, which counted Barclays, the London Stock Exchange, and NatWest among its investors, is to be taken over by Octopus Ventures, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of Britain's leading venture capital investors is close to unveiling a deal to take over a nascent fintech fund which counted Lord Hammond, the former chancellor, among its advisors. Sky News has learnt that Octopus Ventures has provisionally agreed to absorb the Fintech Growth Fund (FGF), which boasted of financial commitments from Barclays, the London Stock Exchange's parent company, Mastercard and NatWest Group after it was set up three years ago. The FGF has struggled to hit its original fundraising target and has yet to formally disclose any investments. Sources close to a number of its investors said it was expected to be taken over by Octopus Investments in the coming weeks, with the transaction to be completed by the end of June. Peel Hunt, the investment bank, had been advising on the fundraising for the last two years, and was itself an investor in the fund. The FGF was originally conceived as a vehicle that would back high-potential UK-based fintechs, largely between their Series B and pre-public listing rounds of funding. Read more from Sky News:DHL suspends some shipments to USCMC chief Lord Cruddas in £40m raid on broker Winterflood \n                  Rachel Reeves to head to Washington amid hopes of US trade deal\n                 \n                  Meet the teenage AI company founder who secured a $1m investment | New Money\n                 \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 According to an announcement made in August 2023, it aimed to make between four and eight investments annually, with cheques of between £10m and £100m. In addition to Lord Hammond, the FGF's advisory board included Dame Jayne-Anne Gadhia, the former Virgin Money boss; Baroness Morrissey, the former Legal & General Investment Management executive; Lord Grimstone, the former trade minister; and Sir Charles Bowman, former Lord Mayor of London. Octopus Investments, which is now run by Erin Platt, the former boss of Silicon Valley Bank UK, is said to have significant ambitions for the FGF, which has built a lengthy pipeline of potential investments. A spokesperson for Octopus Investments declined to comment this weekend, while the FGF could not be reached for comment."
    },
    {
        "title": "Rachel Reeves to head to Washington amid hopes of US trade deal",
        "description": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal.",
        "url": "https://news.sky.com/story/rachel-reeves-to-head-to-washington-amid-hopes-of-us-trade-deal-13353134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6890421.jpg?20250419022550",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-21 21:00:00",
        "Headline": "The chancellor will hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Donald Trump's tariffs.",
        "Content": "Rachel Reeves will pledge to \"stand up for Britain's national interest\" as she heads to Washington DC amid hopes of a UK/US trade deal. The chancellor will fly to the US capital for her spring meetings of the International Monetary Fund (IMF), the first of which began on Sunday. During her three-day visit, Ms Reeves is set to hold meetings with G7, G20 and IMF counterparts about the changing global economy and is expected to make the case for open trade. Politics latest: Tributes paid to Pope Francis Her visit comes after Donald Trump imposed blanket 10% tariffs on all imports into the US, including from the UK, and as talks about reaching a trade deal intensified. The chancellor will also hold her first in-person meeting with her US counterpart, treasury secretary Scott Bessent, about striking a new trade agreement, which the UK hopes will take the sting out of Mr Trump's tariffs. In addition to the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports. Ms Reeves will also be hoping to encourage fellow European finance ministers to increase their defence spending and discuss the best ways to support Ukraine in its war against Russia. Read more:Mission: Impossible? Chancellor heads to the IMFStarmer and the King pay tribute to Pope Francis Speaking ahead of her visit, Ms Reeves said: \"The world has changed, and we are in a new era of global trade. I am in no doubt that the imposition of tariffs will have a profound impact on the global economy and the economy at home. \"This changing world is unsettling for families who are worried about the cost of living and businesses concerned about what tariffs will mean for them. But our task as a government is not to be knocked off course or to take rash action which risks undermining people's security. \"Instead, we must rise to meet the moment and I will always act to defend British interests as part of our plan for change. \"We need a world economy that provides stability and fairness for businesses wanting to invest and trade, more trade and global partnerships between nations with shared interests, and security for working people who want to get on with their lives.\""
    },
    {
        "title": "League table of foreign criminals awaiting deportation and their offences set to be published",
        "description": "A league table of foreign criminals and their offences is set to be published for the first time.",
        "url": "https://news.sky.com/story/league-table-of-foreign-criminals-awaiting-deportation-and-their-offences-set-to-be-published-13353517",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-generic-man-handcuffs_6300583.jpg?20230928072810",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-21 23:31:00",
        "Headline": "The Conservatives believe the figures will show the \"hard reality that mass migration is fuelling crime across our country\".",
        "Content": "A league table of foreign criminals and their offences is set to be published for the first time. The plans, due to be announced on Tuesday, will reportedly focus on those offenders awaiting deportation from the UK. The latest data shows there were 19,244 foreign offenders awaiting deportation at the end of 2024, a rise from 17,907 when the Conservatives left office in July and 14,640 at the end of 2022. Despite more offenders being deported since Labour came to power, the number waiting to be removed from the UK has been growing. Factors are understood to include the early release of inmates due to prison overcrowding, instability and diplomatic problems in some countries and a backlog of legal cases appealing deportation. Shadow home secretary Chris Philp said the decision to publish the nationalities of foreign criminals showed Labour had \"buckled\" under pressure from the Conservatives to disclose the data. The latest government statistics show there were 10,355 foreign nationals held in custody in England and Wales at the end of 2024, representing 12% of the prison population. \n                  Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report\n                 \n                  The Godfather-style gang war gripping two major cities - with brutal attacks caught on camera\n                 \n                  James McCall: Sales manager who sexually assaulted women while they slept jailed for 12 years\n                 The most common nationalities after British nationals were Albanian (11%), Polish (8%), Romanian (7%), which also represented the top three nationalities who were deported from the UK in 2024, according to Home Office figures. Home Secretary Yvette Cooper is understood to have ordered officials to release the details by the end of the year, according to The Daily Telegraph. The newspaper reported Ms Cooper overruled Home Office officials, who previously claimed it was too difficult to provide quality data on foreign criminals. A Home Office source said: \"Not only are we deporting foreign criminals at a rate never seen when Chris Philp and Robert Jenrick were in charge at the Home Office, but we will also be publishing far more information about that cohort of offenders than the Tories ever did.\" The source added that ministers wanted \"to ensure the public is kept better informed about the number of foreign criminals awaiting deportation, where they are from and the crimes they have committed\". In March, the government announced £5m in funding to deploy staff to 80 jails in England and Wales to speed up the deportation of foreign offenders. Read more from Sky News:'Return hubs' get UN backingSex offender allowed to stay in UKWoman born in UK faces being deported Foreign nationals sentenced to 12 months or more in prison are subject to automatic deportation, but the home secretary can also remove criminals if their presence in the UK is not considered desirable. Shadow justice secretary Robert Jenrick welcomed the news, saying: \"We will finally see the hard reality that mass migration is fuelling crime across our country... Frankly, the public deserved to know this [detail on foreign criminals] long ago.\""
    },
    {
        "title": "Starmer and Zelenskyy discuss ending Russia's 'brutal war' - as Putin says says he is open to bilateral talks on longer ceasefire",
        "description": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks.",
        "url": "https://news.sky.com/story/starmer-and-zelenskyy-discuss-ending-russias-brutal-war-as-putin-says-says-he-is-open-to-bilateral-talks-on-longer-ceasefire-13353371",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-volodymyr-zelenskyy_6893268.jpg?20250421192647",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-21 17:04:00",
        "Headline": "Asked by a state TV reporter about Volodymyr Zelenskyy's call for a 30-day ceasefire on civilian targets, Vladimir Putin said talks could be held bilaterally and added \"we do not rule this out\".",
        "Content": "Sir Keir Starmer and Volodymyr Zelenskyy spoke about ending Russia's \"brutal war\" on Ukraine in their latest phone call on Easter Monday, as Vladimir Putin said he was open to bilateral talks. The prime minister and Ukrainian president spoke on Monday afternoon, when Sir Keir \"reiterated his iron-clad support for Ukraine\". A Downing Street spokesperson added that the prime minister \"said that the UK supports Ukraine's calls for Russia to commit to a full ceasefire and that now is the time for Putin to show he is serious about ending his brutal war\". \"They discussed the latest developments on the Coalition of the Willing, and looked forward to further progress towards a just and lasting peace,\" the spokesperson added. Mr Zelenskyy later said on social media that he had a \"good and detailed conversation\" with the prime minister, and added Ukrainian officials will be in London for talks on ending the war with Russia on Wednesday. \"We are ready to move forward as constructively as possible, just as we have done before, to achieve an unconditional ceasefire, followed by the establishment of a real and lasting peace,\" he added. The Ukrainian president added that the 30-hour Easter truce, which both Kyiv and Moscow accuse the other of violating, showed that Russia \"are prolonging the war\". It comes as Mr Putin proposed bilateral talks with Ukraine on a longer ceasefire, which would mark the first time Russia held such talks since a failed peace deal soon after the invasion in 2022. Speaking to a state TV reporter, the Russian president said: \"We always have a positive attitude towards a truce, which is why we came up with such an initiative (the Easter truce), especially since we are talking about the bright Easter days.\" When asked about Mr Zelenskyy's calls to extend the 30-hour ceasefire into a 30-day pause on civilian targets, he added: \"This is all a subject for careful study, perhaps even bilaterally. We do not rule this out.\" The Ukrainian president said on Sunday evening that the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day, and accused Russia of \"failing\" to \"uphold its own promise of a ceasefire\".  It also comes after Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week,\" after he and his secretary of state Marco Rubio warned that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said on his Truth Social platform that both countries would \"start to do big business\" with the US after ending the war. Read more from Sky News:Murder arrest after woman stabbed to deathWho could be the next pope? Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce, but Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He then said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "Keir Starmer and King Charles pay tribute to Pope Francis",
        "description": "Leaders from across the UK including the Prime Minister and King Charles have been paying tribute to Pope Francis, who has died at the age of 88.",
        "url": "https://news.sky.com/story/keir-starmer-and-king-charles-pay-tribute-to-pope-francis-13353068",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-king-charles_6892629.jpg?20250421104656",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-21 09:28:00",
        "Headline": "He was a \"leader of courage and compassion\", and demonstrated that leadership \"isn't about power, but about service\". Just some of the many tributes being paid to Pope Francis by the UK's civil and political leaders.",
        "Content": "Leaders from across the UK including the Prime Minister and King Charles have been paying tribute to Pope Francis, who has died at the age of 88. He was selected to serve as pontiff in 2013 and was the first to choose the name Francis. He went on to influence millions and met with many of the civil and political leaders of the UK. King Charles, who met with Pope Francis earlier this month, led tributes from UK leaders, calling the pope a \"faithful follower of Jesus Christ\". Pope dies latest: King leads tributes from around the world He said: \"My wife and I were most deeply saddened to learn of the death of Pope Francis. Our heavy hearts have been somewhat eased, however, to know that His Holiness was able to share an Easter Greeting with the Church and the world he served with such devotion throughout his life and ministry. \"His Holiness will be remembered for his compassion, his concern for the unity of the Church and for his tireless commitment to the common causes of all people of faith, and to those of goodwill who work for the benefit of others. \"His belief that care for Creation is an existential expression of faith in God resounded with so many across the world. Through his work and care for both people and planet, he profoundly touched the lives of so many. The King continued: \"The Queen and I remember with particular affection our meetings with His Holiness over the years and we were greatly moved to have been able to visit him earlier in the month. \"We send our most heartfelt condolences and profound sympathy to the Church he served with such resolve and to the countless people around the world who, inspired by his life, will be mourning the devastating loss of this faithful follower of Jesus Christ.\" Sir Keir Starmer has also paid tribute to the pontiff and said he joined \"millions around the world in grieving\" his death. The Prime Minister added: \"His leadership in a complex and challenging time for the world and he church was often courageous, yet always came from a place of deep humility. \"Pope Francis was a pope for the poor, the downtrodden and the forgotten. He was close to the realities of human fragility, meeting Christians around the world facing war, famine, persecution and poverty. Yet he never lost the faith-fuelled hope of a better world. \"That hope was at the heart of his papacy. His determination to visibly live out his faith inspired people across the world to see afresh the church's teachings of mercy and charity. He added: \"With his death, we are reminded once more of his call to care for one another across different faiths, backgrounds, nations and beliefs. \"My thoughts are with Catholics across the world, and the Roman Catholic Church. \"May His Holiness Rest in Peace.\" He spent his \"final Easter yesterday bearing witness to the faith he devoted his life to\", Conservative leader Kemi Badenoch said. The Leader of the Opposition added that Pope Francis was \"a quiet presence at a time when the world needed humility, courage and conviction.\" She wrote: \"His death on Easter Monday feels especially poignant. He reminded us that leadership isn't about power, but about service. Ms Badenoch, whose husband is Catholic, added: \"When I met him in 2022, he spoke warmly of the UK and the values we share. \"In a world that too often turns away from faith, he stood firm. May he rest in peace.\" Sir Ed Davey called the pope's passing a \"profound loss to millions across the world\". The Liberal Democrat leader said: \"He was a leader of compassion and courage, speaking up for those in need and calling for peace in a world too often divided. \"His influence reached far beyond the Church. He offered hope by reminding us of strength in kindness and faith. \"We should remember his example: stand up for what's right, care for others, and hold onto compassion and hope.\" Nigel Farage, the leader of Reform UK, remarked that he met Pope Francis and \"liked him very much\". He said his \"sympathies go out to all in the Catholic Church following the death of Pope Francis\". Read more from Sky News:Pope Francis obit: A pope of firstsWho could be the next pope?Analysis: The Pope's legacy in charts and numbers Tributes were also paid to the pope from the leaders of the UK's devolved administrations. John Swinney, the First Minister of Scotland, said it was with \"deep sadness\" that he heard the news of the pope's passing. \"He was a voice for peace, tolerance and reconciliation in our society\", the SNP leader said. \"He brought comfort, assurance and hope to many. May he rest in peace\", Mr Swinney concluded. In Wales, First Minister Eluned Morgan said: \"It is with great sadness that we hear of the death of His Holiness Pope Francis this morning. \"Our thoughts and prayers are with our Catholic community in Wales and around the world at this very difficult time.\" Former prime minister Sir Tony Blair, who converted to Catholicism after leaving office, also paid tribute to the pope. He said: \"Pope Francis was an extraordinary and devoted servant of the Catholic Church, admired both within and beyond it for his humility, compassion, and unwavering commitment to the Christian faith and the service of all humanity - Christian and non-Christian alike.\""
    },
    {
        "title": "Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report",
        "description": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned.",
        "url": "https://news.sky.com/story/gangs-behind-billion-pound-cyber-scam-industry-expanding-as-they-try-to-dodge-government-crackdowns-new-un-report-13352989",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-myanmar-scams-thailan_6892544.jpg?20250421071533",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-21 06:18:00",
        "Headline": "South East Asian crime syndicates behind a multibillion-pound cyber scam industry are expanding targets and growing their business, a UN agency warned, adding that countries were reaching an \"inflection point\" to tackle the issue.",
        "Content": "Crime syndicates behind a multibillion-pound cyber scam industry are expanding globally as governments in South East Asia struggle to contain them, a UN report has warned. As they expand business, countries in South America, Africa and Eastern Europe are now being targeted, the United Nations Office on Drugs and Crime (UNODC) said. The networks and gangs have emerged in South East Asia in recent years, in sprawling compounds housing tens of thousands of people, many trafficked and forced into work, scamming victims abroad. Sky News previously reported on one of these compounds, and the workers who were tricked, trafficked and forced into working there.  Even as governments in Asia have intensified their crackdowns, the gangs have moved within and beyond the region, the UNODC said. It warned that a \"potentially irreversible spillover has taken place... leaving criminal groups free to pick, choose, and move... as needed\". \"It spreads like a cancer,\" John Wojcik, a regional analyst for UNODC, said. \"Authorities treat it in one area, but the roots never disappear; they simply migrate.\" Even the more conservative estimates indicate there are hundreds of large-scale scam farms around the world, generating tens of billions of pounds, the UNODC warned. The agency called on countries to commit to a more joined-up approach to tackle the international issue. \"The regional cyberfraud industry... has outpaced other transnational crimes, given that it is easily scalable and able to reach millions of potential victims online, with no need to move or traffic illicit goods across borders,\" Mr Wojcik said. South America, Africa and Eastern Europe targeted  The syndicates have moved to expand into new ground, the UN agency warned. In South America, the networks were said to be seeking increased partnerships with drug cartels. Zambia, Angola and Namibia in Africa, and Georgia in Eastern Europe, were also seeing an increasingly established base of scam operations. Gangs have also diversified their workforces, UNODC said, as they recruit people from dozens of nationalities. Citizens of more than 50 countries, from Sri Lanka to Uzbekistan and Brazil to Nigeria, were rescued in recent crackdowns on the Thai-Myanmar border. 'Inflection point' Recent months have seen authorities from China, Thailand and Myanmar all move to crack down on the scam operations that have thrived particularly in the lawless areas of the Thai-Myanmar border. Thailand has moved to cut power, fuel and internet to areas housing the scam compounds. However, the syndicates have adapted and shifted their operations between \"the most remote, vulnerable, and underprepared parts of South East Asia\", UNODC said. This was taking place especially in Laos, Myanmar and Cambodia, where gangs exploited jurisdictions with weak governance and high corruption levels. In Cambodia, the industry is most visible and raids there led to it expanding into \"more remote locations\", including the country's western Koh Kong province, the UN agency said. New sites also continue to be developed in Myanmar - a country gripped by an expanding conflict and recently hit by a deadly earthquake. Read more from Sky News:The Pope has died - what happens next?Deepfake videos of Sky News journalistsTrump told to sack defence secretary UNODC said the international community was at a \"critical inflection point\", with failures to tackle the issue properly now leading to \"unprecedented consequences for Southeast Asia that reverberate globally\". A spokesperson for the Chinese Embassy told Sky News: \"China attaches great importance to engage in international and regional endeavours in a responsible and constructive manner to deal with this cross-border issue. \"Substantial progress has been achieved since this year. China will continue to work with relevant parties to crack down on telecom fraud and other cross-border illegal and criminal activities.\""
    },
    {
        "title": "Back To The Future's DeLorean has almost vanished from UK roads",
        "description": "Forty years on from the film that made them immortal, there are just 303 DeLorean cars left on Britain's roads.",
        "url": "https://news.sky.com/story/back-to-the-futures-delorean-has-almost-vanished-from-uk-roads-13352965",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/sky-news-delorean-belfast_6577143.jpg?20240609190358",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-21 01:40:00",
        "Headline": "\"Where we're going, we don't need roads,\" said Doc Brown in Back To The Future, immortal words that now reflect the status of the DeLorean. The classic cars are largely consigned to collectors' garages, new figures show.",
        "Content": "Forty years on from the film that made them immortal, there are just 303 DeLorean cars left on Britain's roads. To mark the anniversary of Back To The Future, released in 1985, online auction platform Collecting Cars nabbed the latest figures on their use from the Driver and Vehicle Licensing Agency. In addition to the 303 taxed for use on Britain's roads, another 114 have statutory off-road notification - meaning they are likely gathering dust in garages. Just four years before the film's release, 9,000 DeLorean DMC-12s rolled off the company's assembly line in Dunmurry, Northern Ireland. But the company collapsed into insolvency the following year and the cars have since become a collector's item. Read more from Sky News:Is 'The Last Of Us' fungus a real threat?Four things to avoid at the London Marathon 'We don't need roads' Collecting Cars has only sold two in the past six years, and reckons a fully restored version could fetch £80,000. If you found one that could really take you back in time to 1981, you'd find it was going for around £18,000. The auctioneer's chief executive Edward Lovett said a combination of scarcity and Back To The Future's unending popularity had pushed prices sky-high (not that the real cars can actually fly, alas). The film version of the DeLorean famously took off at the end of the first film, when Christopher Lloyd's time-traveller Doc Brown uttered the immortal words: \"Where we're going, we don't need roads.\" Back To The Future spawned two sequels and has a popular musical in the West End, while reports suggest it could form part of the Universal Studios theme park announced for the UK this month."
    },
    {
        "title": "Back To The Future's DeLorean has almost vanished from UK roads",
        "description": "Forty years on from the film that made them immortal, there are just 303 DeLorean cars left on Britain's roads.",
        "url": "https://news.sky.com/story/back-to-the-futures-delorean-has-almost-vanished-from-uk-roads-13352965",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/sky-news-delorean-belfast_6577143.jpg?20240609190358",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-04-21 01:40:00",
        "Headline": "\"Where we're going, we don't need roads,\" said Doc Brown in Back To The Future, immortal words that now reflect the status of the DeLorean. The classic cars are largely consigned to collectors' garages, new figures show.",
        "Content": "Forty years on from the film that made them immortal, there are just 303 DeLorean cars left on Britain's roads. To mark the anniversary of Back To The Future, released in 1985, online auction platform Collecting Cars nabbed the latest figures on their use from the Driver and Vehicle Licensing Agency. In addition to the 303 taxed for use on Britain's roads, another 114 have statutory off-road notification - meaning they are likely gathering dust in garages. Just four years before the film's release, 9,000 DeLorean DMC-12s rolled off the company's assembly line in Dunmurry, Northern Ireland. But the company collapsed into insolvency the following year and the cars have since become a collector's item. Read more from Sky News:Is 'The Last Of Us' fungus a real threat?Four things to avoid at the London Marathon 'We don't need roads' Collecting Cars has only sold two in the past six years, and reckons a fully restored version could fetch £80,000. If you found one that could really take you back in time to 1981, you'd find it was going for around £18,000. The auctioneer's chief executive Edward Lovett said a combination of scarcity and Back To The Future's unending popularity had pushed prices sky-high (not that the real cars can actually fly, alas). The film version of the DeLorean famously took off at the end of the first film, when Christopher Lloyd's time-traveller Doc Brown uttered the immortal words: \"Where we're going, we don't need roads.\" Back To The Future spawned two sequels and has a popular musical in the West End, while reports suggest it could form part of the Universal Studios theme park announced for the UK this month."
    }
]