[
    {
        "title": "Displaced civilians in Democratic Republic of Congo face frenzy of fear and uncertainty",
        "description": "Hundreds of displaced Congolese marched down a sloping road in northeast Goma with their lives on their backs.",
        "url": "https://news.sky.com/story/displaced-civilians-in-democratic-republic-of-congo-face-frenzy-of-fear-and-uncertainty-13297307",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-drc-congo-goma-m23_6811438.jpg?20250126173530",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-01-26 17:08:00",
        "Headline": "A Sky News team was attacked in Goma because people fleeing the escalating conflict thought they were Rwandan - giving a small glimpse of the panicked civil unrest in the city.",
        "Content": "A Sky News team was attacked in Goma because people fleeing the escalating conflict thought they were Rwandan - giving a small glimpse of the panicked civil unrest in the city.\nAfrica correspondent@YousraElbagir\nMonday 27 January 2025 10:01, UK\nPlease use Chrome browser for a more accessible video player\n\nHundreds of displaced Congolese marched down a sloping road in northeast Goma with their lives on their backs.\nMothers with mattresses strapped to them dragged their toddlers alongside and trucks brimmed with bodies and belongings.\nMany of them have been displaced more than once, as the violent insurgency waged by Rwanda-backed M23 rebels against the Congolese army spread furiously in 2024.\nRead more:At least 13 peacekeepers killed in DRC\nIt reached new heights in recent weeks as they seized control of large swathes of territory in eastern Democratic Republic of Congo (DRC) and now, are advancing on the regional capital Goma.\nPlease use Chrome browser for a more accessible video player\n\nThe humanitarian hub is marked for capture by M23 with dozens of diplomats and non-essential United Nations (UN) staff evacuated by planes, cars and ferries.\nAs they leave, 250,000 of the most vulnerable Congolese pour into the city for safety.\nWe watched the movement near Goma's Kihisi roundabout as hordes of civilians walked in the middle of the road with experience and urgency.\nPlease use Chrome browser for a more accessible video player\n\nAs we stopped to mark their plight, a small crowd stopped to stare at us.\nReports were circling that Rwandan troops had crossed the border into Goma just 5km from where we were standing - an invasion later confirmed by the UN top official in the DRC, Bintu Keita.\nPlease use Chrome browser for a more accessible video player\n\nAs we pressed record, a man with rageful red eyes pointed at me and yelled violently. We were attacked as we tried to escape.\nOur colleague translated the intent fuelling the mob once we got to safety - they thought I was Rwandan.\nThat frenzy gives a small glimpse into the communal-level tribal hostility that has fuelled this 30-year conflict - a hangover from the notoriously violent Rwandan genocide.\nThe panicked civil unrest in that neighbourhood has not quelled in the hours since news spread of M23 moving in.\nUN staff still in Goma have been told to stay indoors and there is increasing concern for civilians here as evidence looms of M23 atrocities in areas of their control.\n\"We know that M23 has been using the local population to transport their ammunition, like in [recently captured] Minova, and this is not the first time,\" one aid worker told us on condition of anonymity.\nWe spoke to an M23 spokesman Manzi Ngaramble from our hotel in Goma and he confirmed that they are moving in to capture the city to \"protect the people\".\n\"I cannot tell you how soon M23 will capture Goma but I can tell you this: Goma will never be the same again.\"\nWhen M23 previously captured Goma in 2012, peace was quickly brokered and the rebels retreated.\nNow, Rwandan involvement has made this a regional, diplomatic crisis.\nRead more from Sky News:Holocaust survivor 'jumped from death train'Trump plans to call Starmer within 24 hours\nFollow our channel and never miss an update\nBe the first to getBreaking News\nInstall the Sky News app for free\nA UN security council meeting due to be held on Monday was expedited to Sunday - echoing calls for de-escalation and protection of civilians as Goma hangs in the balance.\nTroops from the United Nations Organisation Stabilisation Mission in the DRC (MONUSCO) - the UN's biggest peacekeeping mission - have been told to pull into the city and lock in place, after days of fighting on Goma's outskirts led to at least 13 peacekeepers killed and 50 injured.\nUN Secretary-General Antonio Guterres says he is \"deeply concerned by the escalation of violence\", calling on the Rwandan Defence Forces to stop supporting M23 and to withdraw from the territory of the DRC.\nAs diplomats and humanitarians scramble to neutralise an explosion that is decades in the making, Goma's future looks dark.\nThe hundreds of thousands of civilians who sought safety here are caught in a rabid frenzy of fear, rage and uncertainty."
    },
    {
        "title": "Donald Trump's threats work after Colombia backs down and agrees to accept deported migrants from US",
        "description": "Donald Trump has won a battle with Colombia after threatening a trade war when the country refused to accept deported migrants.",
        "url": "https://news.sky.com/story/trump-announces-retaliatory-measures-after-colombia-refuses-to-accept-deported-migrant-flight-13297424",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-migrant-immigration_6811611.jpg?20250126212304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-26 19:29:00",
        "Headline": "The US president had threatened emergency tariffs on Colombian goods, prompting Colombia's president to suggest he would impose similar taxes on American goods in retaliation.",
        "Content": "The US president had threatened emergency tariffs on Colombian goods, prompting Colombia's president to suggest he would impose similar taxes on American goods in retaliation.\nMonday 27 January 2025 11:07, UK\nDonald Trump has won a battle with Colombia after threatening a trade war when the country refused to accept deported migrants.\nTheUS presidentsaid he would retaliate with \"urgent and decisive\" measures - including 25% emergency tariffs onColombiangoods - after the country turned away two US military planes.\nOnboard were migrants being deported from America as part of Mr Trump'ssweeping immigration crackdown.\nBut in a statement on Sunday, the White House said Colombia had backed down.\n\"The Government of Colombia has agreed to all of President Trump's terms, including the unrestricted acceptance of all illegal aliens from Colombia returned from the United States, including on US military aircraft, without limitation or delay,\" it said.\nThe US leader previously said Colombian president Gustavo Petro's action \"jeopardised the national security and public safety of the United States\" in a statement on Truth Social.\nThe initial response from the Colombian president was bullish. He threatened to respond with 50% tariffs on goods from the US, telling Mr Trump in a post on X: \"Your blockade does not scare me, because Colombia, besides being the country of beauty, is the heart of the world.\"\nBut after Colombia backed down, Mr Petro wrote on X that Mr Trump would \"wipe out the human species because of greed\", adding: \"You don't like our freedom, okay. I don't shake hands with white slavers.\n\"Overthrow me, President, and the Americas and humanity will respond.\n\"You can try to carry out a coup with your economic strength and your arrogance.\"\nMr Trump posted a defiant message online: \"We will not allow the Colombian government to violate its legal obligations with regard to the acceptance and return of the criminals they forced into the United States!\"\nHis post was quickly followed by an AI-generated image showing the president in a fedora hat, alongside a sign reading FAFO, which usually stands for \"f*** around, find out\".\nIn a statement late on Sunday, Colombian foreign minister Luis Gilberto Murillo said: \"We have overcome the impasse with the US government.\"\nSunday's White House statement added that draft orders, imposing tariffs and sanctions on Colombia, would be \"held in reserve, and not signed, unless Colombia fails to honour this agreement\".\nThere was also a warning to other countries. \"Today's events make clear to the world that America is respected again. President Trump... expects all other nations of the world to fully cooperate in accepting the deportation of their citizens illegally present in the United States.\"\nBefore backing down, President Petro had demanded migrants deported by the US should be treated with dignity and respect.\n\"The US cannot treat Colombian migrants as criminals,\" Mr Petro wrote on X, noting that there were 15,660 Americans without proper immigration status in Colombia.\nPlease use Chrome browser for a more accessible video player\n\nColombia's decision to block military migrant flights follows a similar one byMexico, whichrefused a request to let a US military aircraft landwith migrants on Thursday.\nThere is growing discontent in South American countries as Mr Trump's week-old administration begins mass deportations.\n👉 Follow Trump 100 on your podcast app 👈\nOn Saturday, Brazil's foreign ministry condemned the \"degrading treatment\" of Brazilians after migrants were handcuffed on a commercial deportation flight.\nFollow our channel and never miss an update\nRead more from Sky News:Trump and Starmer 'agree to meet soon'Holocaust survivor 'jumped from death train'Rebels in DRC take key city\nBrazilian officials ordered the removal of the handcuffs when the plane landed and President Luiz Inacio Lula da Silva designated a Brazilian Air Force (FAB) flight to complete their journey, the government said in a statement on Saturday.\nUsing military aircraft to carry out deportation flights is a response to Mr Trump's national emergency declaration on immigration on Monday.\nAlthough US military aircraft have been used in emergencies like the US withdrawal from Afghanistan in 2021, this is the first time in recent memory they have been used to fly migrants out of the country, one US official said.\nMilitary aircraft carried out two similar flights, each with about 80 migrants, to Guatemala on Friday.\nBe the first to getBreaking News\nInstall the Sky News app for free"
    },
    {
        "title": "Auschwitz Remembered: Survivors mark liberation from former Nazi concentration camp 80 years ago",
        "description": "World leaders, royalty and dignitaries are meeting at Auschwitz-Birkenau today to mark the 80th anniversary of its liberation, but the remaining survivors and their message will remain the focus of events.",
        "url": "https://news.sky.com/story/auschwitz-remembered-survivors-mark-liberation-from-former-nazi-concentration-camp-80-years-ago-13297515",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-auschwitz-ii-birkenau_6811692.jpg?20250127025954",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-26 22:55:00",
        "Headline": "King Charles will join world leaders at the commemoration event in Poland where lights will be laid in memory of those murdered. ",
        "Content": "King Charles will join world leaders at the commemoration event in Poland where lights will be laid in memory of those murdered.\nMonday 27 January 2025 07:32, UK\nPlease use Chrome browser for a more accessible video player\n\nWorld leaders, royalty and dignitaries are meeting at Auschwitz-Birkenau today to mark the 80th anniversary of its liberation, but the remaining survivors and their message will remain the focus of events.\nThe Kingwill be among thosetravelling to Polandto remember more than a million people murdered there - mostly Jews who were among around six million killed during theHolocaustby the Nazis.\nThe ceremony - available to watch on Sky News from 2pm - will be held in front of the infamous gates of the former concentration camp which had the words Arbeit Macht Frei, \"work sets you free\", above it.\nSurvivors will place a light in front of a freight train carriage - a symbol of the event.\nCharles, with other heads of state and government, will lay lights in memory of those who died during the Holocaust during theSecond World War.\nThe carriage - manufactured inGermany- represents just one part of the harrowing ordeal people endured as they were deported to Auschwitz-Birkenau.\nPlease use Chrome browser for a more accessible video player\n\nSurvivors will address guests, expected to include France's PresidentEmmanuel Macron, German ChancellorOlaf Scholz, along with the king and queen of both the Netherlands and Spain.\nAuschwitz remembered: Why we should never forget\nKing warns of 'dangerous re-emergence of antisemitism' as he pays tribute to Holocaust survivors\nAuschwitz survivor: 'You worked until you could work no more - then you went to the chimney'\nLater historic landmarks across the UK are lighting up in purple to mark Holocaust Memorial Day at 8pm.\nIn previous years the London Eye, Wales Millennium Centre inCardiff, St George's Hall inLiverpool, theBlackpoolTower and Gateshead Millennium Bridge have been flooded in purple.\nPeople are also encouraged to place candles in their windows to honour those who were killed.\nThe prime minister hosted a reception on Wednesday for Holocaust survivors at Downing Street and spoke about his recent trip to Auschwitz-Birkenau.\nOn 17 JanuarySir Keir Starmervisited the concentration camp, a place he described as \"utterly harrowing\".\nPlease use Chrome browser for a more accessible video player\n\n'Never again' must mean 'never again'\nThe UK's main political leaders have issued statements on Holocaust Memorial Day describing the importance of being united against antisemitism.\nThe prime minister said: \"It happened, it can happen again: that is the warning of the Holocaust to us all.\n\"And it's why it is a duty for all of us to make 'never again' finally mean what it says: never again.\"\nThat view was shared by Conservative leaderKemi Badenoch: \"The Holocaust stands as a unique evil in human history.\n\"It is crucial that we learn its lessons and continue to combat antisemitism, ensuring that 'never again' truly means never again\".\nFollow our channel and never miss an update.\nRead more:How I escaped the train of deathI 'cannot forgive' GermanySurvivor fears lessons not learnt\nLiberal Democrat leaderSir Ed Daveypointed to genocides in the decades since the Second World War.\n\"We must remember, so that we try harder to stop it happening again, as it has so tragically in Cambodia, Rwanda, Bosnia and elsewhere.\n\"We must be vigilant in our opposition to antisemitism, hatred, discrimination and oppression, and vigilant in defence of peace, human rights - and compassion,\" he said.\nPope warns of 'scourge of anti-semitism'\nMeanwhile,Pope Francishas warned of the \"scourge of antisemitism\".\nIn a prayer on Sunday, the pontiff said: \"The horror of the extermination of millions of Jewish people and others of different faiths during those years must never be forgotten or denied.\n\"I renew my appeal for everyone to work together to eradicate the scourge of antisemitism, along with every form of discrimination and religious persecution.\"\nPlease use Chrome browser for a more accessible video player\n\nBe the first to getBreaking News\nInstall the Sky News app for free\n'We must not be complacent'\nNorthern Ireland's First MinisterMichelle O'Neilland Deputy First Minister Emma Little-Pengelly paused to remember the holocaust on Thursday at an event inBelfast.\nMs O'Neill said: \"As we pause to remember the past, we resolve to shine a light on suffering and injustice wherever it occurs\".\nMeanwhile, Ms Little-Pengelly said: \"Holocaust Memorial Day reminds us that we must not be complacent in the face of prejudice\"."
    },
    {
        "title": "Rebels in Democratic Republic of Congo say they have taken key city of Goma",
        "description": "Congolese rebels say they have \"taken\" the key&#160;city of Goma in the Democratic Republic of Congo (DRC).",
        "url": "https://news.sky.com/story/at-least-13-foreign-peacekeepers-killed-in-democratic-republic-of-congo-in-clashes-with-rebels-13296971",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-goma-m23-drc_6811511.jpg?20250126185023",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-26 10:46:00",
        "Headline": "The Democratic Republic of Congo (DRC) has severed diplomatic ties with Rwanda, accusing it of fuelling the rebellion. At least 13 soldiers serving with peacekeeping forces in the DRC have been killed in clashes with M23 rebels, United Nations officials said.",
        "Content": "The Democratic Republic of Congo (DRC) has severed diplomatic ties with Rwanda, accusing it of fuelling the rebellion. At least 13 soldiers serving with peacekeeping forces in the DRC have been killed in clashes with M23 rebels, United Nations officials said.\nMonday 27 January 2025 10:00, UK\nPlease use Chrome browser for a more accessible video player\n\nCongolese rebels say they have \"taken\" the key city of Goma in the Democratic Republic of Congo (DRC).\nThe leader of a rebel alliance that includes the M23 group reiterated on Sunday that government forces had until 3am to surrender their weapons.\nIt comes after 13 soldiers serving with peacekeeping forces in the DRC were killed in clashes with the rebels, United Nations officials said.\nCongolese rebels and allied Rwandan forces entered the key eastern city of Goma on Sunday and the airport is no longer in use, according to the DRC's top UN official.\n\"M23 and Rwandan forces penetrated Munigi quarter in the outskirts of Goma city, causing mass panic and flight amongst the population,\" said the UN's special representative in the DRC, Bintu Keita, to an emergency UN meeting on Sunday.\nThe strategic city of Goma has a population of about two million people and is a regional hub for security and humanitarian efforts.\nEyewitness:Sky News team in DRC attacked as civilians flee\nThe M23 is mainly made up of ethnic Tutsis who broke away from the Congolese army more than a decade ago.\nIt's one of about 100 armed groups that have been vying for a foothold in the mineral-rich region, where a long-running conflict has created one of the world's largest humanitarian crises.\nIn recent weeks, it has made significant territorial gains.\nTheDRChas accused neighbouringRwandaof fuelling the M23 rebellion and has now severed diplomatic ties with it.\nRwanda has denied the claims but last year admitted it has troops and missile systems in eastern Congo to safeguard its security, pointing to a build-up of Congolese forces near the border.\n\"Rwanda is trying to get in by all means, but we are holding firm,\" a Congolese military source told the Reuters news agency on Sunday.\n\"It is war, there are losses everywhere... the population must remain calm, we are fighting,\" they added.\nPlease use Chrome browser for a more accessible video player\n\nThe DRC has recalled its diplomats from Rwanda and asked Rwandan authorities to cease diplomatic and consular activities in the Congolese capital, Kinshasa.\nA UN Security Council meeting to discuss the escalating violence was scheduled for Monday but was brought forward to Sunday.\nDuring that meeting, France and the UK pressured Rwanda over its role in the conflict.\nFrance called for Rwanda to withdraw its troops from Congo territory, while Britain called for an end to attacks on peacekeepers by M23 rebels receiving support from Rwanda.\nIt comes after a Congolese military governor was killed while on the frontline during a M23 offensive on Friday.\nOn Saturday, the Congolese army said it foiled an M23 offensive towards Goma with the help of its allied forces, including UN troops and soldiers from the Southern African Development Community Mission, also known as SAMIDRC.\nThe burning wreckage of a white armoured fighting vehicle carrying UN markings could be seen on a road between Goma and Sake.\nSouth Africa said nine of its peacekeepers had been killed amid the surge in fighting during the last few days.\nThree Malawians and a Uruguayan were also killed, the UN said.\nRead more from Sky News:Holocaust survivor 'jumped from death train'Trump plans to call Starmer within 24 hours\nFollow our channel and never miss an update.\nDecades of conflicts in the eastern DRC between rival armed groups over land and resources, and attacks on civilians, have killed hundreds of thousands of people and displaced more than seven million.\nMilitias also include the Cooperative for the Development of the Congo (CODECO) and the Allied Democratic Forces (ADF).\nThe UN peacekeeping force entered the DRC more than two decades ago and has around 14,000 soldiers on the ground."
    },
    {
        "title": "Donald Trump and Sir Keir Starmer speak on phone and 'agree to meet soon'",
        "description": "Sir Keir Starmer and Donald Trump \"stressed the importance of the close and warm ties\" between their countries and \"agreed to meet soon\" in a phone call, Downing Street has said.",
        "url": "https://news.sky.com/story/donald-trump-and-sir-keir-starmer-speak-on-phone-and-agree-to-meet-soon-13297436",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-26 19:41:00",
        "Headline": "Earlier this weekend, the US president praised Sir Keir, telling reporters he has \"done a very good job\" so far. In a call on Sunday, the pair \"stressed the importance of the close and warm ties\" between their countries.",
        "Content": "Earlier this weekend, the US president praised Sir Keir, telling reporters he has \"done a very good job\" so far. In a call on Sunday, the pair \"stressed the importance of the close and warm ties\" between their countries.\nSunday 26 January 2025 20:11, UK\nSir Keir Starmer and Donald Trump \"stressed the importance of the close and warm ties\" between their countries and \"agreed to meet soon\" in a phone call, Downing Street has said.\nDuring the conversation on Sunday, the prime minister congratulated thepresidenton his inauguration and paid tribute to his \"role in securing the landmark ceasefire and hostages deal inGaza\", according to a Number 10 spokesperson.\nThe two leaders \"discussed the importance of working together for security in the Middle East\" as well as \"trade and the economy\".\nSir Keirtold the US leader how he plans to deregulate the UK economy to boost growth, and the president spoke of his \"respect and affection for theRoyal Family\".\nMr Trump also gave his condolences to Sir Keir overthe loss of his brother, who died on Boxing Day.\nEarlier this weekend, the president said he thinks Sir Keir has\"done a very good job\" so far.\nRead more from Sky News:Holocaust survivor 'jumped from death train'At least 13 foreign peacekeepers killed in DRC\nHe and the prime minister \"get along well\" despite Sir Keir being \"liberal, which is a little bit different from me\", he told reporters travelling with him on Air Force One.\n\"He's represented his country in terms of his philosophy. I may not agree with his philosophy but I have a very good relationship with him.\"\nSir Keir previously met Mr Trump for dinner at Trump Tower in New York in September, before he was elected president for a second time.\nHe held two pre-inauguration calls with the new US president.\nBe the first to getBreaking News\nInstall the Sky News app for free\nFollow our channel and never miss an update\nMr Trump said his first international trip could be to the UK or Saudi Arabia - the first country he travelled to as president during his first term.\nHe said \"traditionally\" it could be the UK - but last time he travelled to Saudi Arabia because it agreed to buy billions of dollars of US merchandise.\n\"If that offer were right, I'd do that again,\" he said."
    },
    {
        "title": "Donald Trump ally Lindsey Graham says pardoning January 6 rioters was a 'mistake' and could lead to more violence",
        "description": "A prominent Republican senator and longtime ally of Donald Trump has questioned his decision to pardon January 6 rioters.",
        "url": "https://news.sky.com/story/donald-trump-ally-lindsey-graham-says-pardoning-january-6-rioters-was-a-mistake-and-could-lead-to-more-violence-13297440",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-january-6th-washington-dc_6768066.jpg?20241206091733",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-26 19:36:00",
        "Headline": "Senator Graham said while President Trump had the legal authority to issue the pardons, he thought it was a mistake to pardon people who \"beat up a police officer violently.... because it seems to suggest that's an okay thing to do\".",
        "Content": "Senator Graham said while President Trump had the legal authority to issue the pardons, he thought it was a mistake to pardon people who \"beat up a police officer violently.... because it seems to suggest that's an okay thing to do\".\nSunday 26 January 2025 20:53, UK\nA prominent Republican senator and longtime ally of Donald Trump has questioned his decision to pardon January 6 rioters.\nLindsey Graham said the move was a \"mistake\" and could lead to more violence.\nMr Trumpannounced a blanket pardon for about 1,500 of his supporters who attacked the US Capitol in 2021as part of a flurry of executive orders.\nSome of those who were freed from jail earlier this week had assaulted police officers during the insurrection.\nPlease use Chrome browser for a more accessible video player\n\nRepublican senator Mr Graham said while Mr Trump had the legal authority to issue the pardons, \"pardoning the people who went into the Capitol and beat up a police officer violently, I think was a mistake. Because it seems to suggest that's an okay thing to do\".\nAs a result, \"I fear that you will get more violence\", said Mr Graham, who serves on the Senate Judiciary Committee.\nMr Trump has said that attacks on police officers during the January 6 unrestwere \"minor incidents\".\nIn his first sit-down interview since beinginaugurated on Monday, recorded in the Oval Office, Mr Trump told Fox News' Sean Hannity most of those who were jailed over the US Capitol riots were \"absolutely innocent\".\nHe went on to claim those at the US Capitol were simply there \"protesting the vote\" before again falsely claiming the 2020 election was \"rigged\".\nAmong those supporters who have been released from prison was Stewart Rhodes, the former leader of the far-right Oath Keepers group.\nRhodes had been serving an 18-year sentence after being convicted of plotting to use force to prevent Congress from certifying Mr Trump's 2020 defeat to rivalJoe Biden.\nRead more:Trump and Starmer speak on phone and 'agree to meet soon'President praises PM for doing 'very good job'Why Trump sees Churchill as an icon to emulate\nPlease use Chrome browser for a more accessible video player\n\nThe blanket pardon also drew condemnation from police who battled the mob, their families, and politicians, including some of the president's fellow Republicans.\nGraham also hits out at Biden pardons\nSpeaking on NBC's Meet the Press programme, Mr Graham also criticised Mr Trump's predecessor Democrat Mr Biden for issuing last-minute pardons for five family members and said Americans may want to revisit presidential pardon power if such actions continue.\n\"But as to pardoning violent people who beat up cops, I think that's a mistake,\" he said.\n👉 Follow Trump 100 on your podcast app 👈\nLater in the TV show, Democratic senator Adam Schiff agreed with Mr Graham, saying Mr Biden \"was wrong to give these pardons\".\nHe added: \"What it says now to the Trump family and to President Trump's kids: they can engage in any kind of malfeasance, criminality, graft, whatever, and they can expect a pardon on the way out the door. That is not a message you want to send to this family, or really any family occupying the White House.\"\nFollow our channel and never miss an update.\nTrump criticised by brother of dead officer\nCraig Sicknick, whose brother was assaulted during the riot and died of multiple strokes the next day, has called Mr Trump \"pure evil\".\n\"The man who killed my brother is now president,\" he said.\nNearly 60% of respondents in a Reuters/Ipsos poll, which was carried out after Mr Trump took office on Monday, said he should not pardon all of the Capitol defendants."
    },
    {
        "title": "Donald Trump's threats work after Colombia backs down and agrees to accept deported migrants from US",
        "description": "Donald Trump has won a battle with Colombia after threatening a trade war when the country refused to accept deported migrants.",
        "url": "https://news.sky.com/story/trump-announces-retaliatory-measures-after-colombia-refuses-to-accept-deported-migrant-flight-13297424",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-migrant-immigration_6811611.jpg?20250126212304",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-26 19:29:00",
        "Headline": "The US president had threatened emergency tariffs on Colombian goods, prompting Colombia's president to suggest he would impose similar taxes on American goods in retaliation.",
        "Content": "The US president had threatened emergency tariffs on Colombian goods, prompting Colombia's president to suggest he would impose similar taxes on American goods in retaliation.\nMonday 27 January 2025 11:07, UK\nDonald Trump has won a battle with Colombia after threatening a trade war when the country refused to accept deported migrants.\nTheUS presidentsaid he would retaliate with \"urgent and decisive\" measures - including 25% emergency tariffs onColombiangoods - after the country turned away two US military planes.\nOnboard were migrants being deported from America as part of Mr Trump'ssweeping immigration crackdown.\nBut in a statement on Sunday, the White House said Colombia had backed down.\n\"The Government of Colombia has agreed to all of President Trump's terms, including the unrestricted acceptance of all illegal aliens from Colombia returned from the United States, including on US military aircraft, without limitation or delay,\" it said.\nThe US leader previously said Colombian president Gustavo Petro's action \"jeopardised the national security and public safety of the United States\" in a statement on Truth Social.\nThe initial response from the Colombian president was bullish. He threatened to respond with 50% tariffs on goods from the US, telling Mr Trump in a post on X: \"Your blockade does not scare me, because Colombia, besides being the country of beauty, is the heart of the world.\"\nBut after Colombia backed down, Mr Petro wrote on X that Mr Trump would \"wipe out the human species because of greed\", adding: \"You don't like our freedom, okay. I don't shake hands with white slavers.\n\"Overthrow me, President, and the Americas and humanity will respond.\n\"You can try to carry out a coup with your economic strength and your arrogance.\"\nMr Trump posted a defiant message online: \"We will not allow the Colombian government to violate its legal obligations with regard to the acceptance and return of the criminals they forced into the United States!\"\nHis post was quickly followed by an AI-generated image showing the president in a fedora hat, alongside a sign reading FAFO, which usually stands for \"f*** around, find out\".\nIn a statement late on Sunday, Colombian foreign minister Luis Gilberto Murillo said: \"We have overcome the impasse with the US government.\"\nSunday's White House statement added that draft orders, imposing tariffs and sanctions on Colombia, would be \"held in reserve, and not signed, unless Colombia fails to honour this agreement\".\nThere was also a warning to other countries. \"Today's events make clear to the world that America is respected again. President Trump... expects all other nations of the world to fully cooperate in accepting the deportation of their citizens illegally present in the United States.\"\nBefore backing down, President Petro had demanded migrants deported by the US should be treated with dignity and respect.\n\"The US cannot treat Colombian migrants as criminals,\" Mr Petro wrote on X, noting that there were 15,660 Americans without proper immigration status in Colombia.\nPlease use Chrome browser for a more accessible video player\n\nColombia's decision to block military migrant flights follows a similar one byMexico, whichrefused a request to let a US military aircraft landwith migrants on Thursday.\nThere is growing discontent in South American countries as Mr Trump's week-old administration begins mass deportations.\n👉 Follow Trump 100 on your podcast app 👈\nOn Saturday, Brazil's foreign ministry condemned the \"degrading treatment\" of Brazilians after migrants were handcuffed on a commercial deportation flight.\nFollow our channel and never miss an update\nRead more from Sky News:Trump and Starmer 'agree to meet soon'Holocaust survivor 'jumped from death train'Rebels in DRC take key city\nBrazilian officials ordered the removal of the handcuffs when the plane landed and President Luiz Inacio Lula da Silva designated a Brazilian Air Force (FAB) flight to complete their journey, the government said in a statement on Saturday.\nUsing military aircraft to carry out deportation flights is a response to Mr Trump's national emergency declaration on immigration on Monday.\nAlthough US military aircraft have been used in emergencies like the US withdrawal from Afghanistan in 2021, this is the first time in recent memory they have been used to fly migrants out of the country, one US official said.\nMilitary aircraft carried out two similar flights, each with about 80 migrants, to Guatemala on Friday.\nBe the first to getBreaking News\nInstall the Sky News app for free"
    },
    {
        "title": "CIA believes lab leak most likely caused COVID outbreak",
        "description": "The CIA now believes the COVID-19 pandemic is \"more likely\" to have originated from a laboratory leak in China than from animals.",
        "url": "https://news.sky.com/story/cia-believes-lab-leak-most-likely-caused-covid-outbreak-13296912",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-covid-covid19_6173066.jpg?20230530113410",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-26 08:39:00",
        "Headline": "The US spy agency points the finger at China while acknowledging it has \"low confidence\" in its own conclusion, which is based on fresh analysis of intelligence about the spread of the virus.",
        "Content": "The US spy agency points the finger at China while acknowledging it has \"low confidence\" in its own conclusion, which is based on fresh analysis of intelligence about the spread of the virus.\nSunday 26 January 2025 09:43, UK\nThe CIA now believes the COVID-19 pandemic is \"more likely\" to have originated from a laboratory leak in China than from animals.\nIt follows the release of new analysis that began under the Biden administration at the request of formerCIAdirector William Burns.\nFor years, the CIA has said it is unclear whetherCOVID-19was the result of a lab incident or a natural origin.\nIts latest assessment points the finger atChinaeven while acknowledging it has \"low confidence\" in its own conclusion, noting in its statement both scenarios - lab and natural origin - remain plausible.\nThe findings are not based on new evidence, but fresh analysis of intelligence about the spread of the virus, its scientific properties and the work and conditions of China's virology labs.\n\"CIA continues to assess that both research-related and natural origin scenarios of the COVID-19 pandemic remain plausible,\" the agency said in a statement.\nThe report was declassified and released on Saturday on the orders of US President Donald Trump's choice to lead the US spy agency, John Ratcliffe, who was sworn in on Thursday as director.\nHe said one of his first priorities was getting his agency to make a public assessment on the pandemic's origins.\n\"That's a day-one thing for me,\" he told Breitbart News.\n\"I've been on record as you know in saying I think our intelligence, our science, and our common sense all really dictate that the origins of COVID was a leak at theWuhanInstitute of Virology.\"\nPrevious reports on the origins of coronavirus were split over whether it emerged from a Chinese lab, potentially by mistake, or whether it arose naturally.\nRead more from Sky News:Holocaust survivor 'jumped from death train'Trump plans to call Starmer within 24 hours\nFollow our channel and never miss an update.\nIn March 2021, a report by the World Health Organisation concluded the most likely origin for COVID-19 wastransmission from a bat to humansvia an unidentified intermediate animal species.\nThe possibility COVID-19 escaped from one of the virus laboratories in Wuhan - the initial epicentre - was deemed \"extremely unlikely\", although it was not completely ruled out.\nIt dismissed the theory that coronavirus was deliberately engineered or released by a lab.\nIn May 2023, a former top Chinese government scientist said thepossibility COVID-19 could have leaked from a Chinese lab should not be ruled out.\nChina's government says it supports and has taken part in research to determine the origin of the virus, and has accused Washington of politicising the matter.\nBeijing has said claims a laboratory leak likely caused the pandemic have no credibility.\nThe CIA said it will continue to evaluate any new information that could change its assessment."
    },
    {
        "title": "The enduring legacy of Churchill 60 years after his death - and why Trump sees him as an icon to emulate",
        "description": "Sir Winston Churchill died 60 years ago this week on 24 January 1965. His funeral took place on 30 January, following three days lying in state in the Palace of Westminster.",
        "url": "https://news.sky.com/story/the-enduring-legacy-of-churchill-60-years-after-his-death-and-why-trump-sees-him-as-an-icon-to-emulate-13295496",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-churchill-boulton_6809521.png?20250124180357",
        "type": "US",
        "Author": "Adam Boulton",
        "Date Published": "2025-01-26 00:01:00",
        "Headline": "As remarkable as the national and international reaction at the time of his death, is the phenomenon that Sir Winston Churchill endures as an iconic figure, more than half a century later.",
        "Content": "As remarkable as the national and international reaction at the time of his death, is the phenomenon that Sir Winston Churchill endures as an iconic figure, more than half a century later.\nSky News commentator@adamboultonTABB\nSunday 26 January 2025 04:38, UK\nSir Winston Churchill died 60 years ago this week on 24 January 1965. His funeral took place on 30 January, following three days lying in state in the Palace of Westminster.\nIt was the only occasion since the Second World War when a full state funeral was held for someone who was not a member of the Royal Family.\nChurchillwas venerated then as the prime minister who had led Great Britain to victory over Hitler and the Nazis. He has repeatedly topped surveys asking for the \"Greatest Briton\" since.\nIn 1965, many people who had lived through the war were still alive. The Royal Mint struck a 'Churchill Crown', with a nominal value of five shillings, to mark his life and death. Such commemorative issues were a rarity in the 1960s.\nThe funeral itself was an exceptional and grand event, involving thousands of troops from all branches of the armed services. It had been planned for at least 12 years, with its ailing subject taking an active interest.\nIts sombre splendour cemented Britain's reputation for ceremonial spectacle but afterwards, French President General Charles de Gaulle, who Churchill had grudgingly allowed to be invited, commented: \"Now Britain is no longer a great power.\"\nAs remarkable as the national and international reaction at the time of his death, is the phenomenon that Sir Winston Churchill endures as an iconic figure, more than half a century later.\nDonald Trump's comments on Gaza trigger tensions with his Arab-American supporters\nDay 8: Trump calls Starmer\nColombia quickly found out Trump has no intention of backing down\nYet another drama depicting Churchill is opening on stage in London. This time Roger Allam, Inspector Thursday in the EndeavourTV series, is playing the great man in Churchill in Moscow, following in the footsteps of other stars including Brian Cox, Albert Finney, Timothy Spall, Timothy West, Robert Hardy and Richard Burton.\nBust returned twice\nMeanwhile, with the inauguration of a new US president, the location of a bust of Sir Winston has once again become a hot topic, in Britain's right-wing media outlets at least.\n👉 Follow Trump 100 on your podcast app 👈\nDonald Trumphas re-instated the bronze by Sir Jacob Epstein in a prominent position in the Oval Office. It was originally a loan from the British Embassy to President George W Bush. Both Trump's immediate presidential predecessors, Barack Obama and Joe Biden,had it moved elsewherein the White House. Trump has now put it back twice.\nObama put a bust of Martin Luther King Junior in pride of place. Joe Biden favoured the Irish-American Bobby Kennedy. RFK senior that is, not his son RFK junior, the Kennedy family renegade now nominated as Trump's health secretary.\nThere has long been another identical copy of the Epstein bust in the presidential private quarters - a gift to Lyndon Johnson in 1965.\nChurchill's grandson, Nicholas Soames, a former Conservative MP who is now in the House of Lords, is unimpressed by all the fuss. He points out: \"It's loaned. I promise you, it's not a sign of the strength or otherwise of the special relationship, whether or not Churchill's head is in the White House.\"\nTrump's admiration for Churchill is more personal than anglophile. His glaring official photo portrait for this year's inauguration is almost a pastiche of Churchill's frequent \"we shall never surrender\" poses, just as some Trump posts on social media garble some of Churchill's most famous quotations. The Darkest Hour, featuring Gary Oldman as Churchill, is one of the films Trump has identified as his favourite movie.\nLeader comparisons\nThe president's closest allies like to draw comparisons between the two men. In 2020, when Trump muscled his way to St John's Church opposite the White House for a photo-op after it had been damaged by a firebomb, his official spokesman said it was \"a message of resilience and determination, like Churchill inspecting the bombing damage\", presumably of the Blitz.\nAfter visiting his father following this summer's deadly assassination attempt in Pennsylvania, Trump's son Eric likened him to Churchill due to his \"lack of political correctness\".\nTrump is not the only US president to emulate Churchill. Both Eisenhower and George W Bush tried their hand at painting, inspired in part by Churchill's skill with the brush.\nTrump is a great admirer of pageantry and may be disappointed that, at 24.6 million, the TV audience for his second inauguration did not match either Joe Biden's or Barack Obama's first.\nPart of the explanation may be increasing fragmentation of audiences by new media represented by the tech billionaires, who were invited to attend the ceremony in person by Trump.\nIn 1965 a similar number, 25 million, watched Churchill's funeral in the UK, an overwhelming mass audience in a much smaller country than the US. There were only two TV channels then and the ceremony was broadcast live by both the BBC and ITV.\nOn the BBC, it was the last state occasion anchored by Richard Dimbleby, the patriarch of the Dimbleby broadcasting family. There were large TV audiences in the US as well. The funeral was not shown live on RTE in Ireland. Neither the Irish president nor prime minister attended the ceremony.\nI was a small boy then and remember the coverage as one of the two great highlights of the black and white television era. The other was England's World Cup victory in 1966. Extended outside broadcast from multiple locations were a rarity. Both the funeral and the cup final took place during the day on a Saturday - a time when, back then, there was usually nothing to watch on TV sets.\nRare honour of state funeral\nThe funeral was a television spectacular involving foot soldiers and cavalry, RAF fly-bys and travel by boat, train, manpower and hearse. The ceremonies had been in planning since Churchill had his first major stroke in 1953.\nHe was serving his second term as prime minister and the poor state of his health was covered up from the public, even though he was left partially paralysed. Officials in the know, working for the royals and at Westminster, set to work to prepare Operation Hope Not.\nPutting the plan into action required a message from the Queen to parliament and a motion in parliament the day after Churchill died to authorise a state funeral.\nFull state funerals are usually reserved for heads of state. The late Queen Mother, Princess Diana, the late Duke of Edinburgh, and former prime minister Margaret Thatcher were all given ceremonial funerals in recent years - but none of these were state funeral in terms of scale or international protocol. Britain's next state funeral was for Elizabeth II in September 2022.\nChurchill's embalmed body lay in state round the clock in Westminster Hall for three days. More than 300,000 people filed past to pay their respects. Then the funeral began when Big Ben struck 9.45am. The bell was silenced for the day after that but there was a 90-gun salute in Hyde Park, a volley for each year of Churchill's life.\nFollow our channel and never miss an update\nAs soldiers and spectators lined the streets of London, Churchill's coffin was placed on a gun carriage and pulled by 98 sailors from the Royal Navy all the way to St Paul's Cathedral. It was carried inside with honorary pallbearers including three other British prime ministers and an Australian one. Clement Attlee, aged 82, stumbled on the steps and was given a chair to rest on.\nQueen broke with protocol\nAfter the service, the catafalque was drawn to the pier by Tower Bridge and taken upriver to Waterloo Station. Dockside cranes dipped as the boat passed. There is some dispute as to how voluntary this gesture by dockers really was. Even though his final journey was by locomotive down the Great Western Railway, Churchill insisted on going via Waterloo rather than Paddington station to make a point about British historical glory.\nHe was buried at St Martin's Church, Bladon, on the Blenheim estate, seat of the Duke of Marlborough, a cousin, alongside his parents and other members of the Spencer Churchill family.\nBe the first to getBreaking News\nInstall the Sky News app for free\nChurchill was the first prime minister of Queen Elizabeth's reign. Throughout the funeral day she broke with protocol to give him precedence. She hosted a reception for the dignitaries in attendance including the nine monarchs, 15 presidents and 14 serving prime ministers.\nIt is perhaps just as well that Donald Trump will not be around to see if his final obsequies beat that."
    },
    {
        "title": "Trump praises Starmer for doing 'very good job'",
        "description": "Donald Trump has said he thinks Sir Keir Starmer has \"done a very good job\" so far and said the pair will speak over the phone \"over the next 24 hours\".",
        "url": "https://news.sky.com/story/trump-praises-starmer-for-doing-very-good-job-so-far-and-plans-to-call-him-within-24-hours-13296872",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725095.jpg?20250126194358",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-01-26 03:13:00",
        "Headline": "The US president has said he and the prime minister \"get along well\" - adding it was despite the UK prime minister being \"liberal, which is a little bit different from me\".",
        "Content": "The US president has said he and the prime minister \"get along well\" - adding it was despite the UK prime minister being \"liberal, which is a little bit different from me\".\nNews reporter@samuelosborne93\nSunday 26 January 2025 07:08, UK\nDonald Trump has said he thinks Sir Keir Starmer has \"done a very good job\" so far and said the pair will speak over the phone \"over the next 24 hours\".\nTheUS presidentsaid he and the prime minister \"get along well\" despiteSir Keirbeing \"liberal, which is a little bit different from me\".\n\"But I think he's a very good person,\" Mr Trump said. \"I think he's done a very good job thus far.\n\"He's represented his country in terms of his philosophy. I may not agree with his philosophy but I have a very good relationship with him.\"\nSir Keir previously met Mr Trump for dinner at Trump Tower in New York in September, before he was elected president for a second time, and has held two pre-inauguration calls with him.\nMr Trump told reporters on Air Force One that his first international trip could be to the UK or Saudi Arabia - the first country he travelled to as president during his first term.\nThe US president said \"traditionally it could be UK\", but last time he travelled to Saudi Arabia because it agreed to buy billions of dollars of US merchandise.\n\"If that offer were right, I'd do that again,\" he said.\nMr Trump's warm remarks about Sir Keir were at odds with those of billionaireElon Musk, who has played a starring role in his second presidency so far, and has repeatedly called for the prime minister to be replaced.\nPlease use Chrome browser for a more accessible video player\n\nReversal of Biden's halt on 2,000lb bombs for Israel\nMr Trump also said he had instructed the US military to reverse an order from former president Joe Biden halting the supply of heavy 2,000lb bombs to Israel.\n\"They paid for them and they've been waiting for them for a long time,\" Mr Trump said about the munitions.\nMr Biden had paused delivery of the bombs to Israel over concerns about the impact they could have on civilians duringIsrael's war against Hamasin Gaza.\nRead more from Sky News:Why Trump sees Churchill as an icon to emulateMusk urges German far-right crowd to move beyond 'past guilt'Holocaust survivor describes his extraordinary escape\nFollow our channel and never miss an update.\nTrump says Egypt and Jordan should take more Palestinians from Gaza\nMr Trump also said Egypt and Jordan should take more Palestinians from Gaza and when asked if it was a temporary or long-term suggestion, he replied: \"Could be either.\"\nSpeaking of his call to Jordan's King Abdullah on Saturday, the president said: \"I said to him I'd love you to take on more because I'm looking at the whole Gaza Strip right now and it's a mess, it's a real mess. I'd like him to take people.\"\n\"I'd like Egypt to take people,\" he added, saying he would speak to Egyptian President Abdel Fattah al Sisi on Sunday.\n👉 Follow Trump 100 on your podcast app 👈\nHe said the Palestinian enclave was \"literally a demolition site, almost everything is demolished and people are dying there\", adding: \"So I'd rather get involved with some of the Arab nations and build housing at a different location where they can maybe live in peace for a change.\"\nBe the first to getBreaking News\nInstall the Sky News app for free\nPresident fires inspectors general at several agencies\nMr Trump also confirmed he had fired 17 independent inspectors general at several government agencies and said he would \"put good people in there that will be very good\".\nInspectors generally act as an independent check on mismanagement and abuse of power inside US government agencies, and while they are appointed by the president, they are expected to be nonpartisan and some serve presidents from both parties.\nIt comes after the US State Departmentordered a freeze on new fundingfor almost all American foreign development assistance following an executive order issued by Mr Trump."
    },
    {
        "title": "Chancellor's enthusiasm 'has never burned brighter' - but will her plans finally boost growth?",
        "description": "The chancellor spent most of her first six months issuing dire warnings about the calamitous state of the public finances she inherited.",
        "url": "https://news.sky.com/story/chancellors-enthusiasm-has-never-burned-brighter-but-will-her-plans-finally-boost-growth-13297273",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves_6810979.jpg?20250126093135",
        "type": "Business",
        "Author": "Amanda Akass",
        "Date Published": "2025-01-26 16:33:00",
        "Headline": "In a dramatic change of tone, Rachel Reeves is celebrating the UK's economic possibilities. Will her new zeal - and practical plans - finally bring growth?",
        "Content": "In a dramatic change of tone, Rachel Reeves is celebrating the UK's economic possibilities. Will her new zeal - and practical plans - finally bring growth?\nPolitical correspondent@amandaakass\nSunday 26 January 2025 17:53, UK\nPlease use Chrome browser for a more accessible video player\n\nThe chancellor spent most of her first six months issuing dire warnings about the calamitous state of the public finances she inherited.\nBut now, in a dramatic change of tone,Rachel Reevesis celebrating the UK's economic possibilities.\nInspired byDonald Trump'seconomic boosterism, and despite the UK's flatlining growth figures, she toldTrevor Phillipsshe's spent the past few days in Davos \"shouting on the world stage about everything our great country has to offer\".\n\"My enthusiasm and excitement... has never burned brighter.\"\nBut this optimistic message isn't just part of a new international sales pitch, a riposte to critics who believe the chancellor damaged investor confidence in the UK with her gloomy previous prognosis.\nInstead, it's part of the government's drive to reconnect with businesses bruised by her tax-raising budget - an attempt to demonstrate that economic growth genuinely is its number one priority - at the expense, perhaps, of all else.\nOf course, the chancellor argues that growth is needed to deliver the level of public services voters expect from aLabour government- without rapid improvements to the public finances, departments are likely to face austerity-level cuts.\nNow we're finally getting more detail on the practical strategy to deliver the growth that has proved so elusive for successive governments in recent years - but many of the measures involved are highly controversial.\nRead more:Reeves to seek billions from corporate pension surpluses\nFrom reducing planning hurdles to demanding regulators strip out red tape, in some ways, the Labour government is now seeking to enact many of the policies promised by Liz Truss.\nAsked about the comparison by Trevor Phillips this morning, Ms Reeves didn't deny the similarity, arguing only that \"we're doing practical things to get that growth, not just talking about it\".\nOn Wednesday in a big speech on growth, we'll hear more about these practical steps.\nThe biggest expected announcement is about thelong-awaited expansion of Heathrow Airport, as well as plans for Gatwick and Luton.\nAs a symbol of going for growth above all else, it couldn't get much bigger, but the reason the project has failed to get off the ground is that so many people object to it so passionately - for a wide range of reasons, from concern over emissions and our net zero commitments to noise pollution.\nMs Reeves told Trevor Philips today the decision would be taken with \"collective ministerial responsibility\".\nThat may be easier said than done.\nRead more from Sky News:Man, 19, arrested after female police officer hit by carReeves: 'No stone should be left unturned' in Southport inquiryMan, 53, charged with murder of university lecturer\nPreviously, many members of the cabinet, including Sir Keir Starmer, Environment Secretary Steve Reed and Energy Secretary Ed Miliband voted against expanding the west London airport.\nSupporting the plans will surely be uncomfortable for many on the Labour benches, especially with the Mayor of London so implacably opposed.\nAsked this week if he'd consider resigning over it, though, Mr Miliband responded: \"Don't be ridiculous, no.\"\nPlease use Chrome browser for a more accessible video player\n\nPerhaps the clearest indication of the government's economic focus comes with the chancellor's willingness todiscuss the possibility of joining a European customs grouping, the Pan Euro Mediterranean Convention.\n\"We are absolutely happy to look at these proposals,\" she told Trevor Phillips - quite a contrast to the non-committal answers given by other ministers earlier this week.\nThe Conservatives are predictably up in arms, with Andrew Griffiths, the shadow business secretary, quick to ring the Brexit alarm bell.\n\"We must avoid undoing Brexit by the back door by aligning with the EU's low growth model,\" he said.\nBe the first to getBreaking News\nInstall the Sky News app for free\nFollow our channel and never miss an update\nWhile the prime minister has long promised a \"reset\" in relations with the EU, any hint of backpedalling on Brexit is so politically sensitive that discussion about moving towards a closer economic relationship is always muted.\nThe fact Ms Reeves is even looking into this is perhaps, more than anything, a sign of their desire to show they're willing to consider all options.\nBut as with the airports, it's likely to be a very long time before any of these pro-growth intentions have a practical impact on GDP."
    },
    {
        "title": "Rachel Reeves 'absolutely happy' to look at joining EU customs group",
        "description": "The chancellor has said the government is \"absolutely happy\" to look at joining a pan-European customs area after the EU said it is open to British membership.",
        "url": "https://news.sky.com/story/rachel-reeves-absolutely-happy-to-look-at-joining-eu-customs-group-13296924",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-eu-flag-parliament_6810976.jpg?20250126093028",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-01-26 09:09:00",
        "Headline": "The EU's trade commissioner has said Brussels \"could consider\" allowing the UK into the Pan Euro Mediterranean Convention which makes it easier for members to trade with each other.",
        "Content": "The EU's trade commissioner has said Brussels \"could consider\" allowing the UK into the Pan Euro Mediterranean Convention which makes it easier for members to trade with each other.\nSunday 26 January 2025 14:17, UK\nPlease use Chrome browser for a more accessible video player\n\nThe chancellor has said the government is \"absolutely happy\" to look at joining a pan-European customs area after the EU said it is open to British membership.\nEarlier this week, EU trade commissioner Maros Sefcovic said Brussels \"could consider\" allowing the UK into the Pan Euro Mediterranean Convention (PEM) as part of a \"reset\" in discussions between the UK and the EU.\nChancellor Rachel Reeves toldSky News' Sunday Morning with Trevor Phillips: \"It was really interesting to see Maros Sefcovic this week suggest that the UK might be welcome in that Pan Euro Mediterranean customs framework.\n\"We are absolutely happy to look at those different proposals because we know the deal the previous government secured is not working well enough, not for small businesses trying to export, it's not working well enough for large businesses either.\n\"We're grown up enough to admit that, whereas the previous government said there were no problems at all.\"\nPolitics latest: Badenoch would back Heathrow third runway\nShe said they would look at \"constructive ideas\" but only if they adhere to the government's red lines set out in the manifesto.\nShadow foreign secretary and leading Brexiteer Dame Priti Patel accused Labour of trying to rejoin the EU \"through the back door\".\nIn reaction to Ms Reeves' comments, she posted on X: \"Labour are unpicking Brexit and will do anything to drag Britain back into the EU through the back door.\"\nMs Reeves' stance differs from that of EU relations minister Nick Thomas-Symonds who earlier in the week said: \"We don't currently have any plans to join PEM.\"\nHowever, Sir Keir Starmer's spokesman andBusiness Secretary Jonathan Reynolds did not rule out future membershipand said their red lines were that \"we will never join a single market, freedom of movement\".\nThe PEM was launched in 2012 and aims to make it easier for 25 countries, mostly in Europe and north Africa, to trade with each other through common rules by signing free trade agreements to reduce or lift tariffs on each other's goods.\nConservative shadow business secretary Andrew Griffith said joining the PEM \"is not the silver bullet to growth the government thinks it is\".\n\"Whenever Labour negotiates, Britain loses. So, we need to make sure they don't surrender important assets like our fishing rights,\" he added.\n\"We must avoid undoing Brexit by the back door by aligning with the EU's low growth model.\"\nNon-doms tax change\nMs Reeves said she is \"determined to be the chancellor that brings back growth to the UK economy\".\nShe also defended tweaking her October budget this week to allow non-doms more time to bring in money to the UK from overseas on a reduced tax basis after an exodus of millionaires from the UK.\nRead more:Reeves says 'no stone should be left unturned' in Southport inquiryTrump praises Starmer for doing 'very good job'\nShe made the announcement at the World Economic Forum in Davos and said she had listened to the concerns raised by the \"non-dom community\".\nThe chancellor defended the move toTrevor Phillips, saying it is \"not costing taxpayers a single penny\".\nShe added: \"We're getting rid of the concept of non-domicile in the tax system, so that if you make Britain your home, you pay your taxes here.\n\"But we also want to be a welcoming place.\"\nBe the first to getBreaking News\nInstall the Sky News app for free\nMs Reeves also argued changing the rules for non-doms was different to introducing inheritance tax for farmers as she said that will only affect a small number of farms.\nFarmers have said the government's analysis of how many farms will be affected is incorrect, but Ms Reeves stood by her statement."
    },
    {
        "title": "Donald Trump and Sir Keir Starmer speak on phone and 'agree to meet soon'",
        "description": "Sir Keir Starmer and Donald Trump \"stressed the importance of the close and warm ties\" between their countries and \"agreed to meet soon\" in a phone call, Downing Street has said.",
        "url": "https://news.sky.com/story/donald-trump-and-sir-keir-starmer-speak-on-phone-and-agree-to-meet-soon-13297436",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-01-26 19:41:00",
        "Headline": "Earlier this weekend, the US president praised Sir Keir, telling reporters he has \"done a very good job\" so far. In a call on Sunday, the pair \"stressed the importance of the close and warm ties\" between their countries.",
        "Content": "Earlier this weekend, the US president praised Sir Keir, telling reporters he has \"done a very good job\" so far. In a call on Sunday, the pair \"stressed the importance of the close and warm ties\" between their countries.\nSunday 26 January 2025 20:11, UK\nSir Keir Starmer and Donald Trump \"stressed the importance of the close and warm ties\" between their countries and \"agreed to meet soon\" in a phone call, Downing Street has said.\nDuring the conversation on Sunday, the prime minister congratulated thepresidenton his inauguration and paid tribute to his \"role in securing the landmark ceasefire and hostages deal inGaza\", according to a Number 10 spokesperson.\nThe two leaders \"discussed the importance of working together for security in the Middle East\" as well as \"trade and the economy\".\nSir Keirtold the US leader how he plans to deregulate the UK economy to boost growth, and the president spoke of his \"respect and affection for theRoyal Family\".\nMr Trump also gave his condolences to Sir Keir overthe loss of his brother, who died on Boxing Day.\nEarlier this weekend, the president said he thinks Sir Keir has\"done a very good job\" so far.\nRead more from Sky News:Holocaust survivor 'jumped from death train'At least 13 foreign peacekeepers killed in DRC\nHe and the prime minister \"get along well\" despite Sir Keir being \"liberal, which is a little bit different from me\", he told reporters travelling with him on Air Force One.\n\"He's represented his country in terms of his philosophy. I may not agree with his philosophy but I have a very good relationship with him.\"\nSir Keir previously met Mr Trump for dinner at Trump Tower in New York in September, before he was elected president for a second time.\nHe held two pre-inauguration calls with the new US president.\nBe the first to getBreaking News\nInstall the Sky News app for free\nFollow our channel and never miss an update\nMr Trump said his first international trip could be to the UK or Saudi Arabia - the first country he travelled to as president during his first term.\nHe said \"traditionally\" it could be the UK - but last time he travelled to Saudi Arabia because it agreed to buy billions of dollars of US merchandise.\n\"If that offer were right, I'd do that again,\" he said."
    },
    {
        "title": "Kemi Badenoch defends blaming 'peasants' from 'sub-communities' for grooming gangs abuse",
        "description": "Kemi Badenoch has defended blaming \"peasants\" from \"sub-communities\" in foreign countries for the grooming gangs crisis.",
        "url": "https://news.sky.com/story/kemi-badenoch-defends-blaming-peasants-from-sub-communities-for-grooming-gangs-abuse-13297189",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-kemi-badenoch-trevor-philips_6810950.jpg?20250126084424",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-01-26 15:31:00",
        "Headline": "The Conservative leader doubled down on her remarks about \"peasants\" from foreign countries being to blame for the grooming gangs scandal in an interview on Sunday Morning with Trevor Phillips.",
        "Content": "The Conservative leader doubled down on her remarks about \"peasants\" from foreign countries being to blame for the grooming gangs scandal in an interview on Sunday Morning with Trevor Phillips.\nSunday 26 January 2025 16:29, UK\nKemi Badenoch has defended blaming \"peasants\" from \"sub-communities\" in foreign countries for the grooming gangs crisis.\nSpeaking toSky News' Sunday Morning with Trevor Phillips, she insisted she would not be \"shy\" when talking about the scandal, which saw astring of child sexual exploitation convictionsof men mostly from Pakistani backgrounds.\nMs Badenoch told GB News last week there is a \"systematic pattern of behaviour not even just from one country, but from sub-communities\", adding: \"You know,people who are very, very poor, sort of peasant background.\"\nThe Conservative leader faced criticism for her words, with Downing Street saying it was not language Sir Keir Starmer would use.\nBut Ms Badenoch doubled down on her words, telling Trevor Phillips: \"The point I was making there was about a specific report on that community of people who are predominant in the rape gangs.\n\"They did come from a particular place where they were mostly peasant farmers, they were insular, even from the rest of Pakistan, they're not like the people in Lahore.\n\"And that's one of the things that I'm trying to fix. I hear a lot of people talk about Asian grooming gangs, about Pakistani grooming gangs, a lot of people are being blamed, a lot of innocent people who happen to share characteristics are being blamed, so let's be specific.\"\nPlease use Chrome browser for a more accessible video player\n\nSky News' analysis of thedata on the victims and perpetrators of child sexual abuseshows in terms of group-based offences, 85% of suspects are white, while 7% are Asian and 5% are black.\nThe ethnicity of perpetrators and victims was only recorded in 29% of cases so it is difficult to be too conclusive about over and under-representation. But there's enough evidence to rule out the idea that this is a problem unique to any one ethnic group.\nSir Keir and Ms Badenoch haveclashed repeatedly over her calls for a national inquiry, with the prime minister saying one has already happened, referencing Professor Alexis Jay's inquiry that took seven years and was published in 2022.\nRead more:Grooming gangs scandal - what happened?Badenoch would back Heathrow third runway\nBe the first to getBreaking News\nInstall the Sky News app for free\nKeep up with all the latest news from the UK and around the world by following Sky News\nMs Badenoch also told Trevor Phillips \"evil habits\" have been propagated from people who have come to the UK from a \"particular region and sub-community in Pakistan\".\n\"The [immigration] numbers we have seen over the last few decades mean that we are getting people having separate and insular communities.\n\"The most extreme example of this is what we saw with the rape gangs where people who've been coming to this country, from the 60s, from a particular region and sub-community in Pakistan, get here, stay insular, not interested in integration.\n\"And then you start seeing very very toxic, I would say evil habits propagating and no one doing anything about it because they're separate.\n\"We have to make sure that we have a dominant culture in our country, and the people who move here want to help make the UK a better place.\"\n\"Our country's not a hotel, it's not a dormitory, this is our home,\" she added."
    },
    {
        "title": "Chancellor's enthusiasm 'has never burned brighter' - but will her plans finally boost growth?",
        "description": "The chancellor spent most of her first six months issuing dire warnings about the calamitous state of the public finances she inherited.",
        "url": "https://news.sky.com/story/chancellors-enthusiasm-has-never-burned-brighter-but-will-her-plans-finally-boost-growth-13297273",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves_6810979.jpg?20250126093135",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-01-26 16:33:00",
        "Headline": "In a dramatic change of tone, Rachel Reeves is celebrating the UK's economic possibilities. Will her new zeal - and practical plans - finally bring growth?",
        "Content": "In a dramatic change of tone, Rachel Reeves is celebrating the UK's economic possibilities. Will her new zeal - and practical plans - finally bring growth?\nPolitical correspondent@amandaakass\nSunday 26 January 2025 17:53, UK\nPlease use Chrome browser for a more accessible video player\n\nThe chancellor spent most of her first six months issuing dire warnings about the calamitous state of the public finances she inherited.\nBut now, in a dramatic change of tone,Rachel Reevesis celebrating the UK's economic possibilities.\nInspired byDonald Trump'seconomic boosterism, and despite the UK's flatlining growth figures, she toldTrevor Phillipsshe's spent the past few days in Davos \"shouting on the world stage about everything our great country has to offer\".\n\"My enthusiasm and excitement... has never burned brighter.\"\nBut this optimistic message isn't just part of a new international sales pitch, a riposte to critics who believe the chancellor damaged investor confidence in the UK with her gloomy previous prognosis.\nInstead, it's part of the government's drive to reconnect with businesses bruised by her tax-raising budget - an attempt to demonstrate that economic growth genuinely is its number one priority - at the expense, perhaps, of all else.\nOf course, the chancellor argues that growth is needed to deliver the level of public services voters expect from aLabour government- without rapid improvements to the public finances, departments are likely to face austerity-level cuts.\nNow we're finally getting more detail on the practical strategy to deliver the growth that has proved so elusive for successive governments in recent years - but many of the measures involved are highly controversial.\nRead more:Reeves to seek billions from corporate pension surpluses\nFrom reducing planning hurdles to demanding regulators strip out red tape, in some ways, the Labour government is now seeking to enact many of the policies promised by Liz Truss.\nAsked about the comparison by Trevor Phillips this morning, Ms Reeves didn't deny the similarity, arguing only that \"we're doing practical things to get that growth, not just talking about it\".\nOn Wednesday in a big speech on growth, we'll hear more about these practical steps.\nThe biggest expected announcement is about thelong-awaited expansion of Heathrow Airport, as well as plans for Gatwick and Luton.\nAs a symbol of going for growth above all else, it couldn't get much bigger, but the reason the project has failed to get off the ground is that so many people object to it so passionately - for a wide range of reasons, from concern over emissions and our net zero commitments to noise pollution.\nMs Reeves told Trevor Philips today the decision would be taken with \"collective ministerial responsibility\".\nThat may be easier said than done.\nRead more from Sky News:Man, 19, arrested after female police officer hit by carReeves: 'No stone should be left unturned' in Southport inquiryMan, 53, charged with murder of university lecturer\nPreviously, many members of the cabinet, including Sir Keir Starmer, Environment Secretary Steve Reed and Energy Secretary Ed Miliband voted against expanding the west London airport.\nSupporting the plans will surely be uncomfortable for many on the Labour benches, especially with the Mayor of London so implacably opposed.\nAsked this week if he'd consider resigning over it, though, Mr Miliband responded: \"Don't be ridiculous, no.\"\nPlease use Chrome browser for a more accessible video player\n\nPerhaps the clearest indication of the government's economic focus comes with the chancellor's willingness todiscuss the possibility of joining a European customs grouping, the Pan Euro Mediterranean Convention.\n\"We are absolutely happy to look at these proposals,\" she told Trevor Phillips - quite a contrast to the non-committal answers given by other ministers earlier this week.\nThe Conservatives are predictably up in arms, with Andrew Griffiths, the shadow business secretary, quick to ring the Brexit alarm bell.\n\"We must avoid undoing Brexit by the back door by aligning with the EU's low growth model,\" he said.\nBe the first to getBreaking News\nInstall the Sky News app for free\nFollow our channel and never miss an update\nWhile the prime minister has long promised a \"reset\" in relations with the EU, any hint of backpedalling on Brexit is so politically sensitive that discussion about moving towards a closer economic relationship is always muted.\nThe fact Ms Reeves is even looking into this is perhaps, more than anything, a sign of their desire to show they're willing to consider all options.\nBut as with the airports, it's likely to be a very long time before any of these pro-growth intentions have a practical impact on GDP."
    },
    {
        "title": "Stricter checks for online knife purchases to be introduced",
        "description": "The government has confirmed retailers selling knives online will require ID to purchase and also on delivery.",
        "url": "https://news.sky.com/story/stricter-checks-for-online-knife-purchases-to-be-introduced-13296973",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rudakubana-knife-southport_6811032.jpg?20250126111224",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-26 10:40:00",
        "Headline": "Axel Rudakubana purchased the knife he used to kill three young girls and injure 10 other children and adults from Amazon.",
        "Content": "Axel Rudakubana purchased the knife he used to kill three young girls and injure 10 other children and adults from Amazon.\nPolitical reporter@alixculbertson\nSunday 26 January 2025 12:39, UK\nThe government has confirmed retailers selling knives online will require ID to purchase and also on delivery.\nAfter it emergedSouthport killerAxel Rudakubana bought the knife he used to kill three young girls from Amazon when he was just 17 years old, the government has brought forward planned changes to online knife sales.\nA person buying a knife online will now have to submit a copy of their photo ID, such as a driver's licence or passport, as well as proof of address, such as a utility bill.\nThey will then have to show ID again when the package is delivered.\nPolitics latest:Rachel Reeves 'absolutely happy' to look at joining EU customs group\nThe Home Office said online retailers could ask for buyers to submit a current photo or video of themselves alongside their ID. However, this will not be legally required.\nDelivery drivers will only be allowed to deliver a knife to the same person who purchased it.\nIt will also be illegal for delivery drivers to leave a package containing a bladed weapon on a doorstep when nobody is in to receive it.\nCurrently, the law requires sellers to operate an age verification system that is likely to prevent a person under 18 from buying a knife - but it does not stipulate the details of how those systems should be implemented.\nThe new requirements are set to be included in the Crime and Policing Bill, expected to be introduced to parliament by spring.\nFollowing Rudakubana'sunexpected guilty plea this week, Amazon said it had launched an investigation.\nThe child murderer circumvented Amazon's current checks, which include a name, address and birthdate being checked by credit checker Experian, by using encryption software to buy two chef's knives with 20cm blades.\nIt is understood one of Rudakubana's parents took in the parcel - addressed to him - with the Amazon delivery driver confirming they were over 25.\nBe the first to getBreaking News\nInstall the Sky News app for free\nThe world's largest online retailer said it takes its \"responsibility around the sale of all age-restricted items - including bladed products - extremely seriously\".\nCurrently, when purchasing a knife from Amazon the buyer has to enter their date of birth.\nThey are told: \"Valid photographic ID with a date of birth may also be required upon delivery.\n\"The driver will input your year of birth into their device and may then require an ID check to complete the age verification process.\"\nRead more:Reeves says 'no stone should be left unturned' in Southport inquiryTech companies 'risk another Southport', warns home secretary\nHome Secretary Yvette Cooper said: \"It's a total disgrace how easy it still is for children to get dangerous weapons online.\n\"More than two years after Ronan Kanda was killed with a ninja sword bought by a teenager online, too many retailers still don't have proper checks in place.\n\"It's too easy to put in false birth dates, parcels are too often being dropped off at a doorstop with no questions asked.\n\"We cannot go on like this. We need much stronger checks - before you buy, before it's delivered.\n\"The measures I am setting out today will be crucial in addressing this problem and are part of our Plan for Change and mission to make streets safer.\""
    },
    {
        "title": "Rachel Reeves says 'no stone should be left unturned' in Southport inquiry",
        "description": "Rachel Reeves has said \"no stone should be left unturned\" in the Southport inquiry to stop anything so \"appalling\" happening again.",
        "url": "https://news.sky.com/story/rachel-reeves-says-no-stone-should-be-left-unturned-in-southport-inquiry-13296906",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250124160214",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-01-26 08:22:00",
        "Headline": "The chancellor said the anti-terror Prevent programme needs to look at what it counts as terror as the Southport killer had no obvious ideology.",
        "Content": "The chancellor said the anti-terror Prevent programme needs to look at what it counts as terror as the Southport killer had no obvious ideology.\nSunday 26 January 2025 10:26, UK\nPlease use Chrome browser for a more accessible video player\n\nRachel Reeves has said \"no stone should be left unturned\" in the Southport inquiry to stop anything so \"appalling\" happening again.\nThe chancellor toldSky News' Sunday Morning with Trevor Phillipsthe inquiry announced this week into how Axel Rudakubana was able to murder three young girls and injure 10 others last summer was \"essential\".\n\"It is absolutely essential we learn lessons, not just to provide understanding for the families but to stop anything like this happening ever again,\" she said.\n\"No stone should be left unturned.\"\nRudakubana was jailed for lifewith a minimum of 52 years on Thursday after unexpectedly pleading guilty to murder on what was meant to be the first day of his trial.\nHe had been referred to the Prevent anti-terror programme three times, admitted to carrying a knife into school multiple times and attacked a boy at school with a hockey stick.\nMs Reeves added: \"It's appalling what happened in Southport and the evil, cowardly acts of that man.\n\"The impact will be felt forever by those families. And it's right that there's now a public inquiry to establish what on earth went wrong, that the man was referred three times to Prevent, he had been found carrying a knife on multiple occasions and he'd attacked a boy he was at school with.\n\"And yet he was able to slip through the system.\"\nShe said she thinks the inquiry needs to establish what Prevent regards as terror because Rudakubana had no apparent ideology, which is why he was taken off Prevent's list.\n\"Just because you don't have an ideological motive doesn't mean that you can't be a mass killer and incredibly dangerous,\" the chancellor added.\nRead more:The 14 minutes of terror that left three children dead\nMs Reeves defended Sir Keir Starmer and other ministers for not revealing Rudakubana's past last summer when the attack happened.\n\"I think it's really important that when a government speaks, when ministers speak about something before there's been a trial, that people are very careful about the words that they use,\" she said.\n\"Because if a government of any colour added anything to prejudice a trial, then that minister would never be forgiven. And so ministers do have to use words with caution.\"\nConservative leader Kemi Badenoch, who has two daughters a similar age to the three girls killed, welcomed the Southport inquiry and said the incident was \"horrific\".\nShe toldTrevor Phillipsit was \"extremely surprising that so many state bodies were involved at one point\".\n\"Why is it that despite all of these schemes and all of these programmes that we put in place, previous governments, successive previous governments of all parties, certain people still slipped through the cracks?\" she said.\nThe Tory leader added she thinks the government needs to look at the \"roots of where these behaviours come from, whether it is extremist ideology of whatever flavour, whether it's religious or related to hate of a particular group or sex\".\n\"We need to start looking more at how we bring more people into society, integrate them across a whole range of issues,\" she added."
    },
    {
        "title": "Trump praises Starmer for doing 'very good job'",
        "description": "Donald Trump has said he thinks Sir Keir Starmer has \"done a very good job\" so far and said the pair will speak over the phone \"over the next 24 hours\".",
        "url": "https://news.sky.com/story/trump-praises-starmer-for-doing-very-good-job-so-far-and-plans-to-call-him-within-24-hours-13296872",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725095.jpg?20250126194358",
        "type": "Politics",
        "Author": "Samuel Osborne",
        "Date Published": "2025-01-26 03:13:00",
        "Headline": "The US president has said he and the prime minister \"get along well\" - adding it was despite the UK prime minister being \"liberal, which is a little bit different from me\".",
        "Content": "The US president has said he and the prime minister \"get along well\" - adding it was despite the UK prime minister being \"liberal, which is a little bit different from me\".\nNews reporter@samuelosborne93\nSunday 26 January 2025 07:08, UK\nDonald Trump has said he thinks Sir Keir Starmer has \"done a very good job\" so far and said the pair will speak over the phone \"over the next 24 hours\".\nTheUS presidentsaid he and the prime minister \"get along well\" despiteSir Keirbeing \"liberal, which is a little bit different from me\".\n\"But I think he's a very good person,\" Mr Trump said. \"I think he's done a very good job thus far.\n\"He's represented his country in terms of his philosophy. I may not agree with his philosophy but I have a very good relationship with him.\"\nSir Keir previously met Mr Trump for dinner at Trump Tower in New York in September, before he was elected president for a second time, and has held two pre-inauguration calls with him.\nMr Trump told reporters on Air Force One that his first international trip could be to the UK or Saudi Arabia - the first country he travelled to as president during his first term.\nThe US president said \"traditionally it could be UK\", but last time he travelled to Saudi Arabia because it agreed to buy billions of dollars of US merchandise.\n\"If that offer were right, I'd do that again,\" he said.\nMr Trump's warm remarks about Sir Keir were at odds with those of billionaireElon Musk, who has played a starring role in his second presidency so far, and has repeatedly called for the prime minister to be replaced.\nPlease use Chrome browser for a more accessible video player\n\nReversal of Biden's halt on 2,000lb bombs for Israel\nMr Trump also said he had instructed the US military to reverse an order from former president Joe Biden halting the supply of heavy 2,000lb bombs to Israel.\n\"They paid for them and they've been waiting for them for a long time,\" Mr Trump said about the munitions.\nMr Biden had paused delivery of the bombs to Israel over concerns about the impact they could have on civilians duringIsrael's war against Hamasin Gaza.\nRead more from Sky News:Why Trump sees Churchill as an icon to emulateMusk urges German far-right crowd to move beyond 'past guilt'Holocaust survivor describes his extraordinary escape\nFollow our channel and never miss an update.\nTrump says Egypt and Jordan should take more Palestinians from Gaza\nMr Trump also said Egypt and Jordan should take more Palestinians from Gaza and when asked if it was a temporary or long-term suggestion, he replied: \"Could be either.\"\nSpeaking of his call to Jordan's King Abdullah on Saturday, the president said: \"I said to him I'd love you to take on more because I'm looking at the whole Gaza Strip right now and it's a mess, it's a real mess. I'd like him to take people.\"\n\"I'd like Egypt to take people,\" he added, saying he would speak to Egyptian President Abdel Fattah al Sisi on Sunday.\n👉 Follow Trump 100 on your podcast app 👈\nHe said the Palestinian enclave was \"literally a demolition site, almost everything is demolished and people are dying there\", adding: \"So I'd rather get involved with some of the Arab nations and build housing at a different location where they can maybe live in peace for a change.\"\nBe the first to getBreaking News\nInstall the Sky News app for free\nPresident fires inspectors general at several agencies\nMr Trump also confirmed he had fired 17 independent inspectors general at several government agencies and said he would \"put good people in there that will be very good\".\nInspectors generally act as an independent check on mismanagement and abuse of power inside US government agencies, and while they are appointed by the president, they are expected to be nonpartisan and some serve presidents from both parties.\nIt comes after the US State Departmentordered a freeze on new fundingfor almost all American foreign development assistance following an executive order issued by Mr Trump."
    },
    {
        "title": "CIA believes lab leak most likely caused COVID outbreak",
        "description": "The CIA now believes the COVID-19 pandemic is \"more likely\" to have originated from a laboratory leak in China than from animals.",
        "url": "https://news.sky.com/story/cia-believes-lab-leak-most-likely-caused-covid-outbreak-13296912",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-covid-covid19_6173066.jpg?20230530113410",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-26 08:39:00",
        "Headline": "The US spy agency points the finger at China while acknowledging it has \"low confidence\" in its own conclusion, which is based on fresh analysis of intelligence about the spread of the virus.",
        "Content": "The US spy agency points the finger at China while acknowledging it has \"low confidence\" in its own conclusion, which is based on fresh analysis of intelligence about the spread of the virus.\nSunday 26 January 2025 09:43, UK\nThe CIA now believes the COVID-19 pandemic is \"more likely\" to have originated from a laboratory leak in China than from animals.\nIt follows the release of new analysis that began under the Biden administration at the request of formerCIAdirector William Burns.\nFor years, the CIA has said it is unclear whetherCOVID-19was the result of a lab incident or a natural origin.\nIts latest assessment points the finger atChinaeven while acknowledging it has \"low confidence\" in its own conclusion, noting in its statement both scenarios - lab and natural origin - remain plausible.\nThe findings are not based on new evidence, but fresh analysis of intelligence about the spread of the virus, its scientific properties and the work and conditions of China's virology labs.\n\"CIA continues to assess that both research-related and natural origin scenarios of the COVID-19 pandemic remain plausible,\" the agency said in a statement.\nThe report was declassified and released on Saturday on the orders of US President Donald Trump's choice to lead the US spy agency, John Ratcliffe, who was sworn in on Thursday as director.\nHe said one of his first priorities was getting his agency to make a public assessment on the pandemic's origins.\n\"That's a day-one thing for me,\" he told Breitbart News.\n\"I've been on record as you know in saying I think our intelligence, our science, and our common sense all really dictate that the origins of COVID was a leak at theWuhanInstitute of Virology.\"\nPrevious reports on the origins of coronavirus were split over whether it emerged from a Chinese lab, potentially by mistake, or whether it arose naturally.\nRead more from Sky News:Holocaust survivor 'jumped from death train'Trump plans to call Starmer within 24 hours\nFollow our channel and never miss an update.\nIn March 2021, a report by the World Health Organisation concluded the most likely origin for COVID-19 wastransmission from a bat to humansvia an unidentified intermediate animal species.\nThe possibility COVID-19 escaped from one of the virus laboratories in Wuhan - the initial epicentre - was deemed \"extremely unlikely\", although it was not completely ruled out.\nIt dismissed the theory that coronavirus was deliberately engineered or released by a lab.\nIn May 2023, a former top Chinese government scientist said thepossibility COVID-19 could have leaked from a Chinese lab should not be ruled out.\nChina's government says it supports and has taken part in research to determine the origin of the virus, and has accused Washington of politicising the matter.\nBeijing has said claims a laboratory leak likely caused the pandemic have no credibility.\nThe CIA said it will continue to evaluate any new information that could change its assessment."
    },
    {
        "title": "Strictly star Wynne Evans apologises for 'inappropriate' language during tour launch",
        "description": "Strictly Come Dancing star Wynne Evans has apologised for an \"inappropriate and unacceptable\" remark he made to a woman during the show's live tour launch.",
        "url": "https://news.sky.com/story/strictly-star-wynne-evans-apologises-for-inappropriate-language-during-tour-launch-13296884",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wynne-evans-katya-jones_6810919.jpg?20250126051857",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-26 05:07:00",
        "Headline": "\"My language was inappropriate and unacceptable for which I sincerely apologise,\" said the 52-year-old Welsh opera singer - who is famous for his role in GoCompare insurance adverts.",
        "Content": "\"My language was inappropriate and unacceptable for which I sincerely apologise,\" said the 52-year-old Welsh opera singer - who is famous for his role in GoCompare insurance adverts.\nSunday 26 January 2025 05:43, UK\nStrictly Come Dancing star Wynne Evans has apologised for an \"inappropriate and unacceptable\" remark he made to a woman during the show's live tour launch.\nThe 52-year-old Welsh opera singer - who is famous for his role in GoCompare insurance adverts - has been touring with the live show after competing with professional dance partner Katya Jones last year.\nHe was heard making the remark to a woman in a video filmed during the launch event on 16 January,the Mail On Sunday reported.\n\"My language was inappropriate and unacceptable for which I sincerely apologise,\" Evans said in a statement.\nA spokesperson for theStrictlylive tour and BBC Studios said: \"We were not previously aware of the remark and did not receive any complaints.\n\"We have made it very clear to Wynne that we do not tolerate such behaviour on the tour.\"\nBe the first to getBreaking News\nInstall the Sky News app for free\nEvans missed dancing on the tour in Glasgow on Saturday due to an ankle injury and shared images of his bruised ankle in an Instagram story.\n\"Ankle's getting a bit better, it was great to be able to sing in Glasgow tonight, even if I couldn't dance, hopefully back tomorrow,\" he said.\n\"But watch this space, I'll let you know in the morning. See how the swelling goes down, and all that kind of stuff, thanks for all the lovely messages, amazing.\"\nRead more from Sky News:Holly Willoughby tells of 'tough' year after murder plotTrump praises Starmer for doing 'very good job' so farMusk urges German far-right crowd to move beyond 'past guilt'\nPlease use Chrome browser for a more accessible video player\n\nApology over 'joke'\nIn October, Evans and Jonesapologised for a \"joke\"which saw her move Evans' hand from her waist during the show.\nJones also appeared not to want to high-five her celebrity partner, which they called \"a running joke\".\nFollow our channel and never miss an update.\nIt comes after Strictly introduced chaperones \"at all times\" during rehearsals following several accusations of bullying on the show."
    },
    {
        "title": "Director Joe Wright on 'global problem' of fascism and what can be learnt from 'deeply flawed' Mussolini",
        "description": "British director Joe Wright has said fascism is a \"global problem\" and there is a sense of the ideology \"within us all\".",
        "url": "https://news.sky.com/story/director-joe-wright-on-global-problem-of-fascism-and-what-can-be-learnt-from-deeply-flawed-mussolini-13297009",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-joe-wright-director_6811123.jpg?20250126133650",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-26 12:12:00",
        "Headline": "Speaking ahead of the launch of his new eight-part series, Mussolini: Son Of The Century, Joe Wright said for a long time he didn't understand what fascism really was. ",
        "Content": "Speaking ahead of the launch of his new eight-part series, Mussolini: Son Of The Century, Joe Wright said for a long time he didn't understand what fascism really was.\nMonday 27 January 2025 08:59, UK\nBritish director Joe Wright has said fascism is a \"global problem\" and there is a sense of the ideology \"within us all\".\nWright, who is best known for films including Darkest Hour and Atonement, described fascism as the \"politicisation of toxic masculinity\" which he said \"exists everywhere\".\nSpeaking to Sky News' Barbara Serra ahead of the launch of his new eight-part series, Mussolini: Son Of The Century - which documents the rise of the Italian dictator - Wright said he was interested in delving into history as he didn't fully understand the meaning of fascism.\n\"Growing up in the 80s, the word fascist was bandied about and was used against any authoritarian figure, but I don't think I really understood what it meant,\" he said.\n\"Then with the spread of the far right across the world recently, I felt it was my responsibility to really understand what the word really meant and where it came from.\"\nFascism, by dictionary definition, is an \"extreme right-wing, authoritarian, system of government that holds intolerant views or practices\".\nThe term was first used by members of Benito Mussolini's movement, the Fasci Italiani organisation, which transitioned into the National Fascist Party and largely inspired the international spread of fascist movements during the interwar period.\nWhen asked if concepts of fascism are still misunderstood today, Wright replied: \"I can only talk personally, but I really didn't understand what the word meant, and I do think we are seeing a resurgence, if not of fascism but certainly of popularism and far right populism.\"\nMussolini: Son Of The Century follows the story of the dictator from founding the Fasci Italiani organisation after the First World War to his infamous speech in parliament following the murder of socialist Giacomo Matteotti in 1925.\nStarring award-winning actor Luca Marinelli as Mussolini, the series is an adaptation of Italian author Antonio Scurati's best-selling drama of the same name, M. Son of the Century.\nWhen asked what is behind the popularity of his novels on the dictator, Mr Scurati told Sky News: \"Probably because the story is told from [Mussolini's] side.\n\"I am an anti-fascist, but I believe in order to understand deeply what fascism has been in my country and elsewhere, it is necessary to look deeply at the fascist inside us.\n\"That's how I conceived my novels, in the same way Wright brilliantly brought the idea into this documentary.\"\nHe said that he believes many elements of fascism still live on, with the defining feature being when \"fear prevails over the hope of democracy\".\nHe added: \"Mussolini was the master of politics of fear. He came from the Socialist Party, which was party of hope, and he was kicked out. Then he bet everything on fear, and that can happen again.\"\nRead more from Sky News:Strictly star apologises for 'inappropriate' languageCampaigners call for NDA law changes\nFollow our channel and never miss an update\nWright added that he understood the fascist history of Italy is a \"very contentious and emotional issue\" for a lot of people, but agreed with Mr Scurati that he thinks there is a \"sense of fascism within all of us\".\n\"What I discovered was that fascism is a politicisation of toxic masculinity and that exists everywhere, global responsibility and global problem,\" he said.\nAsked how he would describe the Mussolini he had created for the series, the director said: \"A deeply flawed human being.\"\nMussolini: Son Of The Century will debut on 4 February exclusively on Sky Atlantic and stream on NOW in the UK."
    },
    {
        "title": "Campaigners call for NDA law changes as agreements remain 'rife' in entertainment",
        "description": "A former assistant to Harvey Weinstein has accused parliament of being too \"slow to act\" on the misuse of non-disclosure agreements (NDAs) &#8211; saying there has been \"a clear trail\" of their use at the root of \"every scandal of abuse\". ",
        "url": "https://news.sky.com/story/campaigners-call-for-nda-law-changes-as-agreements-remain-rife-in-entertainment-13295654",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-zelda-perkins-weinstein_6809445.jpg?20250124163706",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-01-26 00:01:00",
        "Headline": "Zelda Perkins was the first woman to break a Weinstein-related NDA - an action which helped expose the Miramax movie producer's predatory behaviour. Now, she's calling for the government to change laws surrounding the agreements.",
        "Content": "Zelda Perkins was the first woman to break a Weinstein-related NDA - an action which helped expose the Miramax movie producer's predatory behaviour. Now, she's calling for the government to change laws surrounding the agreements.\nArts and entertainment correspondent\nSunday 26 January 2025 08:48, UK\nA former assistant to Harvey Weinstein has accused parliament of being too \"slow to act\" on the misuse of non-disclosure agreements (NDAs) – saying there has been \"a clear trail\" of their use at the root of \"every scandal of abuse\".\nIn 2017, Zelda Perkins was the first woman to break a Weinstein-related NDA signed decades earlier, an action which helped exposethe Miramax movie producer's predatory behaviour to the world.\nSince then, through her organisation Can't Buy My Silence, she's been a vocal campaigner to try to get changes to the law.\nExplaining her frustrations in an interview with Sky News, she said: \"Since Weinstein's horrific behaviour was exposed nearly seven years ago we have seen other powerful abusers exposed on a monthly basis… there is a clear trail of the use of NDAs at the root of every scandal of abuse.\n\"International law is changing fast but the UK is being slow to act, which is especially frustrating to me as this is where the first exposure of the systemic use of NDAs to protect the powerful was highlighted.\"\nAn NDA is a legally binding contract that protects confidential information between parties. While they were conceived to protect Intellectual Property (IP) and can have a legitimate place in the world of business to protect client confidentiality, their misuse made headlines once again this year when hundreds of women came forward to make claims that NDAs had been used to silence victims of the late Harrods boss Mohamed al Fayed.\nMs Perkins argues there's indisputable evidence that legal changes are needed.\nStrictly star Wynne Evans apologises for 'inappropriate' language during tour launch\nDirector Joe Wright on 'global problem' of fascism and what can be learnt from 'deeply flawed' Mussolini\nHolly Willoughby tells of 'tough' year\n\"We have the law to protect us from ourselves and, if the law is being misused as a tool of abuse, then we have a duty to change that.\"\nShe believes changes haven't happened yet because there is \"an enormous amount of fear in the halls of power about taking away the ability to silence people who are going to show up your wrongdoing.\"\nWhile Ireland, Canada and the US have all introduced legislative changes, the UK hasn't prioritised amending its law - but could that be about to change?\nThe government has said it intends to implement the Conservative plan to ban NDA use in universities, and its understood to be considering how to ban their misuse by employers more widely.\nAt a recent select committee hearing, workers' rights minister Justin Madders confirmed the government is \"looking closely\" at whether changes could be made via its landmark employment rights bill - pitched by Number 10 as \"the biggest upgrade to workers' rights in a generation\".\nIn a statement, the government promised to \"set out its position on any amendments...in parliament\".\nFollow our channel and never miss an update\nFor years, Ms Perkins has campaigned for NDAs to only be used for their intended purpose - to protect IP and trade secrets - and argues they should only be able to be requested by a victim with certain provisions in a settlement agreement.\nWhile Ms Perkins' experience was in the world of film, a number of leading music industry voices have spoken to Sky News about the problematic way in which they feel NDAs are being used.\nCharisse Beaumont, the chief executive at Black Lives in Music, claims the agreements \"are used to cover up criminal criminality in its extreme nature… exploiting the music, bullying and blackmailing… it's rife\".\nShe says: \"You've got high-profile cases… cases of individuals who have numerous cases in court, numerous testimonies of people saying they've been abused by them, yet they're still able to work. Some of them are still being promoted.\n\"Can you imagine being a victim and watching the person who did something to you be promoted?\"\nSean 'Diddy' Combs - who awaits trial for sex trafficking and racketeering, which he strenuously denies - was at the height of his fame in the noughties.\nA former music video dancer from back then has told Sky News the use of NDAs within music was always widespread.\nElisabeth Ovesen said she would \"come dressed ready for a party, get to the door, and there's an NDA before you can step in\".\nBe the first to getBreaking News\nInstall the Sky News app for free\nFormer reality star Katie Waissel has left the music industry behind to study law. She now campaigns against the use of NDAs.\n\"I've had many conversations with former secretaries of state, the DCMS [Departure for Culture, Media and Sport], for example, the former home secretary, alongside many, many other amazing people being campaigning for legislative change.\n\"I understand nondisclosure agreements in terms of protecting trade, like a formula for haircare or something else like that. But for the music industry, and it being so one-sided for this company, it begs me to ask the question - why so secretive? What are you trying to hide? What are you trying to cover up?\""
    }
]