[
    {
        "title": "'Public face' of Trump's Minneapolis crackdown set to leave city - as president's tone shifts",
        "description": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News.",
        "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gregory-bovino-border-patrol_7146710.jpg?20260126205126",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 23:37:00",
        "Headline": "There has been a change in tone from the White House regarding the situation in Minneapolis amid mounting public backlash, including from Donald Trump himself.",
        "Content": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News. Gregory Bovino and some of his immigration enforcement agents are set to depart on Tuesday, a White House official and another government figure familiar with the decision said. Latest updates from Minneapolis It follows widespread backlash among the American public, leading Democrats, and a growing number of Republicans over the fatal shooting of Alex Pretti on Saturday - and the response to it. The 37-year-old nurse, a US citizen, was shot dead in an altercation with ICE agents - the second such incident in the city this month, following the death of Renee Good. Top officials including Mr Bovino, Homeland security secretary Kristi Noem, and Trump adviser Stephen Miller tried to paint Mr Pretti as a threat to the agents, prompting a furious response from his family. Ms Noem has claimed he approached officers with a handgun and acted violently towards them, but several pieces of footage analysed by Sky News counters that narrative: 'Border tsar' could take over operation The removal of Mr Bovino from Minneapolis would be a \"major step\", Sky's US correspondent Martha Kelner said. He has become the \"public face\" of Donald Trump's immigration crackdown, she added. The president's \"border tsar\", Tom Homan, is set to arrive in the city shortly, according to White House press secretary Karoline Leavitt, who said he was \"doing an exceptional job\". Trump touts calls with senior Democrats There has been a marked change in tone from the White House regarding Minneapolis amid the public backlash, including from the president himself. NBC reports, citing administration officials, that Mr Trump is \"concerned\" about the sustainability of the operation. \"The visuals were not playing well. He understands TV. … He saw it for himself,\" said a Republican lawmaker who was granted anonymity to speak candidly. Mr Trump is to meet the city's mayor, Jacob Frey, on Tuesday. \"I just had a very good telephone conversation with Mayor Jacob Frey, of Minneapolis,\" he said on Truth Social. \"Lots of progress is being made!\" Mr Trump made similarly positive noises about an earlier conversation with Minnesota Governor Tim Walz, another Democrat who has called for ICE to leave Minneapolis. \"It was a very good call, and we, actually, seemed to be on a similar wavelength,\" the president said. Read more from Sky News:Minnesota isn't Belfast but the warning signs are there Among the senior Republicans to call for a change in approach are Senator Ted Cruz, who said on his podcast: \"I would encourage the administration to be more measured.\" The scenes in Minneapolis have also been condemned by former Trump ally Marjorie Taylor Greene, who split with the president over his handling of the Epstein files. Officials who spoke to NBC insisted Mr Trump remained committed to cracking down on immigration and fraud."
    },
    {
        "title": "Farage says the right is uniting. The reality is very different",
        "description": "Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really?",
        "url": "https://news.sky.com/story/is-the-right-really-uniting-hardly-it-is-more-divided-than-ever-13499394",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-suella-braverman-reform_7146261.jpg?20260126181701",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2026-01-26 20:55:00",
        "Headline": "The Tories even reacted to the former home secretary's walkout by claiming 'the Conservatives did all we could to look after Suella's mental health'.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really? Mr Farage's introduction was then followed by 25 minutes of his latest Tory defector trashing her old party in the most vitriolic attack of any of Reform UK's new recruits. Braverman's defection - read the latest The defections of Nadhim Zahawi, Robert Jenrick, Andrew Rosindell and now Ms Braverman have been greeted by their old party with more bile than any previous defections. The Tories even reacted to the former home secretary's walkout by claiming: \"The Conservatives did all we could to look after Suella's mental health, but she was clearly very unhappy.\" Mental health? Below the belt, surely? Some senior Conservatives were appalled and a few hours later the party issued a \"correction\" with the offending - and offensive - sentence removed. In his opening remarks, Mr Farage called the mental health slur \"pretty abusive\", claiming: \"We won't lower ourselves to their level.\" Ms Braverman's tirade against her old party may not have been below the belt. But it was pretty near the knuckle. She used the word \"betrayal\" several times. On the refusal to ban \"hate marches\", she said: \"The Conservative Party should be disgusted with itself, frankly.\" She went on: \"I was vilified and called Islamophobic by my own Conservative Party colleagues. Another great betrayal.\" She attacked Kemi Badenoch personally. \"The leader herself said I was having a nervous breakdown, something she seems to have repeated again today.\" Ms Braverman said she had been \"politically homeless\" for two years and \"ashamed of the Conservative Party\". Theresa May \"messed up Brexit\", she claimed. The Tories had a \"largely Lib Dem socialist-lite agenda\", a \"woke ideology\" and were a \"social democrat left-leaning party\", she said. And yet she claimed: \"I don't leave the Conservative party with malice or anger or bitterness. That passed a long time ago.\" Yet this was indeed a malicious, angry and bitter attack. She told Sky News' own Amanda Akass: \"It's a very toxic environment. There's a witch-hunt.\" An hour earlier in the Commons, as the Tories gloated over the near-collapse of the Chagos handover, the veteran MP Sir Julian Lewis claimed: \"The reason this bill may not go through is the work of the Conservative opposition in both Houses of Parliament and the words of the leader of the Reform party in Mr Trump's ear. Read more from Sky News:UK loses measles elimination statusAt least 15 dead and hundreds rescued after ferry sinks \"Does that not show what can be achieved when two parties make common cause in a very worthwhile aim to achieve a vital objective?\" Perhaps. But it's a very rare common cause. Labour, delighted that Tory turmoil was once again overshadowing Labour civil war, claimed Mr Farage is \"stuffing his party full of a band of failed Tories\". And it's certainly beginning to look a bit like that. And is the right really uniting, as Mr Farage claimed? Hardly. Certainly not on the evidence of Suella Braverman's brutal attack on her old party and the Conservatives' response."
    },
    {
        "title": "Lung cancer: 'Trailblazing' NHS scheme hailed as a 'glimpse of the future'",
        "description": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\". ",
        "url": "https://news.sky.com/story/lung-cancer-trailblazing-nhs-scheme-hailed-as-a-glimpse-of-the-future-13499296",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lung-cancer-health_7146564.jpg?20260126173959",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 16:14:00",
        "Headline": "Under the pilot scheme, AI software will be used to analyse lung scans and flag suspicious spots, before a robotic catheter takes precise biopsies, which are then checked in a lab to diagnose or rule out cancer.",
        "Content": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\".  It comes alongside NHS plans to expand lung cancer screening, with all eligible people invited for their first check by 2030. Alongside the expansion, AI software will be used to analyse patients' lung scans and flag suspicious spots, known as nodules. A robotic catheter - a thin tube inserted into the patient via the throat - is used to take precise biopsies directly from the nodule, which are then checked in a lab to diagnose or rule out cancer. The robotic system can reach spots as small as six millimetres, which are often hidden deep in the lung and can be missed at screening. It's harder for doctors to reach such nodules to take biopsies, meaning patients must wait for further scans to see if they grow. Specialists at Guy's and St Thomas' NHS Foundation Trust have already used robotic biopsies on 300 patients, with some 215 of them going on to have cancer treatment. The new pilot will involve a further 250 patients, and it's hoped other trusts will start performing the procedure. Read more from Sky News:King's 'good news' on cancer Lung cancer is the third most common cancer in the UK, with more than 49,000 new diagnoses and around 33,000 deaths every year. Since 2019, more than 1.5 million people in England between the ages of 55 and 74 who have ever smoked have been invited to have their lung health checked, NHS England said, and a further 1.4 million people will be contacted next year alone. Professor Peter Johnson, NHS England's national clinical director for cancer, said screening means more cases are being picked up at an early stage than ever, and the new pilot will support even \"faster, more accurate biopsies\". \"This is a glimpse of the future of cancer detection,\" he said. Health Secretary Wes Streeting underwent robotic surgery when being treated for kidney cancer and said the NHS treatment \"saved my life\". He said the pilot will help catch the illness earlier, \"replacing weeks of invasive testing with a single targeted procedure\"."
    },
    {
        "title": "Suella Braverman defects to Reform UK - and hits out at Tory 'mental health' briefing",
        "description": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK.",
        "url": "https://news.sky.com/story/former-home-secretary-suella-braverman-defects-to-reform-uk-13499184",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-braverman-farage-reform-uk_7146729.jpg?20260126212100",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 12:16:00",
        "Headline": "The latest senior Conservative figure to link up with Nigel Farage had strong words for her \"bitter\" former party.",
        "Content": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK. The former home secretary has been unveiled by Nigel Farage as another high-profile catch at an event launching Veterans for Reform. Ms Braverman, who served in government under prime ministers Theresa May, Boris Johnson, Liz Truss, and Rishi Sunak, announced that she had resigned the Conservative whip to huge cheers from the veterans gathered for the event. Politics latest - follow live \"I feel like I've come home,\" she said. \"Because I believe that a better future is possible for us, I am joining Reform UK.\" Braverman also responded after a Conservative statement, which the party said had been \"sent out in error\", made references to her \"mental health\". Echoing earlier comments from Mr Farage, she said: \"Those attacks say more about them, than they do about me.\" \n                  Jenrick joins Reform – is it a boost for Nigel Farage or Kemi Badenoch?\n                 \n                  Badenoch turned a crisis into an opportunity - but her Reform problems aren't over\n                 \n                  How Reform could offer ever-ambitious Nadhim Zahawi a new route to the top\n                 She added: \"It is a bit pathetic. I am afraid it's more sorry signs of a bitter and desperate party that is in free fall.\" Why did Suella Braverman switch to Reform UK? Asked why she made decided to switch now, Ms Braverman said: \"I've been thinking about it for some time. \"I've been politically homeless for the best part of two years. I have not had confidence in the Conservative Party, really, but I have tried to see whether it might change, try to give it some time and its events over the last few days reach really, which have tipped me over the line.\" Ms Braverman served in the Home Office at the same time as Robert Jenrick, who defected to the party on 15 January. She is the party's eighth MP. Explaining her decision, Ms Braverman said: \"Loyalty demands honesty, and honesty compels me to say this: today Britain is indeed broken. She is suffering. She is not well. \"Immigration is out of control. Our public services are on their knees. People don't feel safe. \"Our youngsters are leaving the country for better futures elsewhere. We can't even defend ourselves and our nation stands weak and humiliated on the world stage. \"So we stand at a crossroads. We can either continue down this route of managed decline to weakness and surrender. Or we can fix our country, reclaim our power, rediscover our strength. I believe that a better Britain is possible.\" She pointed to her calls to leave the European Court of Human Rights (ECHR) while in government, and accused the Tories of having \"utterly failed to do the right thing for the British people\". Suella Braverman rose to the top echelons of the Conservative Party over a career that spanned almost 11 years.  But now the former home secretary has decided to swap her navy blue for teal, by defecting to Nigel Farage's Reform UK. The 45-year-old is a qualified barrister and served in government under successive Conservative PMs including Theresa May, Boris Johnson, Liz Truss, and finally Rishi Sunak. She was elected to parliament as the MP for the Hampshire seat of Fareham (now Fareham and Waterlooville) in 2015 - a year before the Brexit vote. A vocal Eurosceptic, she rose up the anti-EU faction of the party, ultimately chairing the European Research Group, and ran to be the party's leader before being knocked out in the second round. She served as attorney general in Boris Johnson's government, and, after throwing her weight behind the short-lived premiership of Truss, Braverman was given the plum job of home secretary. She resigned from the role after breaching the ministerial code by using a personal address for confidential emails.  But six days later, Sunak put her back in the top job - only for her to lose the role again after a series of stridently right-wing comments.  She was a major driver of policies such as the Rwanda plan and the Bibby Stockholm barge used to house migrants during her tenure. Since her dismissal, Braverman has been on the backbenches, but made supportive noises for Nigel Farage and attended Donald Trump's second inauguration last year - where she was seen wearing a MAGA cap. She said her former party had \"great speeches, good slogans... but when the cameras are off, when the doors are shut, and when they're sat behind that table making difficult decisions for the country, they fold\". She added: \"When push comes to shove, they go AWOL. No courage, no backbone, no resolve.\" Ms Braverman also hit out at the current Tory party, saying its commitment to leave the ECHR is a lie. She added: \"I'm calling time on Tory lies. I'm calling time on a party that keeps making promises with zero intention of keeping them.\" Championing Reform, Ms Braverman said: \"There is only one man in British politics who has been courageously consistent for his country, and that man is Nigel Farage. \"He's not backed down in the face of vicious onslaughts, vicious vitriol, and backlash. Nigel Farage is right and the British people are backing him.\" Ms Braverman concluded her speech by saying it is \"the honour of my life\" to defect to Reform. Reform UK 'stuffed full of failed Tories responsible for chaos' The Conservatives have hit back, saying it was \"always a matter of when, not if, Suella would defect\" and suggesting she has changed sides because of \"personal ambition\", citing her unsuccessful run to be leader. In a barbed response, the Tories added that they \"did all we could to look after Suella's mental health, but she was clearly very unhappy\". The spokesperson continued: \"Reform are too busy opposing the Conservatives to hold the Labour government to account.\" For their own part, Labour has accused Mr Farage of \"stuffing his party full of the failed Tories responsible for chaos and decline that held Britain back for 14 years\". Anna Turley, Labour's chairwoman, added: \"Suella Braverman helped botch Brexit and got sacked as home secretary - her defection shows Farage is willing to accept the very worst of the Conservative Party and exposes his complete lack of judgement.\" Meanwhile, the Liberal Democrats accused Ms Braverman of having \"selective amnesia\" and of forgetting she \"helped break\" Britain. Deputy leader Daisy Cooper said: \"Suella Braverman was so bad she was forced to resign from Liz Truss's cabinet and got sacked by Rishi Sunak.\""
    },
    {
        "title": "Remains of last Israeli hostage found in Gaza",
        "description": "The remains of the last Israeli hostage in Gaza have been found.",
        "url": "https://news.sky.com/story/remains-of-last-israeli-hostage-found-in-gaza-13499223",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ran-gvili-kibbutz-alumim_7113279.jpg?20260126135525",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 13:43:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu called it \"an incredible achievement\" and said: \"I promised we would bring everyone home and we have brought everyone home.\"",
        "Content": "The remains of the last Israeli hostage in Gaza have been found. The Israel Defence Forces (IDF) said in a statement it had retrieved the body of police officer Ran Gvili and that his family had been informed. Identification of the remains was confirmed by the National Institute of Forensic Medicine, in cooperation with the Israeli police, and the military rabbinate, the IDF said. Mr Gvili, 24, was a sergeant first class in the Israeli police special forces, who was killed at the Alumim kibbutz during the October 7 attacks in 2023, before his body was taken to Gaza. The announcement that his remains had been found and identified came a day after Israel's government said the military was conducting a \"large-scale operation\" in a northern Gaza cemetery to locate them. The discovery of his remains marks the return of the last ​remaining hostage held in Gaza, fulfilling a key condition of the ​first phase of Donald Trump's peace plan. Mr Gvili's family had urged Israeli Prime Minister Benjamin Netanyahu not to enter the second phase of the plan until his remains were recovered. \n                  Israel says Rafah crossing will have 'limited' reopening after hostage search\n                 \n                  Is the Board of Peace a Trump-led sham?\n                 \n                  Trump's new gang shouldn't be underestimated - and could add more powerful friends\n                 Now Mr Netanyahu has hailed the return of Mr Gvili as \"an incredible achievement\", adding that \"I promised we would bring everyone home and we have brought everyone home\". Hamas, the Palestinian militant group that has governed Gaza, emphasised its compliance with the peace deal. Spokesperson Hazem Qassem said: \"The discovery of the body of the last Israeli prisoner in Gaza confirms Hamas's commitment to all the requirements of the ceasefire agreement on the Gaza Strip, including the prisoner exchange process and its complete closure as stipulated in the agreement. \"The movement will continue to adhere to all aspects of the agreement, including facilitating the work of the National Committee for the Administration of Gaza and ensuring its success. \"We call on the mediators and the United States to compel the occupation to cease its violations of the agreement and implement its required obligations.\" Ahead of the discovery, an Israeli military official revealed there were \"several intelligence leads\" regarding the possible location of the police officer's remains. A \"targeted operation\" was under way in northern Gaza, they added. Mr Netanyahu's office said on Sunday that, once the search was done, Israel would open the Rafah crossing between Gaza and Egypt. But a government spokesperson gave no immediate answer when asked when the border crossing would now reopen. Israel has repeatedly accused Hamas of dragging its feet in the recovery of the final hostage, but the group said it had provided all the information it had about Mr Gvili's remains. Mr Gvili's body will now be returned to his family for burial. Some 1,200 people were killed in the Hamas-led October 7 attacks, with a further 251 taken hostage."
    },
    {
        "title": "Heading football 'likely' to have contributed to death of former Man Utd star, coroner finds",
        "description": "Heading a football is \"likely\" to have contributed to the brain injury which was a factor in the death of former Manchester United and Scotland defender Gordon McQueen, a coroner in North Yorkshire has found.",
        "url": "https://news.sky.com/story/heading-football-likely-to-have-contributed-to-death-of-former-man-utd-star-coroner-finds-13499181",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gordon-mcqueen-football_7128141.jpg?20260106142503",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 12:01:00",
        "Headline": "The central defender, who won 30 international caps for Scotland, died at his home in North Yorkshire in 2023 aged 70.",
        "Content": "Heading a football is \"likely\" to have contributed to the brain injury which was a factor in the death of former Manchester United and Scotland defender Gordon McQueen, a coroner in North Yorkshire has found. The central defender, who died at his home in North Yorkshire in 2023 aged 70, won 30 international caps between 1974 and 1981 and also played for Leeds United during a 16-year career. Appearing at a hearing in Northallerton, North Yorkshire, earlier this month, TV presenter Hayley McQueen said her father had previously told his family that heading a football for so long \"probably hasn't helped\". She said he was diagnosed with vascular dementia in 2021. The cause of death was pneumonia as he had become frail and bed-bound for months, the inquest previously heard. That frailty was due to a combination of vascular dementia and chronic traumatic encephalopathy (CTE), coroner Jon Heath said. The coroner gave a narrative conclusion on Monday, finding that Mr McQueen died from pneumonia as a consequence of mixed vascular dementia and CTE - a brain disorder linked to repeated head impacts. He said: \"It is likely that repetitive head impacts sustained by heading the ball while playing football contributed to the CTE.\" The inquest heard how Mr McQueen's family donated his brain, after his death, to Professor Willie Stewart - a consultant neuropathologist at the Queen Elizabeth University Hospital, Glasgow - who has conducted extensive research into brain injury in footballers and rugby players. Prof Stewart told the inquest he found evidence of CTE and vascular dementia. He agreed with barrister Michael Rawlinson KC, for the McQueen family, when he asked whether the CTE \"more than minimally, negligibly or trivially\" contributed to the death and that \"heading the ball\" contributed to the CTE. The professor said the only evidence available was Mr McQueen's \"high exposure\" to heading a football. After the hearing, the former player's daughter, Ms McQueen, said: \"It should have been a turning point many, many years ago when we learnt the same thing with Jeff Astle and not much has happened between that time and now. \"Hopefully, my dad's legacy will not just be what he gave football on the pitch but what we can learn from this and make sure that this really real, horrible problem isn't a problem for future generations.\" When giving evidence at the inquest earlier this month, Ms McQueen said her dad was relatively injury-free during his career but did suffer some concussions, adding: \"They would just head back out and play.\" She also recalled how, when she was young, he would come home from training with Manchester United and lie down in a darkened room with a headache. Ms McQueen described how her father was very healthy and active - both in sport and with his family - during his playing days and after he retired. But she said the family began to notice changes in his personality after his 60th birthday. Ms McQueen said her father had always been very sociable and outgoing, but became more withdrawn. 'An epidemic of brain disease' Speaking on Sky News' The UK Tonight programme with Sarah-Jane Mee, Ms McQueen called for more education on the potential risks of heading a football. \"Certainly you go through your life in a profession of being a sports person and hope that you keep your body healthy. \"Unfortunately, he [Gordon McQueen] wasn't able to keep his brain healthy because he wasn't aware, obviously, of the risks of heading of a football… we do now.\" She continued: \"There is going to be an epidemic of brain disease within a generation of players who played in certain positions. \"My dad at the centre half is five times more likely to suffer from a neurodegenerative brain injury than a player elsewhere on the pitch, three and a half times more likely for a normal footballer. \"Now, if you're a defender playing at any level of the game, and if you were told that you were more at risk, and by heading of a football, you may develop brain damage, I think you probably think very differently about how you train, how much you head the ball, and whether you even want to head it or not, but give them the knowledge and give them the choice.\" Mr McQueen moved to Leeds from St Mirren in 1972, helping the Yorkshire club to league title success in 1973-74 and playing a key role in their run to the European Cup final in 1975. He then joined Manchester United in 1978 and went on to win the FA Cup in 1983. He also scored in the 1979 cup final defeat to Arsenal. Read more from Sky News:Amber 'danger to life' warnings as storm approaches UKSchools should be 'phone-free' all day, teachers told  Calls to ban heading in the game Five of England's 1966 World Cup-winning team - Sir Bobby Charlton, his brother Jack Charlton, Ray Wilson, Martin Peters and Nobby Stiles were diagnosed with the disease, which either caused or contributed to their deaths. Former England and West Brom striker Jeff Astle died at 59 in 2002 because of repeated trauma from heading footballs, described by a coroner as an \"industrial injury\". Growing evidence that heading the ball can cause brain damage has led to calls for a ban, with scientists also warning of the risks. The game's European governing body, UEFA, said in 2020 young footballers should be doing less heading of the ball. It was prohibited in English football for matches involving under-7s to under-9s during the 2024-25 season. The ban was expanded to under-10 matches this season and is projected to cover under-11 games from 2026-27."
    },
    {
        "title": "Multiple recalls of contaminated baby formula traced to shared supplier",
        "description": "Two separate recalls of contaminated baby formula this month by Nestle and Danone originated from a shared ingredient supplier, the food safety watchdog has confirmed.",
        "url": "https://news.sky.com/story/multiple-recalls-of-contaminated-baby-formula-traced-to-shared-supplier-13499427",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-baby-formula-formula_7127632.jpg?20260106045837",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 22:06:00",
        "Headline": "The baby formulas were recalled over concerns they could contain the cereulide toxin - which can cause vomiting and stomach cramps.",
        "Content": "Two separate recalls of contaminated baby formula this month by Nestle and Danone originated from a shared ingredient supplier, the food safety watchdog has confirmed. The Food Standards Agency (FSA) said ongoing investigations had identified that contamination resulting in both the Nestle SMA and Danone Aptamil recalls originated from a shared third-party ingredient supplier. On 23 January, food giant Danone recalled a batch of its Aptamil baby formula product over concerns it could contain the cereulide toxin - which can cause vomiting and stomach cramps. The agency said the cereulide toxin had been found in the batch distributed in the UK.The food safety watchdog said only one batch sold in the UK was affected, but additional batches in other countries were also affected. Jodie Wild, head of incidents at the FSA, said: \"If you have any of the affected products, stop using them as soon as possible and switch to an alternative formula.\"If the formula was prescribed by a health professional, consult a pharmacist or other medical professional before changing.\"If you have fed it to your baby and are concerned, contact your GP or NHS 111 for advice.\" The FSA said it is urgently working with manufacturers to trace all products that may have used ingredients from this supplier, and ensure all affected products are removed from sale.It is also working with the UK Health Security Agency (UKHSA), local authorities and industry on sampling where appropriate, and will updating when the results are ready. Read more from Sky News:Reward of up £20,000 to find killer of young father shot deadWhat do local residents think of move to block Andy Burnham \n                  Police open murder investigation after death of three-month-old baby boy from head injury\n                 \n                  Nearly a third of kids can't use books when starting school - and try to swipe them like phones\n                 \n                  Doctors warn of 'horrific' impact of tech and devices on children and young people's health\n                 The alert related to batch 31-10-2026 of Aptamil First Infant Formula 800g, with a best-before date of 31 October 2026.On 6 January, Nestle recalled some of its baby formula products over concerns they could also contain cereulide.The problem was caused by an ingredient provided by a leading supplier, it added. Sky News reported earlier this month that mother of baby who fell seriously ill after being given now-recalled infant formula was calling for an investigation. However, Nestle has said it is \"categoric that there is no link between the recall and meningitis\" and that \"cereulide does not cause or transmit meningitis\"."
    },
    {
        "title": "UK loses measles elimination status, warns WHO",
        "description": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged.",
        "url": "https://news.sky.com/story/uk-loses-measles-elimination-status-warns-who-13499336",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-measles-child_6536139.jpg?20240428095436",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-26 17:50:00",
        "Headline": "Vaccination rates in 2024-25 among five-year-olds who had received both MMR jabs hit the lowest level in 15 years.",
        "Content": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged. From 2021 to 2023, the country was considered to have \"eliminated\" the disease, but global health officials say measles transmission was re-established in the UK in 2024. Vaccination coverage has flatlined in recent years, with recorded measles infections in the UK soaring to 3,681 in 2024. Spain, Austria, Armenia, ⁠Azerbaijan and Uzbekistan also lost their status, and the WHO urged countries to boost vaccination rates to prevent the ​disease infecting more children. \"It is unsurprising the UK has lost its WHO measles elimination status, following nationwide outbreaks since 2024 and the preventable death of a child in 2025,\" said Dr Ben Kasstan-Dabush, assistant professor of global health at the London School of Hygiene and Tropical Medicine. The latest figures for England from the UK Health Security Agency (UKHSA) show that in 2024-25, just 83.7% of five-year-olds had received both MMR (measles, mumps and rubella) vaccine doses, down year-on-year from 83.9%. This was the lowest level since 2009-10. \n                  Multiple recalls of contaminated baby formula traced to shared supplier\n                 \n                  'Missed opportunity' to take footballer who died of flesh-eating infection to hospital, coroner rules\n                 \n                  'We were lied to, demeaned and smeared': Hospital inquiry families call for Glasgow health board bosses to 'face a reckoning'\n                 Also in 2024-25, some 91.9% of five-year-olds had received one dose of the MMR vaccine, unchanged from 2023-24 and the lowest level since 2010-11. The WHO advises that at least 95% of children should receive vaccine doses for each illness to achieve herd immunity. \"Infections can return quickly when childhood vaccine uptake falls,\" said Dr Vanessa Saliba, consultant epidemiologist at the UKHSA. \"Measles elimination is only possible if all eligible children receive two MMRV doses before school. \"Older children and adults who missed vaccination must be caught up.\" From the start of January, children have been offered a combined MMRV vaccine, which protects against measles, mumps, rubella and chickenpox, instead of the MMR jab, as part of the childhood routine two-dose vaccination schedule. Dose one is being offered at one year of age and dose two has been brought forward from three years four months to a new 18-month appointment. The rollout across the four nations of the UK comes after the combined MMRV (measles, mumps, rubella and varicella) jab was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023. Read more:What are the symptoms of measles?Child dies as measles cases surge A WHO spokesperson said the UK's change of status \"reflects a broader challenge\" that the organisation is facing across Europe. \"Outbreaks of measles and other vaccine-preventable diseases are threats to health security in Europe,\" they added. Dr Bharat Pankhania, senior clinical lecturer in public health medicine at the University of Exeter Medical School, said: \"It's extremely concerning that in the UK we now have pockets of low or no vaccine uptake.\" He warned that \"we urgently need to remedy this situation\"."
    },
    {
        "title": "Suella Braverman defects to Reform UK - and hits out at Tory 'mental health' briefing",
        "description": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK.",
        "url": "https://news.sky.com/story/former-home-secretary-suella-braverman-defects-to-reform-uk-13499184",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-braverman-farage-reform-uk_7146729.jpg?20260126212100",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-26 12:16:00",
        "Headline": "The latest senior Conservative figure to link up with Nigel Farage had strong words for her \"bitter\" former party.",
        "Content": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK. The former home secretary has been unveiled by Nigel Farage as another high-profile catch at an event launching Veterans for Reform. Ms Braverman, who served in government under prime ministers Theresa May, Boris Johnson, Liz Truss, and Rishi Sunak, announced that she had resigned the Conservative whip to huge cheers from the veterans gathered for the event. Politics latest - follow live \"I feel like I've come home,\" she said. \"Because I believe that a better future is possible for us, I am joining Reform UK.\" Braverman also responded after a Conservative statement, which the party said had been \"sent out in error\", made references to her \"mental health\". Echoing earlier comments from Mr Farage, she said: \"Those attacks say more about them, than they do about me.\" \n                  Jenrick joins Reform – is it a boost for Nigel Farage or Kemi Badenoch?\n                 \n                  Badenoch turned a crisis into an opportunity - but her Reform problems aren't over\n                 \n                  How Reform could offer ever-ambitious Nadhim Zahawi a new route to the top\n                 She added: \"It is a bit pathetic. I am afraid it's more sorry signs of a bitter and desperate party that is in free fall.\" Why did Suella Braverman switch to Reform UK? Asked why she made decided to switch now, Ms Braverman said: \"I've been thinking about it for some time. \"I've been politically homeless for the best part of two years. I have not had confidence in the Conservative Party, really, but I have tried to see whether it might change, try to give it some time and its events over the last few days reach really, which have tipped me over the line.\" Ms Braverman served in the Home Office at the same time as Robert Jenrick, who defected to the party on 15 January. She is the party's eighth MP. Explaining her decision, Ms Braverman said: \"Loyalty demands honesty, and honesty compels me to say this: today Britain is indeed broken. She is suffering. She is not well. \"Immigration is out of control. Our public services are on their knees. People don't feel safe. \"Our youngsters are leaving the country for better futures elsewhere. We can't even defend ourselves and our nation stands weak and humiliated on the world stage. \"So we stand at a crossroads. We can either continue down this route of managed decline to weakness and surrender. Or we can fix our country, reclaim our power, rediscover our strength. I believe that a better Britain is possible.\" She pointed to her calls to leave the European Court of Human Rights (ECHR) while in government, and accused the Tories of having \"utterly failed to do the right thing for the British people\". Suella Braverman rose to the top echelons of the Conservative Party over a career that spanned almost 11 years.  But now the former home secretary has decided to swap her navy blue for teal, by defecting to Nigel Farage's Reform UK. The 45-year-old is a qualified barrister and served in government under successive Conservative PMs including Theresa May, Boris Johnson, Liz Truss, and finally Rishi Sunak. She was elected to parliament as the MP for the Hampshire seat of Fareham (now Fareham and Waterlooville) in 2015 - a year before the Brexit vote. A vocal Eurosceptic, she rose up the anti-EU faction of the party, ultimately chairing the European Research Group, and ran to be the party's leader before being knocked out in the second round. She served as attorney general in Boris Johnson's government, and, after throwing her weight behind the short-lived premiership of Truss, Braverman was given the plum job of home secretary. She resigned from the role after breaching the ministerial code by using a personal address for confidential emails.  But six days later, Sunak put her back in the top job - only for her to lose the role again after a series of stridently right-wing comments.  She was a major driver of policies such as the Rwanda plan and the Bibby Stockholm barge used to house migrants during her tenure. Since her dismissal, Braverman has been on the backbenches, but made supportive noises for Nigel Farage and attended Donald Trump's second inauguration last year - where she was seen wearing a MAGA cap. She said her former party had \"great speeches, good slogans... but when the cameras are off, when the doors are shut, and when they're sat behind that table making difficult decisions for the country, they fold\". She added: \"When push comes to shove, they go AWOL. No courage, no backbone, no resolve.\" Ms Braverman also hit out at the current Tory party, saying its commitment to leave the ECHR is a lie. She added: \"I'm calling time on Tory lies. I'm calling time on a party that keeps making promises with zero intention of keeping them.\" Championing Reform, Ms Braverman said: \"There is only one man in British politics who has been courageously consistent for his country, and that man is Nigel Farage. \"He's not backed down in the face of vicious onslaughts, vicious vitriol, and backlash. Nigel Farage is right and the British people are backing him.\" Ms Braverman concluded her speech by saying it is \"the honour of my life\" to defect to Reform. Reform UK 'stuffed full of failed Tories responsible for chaos' The Conservatives have hit back, saying it was \"always a matter of when, not if, Suella would defect\" and suggesting she has changed sides because of \"personal ambition\", citing her unsuccessful run to be leader. In a barbed response, the Tories added that they \"did all we could to look after Suella's mental health, but she was clearly very unhappy\". The spokesperson continued: \"Reform are too busy opposing the Conservatives to hold the Labour government to account.\" For their own part, Labour has accused Mr Farage of \"stuffing his party full of the failed Tories responsible for chaos and decline that held Britain back for 14 years\". Anna Turley, Labour's chairwoman, added: \"Suella Braverman helped botch Brexit and got sacked as home secretary - her defection shows Farage is willing to accept the very worst of the Conservative Party and exposes his complete lack of judgement.\" Meanwhile, the Liberal Democrats accused Ms Braverman of having \"selective amnesia\" and of forgetting she \"helped break\" Britain. Deputy leader Daisy Cooper said: \"Suella Braverman was so bad she was forced to resign from Liz Truss's cabinet and got sacked by Rishi Sunak.\""
    },
    {
        "title": "Farage says the right is uniting. The reality is very different",
        "description": "Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really?",
        "url": "https://news.sky.com/story/is-the-right-really-uniting-hardly-it-is-more-divided-than-ever-13499394",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-suella-braverman-reform_7146261.jpg?20260126181701",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2026-01-26 20:55:00",
        "Headline": "The Tories even reacted to the former home secretary's walkout by claiming 'the Conservatives did all we could to look after Suella's mental health'.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really? Mr Farage's introduction was then followed by 25 minutes of his latest Tory defector trashing her old party in the most vitriolic attack of any of Reform UK's new recruits. Braverman's defection - read the latest The defections of Nadhim Zahawi, Robert Jenrick, Andrew Rosindell and now Ms Braverman have been greeted by their old party with more bile than any previous defections. The Tories even reacted to the former home secretary's walkout by claiming: \"The Conservatives did all we could to look after Suella's mental health, but she was clearly very unhappy.\" Mental health? Below the belt, surely? Some senior Conservatives were appalled and a few hours later the party issued a \"correction\" with the offending - and offensive - sentence removed. In his opening remarks, Mr Farage called the mental health slur \"pretty abusive\", claiming: \"We won't lower ourselves to their level.\" Ms Braverman's tirade against her old party may not have been below the belt. But it was pretty near the knuckle. She used the word \"betrayal\" several times. On the refusal to ban \"hate marches\", she said: \"The Conservative Party should be disgusted with itself, frankly.\" She went on: \"I was vilified and called Islamophobic by my own Conservative Party colleagues. Another great betrayal.\" She attacked Kemi Badenoch personally. \"The leader herself said I was having a nervous breakdown, something she seems to have repeated again today.\" Ms Braverman said she had been \"politically homeless\" for two years and \"ashamed of the Conservative Party\". Theresa May \"messed up Brexit\", she claimed. The Tories had a \"largely Lib Dem socialist-lite agenda\", a \"woke ideology\" and were a \"social democrat left-leaning party\", she said. And yet she claimed: \"I don't leave the Conservative party with malice or anger or bitterness. That passed a long time ago.\" Yet this was indeed a malicious, angry and bitter attack. She told Sky News' own Amanda Akass: \"It's a very toxic environment. There's a witch-hunt.\" An hour earlier in the Commons, as the Tories gloated over the near-collapse of the Chagos handover, the veteran MP Sir Julian Lewis claimed: \"The reason this bill may not go through is the work of the Conservative opposition in both Houses of Parliament and the words of the leader of the Reform party in Mr Trump's ear. Read more from Sky News:UK loses measles elimination statusAt least 15 dead and hundreds rescued after ferry sinks \"Does that not show what can be achieved when two parties make common cause in a very worthwhile aim to achieve a vital objective?\" Perhaps. But it's a very rare common cause. Labour, delighted that Tory turmoil was once again overshadowing Labour civil war, claimed Mr Farage is \"stuffing his party full of a band of failed Tories\". And it's certainly beginning to look a bit like that. And is the right really uniting, as Mr Farage claimed? Hardly. Certainly not on the evidence of Suella Braverman's brutal attack on her old party and the Conservatives' response."
    },
    {
        "title": "Lung cancer: 'Trailblazing' NHS scheme hailed as a 'glimpse of the future'",
        "description": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\". ",
        "url": "https://news.sky.com/story/lung-cancer-trailblazing-nhs-scheme-hailed-as-a-glimpse-of-the-future-13499296",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lung-cancer-health_7146564.jpg?20260126173959",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-26 16:14:00",
        "Headline": "Under the pilot scheme, AI software will be used to analyse lung scans and flag suspicious spots, before a robotic catheter takes precise biopsies, which are then checked in a lab to diagnose or rule out cancer.",
        "Content": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\".  It comes alongside NHS plans to expand lung cancer screening, with all eligible people invited for their first check by 2030. Alongside the expansion, AI software will be used to analyse patients' lung scans and flag suspicious spots, known as nodules. A robotic catheter - a thin tube inserted into the patient via the throat - is used to take precise biopsies directly from the nodule, which are then checked in a lab to diagnose or rule out cancer. The robotic system can reach spots as small as six millimetres, which are often hidden deep in the lung and can be missed at screening. It's harder for doctors to reach such nodules to take biopsies, meaning patients must wait for further scans to see if they grow. Specialists at Guy's and St Thomas' NHS Foundation Trust have already used robotic biopsies on 300 patients, with some 215 of them going on to have cancer treatment. The new pilot will involve a further 250 patients, and it's hoped other trusts will start performing the procedure. Read more from Sky News:King's 'good news' on cancer Lung cancer is the third most common cancer in the UK, with more than 49,000 new diagnoses and around 33,000 deaths every year. Since 2019, more than 1.5 million people in England between the ages of 55 and 74 who have ever smoked have been invited to have their lung health checked, NHS England said, and a further 1.4 million people will be contacted next year alone. Professor Peter Johnson, NHS England's national clinical director for cancer, said screening means more cases are being picked up at an early stage than ever, and the new pilot will support even \"faster, more accurate biopsies\". \"This is a glimpse of the future of cancer detection,\" he said. Health Secretary Wes Streeting underwent robotic surgery when being treated for kidney cancer and said the NHS treatment \"saved my life\". He said the pilot will help catch the illness earlier, \"replacing weeks of invasive testing with a single targeted procedure\"."
    },
    {
        "title": "Multiple recalls of contaminated baby formula traced to shared supplier",
        "description": "Two separate recalls of contaminated baby formula this month by Nestle and Danone originated from a shared ingredient supplier, the food safety watchdog has confirmed.",
        "url": "https://news.sky.com/story/multiple-recalls-of-contaminated-baby-formula-traced-to-shared-supplier-13499427",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-baby-formula-formula_7127632.jpg?20260106045837",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-26 22:06:00",
        "Headline": "The baby formulas were recalled over concerns they could contain the cereulide toxin - which can cause vomiting and stomach cramps.",
        "Content": "Two separate recalls of contaminated baby formula this month by Nestle and Danone originated from a shared ingredient supplier, the food safety watchdog has confirmed. The Food Standards Agency (FSA) said ongoing investigations had identified that contamination resulting in both the Nestle SMA and Danone Aptamil recalls originated from a shared third-party ingredient supplier. On 23 January, food giant Danone recalled a batch of its Aptamil baby formula product over concerns it could contain the cereulide toxin - which can cause vomiting and stomach cramps. The agency said the cereulide toxin had been found in the batch distributed in the UK.The food safety watchdog said only one batch sold in the UK was affected, but additional batches in other countries were also affected. Jodie Wild, head of incidents at the FSA, said: \"If you have any of the affected products, stop using them as soon as possible and switch to an alternative formula.\"If the formula was prescribed by a health professional, consult a pharmacist or other medical professional before changing.\"If you have fed it to your baby and are concerned, contact your GP or NHS 111 for advice.\" The FSA said it is urgently working with manufacturers to trace all products that may have used ingredients from this supplier, and ensure all affected products are removed from sale.It is also working with the UK Health Security Agency (UKHSA), local authorities and industry on sampling where appropriate, and will updating when the results are ready. Read more from Sky News:Reward of up £20,000 to find killer of young father shot deadWhat do local residents think of move to block Andy Burnham \n                  Police open murder investigation after death of three-month-old baby boy from head injury\n                 \n                  Nearly a third of kids can't use books when starting school - and try to swipe them like phones\n                 \n                  Doctors warn of 'horrific' impact of tech and devices on children and young people's health\n                 The alert related to batch 31-10-2026 of Aptamil First Infant Formula 800g, with a best-before date of 31 October 2026.On 6 January, Nestle recalled some of its baby formula products over concerns they could also contain cereulide.The problem was caused by an ingredient provided by a leading supplier, it added. Sky News reported earlier this month that mother of baby who fell seriously ill after being given now-recalled infant formula was calling for an investigation. However, Nestle has said it is \"categoric that there is no link between the recall and meningitis\" and that \"cereulide does not cause or transmit meningitis\"."
    },
    {
        "title": "Will renewable licences put off budding police officers?",
        "description": "Like doctors and lawyers, all police officers will have to have a licence to practise under new Home Office reforms.",
        "url": "https://news.sky.com/story/will-renewable-licences-put-off-budding-police-officers-13499351",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-officer-officers_7146667.jpg?20260126194327",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2026-01-26 18:39:00",
        "Headline": "The home secretary, Shabana Mahmood, believes the licence would show the public that officers had reached a certain professional standard and were worthy of their uniform.",
        "Content": "\n          Crime commentator\n              @skymartinbrunt\n Like doctors and lawyers, all police officers will have to have a licence to practise under new Home Office reforms. I wonder what effect that might have on recruitment. Might it reduce policing as a career choice for some potential officers? The licence would be renewable, probably every five years, and would mean officers must demonstrate they've absorbed their training and guidance and have updated their skills to cope in an evolving crime world. If they flunk the licence test, they can try again, but continued failure would mean the sack. The home secretary, Shabana Mahmood, believes the licence would show the public that officers had reached a certain professional standard and were worthy of their uniform. But this new regular assessment on top of a stringent vetting process, low public confidence in policing and the daily possibility of personal danger, might dissuade young men and women from wanting to be police officers. 👉 Listen to Sky News Daily on your podcast app 👈 \n                  Man stabbed Lilia Valutyte, 9, through the heart while she played with hula hoop, court hears\n                 \n                  More than 500 report sexual abuse during military medical examinations\n                 \n                  Jordan Gray: Reward of up £20,000 to find killer of young father shot dead in 'cold blood' in Motherwell\n                 A friend at the Metropolitan Police told me there were new recruits signing up for five years' service, not interested in a lifelong career that used to be the norm, when many young men and women followed their parents into policing. A new generation may believe it would be an interesting, exciting job for a while, but not something they want to do for ever. And it would look good on their CV, enhancing their career prospects once they've decided what they really want to do with their lives. Read more from Sky News:Facial recognition technology to be rolled out nationallyWill public feel better protected by police reforms? I understand the Home Office isn't worried about such a prospect and believes there's no evidence that budding doctors and lawyers are put off by renewable licences to practise. Let's see what happens."
    },
    {
        "title": "Claire's collapse into administration renews high street fears",
        "description": "The British operations of Claire's, the accessories retailer, have collapsed into administration just four months after their last brush with insolvency, putting more than 1,000 high street jobs at risk.",
        "url": "https://news.sky.com/story/claires-collapse-into-administration-renews-high-street-fears-13499342",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-claires-claires-accesories_7005467.jpg?20250830115912",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-26 18:12:00",
        "Headline": "More than 1,000 retail jobs have been imperilled by the appointment on Monday of insolvency practitioners at Claire’s just four months after it was rescued, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The British operations of Claire's, the accessories retailer, have collapsed into administration just four months after their last brush with insolvency, putting more than 1,000 high street jobs at risk. Sky News understands that insolvency practitioners from Kroll were formally appointed as administrators to Claire's UK and Ireland earlier on Monday. It comes three weeks after Sky News revealed that the chain's owner, Modella Capital, filed a notice of intention to appoint administrators to both Claire's and TOFS, the discount retailer it also acquired last year. In a statement on Monday evening, Kroll said: \"Philip Dakin, Benjamin Wiles and Janet Burt of Kroll Advisory Ltd were appointed as joint administrators of CAUKI Ltd on 26 January 2026. \"The company is continuing to trade during this period.\" Modella bought the company last September, several months after Claire's had filed for insolvency in both the US and the UK. Retail analysts are sceptical that a buyer will emerge for many of the remaining 156 Claire's stores in Britain and Ireland. \n                  Tech rental subscription service Raylo clicks on £30m fundraising\n                 \n                  UK bank fined for breaking Russia sanctions\n                 \n                  South East Water action group demands boss’s immediate removal\n                 Sources close to the situation said earlier this month that a combination of government policy - with a significantly increased tax burden placed on the retail industry - and demands from landlords to take back swathes of Claires' shops, had rendered the future of the chain unviable. The retail industry continues to face significant headwinds, with chains including Poundland having closed significant numbers of shops. Read more from Sky News: UK bank fined for breaking Russia sanctions10 shots in 5 seconds: How did Minneapolis shooting unfold? Modella also owns businesses including WH Smith's historic high street estate, which it has rebranded as TG Jones, as well as Hobbycraft. Claire's had previously traded from nearly 300 shops in the UK, but has been hit by changes in consumer behaviour among its traditional teenage customer base. Significant numbers of jobs were lost in restructuring processes prior to Modella's purchase of the business."
    },
    {
        "title": "More than 500 report sexual abuse during military medical examinations",
        "description": "Dectectives are encouraging anyone with information about sexual abuse  during military medical examinations to come forward after receiving more than 500 reports. ",
        "url": "https://news.sky.com/story/more-than-500-report-sexual-abuse-during-military-medical-examinations-13499211",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-british-army-fatigues_7057579.jpg?20251021181248",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-26 13:24:00",
        "Headline": "Police say hundreds have come forward to report abuse in incidents across the UK between the 1970s and 2016.",
        "Content": "Dectectives are encouraging anyone with information about sexual abuse  during military medical examinations to come forward after receiving more than 500 reports.  Wiltshire Police launched an investigation after recruits alleged they had been abused during medical examinations to join the army. The force said more than 500 people had now made contact to report incidents between the 1970s and 2016 across Britain. Police have also heard from serving and former members of the military, as well as people who did not join afterwards. The investigation has been widened to include medical examinations for the navy and air force. Detective Superintendent Darren Hannant said: \"The number of people who have contacted us highlights the seriousness of the abuse being reported, my team and I are committed to engaging with each survivor and witness. \"We would like to speak to anyone who may have information which can inform our investigation. \"We recognise how difficult it can be to come forward with experiences like these, particularly when they occurred many years ago.\" He said the scope of the inquiry had widened to include \"anyone who has information about concerning behaviour at military medical examinations - including civilians, or those serving in any branch of the armed forces\". \"You do not need to be sure whether your experience falls within the scope of this investigation,\" he said. \"Our team will assess any report and ensure it is handled appropriately. \"Any reports will be treated with the utmost sensitivity; our officers will listen and support you. \"Our team will review every report carefully and in detail.\" Read more from Sky News:Former home secretary Suella Braverman defects to ReformStorm Chandra to bring snow, winds and rain to UK DS Hannant said it may take a few weeks to make contact with those who report an incident due to the volume, but stressed \"every report is being taken seriously\".\"The information you provide helps us understand what has happened and identify any steps we need to take to safeguard others,\" he said. Defence minister for veterans and people Louise Sandher-Jones said those \"who serve, or seek to serve, our country deserve to be treated with dignity and respect at every stage\" and encouraged anyone affected to come forward. \"The scale of this response is deeply disturbing, but it highlights the courage of those coming forward to share these distressing experiences, and I want to assure every single person that their voice matters,\" she said. \"I'm committed to rooting out sexual misconduct wherever we find it and fully support Wiltshire Police as it pursues this investigation with the thoroughness it demands.\""
    },
    {
        "title": "Jordan Gray: Reward of up £20,000 to find killer of young father shot dead in 'cold blood' in Motherwell",
        "description": "A reward of up to &#163;20,000 has been offered for information in the hunt for a killer who shot a young father dead in \"cold blood\".",
        "url": "https://news.sky.com/story/jordan-gray-reward-of-up-16320000-to-find-killer-of-young-father-shot-dead-in-cold-blood-in-motherwell-13499123",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jordan-gray-police-scotland_7140649.jpg?20260126093006",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-26 09:25:00",
        "Headline": "Sky News understands a shotgun was used in the December shooting. Door-to-door enquiries have taken place and more than 1,200 hours of CCTV footage has been gathered in the hunt for the killer.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A reward of up to £20,000 has been offered for information in the hunt for a killer who shot a young father dead in \"cold blood\". Jordan Gray, 26, was killed at his home in Shields Court, in the town of Motherwell, North Lanarkshire, on Sunday 14 December. His body was discovered the following day. Sky News understands a shotgun was used in the shooting. Crimestoppers said despite weeks of extensive enquiries, the firearm is yet to be recovered and the killer remains at large. The charity is now offering a reward of up to £20,000 for any information that leads to the arrest and conviction of those responsible for the fatal shooting. Door-to-door enquiries have taken place and more than 1,200 hours of CCTV footage has been gathered in the hunt for the killer. Investigating officers remain keen to identify a person spotted in Shields Court shortly after 10.30pm on the day of the shooting, who was said to be wearing a dark jacket with the hood up and dark trousers. Angela Parker, national manager for Scotland at Crimestoppers, said: \"This was a shocking act of violence that took the life of a young man in his own home and left a community fearful and grieving. \"We know that some people are reluctant to speak directly to the police, but Crimestoppers offers an alternative, completely anonymous way to share what you know. \"You will never be asked for your name or personal details, and your identity will never be revealed. \"What you tell us could bring justice for Jordan, his family, and the community. Even the smallest piece of information could help find those responsible for Jordan's death.\" At a Police Scotland news conference last week, Mr Gray's mother Lynn Gray and stepfather Michael Groome said their son had been murdered in \"cold blood\". Mr Groome said: \"We are devastated by our loss. His sisters and wee brother are struggling to understand how someone could do this to their big brother. \"Jordan's baby will have to grow up without knowing how much his dad loved him.\" He added: \"Help us stop them from doing this to someone else and leaving another family heartbroken.\" Read more from Sky News:Teen arrested after missing man found deadHome secretary to announce police overhaul Those with information can submit details to the police inquiry team via an online portal. However, to access the cash reward, the information must be passed directly to Crimestoppers. Detective Superintendent Grant Hendry said: \"I'd like to express my thanks to Crimestoppers for this reward. I hope it will encourage anyone with information on who is responsible to come forward. \"We know people may be reluctant to talk to the police. The charity is independent and can pass this anonymous information to us to allow officers to fully investigate and take action. \"Please contact Crimestoppers exclusively if you think you can help.\""
    },
    {
        "title": "UK loses measles elimination status, warns WHO",
        "description": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged.",
        "url": "https://news.sky.com/story/uk-loses-measles-elimination-status-warns-who-13499336",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-measles-child_6536139.jpg?20240428095436",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-26 17:50:00",
        "Headline": "Vaccination rates in 2024-25 among five-year-olds who had received both MMR jabs hit the lowest level in 15 years.",
        "Content": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged. From 2021 to 2023, the country was considered to have \"eliminated\" the disease, but global health officials say measles transmission was re-established in the UK in 2024. Vaccination coverage has flatlined in recent years, with recorded measles infections in the UK soaring to 3,681 in 2024. Spain, Austria, Armenia, ⁠Azerbaijan and Uzbekistan also lost their status, and the WHO urged countries to boost vaccination rates to prevent the ​disease infecting more children. \"It is unsurprising the UK has lost its WHO measles elimination status, following nationwide outbreaks since 2024 and the preventable death of a child in 2025,\" said Dr Ben Kasstan-Dabush, assistant professor of global health at the London School of Hygiene and Tropical Medicine. The latest figures for England from the UK Health Security Agency (UKHSA) show that in 2024-25, just 83.7% of five-year-olds had received both MMR (measles, mumps and rubella) vaccine doses, down year-on-year from 83.9%. This was the lowest level since 2009-10. \n                  Multiple recalls of contaminated baby formula traced to shared supplier\n                 \n                  'Missed opportunity' to take footballer who died of flesh-eating infection to hospital, coroner rules\n                 \n                  'We were lied to, demeaned and smeared': Hospital inquiry families call for Glasgow health board bosses to 'face a reckoning'\n                 Also in 2024-25, some 91.9% of five-year-olds had received one dose of the MMR vaccine, unchanged from 2023-24 and the lowest level since 2010-11. The WHO advises that at least 95% of children should receive vaccine doses for each illness to achieve herd immunity. \"Infections can return quickly when childhood vaccine uptake falls,\" said Dr Vanessa Saliba, consultant epidemiologist at the UKHSA. \"Measles elimination is only possible if all eligible children receive two MMRV doses before school. \"Older children and adults who missed vaccination must be caught up.\" From the start of January, children have been offered a combined MMRV vaccine, which protects against measles, mumps, rubella and chickenpox, instead of the MMR jab, as part of the childhood routine two-dose vaccination schedule. Dose one is being offered at one year of age and dose two has been brought forward from three years four months to a new 18-month appointment. The rollout across the four nations of the UK comes after the combined MMRV (measles, mumps, rubella and varicella) jab was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023. Read more:What are the symptoms of measles?Child dies as measles cases surge A WHO spokesperson said the UK's change of status \"reflects a broader challenge\" that the organisation is facing across Europe. \"Outbreaks of measles and other vaccine-preventable diseases are threats to health security in Europe,\" they added. Dr Bharat Pankhania, senior clinical lecturer in public health medicine at the University of Exeter Medical School, said: \"It's extremely concerning that in the UK we now have pockets of low or no vaccine uptake.\" He warned that \"we urgently need to remedy this situation\"."
    },
    {
        "title": "'Public face' of Trump's Minneapolis crackdown set to leave city - as president's tone shifts",
        "description": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News.",
        "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gregory-bovino-border-patrol_7146710.jpg?20260126205126",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-26 23:37:00",
        "Headline": "There has been a change in tone from the White House regarding the situation in Minneapolis amid mounting public backlash, including from Donald Trump himself.",
        "Content": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News. Gregory Bovino and some of his immigration enforcement agents are set to depart on Tuesday, a White House official and another government figure familiar with the decision said. Latest updates from Minneapolis It follows widespread backlash among the American public, leading Democrats, and a growing number of Republicans over the fatal shooting of Alex Pretti on Saturday - and the response to it. The 37-year-old nurse, a US citizen, was shot dead in an altercation with ICE agents - the second such incident in the city this month, following the death of Renee Good. Top officials including Mr Bovino, Homeland security secretary Kristi Noem, and Trump adviser Stephen Miller tried to paint Mr Pretti as a threat to the agents, prompting a furious response from his family. Ms Noem has claimed he approached officers with a handgun and acted violently towards them, but several pieces of footage analysed by Sky News counters that narrative: 'Border tsar' could take over operation The removal of Mr Bovino from Minneapolis would be a \"major step\", Sky's US correspondent Martha Kelner said. He has become the \"public face\" of Donald Trump's immigration crackdown, she added. The president's \"border tsar\", Tom Homan, is set to arrive in the city shortly, according to White House press secretary Karoline Leavitt, who said he was \"doing an exceptional job\". Trump touts calls with senior Democrats There has been a marked change in tone from the White House regarding Minneapolis amid the public backlash, including from the president himself. NBC reports, citing administration officials, that Mr Trump is \"concerned\" about the sustainability of the operation. \"The visuals were not playing well. He understands TV. … He saw it for himself,\" said a Republican lawmaker who was granted anonymity to speak candidly. Mr Trump is to meet the city's mayor, Jacob Frey, on Tuesday. \"I just had a very good telephone conversation with Mayor Jacob Frey, of Minneapolis,\" he said on Truth Social. \"Lots of progress is being made!\" Mr Trump made similarly positive noises about an earlier conversation with Minnesota Governor Tim Walz, another Democrat who has called for ICE to leave Minneapolis. \"It was a very good call, and we, actually, seemed to be on a similar wavelength,\" the president said. Read more from Sky News:Minnesota isn't Belfast but the warning signs are there Among the senior Republicans to call for a change in approach are Senator Ted Cruz, who said on his podcast: \"I would encourage the administration to be more measured.\" The scenes in Minneapolis have also been condemned by former Trump ally Marjorie Taylor Greene, who split with the president over his handling of the Epstein files. Officials who spoke to NBC insisted Mr Trump remained committed to cracking down on immigration and fraud."
    },
    {
        "title": "Remains of last Israeli hostage found in Gaza",
        "description": "The remains of the last Israeli hostage in Gaza have been found.",
        "url": "https://news.sky.com/story/remains-of-last-israeli-hostage-found-in-gaza-13499223",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ran-gvili-kibbutz-alumim_7113279.jpg?20260126135525",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-26 13:43:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu called it \"an incredible achievement\" and said: \"I promised we would bring everyone home and we have brought everyone home.\"",
        "Content": "The remains of the last Israeli hostage in Gaza have been found. The Israel Defence Forces (IDF) said in a statement it had retrieved the body of police officer Ran Gvili and that his family had been informed. Identification of the remains was confirmed by the National Institute of Forensic Medicine, in cooperation with the Israeli police, and the military rabbinate, the IDF said. Mr Gvili, 24, was a sergeant first class in the Israeli police special forces, who was killed at the Alumim kibbutz during the October 7 attacks in 2023, before his body was taken to Gaza. The announcement that his remains had been found and identified came a day after Israel's government said the military was conducting a \"large-scale operation\" in a northern Gaza cemetery to locate them. The discovery of his remains marks the return of the last ​remaining hostage held in Gaza, fulfilling a key condition of the ​first phase of Donald Trump's peace plan. Mr Gvili's family had urged Israeli Prime Minister Benjamin Netanyahu not to enter the second phase of the plan until his remains were recovered. \n                  Israel says Rafah crossing will have 'limited' reopening after hostage search\n                 \n                  Is the Board of Peace a Trump-led sham?\n                 \n                  Trump's new gang shouldn't be underestimated - and could add more powerful friends\n                 Now Mr Netanyahu has hailed the return of Mr Gvili as \"an incredible achievement\", adding that \"I promised we would bring everyone home and we have brought everyone home\". Hamas, the Palestinian militant group that has governed Gaza, emphasised its compliance with the peace deal. Spokesperson Hazem Qassem said: \"The discovery of the body of the last Israeli prisoner in Gaza confirms Hamas's commitment to all the requirements of the ceasefire agreement on the Gaza Strip, including the prisoner exchange process and its complete closure as stipulated in the agreement. \"The movement will continue to adhere to all aspects of the agreement, including facilitating the work of the National Committee for the Administration of Gaza and ensuring its success. \"We call on the mediators and the United States to compel the occupation to cease its violations of the agreement and implement its required obligations.\" Ahead of the discovery, an Israeli military official revealed there were \"several intelligence leads\" regarding the possible location of the police officer's remains. A \"targeted operation\" was under way in northern Gaza, they added. Mr Netanyahu's office said on Sunday that, once the search was done, Israel would open the Rafah crossing between Gaza and Egypt. But a government spokesperson gave no immediate answer when asked when the border crossing would now reopen. Israel has repeatedly accused Hamas of dragging its feet in the recovery of the final hostage, but the group said it had provided all the information it had about Mr Gvili's remains. Mr Gvili's body will now be returned to his family for burial. Some 1,200 people were killed in the Hamas-led October 7 attacks, with a further 251 taken hostage."
    },
    {
        "title": "Focus turns to future of Gaza after final hostage remains returned to Israel",
        "description": "Ran Gvili was one of the first Israelis killed on 7 October 2023 when Hamas fighters poured into Israel and launched their ferocious attack.",
        "url": "https://news.sky.com/story/focus-turns-to-future-of-gaza-after-final-hostage-remains-returned-to-israel-13499322",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gvili-israel-hostage_7146565.jpg?20260126174002",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-26 17:22:00",
        "Headline": "The body of police officer Ran Gvili, one of the first Israelis killed on 7 October 2023, has been returned.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n Ran Gvili was one of the first Israelis killed on 7 October 2023 when Hamas fighters poured into Israel and launched their ferocious attack. His body was taken to Gaza, and there it remained. \"First in, last out,\" was the comment from the forum representing the hostages' families. It was a refrain taken up by plenty, a mark of respect not just for his life, but also for the miserable suffering of his family, who have waited so long to get back a body to bury. And for many in Israel, it is also the end of a chapter. The nation's president, Isaac Herzog, released a video of himself removing the yellow ribbon badge that has become a staple for many in this country. The demand for hostages to be returned has now been achieved. In fact, for the first time in more than a decade, there are no Israeli hostages, alive or dead, being held in Gaza. But Mr Gvili's return to Israel is not simply the balm for the agony of a family and the enduring pain of a nation. It is also the key to starting the second phase of a peace plan that is changing and morphing with every passing day. \n                  Remains of last Israeli hostage found in Gaza\n                 \n                  Israel says Rafah crossing will have 'limited' reopening after hostage search\n                 \n                  The Voice Of Hind Rajab: Brad Pitt-backed film about death of child in Gaza set for UK release\n                 Now the focus is supposed to be on the future of Gaza - the delivery of more aid, the long-term reconstruction, the governance of the Strip, disarmament of Hamas, security and the withdrawal of Israeli forces. And that's just to get us going. None of these actions will be remotely straightforward to achieve, and some will be fiendishly difficult. And political fault lines, which are beginning to emerge, may widen. Jared Kushner's skyscraper plan For one thing, you might wonder about the end goal. Well, we know what the US wants from this, because Jared Kushner put up a PowerPoint presentation at Davos and displayed computer-generated images of skyscrapers and new cities, ripe for investment. \"New Gaza\" is what he proclaimed, to be built on the rubble of the old one. But even that rubble will take years - maybe half a decade - to clear. So Mr Kushner's claim that the development could come quickly seems at best optimistic. Yes, Middle Eastern countries are skilled at going fast. But no, they don't normally build on land that has been devastated by war, which has no meaningful infrastructure - and which is peppered with unexplored ordnance. So the electricity needs to be returned, so does the water and sewage system. Roads have to be built. Bombs have to be cleared. This will not be easy, and nor will it be cheap. If there is change from $100 billion, that would be a surprise. Governance is inevitably going to cause friction, not least with a Board of Peace that is largely composed of people who are either friends of US President Donald Trump already, or desperate to become his friend in the future. Disarming Hamas sounds clear, but then again nobody can quite tell you what it means, or how it will happen, or who's going to do it, or who's going to check. And so it goes on. What Donald Trump wants in Gaza What's quite clear is that Trump and his team want things to happen fast, they want them to happen to a US plan, and they want to take as much credit as possible. The news that Mr Gvili's remains had been returned was greeted by the White House with the immediate claim that \"President Trump made this possible\", and by the president thanking \"his great team of champions\". Benjamin Netanyahu, the Israeli prime minister, was not mentioned. The relationship between the two men has long been close, and Trump's profile in Israel is unquestionable. He is probably the most popular politician in the country, but there is tension now between him and the Israeli leader. Read more:Israel says Rafah crossing will have 'limited' reopeningUN accuses Israel of 'unprecedented attack' For one thing, Mr Netanyahu was aghast that figures from Turkey and Qatar were invited to join one of the executive boards overseeing Gaza. For another, Mr Netanyahu is facing ever louder criticism that he is \"kowtowing\" to the White House. For the archetypal strongman leader, that is an awkward position to be in, but it's much worse when he is facing a general election in nine months time. Like everything touched by the past few years, Israel's vote will be complex, uncompromising, and heavily shaped by the actions of the US administration."
    },
    {
        "title": "Child kidnapped for organ removal among 4,414 helped in trafficking crackdown",
        "description": "An eight-year-old boy kidnapped for organ removal is among 4,414 people police say have been safeguarded from human trafficking in a global operation.",
        "url": "https://news.sky.com/story/child-kidnapped-for-organ-removal-among-4414-helped-in-trafficking-crackdown-13499144",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-interpol-police-mozambique_7146130.jpg?20260126110222",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-26 10:12:00",
        "Headline": "Interpol say the boy from Mozambique was one of thousands of potential victims protected by an operation involving more than 14,000 police  across 119 countries.",
        "Content": "An eight-year-old boy kidnapped for organ removal is among 4,414 people police say have been safeguarded from human trafficking in a global operation. The child, from Mozambique, was discovered as part of the Interpol co-ordinated initiative dubbed Operation Liberterra III, which involved more than 14,000 officers across 119 countries. In the UK police were able to safeguard a Romanian national trafficked to Scotland under false promises of employment and subjected to sexual exploitation. Transported across Europe then brought to Scotland by ferry, the woman's identification documents were withheld once she arrived in Dundee. More victims were discovered in Spain, where a criminal network was using beauty salons and massage parlours in Barcelona and Marbella to traffic women for sexual exploitation. The 21 women, mostly of Colombian origin, endured constant surveillance and abuse, and were forced to repay debts of €6,000 (£5,200) through prostitution. The same premises were also used for drug sales. Meanwhile, in Costa Rica, police arrested a man known as \"El Gordo\" who was accused of pressuring underage girls from a technical college to record explicit videos. His partner, a teacher at the same institution, was also arrested, with authorities believing she facilitated his access to potential victims. There was a further breakthrough in Kazakhstan, where a bogus taxi service was uncovered using violence and intimidation to force victims into prostitution in multiple saunas. Kazakh police seized cash, weapons, bank cards, and several vehicles, as well as uncovering a money-laundering scheme used to purchase real estate and assets. And more than 200 people were rescued from human traffickers across Benin, Burkina Faso, the Congo, Côte d'Ivoire, Ghana, Senegal and Sierra Leone. The victims were lured in with false promises of work abroad, charged exorbitant \"recruitment fees\", then forced to rope in friends and family in exchange for improved conditions. Authorities in Mali identified 47 Nigerian women who had been trafficked into the country for sexual exploitation. Others discovered during the operation include child labourers working in a glass factory in Belize, and a young girl sold to a 73-year old man in El Salvador. The operation also targeted illegal migration, with multiple high-risk sea departures intercepted. One such sailing involved 245 migrants departing from Senegal, with further cases recorded off the coasts of Guinea-Bissau and Morocco. Algerian authorities intercepted a large inflatable boat carrying 71 people of various nationalities, including seven children. Border checks played a part, with Romanian officials uncovering a cache of military hardware on an incoming truck declared to be carrying metal parts. Read more:Trafficking victim Scarlett describes abuse she endured aged 14'Ordering a woman to exploit as easy as ordering a takeaway' The discovery at the Moldovan border intercepted rocket launchers, grenade launchers, ammunition and combat drone components, leading to two individuals being detained in Moldova, and a third in Romania. To co-ordinate the global Interpol operation, special units were established four countries: Algeria, El Salvador, Laos, and the UK. It detected 12,992 irregular migrants across the participating countries, leading to more than 720 new investigations. Interpol secretary general Valdecy Urquiza said: \"The level of enforcement action highlights strong cooperation, but the wider trends which have been revealed are just as important. \"Criminal networks are evolving, exploiting new routes, digital platforms and vulnerable populations. \"Identifying these patterns allows law enforcement to anticipate threats, disrupt networks earlier and better protect victims.\""
    },
    {
        "title": "At least 15 dead and hundreds rescued after ferry sinks in southern Philippines",
        "description": "At least 15 people have died after a ferry sank in the southern Philippines overnight.",
        "url": "https://news.sky.com/story/at-least-15-dead-and-hundreds-rescued-after-ferry-sinks-in-southern-philippines-13499059",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-philippines-baluk-baluk-island_7145848.jpg?20260126042601",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-26 04:12:00",
        "Headline": "Coast guard officials said authorities had managed to rescue at least 316 of those onboard the M/V Trisha Kerstin 3, but 28 remain missing.",
        "Content": "At least 15 people have died after a ferry sank in the southern Philippines overnight. Coast guard officials said that the M/V Trisha Kerstin 3 was sailing to southern Jolo island in Sulu province from the port city of Zamboanga when it apparently encountered technical problems. The inter-island vessel sank near Baluk-Baluk in Basilan province just after midnight local time, and was carrying 332 passengers and 27 crew members. Coast Guard Commander Romel Dua, of Southern Mindanao District, told Reuters news agency that authorities had managed to rescue at least 316 passengers, but added 28 remain missing. He added an investigation was under way to determine the cause of the incident. Military aircraft and vessels were deployed to assist with rescue efforts. Mujiv Hataman, Basilan governor, told DZBB Radio that most survivors were doing well, but several older passengers needed emergency medical care. Read more from Sky News:Iran unveils mural warning US not to launch military strikeDozens missing after Indonesia landslide kills at least 25 people Seafaring accidents are common in the Philippines because of frequent storms, badly maintained vessels, overcrowding and patchy enforcement of safety regulations, especially in remote provinces."
    },
    {
        "title": "Xi's purge of top general paints a fascinating picture of power and control within a ruthless and unforgiving system",
        "description": "In a bombshell announcement, China's Ministry of Defence has said it is investigating General Zhang Youxia, China's most senior general and a man who was second only to Xi Jinping himself on China's top military decision-making body.",
        "url": "https://news.sky.com/story/xis-purge-of-top-general-paints-a-fascinating-picture-of-power-and-control-within-a-ruthless-and-unforgiving-system-13499060",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-china-military-zhang-youxia_7145853.jpg?20260126054130",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-26 04:43:00",
        "Headline": "General Zhang Youxia's removal marks the most senior scalp taken in a spate of high-level military purges. He was a close and longstanding ally of Xi Jinping, and his ousting says something remarkable about the lengths the president is willing to go.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n In a bombshell announcement, China's Ministry of Defence has said it is investigating General Zhang Youxia, China's most senior general and a man who was second only to Xi Jinping himself on China's top military decision-making body. His removal marks the most senior scalp taken in a spate of high-level military purges, and it's sparked frenzied speculation about what's caused his downfall and what it all says about the consolidation of Xi's absolute control of China's armed forces. Saturday's announcement explained how Zhang and another senior general, Liu Zhenli, are under investigation for \"serious violations of party discipline and law\". Often in these cases, that's a sort of code for \"corruption\", but there are a number of indicators that this time, there might be more to it. Firstly, it's hard to overstate what a big deal this is. It's not just the seniority of Zhang's rank that makes it extraordinary. Zhang the latest in a series of military purges Yes, he was the top military figure in China behind Xi himself, he had a key role in the modernisation of the military and was one of the few Chinese generals with actual combat experience. But he was also a close and longstanding ally of President Xi, they grew up in similar circles, as both men are the sons of communist revolutionary heroes, and he has for some time been considered Xi's most trusted military man. His ousting says something remarkable about the lengths the president is willing to go to overhaul what is being billed as the \"rot\" of corruption in his forces. Indeed, Xi's military purges on the grounds of corruption have been seismic and unrelenting. In just the last few years, dozens have been ousted and have disappeared from public view. They include men who served in the army, navy, air force, paramilitary police and \"Rocket Force\" - China's missile and nuclear command force. The probes have taken down generals, commanders, a defence minister and now a total of five of the seven-man Central Military Commission (CMC), China's top decision-making body. It means the group that makes China's most important military calls now comprises just Xi Jinping and one other, an overhaul matched only by the purges seen under Mao Zedong, according to analysts. But whether corruption is the whole story here is really the million-dollar question, and because China's elite politics is such a notorious black box, there is space for speculation to run rife. And run rife it has. Rumour has swirled, for instance, that Zhang and Liu were involved in a high-level coup plot to take down Xi. And reporting by the Wall Street Journal suggests that top figures have been briefed that Zhang was passing China's nuclear secrets to the US. Both would be utterly astonishing if true, both have good reasons to be relatively unlikely, and both are next to impossible to substantiate. But there are some indications that this latest purge might be about more than just corruption. A fast-moving situation First is the speed of the announcement. In previous cases like this, generals have disappeared from the public eye for months before their alleged crimes are announced; this time, it was just a matter of days. Has something so bad happened that the system felt it needed to get ahead of the narrative? And second, is some of the language being used. A Sunday editorial in the PLA Daily, a military publication, said the two men \"seriously fuelled political and corruption issues that affect the Party's absolute leadership over the military\". The hint, perhaps, is that Xi felt in some way personally undermined. And that is perhaps the most intriguing question within all this: what do Xi's military purges say about his power? And what do they say about his ultimate military ambitions, especially in relation to Taiwan? Could Taiwan be the motivation? On the first point, China watchers were initially divided. Particularly in the early stages of these purges, some maintained that they might signal a paranoia, a loss of control or a weakened leader grappling with a military too inclined to have its own ideas. But as time has passed and the scalps have mounted, it feels more likely that the opposite might be true. Perhaps instead, Xi's actions speak to a complete confidence in his position of absolute power; that he can take down even someone as mighty as Zhang and consolidate his total control of the military in the knowledge that no one can or will challenge him. And Taiwan might well be the motivation. Xi has long maintained that China could retake the self-governing island by force if necessary. It is certainly feasible that he perceives an entrenched system of corruption as genuinely compromising the military's ability to achieve that goal - that this is all about making his army truly battle-ready. Read more:Everything we know about China's new 'super embassy'Sky News China team forced into cars and camera seized And while analysts, including from the Pentagon, have judged that the leadership vacuums will likely compromise the military's effectiveness in the short term, the medium term could look quite different. Indeed, younger generals being promoted to replace the old guard are more likely to be of the more highly nationalistic \"wolf warrior\" brand, perhaps less likely to caution restraint. The reality is that we will probably never know the true reasons behind this historic overhaul or the detail of how it played out, but it nonetheless paints a fascinating picture of power and control within a ruthless and unforgiving system."
    },
    {
        "title": "'Public face' of Trump's Minneapolis crackdown set to leave city - as president's tone shifts",
        "description": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News.",
        "url": "https://news.sky.com/story/public-face-of-trumps-minneapolis-crackdown-set-to-leave-city-as-presidents-tone-shifts-13499461",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gregory-bovino-border-patrol_7146710.jpg?20260126205126",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-26 23:37:00",
        "Headline": "There has been a change in tone from the White House regarding the situation in Minneapolis amid mounting public backlash, including from Donald Trump himself.",
        "Content": "The border commander who has emerged as the face of the Trump administration's ICE operation in Minneapolis is poised to leave the city, reports Sky's US partner network NBC News. Gregory Bovino and some of his immigration enforcement agents are set to depart on Tuesday, a White House official and another government figure familiar with the decision said. Latest updates from Minneapolis It follows widespread backlash among the American public, leading Democrats, and a growing number of Republicans over the fatal shooting of Alex Pretti on Saturday - and the response to it. The 37-year-old nurse, a US citizen, was shot dead in an altercation with ICE agents - the second such incident in the city this month, following the death of Renee Good. Top officials including Mr Bovino, Homeland security secretary Kristi Noem, and Trump adviser Stephen Miller tried to paint Mr Pretti as a threat to the agents, prompting a furious response from his family. Ms Noem has claimed he approached officers with a handgun and acted violently towards them, but several pieces of footage analysed by Sky News counters that narrative: 'Border tsar' could take over operation The removal of Mr Bovino from Minneapolis would be a \"major step\", Sky's US correspondent Martha Kelner said. He has become the \"public face\" of Donald Trump's immigration crackdown, she added. The president's \"border tsar\", Tom Homan, is set to arrive in the city shortly, according to White House press secretary Karoline Leavitt, who said he was \"doing an exceptional job\". Trump touts calls with senior Democrats There has been a marked change in tone from the White House regarding Minneapolis amid the public backlash, including from the president himself. NBC reports, citing administration officials, that Mr Trump is \"concerned\" about the sustainability of the operation. \"The visuals were not playing well. He understands TV. … He saw it for himself,\" said a Republican lawmaker who was granted anonymity to speak candidly. Mr Trump is to meet the city's mayor, Jacob Frey, on Tuesday. \"I just had a very good telephone conversation with Mayor Jacob Frey, of Minneapolis,\" he said on Truth Social. \"Lots of progress is being made!\" Mr Trump made similarly positive noises about an earlier conversation with Minnesota Governor Tim Walz, another Democrat who has called for ICE to leave Minneapolis. \"It was a very good call, and we, actually, seemed to be on a similar wavelength,\" the president said. Read more from Sky News:Minnesota isn't Belfast but the warning signs are there Among the senior Republicans to call for a change in approach are Senator Ted Cruz, who said on his podcast: \"I would encourage the administration to be more measured.\" The scenes in Minneapolis have also been condemned by former Trump ally Marjorie Taylor Greene, who split with the president over his handling of the Epstein files. Officials who spoke to NBC insisted Mr Trump remained committed to cracking down on immigration and fraud."
    },
    {
        "title": "'I am not a Nazi' - Kanye West blames brain injury for antisemitism ",
        "description": "Kanye West has denied he is a Nazi and taken out a full-page advert in the Wall Street Journal to apologise for antisemitic comments.&#160;",
        "url": "https://news.sky.com/story/i-am-not-a-nazi-kanye-west-blames-brain-injury-for-antisemitism-13499377",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kanye-west_7146681.jpg?20260126202033",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-26 20:00:00",
        "Headline": "West says: \"I regret and am deeply mortified by my actions in that state, and am committed to accountability, treatment, and meaningful change\".",
        "Content": "Kanye West has denied he is a Nazi and taken out a full-page advert in the Wall Street Journal to apologise for antisemitic comments.  In the full-page advert, titled 'To Those I've Hurt', the controversial star insisted he was not asking for \"sympathy or a free pass\". Instead, the artist now known as Ye, said he was looking to earn forgiveness from the public. The rapper also apologised to the black community, saying he had let it down. West deleted his X account in February of last year after suffering a backlash over a series of offensive remarks, including \"I love Hitler\" and \"I'm a Nazi\". West's Yeezy online shopping platform was also taken down after it began selling T-shirts adorned with swastikas. In May last year, the 48-year-old released a single titled 'Heil Hitler', a move that resulted in Australia, where the star's wife, Bianca Censori, is from, cancelling his visa. Adidas ended a partnership with the rapper over antisemitic comments he made in 2022, leaving the company with a mountain of West's popular brand of Yeezy trainers unsold until last year. West also apologised for his remarks in 2023. However, in the newspaper advert, West now insists: \"I am not a Nazi or an antisemite. I love Jewish people\". He blamed his behaviour on his bipolar-1 disorder, something he said resulted from a car accident 25 years ago. He says his brain injury from the crash wasn't properly diagnosed until 2023, something he calls a \"medical oversight [that] caused serious damage to my mental health and led to my bipolar type-1 diagnosis\", which he received in 2016. \"In early 2025, I fell into a four-month-long manic episode of psychotic, paranoid and impulsive behaviour that destroyed my life,\" West said. \"I lost touch with reality. Things got worse the longer I ignored the problem. I said and did things I deeply regret.\" He added: \"There were times I didn't want to be here any more.\" The rapper said that he'd treated \"some of the people I love the most\" the worst, saying he \"became detached from my true self\". Read more from Sky News:UK loses WHO measles elimination statusStorm Chandra forecast to bring snow, strong winds and heavy rain West said he hit rock bottom a few months ago and that his wife encouraged him to get help. He is now \"pouring my energy into positive, meaningful art: music, clothing, design and other new ideas to help the world\". \"One of the difficult aspects of having bipolar type-1 are the disconnected moments - many of which I still cannot recall - that lead to poor judgement and reckless behaviour that (often) feels like an out-of-body experience.\"I regret and am deeply mortified by my actions in that state, and am committed to accountability, treatment, and meaningful change.\" The letter ends with West saying, \"I write today simply to ask for your patience and understanding as I find my way home. With love, Ye.\" A spokesperson for Campaign Against Antisemitism said: \"It's hard to keep up with Kanye West's apologies and relapses. A heartfelt apology is nice but at the end of the day it's meaningless if it's followed by more of the same, which is what has happened before. Time will tell whether he is really turning a corner or just going around in circles. \"We hope for his sake - and for Jewish people worldwide who have enough antisemitism to worry about right now - that he will show some real change. That might start with telling his online followers, whose number is greater than there are Jews in the world, why antisemitism is so corrosive.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Claire's collapse into administration renews high street fears",
        "description": "The British operations of Claire's, the accessories retailer, have collapsed into administration just four months after their last brush with insolvency, putting more than 1,000 high street jobs at risk.",
        "url": "https://news.sky.com/story/claires-collapse-into-administration-renews-high-street-fears-13499342",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-claires-claires-accesories_7005467.jpg?20250830115912",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-26 18:12:00",
        "Headline": "More than 1,000 retail jobs have been imperilled by the appointment on Monday of insolvency practitioners at Claire’s just four months after it was rescued, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The British operations of Claire's, the accessories retailer, have collapsed into administration just four months after their last brush with insolvency, putting more than 1,000 high street jobs at risk. Sky News understands that insolvency practitioners from Kroll were formally appointed as administrators to Claire's UK and Ireland earlier on Monday. It comes three weeks after Sky News revealed that the chain's owner, Modella Capital, filed a notice of intention to appoint administrators to both Claire's and TOFS, the discount retailer it also acquired last year. In a statement on Monday evening, Kroll said: \"Philip Dakin, Benjamin Wiles and Janet Burt of Kroll Advisory Ltd were appointed as joint administrators of CAUKI Ltd on 26 January 2026. \"The company is continuing to trade during this period.\" Modella bought the company last September, several months after Claire's had filed for insolvency in both the US and the UK. Retail analysts are sceptical that a buyer will emerge for many of the remaining 156 Claire's stores in Britain and Ireland. \n                  Tech rental subscription service Raylo clicks on £30m fundraising\n                 \n                  UK bank fined for breaking Russia sanctions\n                 \n                  South East Water action group demands boss’s immediate removal\n                 Sources close to the situation said earlier this month that a combination of government policy - with a significantly increased tax burden placed on the retail industry - and demands from landlords to take back swathes of Claires' shops, had rendered the future of the chain unviable. The retail industry continues to face significant headwinds, with chains including Poundland having closed significant numbers of shops. Read more from Sky News: UK bank fined for breaking Russia sanctions10 shots in 5 seconds: How did Minneapolis shooting unfold? Modella also owns businesses including WH Smith's historic high street estate, which it has rebranded as TG Jones, as well as Hobbycraft. Claire's had previously traded from nearly 300 shops in the UK, but has been hit by changes in consumer behaviour among its traditional teenage customer base. Significant numbers of jobs were lost in restructuring processes prior to Modella's purchase of the business."
    },
    {
        "title": "Tech rental subscription service Raylo clicks on £30m fundraising",
        "description": "A consumer tech rental service which has struck partnerships with Apple, Dyson and Sony's PlayStation brand has landed &#163;30m in new financial backing and an alliance with LG, the Korean electronics giant.",
        "url": "https://news.sky.com/story/tech-rental-subscription-service-raylo-clicks-on-16330m-fundraising-13499275",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mobile-phone-file-pic_7146442.jpg?20260126155006",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-26 15:41:00",
        "Headline": "Founded in 2018, Raylo has product partnerships with companies including Apple, and has now closed a £30m financing backed by the US financial giant Citibank, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A consumer tech rental service which has struck partnerships with Apple, Dyson and Sony's PlayStation brand has landed £30m in new financial backing and an alliance with LG, the Korean electronics giant. Sky News has learnt that Raylo, which was founded in 2018, will announce on Tuesday that the American financial services giant Citibank has become a shareholder in the business. Citibank has led a £10m equity injection in the business, while Raylo has also secured an additional £20m of debt financing from NatWest Group, the high street lender. The funding round values Raylo at £150m on a post-money basis, according to the company. It takes the total amount of debt and equity funding raised by the company to more than £180m, and is aimed at helping it prepare to launch in the US in the second half of the year. Raylo's new partnership with LG, which will allow UK customers to access premium TV and audio products, underlines the British company's conviction that both consumers and multinational tech brands are shifting towards subscription-based models. \"Electronics brands are increasingly moving beyond one-time sales and toward subscription-first models,\" Karl Gilbert, Raylo co-founder and chief executive, said. \n                  Apple's AI chief steps down as company falls behind in tech race\n                 \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \"Our partnership with LG marks a key step in that transition, delivering clear value for both electronics brands and customers whilst expanding our category offering with a true global leader. \"As we prepare for global expansion, this momentum reflects strong confidence from leading brands and investors in our ability to scale Raylo's subscription model across categories and markets.\" Read more business news:UK bank fined for breaking Russia sanctionsNHS-licensed digital platform lands $25m funding boost Raylo's other financing partners include Macquarie and Channel 4 Ventures, which has struck a series of media-for-equity deals."
    },
    {
        "title": "UK bank fined for breaking Russia sanctions",
        "description": "Bank of Scotland (BoS) has been fined by a regulator for breaking sanctions related to Russia's war in Ukraine.",
        "url": "https://news.sky.com/story/uk-bank-fined-for-breaking-russia-sanctions-13499183",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-royal-bank-of-scotland_7079300.jpg?20251111151502",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-26 12:10:00",
        "Headline": "The bank's parent firm says it flagged the \"isolated\" incident to the authorities and that steps have been taken to ensure no repeat.",
        "Content": "Bank of Scotland (BoS) has been fined by a regulator for breaking sanctions related to Russia's war in Ukraine. The Office of Financial Sanctions Implementation (OFSI) said ‌a penalty of £160,000 had been imposed over financial transactions dating back to 2023. The body said the bank processed 24 ​payments in February that year totalling £77,383 to and from a personal ‌current account ⁠held by a UK-designated ‌person. That person was not identified. Money latest: Criminal barrister talks about 'painfully low' salaries OFSI, which oversees compliance with all sanctions levied against Russia on behalf of the UK government, said it had concluded that the ​bank breached prohibitions on dealing with, and making funds available to, a sanctioned person. Bank of Scotland said it had flagged the issue to the UK authorities the following month. The penalty for Bank of Scotland, which is part of Lloyds Banking Group, was cut by 50% thanks to it voluntarily disclosing the breaches a month after the payments were made. A spokesperson for its parent firm responded: \"Lloyds Banking Group takes its regulatory responsibilities extremely seriously. \"We acted swiftly and transparently, proactively referring this one-off, isolated matter to the Office of Financial Sanctions Implementation and working closely with them throughout. \"OFSI has recognised our prompt voluntary disclosure, resulting in the maximum possible reduction of the penalty. \"We have further strengthened our controls to ensure we continue to meet the highest standards of risk management and governance.\""
    },
    {
        "title": "South East Water action group demands boss’s immediate removal",
        "description": "A community action group in Tunbridge Wells is demanding the &#8220;immediate&#8221; sacking of South East Water&#8217;s chief executive after weeks of outages which have left tens of thousands of customers without water.",
        "url": "https://news.sky.com/story/south-east-water-action-group-demands-boss8217s-immediate-removal-13499082",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-south-east-water-bottles_7134135.jpg?20260113123450",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-26 06:37:00",
        "Headline": "Dry Wells Action tells Chris Train, the ailing utility’s chairman, that he and CEO David Hinton have “presided over an unprecedented deterioration in the solvency of the company” in a letter seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A community action group in Tunbridge Wells is demanding the “immediate” sacking of South East Water’s chief executive after weeks of outages which have left tens of thousands of customers without water. Sky News has seen a letter from Dry Wells Action, which was formed by residents and businesses in the Kent town, to Chris Train, South East Water's chairman, demanding answers about the company's solvency, infrastructure spending and refusal to engage with stakeholders during the biggest crisis in its history. \"You have comprehensively lost the trust of Tunbridge Wells customers,\" the letter, sent on Monday morning, said. \"Only by providing us with answers and by sacking your CEO [David Hinton] can you even begin to restore public confidence.\" Money latest: Criminal barrister talks about 'painfully low' salaries The letter underlines the rising tide of public anger about the privately owned company's performance in recent months, which has led to doctors' clinics being cancelled, school closures and businesses facing substantial financial losses. Dry Wells Action's committee's letter, which follows its first public meeting, held last week, lambasts Mr Train for the absence of meaningful communication during the crisis. \n                  Claire's collapse into administration renews high street fears\n                 \n                  Tech rental subscription service Raylo clicks on £30m fundraising\n                 \n                  UK bank fined for breaking Russia sanctions\n                 \"We note that the reason given for not attending our public meeting was that you are subject to regulatory investigation (as you have been since 2023, however), and that you have informed the Council that it is \"too early\" to give answers,\" the committee wrote. \"This refusal to submit to public scrutiny, along with the persistent evasion of the national media by your chief executive, demonstrates an appalling lack of accountability by your failing organisation.\" It added that South East Water would also not attend a Borough Council committee meeting scheduled for Monday evening, further deepening public mistrust of the company. Mr Hinton, who has faced swingeing criticism over his performance and remuneration, was paid more than £450,000 last year. Following an appearance in front of a parliamentary select committee this month, several MPs called on him tor resign, while Emma Reynolds, the environment secretary, has urged the water regulator to review the company's operating licence. South East Water, like many of the other privatised water utilities, has seen its balance sheet loaded with debt while shareholders have received hundreds of millions of pounds in dividend payments. In Dry Wells Action's letter, the group accused Mr Train and Mr Hinton of \"appear[ing] to have presided over an unprecedented deterioration in the solvency of the company, with the result that your shareholders last year had to inject £200m in new equity to reduce borrowings\". \"Over the last 10 financial years, the board of SEW has voted to pay £249m in dividends to your shareholders, whilst the profitability of the company has collapsed and your debt has risen from £943m to £1.33bn.\" It was, the group said, a \"sorry tale of financial mismanagement, poor leadership, and underinvestment in infrastructure\". The crisis at South East Water comes ahead of a shake-up of the water industry's regulation, with Ofwat due to be scrapped and replaced by a new watchdog. A white paper published by ministers this month pledged to overhaul the industry amid growing public and political anger exacerbated by the financial travails of Thames Water, which is fighting to avoid temporary nationalisation. Dry Wells Action's letter to South East Water demanded answers to questions within five working days about its financial resilience, including how it intends to repay a £120m revolving credit facility by June while maintaining the confidence of its lenders. \"Is your company still solvent or should it go into administration to reduce its debt? With the scale of your interest costs, how do you believe you are able to generate sufficient profit to invest in improving the supply to our town without substantial further increases in customer bills?,\" the group said. It also accused the company of \"woeful communication with customers, which to date is principally via short text messages, often with false promises, inaccurate information and no means of engagement\". The letter urged Mr Train to review the level of compensation due to be paid to businesses affected by the outages, saying the proposed sums were inadequate. The letter was copied to other stakeholders, including government ministers, Ofwat and NatWest Group, whose pension fund is a 25% shareholder in South East Water. The bank itself is not involved in the management of the stake. South East Water has been contacted for comment."
    },
    {
        "title": "Gold rushes past record $5k in hedge against Trump",
        "description": "The price of gold has surged past the record $5,000 per ounce level and shows little sign of easing back as investors continue to seek shelter from uncertainties  connected to Donald Trump.",
        "url": "https://news.sky.com/story/gold-rushes-past-record-5k-in-hedge-against-trump-13499062",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gold-bars-bullions_6889134.jpg?20250417160616",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-26 05:23:00",
        "Headline": "The commodity has been in high demand since Trump 2.0 began given the wealth of uncertainties and disruption the president has unleashed across the global economy.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The price of gold has surged past the record $5,000 per ounce level and shows little sign of easing back as investors continue to seek shelter from uncertainties  connected to Donald Trump. The commodity - a traditional safe haven for investors in troubled times - has been in high demand during the US president's second stint in the White House. It's become seen as a valuable hedge against volatility caused by the likes of on-off trade wars and other threats. Gold recorded a 64% spike last year. Money latest: Criminal barrister talks about 'painfully low' salaries Major banks have, in recent weeks, been rushing to upwardly adjust their forecasts for gold prices during 2026 given the extraordinary run of events seen so far. Gold has been particularly sensitive to US military action in Venezuela, the threat of strikes against Iran, rows between Mr Trump and America's NATO allies over Greenland and, most recently, his renewed tariff vow against Canada. Also unsettling markets has been a slide in the yen, with investors expecting policy intervention by the US and Japanese central banks to stabilise the latter's currency. \n                  'Public face' of Trump's Minneapolis crackdown set to leave city - as president's tone shifts\n                 \n                  Has Trump realised he's made a big mistake in Minneapolis?\n                 \n                  Trump threatens Canada with 100% tariff over China trade deal\n                 The yen has been standing at multi-decade lows against the pound and record lows versus the euro in shifts all connected to Japan's ultra low interest rates. Another factor underpinning demand for gold is the market uncertainty over the future of the US central bank, the Federal Reserve. Its latest rate-setting decision this week is being overshadowed by a criminal investigation of its chair Jerome Powell, whose term ends in May. There is speculation in US media that Mr Trump, who is frustrated over the pace of interest rate cuts, will announce his nomination for Mr Powell's successor this week. The name has the potential to pour accelerant over market worries related to the bank's independence. Read more:Special relationship turns toxic after NATO troop commentsIran unveils mural warning US not to strike Ipek Ozkardeskaya, senior analyst at Swissquote, said: \"There has been no new escalation over the weekend - no fresh breach of international law, no invasion, no immediate military threat. \"The US did, however, threaten Canada with 100% tariffs, after Mark Carney approached China last week, defying the White House - a reminder that trade tensions remain alive and well. \"Beyond that, the news flow is thin. Yet the bid for precious metals suggests that market stress is far from over.\""
    },
    {
        "title": "'The pay is painfully low': Criminal barrister on salaries and why no one is being honest about the justice system",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to barrister Benjamin Knight, from Central Chambers, Manchester, and Liberal Chambers, London.",
        "url": "https://news.sky.com/story/the-pay-is-painfully-low-criminal-barrister-on-salaries-and-why-no-one-is-being-honest-about-the-justice-system-13499173",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-benjamin-knight-barrister_7145872.jpg?20260126062725",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-26 11:32:00",
        "Headline": "Making friends with opponents and the reality behind the justice system  - a barrister gives the Money blog an exclusive insight in this week's careers feature.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to barrister Benjamin Knight, from Central Chambers, Manchester, and Liberal Chambers, London. Take-home pay can be painfully low... Early on, a junior criminal barrister might bill something like £10,000 to £50,000 in gross fees. Even that can be misleading. Some fees are never collected properly, some get written-off and none of it accounts for chambers contributions, travel, insurance, practising costs and tax. Once you factor in the hours, take-home can be painfully low. At the top end, you sometimes hear headlines about criminal barristers earning millions. In reality, the handful who might gross seven figures tend to be very senior KCs, and the eye-watering figure can reflect years of work on a single huge case alongside everything else. Crime income is also unpredictable year to year, which makes ordinary life planning oddly difficult. People think nothing of ringing at 10pm... A normal week is 50 to 60 hours but a trial week can be double that. Late nights are common, not because barristers love the grind, but because you can spend the whole day in court and then start your second day of work at night: prepping the next day of trial while also keeping other cases moving. Add late disclosure and last-minute instructions and you learn to take breaks where you can rather than where you are \"supposed\" to. Criminal barristers joke that we do not retire; we just drop dead in our wigs... The more realistic version is that people keep going while they are still sharp and want to do it. Some move to the bench (become judges). I am Generation X. Retirement has always felt like a slightly fictional concept unless you end up with a decent pension route. For many, that's a lot of the attraction of becoming a judge. Find tips and personal finance news in the Money blog You can be friends with opponents, absolutely... sometimes close friends. Professionalism comes first. You are not there to be mates; you are there to do your job properly. Cordial is the default. Friendly is common. Hostile is usually a sign someone is doing it badly. There is a social scene, but it is not the boozy fantasy some dramas sell. People are busy. There are events, and there are also WhatsApp groups because of course there are. Is it competitive? At the very junior end there can be a bit of swagger, and pupils can be hilariously keen. But most criminal barristers are too busy trying to survive the diary to play status games. The job can still be lonely... especially long cases away from home, but the bar can also be very good at rallying when someone needs help, provided people actually ask. There should always be a flicker of adrenaline before you address a judge or jury... If there is not, you are either not paying attention or you have gone numb. I work from bullet points and themes, not scripts. If I write it all out, I end up editing myself while I speak anyway. Your approach changes with experience. Good advocacy is listening, especially in cross-examination, where you need to plan ahead and adapt to the answer you did not quite expect. Judge advocacy and jury advocacy are different... Juries are usually listening fresh. Judges have heard versions of the same submissions for years, and occasionally the blinkers are on too tight, so you have to nudge them back without sounding like a prat. If I am wrong, I concede it immediately. Credibility is hard-won and easily lost, so you guard it. The brutal bit is getting in... Pupillage is fiercely competitive and expensive to reach. The real end goal is not letters after your name... It is being instructed in good-quality work you are suited to and reaching the point where you walk into court and think: \"I am supposed to be here.\" Also, trying to banish imposter syndrome, which is far more common at the bar than the public would guess. One case always reminds me this job is not only about winning arguments... Early in my career, I was doing prison law work. A client asked me to see his cellmate, who was illiterate and unable to write. The cellmate had a very old conviction for a serious sexual offence, said to have happened when he was a child. When I met him, he was frighteningly unwell and clearly being exploited in prison. He was being used \"as a reward\" for other prisoners, among other things. I tried to investigate an appeal, but the case was so old that much of the paperwork was gone. What I could do was focus on getting him out of prison and into secure healthcare. We managed it. Over time, he stabilised physically, then mentally, and eventually rebuilt something like a life. One Christmas Eve I visited him in the medical unit and he handed me a Christmas card. A nurse told me it was the first card he had ever written to anyone. I still have it in my desk drawer. I was part of the longest jury trial in English history... It was an endurance test for everyone, including the jury. What it proved to me is that juries can cope perfectly well with complex, document-heavy cases if you present them properly. That trial is about as good a rebuttal as you could want to the myth that juries cannot manage complexity. I have been assaulted in the course of work... including by defendants, and once by a party in family proceedings when I had a mixed practice. Emotions run high and people can lash out. I have also had an incident after a case where I felt unsafe travelling home and reported it. It involved a car and the M62… In some types of work, you do become more cautious leaving court buildings. Online hostility exists, too. The comment sections can be feral. I stopped even reading that stuff years ago. People sometimes forget that representing someone is not endorsing what they are accused of. Attacking lawyers for doing their job is never justified. Historically, the bar was dominated by affluent, cisgendered, heterosexual, white men, and visibility matters... If you cannot see people like you, it is easy to assume you do not belong. That is true for care leavers and the neurodiverse, and it's true for openly gay and trans people as well. We made progress, and then access became harder again as legal aid and working conditions deteriorated. The debt is huge, the early years can be financially brutal and people sensibly decide not to gamble their lives on it. That harms everyone, because it shrinks the pool not just of advocates but of future judges. If we want the best people, and a judiciary drawn from a broad range of lived experience, the system has to be viable for people who do not have a financial safety net. The criminal justice system is fairer than people think... and I do think juries take their oaths seriously. I have seen verdicts that could only have been reached by careful, forensic thinking. But bias exists. Some of it is unconscious. You can see it in patterns and outcomes. So yes, the system tries to be fair, and often is, but it is not perfect and we should not pretend it is. What I do not accept is that the answer to unfairness is to weaken one of the best safeguards we have against it: the jury. Juries are not what is clogging the system in most cases, so removing them does not solve the backlog. If you want fewer cracked trials, do the boring things properly: disclosure early and properly, case management that is real rather than performative, and resources and training for the institutions that keep failing at basics. I would start with... the lack of adequate administration units in police forces and the shrinking of the CPS - as well as the back-covering culture in both. Stop with the \"walked free\" nonsense... One thing I'd change is honest reporting. If you report a sentence, publish the sentencing remarks and context. We have the cab rank rule... If I am competent, available and properly instructed, I should not pick and choose clients based on popularity or my personal feelings. The rule exists so representation does not become a luxury only for the likeable. If a client tells me they did it, I cannot mislead the court... I can test whether the prosecution can prove what it alleges, or more commonly advise a guilty plea and ensure the sentence is based on what was actually done, not on exaggeration. Safe convictions and lawful sentences matter. More from this series:Secrets of a cabbieI make thousands photographing celebsI'm a child psychiatrist One case that hit me later involved an indecent images offence... The material was extremely serious. He pleaded guilty and was sentenced properly. Afterwards, it emerged within his family that he had been abused as a child in a way that mirrored what was found in the images, and that others in the family had also been victims. It did not excuse the offence, but it changed my understanding of it. It was a grim reminder that the world is rarely as simple as \"victims and monsters\". He refused to advance it as mitigation but he was plainly trying to make sense of what had been done to him for years, from infant to adult. A piece of advice for anyone wanting to be a barrister... guard your reputation early. Social media has a long memory. If I could change one thing about the justice system... it would be more honesty, particularly the relationship of honesty between the justice system, the media and the public. The public often does not understand what happens in court. The press increasingly chases outrage and clicks. Lawyers are terrible explainers of their own cause and often constrained from speaking about individual cases. So we end up with a distorted public conversation - anything short of the harshest outcome becomes \"getting away with it\". We need political courage and a more grown-up debate: what outcomes do people actually want in real situations - punishment, rehabilitation, diversion - and what are they willing to pay for? Without that honesty, every other reform sits on sand. Any plonker can call to be \"tougher on…\". The reality is that we are all thinking of these things all the time, but reality is not so binary. There are no monsters. There are people who may (or may not) have done monstrous things. A justice system cannot be just about what lets people sleep easier in their beds."
    },
    {
        "title": "NHS-licensed digital platform Evaro lands $25m funding boost",
        "description": "An NHS-licensed digital healthcare platform which says it serves more than two million patients will this week announce a $25m funding boost.",
        "url": "https://news.sky.com/story/nhs-licensed-digital-platform-evaro-lands-25m-funding-boost-13499196",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-evaro-kleinman_7146237.jpg?20260126124549",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-26 12:45:00",
        "Headline": "Founded in 2018, the company has raised a Series A round led by AlbionVC as it targets the treatment of 10 million patients over the next three years, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An NHS-licensed digital healthcare platform which says it serves more than two million patients will this week announce a $25m funding boost. Sky News has learnt that Evaro, which offers next-day prescription services for contraceptive and sexual health products as well as scores of minor conditions, has landed an injection of capital from investors led by AlbionVC. The Series A round is also being backed by Simplyhealth Ventures, Exceptional Ventures, Cornerstone VC and BBI. Evaro has partnerships with Clue, a period-tracking app, and Lovehoney, a sexual wellness retailer. Money latest: Criminal barrister talks about 'painfully low' salaries The company's new funding will accelerate its healthcare-as-a-service model in three core areas: consumer brands seeking new revenue streams; healthcare organisations expanding digital capacity, and employers offering health benefits to their workforces. Evaro says it helps alleviate pressure on the NHS at a time of lengthy waiting lists for appointments and treatment. \n                  Claire's collapse into administration renews high street fears\n                 \n                  Tech rental subscription service Raylo clicks on £30m fundraising\n                 \n                  UK bank fined for breaking Russia sanctions\n                 \"When a third of people are waiting over a week just to see their GP, it's time to think through alternative solutions that help people get the care they need while supporting NHS capacity,\" said Dr Thuria Wenbar, Evaro co-founder and chief executive. \"We're making healthcare as accessible as online banking, and this funding lets us prove that model works at scale.\" The company was founded in 2018 by Dr Wenbar and husband Oskar. Read more from Sky News:UK bank fined for breaking Russia sanctionsGold rushes past record $5k in hedge against Trump \"We've seen embedded finance transform banking, and Evaro is now driving the embedded health revolution,\" said Christoph Ruedig, partner at AlbionVC and new Evaro board member. \"This now allows consumer brands to enter the healthcare space safely, unlocking massive latent demand while relieving pressure on the NHS.\" Evaro, which did not disclose its new valuation, said it aimed to serve 10 million patients over the next three years."
    },
    {
        "title": "PM defends Burnham block saying it will allow focus on 'must win' elections",
        "description": "The prime minister has insisted his party's decision to not allow Andy Burnham to run in an upcoming by-election is correct, because doing so would \"divert our resources\".",
        "url": "https://news.sky.com/story/pm-defends-burnham-block-saying-it-will-allow-focus-on-elections-we-must-win-13499135",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-andy-burnham_7144964.jpg?20260125140158",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-26 09:59:00",
        "Headline": "Sir Keir Starmer explains the Labour Party ruling committee's decision to prevent Andy Burnham from running in an upcoming by-election.",
        "Content": "The prime minister has insisted his party's decision to not allow Andy Burnham to run in an upcoming by-election is correct, because doing so would \"divert our resources\". An election is set to be held in the Greater Manchester seat of Gorton and Denton, after Andrew Gwynne decided to stand down as an MP. Mr Burnham, the mayor of Greater Manchester, asked Labour for permission to run for the seat but the party's ruling committee - which includes the PM - voted against him doing so. Winning the by-election and returning to Westminster as an MP could have allowed Mr Burnham to mount a leadership challenge against Sir Keir Starmer. Politics latest - follow live But on Sunday, Labour's National Executive Committee (NEC) voted against Mr Burnham resigning his role as mayor and running, by eight to one, with Home Secretary Shabana Mahmood - who chairs the NEC - abstaining. Defending the decision this morning, Sir Keir praised the mayor, saying he is doing a \"great job\" - but insisted allowing him to run for a Westminster seat would \"divert our resources\" away from campaigns in May elections. \n                  Why Andy Burnham was blocked by Sir Keir Starmer\n                 \n                  What do local residents think of move to block Andy Burnham from running in Gorton and Denton by-election?\n                 \n                  Andy Burnham 'disappointed' after bid to return as MP blocked by Labour's governing body\n                 The prime minister said: \"We have really important elections already across England for local councils, very important elections in Wales for the government there and very important elections in Scotland for the Scottish Government that will affect millions of people. And we're out campaigning on the cost of living, and they're very important elections. \"We need all of our focus on those elections. \"Andy Burnham's doing a great job as the mayor of Manchester, but having an election for the mayor of Manchester when it's not necessary would divert our resources away from the elections that we must have, that we must fight and win. \"And resources, whether that's money or people, need to be focused on the elections that we must have, not elections that we don't have to have. And that was the basis of the NEC decision.\" 'There's no question of me and Andy not working very well together' Asked for a message to his own backbenchers - some of whom are angry at the NEC's decision - Sir Keir said: \"The single most important thing for people across the country is the cost of living and that's why we're bearing down on it in everything we're doing, pulling every lever. \"The second thing I'd say is there is a fight. Yes, there is a fight, but that fight is with Reform, and we all need to line up together to be in that fight, all playing our part.\" He also insisted that the two men have a good working relationship, despite blocking his return to Westminster. Sir Keir said Mr Burnham is \"doing a really great job\" and pointed to his support for the Manchester politician's 2015 leadership bid. The PM added: \"Last year, in sad circumstances, we had to respond together to the attack in a synagogue in Manchester, standing side by side, reassuring the community. \"This year with the Northern Powerhouse Rail, we're working together to deliver something that matters to Andy Burnham, to the region, to millions of people. \"So, there's no question of me and Andy not working very well together. He's doing an excellent job.\" 'I'm getting on with my job now' Meanwhile, Mr Burnham has told reporters this morning that he is \"getting on with my job now\". Having spoken at an event at a Manchester art gallery, the mayor added: \"I have said everything that I needed to say and I'm getting on with my job now.\" Minutes earlier, he joked with the audience that \"you've all been probably trying to escape sight of me all weekend, but here I am - Monday morning\". This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Farage says the right is uniting. The reality is very different",
        "description": "Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really?",
        "url": "https://news.sky.com/story/is-the-right-really-uniting-hardly-it-is-more-divided-than-ever-13499394",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-suella-braverman-reform_7146261.jpg?20260126181701",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2026-01-26 20:55:00",
        "Headline": "The Tories even reacted to the former home secretary's walkout by claiming 'the Conservatives did all we could to look after Suella's mental health'.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Nigel Farage began his second news conference of the day alongside Suella Braverman by declaring: \"The centre right is finally uniting.\" Really? Mr Farage's introduction was then followed by 25 minutes of his latest Tory defector trashing her old party in the most vitriolic attack of any of Reform UK's new recruits. Braverman's defection - read the latest The defections of Nadhim Zahawi, Robert Jenrick, Andrew Rosindell and now Ms Braverman have been greeted by their old party with more bile than any previous defections. The Tories even reacted to the former home secretary's walkout by claiming: \"The Conservatives did all we could to look after Suella's mental health, but she was clearly very unhappy.\" Mental health? Below the belt, surely? Some senior Conservatives were appalled and a few hours later the party issued a \"correction\" with the offending - and offensive - sentence removed. In his opening remarks, Mr Farage called the mental health slur \"pretty abusive\", claiming: \"We won't lower ourselves to their level.\" Ms Braverman's tirade against her old party may not have been below the belt. But it was pretty near the knuckle. She used the word \"betrayal\" several times. On the refusal to ban \"hate marches\", she said: \"The Conservative Party should be disgusted with itself, frankly.\" She went on: \"I was vilified and called Islamophobic by my own Conservative Party colleagues. Another great betrayal.\" She attacked Kemi Badenoch personally. \"The leader herself said I was having a nervous breakdown, something she seems to have repeated again today.\" Ms Braverman said she had been \"politically homeless\" for two years and \"ashamed of the Conservative Party\". Theresa May \"messed up Brexit\", she claimed. The Tories had a \"largely Lib Dem socialist-lite agenda\", a \"woke ideology\" and were a \"social democrat left-leaning party\", she said. And yet she claimed: \"I don't leave the Conservative party with malice or anger or bitterness. That passed a long time ago.\" Yet this was indeed a malicious, angry and bitter attack. She told Sky News' own Amanda Akass: \"It's a very toxic environment. There's a witch-hunt.\" An hour earlier in the Commons, as the Tories gloated over the near-collapse of the Chagos handover, the veteran MP Sir Julian Lewis claimed: \"The reason this bill may not go through is the work of the Conservative opposition in both Houses of Parliament and the words of the leader of the Reform party in Mr Trump's ear. Read more from Sky News:UK loses measles elimination statusAt least 15 dead and hundreds rescued after ferry sinks \"Does that not show what can be achieved when two parties make common cause in a very worthwhile aim to achieve a vital objective?\" Perhaps. But it's a very rare common cause. Labour, delighted that Tory turmoil was once again overshadowing Labour civil war, claimed Mr Farage is \"stuffing his party full of a band of failed Tories\". And it's certainly beginning to look a bit like that. And is the right really uniting, as Mr Farage claimed? Hardly. Certainly not on the evidence of Suella Braverman's brutal attack on her old party and the Conservatives' response."
    },
    {
        "title": "What do local residents think of move to block Andy Burnham from running in Gorton and Denton by-election?",
        "description": "The part of Manchester I call home has suddenly found itself thrust into the political spotlight.",
        "url": "https://news.sky.com/story/what-do-local-residents-think-of-move-to-block-andy-burnham-from-running-in-gorton-and-denton-by-election-13499219",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andy-burnham-by-election_7146353.jpg?20260126141102",
        "type": "Politics",
        "Author": "Katie Barnfield",
        "Date Published": "2026-01-26 13:36:00",
        "Headline": "Speaking to voters in Gorton and Denton, it's clear that a Labour victory is no longer the certainty it once was.",
        "Content": "\n          North of England correspondent\n       The part of Manchester I call home has suddenly found itself thrust into the political spotlight. Gorton and Denton is the seat where Greater Manchester mayor Andy Burnham wanted to run as Labour's Westminster candidate - before being swiftly blocked by the party's executive, triggering an internal crisis. For a long time, these parts have been Labour through and through - the former constituency of Manchester Gorton was one of its safest seats in the whole country. It would have been unthinkable for another party to have a chance of winning here - until now. Politics latest - follow live \"I would probably lean to the Greens - I'm a Green member\", says Josh Marsden, who lives in Levenshulme, to the west of the constituency. It's an area that has been attracting left-leaning young professionals in increasing numbers over the past decade, many who have been priced out of upmarket areas like Chorlton and Didsbury. With them has come growing support for the Green Party. But Mr Marsden says if Mr Burnham had been allowed to stand, Labour would have won his vote instead. \n                  Why Andy Burnham was blocked by Sir Keir Starmer\n                 \n                  PM defends Burnham block saying it will allow focus on 'must win' elections\n                 \n                  Andy Burnham 'disappointed' after bid to return as MP blocked by Labour's governing body\n                 \"I think that he understands the constituency - he understands Greater Manchester,\" he says. \"I think we want a local candidate who understands our wants and needs.\" Inside the Station South cycle cafe, his views are echoed by several other Levenshulme locals who have come out for brunch. For them, no Burnham means their votes will go to the Greens. \"The idea of the Greens and Labour being against each other really stresses me out,\" says one diner. \"Being in a local Facebook group, seeing stuff out on the street, there is absolutely a Reform presence here. And so I do think there's an opportunity for them. Which, personally, would make me consider whether I want to continue living here.\" The constituency as a whole is incredibly diverse. The current boundaries bring together several different areas with very different voters between them. Over in Denton, just 15 minutes drive to the east of Levenshulme, the political mood seems miles apart. Locals talked of growing up in families that had voted Labour for generations - but are now being tempted by Reform. For Danny Armour, who manages Firwood Carpets on the high street, blocking Mr Burnham from standing was the wrong decision. He says: \"If you want to stand as an MP, you should stand as an MP. \"Why block someone that wants to go all the way? Have they got something to hide?\" Although he's not convinced on Reform leader Nigel Farage - who he says \"mouths off about everything\" - the party's candidate might still get his vote in the upcoming by-election. \"It's all to do with the people coming in the country because there's not enough room for them\" he says. \"[Farage] tells people what they like to hear, thinks he's a man of the people, sat there drinking a pint with everybody. \"It does appeal to a lot of people.\" Read more:Analysis: Starmer and his team can't predict what comes next Outside on the street, another man tells us his family has always voted Labour - and he's the first to go elsewhere. \"The Labour government that's in, I've not got any faith in them whatsoever,\" he says. \"There's a lot of things I'm not happy with from Reform - but I think they are up and coming.\" Gorton and Denton is also home to a large Muslim population - concentrated in areas like Longsight, at the northern tip of its boundary. Firebrand politician George Galloway had suggested he might also stand here - attempting to pull votes from Labour to his Workers Party of Britain through a platform focused on Gaza. But for those we talked to, it wouldn't be enough to sway them. \"I've met George Galloway, he's nice, he is a lovely man\", says one woman shopping for fruit and veg on the main drag on Stockport Road. \"But I think with his past record, that's where the downfall is with him. With everything going at the moment, I'll probably just stay with Labour - I've always been Labour.\" Sir Keir Starmer is already facing a tricky situation, managing the fallout from blocking Mr Burnham's bid to stand in the seat. But for voters here, a Labour victory is no longer the certainty it once was - which could make things much trickier, indeed."
    },
    {
        "title": "Shabana Mahmood to announce police overhaul - with 999 response targets and cuts to 'red tape'",
        "description": "Shabana Mahmood will set out her overhaul of policing today, aiming to tackle \"unpunished\" everyday crime and get officers from their desks to the streets.",
        "url": "https://news.sky.com/story/shabana-mahmood-to-announce-police-overhaul-with-999-response-targets-and-cuts-to-red-tape-13499054",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-home-secretary_7145110.jpg?20260125105053",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-26 00:01:00",
        "Headline": "Under the proposals to be announced to MPs, police forces will be required to respond to emergency calls in urban areas within 15 minutes, and within 20 minutes in rural areas.",
        "Content": "Shabana Mahmood will set out her overhaul of policing today, aiming to tackle \"unpunished\" everyday crime and get officers from their desks to the streets. The home secretary is expected to make a statement to MPs this afternoon on her proposals, including the previously announced creation of a new National Police Service (NPS) to tackle major crimes, and cutting the number of police forces. She is also set to pledge to cut \"red tape\" and \"unnecessary admin\" that prevent officers from spending more time on the beat, and to change how staffing levels are funded. Under the proposals, police forces will also be required to respond to emergency calls in urban areas within 15 minutes, and within 20 minutes in rural areas. While most forces have targets to respond in this time, the Home Office said there is currently no way to hold them to this standard. \"People are reporting crimes and then waiting hours or even days for a response,\" Ms Mahmood said in a statement. \"By the time the police arrive, the perpetrators and witnesses are long gone.\" \"I will restore neighbourhood policing and scale up patrols in communities to catch criminals and cut crime,\" she added. \n                  Police to get 40 new live facial recognition vans and AI help in sweeping reforms\n                 \n                  Child kidnapped for organ removal among 4,414 helped in trafficking crackdown\n                 \n                  Teenager arrested on suspicion of murder after missing man found dead in Plymouth\n                 Analysis: Time will tell if shake-up will leave people feeling better protected Other announcements over the weekend included a £7m investment in tackling shoplifting, including £5m for Operational Opal - a national intelligence sharing unit targeting shoplifting gangs. Policing minister Sarah Jones said that \"for too long, organised crime gangs have taken advantage of defenceless retailers, faced no consequences of their cruel actions and known that police forces may not always attend in time to catch them\". \"My message to them is simple,\" she said. \"There is nowhere to hide now.\" Shadow home secretary Chris Philp agreed that people \"want to see stronger neighbourhood policing and more bobbies on the beat\". However, he said that \"it's hard to take Labour's promises seriously when they have stripped more than 1,300 officers from the front line in our communities, and shoplifting has risen to record levels on their watch\". Read more from Sky News:Burnham 'disappointed' after bid to return as MP blockedThousands of flights cancelled as huge storm hits US Liberal Democrat home affairs spokesman Max Wilkinson added that \"promises by press release are all well and good, but the government must deliver\". \"Labour already promised the public 13,000 more police officers, but instead officer numbers have fallen,\" he said. \"By March this year, we had 4,000 fewer officers than the year before. That's simply not good enough. \"If the government is serious about restoring neighbourhood policing, it needs to step up, get this right, and get more officers back onto our streets.\""
    },
    {
        "title": "Police to get 40 new live facial recognition vans and AI help in sweeping reforms",
        "description": "Dozens of new facial live recognition vans will be delivered to police forces under sweeping reforms announced by the home secretary.",
        "url": "https://news.sky.com/story/facial-recognition-technology-to-be-rolled-out-nationally-and-police-to-also-get-ai-support-13499172",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-live-facial-recognition_7079309.jpg?20251111152246",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-26 11:28:00",
        "Headline": "Home Secretary Shabana Mahmood has said that forces are “fighting crime in a digital age with analogue methods”.",
        "Content": "Dozens of new facial live recognition vans will be delivered to police forces under sweeping reforms announced by the home secretary. Under Shabana Mahmood's proposals, the biggest shake-up in policing in decades, the current number of 10 vans will rise to 50, and will be overseen by a national centre on artificial intelligence (AI). Live facial recognition vans are used to catch people on police watchlists, find missing and vulnerable individuals and deter criminal behaviour. Ms Mahmood told the Commons some police forces are \"fighting crime in a digital age with analogue methods\". The move comes as part of major changes revealed in the Government's White Paper on police reforms, which seeks to also create a \"British FBI\", called the National Police Service (NPS), and drastically cut the number of police forces. Ms Mahmood also announced in the Commons that all forces across England and Wales will be given AI tools to help reduce the amount of time that officers must spend behind a desk, allowing them to be on the beat more instead. She told MPs that the government will invest more than £140 million in new technologies to assist officers in the fight against crime. \n                  Child kidnapped for organ removal among 4,414 helped in trafficking crackdown\n                 \n                  Teenager arrested on suspicion of murder after missing man found dead in Plymouth\n                 \n                  Shabana Mahmood to announce police overhaul - with 999 response targets and cuts to 'red tape'\n                 Politics latest - follow live The Home Office has called the changes the biggest reform to policing since the police were professionalised two centuries ago. Laying out the Police Reform White Paper, Ms Mahmood revealed that more tech experts, such as digital forensic specialists, will work within police forces to tackle fraudsters, criminal networks on the dark web and identify criminal hotspots. \"Crime has evolved - but police forces haven't,\" she said. \"Fraudsters and serious organised crime bosses are outsmarting them. \"Under my reforms, forces will now hire more digital, cyber and forensic officers to put vile criminals behind bars.\" A significant reduction in the number of police forces across England and Wales from the current 43, in an effort to streamline policing. This also includes the creation of a National Police Service - dubbed the \"British FBI\". A plan to establish local policing areas for each town, city or borough, and a commitment to introduce 13,000 extra neighbourhood officers by 2029. A new \"licence to practice\" for all officers - to boost standards and increase trust in the police. This will be introduced alongside improvements to development opportunities for officers, with a mandated national performance management framework. The nationwide rollout of live facial recognition technology and the use of AI by each police force to cut admin. The NPS - which will aim to tackle serious crime - will merge the existing National Crime Agency, Counter Terror Policing, the National Police Air Service and National Roads Policing all under a single organisation. Work to set up the NPS will start this year, but it is believed it will be finalised in the next parliament. A review will also look at how many regional forces to cut and report back this summer, with some mergers expected to take place by the next election. 👉 Listen to Sky News Daily on your podcast app 👈 Responding in the Commons, shadow home secretary Chris Philp said the plans don't address total police numbers, claiming they are falling under the current Labour government. He said: \"The home secretary can set targets and make announcements, but the fact is she is presiding over falling total police numbers and the public will be less safe as a result. \"To make things even worse, Labour plans to abolish prison sentences of under a year, so even the most prolific shoplifters will never face jail. \"This is a recipe for disaster cooked up by the home secretary in her previous role [as justice secretary].\" He added: \"Her plan includes mandating the merger of police forces, and briefings over the weekend suggest a reduction from 43 down to 10 or 12, so a single police force might cover an area from Dover to Milton Keynes, or from Penzance to Swindon. \"Such huge forces will be remote from the communities they serve. Resources will be drawn away from villages and towns towards large cities.\" Ms Mahmood replied that the Conservatives slashed police numbers by 20,000, \"a measure that they very hastily then tried to replace by bringing back another 20,000, but in a distorted way, which meant that 12,000 of those officers - warranted police officers - are doing desk jobs\"."
    },
    {
        "title": "Schools should be 'phone-free' all day, education secretary tells teachers",
        "description": "Students should be banned from accessing phones for the duration of the entire school day, the education secretary has said.",
        "url": "https://news.sky.com/story/schools-should-be-phone-free-all-day-education-secretary-tells-teachers-13499088",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mobile-phone-class_7146016.jpg?20260126092033",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-26 07:03:00",
        "Headline": "Bridget Phillipson has told headteachers in a letter that phones should not be used for the entire school day, including as calculators, for research or during break times.",
        "Content": "Students should be banned from accessing phones for the duration of the entire school day, the education secretary has said. Bridget Phillipson wrote to headteachers in England on Monday to tell them schools should be \"phone-free environments\". The new edict dictates pupils should not use the devices as calculators, for research or during break time. \"All schools should be phone-free environments for the entire school day,\" Ms Phillipson said in the letter. \"That includes lessons, time between lessons, breaktimes and lunchtime. It means, for example, it is not appropriate for phones to be used as calculators, or for research during lessons. \"Schools should make sure those policies are applied consistently across classes and at all times and we want parents to back these policies too.\" She added: You have my full support in taking this forward. Clear boundaries, applied with consistency and fairness, give pupils the best chance to learn and thrive, and schools should feel confident in setting and enforcing them.\" Last week, the government issued updated guidance to schools on phone use, stressing pupils \"should not have access to their devices during lessons, break times, lunch times, or between lessons\". Teachers have also been told not to use their phones in front of students. The Department for Science, Innovation and Technology (DSIT) said it will take immediate action on children's social media use, including directing Ofsted to examine the mobile phone policies in place in schools and how effectively they are being implemented. According to DSIT data, 99.9% of primary schools and 90% of secondary schools have mobile phone policies in place. However, 58% of secondary school students reported mobile phones being used without permission in at least some lessons, rising to 65% for key stage four pupils. It comes as the government begins a consultation on implementing an Australian-style social media ban for under-16s. The consultation will look at options including raising the digital age of consent and restricting addictive app features such as infinite scrolling. Read more from Sky News:Blocking Burnham avoided 'psychodrama', says ministerTeenager arrested on suspicion of murderHome secretary to announce policing overhaul Ministers will visit Australia as part of the consultation, where a social media ban for under-16s came into force in December. The government will seek views from parents and young people and will respond in the summer, the DSIT said."
    },
    {
        "title": "Suella Braverman defects to Reform UK - and hits out at Tory 'mental health' briefing",
        "description": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK.",
        "url": "https://news.sky.com/story/former-home-secretary-suella-braverman-defects-to-reform-uk-13499184",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-braverman-farage-reform-uk_7146729.jpg?20260126212100",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-26 12:16:00",
        "Headline": "The latest senior Conservative figure to link up with Nigel Farage had strong words for her \"bitter\" former party.",
        "Content": "Suella Braverman has become the latest prominent Conservative politician to jump ship and join Reform UK. The former home secretary has been unveiled by Nigel Farage as another high-profile catch at an event launching Veterans for Reform. Ms Braverman, who served in government under prime ministers Theresa May, Boris Johnson, Liz Truss, and Rishi Sunak, announced that she had resigned the Conservative whip to huge cheers from the veterans gathered for the event. Politics latest - follow live \"I feel like I've come home,\" she said. \"Because I believe that a better future is possible for us, I am joining Reform UK.\" Braverman also responded after a Conservative statement, which the party said had been \"sent out in error\", made references to her \"mental health\". Echoing earlier comments from Mr Farage, she said: \"Those attacks say more about them, than they do about me.\" \n                  Jenrick joins Reform – is it a boost for Nigel Farage or Kemi Badenoch?\n                 \n                  Badenoch turned a crisis into an opportunity - but her Reform problems aren't over\n                 \n                  How Reform could offer ever-ambitious Nadhim Zahawi a new route to the top\n                 She added: \"It is a bit pathetic. I am afraid it's more sorry signs of a bitter and desperate party that is in free fall.\" Why did Suella Braverman switch to Reform UK? Asked why she made decided to switch now, Ms Braverman said: \"I've been thinking about it for some time. \"I've been politically homeless for the best part of two years. I have not had confidence in the Conservative Party, really, but I have tried to see whether it might change, try to give it some time and its events over the last few days reach really, which have tipped me over the line.\" Ms Braverman served in the Home Office at the same time as Robert Jenrick, who defected to the party on 15 January. She is the party's eighth MP. Explaining her decision, Ms Braverman said: \"Loyalty demands honesty, and honesty compels me to say this: today Britain is indeed broken. She is suffering. She is not well. \"Immigration is out of control. Our public services are on their knees. People don't feel safe. \"Our youngsters are leaving the country for better futures elsewhere. We can't even defend ourselves and our nation stands weak and humiliated on the world stage. \"So we stand at a crossroads. We can either continue down this route of managed decline to weakness and surrender. Or we can fix our country, reclaim our power, rediscover our strength. I believe that a better Britain is possible.\" She pointed to her calls to leave the European Court of Human Rights (ECHR) while in government, and accused the Tories of having \"utterly failed to do the right thing for the British people\". Suella Braverman rose to the top echelons of the Conservative Party over a career that spanned almost 11 years.  But now the former home secretary has decided to swap her navy blue for teal, by defecting to Nigel Farage's Reform UK. The 45-year-old is a qualified barrister and served in government under successive Conservative PMs including Theresa May, Boris Johnson, Liz Truss, and finally Rishi Sunak. She was elected to parliament as the MP for the Hampshire seat of Fareham (now Fareham and Waterlooville) in 2015 - a year before the Brexit vote. A vocal Eurosceptic, she rose up the anti-EU faction of the party, ultimately chairing the European Research Group, and ran to be the party's leader before being knocked out in the second round. She served as attorney general in Boris Johnson's government, and, after throwing her weight behind the short-lived premiership of Truss, Braverman was given the plum job of home secretary. She resigned from the role after breaching the ministerial code by using a personal address for confidential emails.  But six days later, Sunak put her back in the top job - only for her to lose the role again after a series of stridently right-wing comments.  She was a major driver of policies such as the Rwanda plan and the Bibby Stockholm barge used to house migrants during her tenure. Since her dismissal, Braverman has been on the backbenches, but made supportive noises for Nigel Farage and attended Donald Trump's second inauguration last year - where she was seen wearing a MAGA cap. She said her former party had \"great speeches, good slogans... but when the cameras are off, when the doors are shut, and when they're sat behind that table making difficult decisions for the country, they fold\". She added: \"When push comes to shove, they go AWOL. No courage, no backbone, no resolve.\" Ms Braverman also hit out at the current Tory party, saying its commitment to leave the ECHR is a lie. She added: \"I'm calling time on Tory lies. I'm calling time on a party that keeps making promises with zero intention of keeping them.\" Championing Reform, Ms Braverman said: \"There is only one man in British politics who has been courageously consistent for his country, and that man is Nigel Farage. \"He's not backed down in the face of vicious onslaughts, vicious vitriol, and backlash. Nigel Farage is right and the British people are backing him.\" Ms Braverman concluded her speech by saying it is \"the honour of my life\" to defect to Reform. Reform UK 'stuffed full of failed Tories responsible for chaos' The Conservatives have hit back, saying it was \"always a matter of when, not if, Suella would defect\" and suggesting she has changed sides because of \"personal ambition\", citing her unsuccessful run to be leader. In a barbed response, the Tories added that they \"did all we could to look after Suella's mental health, but she was clearly very unhappy\". The spokesperson continued: \"Reform are too busy opposing the Conservatives to hold the Labour government to account.\" For their own part, Labour has accused Mr Farage of \"stuffing his party full of the failed Tories responsible for chaos and decline that held Britain back for 14 years\". Anna Turley, Labour's chairwoman, added: \"Suella Braverman helped botch Brexit and got sacked as home secretary - her defection shows Farage is willing to accept the very worst of the Conservative Party and exposes his complete lack of judgement.\" Meanwhile, the Liberal Democrats accused Ms Braverman of having \"selective amnesia\" and of forgetting she \"helped break\" Britain. Deputy leader Daisy Cooper said: \"Suella Braverman was so bad she was forced to resign from Liz Truss's cabinet and got sacked by Rishi Sunak.\""
    },
    {
        "title": "Lung cancer: 'Trailblazing' NHS scheme hailed as a 'glimpse of the future'",
        "description": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\". ",
        "url": "https://news.sky.com/story/lung-cancer-trailblazing-nhs-scheme-hailed-as-a-glimpse-of-the-future-13499296",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lung-cancer-health_7146564.jpg?20260126173959",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-26 16:14:00",
        "Headline": "Under the pilot scheme, AI software will be used to analyse lung scans and flag suspicious spots, before a robotic catheter takes precise biopsies, which are then checked in a lab to diagnose or rule out cancer.",
        "Content": "AI and robotics are to be used to help detect lung cancer in a \"trailblazing\" scheme that experts are calling \"a glimpse of the future of cancer detection\".  It comes alongside NHS plans to expand lung cancer screening, with all eligible people invited for their first check by 2030. Alongside the expansion, AI software will be used to analyse patients' lung scans and flag suspicious spots, known as nodules. A robotic catheter - a thin tube inserted into the patient via the throat - is used to take precise biopsies directly from the nodule, which are then checked in a lab to diagnose or rule out cancer. The robotic system can reach spots as small as six millimetres, which are often hidden deep in the lung and can be missed at screening. It's harder for doctors to reach such nodules to take biopsies, meaning patients must wait for further scans to see if they grow. Specialists at Guy's and St Thomas' NHS Foundation Trust have already used robotic biopsies on 300 patients, with some 215 of them going on to have cancer treatment. The new pilot will involve a further 250 patients, and it's hoped other trusts will start performing the procedure. Read more from Sky News:King's 'good news' on cancer Lung cancer is the third most common cancer in the UK, with more than 49,000 new diagnoses and around 33,000 deaths every year. Since 2019, more than 1.5 million people in England between the ages of 55 and 74 who have ever smoked have been invited to have their lung health checked, NHS England said, and a further 1.4 million people will be contacted next year alone. Professor Peter Johnson, NHS England's national clinical director for cancer, said screening means more cases are being picked up at an early stage than ever, and the new pilot will support even \"faster, more accurate biopsies\". \"This is a glimpse of the future of cancer detection,\" he said. Health Secretary Wes Streeting underwent robotic surgery when being treated for kidney cancer and said the NHS treatment \"saved my life\". He said the pilot will help catch the illness earlier, \"replacing weeks of invasive testing with a single targeted procedure\"."
    },
    {
        "title": "UK loses measles elimination status, warns WHO",
        "description": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged.",
        "url": "https://news.sky.com/story/uk-loses-measles-elimination-status-warns-who-13499336",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-measles-child_6536139.jpg?20240428095436",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-26 17:50:00",
        "Headline": "Vaccination rates in 2024-25 among five-year-olds who had received both MMR jabs hit the lowest level in 15 years.",
        "Content": "The UK has lost its measles elimination status from the World Health Organisation (WHO) after vaccination coverage plateaued and cases surged. From 2021 to 2023, the country was considered to have \"eliminated\" the disease, but global health officials say measles transmission was re-established in the UK in 2024. Vaccination coverage has flatlined in recent years, with recorded measles infections in the UK soaring to 3,681 in 2024. Spain, Austria, Armenia, ⁠Azerbaijan and Uzbekistan also lost their status, and the WHO urged countries to boost vaccination rates to prevent the ​disease infecting more children. \"It is unsurprising the UK has lost its WHO measles elimination status, following nationwide outbreaks since 2024 and the preventable death of a child in 2025,\" said Dr Ben Kasstan-Dabush, assistant professor of global health at the London School of Hygiene and Tropical Medicine. The latest figures for England from the UK Health Security Agency (UKHSA) show that in 2024-25, just 83.7% of five-year-olds had received both MMR (measles, mumps and rubella) vaccine doses, down year-on-year from 83.9%. This was the lowest level since 2009-10. \n                  Multiple recalls of contaminated baby formula traced to shared supplier\n                 \n                  'Missed opportunity' to take footballer who died of flesh-eating infection to hospital, coroner rules\n                 \n                  'We were lied to, demeaned and smeared': Hospital inquiry families call for Glasgow health board bosses to 'face a reckoning'\n                 Also in 2024-25, some 91.9% of five-year-olds had received one dose of the MMR vaccine, unchanged from 2023-24 and the lowest level since 2010-11. The WHO advises that at least 95% of children should receive vaccine doses for each illness to achieve herd immunity. \"Infections can return quickly when childhood vaccine uptake falls,\" said Dr Vanessa Saliba, consultant epidemiologist at the UKHSA. \"Measles elimination is only possible if all eligible children receive two MMRV doses before school. \"Older children and adults who missed vaccination must be caught up.\" From the start of January, children have been offered a combined MMRV vaccine, which protects against measles, mumps, rubella and chickenpox, instead of the MMR jab, as part of the childhood routine two-dose vaccination schedule. Dose one is being offered at one year of age and dose two has been brought forward from three years four months to a new 18-month appointment. The rollout across the four nations of the UK comes after the combined MMRV (measles, mumps, rubella and varicella) jab was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023. Read more:What are the symptoms of measles?Child dies as measles cases surge A WHO spokesperson said the UK's change of status \"reflects a broader challenge\" that the organisation is facing across Europe. \"Outbreaks of measles and other vaccine-preventable diseases are threats to health security in Europe,\" they added. Dr Bharat Pankhania, senior clinical lecturer in public health medicine at the University of Exeter Medical School, said: \"It's extremely concerning that in the UK we now have pockets of low or no vaccine uptake.\" He warned that \"we urgently need to remedy this situation\"."
    },
    {
        "title": "'I am not a Nazi' - Kanye West blames brain injury for antisemitism ",
        "description": "Kanye West has denied he is a Nazi and taken out a full-page advert in the Wall Street Journal to apologise for antisemitic comments.&#160;",
        "url": "https://news.sky.com/story/i-am-not-a-nazi-kanye-west-blames-brain-injury-for-antisemitism-13499377",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kanye-west_7146681.jpg?20260126202033",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-26 20:00:00",
        "Headline": "West says: \"I regret and am deeply mortified by my actions in that state, and am committed to accountability, treatment, and meaningful change\".",
        "Content": "Kanye West has denied he is a Nazi and taken out a full-page advert in the Wall Street Journal to apologise for antisemitic comments.  In the full-page advert, titled 'To Those I've Hurt', the controversial star insisted he was not asking for \"sympathy or a free pass\". Instead, the artist now known as Ye, said he was looking to earn forgiveness from the public. The rapper also apologised to the black community, saying he had let it down. West deleted his X account in February of last year after suffering a backlash over a series of offensive remarks, including \"I love Hitler\" and \"I'm a Nazi\". West's Yeezy online shopping platform was also taken down after it began selling T-shirts adorned with swastikas. In May last year, the 48-year-old released a single titled 'Heil Hitler', a move that resulted in Australia, where the star's wife, Bianca Censori, is from, cancelling his visa. Adidas ended a partnership with the rapper over antisemitic comments he made in 2022, leaving the company with a mountain of West's popular brand of Yeezy trainers unsold until last year. West also apologised for his remarks in 2023. However, in the newspaper advert, West now insists: \"I am not a Nazi or an antisemite. I love Jewish people\". He blamed his behaviour on his bipolar-1 disorder, something he said resulted from a car accident 25 years ago. He says his brain injury from the crash wasn't properly diagnosed until 2023, something he calls a \"medical oversight [that] caused serious damage to my mental health and led to my bipolar type-1 diagnosis\", which he received in 2016. \"In early 2025, I fell into a four-month-long manic episode of psychotic, paranoid and impulsive behaviour that destroyed my life,\" West said. \"I lost touch with reality. Things got worse the longer I ignored the problem. I said and did things I deeply regret.\" He added: \"There were times I didn't want to be here any more.\" The rapper said that he'd treated \"some of the people I love the most\" the worst, saying he \"became detached from my true self\". Read more from Sky News:UK loses WHO measles elimination statusStorm Chandra forecast to bring snow, strong winds and heavy rain West said he hit rock bottom a few months ago and that his wife encouraged him to get help. He is now \"pouring my energy into positive, meaningful art: music, clothing, design and other new ideas to help the world\". \"One of the difficult aspects of having bipolar type-1 are the disconnected moments - many of which I still cannot recall - that lead to poor judgement and reckless behaviour that (often) feels like an out-of-body experience.\"I regret and am deeply mortified by my actions in that state, and am committed to accountability, treatment, and meaningful change.\" The letter ends with West saying, \"I write today simply to ask for your patience and understanding as I find my way home. With love, Ye.\" A spokesperson for Campaign Against Antisemitism said: \"It's hard to keep up with Kanye West's apologies and relapses. A heartfelt apology is nice but at the end of the day it's meaningless if it's followed by more of the same, which is what has happened before. Time will tell whether he is really turning a corner or just going around in circles. \"We hope for his sake - and for Jewish people worldwide who have enough antisemitism to worry about right now - that he will show some real change. That might start with telling his online followers, whose number is greater than there are Jews in the world, why antisemitism is so corrosive.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    }
]