[
    {
        "title": "Trump 'considering' whether to invite Zelenskyy to Putin meeting in Alaska",
        "description": "The White House is considering inviting Volodymyr Zelenskyy to a meeting between Donald Trump and Vladimir Putin in Alaska, according to reports in the US.",
        "url": "https://news.sky.com/story/white-house-considering-inviting-zelenskyy-to-trump-putin-meeting-in-alaska-reports-13409490",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-09 22:03:00",
        "Headline": "The reports come a day after Washington and Moscow confirmed the US and Russian presidents will meet on Friday 15 August to discuss the war in Ukraine.",
        "Content": " The White House is considering inviting Volodymyr Zelenskyy to a meeting between Donald Trump and Vladimir Putin in Alaska, according to reports in the US. The reports come a day after Washington and Moscow confirmed the US and Russian presidents will meet on Friday to discuss bringing about an end to the war in Ukraine. A senior US official and three people briefed on internal discussions have told Sky News' US partner network NBC News that the Trump administration is now considering inviting the Ukrainian president to the summit. \"It's being discussed,\" one of the people briefed on the talks was quoted as saying.  The sources said a visit by Mr Zelenskyy has not been finalised - and it is unclear whether the Ukrainian leader will be in Alaska. However, the senior administration official said it is \"absolutely\" possible. \"Everyone is very hopeful that would happen,\" the official said. \n                  Stakes high for Trump-Putin summit as Zelenskyy faces nightmare deal\n                 \n                  Desperation as Gaza suffers through heatwave - and a sense of hopelessness in Tel Aviv \n                 \n                  'He never left Gaza in his mind': Israeli soldier died by suicide after being ordered to return\n                 Asked whether the US had officially invited Mr Zelenskyy, a senior White House official said: \"The president remains open to a trilateral summit with both leaders. Right now, the White House is focusing on planning the bilateral meeting requested by President Putin.\" On Friday - before the summit was confirmed - Mr Trump had told reporters at the White House that \"we're getting very close to a deal\" that would end the conflict. The US president added there will be \"some swapping of territories to the betterment of both sides\".  Zelenskyy suggests he's unwilling to give up territory Yesterday, the Ukrainian president warned that allowing Russia to keep territory it has occupied in Ukraine will result in another invasion. He said allowing Mr Putin to annex Crimea in 2014 didn't prevent Russia forces from occupying more parts of Ukraine during the current conflict. Mr Zelenskyy added: \"Now, Putin wants to be forgiven for seizing the south of our Kherson region, Zaporizhzhia, the entire territory of Luhansk and Donetsk regions, and Crimea. We will not allow this second attempt to partition Ukraine. \"Knowing Russia - where there is a second, there will be a third.\"  NATO allies say Ukraine must be involved in negotiations Ukraine and several NATO allies have reportedly been privately concerned Mr Trump might agree to Mr Putin's proposals for ending the war without taking their positions into account. In a joint statement last night, UK Prime Minister Sir Keir Starmer and the leaders of France, Italy, Germany, Poland, Finland and the European Commission said Ukraine's future cannot be decided without Kyiv. They said: \"Ukraine has the freedom of choice over its own destiny. Meaningful negotiations can only take place in the context of a ceasefire or reduction of hostilities. \"The path to peace in Ukraine cannot be decided without Ukraine. \"We remain committed to the principle that international borders must not be changed by force. \"The current line of contact should be the starting point of negotiations.\" Read analysis:Lifting sanctions a 'massive victory for Moscow'Stakes high for Alaska summit as Zelenskyy faces nightmare dealWhy Trump will have a lot of ice to break at Alaska summit UK hosts Ukrainian officials ahead of summit Earlier, Foreign Secretary David Lammy hosted a meeting of top Ukrainian officials and European national security advisers alongside US Vice President JD Vance. The meeting took place at Chevening, the foreign secretary's official country retreat in Kent, where Mr Vance is staying at the start of a UK holiday. After the meeting, Mr Lammy said: \"The UK's support for Ukraine remains ironclad as we continue working towards a just and lasting peace.\" It is understood that the meeting had been called at Washington's request, and included representatives from the US, Ukraine, France, Germany, Italy, Finland and Poland, as well as the UK. Ukraine was represented by Rustem Umerov, secretary of the country's national security and defence council, and the head of Mr Zelenskyy's office, Andriy Yermak. In a post on social media, Mr Yermak said the allies' positions were \"clear\" that \"a reliable, lasting peace is only possible with Ukraine at the negotiating table, with full respect for our sovereignty and without recognising the occupation\". Ahead of the meeting, Sir Keir discussed the talks in a call with Mr Zelenskyy, and also spoke to French President Emmanuel Macron. A Downing Street spokeswoman said Sir Keir and Mr Macron \"discussed the latest developments in Ukraine, reiterating their unwavering support for President Zelenskyy and to securing a just and lasting peace for the Ukrainian people\"."
    },
    {
        "title": "Police arrest 474 people at protest in support of banned group Palestine Action",
        "description": "Police have made 474 arrests in London after crowds turned out for a Palestine Action demonstration.",
        "url": "https://news.sky.com/story/police-make-arrests-at-protest-in-support-of-proscribed-group-palestine-action-13409027",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-palestine-action-protest_6986359.jpg?20250809132212",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-09 12:13:00",
        "Headline": "Palestine Action has been proscribed since 5 July, making it a criminal offence to show support for the organisation, but police said a \"significant number\" were carrying placards backing the group. ",
        "Content": " Police have made 474 arrests in London after crowds turned out for a Palestine Action demonstration. Metropolitan Police said 466 were detained under the Terrorism Act for showing support for a banned group. Eight more people were arrested for other offences, including five for assaulting officers. The Met said it was the most arrests it's made related to a single operation in at least the past decade. Organiser of the event, Defend Our Juries, earlier said up to 700 people were at the event in Parliament Square and claimed police were preparing for the \"largest mass arrest in their history\". The group said those arrested included former Guantanamo Bay detainee Moazzam Begg, NHS workers, quakers and a blind wheelchair user. The Met said a \"significant number of people\" at the event were seen \"displaying placards expressing support for Palestine Action\". Home Secretary Yvette Cooper said: \"The right to protest is one we protect fiercely but this is very different from displaying support for this one specific and narrow, proscribed organisation. \"Palestine Action was proscribed based on strong security advice following serious attacks the group has committed, involving violence, significant injuries and extensive criminal damage.\"  Police said those arrested had been taken to processing points in Westminster and any whose details could be confirmed were bailed on condition they didn't attend further Palestine Action support events. Others whose details could not be verified, possibly because they refused to give them, were taken to custody suites across London. The protests have put a strain on authorities' capacity to cope. Sky News understands senior leaders in the prison service, known as \"Capacity Gold\", met today to discuss how to deal with the large number of arrests as the male prison estate is close to full. It's understood 800 inmates were moved out of the busiest jails in and around London beforehand. The first of the arrests began just before 1pm, when a man waving a placard that read \"I support Palestine Action\" was stopped by police, writes Gurpreet Narwan, reporting  from Parliament Square. Officers told him he was showing support for a terrorist organisation, searched him and ushered him away. The action soon escalated. Among the people arrested today were a number of elderly people, a blind man in a wheelchair, and a teenager. They were protesting peacefully, with a number of people pointedly seating themselves below statues of Mahatma Gandhi and the suffragette Millicent Fawcett. They told Sky News that they were fully expecting to be arrested but that they felt compelled to speak out and defend the right to protest. One protester said: \"I don't think I'm a criminal. That's not the person I am.\" However, he said he was being guided by his faith and his conscience. Things calmed down after a few hours but there was a heavy police presence well into the afternoon and early evening. Read more:What does proscribing a group mean? Legislation to ban Palestine Action came into force on 5 July, making it a criminal offence to show support for the organisation, carrying a prison sentence of up to 14 years. Defend Our Juries said earlier this week the protest would still go ahead, following several similar demonstrations since it was outlawed last month. On Saturday, a spokesperson said \"Palestine Action and people holding cardboard signs present no danger to the public at large\". Human rights advocates Amnesty International described the arrests of so many people under UK terrorism law as \"deeply concerning\". Another march organised by the Palestine Coalition, which is a separate group, set off from Russell Square and assembled on Whitehall. The Met Police said one person had been arrested there for showing a placard in support of Palestine Action. Earlier this week, three people charged as a result of illegal Palestine Action activity were named. Jeremy Shippam, 71, of West Sussex, Judit Murray, also 71, of Surrey, and Fiona Maclean, 53, of Hackney in east London, will appear at Westminster Magistrates' Court on 16 September. The ban on Palestine Action faces a legal challenge in November after the High Court granted a full judicial review to Palestine Action co-founder Huda Ammori."
    },
    {
        "title": "Migrant protesters face off amid concerns over women and girls' safety",
        "description": "Police in Liverpool were clearly preparing for trouble - with the two sides of protesters and counter-protesters kept well apart by lines of officers carrying riot helmets.",
        "url": "https://news.sky.com/story/migrant-protesters-face-off-in-liverpool-amid-concerns-over-women-and-girls-safety-13409325",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liverpool-protest-migrant_6986754.png?20250809180240",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-08-09 16:41:00",
        "Headline": "In Liverpool, counter-protesters held signs welcoming refugees and occasionally yelled at the other side - sometimes calling them \"Nazis\".",
        "Content": "\n          North of England correspondent\n        Police in Liverpool were clearly preparing for trouble - with the two sides of protesters and counter-protesters kept well apart by lines of officers carrying riot helmets. For the most part though, things remained peaceful, apart from plenty of shouting exchanged between the sides. On the anti-migrant side, we met plenty of women who said they are the new face of these protests - mothers and grandmothers concerned about the safety of their children. One woman said it was \"ridiculous\" to label her far right, although as we were talking shouts of \"Hey Tommy Tommy\" went up from the crowd around us, an apparent reference to the far-right activist Tommy Robinson. Some of the women came dressed in pink, wore Union Jack hair bands, or T-shirts with slogans pointing out they don't look like far-right supporters. Although many were happy to talk to us, at one point we were pushed back from their side by men shouting at us, angry at traditional media being anywhere near the demonstration. Walking across to the other side, people played drums, held signs welcoming refugees and occasionally yelled at the anti-migrant protesters, sometimes calling them \"Nazis\". Read more:Norwich protests were peaceful but anger is bubblingFirst migrants detained under returns deal with France They told me the other side had been fuelled by misinformation, and that this hotel was being used to house legitimate, documented refugees who were welcome to seek help in their city. One man told me \"people are turning up to kick people out of the housing they have been provided - this is not Liverpool\". Elsewhere, hundreds of protesters marched through in Nuneaton after two men, reported to be asylum seekers from Afghanistan, were charged over the rape of a 12-year-old girl. That crowd significantly outnumbered counter-protesters outside Nuneaton's Town Hall on Saturday afternoon. Video footage showed some minor scuffles broke out as police kept order. Other protests took place in Bristol, Bournemouth and Birmingham. Police have expressed concern at the demands on their resources from the protests. Met Police Deputy Assistant Commissioner Ade Adelekan said the scale of the events - combined with those over Gaza - would \"put pressure\" on his force. DAC Adelekan said before the protests began: \"This is going to be a particularly busy few days in London with many simultaneous protests and events that will require a significant policing presence.\""
    },
    {
        "title": "Major incident declared as crews battle Holt Heath fire near Wimborne",
        "description": "A major incident has been declared as about 100 firefighters tackle a blaze at Holt Heath near Wimborne in Dorset.",
        "url": "https://news.sky.com/story/major-incident-declared-as-crews-battle-holt-heath-fire-near-wimborne-13409392",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-wimborne-fire_6986816.jpg?20250809194529",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-09 18:29:00",
        "Headline": "About 100 firefighters and 20 fire engines are tackling a blaze at Holt Heath near Wimborne in Dorset.",
        "Content": " A major incident has been declared as about 100 firefighters tackle a blaze at Holt Heath near Wimborne in Dorset. The public have been warned to stay away and the fire service said it was trying to protect nearby properties by surrounding the blaze. Twenty homes have been evacuated as a precaution and locals told to keep windows and doors shut. Pictures showed smoke billowing into the air from the scene, just north of Bournemouth. Dorset and Wiltshire Fire and Rescue Service said it was called around 11.30am, adding that the fire was being whipped up by the wind. \"This fire is moving quickly and they [the public] could easily get caught out if they are too close and the fire spreads towards them,\" said a statement. Crews could be at the scene for several days, said a senior firefighter, as hotter temperatures are forecast this week - prompting an amber wildfire alert in the area. Antony Bholah, the service's area manager, said at least 20 engines were involved in the operation and that neighbouring fire services were also helping. He said the fire covered an area about 1000m by 800m and expected it would be a few days before it's full extinguished. \"There are some areas that are really difficult to access,\" said Mr Bholah. \"So we're being very cautious about how we approach it and we might call on some additional resources later on this evening.\" It's not yet confirmed how it started, but he said an investigation would be carried out with police and prosecutions could follow if necessary. The public has been warned not to fly drones over the fire as they could interfere with firefighters' own drones. Read more:At least two dead as wildfires sweep Greece, Turkey and France Crews are also still tackling another fire in Dorset - at Newton Heath, near Swanage - that's been burning since last Sunday and affects 21 hectares. That fire is believed to have been started on purpose. People are being urged to make sure cigarette ends are extinguished properly and to not throw them on the ground or from cars. Barbeques on heath land, countryside or open spaces should also be avoided, warned the Dorset and Wiltshire service. Large wildfires burn in Europe Meanwhile, European nations have been dealing with much more destructive fires in what is becoming a growing problem in the summer. At least 1,400 firefighters have been deployed in France's southern Aude region to try to stop the country's biggest wildfire in decades from reigniting. The blaze was contained on Thursday after burning through 62 square miles this week.  Spain is also battling a fire in Avila province, 62 miles west of Madrid. It had been contained by Saturday afternoon but authorities said the coming hours were critical. In Greece, flames were fanned by strong winds in the Keratea region on Friday and reached residential areas 25 miles south of Athens. The same day, smoke also temporarily closed the Dardanelles Strait in northwest Turkey, with a nearby university campus and care home also evacuated. Local media said the fire started in a field in Canakkale province before spreading to a forested area."
    },
    {
        "title": "Second arrest after man found dead on bench near Northampton canal",
        "description": "Police have bailed a second person to be arrested after a man was found dead on a bench near the canal in Northampton.",
        "url": "https://news.sky.com/story/second-arrest-after-man-found-dead-on-bench-near-northampton-canal-13408948",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-robert-brown-northamptonshire_6986222.jpg?20250809164711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-09 09:04:00",
        "Headline": "Robert Brown, 57, was found with a fatal arm injury near the River Nene in Northampton town centre at 6.30am on 1 August, police said.",
        "Content": "Police have bailed a second person to be arrested after a man was found dead on a bench near the canal in Northampton. Robert Brown, 57, was found with a fatal arm injury near the River Nene in Northampton town centre at 6.30am on 1 August, Northamptonshire Police said. A 41-year-old man was arrested on suspicion of his murder on Friday. On Saturday, police said he had been released on bail, pending further investigation. Another 38-year-old man had already been arrested on suspicion of murder and is currently on bail. The exact cause of Mr Brown's death is yet to be established, with a post-mortem examination to take place in the coming days. Read more from Sky News:Wembley investigating Oasis fraud claimsNicola Sturgeon's memoir reveals arrest was 'mental torture'British girl returns to UK from IS camp in Syria Paying tribute to him in a statement issued by police on Thursday, Mr Brown's family said he had a \"heart of gold\" and \"was always ready to help others\". \"We are truly devastated that Rob has been taken from us, but reading all the tributes on social media has provided some source of comfort,\" it read. \"It is lovely to know just how many people knew Rob and enjoyed his company. \"We will always miss his chirpy banter, but we know there are many happy memories to share and talk about.\" Detective Inspector Torie Harrison, who is leading the murder investigation, said: \"We are following all lines of enquiry as we work to establish the circumstances of Robert's death and I'm thankful to everyone who has assisted us with our work so far. \"We continue to ask for anyone who may have been in the area of the towpath behind Auctioneers Court from the evening of Thursday, 31 July, to the morning of Friday, 1 August, to contact us. \"Although you may think you don't have any information that could help us, that may not be the case. \"If you think you have any information that may help the investigation, please get in touch.\""
    },
    {
        "title": "Police arrest 474 people at protest in support of banned group Palestine Action",
        "description": "Police have made 474 arrests in London after crowds turned out for a Palestine Action demonstration.",
        "url": "https://news.sky.com/story/police-make-arrests-at-protest-in-support-of-proscribed-group-palestine-action-13409027",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-palestine-action-protest_6986359.jpg?20250809132212",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-09 12:13:00",
        "Headline": "Palestine Action has been proscribed since 5 July, making it a criminal offence to show support for the organisation, but police said a \"significant number\" were carrying placards backing the group. ",
        "Content": " Police have made 474 arrests in London after crowds turned out for a Palestine Action demonstration. Metropolitan Police said 466 were detained under the Terrorism Act for showing support for a banned group. Eight more people were arrested for other offences, including five for assaulting officers. The Met said it was the most arrests it's made related to a single operation in at least the past decade. Organiser of the event, Defend Our Juries, earlier said up to 700 people were at the event in Parliament Square and claimed police were preparing for the \"largest mass arrest in their history\". The group said those arrested included former Guantanamo Bay detainee Moazzam Begg, NHS workers, quakers and a blind wheelchair user. The Met said a \"significant number of people\" at the event were seen \"displaying placards expressing support for Palestine Action\". Home Secretary Yvette Cooper said: \"The right to protest is one we protect fiercely but this is very different from displaying support for this one specific and narrow, proscribed organisation. \"Palestine Action was proscribed based on strong security advice following serious attacks the group has committed, involving violence, significant injuries and extensive criminal damage.\"  Police said those arrested had been taken to processing points in Westminster and any whose details could be confirmed were bailed on condition they didn't attend further Palestine Action support events. Others whose details could not be verified, possibly because they refused to give them, were taken to custody suites across London. The protests have put a strain on authorities' capacity to cope. Sky News understands senior leaders in the prison service, known as \"Capacity Gold\", met today to discuss how to deal with the large number of arrests as the male prison estate is close to full. It's understood 800 inmates were moved out of the busiest jails in and around London beforehand. The first of the arrests began just before 1pm, when a man waving a placard that read \"I support Palestine Action\" was stopped by police, writes Gurpreet Narwan, reporting  from Parliament Square. Officers told him he was showing support for a terrorist organisation, searched him and ushered him away. The action soon escalated. Among the people arrested today were a number of elderly people, a blind man in a wheelchair, and a teenager. They were protesting peacefully, with a number of people pointedly seating themselves below statues of Mahatma Gandhi and the suffragette Millicent Fawcett. They told Sky News that they were fully expecting to be arrested but that they felt compelled to speak out and defend the right to protest. One protester said: \"I don't think I'm a criminal. That's not the person I am.\" However, he said he was being guided by his faith and his conscience. Things calmed down after a few hours but there was a heavy police presence well into the afternoon and early evening. Read more:What does proscribing a group mean? Legislation to ban Palestine Action came into force on 5 July, making it a criminal offence to show support for the organisation, carrying a prison sentence of up to 14 years. Defend Our Juries said earlier this week the protest would still go ahead, following several similar demonstrations since it was outlawed last month. On Saturday, a spokesperson said \"Palestine Action and people holding cardboard signs present no danger to the public at large\". Human rights advocates Amnesty International described the arrests of so many people under UK terrorism law as \"deeply concerning\". Another march organised by the Palestine Coalition, which is a separate group, set off from Russell Square and assembled on Whitehall. The Met Police said one person had been arrested there for showing a placard in support of Palestine Action. Earlier this week, three people charged as a result of illegal Palestine Action activity were named. Jeremy Shippam, 71, of West Sussex, Judit Murray, also 71, of Surrey, and Fiona Maclean, 53, of Hackney in east London, will appear at Westminster Magistrates' Court on 16 September. The ban on Palestine Action faces a legal challenge in November after the High Court granted a full judicial review to Palestine Action co-founder Huda Ammori."
    },
    {
        "title": "Migrant protesters face off amid concerns over women and girls' safety",
        "description": "Police in Liverpool were clearly preparing for trouble - with the two sides of protesters and counter-protesters kept well apart by lines of officers carrying riot helmets.",
        "url": "https://news.sky.com/story/migrant-protesters-face-off-in-liverpool-amid-concerns-over-women-and-girls-safety-13409325",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liverpool-protest-migrant_6986754.png?20250809180240",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-08-09 16:41:00",
        "Headline": "In Liverpool, counter-protesters held signs welcoming refugees and occasionally yelled at the other side - sometimes calling them \"Nazis\".",
        "Content": "\n          North of England correspondent\n        Police in Liverpool were clearly preparing for trouble - with the two sides of protesters and counter-protesters kept well apart by lines of officers carrying riot helmets. For the most part though, things remained peaceful, apart from plenty of shouting exchanged between the sides. On the anti-migrant side, we met plenty of women who said they are the new face of these protests - mothers and grandmothers concerned about the safety of their children. One woman said it was \"ridiculous\" to label her far right, although as we were talking shouts of \"Hey Tommy Tommy\" went up from the crowd around us, an apparent reference to the far-right activist Tommy Robinson. Some of the women came dressed in pink, wore Union Jack hair bands, or T-shirts with slogans pointing out they don't look like far-right supporters. Although many were happy to talk to us, at one point we were pushed back from their side by men shouting at us, angry at traditional media being anywhere near the demonstration. Walking across to the other side, people played drums, held signs welcoming refugees and occasionally yelled at the anti-migrant protesters, sometimes calling them \"Nazis\". Read more:Norwich protests were peaceful but anger is bubblingFirst migrants detained under returns deal with France They told me the other side had been fuelled by misinformation, and that this hotel was being used to house legitimate, documented refugees who were welcome to seek help in their city. One man told me \"people are turning up to kick people out of the housing they have been provided - this is not Liverpool\". Elsewhere, hundreds of protesters marched through in Nuneaton after two men, reported to be asylum seekers from Afghanistan, were charged over the rape of a 12-year-old girl. That crowd significantly outnumbered counter-protesters outside Nuneaton's Town Hall on Saturday afternoon. Video footage showed some minor scuffles broke out as police kept order. Other protests took place in Bristol, Bournemouth and Birmingham. Police have expressed concern at the demands on their resources from the protests. Met Police Deputy Assistant Commissioner Ade Adelekan said the scale of the events - combined with those over Gaza - would \"put pressure\" on his force. DAC Adelekan said before the protests began: \"This is going to be a particularly busy few days in London with many simultaneous protests and events that will require a significant policing presence.\""
    },
    {
        "title": "Major incident declared as crews battle Holt Heath fire near Wimborne",
        "description": "A major incident has been declared as about 100 firefighters tackle a blaze at Holt Heath near Wimborne in Dorset.",
        "url": "https://news.sky.com/story/major-incident-declared-as-crews-battle-holt-heath-fire-near-wimborne-13409392",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-wimborne-fire_6986816.jpg?20250809194529",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-09 18:29:00",
        "Headline": "About 100 firefighters and 20 fire engines are tackling a blaze at Holt Heath near Wimborne in Dorset.",
        "Content": " A major incident has been declared as about 100 firefighters tackle a blaze at Holt Heath near Wimborne in Dorset. The public have been warned to stay away and the fire service said it was trying to protect nearby properties by surrounding the blaze. Twenty homes have been evacuated as a precaution and locals told to keep windows and doors shut. Pictures showed smoke billowing into the air from the scene, just north of Bournemouth. Dorset and Wiltshire Fire and Rescue Service said it was called around 11.30am, adding that the fire was being whipped up by the wind. \"This fire is moving quickly and they [the public] could easily get caught out if they are too close and the fire spreads towards them,\" said a statement. Crews could be at the scene for several days, said a senior firefighter, as hotter temperatures are forecast this week - prompting an amber wildfire alert in the area. Antony Bholah, the service's area manager, said at least 20 engines were involved in the operation and that neighbouring fire services were also helping. He said the fire covered an area about 1000m by 800m and expected it would be a few days before it's full extinguished. \"There are some areas that are really difficult to access,\" said Mr Bholah. \"So we're being very cautious about how we approach it and we might call on some additional resources later on this evening.\" It's not yet confirmed how it started, but he said an investigation would be carried out with police and prosecutions could follow if necessary. The public has been warned not to fly drones over the fire as they could interfere with firefighters' own drones. Read more:At least two dead as wildfires sweep Greece, Turkey and France Crews are also still tackling another fire in Dorset - at Newton Heath, near Swanage - that's been burning since last Sunday and affects 21 hectares. That fire is believed to have been started on purpose. People are being urged to make sure cigarette ends are extinguished properly and to not throw them on the ground or from cars. Barbeques on heath land, countryside or open spaces should also be avoided, warned the Dorset and Wiltshire service. Large wildfires burn in Europe Meanwhile, European nations have been dealing with much more destructive fires in what is becoming a growing problem in the summer. At least 1,400 firefighters have been deployed in France's southern Aude region to try to stop the country's biggest wildfire in decades from reigniting. The blaze was contained on Thursday after burning through 62 square miles this week.  Spain is also battling a fire in Avila province, 62 miles west of Madrid. It had been contained by Saturday afternoon but authorities said the coming hours were critical. In Greece, flames were fanned by strong winds in the Keratea region on Friday and reached residential areas 25 miles south of Athens. The same day, smoke also temporarily closed the Dardanelles Strait in northwest Turkey, with a nearby university campus and care home also evacuated. Local media said the fire started in a field in Canakkale province before spreading to a forested area."
    },
    {
        "title": "DWP handling of prosecutions of Post Office staff to be examined in independent review",
        "description": "The Department for Work and Pensions will launch an independent review into its handling of prosecutions against Post Office staff, Sky News has learned.",
        "url": "https://news.sky.com/story/independent-review-to-examine-how-govt-department-handled-prosecutions-of-post-office-staff-13408754",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-post-office-branch_6986135.jpg?20250809021535",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-08-09 01:22:00",
        "Headline": "The independent review will look at the \"methodology and processes\" used by the Department for Work and Pensions, and the \"thoroughness and adequacy\" of efforts to obtain case documents.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  The Department for Work and Pensions will launch an independent review into its handling of prosecutions against Post Office staff, Sky News has learned. About 100 prosecutions were carried out by the DWP between 2001 and 2006 during the Horizon IT scandal. The \"independent assurance review\", however, is yet to be commissioned and will not look at individual cases. It comes more than a year after Sky News discovered joint investigations between the Post Office and the DWP during the scandal - leading to suggestions some may be \"tainted\". Hundreds of subpostmasters were wrongfully convicted of stealing by the Post Office between 1999 and 2015, due to the faulty Horizon IT system.  The DWP told Sky News they have \"committed\" to commissioning the review into prosecutions led by the department, where Post Office staff were investigated for \"welfare-related fraud\". They described cases as \"complex investigations\" which they said were \"backed by evidence including filmed surveillance, stolen benefit books and witness statements\". They also added that \"to date no documentation has been identified showing that Horizon data was essential to these prosecutions\". The review will look at a period of time spanning 20 years covered by the Post Office (Horizon System) Offences Act 2024, from September 1996 to December 2018. The Horizon Act was effectively blanket exoneration legislation which automatically quashed Post Office convictions but did not include DWP or Capture-related prosecutions. The family of Roger Allen, who was convicted in 2004 of stealing pension payments by the DWP and sentenced to six months in prison, are \"frustrated\" the review won't look at his or other cases. Mr Allen died in March last year, still trying to clear his name. Keren Simpson, his daughter, describes the review as a \"development\" but a \"fob off\". \"I think it's just getting us off their backs,\" she said, \"I'll believe it when I see it because they're not taking any accountability. \"They're not acknowledging anything. They're denying everything. \"No one's saying, look, we really need to dig in and have a look at all these cases to see if there's the same pattern here.\"  Mr Allen pleaded guilty to spare his wife - after his lawyer told him in a letter that there had been \"an indication from the Crown that they may discontinue the proceedings against Mrs Allen were you minded to plead guilty\". Despite the Criminal Cases Review Commission deciding Mr Allen had grounds to appeal against his conviction, it was upheld by the Court of Appeal in 2021. The independent review will look at the \"methodology and processes\" used by the DWP, and the \"thoroughness and adequacy\" of efforts to obtain case documents. The DWP say that the review won't be commenting on individual cases or those that have been dismissed by the Court of Appeal.  Potential reviewers will also be approached with experience \"outside of the civil service\". They will be asked to produce a report with recommendations for any further actions within six months of starting their review. Lawyer Neil Hudgell, instructed by some of those prosecuted, described the review as \"wholly inadequate\", saying the DWP \"should not be marking its own homework.\" \"Any involvement in the process of appointing reviewers undermines all confidence in the independence of the process,\" he added.  He also criticised the DWP's statement as \"strikingly defensive and closed minded\". \"It cannot be anything approaching rigorous or robust without a proper case by case review of all affected cases, including those dismissed by the Court of Appeal.\" He said that where hundreds of convictions were quashed \"at the stroke of a pen\" a proper and \"targeted\" review is \"the least these poor victims are owed.\" \"At the moment there is a widespread feeling among the group that they have been \"left behind and that is both legally and morally wrong.\" A Freedom of Information request to the Department of Work and Pensions by Sky News has also found that most cases they prosecuted involved encashment of stolen benefit payment order books. In response to questions over how many prosecutions involved guilty pleas with no trial, the DWP said the information had been destroyed \"in accordance with departmental records management practices\" and in line with data protection."
    },
    {
        "title": "Second arrest after man found dead on bench near Northampton canal",
        "description": "Police have bailed a second person to be arrested after a man was found dead on a bench near the canal in Northampton.",
        "url": "https://news.sky.com/story/second-arrest-after-man-found-dead-on-bench-near-northampton-canal-13408948",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-robert-brown-northamptonshire_6986222.jpg?20250809164711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-09 09:04:00",
        "Headline": "Robert Brown, 57, was found with a fatal arm injury near the River Nene in Northampton town centre at 6.30am on 1 August, police said.",
        "Content": "Police have bailed a second person to be arrested after a man was found dead on a bench near the canal in Northampton. Robert Brown, 57, was found with a fatal arm injury near the River Nene in Northampton town centre at 6.30am on 1 August, Northamptonshire Police said. A 41-year-old man was arrested on suspicion of his murder on Friday. On Saturday, police said he had been released on bail, pending further investigation. Another 38-year-old man had already been arrested on suspicion of murder and is currently on bail. The exact cause of Mr Brown's death is yet to be established, with a post-mortem examination to take place in the coming days. Read more from Sky News:Wembley investigating Oasis fraud claimsNicola Sturgeon's memoir reveals arrest was 'mental torture'British girl returns to UK from IS camp in Syria Paying tribute to him in a statement issued by police on Thursday, Mr Brown's family said he had a \"heart of gold\" and \"was always ready to help others\". \"We are truly devastated that Rob has been taken from us, but reading all the tributes on social media has provided some source of comfort,\" it read. \"It is lovely to know just how many people knew Rob and enjoyed his company. \"We will always miss his chirpy banter, but we know there are many happy memories to share and talk about.\" Detective Inspector Torie Harrison, who is leading the murder investigation, said: \"We are following all lines of enquiry as we work to establish the circumstances of Robert's death and I'm thankful to everyone who has assisted us with our work so far. \"We continue to ask for anyone who may have been in the area of the towpath behind Auctioneers Court from the evening of Thursday, 31 July, to the morning of Friday, 1 August, to contact us. \"Although you may think you don't have any information that could help us, that may not be the case. \"If you think you have any information that may help the investigation, please get in touch.\""
    },
    {
        "title": "Hundreds arrested in 'week-long crackdown' on asylum seekers working for delivery companies",
        "description": "Hundreds of arrests have been made across the UK as part of a \"week-long crackdown\" on asylum seekers taking jobs for delivery firms.",
        "url": "https://news.sky.com/story/hundreds-arrested-in-week-long-crackdown-on-asylum-seekers-working-for-delivery-companies-13408891",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-delivery-driver-moped_6986153.jpg?20250809070818",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-09 02:44:00",
        "Headline": "The Home Office described the operation as a \"nationwide intensification week\" targeting illegal working hotspots, with a focus on the gig economy and people working as food delivery riders.",
        "Content": " Hundreds of arrests have been made across the UK as part of a \"week-long crackdown\" on asylum seekers taking jobs for delivery firms. A total of 1,780 people were stopped and spoken to over suspected illegal working activity between 20 and 27 July. Some 280 were arrested as a result - in areas including Hillingdon in northwest London, Dumfries in Scotland, and Birmingham. Some 89 of those have been detained pending removal from the country and 53 are now having their asylum support reviewed, which the government said could result in their support being suspended or withdrawn.  The Home Office described the operation as a \"nationwide intensification week\" targeting illegal working hotspots, with a focus on the gig economy, where work is assigned on a short-term or job-by-job basis, and people working as food delivery riders. Immigration enforcement teams will receive £5m from the £100m in funding already announced for border security, aimed at increasing visits by officers in these areas over the coming months. Deliveroo, Uber Eats and Just Eat have said they will ramp up facial verification and fraud checks over the coming months to prevent people working as riders without permission.  Border security minister Dame Angela Eagle said: \"Illegal working undermines our border security and we're cracking down hard on it. \"That's why we have intensified our enforcement activity right across the UK to crack down on those who think they can evade immigration and employment laws in the UK. \" Meanwhile, 51 businesses including car washes and restaurants were issued with penalty notices that could see them handed hefty fines if they are found to have hired people without the right to work in the UK. Eddy Montgomery, enforcement director at the Home Office, said officers were taking action \"around the clock\" against \"those who think they can get away with working illegally\". Read more from Sky News:Apollo 13 astronaut diesUK criticises Israel's plan for new Gaza operationRemains of three 9/11 victims identified Asylum seekers in the UK are normally barred from work while their claim is being processed, though permission can be applied for after a year of waiting. Officials had indicated there would be an increase in work to target areas of suspected activity, as ministers hope to tackle the \"pull factors\" attracting migrants to the UK. It comes after the government announced it would share information about asylum hotel locations with food delivery firms in a bid to disrupt such hotspots. Shadow home secretary Chris Philp said the Conservatives wanted to strip asylum seekers of their status and deport them, if they work illegally, and claimed \"this story has only happened\" because he \"exposed what Labour refused to see\". He described one hotel housing asylum seekers as a \"black-market, courier hub in plain sight\", referring to food delivery riders he had seen allegedly operating out of the site without permission. \"Labour are now boasting about arrests, but we know they are too scared to actually deport anyone,\" Mr Philp continued. \"People breaking the law are still being put up in hotels and handed benefits. \"It's a racket and Labour are letting it run.\""
    },
    {
        "title": "Wembley investigating claims people were smuggled into Oasis gig without tickets",
        "description": "Wembley Stadium is investigating claims up to 200 people were able to sneak into its Oasis concerts without tickets.",
        "url": "https://news.sky.com/story/wembley-investigating-claims-people-were-smuggled-into-oasis-gig-without-tickets-13408916",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-liam-gallagher_6975751.jpg?20250728084551",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-09 06:17:00",
        "Headline": "According to reports, up to 200 people paid £350 each to be smuggled into the stadium through a disabled entrance.",
        "Content": "Wembley Stadium is investigating claims up to 200 people were able to sneak into its Oasis concerts without tickets. Oasis played the iconic London venue on five nights between 25 July and 3 August as part of their Live 25 reunion tour. Tickets sold out in hours after the band announced they would be reuniting 16 years after their dramatic split in 2009. Huge demand saw the final cost of attending one of the gigs surge, sparking controversy over dynamic pricing and a lack of transparency. But according to reports in The Sun, some people paid £350 each to be smuggled into the stadium through a disabled entrance across all five shows. They allegedly used copies of the same ticket to get through security, who handed them wristbands giving them access to the VIP area in front of the stage. Sky News understands that six people were arrested for suspected unauthorised entry across the five shows and 24 were ejected on the same grounds. Read more:What it was like to see Oasis reunitedChris Hemsworth on Alzheimer's risk One of those who sneaked in told the newspaper: \"We were given our tickets, which were all the same, and a woman drew a shape on our hands. \"We were told to go to the disabled door at entrance M, even though our tickets said entrance F. \"We showed our stamped hands to the person on the door, they scanned the tickets, even though we all had the same one, and let us in. \"Another member of staff then handed us a golden circle wristband and that was it. There were zero security searches. We just walked straight in.\" A Wembley Stadium spokesperson told Sky News in a statement: \"Entering Wembley Stadium without a ticket is a serious offence and we are investigating these allegations. \"If they are substantiated, we will refer our evidence to the police.\" Oasis will return to Wembley for two nights on 27 and 28 September. They are still to play in several other venues throughout the UK - including Edinburgh's Murrayfield Stadium and Dublin's Croke Park - before heading to Japan, South Korea, South America, Australia, and North America later this year. The band expressed their condolences after one fan, 45-year-old Lee Claydon, died at one of the Wembley gigs."
    },
    {
        "title": "Trump 'considering' whether to invite Zelenskyy to Putin meeting in Alaska",
        "description": "The White House is considering inviting Volodymyr Zelenskyy to a meeting between Donald Trump and Vladimir Putin in Alaska, according to reports in the US.",
        "url": "https://news.sky.com/story/white-house-considering-inviting-zelenskyy-to-trump-putin-meeting-in-alaska-reports-13409490",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-09 22:03:00",
        "Headline": "The reports come a day after Washington and Moscow confirmed the US and Russian presidents will meet on Friday 15 August to discuss the war in Ukraine.",
        "Content": " The White House is considering inviting Volodymyr Zelenskyy to a meeting between Donald Trump and Vladimir Putin in Alaska, according to reports in the US. The reports come a day after Washington and Moscow confirmed the US and Russian presidents will meet on Friday to discuss bringing about an end to the war in Ukraine. A senior US official and three people briefed on internal discussions have told Sky News' US partner network NBC News that the Trump administration is now considering inviting the Ukrainian president to the summit. \"It's being discussed,\" one of the people briefed on the talks was quoted as saying.  The sources said a visit by Mr Zelenskyy has not been finalised - and it is unclear whether the Ukrainian leader will be in Alaska. However, the senior administration official said it is \"absolutely\" possible. \"Everyone is very hopeful that would happen,\" the official said. \n                  Stakes high for Trump-Putin summit as Zelenskyy faces nightmare deal\n                 \n                  Desperation as Gaza suffers through heatwave - and a sense of hopelessness in Tel Aviv \n                 \n                  'He never left Gaza in his mind': Israeli soldier died by suicide after being ordered to return\n                 Asked whether the US had officially invited Mr Zelenskyy, a senior White House official said: \"The president remains open to a trilateral summit with both leaders. Right now, the White House is focusing on planning the bilateral meeting requested by President Putin.\" On Friday - before the summit was confirmed - Mr Trump had told reporters at the White House that \"we're getting very close to a deal\" that would end the conflict. The US president added there will be \"some swapping of territories to the betterment of both sides\".  Zelenskyy suggests he's unwilling to give up territory Yesterday, the Ukrainian president warned that allowing Russia to keep territory it has occupied in Ukraine will result in another invasion. He said allowing Mr Putin to annex Crimea in 2014 didn't prevent Russia forces from occupying more parts of Ukraine during the current conflict. Mr Zelenskyy added: \"Now, Putin wants to be forgiven for seizing the south of our Kherson region, Zaporizhzhia, the entire territory of Luhansk and Donetsk regions, and Crimea. We will not allow this second attempt to partition Ukraine. \"Knowing Russia - where there is a second, there will be a third.\"  NATO allies say Ukraine must be involved in negotiations Ukraine and several NATO allies have reportedly been privately concerned Mr Trump might agree to Mr Putin's proposals for ending the war without taking their positions into account. In a joint statement last night, UK Prime Minister Sir Keir Starmer and the leaders of France, Italy, Germany, Poland, Finland and the European Commission said Ukraine's future cannot be decided without Kyiv. They said: \"Ukraine has the freedom of choice over its own destiny. Meaningful negotiations can only take place in the context of a ceasefire or reduction of hostilities. \"The path to peace in Ukraine cannot be decided without Ukraine. \"We remain committed to the principle that international borders must not be changed by force. \"The current line of contact should be the starting point of negotiations.\" Read analysis:Lifting sanctions a 'massive victory for Moscow'Stakes high for Alaska summit as Zelenskyy faces nightmare dealWhy Trump will have a lot of ice to break at Alaska summit UK hosts Ukrainian officials ahead of summit Earlier, Foreign Secretary David Lammy hosted a meeting of top Ukrainian officials and European national security advisers alongside US Vice President JD Vance. The meeting took place at Chevening, the foreign secretary's official country retreat in Kent, where Mr Vance is staying at the start of a UK holiday. After the meeting, Mr Lammy said: \"The UK's support for Ukraine remains ironclad as we continue working towards a just and lasting peace.\" It is understood that the meeting had been called at Washington's request, and included representatives from the US, Ukraine, France, Germany, Italy, Finland and Poland, as well as the UK. Ukraine was represented by Rustem Umerov, secretary of the country's national security and defence council, and the head of Mr Zelenskyy's office, Andriy Yermak. In a post on social media, Mr Yermak said the allies' positions were \"clear\" that \"a reliable, lasting peace is only possible with Ukraine at the negotiating table, with full respect for our sovereignty and without recognising the occupation\". Ahead of the meeting, Sir Keir discussed the talks in a call with Mr Zelenskyy, and also spoke to French President Emmanuel Macron. A Downing Street spokeswoman said Sir Keir and Mr Macron \"discussed the latest developments in Ukraine, reiterating their unwavering support for President Zelenskyy and to securing a just and lasting peace for the Ukrainian people\"."
    },
    {
        "title": "Stakes high for Trump-Putin summit as Zelenskyy faces nightmare deal",
        "description": "For Ukraine - its exhausted, brave soldiers, its thousands of bereaved families mourning their dead, and its beleaguered president - it is exactly what they feared it would be.&#160;",
        "url": "https://news.sky.com/story/stakes-high-for-trump-putin-summit-as-zelenskyy-faces-nightmare-deal-13409203",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-volodymyr-zelenskyy_6984706.jpg?20250807104109",
        "type": "World",
        "Author": "Mark Austin",
        "Date Published": "2025-08-09 15:34:00",
        "Headline": "President Trump wants a deal on Ukraine - any deal - that he can chalk up as a win. He wants it badly and he wants it now.",
        "Content": "\n          Chief presenter\n        For Ukraine - its exhausted, brave soldiers, its thousands of bereaved families mourning their dead, and its beleaguered president - it is exactly what they feared it would be.  They fear the compromise they will be forced to make will be messy, costly, unfair and ultimately beneficial to the invading tyrant who brought death and destruction to their sovereign land. Six weeks ago, I spoke to President Zelenskyy in London. War latest: Team Trump 'risk being out of their depth' at Putin meeting I put it to him in our Sky News interview that Presidents Trump and Putin were heading towards making a deal between themselves, a grand bargain, in which Ukraine was but one piece on the chess board. Zelenskyy smiled as if to acknowledge the reality ahead. He paused and then he said this: \"We are not going to be a card in talks between great nations, and we will never accept that… I definitely do not want to see global deals between America and Russia. \n                  Trump 'considering' whether to invite Zelenskyy to Putin meeting in Alaska\n                 \n                  Desperation as Gaza suffers through heatwave - and a sense of hopelessness in Tel Aviv \n                 \n                  'He never left Gaza in his mind': Israeli soldier died by suicide after being ordered to return\n                 \"We don't need it. We are a separate story, a victim of Russian aggression and we will not reward it.\"  It was a response that betrayed his greatest fear - that this will become essentially a Trump negotiation in which Zelenskyy and Ukraine will be told \"take it or leave it\". And, by the way, if you \"leave it\", then it will be painful. Harsh realities It's the prospect that now confronts Zelenskyy as Trump and Putin plough ahead on a course that has clear attractions for both of them. Of course, Zelenskyy is right to say there can be no deal without Ukraine. But there are harsh realities at play here. President Trump wants a deal on Ukraine - any deal - that he can chalk up as a win. He wants it badly and he wants it now. It's the impediment to a broader strategic deal with Putin and he wants it out of the way. It's what he does, and it's the way he does it. And President Putin knows it. He knows Trump, he sees an opportunity in Trump, and he can't get across Russia to Alaska fast enough. He will be back at global diplomacy's top table. Always a deal to be done Make no mistake, when Trump says he just wants to stop the killing, he means it. Such wanton loss of young lives offends him. He keeps saying it. He sees war, by and large, as an unnecessary waste of life and of money. Deals are there to be done. There's always a deal.  Sadly for Ukraine, in this case, it is unlikely to be a fair deal. How can any deal be \"fair\" when you are the victim of outrageous brutality and heinous crimes. Read more:Putin and Trump to meet in Alaska on FridayTrump will have a lot of ice to break with Putin - analysis But it may well be the deal they have to take unless they want to fight an increasingly one-sided war with much less help from President Trump and America. A senior UK diplomat told me if things turn out as feared, it should not be called a land-for-peace deal. It should be called annexation \"because that's what it is\". But here's the rub. Peace, calm, the end of the nightly terror of war has much to recommend it. In short, a bad peace can often seem better than no peace. But, ultimately, rewarded dictators always come back for more. If Ukraine has to accept a bad peace, then it will want clear security guarantees to make sure it cannot happen again. It is the very least they deserve. There is much at stake in Alaska."
    },
    {
        "title": "Lifting sanctions on Putin for Trump meeting is a massive victory for Moscow",
        "description": "The location of Alaska is unexpected.",
        "url": "https://news.sky.com/story/an-invitation-to-alaska-signals-the-end-of-putins-international-isolation-13408945",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin_6985261.jpg?20250808025345",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-09 08:20:00",
        "Headline": "To allow his visit to happen, the US Treasury Department will presumably have to lift sanctions on Vladimir Putin, as it did when his investment envoy Kirill Dmitriev flew to Washington in April.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n The location of Alaska is unexpected. Although close to Russia geographically - less than three miles away at the narrowest point - it's a very long way from neutral ground. The expectation was they would meet somewhere in the middle. Saudi Arabia perhaps, or the United Arab Emirates. But no, Vladimir Putin will be travelling to Donald Trump's backyard. Follow latest: Zelenskyy says Ukraine will not give up land It'll be the first time the Russian president has visited the US since September 2015, when he spoke at the UN General Assembly. Barack Obama was in the White House. How times have changed a decade on. The US is not a member of the International Criminal Court, so there's no threat of arrest for Vladimir Putin. But to allow his visit to happen, the US Treasury Department will presumably have to lift sanctions on the Kremlin leader, as it did when his investment envoy Kirill Dmitriev flew to Washington in April. And I think that points to one reason why Putin would agree to a summit in Alaska.  Read more:Analysis: Trump will have a lot of ice to breakExplainer: What would a Ukraine ceasefire involve? Instead of imposing sanctions on Russia, as Trump had threatened in recent days, the US would be removing one. Even if only temporary, it would be hugely symbolic and a massive victory for Moscow. The American leader might think he owns the optics - the peace-making president ordering a belligerent aggressor to travel to his home turf - but the visuals more than work for Putin too. Shunned by the West since his invasion, this would signal an emphatic end to his international isolation. Donald Trump has said a ceasefire deal is close. The details are still unclear but there are reports it could involve Ukraine surrendering territory, something Volodymyr Zelenskyy has always adamantly opposed. Either way, Putin will have what he wants - the chance to carve up his neighbour without Kyiv being at the table. And that's another reason why Putin would agree to a summit, regardless of location. Because it represents a real possibility of achieving his goals. It's not just about territory for Russia. It also wants permanent neutrality for Ukraine and limits to its armed forces - part of a geopolitical strategy to prevent NATO expansion. In recent months, despite building US pressure, Moscow has shown no intention of stopping the war until those demands are met. It may be that Vladimir Putin thinks a summit with Donald Trump offers the best chance of securing them."
    },
    {
        "title": "It's been four years since a US president met Putin - and Trump will have a lot of ice to break",
        "description": "Donald Trump and Vladimir Putin will meet where their countries brush shoulders.",
        "url": "https://news.sky.com/story/its-been-four-years-since-a-us-president-met-putin-and-trump-will-have-a-lot-of-ice-to-break-13408894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-moscow-donald-trump_6828273.jpg?20250214011401",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-08-09 02:40:00",
        "Headline": "A US-Russia summit in Alaska is geography as metaphor and message. Choosing this location signals strategic parity - with both leaders face to face in a place where their interests literally meet.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Donald Trump and Vladimir Putin will meet where their countries brush shoulders. But why Alaska and why now? A US-Russia summit in Alaska is geography as metaphor and message. Alaska physically bridges both countries across the polar expanse. Follow latest: Ukraine war live updates Choosing this location signals strategic parity - the US and Russian leaders face to face in a place where their interests literally meet. Alaska has surged in geopolitical importance due to its untapped fossil fuels. \n                  Donald Trump reveals when - and where - he will meet Putin for Ukraine talks\n                 \n                  Trump's approach to peacemaking is a choice between waging war or doing business\n                 \n                  US doubles reward for Venezuelan President Maduro's arrest to $50m\n                 Trump has aggressively pushed for more control in the Arctic, plans for Greenland and oil access. Holding talks there centres the conversation where global energy and territorial stakes are high, and the US president thrives on spectacle. A dramatic summit in the rugged frontier of Alaska plays into his flair for the theatrical. It is brand Trump - a stage that frames him as bold, unorthodox and in command. It was 2021 when a US president last came face-to-face with a Russian president. The leaders of the two countries haven't met since Russia invaded Ukraine. But Trump is in touch with all sides - Russia, Ukraine and European leaders - and says they all, including Putin, want \"to see peace\". He's even talking up the potential shape of any deal and how it might involve the \"swapping of territory\". Volodymyr Zelenskyy has repeatedly insisted he will not concede territory annexed by Russia. Moscow has sent the White House a list of demands in return for a ceasefire. Read more:Russia reacts to Trump talks planJD Vance raises concerns about free speech in UK  Trump is attempting to secure buy-in from Zelenskyy and other European leaders. He styles himself as \"peacemaker-in-chief\" and claims credit for ending six wars since he returned to office 200 days ago. There's much ice to break if he's to secure a coveted seventh one in Alaska."
    },
    {
        "title": "UK joins four countries in condemning Israel's plan for new operation in Gaza",
        "description": "The UK and four allies have criticised Israel's decision to launch a new large-scale military operation in Gaza - warning it will \"aggravate the catastrophic humanitarian situation\" in the territory.",
        "url": "https://news.sky.com/story/uk-criticises-israels-plan-for-new-military-operation-in-gaza-as-us-ambassador-hits-out-at-starmer-13408889",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-city_6986137.jpg?20250809030812",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-09 00:06:00",
        "Headline": "The plan will \"endanger the lives of hostages\" and \"risk violating international humanitarian law\", a joint statement says.",
        "Content": " The UK and four allies have criticised Israel's decision to launch a new large-scale military operation in Gaza - warning it will \"aggravate the catastrophic humanitarian situation\" in the territory. The foreign ministers of Britain, Australia, Germany, Italy, France, Canada, Austria, Norway, and New Zealand said in a joint statement that the offensive will \"endanger the lives of hostages\" and \"risk violating international humanitarian law\". It comes a day after Israel's security cabinet approved an operation to take military control of Gaza City - and concluded a full takeover of the enclave is required to end the conflict. It marks another escalation in the war in Gaza, sparked by the Hamas attack of 7 October 2023.  In their joint statement, the UK and its allies said they \"strongly reject\" the decision, adding: \"It will endanger the lives of the hostages and further risk the mass displacement of civilians. \"The plans that the government of Israel has announced risk violating international humanitarian law. Any attempts at annexation or of settlement extension violate international law.\" The countries also called for a permanent ceasefire as \"the worst-case scenario of famine is unfolding in Gaza\". It comes as Sky News analysis has found that airdrops of aid are making little difference to Gaza's hunger crisis, and pose serious risks to the population - with a father-of-two killed by a falling package. Meanwhile, France, Canada, Qatar, the United Arab Emirates and the United Nations all criticised Israel's plan for a full occupation of Gaza. Israeli Prime Minister Benjamin Netanyahu \"expressed his disappointment\" with German Chancellor Friedrich Merz's in phone call on Friday after Berlin decided it would stop selling arms to Israel. In a post on X, the Israeli prime minister's office added: \"Instead of supporting Israel's just war against Hamas, which carried out the most horrific attack against the Jewish people since the Holocaust, Germany is rewarding Hamas terrorism by embargoing arms to Israel.\"  US ambassador hits out at Starmer Earlier on Friday, the US Ambassador to Israel, Mike Huckabee, criticised Sir Keir Starmer after he said Israel's decision to \"escalate its offensive\" in Gaza is \"wrong\". Mr Huckabee wrote on X: \"So Israel is expected to surrender to Hamas & feed them even though Israeli hostages are being starved? Did UK surrender to Nazis and drop food to them? Ever heard of Dresden, PM Starmer? That wasn't food you dropped. If you had been PM then UK would be speaking German!\" Read more:Analysis: Israel likely faces an impossible taskHow life and colour has been stripped from Gaza In another post around an hour later Mr Huckabee wrote: \"How much food has Starmer and the UK sent to Gaza? \"@IsraeliPM has already sent 2 MILLION TONS into Gaza & none of it even getting to hostages.\" Sir Keir has pledged to recognise a Palestinian state in September unless the Israeli government meets a series of conditions towards ending the war in Gaza. The UK and its allies criticised Israel as US President JD Vance and UK Foreign Secretary David Lammy met at Chevening House in Kent on Friday.  Mr Vance described a \"disagreement\" about how the US and UK could achieve their \"common objectives\" in the Middle East, and said the Trump administration had \"no plans to recognise a Palestinian state\". He said: \"I don't know what it would mean to really recognise a Palestinian state given the lack of functional government there.\" Mr Vance added: \"There's a lot of common objectives here. There is some, I think, disagreement about how exactly to accomplish those common objectives, but look, it's a tough situation.\" The UN Security Council will meet on Saturday to discuss the situation in the Middle East. Ambassador Riyad Mansour, permanent observer of the State of Palestine to the United Nations, said earlier on Friday that a number of countries would be requesting a meeting of the UN Security Council on Israel's plans."
    },
    {
        "title": "Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's",
        "description": "Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations.",
        "url": "https://news.sky.com/story/chris-hemsworth-actor-on-gear-shift-in-his-life-motivations-after-increased-alzheimers-risk-13408682",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chris-hemsworth-actor_6985808.jpg?20250808181919",
        "type": "World",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-08-09 02:14:00",
        "Headline": "One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double-carriers showed key early signs of the disease which causes dementia by the age of 55.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations. During a genetic test in season one of Limitless: Live Better Now, the Australian actor discovered that he is, biologically, eight to 10 times more likely than others to have the brain disorder during his lifetime as he carries two copies of the APOE4 gene. He had first taken part in the National Geographic show to be its \"guinea pig\" and face new experiences that challenge the body and mind. But after having the test, the 41-year-old Thor, Furiosa and Transformers star was faced with an unexpected truth. One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double carriers showed key early signs of the disease which causes dementia by the age of 55. Everyone's risk is different, and evidence suggests there are things you can do to reduce your risk whether you're a carrier of the gene or not, including not smoking, reducing alcohol intake, daily exercise, monitoring cholesterol and blood pressure and eating a balanced diet. Speaking of when he found out he was a double carrier, Hemsworth told Sky News: \"It was just kind of this point in my life where up until your 40s, you're kind of gathering data and information and it's all reactionary and then you get to a point where you think, oh some of this sort of identity that I've sort of built doesn't hold true anymore. \n                  Wembley investigating claims people were smuggled into Oasis gig without tickets\n                 \n                  Mandalorian actor Gina Carano settles lawsuit with Disney – and thanks Elon Musk for funding it\n                 \n                  Eddie Murphy: I'll get an Oscar eventually - when I'm old and have no teeth\n                 \"There's some inner sort of protest or inner voice that has a deeper need to understand and there's deeper questions and what is the purpose and the why behind what I'm doing ... and what am I seeking, what am I contributing, as opposed to just what I am collecting.\" Reacting on screen, he said it made him shift his focus to living better and increase the chances of him spending as much time as possible with his family and friends. What's changed in the second series? The change in mindset is evident in season two. \"This time around, I was very involved in the orchestration and the sort of production and bringing together spaces that I was interested in or there was a deep curiosity or were deeply personal to me. And it was more sort of experiential journalism as opposed to a contestant in a challenging kind of fun, reality show. He adds: \"I was much more committed or invested in the experience. \"And I was a bit more educated on the topics too. I had to research, I had a deeper point of view, I suppose, personally, but also sort of the education I was given prior and I enjoyed that more, to be honest, I didn't like that I felt very uncomfortable in the first season because I was standing around all these experts and I knew nothing about these topics, yet I was kind of asked to speak on them and so I felt like an imposter the entire time.\" Limitless: Live Better Now looks at the ways in which you can improve your brain and body's health through endurance challenges and learning a new instrument. Read more entertainment and arts news:Actor settles lawsuit with Disney - and thanks Musk for funding itEddie Murphy: I'll get an Oscar eventually Teaming up with Sheeran Hemsworth chose the drums and, taking it to the extreme, was set the task of joining his friend Ed Sheeran on stage to play Thinking Out Loud. \"That fear and that anxiety was incredibly overwhelming,\" Hemsworth says, detailing how he felt \"underwater\" in the weeks leading up to the event. \"It's weird the way intense situations actually cause a hyper focus; it's a survival mechanism of the brain. \"Some of the other challenges where if I did the training it was beneficial, but I could kind of muscle my way through it. You can't do that with a musical instrument and then the realisation that the entire band is relying on you to keep time. And then 70,000 people are sitting there going, 'please don't wreck our favourite song'.\" Reflecting on the moment, he says it's one of the most magical feelings he's ever had. \"The joy was unlike anything I've ever experienced. You know, if you could bottle that and have it in a healthy way and not have all the negatives that someone may have for it, it was amazing. It was a true kind of one of my first probably proper out of body experiences, I suppose. \"It was like, I kind of remember being in the out, looking down at myself almost, kind of going, wow, I'm kind of floating along with this thing that's so much bigger than me and I'm in true sort of flow state with it.\" National Geographic's Limitless: Live Better Now is available to stream on Disney+ from 15 August."
    },
    {
        "title": "It's been four years since a US president met Putin - and Trump will have a lot of ice to break",
        "description": "Donald Trump and Vladimir Putin will meet where their countries brush shoulders.",
        "url": "https://news.sky.com/story/its-been-four-years-since-a-us-president-met-putin-and-trump-will-have-a-lot-of-ice-to-break-13408894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-moscow-donald-trump_6828273.jpg?20250214011401",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-09 02:40:00",
        "Headline": "A US-Russia summit in Alaska is geography as metaphor and message. Choosing this location signals strategic parity - with both leaders face to face in a place where their interests literally meet.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Donald Trump and Vladimir Putin will meet where their countries brush shoulders. But why Alaska and why now? A US-Russia summit in Alaska is geography as metaphor and message. Alaska physically bridges both countries across the polar expanse. Follow latest: Ukraine war live updates Choosing this location signals strategic parity - the US and Russian leaders face to face in a place where their interests literally meet. Alaska has surged in geopolitical importance due to its untapped fossil fuels. \n                  Donald Trump reveals when - and where - he will meet Putin for Ukraine talks\n                 \n                  Trump's approach to peacemaking is a choice between waging war or doing business\n                 \n                  US doubles reward for Venezuelan President Maduro's arrest to $50m\n                 Trump has aggressively pushed for more control in the Arctic, plans for Greenland and oil access. Holding talks there centres the conversation where global energy and territorial stakes are high, and the US president thrives on spectacle. A dramatic summit in the rugged frontier of Alaska plays into his flair for the theatrical. It is brand Trump - a stage that frames him as bold, unorthodox and in command. It was 2021 when a US president last came face-to-face with a Russian president. The leaders of the two countries haven't met since Russia invaded Ukraine. But Trump is in touch with all sides - Russia, Ukraine and European leaders - and says they all, including Putin, want \"to see peace\". He's even talking up the potential shape of any deal and how it might involve the \"swapping of territory\". Volodymyr Zelenskyy has repeatedly insisted he will not concede territory annexed by Russia. Moscow has sent the White House a list of demands in return for a ceasefire. Read more:Russia reacts to Trump talks planJD Vance raises concerns about free speech in UK  Trump is attempting to secure buy-in from Zelenskyy and other European leaders. He styles himself as \"peacemaker-in-chief\" and claims credit for ending six wars since he returned to office 200 days ago. There's much ice to break if he's to secure a coveted seventh one in Alaska."
    },
    {
        "title": "Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's",
        "description": "Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations.",
        "url": "https://news.sky.com/story/chris-hemsworth-actor-on-gear-shift-in-his-life-motivations-after-increased-alzheimers-risk-13408682",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chris-hemsworth-actor_6985808.jpg?20250808181919",
        "type": "US",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-08-09 02:14:00",
        "Headline": "One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double-carriers showed key early signs of the disease which causes dementia by the age of 55.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations. During a genetic test in season one of Limitless: Live Better Now, the Australian actor discovered that he is, biologically, eight to 10 times more likely than others to have the brain disorder during his lifetime as he carries two copies of the APOE4 gene. He had first taken part in the National Geographic show to be its \"guinea pig\" and face new experiences that challenge the body and mind. But after having the test, the 41-year-old Thor, Furiosa and Transformers star was faced with an unexpected truth. One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double carriers showed key early signs of the disease which causes dementia by the age of 55. Everyone's risk is different, and evidence suggests there are things you can do to reduce your risk whether you're a carrier of the gene or not, including not smoking, reducing alcohol intake, daily exercise, monitoring cholesterol and blood pressure and eating a balanced diet. Speaking of when he found out he was a double carrier, Hemsworth told Sky News: \"It was just kind of this point in my life where up until your 40s, you're kind of gathering data and information and it's all reactionary and then you get to a point where you think, oh some of this sort of identity that I've sort of built doesn't hold true anymore. \n                  Wembley investigating claims people were smuggled into Oasis gig without tickets\n                 \n                  Mandalorian actor Gina Carano settles lawsuit with Disney – and thanks Elon Musk for funding it\n                 \n                  Eddie Murphy: I'll get an Oscar eventually - when I'm old and have no teeth\n                 \"There's some inner sort of protest or inner voice that has a deeper need to understand and there's deeper questions and what is the purpose and the why behind what I'm doing ... and what am I seeking, what am I contributing, as opposed to just what I am collecting.\" Reacting on screen, he said it made him shift his focus to living better and increase the chances of him spending as much time as possible with his family and friends. What's changed in the second series? The change in mindset is evident in season two. \"This time around, I was very involved in the orchestration and the sort of production and bringing together spaces that I was interested in or there was a deep curiosity or were deeply personal to me. And it was more sort of experiential journalism as opposed to a contestant in a challenging kind of fun, reality show. He adds: \"I was much more committed or invested in the experience. \"And I was a bit more educated on the topics too. I had to research, I had a deeper point of view, I suppose, personally, but also sort of the education I was given prior and I enjoyed that more, to be honest, I didn't like that I felt very uncomfortable in the first season because I was standing around all these experts and I knew nothing about these topics, yet I was kind of asked to speak on them and so I felt like an imposter the entire time.\" Limitless: Live Better Now looks at the ways in which you can improve your brain and body's health through endurance challenges and learning a new instrument. Read more entertainment and arts news:Actor settles lawsuit with Disney - and thanks Musk for funding itEddie Murphy: I'll get an Oscar eventually Teaming up with Sheeran Hemsworth chose the drums and, taking it to the extreme, was set the task of joining his friend Ed Sheeran on stage to play Thinking Out Loud. \"That fear and that anxiety was incredibly overwhelming,\" Hemsworth says, detailing how he felt \"underwater\" in the weeks leading up to the event. \"It's weird the way intense situations actually cause a hyper focus; it's a survival mechanism of the brain. \"Some of the other challenges where if I did the training it was beneficial, but I could kind of muscle my way through it. You can't do that with a musical instrument and then the realisation that the entire band is relying on you to keep time. And then 70,000 people are sitting there going, 'please don't wreck our favourite song'.\" Reflecting on the moment, he says it's one of the most magical feelings he's ever had. \"The joy was unlike anything I've ever experienced. You know, if you could bottle that and have it in a healthy way and not have all the negatives that someone may have for it, it was amazing. It was a true kind of one of my first probably proper out of body experiences, I suppose. \"It was like, I kind of remember being in the out, looking down at myself almost, kind of going, wow, I'm kind of floating along with this thing that's so much bigger than me and I'm in true sort of flow state with it.\" National Geographic's Limitless: Live Better Now is available to stream on Disney+ from 15 August."
    },
    {
        "title": "Advertising mogul Sorrell approached about S4 Capital deal",
        "description": "Sir Martin Sorrell, the advertising mogul, has received a number of merger approaches for S4 Capital, the London-listed marketing services group he founded seven years ago.",
        "url": "https://news.sky.com/story/advertising-mogul-sorrell-approached-about-s4-capital-deal-13408944",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sir-martin-sorrell_6986143.jpg?20250809063252",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-09 08:18:00",
        "Headline": "One Equity Partners, the owner of creative agency group MSQ, is among the parties which have sounded out Sir Martin Sorrell about a tie-up with the company he founded in 2018, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Sir Martin Sorrell, the advertising mogul, has received a number of merger approaches for S4 Capital, the London-listed marketing services group he founded seven years ago. Sky News can reveal that Sir Martin has been contacted in recent weeks by potential suitors including One Equity Partners, a US-based private equity firm which focuses on acquiring companies in the healthcare, industrials, and technology sectors. This weekend, analysts suggested that One Equity would seek to combine S4 Capital with MSQ, a creative and technology agency group it bought in 2023. Further details of the possible tie-up were unclear on Saturday, including whether a formal proposal had been made or whether S4 Capital might remain listed on the London Stock Exchange if a deal were to be completed. S4 Capital is also understood to have attracted recent interest from other parties, the identities of which could not be immediately established. In March 2024, the Wall Street Journal reported that Sir Martin had rebuffed several offers from Stagwell, an advertising group led by Mark Penn, a former adviser to President Bill Clinton. New Mountain Capital, another American private equity firm, was also said at the time to have held talks about buying parts or all of S4 Capital. Read more from Sky NewsFreddo creator's daughter will never buy one againVisma owners close to picking banks for £16bn floatReeves's flagship policy could end up having opposite effect News of One Equity's approach puts the venture founded by one of Britain's most prominent business figures firmly in play after a torrid period in which it has been buffeted by macroeconomic headwinds and a number of accounting issues. Sir Martin founded S4 Capital in 2018, months after his unexpected and acrimonious departure from WPP, the group he transformed from a manufacturer of wire baskets into the world's largest provider of marketing services. The businessman, who has voting control at S4 Capital, used his deep network of institutional relationships to raise money for an acquisition spree at S4, which included technology-focused agencies such as MediaMonks and MightyHive. S4's clients now include Alphabet, Amazon, General Motors, Meta, T-Mobile, and Walmart. Sir Martin's decision to target acquisitions in the digital content and programmatic media arenas reflected the priorities of what he described as a marketing services group for a new era. At WPP, he was the architect of a now-widely replicated strategy to assemble hundreds of agency brands under one holding company. By the time he stepped down, WPP was the owner of creative agency networks such as JWT and Ogilvy, while its media-buying muscle was channelled through the global subsidiary GroupM. The latest approaches for S4 Capital come during a period of profound change in the global marketing services industry, as artificial intelligence dismantles practices and creative processes that had evolved over decades. Sir Martin has spurned few opportunities to criticise his successor at WPP, Mark Read, as well as the wider advertising industry, in the seven years since he established S4 Capital. Last month, WPP announced that Mr Read would be replaced by Cindy Rose, a senior Microsoft executive who has sat on the company's board as a non-executive director since 2019. \"Cindy has supported the digital transformation of large enterprises around the world - including embracing AI to create new customer experiences, business models and revenue streams,\" the WPP chairman, Philip Jansen, said. \"Her expertise in this landscape will be hugely valuable to WPP as the industry navigates fundamental changes and macroeconomic uncertainty.\" WPP has also forfeited its status as the world's largest marketing services empire to Publicis, and will be shunted even further behind the sector's biggest players once Omnicom Group's $13.25bn (£9.85bn) takeover of Interpublic Group is completed. At the time of Sir Martin's exit from WPP in April 2018, the company had a market capitalisation of more than £16bn. On Friday, its market value at its closing share price of 367.5p was just £4.23bn. Last month, the advertising industry news outlet Campaign reported that WPP had held tentative discussions with the consulting firm Accenture about a potential combination or partnership, underscoring the pressure on legacy marketing services groups. This weekend, it remained unclear how likely it was that Sir Martin would consummate a deal to combine S4 Capital with another industry player such as One Equity-owned MSQ. Shares in S4 Capital closed on Friday at 21.2p, giving the company a market capitalisation of £140m. The stock has fallen by nearly 60% during the last 12 months, and is more than 90% lower than its peak in 2022. At one point, Sir Martin's stake in S4 Capital was valued at close to £500m. A spokeswoman for S4 declined to comment, while a spokesman for One Equity Partners said by email: \"OEP is not commenting on this matter.\""
    },
    {
        "title": "UK joins four countries in condemning Israel's plan for new operation in Gaza",
        "description": "The UK and four allies have criticised Israel's decision to launch a new large-scale military operation in Gaza - warning it will \"aggravate the catastrophic humanitarian situation\" in the territory.",
        "url": "https://news.sky.com/story/uk-criticises-israels-plan-for-new-military-operation-in-gaza-as-us-ambassador-hits-out-at-starmer-13408889",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-city_6986137.jpg?20250809030812",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-09 00:06:00",
        "Headline": "The plan will \"endanger the lives of hostages\" and \"risk violating international humanitarian law\", a joint statement says.",
        "Content": " The UK and four allies have criticised Israel's decision to launch a new large-scale military operation in Gaza - warning it will \"aggravate the catastrophic humanitarian situation\" in the territory. The foreign ministers of Britain, Australia, Germany, Italy, France, Canada, Austria, Norway, and New Zealand said in a joint statement that the offensive will \"endanger the lives of hostages\" and \"risk violating international humanitarian law\". It comes a day after Israel's security cabinet approved an operation to take military control of Gaza City - and concluded a full takeover of the enclave is required to end the conflict. It marks another escalation in the war in Gaza, sparked by the Hamas attack of 7 October 2023.  In their joint statement, the UK and its allies said they \"strongly reject\" the decision, adding: \"It will endanger the lives of the hostages and further risk the mass displacement of civilians. \"The plans that the government of Israel has announced risk violating international humanitarian law. Any attempts at annexation or of settlement extension violate international law.\" The countries also called for a permanent ceasefire as \"the worst-case scenario of famine is unfolding in Gaza\". It comes as Sky News analysis has found that airdrops of aid are making little difference to Gaza's hunger crisis, and pose serious risks to the population - with a father-of-two killed by a falling package. Meanwhile, France, Canada, Qatar, the United Arab Emirates and the United Nations all criticised Israel's plan for a full occupation of Gaza. Israeli Prime Minister Benjamin Netanyahu \"expressed his disappointment\" with German Chancellor Friedrich Merz's in phone call on Friday after Berlin decided it would stop selling arms to Israel. In a post on X, the Israeli prime minister's office added: \"Instead of supporting Israel's just war against Hamas, which carried out the most horrific attack against the Jewish people since the Holocaust, Germany is rewarding Hamas terrorism by embargoing arms to Israel.\"  US ambassador hits out at Starmer Earlier on Friday, the US Ambassador to Israel, Mike Huckabee, criticised Sir Keir Starmer after he said Israel's decision to \"escalate its offensive\" in Gaza is \"wrong\". Mr Huckabee wrote on X: \"So Israel is expected to surrender to Hamas & feed them even though Israeli hostages are being starved? Did UK surrender to Nazis and drop food to them? Ever heard of Dresden, PM Starmer? That wasn't food you dropped. If you had been PM then UK would be speaking German!\" Read more:Analysis: Israel likely faces an impossible taskHow life and colour has been stripped from Gaza In another post around an hour later Mr Huckabee wrote: \"How much food has Starmer and the UK sent to Gaza? \"@IsraeliPM has already sent 2 MILLION TONS into Gaza & none of it even getting to hostages.\" Sir Keir has pledged to recognise a Palestinian state in September unless the Israeli government meets a series of conditions towards ending the war in Gaza. The UK and its allies criticised Israel as US President JD Vance and UK Foreign Secretary David Lammy met at Chevening House in Kent on Friday.  Mr Vance described a \"disagreement\" about how the US and UK could achieve their \"common objectives\" in the Middle East, and said the Trump administration had \"no plans to recognise a Palestinian state\". He said: \"I don't know what it would mean to really recognise a Palestinian state given the lack of functional government there.\" Mr Vance added: \"There's a lot of common objectives here. There is some, I think, disagreement about how exactly to accomplish those common objectives, but look, it's a tough situation.\" The UN Security Council will meet on Saturday to discuss the situation in the Middle East. Ambassador Riyad Mansour, permanent observer of the State of Palestine to the United Nations, said earlier on Friday that a number of countries would be requesting a meeting of the UN Security Council on Israel's plans."
    },
    {
        "title": "Nicola Sturgeon says police investigation was 'mental torture' - in memoir that addresses sexuality and miscarriage",
        "description": "Nicola Sturgeon has opened up about the \"mental torture\" of being investigated by police in her new book.",
        "url": "https://news.sky.com/story/nicola-sturgeon-says-police-investigation-was-mental-torture-in-memoir-that-addresses-sexuality-and-miscarriage-13408903",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nicola-sturgeon-snp_6986146.jpg?20250809070245",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-09 05:10:00",
        "Headline": "The former first minister's autobiography Frankly, which will be published on Thursday,  details her miscarriage in 2010 and rumours about an affair with a female French ambassador to the UK.",
        "Content": "Nicola Sturgeon has opened up about the \"mental torture\" of being investigated by police in her new book. Frankly, which will be published on Thursday, also details her miscarriage in 2010 and rumours about an affair with a female French ambassador to the UK. In an excerpt published in The Times, Ms Sturgeon, 55, describes 11 June 2023 - the day she was arrested and questioned by police - as the \"worst of my life\". The former first minister was investigated after her ex-husband Peter Murrell, the former chief executive and treasurer of the Scottish National Party (SNP), was arrested and charged with embezzlement. The couple's house was searched as the police probed £660,000 that had gone missing from party accounts, but the investigation into Ms Sturgeon and her colleague Colin Beatie was eventually dropped. Read more from Sky News:JD Vance on UK free speechHomelessness minister resigns over rent claimsInside Jeremy Corbyn's new party Having gone to the north east of Scotland to stay with a friend during that time, she recalls: \"I spent hours looking out across the North Sea. At first, I wanted to somehow disappear into its vastness. Slowly but surely, though, the sea calmed me.\" The following year was filled with \"dread and anxiety\", she says, with no updates on the case, until Mr Murrell was re-arrested and charged in April 2024. \"I retain both faith in and respect for our country's criminal justice system. However, none of that changes this fact: being the subject of a high-profile criminal investigation for almost two years, especially having committed no crime, was like a form of mental torture,\" she says. She was told she would face no further action on 20 March 2025 - a month after she and Mr Murrell announced their separation. Went to work despite miscarriage 'agony' The memoir also details a miscarriage she suffered in 2010. She returned back to work straight after, having to attend a memorial event despite being in \"constant agony\". She says she felt \"conflicted\" about becoming a parent - but only realised \"belatedly\" that she \"wanted to be pregnant\" when she was in hospital having an urgent scan after telling a flu jab nurse she had noticed spots of blood. The loss of the pregnancy was confirmed four days later on 4 January 2011. \"I had the presence of mind to call Peter into the bathroom and, together, we flushed our 'baby' down the toilet. We later resolved to try again, but I knew then that we had lost our one chance,\" she recalls. Ms Sturgeon, who served as first minister between 2014 and 2023, also addressed false rumours that she had a lesbian affair with former French ambassador to the UK Catherine Colonna in 2020. While the lies \"got under her skin\", she adds: \"Long-term relationships with men have accounted for more than 30 years of my life, but I have never considered sexuality, my own included, to be binary. Moreover, sexual relationships should be private matters.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's",
        "description": "Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations.",
        "url": "https://news.sky.com/story/chris-hemsworth-actor-on-gear-shift-in-his-life-motivations-after-increased-alzheimers-risk-13408682",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chris-hemsworth-actor_6985808.jpg?20250808181919",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-08-09 02:14:00",
        "Headline": "One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double-carriers showed key early signs of the disease which causes dementia by the age of 55.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Chris Hemsworth has told Sky News that finding out he had a greater chance of developing Alzheimer's disease was a \"gear shift\" in his life motivations. During a genetic test in season one of Limitless: Live Better Now, the Australian actor discovered that he is, biologically, eight to 10 times more likely than others to have the brain disorder during his lifetime as he carries two copies of the APOE4 gene. He had first taken part in the National Geographic show to be its \"guinea pig\" and face new experiences that challenge the body and mind. But after having the test, the 41-year-old Thor, Furiosa and Transformers star was faced with an unexpected truth. One in every 50 people inherit two copies of the APOE4 gene and research has found that nearly all double carriers showed key early signs of the disease which causes dementia by the age of 55. Everyone's risk is different, and evidence suggests there are things you can do to reduce your risk whether you're a carrier of the gene or not, including not smoking, reducing alcohol intake, daily exercise, monitoring cholesterol and blood pressure and eating a balanced diet. Speaking of when he found out he was a double carrier, Hemsworth told Sky News: \"It was just kind of this point in my life where up until your 40s, you're kind of gathering data and information and it's all reactionary and then you get to a point where you think, oh some of this sort of identity that I've sort of built doesn't hold true anymore. \n                  Wembley investigating claims people were smuggled into Oasis gig without tickets\n                 \n                  Mandalorian actor Gina Carano settles lawsuit with Disney – and thanks Elon Musk for funding it\n                 \n                  Eddie Murphy: I'll get an Oscar eventually - when I'm old and have no teeth\n                 \"There's some inner sort of protest or inner voice that has a deeper need to understand and there's deeper questions and what is the purpose and the why behind what I'm doing ... and what am I seeking, what am I contributing, as opposed to just what I am collecting.\" Reacting on screen, he said it made him shift his focus to living better and increase the chances of him spending as much time as possible with his family and friends. What's changed in the second series? The change in mindset is evident in season two. \"This time around, I was very involved in the orchestration and the sort of production and bringing together spaces that I was interested in or there was a deep curiosity or were deeply personal to me. And it was more sort of experiential journalism as opposed to a contestant in a challenging kind of fun, reality show. He adds: \"I was much more committed or invested in the experience. \"And I was a bit more educated on the topics too. I had to research, I had a deeper point of view, I suppose, personally, but also sort of the education I was given prior and I enjoyed that more, to be honest, I didn't like that I felt very uncomfortable in the first season because I was standing around all these experts and I knew nothing about these topics, yet I was kind of asked to speak on them and so I felt like an imposter the entire time.\" Limitless: Live Better Now looks at the ways in which you can improve your brain and body's health through endurance challenges and learning a new instrument. Read more entertainment and arts news:Actor settles lawsuit with Disney - and thanks Musk for funding itEddie Murphy: I'll get an Oscar eventually Teaming up with Sheeran Hemsworth chose the drums and, taking it to the extreme, was set the task of joining his friend Ed Sheeran on stage to play Thinking Out Loud. \"That fear and that anxiety was incredibly overwhelming,\" Hemsworth says, detailing how he felt \"underwater\" in the weeks leading up to the event. \"It's weird the way intense situations actually cause a hyper focus; it's a survival mechanism of the brain. \"Some of the other challenges where if I did the training it was beneficial, but I could kind of muscle my way through it. You can't do that with a musical instrument and then the realisation that the entire band is relying on you to keep time. And then 70,000 people are sitting there going, 'please don't wreck our favourite song'.\" Reflecting on the moment, he says it's one of the most magical feelings he's ever had. \"The joy was unlike anything I've ever experienced. You know, if you could bottle that and have it in a healthy way and not have all the negatives that someone may have for it, it was amazing. It was a true kind of one of my first probably proper out of body experiences, I suppose. \"It was like, I kind of remember being in the out, looking down at myself almost, kind of going, wow, I'm kind of floating along with this thing that's so much bigger than me and I'm in true sort of flow state with it.\" National Geographic's Limitless: Live Better Now is available to stream on Disney+ from 15 August."
    },
    {
        "title": "Wembley investigating claims people were smuggled into Oasis gig without tickets",
        "description": "Wembley Stadium is investigating claims up to 200 people were able to sneak into its Oasis concerts without tickets.",
        "url": "https://news.sky.com/story/wembley-investigating-claims-people-were-smuggled-into-oasis-gig-without-tickets-13408916",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-liam-gallagher_6975751.jpg?20250728084551",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-09 06:17:00",
        "Headline": "According to reports, up to 200 people paid £350 each to be smuggled into the stadium through a disabled entrance.",
        "Content": "Wembley Stadium is investigating claims up to 200 people were able to sneak into its Oasis concerts without tickets. Oasis played the iconic London venue on five nights between 25 July and 3 August as part of their Live 25 reunion tour. Tickets sold out in hours after the band announced they would be reuniting 16 years after their dramatic split in 2009. Huge demand saw the final cost of attending one of the gigs surge, sparking controversy over dynamic pricing and a lack of transparency. But according to reports in The Sun, some people paid £350 each to be smuggled into the stadium through a disabled entrance across all five shows. They allegedly used copies of the same ticket to get through security, who handed them wristbands giving them access to the VIP area in front of the stage. Sky News understands that six people were arrested for suspected unauthorised entry across the five shows and 24 were ejected on the same grounds. Read more:What it was like to see Oasis reunitedChris Hemsworth on Alzheimer's risk One of those who sneaked in told the newspaper: \"We were given our tickets, which were all the same, and a woman drew a shape on our hands. \"We were told to go to the disabled door at entrance M, even though our tickets said entrance F. \"We showed our stamped hands to the person on the door, they scanned the tickets, even though we all had the same one, and let us in. \"Another member of staff then handed us a golden circle wristband and that was it. There were zero security searches. We just walked straight in.\" A Wembley Stadium spokesperson told Sky News in a statement: \"Entering Wembley Stadium without a ticket is a serious offence and we are investigating these allegations. \"If they are substantiated, we will refer our evidence to the police.\" Oasis will return to Wembley for two nights on 27 and 28 September. They are still to play in several other venues throughout the UK - including Edinburgh's Murrayfield Stadium and Dublin's Croke Park - before heading to Japan, South Korea, South America, Australia, and North America later this year. The band expressed their condolences after one fan, 45-year-old Lee Claydon, died at one of the Wembley gigs."
    }
]