[
    {
        "title": "Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'",
        "description": "Rachel Reeves will need to find more than &#163;40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned.",
        "url": "https://news.sky.com/story/chancellor-warned-substantial-tax-rises-needed-as-she-faces-impossible-trilemma-13407544",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6983775.jpg?20250805223306",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-05 21:23:00",
        "Headline": "Rachel Reeves and Keir Starmer have repeatedly ruled out raising taxes on \"working people\", fuelling speculation about how the government could boost tax receipts in other ways - including a potential wealth tax.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Rachel Reeves will need to find more than £40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned. The National Institute of Economic and Social Research (NIESR) said the government would miss its rule, which stipulates that day to day spending should be covered by tax receipts, by £41.2bn in the fiscal year 2029-30. Politics Hub: Follow latest updates In its latest UK economic outlook, NIESR said: \"This shortfall significantly increases the pressure on the chancellor to introduce substantial tax rises in the upcoming autumn budget if she hopes to remain compliant with her fiscal rules.\" The deteriorating fiscal picture was blamed on poor economic growth, higher than expected borrowing and a reversal in welfare cuts that could have saved the government £6.25bn. Together they have created an \"impossible trilemma\", NIESR said, with the chancellor simultaneously bound to her fiscal rules, spending commitments, and manifesto pledges that oppose tax hikes. Read more:What is a wealth tax?  Reeves told to consider replacing council tax The institute urged the government to build a larger fiscal buffer through moderate but sustained tax rises. \"This will help allay bond market fears about fiscal sustainability, which may in turn reduce borrowing costs,\" it said. \"It will also help to reduce policy uncertainty, which can hit both business and consumer confidence.\" It said that money could be raised by reforms to council tax bands or, in a more radical approach, by replacing the whole council tax system with a land value tax. To reduce spending pressures, NIESR called for a greater focus on reducing economic inactivity, which could bring down welfare spending.  Growth to remain sluggish The report was released against the backdrop of poor growth, with the chancellor struggling to ignite the economy after two months of declining GDP. The institute is forecasting modest economic growth of 1.3% in 2025 and 1.2% in 2026. That means Britain will rank mid-table among the G7 group of advanced economies. 'Things are not looking good' However, inflation is likely to remain persistent, with the consumer price index (CPI) likely to hit 3.5% in 2025 and around 3% by mid-2026. NIESR blamed sustained wage growth and higher government spending. It said the Bank of England would cut interest rates twice this year and again at the beginning of next year, taking the rate from 4.25% to 3.5%. Persistent inflation is also weighing on living standards: the poorest 10% of UK households saw their living standards fall by 1.3% in 2024-25 compared to the previous year, NIESR said. They are now 10% worse off than they were before the pandemic. Professor Stephen Millard, deputy director for macroeconomics at NIESR, said the government faced tough choices ahead: \"With growth at only 1.3% and inflation above target, things are not looking good for the chancellor, who will need to either raise taxes or reduce spending or both in the October budget.\""
    },
    {
        "title": "This man survived Hiroshima - and has a stark warning for us all",
        "description": "Toshiyuki Mimaki is exhausted when we meet him.",
        "url": "https://news.sky.com/story/this-man-survived-hiroshima-and-he-has-a-stark-warning-for-us-all-13407417",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hiroshima-survivor_6983617.jpg?20250805185650",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-08-05 16:11:00",
        "Headline": "Eighty years since the bombing of Hiroshima, survivor Toshiyuki Mimaki says the world now faces its \"most dangerous\" era.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Toshiyuki Mimaki is exhausted when we meet him. The 83-year-old sinks into his chair, closes his eyes, and asks us to keep it brief. But then he starts talking, and his age seems to melt away with the power of his stories. He is a survivor of Hiroshima’s atomic bomb, a lifelong advocate for nuclear disarmament and, as of last year, a Nobel Peace Prize winner.  But now, on the 80th anniversary of the bombing, he comes with more than just memories - he has a message, and it is stark. \"Right now is the most dangerous era,\" he says. \"Russia might use it [a nuclear weapon], North Korea might use it, China might use it. \"And President Trump - he's just a huge mess. \"We've been appealing and appealing, for a world without war or nuclear weapons - but they're not listening.\" Read more:The 'destroyer of worlds' who built the atomic bomb  'I didn't hear a sound' Mr Mimaki was three years old when the US dropped an atomic bomb on the city of Hiroshima. It was the first time a nuclear weapon had been used in war, and it's remembered as one of the most horrific events in the history of conflict. It's estimated to have killed over 70,000 people on the spot, one in every five residents, unleashing a ground heat of around 4,000C, melting everything in its path and flattening two thirds of the city. Horrifying stories trickled out slowly, of blackened corpses and skin hanging off the victims like rags. \"What I remember is that day I was playing outside and there was a flash,\" Mr Mimaki recalls. \"We were 17km away from the hypocentre. I didn't hear a bang, I didn't hear a sound, but I thought it was lightening. \"Then it was afternoon and people started coming out in droves. Some with their hair all in mess, clothes ragged, some wearing shoes, some not wearing shoes, and asking for water.\" 'The city was no longer there' For four days, his father did not return home from work in the city centre. He describes with emotion the journey taken by his mother, with him and his younger bother in tow, to try to find him. There was only so far in they could travel, the destruction was simply too great. \"My father came home on the fourth day,\" he says. \"He was in the basement [at his place of work]. He was changing into his work clothes. That’s how he survived. \"When he came up to ground level, the city of Hiroshima was no longer there.\" 'People are still suffering' Three days later, the US would drop another atomic bomb on the city of Nagasaki, bringing about an unconditional Japanese surrender and the end of the Second World War. By the end of 1945, the death toll from both cities would have risen to an estimated 210,000 and to this day it is not known exactly how many lost their lives in the following years to cancers and other side effects. \"It's still happening, even now. People are still suffering from radiation, they are in the hospital,\" Mr Mimaki says. \"It's very easy to get cancer, I might even get cancer, that's what I'm worried about now.\" Tragically, many caught up in the bomb lived with the stigma for most of their lives. Misunderstandings about the impact of radiation meant they were often shunned and rejected for jobs or as a partner in marriage. Many therefore tried to hide their status as Hibakusha (a person affected by the atomic bombs) and now, in older age, are finding it hard to claim the financial support they are entitled to. And then there is the enormous psychological scars, the PTSD and the lifelong mental health problems. Many Hibakusha chose to never talk about what they saw that day and live with the guilt that they survived. For Mr Mimaki, it's there when he recounts a story of how he and another young girl about his age became sick with what he now believes was radiation poisoning. \"She died, and I survived,\" he says with a heavy sigh and strain in his eyes. He has subsequently dedicated his life to advocacy, and is co-chair of a group of atomic bomb survivors called Nihon Hidankyo. Its members were awarded the Nobel Peace Prize in 2024. 'Why do humans like war so much?' But he doesn’t dwell much on any pride he might feel. He knows it's not long until the bomb fades from living memory, and he deeply fears what that might mean in a world that looks more turbulent now than it has in decades. Indeed, despite advocacy like his, there are still around 12,000 nuclear warheads in the world in the hands of nine countries. \"In the future, you never know when they might use it. Russia-Ukraine, Israel-Gaza, Israel-Iran - there is always a war going on somewhere,\" he says. \"Why do these animals called humans like war so much? \"We keep saying it, we keep telling them, but it's not getting through, for 80 years no-one has listened. \"We are Hibakusha, my message is we must never create Hibakusha again.\""
    },
    {
        "title": "The chilling document that traces nuclear weapons back to Britain - and the threat we now face",
        "description": "Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima.",
        "url": "https://news.sky.com/story/fragmented-and-febrile-is-threat-of-nuclear-war-worse-than-ever-13407307",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-clarke-nuclear_6983517.jpg?20250805164454",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-05 12:29:00",
        "Headline": "Nuclear weapons have not been used in warfare since the atomic bombings of Hiroshima and Nagasaki 80 years ago this week. However, experts warn today's conflicts put the world in a precarious state.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima. It was the dawn of the atomic age, but the birth of the bomb can be traced beyond the deserts of New Mexico to Britain, five years earlier. A copy of a hand-typed document, now in the Bodleian library in Oxford, is the first description of an atom bomb small enough to use as a weapon. The Frisch-Peierls Memorandum was written by two nuclear physicists at the University of Birmingham in 1940. Otto Frisch and Rudolf Peierls don't feature in the film Oppenheimer, but their paper is credited with jump-starting the Manhattan Project that ultimately built the bomb. Both Jewish scientists who had both fled Nazi Germany, they built on the latest understanding of uranium fission and nuclear chain reactions, to propose a bomb made from enriched uranium that was compact enough to be carried by an aircraft. The document, so secret at the time only one copy was made, makes for chilling reading. Not only does it detail how to build a bomb, but foretells the previously unimaginable power of its blast. \"Such an explosion would destroy life in a wide area,\" they wrote. \"The size of this area is difficult to estimate, but it will probably cover the centre of a big city.\" Radioactive fallout would be inevitable \"and even for days after the explosion any person entering the affected area will be killed\". Both lethal properties of the bombs that would subsequently fall on Hiroshima and Nagasaki, killing around 100,000 instantly and more than 100,000 others in the years that followed - most of them civilians. Read more:Hiroshima survivor's stark warningThe 'destroyer of worlds' who built the atomic bomb 'The most terrifying weapons ever created' Those bombs had the explosive power of around 16 and 20 kilotonnes of TNT respectively - a force great enough to end the Second World War. But compared to nuclear weapons of today, they were tiny. \"What we would now term as low yield nuclear weapons,\" said Alexandra Bell, president of the Bulletin of Atomic Scientists, which campaigns for nuclear disarmament. \"We're talking about city destroyers…these really are the most terrifying weapons ever created.\" Many of these \"high yield\" nuclear weapons are thermonuclear designs first tested in the 1950s. They use the power of nuclear fission that destroyed Hiroshima to harness yet more energy by fusing other atoms together. Codenamed \"Mike\", the first test of a fusion bomb in 1952 yielded at least 500 times more energy than those dropped on Japan. Impractically devastating, but proof of lethal principle. Variants of the W76 thermonuclear warhead currently deployed by the US and UK are around 100Kt, six times more powerful than the Hiroshima bomb. Just one dropped on a city the size of London would result in more than a quarter of a million deaths. The largest warhead in America's current arsenal, the B83 has the explosive equivalent of 1.2 megatonnes (1.2 million tonnes of TNT) and would kill well over a million instantly. But modern intercontinental ballistic missiles (ICBMs) are designed to carry multiple warheads. Russia's Sarmat 2, for example, is thought to be capable of carrying 10 megatonnes of nuclear payload. They're designed to strike multiple targets at once, but if all were dropped on a city like London most of its population of nine million would be killed or injured. If that kind of power is incomprehensible, consider how many nuclear warheads there now are in the world. Nine countries - the US, Russia, China, France, the UK, India, Pakistan, North Korea and Israel - have nuclear weapons. Several others are interested in having them. The US and Russia have around 4,000 nuclear warheads each - 90% of the global nuclear arsenal and more than enough to destroy civilisation. According to analysis from the Stockholm International Peace Research Institute, China us thought to have around 600 warheads, but has indicated a desire to catch up. Beijing is believed to be building up to 100 new warheads a year and the ICBMs to deliver them. Five more nuclear powers, including the UK, plan to either increase or modernise their existing nuclear stockpiles. The nuclear arms race that created this situation was one imagined by Frisch and Peierls in their 1940 memorandum. Given the mass civilian casualties it would inevitably cause, the scientists questioned whether the bomb should ever be used by the Allies. They wrote, however: \"If one works on the assumption that Germany is, or will be, in the possession of this weapon… the most effective reply would be a counter-threat with a similar bomb.\" What they didn't believe was that the bomb they proposed, and went on to help build at Los Alamos, would ever be used. Devastated by its use on Japan, Peierls disavowed the bomb and later campaigned for disarmament. But that work is now as unfinished as ever. Non-proliferation treaties helped reduce the expensive and excessive nuclear arsenals of Russia and the US, and prevent more countries from building nuclear bombs. 'Everything trending in the wrong direction' But progress ground to a halt with the invasion of Ukraine, as nuclear tensions continued elsewhere. \"After all the extremely hard, tedious work that we did to reduce nuclear risks everything is now trending in the wrong direction,\" said Alexandra Bell. \"The US and Russia refuse to talk to each other about strategic stability. \"China is building up its nuclear arsenal in an unprecedented fashion and the structures that were keeping non-proliferation in place stemming the spread of nuclear weapons are crumbling around us.\" 'New risks increasing the threat' The world may have come closer to nuclear conflict during the Cuban missile crisis of 1963, but the fragmented and febrile state of geopolitics now is more dangerous, she argues. Conflict regularly flares between nuclear armed India and Pakistan; Donald Trump's foreign policy has sparked fears that South Korea might pursue the bomb to counter North Korea's nuclear threat; some states in the Middle East are eyeing a nuclear deterrent to either nuclear-wannabe Iran or nuclear armed Israel. Add to the mix the military use of AI and stressors like climate change, and the view of the Bulletin of Atomic Scientists is the situation is more precarious than in 1963. \"It's more dangerous, but in a different way,\" said Alexandra Bell. \"The confluence of all these new existential risks are increasing the threat worldwide.\""
    },
    {
        "title": "Prince Harry cleared of bullying claims by report into 'damaging dispute' at his charity",
        "description": "The Charity Commission has found no evidence of bullying or harassment at a charity set up by Prince Harry.",
        "url": "https://news.sky.com/story/prince-harry-cleared-of-bullying-claims-by-report-into-damaging-dispute-at-his-charity-13407515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-sophie_6871303.jpg?20250403195146",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-05 19:44:00",
        "Headline": "Sentebale became the focus of a public dispute after its chair used an interview with Sky News to accuse Prince Harry of harassment and bullying. His spokesperson said the report into those claims \"falls troublingly short\".",
        "Content": "The Charity Commission has found no evidence of bullying or harassment at a charity set up by Prince Harry. But it has found that an internal dispute at Sentebale \"severely impacted the charity's reputation\". Earlier this year its chair, Dr Sophie Chandauka, used an interview with Sky News' Sunday Morning With Trevor Phillips to accuse the Duke of Sussex of \"harassment and bullying at scale\". Her comments followed the departure of the prince and several others from the organisation in March. They had asked her to step down, alleging it was in the \"best interest of the charity\". Dr Chandauka told Sky News that Harry had \"authorised the release of a damaging piece of news to the outside world\" without informing her or Sentebale directors. The Duke and Duchess of Sussex declined to offer any formal response.  'Strong perception of ill-treatment' The Charity Commission said it was reporting after a \"damaging internal dispute emerged\" and has \"criticised all parties to the dispute for allowing it to play out publicly\". That \"severely impacted the charity's reputation and risked undermining public trust in charities more generally\", it said. But it found no evidence of \"widespread or systemic bullying or harassment, including misogyny or misogynoiri at the charity\". Nevertheless, it did acknowledge the \"strong perception of ill-treatment felt by a number of parties to the dispute and the impact this may have had on them personally\". It also found no evidence of \"'over-reach' by either the chair or the Duke of Sussex as patron\". 'Confusion exacerbated tensions' But it was critical of the charity's \"lack of clarity in delegations to the chair which allowed for misunderstandings to occur\". And it has \"identified a lack of clarity around role descriptions and internal policies as the primary cause for weaknesses in the charity's management\". That \"confusion exacerbated tensions, which culminated in a dispute and multiple resignations of trustees and both founding patrons\". Read more:Clintons subpoenaed in Epstein probeFirst man to be executed with defibrillator fitted  Harry: Report falls troublingly short A spokesperson for Prince Harry said it was \"unsurprising\" that the commission had announced \"no findings of wrongdoing in relation to Sentebale's co-founder and former patron, Prince Harry, Duke of Sussex\". They added: \"Despite all that, their report falls troublingly short in many regards, primarily the fact that the consequences of the current chair's actions will not be borne by her, but by the children who rely on Sentebale's support.\" They said the prince will \"now focus on finding new ways to continue supporting the children of Lesotho and Botswana\". Dr Chandauka said: \"I appreciate the Charity Commission for its conclusions which confirm the governance concerns I raised privately in February 2025.\" But she added: \"The unexpected adverse media campaign that was launched by those who resigned on 24 March 2025 has caused incalculable damage and offers a glimpse of the unacceptable behaviours displayed in private.\""
    },
    {
        "title": "Bill and Hillary Clinton subpoenaed in Jeffrey Epstein probe",
        "description": "The US House Oversight Committee has issued subpoenas for depositions with former president Bill Clinton and former secretary of state Hillary Clinton relating to the sex trafficking investigation into Jeffrey Epstein.",
        "url": "https://news.sky.com/story/bill-and-hillary-clinton-subpoenaed-in-jeffrey-epstein-probe-13407407",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bill-clinton-hillary-clinton_6983604.jpg?20250805182609",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-05 15:58:00",
        "Headline": "The Republican-controlled committee also subpoenaed the Justice Department for files relating to the paedophile financier, as well as eight former top law enforcement officials.",
        "Content": "The US House Oversight Committee has issued subpoenas for depositions with former president Bill Clinton and former secretary of state Hillary Clinton relating to the sex trafficking investigation into Jeffrey Epstein. The Republican-controlled committee also subpoenaed the Justice Department for files relating to the paedophile financier, as well as eight former top law enforcement officials. Donald Trump has denied prior knowledge of Epstein's crimes, claiming he ended their relationship a long time ago. The US president has repeatedly tried to draw a line under the Justice Department's decision not to release a full accounting of the investigation, but politicians from both major political parties, as well as many in Mr Trump's political base, have refused to drop their interest in the Epstein files. Epstein died in a New York jail cell in 2019 awaiting trial on sex trafficking charges, and since then, conspiracy theories have swirled about what information investigators gathered on him and who else may have been involved in his crimes. Republicans on the House Oversight Committee initiated the subpoenas for the Clintons last month, as well as demanding all communications between former president Joe Biden's Democrat administration and the Justice Department about Epstein. The committee previously issued a subpoena for an interview with Epstein's former girlfriend, Ghislaine Maxwell, who had been serving a prison sentence in Florida for luring teenage girls to be sexually abused by Epstein. She was recently transferred to another facility in Texas. Mr Clinton was among those acquainted with Epstein before the criminal investigation against him in Florida became public two decades ago. He has never been accused of wrongdoing by any of the women who say Epstein abused them. Mr Clinton previously said, through a spokesperson, that while he travelled on Epstein's jet, he never visited his homes and had no knowledge of his crimes. Read more:All we know about Trump and Epstein's 'friendship' US correspondent The subpoenaing of former president Bill Clinton is an escalation, both legally and politically. Historically, it is rare for congressional oversight to demand deposition from former presidents of the United States. Ghislaine Maxwell, Jeffrey Epstein's former girlfriend and accomplice, had already been summonsed. But the House Oversight Committee has now added Bill and Hillary Clinton, several former Attorneys General and former FBI directors to its list. It signals bipartisan momentum – Democrats voting with Republicans for transparency. The committee will now hear from several people with known ties to Epstein, his connection with Bill Clinton having been well-documented. But the subpoenas set up a potential clash between Congress and the Department of Justice. Donald Trump, the candidate, had vowed to release them. A government led by Mr Trump, the president, chose not to. If Attorney General Pam Bondi still refuses to release the files, it will fuel claims of a constitutional crisis in the United States. But another day of Epstein headlines demonstrates the enduring public interest in this case. The subpoenas give the Justice Department until 19 August to hand over the requested records. The committee is also asking the former officials to appear for depositions throughout August, September and October, concluding with Hillary Clinton on 9 October and Bill Clinton on 14 October. Although several former presidents, including Mr Trump, have been issued congressional subpoenas, none has ever appeared before members under compulsion. Last month, Mr Trump instructed Attorney General Pam Bondi to release information presented to the grand jury that indicted Maxwell for helping Epstein sexually abuse teenage girls."
    },
    {
        "title": "Police investigating grooming gangs given AI tools to speed up cold case work",
        "description": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations.",
        "url": "https://news.sky.com/story/police-investigating-grooming-gangs-given-ai-tools-to-speed-up-cold-case-work-13407547",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anonymous-teenager_6983780.jpg?20250805225703",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-05 21:26:00",
        "Headline": "The technology translates large amounts of text in foreign languages and analyses a mass of data to find patterns and relationships between suspects.",
        "Content": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations. The artificial intelligence tools are already thought to have saved officers in 13 forces more than £20m and 16,000 hours of investigation time. The apps can translate large amounts of text in foreign languages from mobile phones seized by police, and analyse a mass of digital data to find patterns and relationships between suspects.  'We must punish perpetrators' The rollout is part of a £426,000 boost for the Tackling Organised Exploitation (TOEX) programme, which supports officers to investigate complex cases involving modern slavery, county lines and child sex abuse. The increased access to the AI technology follows Baroness Casey's recommendation for a national operation to review cold grooming gang cases. That operation will review more than 1,200 closed cases of child sexual exploitation. \"The sexual exploitation of children by grooming gangs is one of the most horrific crimes, and we must punish perpetrators, provide justice for victims and survivors, and protect today's children from harm,\" said safeguarding minister Jess Phillips. \"Baroness Casey flagged the need to upgrade police information systems to improve investigations and safeguard children at risk. Today we are investing in these critical tools.\" Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises  Lack of ethnicity data 'a major failing' Police forces have also been instructed by the home secretary to collect ethnicity data, as recommended by Baroness Casey. Her June report found the lack of data showing sex offenders' ethnicity and nationality in grooming gangs was \"a major failing over the last decade or more\". She found that officials avoided the issue of ethnicity for fear of being called racist, but there were enough convictions of Asian men \"to have warranted closer examination\". The government has launched a national inquiry into the abuse and further details are expected to be announced in the coming weeks."
    },
    {
        "title": "Delay biometric visa checks for 80 Gaza students, dozens of MPs urge UK government",
        "description": "More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal.",
        "url": "https://news.sky.com/story/delay-biometric-visa-checks-for-80-gaza-students-dozens-of-mps-urge-uk-government-13407459",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-gaza-strip-palestinians_6983690.jpg?20250805201006",
        "type": "Home",
        "Author": "Ben Bloch",
        "Date Published": "2025-08-05 17:55:00",
        "Headline": "Barry Gardiner MP says educating students from Gaza is about \"giving the state of Palestine the possibility of a future\". But Chris Philp MP says biometric checks before arrival are \"essential\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal. Labour MPs Abtisam Mohamed and Barry Gardiner are leading the charge, asking Home Secretary Yvette Cooper to defer the requirement, so the students can take up their university places in September. However, shadow home secretary Chris Philp says the biometric checks should not be deferred, arguing they are \"an essential part of our security arrangements\". Gaza latest: Netanyahu mulls 'full Gaza takeover' In order to obtain a UK visa, applicants must provide a photo of their face, as well as their fingerprints. The Home Office guidance says these data points \"play a significant role in delivering security and facilitation in the border and immigration system\". UK visa process for Gazans 'all but impossible' In the letter, the MPs raise the case of Haia Mohamed, who they describe as a \"young poet in Gaza\", who has won a scholarship to Goldsmiths College in London. \n                  Kemi Badenoch says she no longer identifies as Nigerian\n                 \n                  James Cleverly says leaving ECHR is 'not silver bullet' - and leaves door open for leadership bid\n                 \n                  Former Tory MP handed community order for harassing ex-wife\n                 But neither she nor 79 other successful applicants to UK universities are able to travel to the UK because providing the required biometric data is \"all but impossible\". They write: \"Even before the war, leaving Gaza to pursue higher education was a complex process. The ongoing siege and restrictions made travel extremely difficult, but in the current state of constant bombardment, shootings at aid sites, and an IPC-declared famine, this process has become all but impossible.\" In an email to MPs asking them to sign the letter, Ms Mohamed and Mr Gardiner are far more blunt, saying: \"Unless the government makes rapid progress with offering visas and coordinating evacuations over the next week, students who should be starting university next month in the UK will be among those who are being shot dead at aid sites, bombed in displacement camps, or starving as famine spreads deeper in Gaza.\" The UK did have an authorised centre in Gaza that was able to process biometric data, but it was closed in October 2023 after the 7 October Hamas attack, and as Israel's war in response to the atrocity got under way, according to The Guardian. As result, they are asking the home secretary to \"defer biometric data screening for student visa applicants based in Gaza and open a safe passage to enable these young people to fulfil their academic dreams\", pointing out that other countries in Europe \"have taken proactive steps to ensure safe evacuation routes for students bound for their countries\".  Students are 'the future of Palestine' Speaking to Sky News on Tuesday, one of the writers of the letter, Barry Gardiner MP, pointed out that the government has been able to find a way for injured children from Gaza to receive care in the UK, and exemptions have been made in the past, and so the same should be done in this case, and \"quickly\" because the academic year starts next month. The Brent West MP also said that this is about \"giving the state of Palestine the possibility of a future\".  \"These young people are the future of Palestine. They are the young talent, and it doesn't matter whether they're constructing a road network, or a sewage system, or they're town planners or, as in the case of Haia Mohamed, astonishingly profound poets - the state of Palestine will need everything from classical musicians right the way through to town planners,\" he said. \"And these youngsters are coming over here with that full range of study potential, with the express intention of going back and building their nation.\" He added that the fact they have been able to win scholarships to, in many cases, the UK's top universities \"shows extraordinary resilience, extraordinary courage, extraordinary ability, and we should facilitate that\".  Checks 'essential part of security arrangements' But Conservative MP and shadow home secretary Chris Philp told Sky News in a statement: \"We should not be deferring biometric checks. These are an essential part of our security arrangements, and they should not be waived or delayed until arrival in the UK - by which time it is too late.\" Mr Gardiner later said biometric checks could still be carried out in another country, such as Jordan. Earlier this month, a student from Gaza reportedly left France after being ordered to leave following the discovery of alleged antisemitic social media posts. Her lawyer said she \"firmly denies the accusations made against her\", according to France24. Mr Gardiner told Sky News: \"Anyone who breaks the law in that way must be dealt with as the law requires. But what you don't do is you don't say, 'somebody might break the law, so we're not going to allow anybody to come'.\" Read more:More children from Gaza to be brought to UK for medical treatmentNetanyahu to instruct Israeli military on next steps in GazaAnalysis: Full Israeli occupation of Gaza could massively backfire The UK requires that biometric data be submitted in advance of the visa being approved in order to: • Establish a person's identity by joining the applicant's biographical data with their biometric data;• Verify an individual \"accurately against an established identity\";• Check they are not on a watchlist, for example, to ensure they are eligible to come to the UK. Exemptions from the requirement to provide biometric data have been given in rare circumstances. It was waived for Ukrainians fleeing to the UK following Russia's invasion in January 2022. However, it was not waived for Afghans fleeing the Taliban in August 2021. But a judge later ruled that a family in hiding in the country did not have to provide the data in order to join British family members in the UK, which was thought to also apply to around 100 other families. The Home Office and Foreign Office have been contacted for comment."
    },
    {
        "title": "Drug-driving father Daniel Burba jailed for 10 years after his teenage son dies in M6 crash",
        "description": "A father who crashed the vehicle he was driving after having a cocaine-fuelled epileptic fit at the wheel, killing his teenage son, has been jailed for 10 years.",
        "url": "https://news.sky.com/story/drug-driving-father-daniel-burba-jailed-for-10-years-after-his-teenage-son-dies-in-m6-crash-13407439",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-daniel-burba-lancashire-constabulary_6983546.jpg?20250805171144",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-05 17:04:00",
        "Headline": "Ryan, 14, was pronounced dead at the scene after Burba, who was four times above the legal drug-drive limit, lost control of his wife's van and swerved off the M6 near Lancaster before hitting a tree in April.",
        "Content": "A father who crashed the vehicle he was driving after having a cocaine-fuelled epileptic fit at the wheel, killing his teenage son, has been jailed for 10 years. Daniel Burba, 31, was driving his wife's Peugeot van when it swerved off the M6 near Lancaster in Lancashire and hit a tree in April. His 14-year-old son, Ryan Morgan, suffered head injuries and was pronounced dead at the scene of the collision on the southbound carriageway between junctions 34 and 33. The youngster died \"in terror\" as he tried to gain control of the van moments before the crash, Preston Crown Court heard. Burba, from Morecambe, who had been advised not to drive due to his fits and only had a provisional driving licence, was taken to hospital with \"relatively minor\" injuries to his ribs and lacerations. While he was being treated, a paramedic found a small bag of cocaine in Burba's wallet, and blood tests showed he was four times above the legal drug-drive limit, the court heard. Burba had been told by his doctor more than a decade earlier to stop taking the banned class A drug after he suffered a seizure which lasted up to four minutes. He was also advised not to drive. \n                  Cocaine smugglers jailed for more than 82 years in total\n                 \n                  Can anything stop the ketamine crisis?\n                 \n                  'It destroyed my life': The drug addiction leaving users in chronic pain \n                 He was given a similar warning in February when he was admitted to hospital after more fits and was also told to inform the DVLA. Sentencing him, Judge Robert Altham reminded him that he knew cocaine made further fits more likely and should not have been driving at all, \"unsupervised and certainly not on the motorway\". \"You chose to drive on a motorway on a busy bank holiday Sunday. You had a passenger in the van, and that passenger was your son, a person you should have been protecting and not endangering.\" \"You knew that taking cocaine made your decision to drive all the more dangerous. Your driving put many other road users in danger,\" Judge Altham, the Honorary Recorder of Preston, added. Burba pleaded guilty at an earlier hearing to causing death by dangerous driving and also admitted driving without a licence or insurance. He had been travelling in convoy with his wife, Frances - Ryan's stepmother - and their three children. Witnesses described Burba driving \"erratically\" on the motorway with hazard lights on as the vehicle narrowly missed swerving into a coach on the inside lane. A witness said the front seat passenger \"looked really scared\" and was apparently trying to steer the van while the driver was slumped over the wheel. The Bipper van hit the central reservation, swerved across the carriageway and then up a grass bank before it hit a tree, the court heard. Ryan's mother Kim, who was in court, said Burba's actions were \"disgusting\". Read more on Sky News:'Toxic culture' of Titan sub operatorRobinson bailed over assaultTV presenter accused of rape Her son \"would have changed the world,\" she said. \"He [Ryan] made it a better place in the short time he was here. He made everyone smile who came into contact with him. He had a smile that lit up the room. \"Daniel has taken all that and more.\" Paul Humphries, defending, said Burba was \"remorseful\" and \"very much regrets his actions that day\". Burba was banned from driving for 14 years and five months."
    },
    {
        "title": "Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'",
        "description": "Rachel Reeves will need to find more than &#163;40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned.",
        "url": "https://news.sky.com/story/chancellor-warned-substantial-tax-rises-needed-as-she-faces-impossible-trilemma-13407544",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6983775.jpg?20250805223306",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-05 21:23:00",
        "Headline": "Rachel Reeves and Keir Starmer have repeatedly ruled out raising taxes on \"working people\", fuelling speculation about how the government could boost tax receipts in other ways - including a potential wealth tax.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Rachel Reeves will need to find more than £40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned. The National Institute of Economic and Social Research (NIESR) said the government would miss its rule, which stipulates that day to day spending should be covered by tax receipts, by £41.2bn in the fiscal year 2029-30. Politics Hub: Follow latest updates In its latest UK economic outlook, NIESR said: \"This shortfall significantly increases the pressure on the chancellor to introduce substantial tax rises in the upcoming autumn budget if she hopes to remain compliant with her fiscal rules.\" The deteriorating fiscal picture was blamed on poor economic growth, higher than expected borrowing and a reversal in welfare cuts that could have saved the government £6.25bn. Together they have created an \"impossible trilemma\", NIESR said, with the chancellor simultaneously bound to her fiscal rules, spending commitments, and manifesto pledges that oppose tax hikes. Read more:What is a wealth tax?  Reeves told to consider replacing council tax The institute urged the government to build a larger fiscal buffer through moderate but sustained tax rises. \"This will help allay bond market fears about fiscal sustainability, which may in turn reduce borrowing costs,\" it said. \"It will also help to reduce policy uncertainty, which can hit both business and consumer confidence.\" It said that money could be raised by reforms to council tax bands or, in a more radical approach, by replacing the whole council tax system with a land value tax. To reduce spending pressures, NIESR called for a greater focus on reducing economic inactivity, which could bring down welfare spending.  Growth to remain sluggish The report was released against the backdrop of poor growth, with the chancellor struggling to ignite the economy after two months of declining GDP. The institute is forecasting modest economic growth of 1.3% in 2025 and 1.2% in 2026. That means Britain will rank mid-table among the G7 group of advanced economies. 'Things are not looking good' However, inflation is likely to remain persistent, with the consumer price index (CPI) likely to hit 3.5% in 2025 and around 3% by mid-2026. NIESR blamed sustained wage growth and higher government spending. It said the Bank of England would cut interest rates twice this year and again at the beginning of next year, taking the rate from 4.25% to 3.5%. Persistent inflation is also weighing on living standards: the poorest 10% of UK households saw their living standards fall by 1.3% in 2024-25 compared to the previous year, NIESR said. They are now 10% worse off than they were before the pandemic. Professor Stephen Millard, deputy director for macroeconomics at NIESR, said the government faced tough choices ahead: \"With growth at only 1.3% and inflation above target, things are not looking good for the chancellor, who will need to either raise taxes or reduce spending or both in the October budget.\""
    },
    {
        "title": "Prince Harry cleared of bullying claims by report into 'damaging dispute' at his charity",
        "description": "The Charity Commission has found no evidence of bullying or harassment at a charity set up by Prince Harry.",
        "url": "https://news.sky.com/story/prince-harry-cleared-of-bullying-claims-by-report-into-damaging-dispute-at-his-charity-13407515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-sophie_6871303.jpg?20250403195146",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-05 19:44:00",
        "Headline": "Sentebale became the focus of a public dispute after its chair used an interview with Sky News to accuse Prince Harry of harassment and bullying. His spokesperson said the report into those claims \"falls troublingly short\".",
        "Content": "The Charity Commission has found no evidence of bullying or harassment at a charity set up by Prince Harry. But it has found that an internal dispute at Sentebale \"severely impacted the charity's reputation\". Earlier this year its chair, Dr Sophie Chandauka, used an interview with Sky News' Sunday Morning With Trevor Phillips to accuse the Duke of Sussex of \"harassment and bullying at scale\". Her comments followed the departure of the prince and several others from the organisation in March. They had asked her to step down, alleging it was in the \"best interest of the charity\". Dr Chandauka told Sky News that Harry had \"authorised the release of a damaging piece of news to the outside world\" without informing her or Sentebale directors. The Duke and Duchess of Sussex declined to offer any formal response.  'Strong perception of ill-treatment' The Charity Commission said it was reporting after a \"damaging internal dispute emerged\" and has \"criticised all parties to the dispute for allowing it to play out publicly\". That \"severely impacted the charity's reputation and risked undermining public trust in charities more generally\", it said. But it found no evidence of \"widespread or systemic bullying or harassment, including misogyny or misogynoiri at the charity\". Nevertheless, it did acknowledge the \"strong perception of ill-treatment felt by a number of parties to the dispute and the impact this may have had on them personally\". It also found no evidence of \"'over-reach' by either the chair or the Duke of Sussex as patron\". 'Confusion exacerbated tensions' But it was critical of the charity's \"lack of clarity in delegations to the chair which allowed for misunderstandings to occur\". And it has \"identified a lack of clarity around role descriptions and internal policies as the primary cause for weaknesses in the charity's management\". That \"confusion exacerbated tensions, which culminated in a dispute and multiple resignations of trustees and both founding patrons\". Read more:Clintons subpoenaed in Epstein probeFirst man to be executed with defibrillator fitted  Harry: Report falls troublingly short A spokesperson for Prince Harry said it was \"unsurprising\" that the commission had announced \"no findings of wrongdoing in relation to Sentebale's co-founder and former patron, Prince Harry, Duke of Sussex\". They added: \"Despite all that, their report falls troublingly short in many regards, primarily the fact that the consequences of the current chair's actions will not be borne by her, but by the children who rely on Sentebale's support.\" They said the prince will \"now focus on finding new ways to continue supporting the children of Lesotho and Botswana\". Dr Chandauka said: \"I appreciate the Charity Commission for its conclusions which confirm the governance concerns I raised privately in February 2025.\" But she added: \"The unexpected adverse media campaign that was launched by those who resigned on 24 March 2025 has caused incalculable damage and offers a glimpse of the unacceptable behaviours displayed in private.\""
    },
    {
        "title": "Police investigating grooming gangs given AI tools to speed up cold case work",
        "description": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations.",
        "url": "https://news.sky.com/story/police-investigating-grooming-gangs-given-ai-tools-to-speed-up-cold-case-work-13407547",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anonymous-teenager_6983780.jpg?20250805225703",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-05 21:26:00",
        "Headline": "The technology translates large amounts of text in foreign languages and analyses a mass of data to find patterns and relationships between suspects.",
        "Content": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations. The artificial intelligence tools are already thought to have saved officers in 13 forces more than £20m and 16,000 hours of investigation time. The apps can translate large amounts of text in foreign languages from mobile phones seized by police, and analyse a mass of digital data to find patterns and relationships between suspects.  'We must punish perpetrators' The rollout is part of a £426,000 boost for the Tackling Organised Exploitation (TOEX) programme, which supports officers to investigate complex cases involving modern slavery, county lines and child sex abuse. The increased access to the AI technology follows Baroness Casey's recommendation for a national operation to review cold grooming gang cases. That operation will review more than 1,200 closed cases of child sexual exploitation. \"The sexual exploitation of children by grooming gangs is one of the most horrific crimes, and we must punish perpetrators, provide justice for victims and survivors, and protect today's children from harm,\" said safeguarding minister Jess Phillips. \"Baroness Casey flagged the need to upgrade police information systems to improve investigations and safeguard children at risk. Today we are investing in these critical tools.\" Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises  Lack of ethnicity data 'a major failing' Police forces have also been instructed by the home secretary to collect ethnicity data, as recommended by Baroness Casey. Her June report found the lack of data showing sex offenders' ethnicity and nationality in grooming gangs was \"a major failing over the last decade or more\". She found that officials avoided the issue of ethnicity for fear of being called racist, but there were enough convictions of Asian men \"to have warranted closer examination\". The government has launched a national inquiry into the abuse and further details are expected to be announced in the coming weeks."
    },
    {
        "title": "Delay biometric visa checks for 80 Gaza students, dozens of MPs urge UK government",
        "description": "More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal.",
        "url": "https://news.sky.com/story/delay-biometric-visa-checks-for-80-gaza-students-dozens-of-mps-urge-uk-government-13407459",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-gaza-strip-palestinians_6983690.jpg?20250805201006",
        "type": "UK",
        "Author": "Ben Bloch",
        "Date Published": "2025-08-05 17:55:00",
        "Headline": "Barry Gardiner MP says educating students from Gaza is about \"giving the state of Palestine the possibility of a future\". But Chris Philp MP says biometric checks before arrival are \"essential\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal. Labour MPs Abtisam Mohamed and Barry Gardiner are leading the charge, asking Home Secretary Yvette Cooper to defer the requirement, so the students can take up their university places in September. However, shadow home secretary Chris Philp says the biometric checks should not be deferred, arguing they are \"an essential part of our security arrangements\". Gaza latest: Netanyahu mulls 'full Gaza takeover' In order to obtain a UK visa, applicants must provide a photo of their face, as well as their fingerprints. The Home Office guidance says these data points \"play a significant role in delivering security and facilitation in the border and immigration system\". UK visa process for Gazans 'all but impossible' In the letter, the MPs raise the case of Haia Mohamed, who they describe as a \"young poet in Gaza\", who has won a scholarship to Goldsmiths College in London. \n                  Kemi Badenoch says she no longer identifies as Nigerian\n                 \n                  James Cleverly says leaving ECHR is 'not silver bullet' - and leaves door open for leadership bid\n                 \n                  Former Tory MP handed community order for harassing ex-wife\n                 But neither she nor 79 other successful applicants to UK universities are able to travel to the UK because providing the required biometric data is \"all but impossible\". They write: \"Even before the war, leaving Gaza to pursue higher education was a complex process. The ongoing siege and restrictions made travel extremely difficult, but in the current state of constant bombardment, shootings at aid sites, and an IPC-declared famine, this process has become all but impossible.\" In an email to MPs asking them to sign the letter, Ms Mohamed and Mr Gardiner are far more blunt, saying: \"Unless the government makes rapid progress with offering visas and coordinating evacuations over the next week, students who should be starting university next month in the UK will be among those who are being shot dead at aid sites, bombed in displacement camps, or starving as famine spreads deeper in Gaza.\" The UK did have an authorised centre in Gaza that was able to process biometric data, but it was closed in October 2023 after the 7 October Hamas attack, and as Israel's war in response to the atrocity got under way, according to The Guardian. As result, they are asking the home secretary to \"defer biometric data screening for student visa applicants based in Gaza and open a safe passage to enable these young people to fulfil their academic dreams\", pointing out that other countries in Europe \"have taken proactive steps to ensure safe evacuation routes for students bound for their countries\".  Students are 'the future of Palestine' Speaking to Sky News on Tuesday, one of the writers of the letter, Barry Gardiner MP, pointed out that the government has been able to find a way for injured children from Gaza to receive care in the UK, and exemptions have been made in the past, and so the same should be done in this case, and \"quickly\" because the academic year starts next month. The Brent West MP also said that this is about \"giving the state of Palestine the possibility of a future\".  \"These young people are the future of Palestine. They are the young talent, and it doesn't matter whether they're constructing a road network, or a sewage system, or they're town planners or, as in the case of Haia Mohamed, astonishingly profound poets - the state of Palestine will need everything from classical musicians right the way through to town planners,\" he said. \"And these youngsters are coming over here with that full range of study potential, with the express intention of going back and building their nation.\" He added that the fact they have been able to win scholarships to, in many cases, the UK's top universities \"shows extraordinary resilience, extraordinary courage, extraordinary ability, and we should facilitate that\".  Checks 'essential part of security arrangements' But Conservative MP and shadow home secretary Chris Philp told Sky News in a statement: \"We should not be deferring biometric checks. These are an essential part of our security arrangements, and they should not be waived or delayed until arrival in the UK - by which time it is too late.\" Mr Gardiner later said biometric checks could still be carried out in another country, such as Jordan. Earlier this month, a student from Gaza reportedly left France after being ordered to leave following the discovery of alleged antisemitic social media posts. Her lawyer said she \"firmly denies the accusations made against her\", according to France24. Mr Gardiner told Sky News: \"Anyone who breaks the law in that way must be dealt with as the law requires. But what you don't do is you don't say, 'somebody might break the law, so we're not going to allow anybody to come'.\" Read more:More children from Gaza to be brought to UK for medical treatmentNetanyahu to instruct Israeli military on next steps in GazaAnalysis: Full Israeli occupation of Gaza could massively backfire The UK requires that biometric data be submitted in advance of the visa being approved in order to: • Establish a person's identity by joining the applicant's biographical data with their biometric data;• Verify an individual \"accurately against an established identity\";• Check they are not on a watchlist, for example, to ensure they are eligible to come to the UK. Exemptions from the requirement to provide biometric data have been given in rare circumstances. It was waived for Ukrainians fleeing to the UK following Russia's invasion in January 2022. However, it was not waived for Afghans fleeing the Taliban in August 2021. But a judge later ruled that a family in hiding in the country did not have to provide the data in order to join British family members in the UK, which was thought to also apply to around 100 other families. The Home Office and Foreign Office have been contacted for comment."
    },
    {
        "title": "Drug-driving father Daniel Burba jailed for 10 years after his teenage son dies in M6 crash",
        "description": "A father who crashed the vehicle he was driving after having a cocaine-fuelled epileptic fit at the wheel, killing his teenage son, has been jailed for 10 years.",
        "url": "https://news.sky.com/story/drug-driving-father-daniel-burba-jailed-for-10-years-after-his-teenage-son-dies-in-m6-crash-13407439",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-daniel-burba-lancashire-constabulary_6983546.jpg?20250805171144",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-05 17:04:00",
        "Headline": "Ryan, 14, was pronounced dead at the scene after Burba, who was four times above the legal drug-drive limit, lost control of his wife's van and swerved off the M6 near Lancaster before hitting a tree in April.",
        "Content": "A father who crashed the vehicle he was driving after having a cocaine-fuelled epileptic fit at the wheel, killing his teenage son, has been jailed for 10 years. Daniel Burba, 31, was driving his wife's Peugeot van when it swerved off the M6 near Lancaster in Lancashire and hit a tree in April. His 14-year-old son, Ryan Morgan, suffered head injuries and was pronounced dead at the scene of the collision on the southbound carriageway between junctions 34 and 33. The youngster died \"in terror\" as he tried to gain control of the van moments before the crash, Preston Crown Court heard. Burba, from Morecambe, who had been advised not to drive due to his fits and only had a provisional driving licence, was taken to hospital with \"relatively minor\" injuries to his ribs and lacerations. While he was being treated, a paramedic found a small bag of cocaine in Burba's wallet, and blood tests showed he was four times above the legal drug-drive limit, the court heard. Burba had been told by his doctor more than a decade earlier to stop taking the banned class A drug after he suffered a seizure which lasted up to four minutes. He was also advised not to drive. \n                  Cocaine smugglers jailed for more than 82 years in total\n                 \n                  Can anything stop the ketamine crisis?\n                 \n                  'It destroyed my life': The drug addiction leaving users in chronic pain \n                 He was given a similar warning in February when he was admitted to hospital after more fits and was also told to inform the DVLA. Sentencing him, Judge Robert Altham reminded him that he knew cocaine made further fits more likely and should not have been driving at all, \"unsupervised and certainly not on the motorway\". \"You chose to drive on a motorway on a busy bank holiday Sunday. You had a passenger in the van, and that passenger was your son, a person you should have been protecting and not endangering.\" \"You knew that taking cocaine made your decision to drive all the more dangerous. Your driving put many other road users in danger,\" Judge Altham, the Honorary Recorder of Preston, added. Burba pleaded guilty at an earlier hearing to causing death by dangerous driving and also admitted driving without a licence or insurance. He had been travelling in convoy with his wife, Frances - Ryan's stepmother - and their three children. Witnesses described Burba driving \"erratically\" on the motorway with hazard lights on as the vehicle narrowly missed swerving into a coach on the inside lane. A witness said the front seat passenger \"looked really scared\" and was apparently trying to steer the van while the driver was slumped over the wheel. The Bipper van hit the central reservation, swerved across the carriageway and then up a grass bank before it hit a tree, the court heard. Ryan's mother Kim, who was in court, said Burba's actions were \"disgusting\". Read more on Sky News:'Toxic culture' of Titan sub operatorRobinson bailed over assaultTV presenter accused of rape Her son \"would have changed the world,\" she said. \"He [Ryan] made it a better place in the short time he was here. He made everyone smile who came into contact with him. He had a smile that lit up the room. \"Daniel has taken all that and more.\" Paul Humphries, defending, said Burba was \"remorseful\" and \"very much regrets his actions that day\". Burba was banned from driving for 14 years and five months."
    },
    {
        "title": "Family of 'loving family man' who died at Oasis concert talk of 'devastation'",
        "description": "The family of a man who fell to his death at the end of an Oasis concert at Wembley Stadium say he \"slipped\" and there are \"questions about the barriers\".",
        "url": "https://news.sky.com/story/oasis-gig-death-witness-saw-similar-incident-and-asks-were-lessons-learned-13407390",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lee-claydon-oasis_6983635.jpg?20250805191312",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-05 15:21:00",
        "Headline": "Lee Claydon, 45, fell to his death at Wembley Stadium on Saturday. His family say he was a hard-working family man who loved his son.",
        "Content": "The family of a man who fell to his death at the end of an Oasis concert at Wembley Stadium say he \"slipped\" and there are \"questions about the barriers\". Lee Claydon, a 45-year-old landscape gardener from Bournemouth in Dorset, had \"everything going for him\", his father said. Clive Claydon, 75, said his son was a \"lovely bloke\" and a \"hard-working family man\" who loved his own son. \"He had everything going for him. I am so devastated I have been to the doctor for tablets and everything to get over it,\" Mr Claydon said. Discussing how the tragedy may have happened, he said his son \"doesn't take drugs [and] may have had a couple of beers but who hadn't there\"? He added: \"People have said horrible things but it was just an accident.\" Lee Claydon was at the gig with his brother and his brother's children who did not see what happened. He was found with \"injuries consistent with a fall\" and pronounced dead at the scene, the Metropolitan Police said. Oasis said they were \"shocked and saddened\" to hear of his death. \"It must have been horrific,\" Clive Claydon said. \"All I know is there was beer everywhere, it's slippery, he slipped apparently, we do not know the rest of it, there's questions about the barriers.\" The Met Police is asking for any witnesses, or anyone with mobile phone footage, to come forward. A fundraising page has been set up. Witness saw similar incident and asks 'were lessons learned'? A woman who saw a man falling from an upper tier at Wembley Stadium in June 2021 says the death of Lee Claydon makes her wonder whether lessons have been learned. Stephanie Good, 39, said a man fell during a Euro 2020 match between England and Croatia. He landed \"right next to where we were\" on the \"stairwell between rows of seats\", she said. Named as Jon, he reportedly survived but suffered two broken ankles, a fractured femur and fractured pelvis just before kick-off. Ms Good said she tried to give feedback but was unable to and felt the \"emergency response was really lacking\". The NHS manager from east London said the tragic incident at the Oasis gig was \"so similar\" to what she witnessed that it made her wonder \"were lessons learned\"? During that incident, among stadium staff \"nobody seemed to know what to do\", she told the Press Association. She thinks the man may have been trying to attach a flag to the front of a stand and \"somehow managed to fall straight over\". She said: \"They (staff) didn't seem well-trained in terms of how to respond to a really big emergency. \"Their stewards were kind of paralysed a little bit by fear, or they just weren't well trained and didn't know how to call for paramedics. \"It was us who were sort of shouting at them that they needed to get some paramedics. \"The first person on the scene wasn't a stadium paramedic or St John Ambulance. It was an off-duty firefighter who had seen the guy fall and ran down to just try and offer some help.\" Read more from Sky News:Tommy Robinson bailed after arrest over alleged assaultPolice should be 'more transparent' over suspects, home sec says Regarding the follow-up, Ms Good said staff moved spectators to other seats but did not ask for witness statements. She added: \"They didn't seek any input from people who'd seen the incident or the aftermath of it. They didn't seem interested in speaking to anybody about it. \"I was a bit concerned, because I felt that the emergency response was really lacking.\" She then tried to get in touch to give feedback, but was unable to do so and did not receive a response to a message on social media, she said. A Wembley spokesperson said: \"Wembley Stadium operates to a very high health and safety standard, fully meeting legal requirements for the safety of spectators and staff, and is certified to and compliant with the ISO 45001 standard. \"We work very closely and collaboratively with all relevant event delivery stakeholders - including event owners, local authorities, the Sports Grounds Safety Authority and the police - to deliver events to high standards of safety, security and service for everyone attending or working in the venue.\""
    },
    {
        "title": "Staff 'literally sleep on their shifts', wrote girl who died while receiving psychiatric care",
        "description": "A 14-year-old girl who died while she was a patient on a psychiatric unit wrote a letter before she died saying \"staff literally sleep on their shifts\" and how she thought the hospital should be \"shut down\".",
        "url": "https://news.sky.com/story/staff-literally-sleep-on-their-shifts-wrote-girl-who-died-while-receiving-psychiatric-care-13407447",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ruth-szymankiewicz_6982985.jpg?20250804211816",
        "type": "UK",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-08-05 17:20:00",
        "Headline": "Ruth Szymankiewicz was supposed to have one-to-one supervision but an inquest hears she was left alone.",
        "Content": "By Laura Bundock, health correspondent   A 14-year-old girl who died while she was a patient on a psychiatric unit wrote a letter before she died saying \"staff literally sleep on their shifts\" and how she thought the hospital should be \"shut down\". Ruth Szymankiewicz died after a self-harm incident at Huntercombe Hospital in Berkshire. Her note also said there was \"non-existent therapy\" for patients and an \"unsafe number of staff\" at the hospital which has since closed down. And it said that Huntercombe \"makes you 10 times worse than when you came\". Ruth was supposed to have one-to-one supervision but an inquest into her death was told her support worker left her alone at the end of his shift, which was also his first day working at Huntercombe. It's been revealed he used a fake passport to falsify his identity, and days after Ruth's death fled the UK on a plane to Ghana. The jury was played CCTV footage from the hospital which showed Ruth walking through Thames Ward where she was a patient without anyone accompanying her despite the Level 3 observations requiring someone to watch her at all times. She is seen entering her bedroom and closing the door behind her. It was during this period of less than 20 minutes that she harmed herself. Staff attempted to resuscitate Ruth, but she died two days later at the John Radcliffe Hospital in Oxford. The inquest heard how Ruth's support worker had been working on another ward at the hospital but had been moved during the day to her ward because it was short-staffed. Read more:Tommy Robinson bailed after arrest over alleged assaultPolice should be 'more transparent' over suspects, home sec says Clinical team leader Ellesha Brannigan, who worked on Thames Ward, told the inquest how support workers should verbally hand over to each other including handing over a clipboard which contained details about the patient. Huntercombe Hospital, which was also known as Taplow Manor, was investigated by Sky News and The Independent and in 2023 the unit was shut down. The inquest continues."
    },
    {
        "title": "Tommy Robinson bailed after arrest over alleged assault at railway station",
        "description": "Tommy Robinson has been released on bail after being arrested over an alleged assault at St Pancras station in central London.",
        "url": "https://news.sky.com/story/tommy-robinson-bailed-after-arrest-over-alleged-assault-at-railway-station-13407215",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tommy-robinson-court_6956047.jpg?20250805140949",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-05 09:22:00",
        "Headline": "Robinson, whose real name is Stephen Yaxley-Lennon, was arrested after footage emerged appearing to show him walking back and forth next to a motionless man.",
        "Content": "Tommy Robinson has been released on bail after being arrested over an alleged assault at St Pancras station in central London. The 42-year-old far-right activist was arrested at Luton Airport on Monday evening in connection with the incident which took place on 28 July. Footage on social media appeared to show Robinson, whose real name is Stephen Yaxley-Lennon, walking back and forth next to a man lying motionless on the ground. British Transport Police (BTP) said on Tuesday he has been released on police bail until 2 September while enquiries continue. He was arrested on suspicion of grievous bodily harm and taken into custody after arriving in the UK on a flight from Faro in Portugal. Read more from Sky NewsEx-Arsenal player in courtTV presenter charged with rape offencesPolice warn of mass arrests ahead of protest He had been wanted for questioning after leaving the country for Tenerife in the early hours of 29 July, BTP said. The other man seen in the footage was taken to hospital with \"serious injuries\" but was discharged on 30 July, the force added."
    },
    {
        "title": "Postcode lottery for Mounjaro, the 'King Kong' of weight loss jabs, with only eight NHS care boards providing treatment",
        "description": "Thousands of severely obese patients are facing severely delayed treatment with what's been called the 'King Kong' of weight loss jabs - because the NHS rollout has been mismanaged and underfunded, according to Sky News research.",
        "url": "https://news.sky.com/story/postcode-lottery-for-mounjaro-the-king-kong-of-weight-loss-jabs-with-only-eight-nhs-care-boards-providing-treatment-13407142",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-05 06:57:00",
        "Headline": "Freedom of Information requests by Sky News reveal only eight of 42 NHS Integrated Care Boards in England were providing the weight loss treatment to patients, and many of the rest were unable to guarantee when it would be available.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of severely obese patients are facing severely delayed treatment with what's been called the 'King Kong' of weight loss jabs - because the NHS rollout has been mismanaged and underfunded, according to Sky News research. Mounjaro was supposed to be available through GP surgeries and other community services from 23 June under an agreement between NHS England and the National Institute for Health and Care Excellence (NICE), the body that provides guidance on the use of new drugs. But Freedom of Information requests by Sky News reveal a postcode lottery, with only eight of 42 NHS Integrated Care Boards (ICBs) in England telling us they were providing treatment to patients, and many of the rest unable to guarantee when it would be available. The research also shows that at least 19 had a cap on how many eligible patients they would treat in the first year. Dr Jonathan Hazlehurst, an obesity specialist at University Hospitals Birmingham, said many patients were desperate for treatment - and Mounjaro may be a hopeful aid for those eligible. \"Giving people open promises and setting them up for disappointment and failure is clearly grossly unfair,\" he said. \"That's what the current system is doing.\" NICE said in December that the NHS should offer Mounjaro to patients with a BMI over 40 and at least four clinical conditions related to their weight, such as heart disease or type 2 diabetes. It calculated from NHS England data that there were 97,500 patients who should be treated in the first year. But Dr Hazelhurst says NHS England has only provided funding for just over 22,000 patients. Read more:Weight loss and diabetes jabs linked to potentially fatal side effectOzempic to Wegovy - what are the weight loss injections?  \"It shows that there's a lack of political will to fund this adequately,\" he said. \"NHS England says that obesity costs the NHS £11.4bn per annum as a pure NHS cost. \"Yet we can't even afford to properly fund the rollout of a life-changing drug in year one. That just doesn't make any sense.\" Gary - who doesn't want his surname used - weighs 25 stone (158kg) and becomes severely out of breath after climbing only a few stairs. He is eligible for treatment with Mounjaro under the agreed NHS guidelines. But his surgery said \"no\" and told him it would be at least the autumn before the drug would be available in the Hampshire area. \"They said to us that September would be the earliest they going to look at it and then the criteria might change, so there's no knowing if I'm going to get it,\" he said. \"I was so excited when I read about this drug. If I had the drug and lost some weight, it could help me move around, it could help me go fishing again, all kinds of things. \"It's not for vanity. It would be a life changer.\" There are 3.4 million people in England who would qualify for treatment under the NICE eligibility criteria. But NHS England has said it will take 12 years to assess and prescribe to those who need it. Dr Hazlehurst said there would never be such a slow rollout with a new cancer treatment - and yet, obesity also kills. \"There's a huge amount of stigma that drives things to do with obesity care all across the system,\" he said. \"The 'eat less, move more' nonsense doesn't help. \"That is a really unhelpful, harmful and stigmatising approach, particularly in an age of effective treatment.\" Read more from Thomas Moore:Octopus boom off UK coast down to 'perfect storm'Plastics industry and powerful nations battle heats upScientists are on the hunt for dolphin poo A spokesperson for NHS England said it had \"fully supported the rollout\" of Mounjaro. They said: \"We issued guidance and provided funding in March to all Integrated Care Boards to support treatment costs, enable scaling of services and provide wrap-around care, including digital support services.\""
    },
    {
        "title": "This man survived Hiroshima - and has a stark warning for us all",
        "description": "Toshiyuki Mimaki is exhausted when we meet him.",
        "url": "https://news.sky.com/story/this-man-survived-hiroshima-and-he-has-a-stark-warning-for-us-all-13407417",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hiroshima-survivor_6983617.jpg?20250805185650",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-08-05 16:11:00",
        "Headline": "Eighty years since the bombing of Hiroshima, survivor Toshiyuki Mimaki says the world now faces its \"most dangerous\" era.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Toshiyuki Mimaki is exhausted when we meet him. The 83-year-old sinks into his chair, closes his eyes, and asks us to keep it brief. But then he starts talking, and his age seems to melt away with the power of his stories. He is a survivor of Hiroshima’s atomic bomb, a lifelong advocate for nuclear disarmament and, as of last year, a Nobel Peace Prize winner.  But now, on the 80th anniversary of the bombing, he comes with more than just memories - he has a message, and it is stark. \"Right now is the most dangerous era,\" he says. \"Russia might use it [a nuclear weapon], North Korea might use it, China might use it. \"And President Trump - he's just a huge mess. \"We've been appealing and appealing, for a world without war or nuclear weapons - but they're not listening.\" Read more:The 'destroyer of worlds' who built the atomic bomb  'I didn't hear a sound' Mr Mimaki was three years old when the US dropped an atomic bomb on the city of Hiroshima. It was the first time a nuclear weapon had been used in war, and it's remembered as one of the most horrific events in the history of conflict. It's estimated to have killed over 70,000 people on the spot, one in every five residents, unleashing a ground heat of around 4,000C, melting everything in its path and flattening two thirds of the city. Horrifying stories trickled out slowly, of blackened corpses and skin hanging off the victims like rags. \"What I remember is that day I was playing outside and there was a flash,\" Mr Mimaki recalls. \"We were 17km away from the hypocentre. I didn't hear a bang, I didn't hear a sound, but I thought it was lightening. \"Then it was afternoon and people started coming out in droves. Some with their hair all in mess, clothes ragged, some wearing shoes, some not wearing shoes, and asking for water.\" 'The city was no longer there' For four days, his father did not return home from work in the city centre. He describes with emotion the journey taken by his mother, with him and his younger bother in tow, to try to find him. There was only so far in they could travel, the destruction was simply too great. \"My father came home on the fourth day,\" he says. \"He was in the basement [at his place of work]. He was changing into his work clothes. That’s how he survived. \"When he came up to ground level, the city of Hiroshima was no longer there.\" 'People are still suffering' Three days later, the US would drop another atomic bomb on the city of Nagasaki, bringing about an unconditional Japanese surrender and the end of the Second World War. By the end of 1945, the death toll from both cities would have risen to an estimated 210,000 and to this day it is not known exactly how many lost their lives in the following years to cancers and other side effects. \"It's still happening, even now. People are still suffering from radiation, they are in the hospital,\" Mr Mimaki says. \"It's very easy to get cancer, I might even get cancer, that's what I'm worried about now.\" Tragically, many caught up in the bomb lived with the stigma for most of their lives. Misunderstandings about the impact of radiation meant they were often shunned and rejected for jobs or as a partner in marriage. Many therefore tried to hide their status as Hibakusha (a person affected by the atomic bombs) and now, in older age, are finding it hard to claim the financial support they are entitled to. And then there is the enormous psychological scars, the PTSD and the lifelong mental health problems. Many Hibakusha chose to never talk about what they saw that day and live with the guilt that they survived. For Mr Mimaki, it's there when he recounts a story of how he and another young girl about his age became sick with what he now believes was radiation poisoning. \"She died, and I survived,\" he says with a heavy sigh and strain in his eyes. He has subsequently dedicated his life to advocacy, and is co-chair of a group of atomic bomb survivors called Nihon Hidankyo. Its members were awarded the Nobel Peace Prize in 2024. 'Why do humans like war so much?' But he doesn’t dwell much on any pride he might feel. He knows it's not long until the bomb fades from living memory, and he deeply fears what that might mean in a world that looks more turbulent now than it has in decades. Indeed, despite advocacy like his, there are still around 12,000 nuclear warheads in the world in the hands of nine countries. \"In the future, you never know when they might use it. Russia-Ukraine, Israel-Gaza, Israel-Iran - there is always a war going on somewhere,\" he says. \"Why do these animals called humans like war so much? \"We keep saying it, we keep telling them, but it's not getting through, for 80 years no-one has listened. \"We are Hibakusha, my message is we must never create Hibakusha again.\""
    },
    {
        "title": "The chilling document that traces nuclear weapons back to Britain - and the threat we now face",
        "description": "Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima.",
        "url": "https://news.sky.com/story/fragmented-and-febrile-is-threat-of-nuclear-war-worse-than-ever-13407307",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-clarke-nuclear_6983517.jpg?20250805164454",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-05 12:29:00",
        "Headline": "Nuclear weapons have not been used in warfare since the atomic bombings of Hiroshima and Nagasaki 80 years ago this week. However, experts warn today's conflicts put the world in a precarious state.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima. It was the dawn of the atomic age, but the birth of the bomb can be traced beyond the deserts of New Mexico to Britain, five years earlier. A copy of a hand-typed document, now in the Bodleian library in Oxford, is the first description of an atom bomb small enough to use as a weapon. The Frisch-Peierls Memorandum was written by two nuclear physicists at the University of Birmingham in 1940. Otto Frisch and Rudolf Peierls don't feature in the film Oppenheimer, but their paper is credited with jump-starting the Manhattan Project that ultimately built the bomb. Both Jewish scientists who had both fled Nazi Germany, they built on the latest understanding of uranium fission and nuclear chain reactions, to propose a bomb made from enriched uranium that was compact enough to be carried by an aircraft. The document, so secret at the time only one copy was made, makes for chilling reading. Not only does it detail how to build a bomb, but foretells the previously unimaginable power of its blast. \"Such an explosion would destroy life in a wide area,\" they wrote. \"The size of this area is difficult to estimate, but it will probably cover the centre of a big city.\" Radioactive fallout would be inevitable \"and even for days after the explosion any person entering the affected area will be killed\". Both lethal properties of the bombs that would subsequently fall on Hiroshima and Nagasaki, killing around 100,000 instantly and more than 100,000 others in the years that followed - most of them civilians. Read more:Hiroshima survivor's stark warningThe 'destroyer of worlds' who built the atomic bomb 'The most terrifying weapons ever created' Those bombs had the explosive power of around 16 and 20 kilotonnes of TNT respectively - a force great enough to end the Second World War. But compared to nuclear weapons of today, they were tiny. \"What we would now term as low yield nuclear weapons,\" said Alexandra Bell, president of the Bulletin of Atomic Scientists, which campaigns for nuclear disarmament. \"We're talking about city destroyers…these really are the most terrifying weapons ever created.\" Many of these \"high yield\" nuclear weapons are thermonuclear designs first tested in the 1950s. They use the power of nuclear fission that destroyed Hiroshima to harness yet more energy by fusing other atoms together. Codenamed \"Mike\", the first test of a fusion bomb in 1952 yielded at least 500 times more energy than those dropped on Japan. Impractically devastating, but proof of lethal principle. Variants of the W76 thermonuclear warhead currently deployed by the US and UK are around 100Kt, six times more powerful than the Hiroshima bomb. Just one dropped on a city the size of London would result in more than a quarter of a million deaths. The largest warhead in America's current arsenal, the B83 has the explosive equivalent of 1.2 megatonnes (1.2 million tonnes of TNT) and would kill well over a million instantly. But modern intercontinental ballistic missiles (ICBMs) are designed to carry multiple warheads. Russia's Sarmat 2, for example, is thought to be capable of carrying 10 megatonnes of nuclear payload. They're designed to strike multiple targets at once, but if all were dropped on a city like London most of its population of nine million would be killed or injured. If that kind of power is incomprehensible, consider how many nuclear warheads there now are in the world. Nine countries - the US, Russia, China, France, the UK, India, Pakistan, North Korea and Israel - have nuclear weapons. Several others are interested in having them. The US and Russia have around 4,000 nuclear warheads each - 90% of the global nuclear arsenal and more than enough to destroy civilisation. According to analysis from the Stockholm International Peace Research Institute, China us thought to have around 600 warheads, but has indicated a desire to catch up. Beijing is believed to be building up to 100 new warheads a year and the ICBMs to deliver them. Five more nuclear powers, including the UK, plan to either increase or modernise their existing nuclear stockpiles. The nuclear arms race that created this situation was one imagined by Frisch and Peierls in their 1940 memorandum. Given the mass civilian casualties it would inevitably cause, the scientists questioned whether the bomb should ever be used by the Allies. They wrote, however: \"If one works on the assumption that Germany is, or will be, in the possession of this weapon… the most effective reply would be a counter-threat with a similar bomb.\" What they didn't believe was that the bomb they proposed, and went on to help build at Los Alamos, would ever be used. Devastated by its use on Japan, Peierls disavowed the bomb and later campaigned for disarmament. But that work is now as unfinished as ever. Non-proliferation treaties helped reduce the expensive and excessive nuclear arsenals of Russia and the US, and prevent more countries from building nuclear bombs. 'Everything trending in the wrong direction' But progress ground to a halt with the invasion of Ukraine, as nuclear tensions continued elsewhere. \"After all the extremely hard, tedious work that we did to reduce nuclear risks everything is now trending in the wrong direction,\" said Alexandra Bell. \"The US and Russia refuse to talk to each other about strategic stability. \"China is building up its nuclear arsenal in an unprecedented fashion and the structures that were keeping non-proliferation in place stemming the spread of nuclear weapons are crumbling around us.\" 'New risks increasing the threat' The world may have come closer to nuclear conflict during the Cuban missile crisis of 1963, but the fragmented and febrile state of geopolitics now is more dangerous, she argues. Conflict regularly flares between nuclear armed India and Pakistan; Donald Trump's foreign policy has sparked fears that South Korea might pursue the bomb to counter North Korea's nuclear threat; some states in the Middle East are eyeing a nuclear deterrent to either nuclear-wannabe Iran or nuclear armed Israel. Add to the mix the military use of AI and stressors like climate change, and the view of the Bulletin of Atomic Scientists is the situation is more precarious than in 1963. \"It's more dangerous, but in a different way,\" said Alexandra Bell. \"The confluence of all these new existential risks are increasing the threat worldwide.\""
    },
    {
        "title": "Titan sub report reveals contributing factors that led to implosion",
        "description": "\"Critically flawed\" safety practices and a \"toxic workplace culture\" were among the contributing factors that led to the Titan submersible imploding on its way to the Titanic, a report has said.",
        "url": "https://news.sky.com/story/toxic-workplace-culture-one-of-contributing-factors-that-led-to-titan-submersible-implosion-13407220",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-titan-submersible_6688629.jpg?20250523094816",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-05 09:24:00",
        "Headline": "The implosion killed all five people on board the vessel, which disappeared on its maiden voyage to the Titanic in June 2023.",
        "Content": "\"Critically flawed\" safety practices and a \"toxic workplace culture\" were among the contributing factors that led to the Titan submersible imploding on its way to the Titanic, a report has said. The US Coast Guard Marine Board of Investigation (MBI) said in its report into Oceangate - the private company that owned the submersible - that \"the loss of five lives was preventable\". Titan operator Stockton Rush, who founded OceanGate; two members of a prominent Pakistani family, Shahzada Dawood and his son Suleman; British adventurer Hamish Harding; and Titanic expert and the sub's pilot, Paul-Henri Nargeolet, died on board. On Tuesday, a 335-page report into the disaster went on to make 17 safety recommendations, which MBI chairman Jason Neubauer said will help prevent future tragedies. The investigation's report found that the submersible's design, certification, maintenance and inspection process were all inadequate. It also highlighted the fact that the company failed to look into known past problems with the hull, and issues with the expedition were not monitored in real time and acted upon. OceanGate's co-founder, Guillermo Sohnlein, told Sky News presenter Anna Botting that he can't defend his former colleague, Stockton Rush, over the failures because Rush \"did what he did, and he said what he said\". However, he said it was \"easy to see [Rush] as a criminal, as a villain led by hubris and ego\" but \"for those of us that knew him before all that, he's a human being just like us\". When asked whether Mr Rush was \"cavalier\" with safety and regulations, Mr Sohnlein, who left OceanGate in 2013, nodded and said the report's findings had given him a sense of \"survivor's guilt\". \"If I was still there, maybe I could have helped drive that a little bit differently,\" he said. 'Intimidation tactics' The report states that contributing factors to the disaster included OceanGate's safety culture and operational practices being critically flawed, and an \"ineffective whistleblower process\" as part of the Seaman's Protection Act - a US federal law designed to protect the rights of seamen. The report adds that the firing of senior staff members and the looming threat of being fired were used to dissuade employees and contractors from expressing safety concerns.  It alleges: \"For several years preceding the incident, OceanGate leveraged intimidation tactics, allowances for scientific operations, and the company's favourable reputation to evade regulatory scrutiny. \"By strategically creating and exploiting regulatory confusion and oversight challenges, OceanGate was ultimately able to operate Titan completely outside of the established deep-sea protocols, which had historically contributed to a strong safety record for commercial submersibles.\" Data and forensics correspondent A submersible designed to visit the wreck of the Titanic, portrayed by its chief executive as indestructible. That description was hubris.  Much more importantly,  though, it was also a contributory factor in \"a preventable tragedy\", according to the official coastguard investigation, because it created a false sense of security for passengers. The report is scathing, outlining a litany of mistakes by Oceangate and specifically its CEO, Stockton Rush. It said that his sustained efforts to misrepresent Titan as \"indestructible\" provided a false sense of safety for passengers and regulators. And in his dual role and as acting pilot of the submersible, he exhibited \"negligence that contributed to the death of four individuals\". Had he not died on the Titan, Rush may have been subject to criminal liability, the report said. Ambition was central to the Titan's marketing and appeal. \"Don’t miss out on the opportunity to be part of history,\" its promotional videos urged. But ambition became arrogance, became negligence, and cost five people their lives. The report states that the chief executive was allowed to \"completely ignore vital inspections, data analyses, and preventative maintenance procedures\", which \"culminated in a catastrophic event\". Lead investigator Thomas Whalen and marine board chairman Mr Neubauer said there was evidence Mr Rush had committed \"potential criminal offences\", namely \"misconduct or neglect of ship officers\". Had he survived the incident, he would have faced a maximum sentence of 10 years in prison, the report says. Numerous OceanGate employees have come forward in the two years since the implosion to support those claims. OceanGate suspended operations in July 2023 and has not commented on the MBI's report. Read more:What happened to the Titan?Hopes incident won't be end of deep sea explorationWhy billionaires are drawn to extreme tourism The Titan sub went missing on its voyage to the wreck of the Titanic. After five frantic days of searching, the wreckage was eventually found on the ocean floor roughly 500m from the sunken Titanic. The MBI investigation was launched shortly after the disaster. During two weeks of testimony in September 2024, the former OceanGate scientific director said the Titan malfunctioned during a dive just a few days before it imploded. OceanGate's former operations boss also told the panel the sub was a huge risk and the company was only focused on profit. The board said one challenge of the investigation was that \"significant amounts\" of video footage evidence that had been captured by witnesses was not subject to its subpoena authority because the witnesses were not American citizens."
    },
    {
        "title": "Gena Heraty: Family of Irishwoman kidnapped from orphanage in Haiti ask people to 'keep her in your hearts'",
        "description": "The family of an Irishwoman who was among eight people taken by armed kidnappers in Haiti have asked people to keep the group \"in your hearts\".",
        "url": "https://news.sky.com/story/gena-heraty-family-of-irishwoman-kidnapped-from-orphanage-in-haiti-ask-people-to-keep-her-in-your-hearts-13407508",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gena-heraty-ireland_6983697.jpg?20250805231431",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-05 19:26:00",
        "Headline": "Ms Heraty, who has worked in the Caribbean country for decades, was among eight people, including a three-year-old child, taken from an orphanage on Sunday.",
        "Content": "The family of an Irishwoman who was among eight people taken by armed kidnappers in Haiti have asked people to keep the group \"in your hearts\". Gena Heraty and seven others, including a three-year-old child, were taken from an orphanage in Kenscoff in southern Haiti on Sunday. Ms Heraty, from Westport in Co Mayo, has worked in the Caribbean country for decades. She oversees the orphanage, which is operated by the humanitarian organisation Nos Petits Freres Et Soeurs (Our Little Brothers And Sisters) and is located about 12 miles from the capital Port-au-Prince. Ireland's deputy prime minister and minister for foreign affairs, Simon Harris, said he spoke by phone to Haiti's foreign minister, Harvel Jean-Baptiste, and asked that everything be done to secure the release of the group. The Irishwoman's siblings were joined by local people to pray for her safe return at a mass in her parish church on Monday. Ireland's Department of Foreign Affairs said in a statement that her family was \"still coming to terms with the awful news\". \n                  The Kenyan police mission with far-reaching powers taking the fight directly to Haiti's gangs\n                 \n                  Caught up in the crossfire: Reporting from an urban war zone\n                 \n                  Haiti crisis: How did gangs take over country? Is it past point of no return? Watch Q&A with Stuart Ramsay\n                 It said it is working with all concerned parties in both countries \"who have all assured us that everything possible is being done to get Gena, and those taken with her, safely released as soon as possible\". \"Gena is loved and respected by so many people, as is evident in the outpouring of concern, support and prayers from everyone near and far.\" The statement said the family asked for \"discretion and patience\".  Mr Harris said he had been in contact with Ms Heraty's family on Monday and officials in his department would remain in \"constant\" touch with them, admitting the last few days had been \"extremely traumatic\" for the families of all those kidnapped. The minister said his Haitian counterpart, foreign affairs minister Harvel Jean Baptiste, \"assured me of his support in our work to ensure the safe release of Gena, and all the hostages, who have gone through the most horrendous of ordeals\".  Viatores Christi, a lay missionary organisation, said that one of its members, Ms Heraty, was taken by armed individuals from her home at the NPFS compound in Kenscoff on Sunday morning. \"Gena has worked in Haiti for over 30 years, dedicating her life to children and adults with disabilities.\" \"Her commitment, compassion and steady presence have made a lasting difference to many families in the region,\" the group said. Read more on Sky News:'Toxic culture' of Titan sub operatorRobinson bailed over assaultTV presenter accused of rape Fr John Kenny, a Westport parish priest, said the local community was \"saddened and shocked\" by the kidnap of Ms Heraty, whom he described as \"wonderful, generous and caring\". He said Ms Heraty's sister Mary spoke at Monday's service in her local parish church in Cushlough."
    },
    {
        "title": "Full Israeli occupation of Gaza would bring major strategic and moral risks and could massively backfire",
        "description": "One thing is now painfully clear: Israel's war in Gaza is sliding into a forever war.",
        "url": "https://news.sky.com/story/full-israeli-occupation-of-gaza-would-bring-major-strategic-and-moral-risks-and-could-massively-backfire-13407366",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-aid-israel_6983376.jpg?20250805133521",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-08-05 14:34:00",
        "Headline": "Currently, the Israel Defence Forces (IDF) operates across 88% of the territory, which is either under Israeli displacement orders or is a designated militarised zone. But under the new plan, the military would advance into the remaining areas.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  One thing is now painfully clear: Israel's war in Gaza is sliding into a forever war. With ceasefire negotiations having collapsed, multiple reports in the Israeli media suggest that Prime Minister Benjamin Netanyahu is now seeking cabinet approval to fully occupy the Gaza Strip. Currently, the Israel Defence Forces (IDF) operates across 88% of the territory, which is either under Israeli displacement orders or is a designated militarised zone. But under the new plan, the military would advance into the remaining areas. Gaza latest: Israeli officials meet to discuss Gaza military plans It is a move that's reportedly opposed by senior military leaders who fear the long-term costs of total occupation. We already have a sense of what such an occupation would look like. The Gaza Strip would be further chopped and sliced into militarised zones, patrolled by Israeli forces. Palestinians would be confined to tightly controlled enclaves, with limited movement, constant surveillance, and highly restricted access to humanitarian aid. For Mr Netanyahu, the political logic may seem compelling. Public outrage over images of skeletal Israeli hostages has presented an opportunity to reassert his security credentials, which were significantly damaged after the catastrophic events of 7 October 2023, that occurred under his watch. Read more:Over 100 journalists demand 'unsupervised' access to GazaWhy far-right Israeli minister's visit to holy site risks inflaming tensions  With elections on the horizon - not imminent but soon enough - Mr Netanyahu is under pressure. A dramatic military move may offer him a short-term narrative of strength and control. But full occupation of Gaza brings major strategic and moral risks and could massively backfire. There's no guarantee it will create new leverage in stalled negotiations, nor is it likely to advance what's now being floated as a comprehensive peace deal.  In fact, the opposite is more probable. The occupation could entrench the conflict even further, triggering a long-term insurgency in which Gazans suffer even more and Israeli soldiers become perpetual targets of guerrilla attacks. Protracted urban warfare amid Gaza's ruins would require tens of thousands of troops and carry the likelihood of significant Israeli casualties. The military is already stretched thin. An expanded operation would only deepen reservist fatigue and public weariness.  Then there's the grave risk to hostages. Military operations in areas where they may be held could endanger their lives even further. And this would likely sharpen the deep divides in Israeli society. Protests against the war are already widespread and appear to be growing The unity that existed in the war's early days has been replaced by distrust and outrage. Internationally, Israel faces mounting criticism and increasing diplomatic isolation. Mr Netanyahu may be in denial about how his actions are perceived globally, but the optics of a full occupation, built on the rubble of the already staggering destruction and displacement in Gaza, will only intensify global condemnation."
    },
    {
        "title": "Brazil's former president placed under house arrest after social media post",
        "description": "Brazil's former president has been put under house arrest while he is on trial for allegedly plotting to stage a coup.",
        "url": "https://news.sky.com/story/brazils-former-president-placed-under-house-arrest-after-social-media-post-13407092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jair-bolsonaro-court_6867800.jpg?20250326172638",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-05 01:28:00",
        "Headline": "Jair Bolsonaro is on trial over scenes in 2023 of his supporters, who rejected the election victory of President Lula, storming buildings symbolising Brazil's democracy.",
        "Content": "Brazil's former president has been put under house arrest while he is on trial for allegedly plotting to stage a coup. On Monday, the country's Supreme Court ordered Jair Bolsonaro to remain at home and for police to seize all the mobile phones in his property after he broke legal restrictions that stop him using social media. Prosecutors accuse the right-wing politician of heading a criminal organisation that plotted to overturn the 2022 election and kill President Lula and a Supreme Court justice. He is also accused of using social media to encourage Donald Trump to interfere in his case. 'Flagrant disrespect' Under Monday's new restrictions, visitors authorised to see Bolsonaro will not be allowed to record the politician or post on his behalf. The ruling came after the 70-year-old used his sons' social media channels to speak to supporters during a rally in Rio de Janeiro on Sunday. Through his son's mobile phone, he told protesters: \"Good afternoon, Copacabana, good afternoon my Brazil, a hug to everyone, this is for our freedom.\" \"The flagrant disrespect to the precautionary measures was so obvious that the defendant's son, Senator Flavio Bolsonaro, decided to remove the posting in his Instagram profile, with the objective of hiding the legal transgression,\" the judge wrote in his Monday ruling. 'No limits!' Bolsonaro's lawyers say he will appeal the new restrictions and his words cannot \"be regarded as ignoring precautionary measures or as a criminal act\". Flavio Bolsonaro claimed on X that Brazil \"is officially in a dictatorship\" after his father's house arrest. \"The persecution of de Moraes against Bolsonaro has no limits!\" the senator wrote. Last week, Mr Trump used Bolsonaro's trial, which he describes as a \"witch hunt\", to justify imposing 50% tariffs on Brazil. Read more on Sky News:Kremlin urges nuclear cautionHow Euros star juggled studies and training  Justice Alexandre de Moraes, who is presiding over the trial, also had sanctions placed on him by the US for allegedly suppressing freedom of expression and the ongoing trial of Bolsonaro. On Sunday, tens of thousands of Bolsonaro supporters took to the streets to plead for the former president to be pardoned, along with hundreds of others who are on trial for destroying government buildings in Brasilia on 8 January 2023. On that day, Bolsonaro supporters stormed the buildings that symbolise Brazil's democracy, a week after Lula had taken office. They rejected his election victory and urged the military to overthrow him."
    },
    {
        "title": "India flash floods: Race to find survivors after at least four killed as homes and hotels destroyed",
        "description": "At least four people have been killed and buildings swept away after floodwater crashed through a Himalayan village in India.",
        "url": "https://news.sky.com/story/india-flash-floods-race-to-find-survivors-after-at-least-four-killed-as-homes-and-hotels-destroyed-13407326",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dharali-flood-india_6983418.png?20250805141952",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-05 13:04:00",
        "Headline": "Experts say brief, intense downpours known as cloudbursts are becoming more common in the country's Uttarakhand state.",
        "Content": " At least four people have been killed and buildings swept away after floodwater crashed through a Himalayan village in India. Uttarakhand state's chief minister said police and the army were \"on a war footing\" as they search for survivors. Video shows the dramatic moment the water barrelled through Dharali, about six miles from the popular tourist site Harsil. \"About a dozen hotels have been washed away and several shops have collapsed,\" said local official Prashant Arya. Villagers fear it could be worse - with up to a dozen people still under rubble and 20 to 25 hotels and homestays destroyed. India's national disaster management authority has requested three helicopters to help with rescue efforts in the mountainous terrain. Prime Minister Narendra Modi said on X that he had spoken to the chief minister and \"no stone is being left unturned in providing assistance to the people\". More heavy rain is forecast in the days ahead and local schools have been asked to stay shut. Brief, intense downpours known as cloudbursts are becoming more common in Uttarakhand, according to experts, who say it's partly down to climate change. Uttarakhand is in India's far north, bordering Nepal and China, and is already prone to flooding and landslides in monsoon season. Damage from such events has also become worse due to unplanned development. India isn't the only country experiencing intense storms this week.  Hong Kong issued another maximum \"black\" warning after heavier than usual monsoon rains caused flooding and landslides. More than 35cm (13.8 inches) had fallen by 2pm local time on Tuesday, according to city authorities, the highest daily amount for August since 1884. Read more form Sky News:Brazil's former president under house arrest Some travellers face up to $15,000 bond to enter US Video showed water gushing through the streets and partially submerged cars. Most schools and public services in the region have been closed. It's the fourth \"black\" alert in eight days - a new record. The storms have also affected the wider region, including Macau and Guangdong province, where five people died and more than 1,300 rescuers were deployed at the weekend."
    },
    {
        "title": "Some tourists and business travellers face up to $15,000 bond to enter US",
        "description": "The US government has proposed charging some visitors a bond of up to $15,000 to enter the country.",
        "url": "https://news.sky.com/story/some-tourists-and-business-travellers-face-up-to-15000-bond-to-enter-us-13407177",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-times-square-new-york_6983347.jpg?20250805125458",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-05 08:38:00",
        "Headline": "A 12-month pilot programme trialling a bond payment for visa applicants will start on 20 August, according to the State Department, and will see travellers from countries with high overstay rates charged bonds costing $5,000, $10,000, or $15,000.",
        "Content": "The US government has proposed charging some visitors a bond of up to $15,000 to enter the country. According to a document filed by the State Department and published in the Federal Register on Tuesday, a 12-month pilot programme trialling a bond payment for visa applicants will start on 20 August. The scheme, in effect for a year, will apply to business and tourist visa applicants from countries deemed to have high overstay rates and \"deficient\" internal document security controls. Bonds, which would be refunded as long as the visa terms are complied with, could cost applicants $5,000 (£3,763), $10,000 (£7,527), or $15,000 (£11,286). They will not apply to countries enrolled in the Visa Waiver Program, such as the UK - and could be waived for others depending on an applicant's individual circumstances. A State Department spokesperson told Reuters news agency, however, that the list of countries may be updated \"based on high overstay rates, screening and vetting deficiencies, concerns regarding acquisition of citizenship by investment without a residency requirement, and foreign policy considerations\". In the document, the State Department cited Department of Homeland Security data, which showed that in 2023, there were more than 500,000 \"suspected in-country overstays\" - where people remained in the US past the end of their visa terms. The US Travel Association, which represents major tourism-related companies, told Reuters the \"scope of the visa bond pilot program appears to be limited, with an estimated 2,000 applicants affected, most likely from only a few countries with relatively low travel volume\". It added the fee could hinder travel and that \"if implemented, the US will have one of, if not the highest, visitor visa fees in the world\". Read more from Sky News:Trump hails 'hottest' Sydney Sweeney advertSean 'Diddy' Combs denied bail again ahead of sentencing A similar pilot scheme was launched in November 2020 at the end of Donald Trump's first term in office, but was not fully implemented due to the fall in travel linked to the COVID pandemic.  The latest move comes after the president enacted a travel ban in June, impacting Afghanistan, Myanmar, Chad, the Democratic Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The White House said some countries had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees."
    },
    {
        "title": "Bill and Hillary Clinton subpoenaed in Jeffrey Epstein probe",
        "description": "The US House Oversight Committee has issued subpoenas for depositions with former president Bill Clinton and former secretary of state Hillary Clinton relating to the sex trafficking investigation into Jeffrey Epstein.",
        "url": "https://news.sky.com/story/bill-and-hillary-clinton-subpoenaed-in-jeffrey-epstein-probe-13407407",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bill-clinton-hillary-clinton_6983604.jpg?20250805182609",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-05 15:58:00",
        "Headline": "The Republican-controlled committee also subpoenaed the Justice Department for files relating to the paedophile financier, as well as eight former top law enforcement officials.",
        "Content": "The US House Oversight Committee has issued subpoenas for depositions with former president Bill Clinton and former secretary of state Hillary Clinton relating to the sex trafficking investigation into Jeffrey Epstein. The Republican-controlled committee also subpoenaed the Justice Department for files relating to the paedophile financier, as well as eight former top law enforcement officials. Donald Trump has denied prior knowledge of Epstein's crimes, claiming he ended their relationship a long time ago. The US president has repeatedly tried to draw a line under the Justice Department's decision not to release a full accounting of the investigation, but politicians from both major political parties, as well as many in Mr Trump's political base, have refused to drop their interest in the Epstein files. Epstein died in a New York jail cell in 2019 awaiting trial on sex trafficking charges, and since then, conspiracy theories have swirled about what information investigators gathered on him and who else may have been involved in his crimes. Republicans on the House Oversight Committee initiated the subpoenas for the Clintons last month, as well as demanding all communications between former president Joe Biden's Democrat administration and the Justice Department about Epstein. The committee previously issued a subpoena for an interview with Epstein's former girlfriend, Ghislaine Maxwell, who had been serving a prison sentence in Florida for luring teenage girls to be sexually abused by Epstein. She was recently transferred to another facility in Texas. Mr Clinton was among those acquainted with Epstein before the criminal investigation against him in Florida became public two decades ago. He has never been accused of wrongdoing by any of the women who say Epstein abused them. Mr Clinton previously said, through a spokesperson, that while he travelled on Epstein's jet, he never visited his homes and had no knowledge of his crimes. Read more:All we know about Trump and Epstein's 'friendship' US correspondent The subpoenaing of former president Bill Clinton is an escalation, both legally and politically. Historically, it is rare for congressional oversight to demand deposition from former presidents of the United States. Ghislaine Maxwell, Jeffrey Epstein's former girlfriend and accomplice, had already been summonsed. But the House Oversight Committee has now added Bill and Hillary Clinton, several former Attorneys General and former FBI directors to its list. It signals bipartisan momentum – Democrats voting with Republicans for transparency. The committee will now hear from several people with known ties to Epstein, his connection with Bill Clinton having been well-documented. But the subpoenas set up a potential clash between Congress and the Department of Justice. Donald Trump, the candidate, had vowed to release them. A government led by Mr Trump, the president, chose not to. If Attorney General Pam Bondi still refuses to release the files, it will fuel claims of a constitutional crisis in the United States. But another day of Epstein headlines demonstrates the enduring public interest in this case. The subpoenas give the Justice Department until 19 August to hand over the requested records. The committee is also asking the former officials to appear for depositions throughout August, September and October, concluding with Hillary Clinton on 9 October and Bill Clinton on 14 October. Although several former presidents, including Mr Trump, have been issued congressional subpoenas, none has ever appeared before members under compulsion. Last month, Mr Trump instructed Attorney General Pam Bondi to release information presented to the grand jury that indicted Maxwell for helping Epstein sexually abuse teenage girls."
    },
    {
        "title": "Child killer becomes first to be executed with defibrillator fitted",
        "description": "A triple-killer has become the first man to be executed with a working defibrillator implanted in his chest",
        "url": "https://news.sky.com/story/byron-black-becomes-first-man-executed-with-working-defibrillator-fitted-despite-claims-he-could-suffer-13407237",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-byron-black-death-row_6983242.jpg?20250805112137",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-05 10:12:00",
        "Headline": "Black's lawyer said the execution could become a \"grotesque spectacle\" and he could be experiencing pain even if he looked unresponsive.",
        "Content": "A triple-killer has become the first man to be executed with a working defibrillator implanted in his chest Byron Black, 69, was put to death in Tennessee without the defibrillator being deactivated. There were concerns the device would shock his heart when the lethal chemicals took effect. A bid to delay the execution was denied on Monday. Black died at 10.43am, prison officials said, about 10 minutes after the process began. Seven media witnesses said he appeared to be in discomfort. He looked around the room as the execution began and could be heard sighing and breathing heavily, the AP news agency reported. The Death Penalty Information Center, which provides data on such matters, said it was unaware of any similar cases. \n                  Edward Zakrzewski: Execution of man who killed his wife and children sets new state record\n                 \n                  Richard Gerald Jordan: Man who was on death row in Mississippi for almost 50 years executed\n                 \n                  Death row inmate in US executed using nitrogen gas after Supreme Court appeal fails\n                 Black's attorneys said they had not found a comparable case either. Black shot dead his girlfriend Angela Clay and her two daughters, aged six and nine, in a jealous rage in 1988. He committed the murders while on work release while serving time for shooting Clay's estranged husband. Linette Bell, whose sister and two nieces were killed, recently told local station WKRN-TV: \"He didn't have mercy on them, so why should we have mercy on him?\" There was uncertainty over whether the defibrillator would shock his heart, potentially prolonging his death and causing suffering. The 69-year-old was in a wheelchair and said to have dementia, kidney failure, brain damage and congestive heart failure. His cardioverter-defibrillator was a battery-powered device that delivered electric shocks to restore a regular heartbeat if needed. Black's lawyers said a doctor should have put a device over the implant to ensure it was switched off. In July, a judge agreed it was necessary to avert the chance of unnecessary pain. Last week, however, the state Supreme Court said the judge lacked authority to order the defibrillator to be deactivated. Lawyers representing Tennessee argued the lethal injection would not cause the device to shock Black and that he would not feel it even if it did. However, his lawyer, Kelley Henry, said the execution could become a \"grotesque spectacle\" and Black could still be in pain even if he looked unresponsive. Read more:Execution of man who killed wife and kids sets new recordMan on Death Row for almost 50 years executed Black's lawyers also tried unsuccessfully in recent years to save him from execution by arguing he was intellectually disabled and ineligible for the death penalty under US Supreme Court precedent. Twenty-eight men have been executed in the US so far this year - the highest since the 28 also killed in 2015. Nine other executions are scheduled before the end of 2025."
    },
    {
        "title": "Some tourists and business travellers face up to $15,000 bond to enter US",
        "description": "The US government has proposed charging some visitors a bond of up to $15,000 to enter the country.",
        "url": "https://news.sky.com/story/some-tourists-and-business-travellers-face-up-to-15000-bond-to-enter-us-13407177",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-times-square-new-york_6983347.jpg?20250805125458",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-05 08:38:00",
        "Headline": "A 12-month pilot programme trialling a bond payment for visa applicants will start on 20 August, according to the State Department, and will see travellers from countries with high overstay rates charged bonds costing $5,000, $10,000, or $15,000.",
        "Content": "The US government has proposed charging some visitors a bond of up to $15,000 to enter the country. According to a document filed by the State Department and published in the Federal Register on Tuesday, a 12-month pilot programme trialling a bond payment for visa applicants will start on 20 August. The scheme, in effect for a year, will apply to business and tourist visa applicants from countries deemed to have high overstay rates and \"deficient\" internal document security controls. Bonds, which would be refunded as long as the visa terms are complied with, could cost applicants $5,000 (£3,763), $10,000 (£7,527), or $15,000 (£11,286). They will not apply to countries enrolled in the Visa Waiver Program, such as the UK - and could be waived for others depending on an applicant's individual circumstances. A State Department spokesperson told Reuters news agency, however, that the list of countries may be updated \"based on high overstay rates, screening and vetting deficiencies, concerns regarding acquisition of citizenship by investment without a residency requirement, and foreign policy considerations\". In the document, the State Department cited Department of Homeland Security data, which showed that in 2023, there were more than 500,000 \"suspected in-country overstays\" - where people remained in the US past the end of their visa terms. The US Travel Association, which represents major tourism-related companies, told Reuters the \"scope of the visa bond pilot program appears to be limited, with an estimated 2,000 applicants affected, most likely from only a few countries with relatively low travel volume\". It added the fee could hinder travel and that \"if implemented, the US will have one of, if not the highest, visitor visa fees in the world\". Read more from Sky News:Trump hails 'hottest' Sydney Sweeney advertSean 'Diddy' Combs denied bail again ahead of sentencing A similar pilot scheme was launched in November 2020 at the end of Donald Trump's first term in office, but was not fully implemented due to the fall in travel linked to the COVID pandemic.  The latest move comes after the president enacted a travel ban in June, impacting Afghanistan, Myanmar, Chad, the Democratic Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The White House said some countries had a \"significant terrorist presence\" and accused others of poor screening for dangerous individuals and not accepting deportees."
    },
    {
        "title": "Texas Governor threatens Democrats with arrest after politicians flee to block redistricting vote",
        "description": "Texas's Republican governor has threatened to send troops to arrest Democrats who fled the state in a bid to block efforts to redraw its political map.",
        "url": "https://news.sky.com/story/texas-governor-threatens-democrats-with-arrest-after-politicians-flee-to-block-redistricting-vote-13407316",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-republican-republican-party_6983401.jpg?20250805141049",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-05 12:43:00",
        "Headline": "Sought by Donald Trump ahead of next year's mid-term elections, the proposed changes to Texas's congressional districts would make it more likely for Republicans to keep control of the state.",
        "Content": "Texas's Republican governor has threatened to send troops to arrest Democrats who fled the state in a bid to block efforts to redraw its political map. Greg Abbott also said he will start trying to remove the absent Democrats from office, and that the Texas Rangers have been directed to investigate them for possible breaches of bribery laws. The governor added in a statement that the Democrats \"abandoned their duty to Texans\" and that \"there are consequences for dereliction of duty\". However, state troopers have no jurisdiction outside of Texas, and the state's Democratic Party chair, Gene Wu, estimated on Sunday that about 57 Democrats had already left. Sought by Donald Trump ahead of next year's mid-term elections, the proposed changes to Texas's congressional districts would make it more likely for Republicans to retain control of the state's House of Representatives. The party currently holds 25 of Texas's 38 seats, but the new boundaries would hand Republicans an advantage in five seats. The GOP planned to hold a vote on the new district map on Monday during a special legislative session over the deadly Texas floods. \n                  Is this pop star the left's answer to Trump?\n                 \n                  New York City mayoral hopeful Brad Lander arrested by ICE agents\n                 \n                  Day 88: Can Trump win the deportation row?  \n                 As the minority party, and therefore unable to vote the plan down, dozens of Democratic representatives left the state to stop proceedings. Without the Democrats in attendance, the House does not have a quorum, meaning the minimum number of representatives necessary to conduct a vote. Gerrymandering means the manipulation of political mapmaking to give an advantage to a party. District maps must be redrawn every 10 years after each census to balance the population in districts, but in some states, there are no limits on how often districts can be redrawn. If a political party controls both the legislature and the governor's office - or has such a large majority that it can override vetoes - it can effectively draw districts to its advantage.\n Gerrymandering is not illegal under the US Constitution, and the Supreme Court previously ruled that federal courts have no authority to decide whether partisan gerrymandering goes too far. However, the Supreme Court has upheld challenges to gerrymandering on racial grounds in Alabama and Louisiana. 'Fulfil your duty,' says House speaker Texas Republicans also voted to issue arrest warrants for absent Democratic politicians. In the state House of Representatives on Monday, they compelled the sergeant-at-arms to \"send for\" their return \"under warrant of arrest, if necessary\". Republican House Speaker Dustin Burrows promised before the vote that \"all options will be on the table\". He added: \"To those who are absent, return now. Come back and fulfil your duty.\" Under Texas laws, a representative refusing to show up is a civil violation of legislative rules, and they can be fined $500 for every day they are not at the state Capitol. 'There's nothing illegal' about plans: Abbott In an interview with Fox News, Mr Abbott defended the redistricting plan - calling it gerrymandering - and said it was intended to better reflect voters who supported Mr Trump in the 2024 election. He said: \"Gerrymandering can be done, or drawing lines can be done on the basis of political makeup, as in Republicans versus Democrats. And there's nothing illegal about that.\" Most of the Texan Democrats went to Illinois, headed by Democrat Governor JB Pritzker, while others travelled to blue states New York and Massachusetts. At a press conference in Chicago on Monday, Mr Wu said: \"We're not here to play political games. \"We're here to demand an end to this corrupt process.\" California threatens counter-redrawing In response to the Texas proposal, California Governor Gavin Newsom has said he is considering gerrymandering his state's districts to slash five Republican seats. The Democrat governor said he would call a special election for the first week of November if Texas does not pause its own redistricting, and added: \"California will not sit by idly and watch this democracy waste away.\" Read more from Sky News:Trump hails 'hottest' Sydney Sweeney advertTrump says 'nobody has asked' him to pardon Ghislaine MaxwellTrump orders two nuclear subs to be moved closer to Russia Speaking anonymously, a Trump administration official told Sky's US partner network NBC News on Sunday that there were no plans to use federal agents to assist in arresting Democrats. \"Gov. Greg Abbott can handle his own state,\" the official said."
    },
    {
        "title": "Sean 'Diddy' Combs denied bail again ahead of sentencing",
        "description": "Sean \"Diddy\" Combs has been denied bail ahead of his sentencing on prostitution-related charges.",
        "url": "https://news.sky.com/story/sean-diddy-combs-denied-bail-again-ahead-of-sentencing-13407158",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-vanity-fair-party_6983157.jpg?20250805092243",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-05 07:54:00",
        "Headline": "Hip-hop mogul Sean 'Diddy' Combs, 55, has been in prison since his arrest in September last year, and will be sentenced in October.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs has been denied bail ahead of his sentencing on prostitution-related charges. Judge Arun Subramanian said the hip-hop mogul had failed to show sufficient evidence he is not a flight risk and also cited admissions of previous violence made during his trial. Combs, 55, has been in prison since his arrest in September last year. During a two-month trial, jurors heard allegations that he had coerced former girlfriends, including singer and model Cassie Ventura, into having drug-fuelled sex marathons with male sex workers, while he watched and filmed them. In July, he was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. The rapper's legal team hailed this a \"victory\" and immediately applied for bail ahead of sentencing, citing his acquittal on the top charges. After this was denied, they submitted another application last week. Judge Subramanian has now rejected the request again. In denying the motion for bail, the judge found Combs had failed to show sufficient evidence to counter arguments he is a flight risk, writing in a court filing: \"Increasing the amount of the bond or devising additional conditions doesn't change the calculus given the circumstances and heavy burden of proof that Combs bears.\" Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs He also found that an argument by the music star's legal team that the squalor and danger of the Metropolitan Detention Center (MDC), where he is being held, did not warrant release. \"The public outcry concerning these conditions has come from all corners,\" the judge wrote. \"But as Combs acknowledges, MDC staff has been able to keep him safe and attend to his needs, even during an incident of threatened violence from an inmate.\" As well as Combs's bail application, his legal team has also filed a motion calling for him to be acquitted or given a new trial on the prostitution-related charges only. The judge has not yet responded to this application.  How long could Diddy be jailed for? Combs is due to be sentenced on 3 October and could be sentenced to up to 20 years in prison. Discussions on sentencing guidelines which followed the jury's verdict suggest it is unlikely he will be jailed for this long, with an estimate of around two to five years, taking into account time already served. However, it is ultimately up to Judge Arun Subramanian to decide the rapper's punishment. On Friday, Donald Trump was asked during an interview about a potential pardon for Combs following speculation about the issue. The president said it was unlikely, adding that the rapper was \"very hostile\" during his presidential campaign. Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture - a Grammy-winning hip-hop artist and business entrepreneur, who presided over an empire ranging from fashion to reality TV. As well as the criminal conviction, he is also facing several civil lawsuits."
    },
    {
        "title": "Ozempic to Mounjaro - what are the weight loss injections and what were they designed to do?",
        "description": "Drugs designed to treat diabetes and repurposed as miracle diet aids have taken over TikTok - and Hollywood.",
        "url": "https://news.sky.com/story/ozempic-to-mounjaro-what-are-the-weight-loss-injections-and-what-were-they-designed-to-do-12823419",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-ozempic-drug_6007822.jpg?20221228141017",
        "type": "US",
        "Author": "Josephine Franks",
        "Date Published": "2025-08-05 11:45:00",
        "Headline": "As Sky News research revealed thousands of severely obese patients are facing severely delayed treatment, here we look at the wave of weight loss drugs and how they work. ",
        "Content": "\n          News reporter\n              @jos_franks\n Drugs designed to treat diabetes and repurposed as miracle diet aids have taken over TikTok - and Hollywood. The weight loss caused by these weekly injectables is rapid and previously unattainable, people boast, showing off newly svelte bodies. But what are these drugs, how do they work - and what were they originally designed to do? Ozempic, Wegovy, Mounjaro - what are they? Let's start with the most well-known of the trio: Ozempic. Ozempic blew up in 2022  - if media reports from the US were to be believed, every pound dropped in LA was probably thanks to the \"miracle\" injectable drug. What started as the preserve of A-listers and the Hollywood elite quickly grew in popularity. The drug's generic name is semaglutide. This is the same as Wegovy, which has been licensed as a weight loss drug in the UK and is now available on the NHS. Wegovy has a slightly higher dosage and is designed for weight loss, while Ozempic's primary purpose was as a diabetes treatment (more on that later). Mounjaro - also known by its generic name tirzepatide - is the newer kid on the block. Like Ozempic and Wegovy, it suppresses the appetite and lengthens the amount of time food stays in the stomach, leading to weight loss - at least for as long as you carry on taking it. In 2022, the US Food and Drink Administration (FDA) fast-tracked approval of the drug to treat obesity after a study showed it helped people lose more than 20% of their bodyweight. Mounjaro was supposed to be available through GP surgeries and other community services in the UK from 23 June. But at the start of August, Sky News research revealed only eight of 42 NHS Integrated Care Boards (ICBs) in England had started providing treatment to patients, and many of the rest unable to guarantee when it would be available.  From diabetes drug to diet pill Ozempic and Mounjaro were both developed as treatments for type 2 diabetes. The drugs, which come as weekly injections, lower blood sugar by increasing insulin production when your blood sugar is rising and helping prevent your liver making and releasing too much sugar. So how do they cause weight loss? Both semaglutide and tirzepatide work by mimicking the hormone, GLP-1 (glucagon-like peptide one), to manage hunger and slow down digestion. Tirzepatide - Mounjaro - is a dual-acting drug and also mimics the hormone GIP (glucose-dependent insulinotropic polypeptide). In terms of weight loss, in clinical trials people lost up to 20% of their body weight on tirzepatide and 15% on semaglutide. Researchers have also found the weight loss jabs could reduce the risk of heart attacks, strokes or heart failure in obese people regardless of the amount of weight they lose. They sound like miracle drugs for people wanting to lose weight - what's the catch? There are a few downsides. First off, the listed side effects: nausea, vomiting and diarrhoea, bad enough for about 5% of people in the semaglutide trial to stop taking it and 6-7% in the tirzepatide trial. People in the semaglutide trial also experienced problems with gallstones. The drugs also carry serious risks including kidney failure, pancreatitis and thyroid cancer. Another downside has been dubbed \"Ozempic face\". Facial ageing is a side effect of sudden weight loss as people find the skin on their face sagging where once it was plump. Read more:Weight loss drugs investigated over suicidal thoughtsNext wave of weight-loss jabs could be coming The drugs also only work for as long as you carry on taking them, and people have reported gaining back all the weight they lost after stopping the drug - either out of choice or because of a supply shortage. In August, the National Institute for Health and Care Excellence (NICE) - the body that provides guidance on the use of new drugs - said that people coming off the drugs should be offered \"structured advice and follow-up support\" to help prevent weight gain. This includes being monitored by the NHS for at least a year after completing treatment and support to help build \"long-term behavioural habits, use self-monitoring tools, and draw on wider support - from online communities to family-led interventions and local activities\". Shortages for diabetics Perhaps a bigger conversation than side effects for individuals is around the impact on people who rely on these treatments, now they've exploded in popularity as a weight loss quick-fix. While intended for diabetics, Ozempic and Mounjaro are prescribed \"off-label\" in the US to people wanting to shed weight. The drugs faced widespread shortage last year, with reports of diabetics having to drive from pharmacy to pharmacy in search of stock because of the high demand. Links to cancer prevention Research has suggested weight loss jabs, officially GLP-1 receptor agonists, could almost halve the risk of obesity-related cancers. The study, published in the journal eClinicalMedicine, was presented at the European Congress on Obesity in Malaga. It found that there were similar rates of obesity-related cancer among patients treated with the injections and those given weight loss, or bariatric, surgery. Dr Yael Wolff Sagy, the study's co-lead author from Clalit Health Services in Tel-Aviv, Israel, said a \"direct effect\" of the injections was that they were found \"to be 41% more effective at preventing obesity-related cancer\". \"We do not yet fully understand how GLP-1s work,\" she said. \"But this study adds to the growing evidence showing that weight loss alone cannot completely account for the metabolic, anti-cancer, and many other benefits that these medications provide.\" Co-lead Professor Dror Dicker, from Hasharon Hospital, Rabin Medical Centre in Israel, suggested the protective effects of the drugs \"likely arise from multiple mechanisms, including reducing inflammation\". He added further research was needed \"to make sure that these drugs do not increase the risk for non-obesity-related cancers\". Being overweight or obese is the second biggest cause of cancer in the UK, causing more than one in 20 cancer cases, according to the NHS. Are they available in the UK? An estimated 1.5 million people are taking weight loss jabs in the UK, the vast majority of whom pay for them privately. Ozempic is available in the UK for type 2 diabetes patients with a prescription. Wegovy and Mounjaro is available to NHS patients, but only through specialist weight management services. Over the next three years, around 240,000 people with the \"greatest need\" are expected to receive Mounjaro through the NHS. However, Sky News research into Wegovy and Mounjaro shows delays in the rollout of both weight loss jabs. Last October, there was a two-year waiting list for Wegovy, while Sky News' Thomas Moore has found that the current rollout of Mounjaro has been mismanaged and underfunded, leading to many people who are eligible to use the jabs unable to access it."
    },
    {
        "title": "Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'",
        "description": "Rachel Reeves will need to find more than &#163;40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned.",
        "url": "https://news.sky.com/story/chancellor-warned-substantial-tax-rises-needed-as-she-faces-impossible-trilemma-13407544",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6983775.jpg?20250805223306",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-05 21:23:00",
        "Headline": "Rachel Reeves and Keir Starmer have repeatedly ruled out raising taxes on \"working people\", fuelling speculation about how the government could boost tax receipts in other ways - including a potential wealth tax.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Rachel Reeves will need to find more than £40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned. The National Institute of Economic and Social Research (NIESR) said the government would miss its rule, which stipulates that day to day spending should be covered by tax receipts, by £41.2bn in the fiscal year 2029-30. Politics Hub: Follow latest updates In its latest UK economic outlook, NIESR said: \"This shortfall significantly increases the pressure on the chancellor to introduce substantial tax rises in the upcoming autumn budget if she hopes to remain compliant with her fiscal rules.\" The deteriorating fiscal picture was blamed on poor economic growth, higher than expected borrowing and a reversal in welfare cuts that could have saved the government £6.25bn. Together they have created an \"impossible trilemma\", NIESR said, with the chancellor simultaneously bound to her fiscal rules, spending commitments, and manifesto pledges that oppose tax hikes. Read more:What is a wealth tax?  Reeves told to consider replacing council tax The institute urged the government to build a larger fiscal buffer through moderate but sustained tax rises. \"This will help allay bond market fears about fiscal sustainability, which may in turn reduce borrowing costs,\" it said. \"It will also help to reduce policy uncertainty, which can hit both business and consumer confidence.\" It said that money could be raised by reforms to council tax bands or, in a more radical approach, by replacing the whole council tax system with a land value tax. To reduce spending pressures, NIESR called for a greater focus on reducing economic inactivity, which could bring down welfare spending.  Growth to remain sluggish The report was released against the backdrop of poor growth, with the chancellor struggling to ignite the economy after two months of declining GDP. The institute is forecasting modest economic growth of 1.3% in 2025 and 1.2% in 2026. That means Britain will rank mid-table among the G7 group of advanced economies. 'Things are not looking good' However, inflation is likely to remain persistent, with the consumer price index (CPI) likely to hit 3.5% in 2025 and around 3% by mid-2026. NIESR blamed sustained wage growth and higher government spending. It said the Bank of England would cut interest rates twice this year and again at the beginning of next year, taking the rate from 4.25% to 3.5%. Persistent inflation is also weighing on living standards: the poorest 10% of UK households saw their living standards fall by 1.3% in 2024-25 compared to the previous year, NIESR said. They are now 10% worse off than they were before the pandemic. Professor Stephen Millard, deputy director for macroeconomics at NIESR, said the government faced tough choices ahead: \"With growth at only 1.3% and inflation above target, things are not looking good for the chancellor, who will need to either raise taxes or reduce spending or both in the October budget.\""
    },
    {
        "title": "Ofwat chief Black to step down ahead of watchdog's abolition",
        "description": "The chief executive of Ofwat is to step down within months as Britain&#8217;s embattled water regulator prepares to be abolished by ministers.",
        "url": "https://news.sky.com/story/ofwat-chief-black-to-step-down-ahead-of-watchdogs-abolition-13407352",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/ab3d23842a6ec45f25ac6b1541845bffa2c4d41150f4dfcd052af6325f3d35b9_6648522.jpg?20240806081732",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-05 13:54:00",
        "Headline": "David Black is preparing to leave Britain’s under-fire water regulator, with an announcement expected just weeks after the government said it would be scrapped, Sky News learns",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executive of Ofwat is to step down within months as Britain’s embattled water regulator prepares to be abolished by ministers. Sky News has learnt that David Black is preparing to leave Ofwat following discussions with its board, led by chairman Iain Coucher. The timing of Mr Black's exit was unclear on Tuesday afternoon, although sources said he was likely to go in the near future. An official announcement could come within days, according to industry sources. Insiders say the relationship between Mr Coucher and Mr Black has been under strain for some time. Water industry executives said that Steve Reed, the environment secretary, repeatedly referred to the regulator's leadership during a meeting last month. It was unclear on Tuesday who would replace Mr Black, or whether an interim chief executive would remain in place until Ofwat is formally scrapped. \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Money blog: Waitrose and Asda react to latest 'cheapest supermarket' rankings - as Aldi knocked off top spot\n                 \n                  Former fund manager Woodford facing ban and £46m fine\n                 The complexity of the impending regulatory shake-up means that Ofwat might not be formally abolished until at least 2027. Mr Black took over as Ofwat's permanent boss in April 2022, having held the position on an interim basis for the previous 12 months. He has worked for the water regulator in various roles since 2012. If confirmed, Mr Black's departure will come with Britain's privatised water industry and its regulator mired in crisis. Water companies are under increasing pressure from Mr Reed, the environment secretary, over their award of executive bonuses even as the number of serious pollution incidents has soared. The UK's biggest water utility, Thames Water, meanwhile, is on the brink of being temporarily nationalised through a special administration regime as it tries to secure a private sector bailout led by its creditors. In a review published last month, the former Bank of England deputy governor Sir Jon Cunliffe recommended that Ofwat be scrapped. He urged the government to replace it with a new body which would also incorporate the Drinking Water Inspectorate and absorb the water-related functions of the Environment Agency and Natural England. Speaking on the day that Sir Jon's recommendations were made public, Mr Reed said: \"This Labour government will abolish Ofwat. \"Ofwat will remain in place during the transition to the new regulator, and I will ensure they provide the right leadership to oversee the current price review and investment plan during that time.\" A white paper on reforming the water industry is expected to be published in November with the aim of delivering a reset of the industry's performance and supervision, according to industry sources. A handful of water companies have challenged Ofwat's price determinations, which in aggregate outlined £104bn in spending by the industry during the 2026-30 regulatory period. Anglian Water, Northumbrian Water and Southern Water are among those whose spending plans are now being assessed by the Competition and Markets Authority. Responding to the Cunliffe report last month, Ofwat said: \"While we have been working hard to address problems in the water sector in recent years, this report sets out important findings for how economic regulation is delivered and we will develop and take this forward with government. \"Today marks an opportunity to reset the sector so it delivers better outcomes for customers and the environment. \"Ofwat will now work with the government and the other regulators to form this new regulatory body in England and to contribute to discussions on the options for Wales set out in the report. \"In advance of the creation of the new body, we will continue to work hard within our powers to protect customers and the environment and to discharge our responsibilities under the current regulatory framework.\" Ofwat has been contacted for comment about Mr Black's future, while the Department for Environment, Food and Rural Affairs (DEFRA) has also been approached for comment."
    },
    {
        "title": "Former fund manager Woodford facing ban and £46m fine",
        "description": "The City watchdog has provisionally banned former star fund manager Neil Woodford and fined him and his former fund company almost &#163;46m.",
        "url": "https://news.sky.com/story/former-fund-manager-woodford-facing-ban-and-16346m-fine-13407233",
        "image_url": "https://e3.365dm.com/21/02/1920x1080/1151e72190e7a15b82361d13edabe23a4554d8b991d5e84d56b99c8016117381_5276790.jpg?20210218132602",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-05 10:02:00",
        "Headline": "The FCA says \"unreasonable and inappropriate investment decisions\" were made before his flagship fund was wound down in 2019.",
        "Content": "The City watchdog has provisionally banned former star fund manager Neil Woodford and fined him and his former fund company almost £46m. The Financial Conduct Authority (FCA) said it planned to prevent Mr Woodford from holding senior manager roles and managing funds. The watchdog also aimed to fine him £5.89m and Woodford Investment Management (WIM) £40m related to its collapse in 2019. Money latest: Aldi 'loses cheapest supermarket title' Mr Woodford's flagship fund, Woodford Equity Income (WEI), was wound down after investors tried to withdraw cash faster than the fund could pay out, amid concerns over its high exposure to illiquid and unquoted shares. The FCA determined that Mr Woodford and the fund \"made unreasonable and inappropriate investment decisions\" between July 2018 and June 2019. The fund's sale of liquid assets and acquisition of illiquid ones meant WEI was unable to meet rules in place at the time, whereby investors should have been able to access their funds within four days. \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Ofwat chief Black to step down ahead of watchdog's abolition\n                 \n                  Money blog: Waitrose and Asda react to latest 'cheapest supermarket' rankings - as Aldi knocked off top spot\n                 \"WIM and Mr Woodford did not react appropriately as the fund's value declined, its liquidity worsened and more investors withdrew their money,\" the FCA said. \"The FCA has concluded that Mr Woodford held a defective and unreasonably narrow understanding of his responsibilities.\" Steve Smart, its joint executive director of enforcement and market oversight, added: \"Being a leader in financial services comes with responsibilities as well as profile. Mr Woodford simply doesn't accept he had any role in managing the liquidity of the fund. \"The very minimum investors should expect is those managing their money make sensible decisions and take their senior role seriously. \"Neither Neil Woodford nor Woodford Investment Management did so, putting at risk the money people had entrusted them with.\" Both Mr Woodford and WIM have referred the case to the Upper Tribunal for appeal. He was yet to comment. Mr Woodford was once considered the star stock picker of his generation. He launched his own investment business after building up a reputation for delivering stellar returns while at Invesco Perpetual. At its height in 2017, the Woodford Equity Income Fund had a value of over £10bn, but by the time of its suspension in June 2019, this had sunk to as low as £3.7bn. While a redress scheme enabled investors to get some cash back, around 300,000 people lost money through the fund's collapse."
    },
    {
        "title": "British Land hires lawyers to scrutinise retail rescue deals",
        "description": "British Land, the FTSE 250 commercial property company, has hired lawyers to scrutinise rescue deals for the high street retailers Poundland and River Island.",
        "url": "https://news.sky.com/story/british-land-hires-lawyers-to-scrutinise-retail-rescue-deals-13407242",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-poundland-river-island_6983232.jpg?20250805111627",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-05 10:25:00",
        "Headline": "The FTSE 250 property group is demanding further details of proposals to salvage Poundland and River Island, which have warned they face collapse within months, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n British Land, the FTSE 250 commercial property company, has hired lawyers to scrutinise rescue deals for the high street retailers Poundland and River Island. Sky News has learnt that Hogan Lovells, the City law firm, has been instructed by British Land to seek further information on restructuring plans that the two chains say are necessary for their survival. British Land owns 20 Poundland stores, 13 of which would see rents compromised under its restructuring plan, while it is River Island's landlord at 22 shops - seven of which would be affected. Money latest: Aldi 'loses cheapest supermarket title' Retail industry sources said that British Land had already struck deals to relet some of the affected Poundland sites. The company, which has a market capitalisation of £3.5bn and is one of Britain's biggest commercial landlords, is understood to have abstained on the River Island restructuring plan vote. The appointment of Hogan Lovells does not amount to a decision to formally challenge the restructurings, but that remains an option in both cases, according to industry sources. \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Ofwat chief Black to step down ahead of watchdog's abolition\n                 \n                  Money blog: Waitrose and Asda react to latest 'cheapest supermarket' rankings - as Aldi knocked off top spot\n                 Hogan Lovells has been engaged on a string of previous challenges to retailers' rescue deals on the basis that they unfairly compromised property-owners. About 20,000 jobs would potentially be put at risk if Poundland and River Island were to collapse altogether. Both face sanctions hearings in court this month which will determine whether their rescue deals can go ahead. Even if the proposals are rubber-stamped, about 100 stores in aggregate across the two chains will be permanently closed. British Land declined to comment."
    },
    {
        "title": "BP raises prospect of more job losses as AI drives efficiency",
        "description": "BP has signalled an accelerated effort to bring down costs ahead, refusing to rule out further job losses as artificial intelligence (AI) technology helps drive efficiencies.",
        "url": "https://news.sky.com/story/bp-raises-prospect-of-more-job-losses-as-ai-drives-efficiency-13407113",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bp-petrol-company_6801167.jpg?20250116113343",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-08-05 04:35:00",
        "Headline": "The company had only revealed in January that it was shedding thousands of staff as it pivots back towards core oil and gas operations.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n BP has signalled an accelerated effort to bring down costs ahead, refusing to rule out further job losses as artificial intelligence (AI) technology helps drive efficiencies. The company, which revealed in January that it was to axe almost 8,000 workers and contractors globally as part of a cost-cutting plan, said alongside its second quarter results that it was to review its portfolio of businesses and examine its cost base again. Money latest: Aldi 'loses cheapest supermarket title' BP is under pressure to grow profitability and investor value through a shareholder-driven refocus on oil and gas revenues. Just 24 hours earlier, the company revealed progress through its largest oil and gas discovery, off Brazil's east coast, this century. BP said it was exploring the creation of production facilities at the site. It has made nine other exploration discoveries this year. \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Ofwat chief Black to step down ahead of watchdog's abolition\n                 \n                  Money blog: Waitrose and Asda react to latest 'cheapest supermarket' rankings - as Aldi knocked off top spot\n                 BP's share price has lagged those of rivals for many years - a trend that investors have blamed on the now-abandoned shift to renewable energy that began under former boss Bernard Looney. His replacement, Murray Auchincloss, has reportedly come under shareholder pressure to slash costs further, with the Financial Times reporting on Monday that activist investor Elliott was leading that charge based on concerns over high contractor numbers. Mr Auchincloss said on Tuesday that AI was playing a leading role in bolstering efficiency across the business. In an interview with Sky's US partner CNBC, he said: \"We need to keep driving safely to be the very best in the sector we can be, and that's why we're focused on another review to try to drive us towards best in class... inside the sector, and technology plays a huge part in that. \"Just technology is moving so fast, we see tremendous opportunity in that space. So it's good for all seasons to drive cost discipline and capital discipline into the business. And that's what we're focused on.\" When contacted by Sky News, a BP spokesperson suggested the company had no plans for further job losses this year and could not speculate beyond that ahead of the conclusions of the new cost review. BP reported a second quarter underlying replacement cost profit of $2.4bn, down 14% on the same period last year but well ahead of analyst forecasts of $1.8bn. Much of the reduction was down to lower comparable oil and gas prices. It moved to reward investors with a 4% dividend increase and maintained the pace of its share buyback programme at $750m for the quarter. BP said it was making progress in driving shareholder value through both its operational return to oil and gas investment and cost reductions, which stood at $1.7bn over the six months. Shares, up 3% over the year to date ahead of Tuesday's open, were trading 2% higher in early dealing. Derren Nathan, head of equity research at Hargreaves Lansdown, said of the company's figures: \"Production increases, strong results from trading activities, favourable tax rates, and better volumes and margins downstream all played their part. \"It's also upping the ante when it comes to exploration and development, culminating in this week's announcement of an oil find at the offshore Brazilian prospect Bumerangue. \"Its drilling rig intersected a staggering 500m of hydrocarbons. Taking into account the acreage of the block, it's given BP the confidence to declare the largest discovery in 25 years.\""
    },
    {
        "title": "Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'",
        "description": "Rachel Reeves will need to find more than &#163;40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned.",
        "url": "https://news.sky.com/story/chancellor-warned-substantial-tax-rises-needed-as-she-faces-impossible-trilemma-13407544",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6983775.jpg?20250805223306",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-05 21:23:00",
        "Headline": "Rachel Reeves and Keir Starmer have repeatedly ruled out raising taxes on \"working people\", fuelling speculation about how the government could boost tax receipts in other ways - including a potential wealth tax.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Rachel Reeves will need to find more than £40bn of tax rises or spending cuts in the autumn budget to meet her fiscal rules, a leading research institute has warned. The National Institute of Economic and Social Research (NIESR) said the government would miss its rule, which stipulates that day to day spending should be covered by tax receipts, by £41.2bn in the fiscal year 2029-30. Politics Hub: Follow latest updates In its latest UK economic outlook, NIESR said: \"This shortfall significantly increases the pressure on the chancellor to introduce substantial tax rises in the upcoming autumn budget if she hopes to remain compliant with her fiscal rules.\" The deteriorating fiscal picture was blamed on poor economic growth, higher than expected borrowing and a reversal in welfare cuts that could have saved the government £6.25bn. Together they have created an \"impossible trilemma\", NIESR said, with the chancellor simultaneously bound to her fiscal rules, spending commitments, and manifesto pledges that oppose tax hikes. Read more:What is a wealth tax?  Reeves told to consider replacing council tax The institute urged the government to build a larger fiscal buffer through moderate but sustained tax rises. \"This will help allay bond market fears about fiscal sustainability, which may in turn reduce borrowing costs,\" it said. \"It will also help to reduce policy uncertainty, which can hit both business and consumer confidence.\" It said that money could be raised by reforms to council tax bands or, in a more radical approach, by replacing the whole council tax system with a land value tax. To reduce spending pressures, NIESR called for a greater focus on reducing economic inactivity, which could bring down welfare spending.  Growth to remain sluggish The report was released against the backdrop of poor growth, with the chancellor struggling to ignite the economy after two months of declining GDP. The institute is forecasting modest economic growth of 1.3% in 2025 and 1.2% in 2026. That means Britain will rank mid-table among the G7 group of advanced economies. 'Things are not looking good' However, inflation is likely to remain persistent, with the consumer price index (CPI) likely to hit 3.5% in 2025 and around 3% by mid-2026. NIESR blamed sustained wage growth and higher government spending. It said the Bank of England would cut interest rates twice this year and again at the beginning of next year, taking the rate from 4.25% to 3.5%. Persistent inflation is also weighing on living standards: the poorest 10% of UK households saw their living standards fall by 1.3% in 2024-25 compared to the previous year, NIESR said. They are now 10% worse off than they were before the pandemic. Professor Stephen Millard, deputy director for macroeconomics at NIESR, said the government faced tough choices ahead: \"With growth at only 1.3% and inflation above target, things are not looking good for the chancellor, who will need to either raise taxes or reduce spending or both in the October budget.\""
    },
    {
        "title": "Delay biometric visa checks for 80 Gaza students, dozens of MPs urge UK government",
        "description": "More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal.",
        "url": "https://news.sky.com/story/delay-biometric-visa-checks-for-80-gaza-students-dozens-of-mps-urge-uk-government-13407459",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-gaza-strip-palestinians_6983690.jpg?20250805201006",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-08-05 17:55:00",
        "Headline": "Barry Gardiner MP says educating students from Gaza is about \"giving the state of Palestine the possibility of a future\". But Chris Philp MP says biometric checks before arrival are \"essential\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n More than 70 MPs have signed a letter asking the government to delay biometric checks for 80 students from Gaza so they can study in Britain, Sky News can reveal. Labour MPs Abtisam Mohamed and Barry Gardiner are leading the charge, asking Home Secretary Yvette Cooper to defer the requirement, so the students can take up their university places in September. However, shadow home secretary Chris Philp says the biometric checks should not be deferred, arguing they are \"an essential part of our security arrangements\". Gaza latest: Netanyahu mulls 'full Gaza takeover' In order to obtain a UK visa, applicants must provide a photo of their face, as well as their fingerprints. The Home Office guidance says these data points \"play a significant role in delivering security and facilitation in the border and immigration system\". UK visa process for Gazans 'all but impossible' In the letter, the MPs raise the case of Haia Mohamed, who they describe as a \"young poet in Gaza\", who has won a scholarship to Goldsmiths College in London. \n                  Kemi Badenoch says she no longer identifies as Nigerian\n                 \n                  James Cleverly says leaving ECHR is 'not silver bullet' - and leaves door open for leadership bid\n                 \n                  Former Tory MP handed community order for harassing ex-wife\n                 But neither she nor 79 other successful applicants to UK universities are able to travel to the UK because providing the required biometric data is \"all but impossible\". They write: \"Even before the war, leaving Gaza to pursue higher education was a complex process. The ongoing siege and restrictions made travel extremely difficult, but in the current state of constant bombardment, shootings at aid sites, and an IPC-declared famine, this process has become all but impossible.\" In an email to MPs asking them to sign the letter, Ms Mohamed and Mr Gardiner are far more blunt, saying: \"Unless the government makes rapid progress with offering visas and coordinating evacuations over the next week, students who should be starting university next month in the UK will be among those who are being shot dead at aid sites, bombed in displacement camps, or starving as famine spreads deeper in Gaza.\" The UK did have an authorised centre in Gaza that was able to process biometric data, but it was closed in October 2023 after the 7 October Hamas attack, and as Israel's war in response to the atrocity got under way, according to The Guardian. As result, they are asking the home secretary to \"defer biometric data screening for student visa applicants based in Gaza and open a safe passage to enable these young people to fulfil their academic dreams\", pointing out that other countries in Europe \"have taken proactive steps to ensure safe evacuation routes for students bound for their countries\".  Students are 'the future of Palestine' Speaking to Sky News on Tuesday, one of the writers of the letter, Barry Gardiner MP, pointed out that the government has been able to find a way for injured children from Gaza to receive care in the UK, and exemptions have been made in the past, and so the same should be done in this case, and \"quickly\" because the academic year starts next month. The Brent West MP also said that this is about \"giving the state of Palestine the possibility of a future\".  \"These young people are the future of Palestine. They are the young talent, and it doesn't matter whether they're constructing a road network, or a sewage system, or they're town planners or, as in the case of Haia Mohamed, astonishingly profound poets - the state of Palestine will need everything from classical musicians right the way through to town planners,\" he said. \"And these youngsters are coming over here with that full range of study potential, with the express intention of going back and building their nation.\" He added that the fact they have been able to win scholarships to, in many cases, the UK's top universities \"shows extraordinary resilience, extraordinary courage, extraordinary ability, and we should facilitate that\".  Checks 'essential part of security arrangements' But Conservative MP and shadow home secretary Chris Philp told Sky News in a statement: \"We should not be deferring biometric checks. These are an essential part of our security arrangements, and they should not be waived or delayed until arrival in the UK - by which time it is too late.\" Mr Gardiner later said biometric checks could still be carried out in another country, such as Jordan. Earlier this month, a student from Gaza reportedly left France after being ordered to leave following the discovery of alleged antisemitic social media posts. Her lawyer said she \"firmly denies the accusations made against her\", according to France24. Mr Gardiner told Sky News: \"Anyone who breaks the law in that way must be dealt with as the law requires. But what you don't do is you don't say, 'somebody might break the law, so we're not going to allow anybody to come'.\" Read more:More children from Gaza to be brought to UK for medical treatmentNetanyahu to instruct Israeli military on next steps in GazaAnalysis: Full Israeli occupation of Gaza could massively backfire The UK requires that biometric data be submitted in advance of the visa being approved in order to: • Establish a person's identity by joining the applicant's biographical data with their biometric data;• Verify an individual \"accurately against an established identity\";• Check they are not on a watchlist, for example, to ensure they are eligible to come to the UK. Exemptions from the requirement to provide biometric data have been given in rare circumstances. It was waived for Ukrainians fleeing to the UK following Russia's invasion in January 2022. However, it was not waived for Afghans fleeing the Taliban in August 2021. But a judge later ruled that a family in hiding in the country did not have to provide the data in order to join British family members in the UK, which was thought to also apply to around 100 other families. The Home Office and Foreign Office have been contacted for comment."
    },
    {
        "title": "Police should be 'more transparent' over suspects, says home secretary ",
        "description": "Police should reveal the ethnicity and immigration status of criminal suspects, Yvette Cooper has said.",
        "url": "https://news.sky.com/story/police-should-be-more-transparent-over-suspects-says-home-secretary-13407248",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-home-secretary-yvette-cooper_6983493.jpg?20250805161518",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-05 10:37:00",
        "Headline": "Yvette Cooper said she wants guidance to change so police can routinely reveal a suspect's ethnicity and immigration status.",
        "Content": " Police should reveal the ethnicity and immigration status of criminal suspects, Yvette Cooper has said. The home secretary told Sky News there needs to be \"greater transparency\" about people arrested and charged, with the Law Commission conducting a review of guidance in this area. Politics Live: Migrant detentions will begin 'in a matter of days', says Cooper The issue has been the subject of debate in a series of high-profile cases, including recently over the charging of two men - reported to be Afghan asylum seekers - over the alleged rape of a 12-year-old girl in Nuneaton. The suspects' ethnicities have not been confirmed. Asked if she thought police should routinely reveal this detail, as Reform UK leader Nigel Farage has called for, Ms Cooper said: \"We want more information, more transparency, and more information to be provided. \"We've said this for some time, and it's why we asked the Law Commission to accelerate their review into the issues around contempt of court, because that's about what information can be released once there are legal proceedings underway, once there's a trial process under way.\" \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Delay biometric visa checks for 80 Gaza students, dozens of MPs urge UK government\n                 \n                  Nigel Farage dared me to walk in London after 9pm: Here's my response\n                 Contempt of Court rules restrict the information that police can put out on the basis that it could prejudice a suspect's right to a fair trial. Speaking later to BBC Radio Four, Ms Cooper said that while it is an operational decision for police and the Crown Prosecution Service (CPS) to decide what information to reveal in individual cases, \"we do think that the guidance needs to change\". Mr Farage has argued that retaining details on ethnicity and immigration status helps fuel unrest, as seen in the riots last summer after the Southport stabbings, when false rumours spread online that killer Axel Rudakubana was a Muslim asylum seeker. \"What caused unrest on our streets after Southport last year was us not being told the status of the attacker. That led to crazy conspiracy theories spreading online,\" the Clacton MP said at a news conference on Monday. Referring to the alleged rape in Nuneaton, Mr Farage said police should \"spell out the basic and sober facts\", calling the lack of detail about the suspects' ethnicity \"a cover-up that in many ways is reminiscent of what happened after the Southport killings\". Read more from Sky News:UK-France migrant returns deal comes into forceFarage dared me to walk in London after 9pm: Here's my response The force has defended its decision not to release further details of the suspects, saying that once someone is charged with an offence they follow national guidance, which \"does not include sharing ethnicity or immigration status\". Asked about the case on Monday, the prime minister's official spokesman said the police and courts were operationally independent but \"we should always be as transparent as possible when it comes to cases\". A College of Policing spokesman said: \"Media relations guidance for police is already under review and is looking at how forces can best balance their obligations under contempt of court legislation with their responsibility to prevent disorder. \"Police forces make challenging and complex decisions on a case-by-case basis and transparency is essential to prevent misinformation and reassure the public.\""
    },
    {
        "title": "The chilling document that traces nuclear weapons back to Britain - and the threat we now face",
        "description": "Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima.",
        "url": "https://news.sky.com/story/fragmented-and-febrile-is-threat-of-nuclear-war-worse-than-ever-13407307",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-clarke-nuclear_6983517.jpg?20250805164454",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-05 12:29:00",
        "Headline": "Nuclear weapons have not been used in warfare since the atomic bombings of Hiroshima and Nagasaki 80 years ago this week. However, experts warn today's conflicts put the world in a precarious state.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eighty years ago today, an American B-29 bomber dropped an atomic bomb on the Japanese city of Hiroshima. It was the dawn of the atomic age, but the birth of the bomb can be traced beyond the deserts of New Mexico to Britain, five years earlier. A copy of a hand-typed document, now in the Bodleian library in Oxford, is the first description of an atom bomb small enough to use as a weapon. The Frisch-Peierls Memorandum was written by two nuclear physicists at the University of Birmingham in 1940. Otto Frisch and Rudolf Peierls don't feature in the film Oppenheimer, but their paper is credited with jump-starting the Manhattan Project that ultimately built the bomb. Both Jewish scientists who had both fled Nazi Germany, they built on the latest understanding of uranium fission and nuclear chain reactions, to propose a bomb made from enriched uranium that was compact enough to be carried by an aircraft. The document, so secret at the time only one copy was made, makes for chilling reading. Not only does it detail how to build a bomb, but foretells the previously unimaginable power of its blast. \"Such an explosion would destroy life in a wide area,\" they wrote. \"The size of this area is difficult to estimate, but it will probably cover the centre of a big city.\" Radioactive fallout would be inevitable \"and even for days after the explosion any person entering the affected area will be killed\". Both lethal properties of the bombs that would subsequently fall on Hiroshima and Nagasaki, killing around 100,000 instantly and more than 100,000 others in the years that followed - most of them civilians. Read more:Hiroshima survivor's stark warningThe 'destroyer of worlds' who built the atomic bomb 'The most terrifying weapons ever created' Those bombs had the explosive power of around 16 and 20 kilotonnes of TNT respectively - a force great enough to end the Second World War. But compared to nuclear weapons of today, they were tiny. \"What we would now term as low yield nuclear weapons,\" said Alexandra Bell, president of the Bulletin of Atomic Scientists, which campaigns for nuclear disarmament. \"We're talking about city destroyers…these really are the most terrifying weapons ever created.\" Many of these \"high yield\" nuclear weapons are thermonuclear designs first tested in the 1950s. They use the power of nuclear fission that destroyed Hiroshima to harness yet more energy by fusing other atoms together. Codenamed \"Mike\", the first test of a fusion bomb in 1952 yielded at least 500 times more energy than those dropped on Japan. Impractically devastating, but proof of lethal principle. Variants of the W76 thermonuclear warhead currently deployed by the US and UK are around 100Kt, six times more powerful than the Hiroshima bomb. Just one dropped on a city the size of London would result in more than a quarter of a million deaths. The largest warhead in America's current arsenal, the B83 has the explosive equivalent of 1.2 megatonnes (1.2 million tonnes of TNT) and would kill well over a million instantly. But modern intercontinental ballistic missiles (ICBMs) are designed to carry multiple warheads. Russia's Sarmat 2, for example, is thought to be capable of carrying 10 megatonnes of nuclear payload. They're designed to strike multiple targets at once, but if all were dropped on a city like London most of its population of nine million would be killed or injured. If that kind of power is incomprehensible, consider how many nuclear warheads there now are in the world. Nine countries - the US, Russia, China, France, the UK, India, Pakistan, North Korea and Israel - have nuclear weapons. Several others are interested in having them. The US and Russia have around 4,000 nuclear warheads each - 90% of the global nuclear arsenal and more than enough to destroy civilisation. According to analysis from the Stockholm International Peace Research Institute, China us thought to have around 600 warheads, but has indicated a desire to catch up. Beijing is believed to be building up to 100 new warheads a year and the ICBMs to deliver them. Five more nuclear powers, including the UK, plan to either increase or modernise their existing nuclear stockpiles. The nuclear arms race that created this situation was one imagined by Frisch and Peierls in their 1940 memorandum. Given the mass civilian casualties it would inevitably cause, the scientists questioned whether the bomb should ever be used by the Allies. They wrote, however: \"If one works on the assumption that Germany is, or will be, in the possession of this weapon… the most effective reply would be a counter-threat with a similar bomb.\" What they didn't believe was that the bomb they proposed, and went on to help build at Los Alamos, would ever be used. Devastated by its use on Japan, Peierls disavowed the bomb and later campaigned for disarmament. But that work is now as unfinished as ever. Non-proliferation treaties helped reduce the expensive and excessive nuclear arsenals of Russia and the US, and prevent more countries from building nuclear bombs. 'Everything trending in the wrong direction' But progress ground to a halt with the invasion of Ukraine, as nuclear tensions continued elsewhere. \"After all the extremely hard, tedious work that we did to reduce nuclear risks everything is now trending in the wrong direction,\" said Alexandra Bell. \"The US and Russia refuse to talk to each other about strategic stability. \"China is building up its nuclear arsenal in an unprecedented fashion and the structures that were keeping non-proliferation in place stemming the spread of nuclear weapons are crumbling around us.\" 'New risks increasing the threat' The world may have come closer to nuclear conflict during the Cuban missile crisis of 1963, but the fragmented and febrile state of geopolitics now is more dangerous, she argues. Conflict regularly flares between nuclear armed India and Pakistan; Donald Trump's foreign policy has sparked fears that South Korea might pursue the bomb to counter North Korea's nuclear threat; some states in the Middle East are eyeing a nuclear deterrent to either nuclear-wannabe Iran or nuclear armed Israel. Add to the mix the military use of AI and stressors like climate change, and the view of the Bulletin of Atomic Scientists is the situation is more precarious than in 1963. \"It's more dangerous, but in a different way,\" said Alexandra Bell. \"The confluence of all these new existential risks are increasing the threat worldwide.\""
    },
    {
        "title": "Police investigating grooming gangs given AI tools to speed up cold case work",
        "description": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations.",
        "url": "https://news.sky.com/story/police-investigating-grooming-gangs-given-ai-tools-to-speed-up-cold-case-work-13407547",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anonymous-teenager_6983780.jpg?20250805225703",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-05 21:26:00",
        "Headline": "The technology translates large amounts of text in foreign languages and analyses a mass of data to find patterns and relationships between suspects.",
        "Content": "All police forces investigating grooming gangs in England and Wales will be given access to new AI tools to help speed up their investigations. The artificial intelligence tools are already thought to have saved officers in 13 forces more than £20m and 16,000 hours of investigation time. The apps can translate large amounts of text in foreign languages from mobile phones seized by police, and analyse a mass of digital data to find patterns and relationships between suspects.  'We must punish perpetrators' The rollout is part of a £426,000 boost for the Tackling Organised Exploitation (TOEX) programme, which supports officers to investigate complex cases involving modern slavery, county lines and child sex abuse. The increased access to the AI technology follows Baroness Casey's recommendation for a national operation to review cold grooming gang cases. That operation will review more than 1,200 closed cases of child sexual exploitation. \"The sexual exploitation of children by grooming gangs is one of the most horrific crimes, and we must punish perpetrators, provide justice for victims and survivors, and protect today's children from harm,\" said safeguarding minister Jess Phillips. \"Baroness Casey flagged the need to upgrade police information systems to improve investigations and safeguard children at risk. Today we are investing in these critical tools.\" Read more from Sky News:Harry criticises report into charityReeves told to find 'substantial' tax rises  Lack of ethnicity data 'a major failing' Police forces have also been instructed by the home secretary to collect ethnicity data, as recommended by Baroness Casey. Her June report found the lack of data showing sex offenders' ethnicity and nationality in grooming gangs was \"a major failing over the last decade or more\". She found that officials avoided the issue of ethnicity for fear of being called racist, but there were enough convictions of Asian men \"to have warranted closer examination\". The government has launched a national inquiry into the abuse and further details are expected to be announced in the coming weeks."
    },
    {
        "title": "Mystery of what killed billions of starfish solved, say scientists",
        "description": "More than a decade after a mysterious killer devastated sea star populations along the Pacific coast of North America, scientists believe they have finally found the culprit.",
        "url": "https://news.sky.com/story/mystery-of-what-killed-billions-of-starfish-solved-say-scientists-13407178",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sea-star-starfish_6983198.jpg?20250805102208",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-08-05 08:41:00",
        "Headline": "Something had been infecting sea stars with a wasting disease that reduced the usually colourful, multi-armed creature to goo.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n More than a decade after a mysterious killer devastated sea star populations along the Pacific coast of North America, scientists believe they have finally found the culprit. The mass die-off, which began in 2013, wiped out an estimated five billion sea stars from Mexico to Alaska, and continues to affect over 20 species. \"It's really quite gruesome,\" said Alyssa Gehman, marine disease ecologist at the Hakai Institute in British Columbia, Canada, who helped identify the cause. She said healthy sea stars - also known as starfish - have \"puffy arms sticking straight out\". But the wasting disease that set in more than a decade ago caused them to grow lesions and \"then their arms actually fall off\". Worst hit was the sunflower sea star species, which lost around 90% of its population in the outbreak's first five years. After following numerous wrong turns and red herrings, scientists are now confident the killer was a bacterium that also infected shellfish. The breakthrough, published in the journal Nature Ecology and Evolution, solves \"a long-standing question about a very serious disease in the ocean,\" said Rebecca Vega Thurber, a marine microbiologist at the University of California, Santa Barbara, who was not involved in the study. Previous efforts missed the real killer because they focused on the wrong type of virus or investigated samples of dead sea stars which no longer contained the bodily fluid that surrounds the organs. But the latest study involved careful analysis of this so-called coelomic fluid, and found the pathogenic bacteria Vibrio pectenicida.  The death of sea stars triggered a cascade of effects through coastal ecosystems. Without predators like sunflower sea stars, which eat almost everything on the seabed, sea urchin populations exploded. In Northern California, this has led to the destruction of roughly 95% of kelp forests over the past decade - important underwater habitats often described as the \"rainforests of the ocean\". Calum Duncan, head of policy & advocacy at the Marine Conservation Society in the UK, said the overgrazing of kelp by sea urchins \"underlines the delicate balance of the ecosystem\". \"The ocean is our biggest ally in tackling the climate crisis, and we should be doing all we can to boost marine ecosystem health.\" Scientists hope their discovery could help with work to save sea stars. Researchers are investigating whether to relocate the animals, or breed them in captivity to later transport them to areas that have lost most of the population. They can also test whether treatments like probiotics could boost immunity to the disease. Governments are this week meeting in Geneva to negotiate a global plastics treaty to stop plastics from disrupting marine life, fishing and tourism. The UK government has called for a \"bold and ambitious global agreement\" to end plastic pollution by 2040. Marine minister Emma Hardy said: \"The UK is continuing to play a leading role in pushing for an effective treaty that ensures the sustainable consumption and production of plastics, tackles problematic plastic products, and paves the way to a circular economy.\""
    },
    {
        "title": "Postcode lottery for Mounjaro, the 'King Kong' of weight loss jabs, with only eight NHS care boards providing treatment",
        "description": "Thousands of severely obese patients are facing severely delayed treatment with what's been called the 'King Kong' of weight loss jabs - because the NHS rollout has been mismanaged and underfunded, according to Sky News research.",
        "url": "https://news.sky.com/story/postcode-lottery-for-mounjaro-the-king-kong-of-weight-loss-jabs-with-only-eight-nhs-care-boards-providing-treatment-13407142",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-05 06:57:00",
        "Headline": "Freedom of Information requests by Sky News reveal only eight of 42 NHS Integrated Care Boards in England were providing the weight loss treatment to patients, and many of the rest were unable to guarantee when it would be available.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Thousands of severely obese patients are facing severely delayed treatment with what's been called the 'King Kong' of weight loss jabs - because the NHS rollout has been mismanaged and underfunded, according to Sky News research. Mounjaro was supposed to be available through GP surgeries and other community services from 23 June under an agreement between NHS England and the National Institute for Health and Care Excellence (NICE), the body that provides guidance on the use of new drugs. But Freedom of Information requests by Sky News reveal a postcode lottery, with only eight of 42 NHS Integrated Care Boards (ICBs) in England telling us they were providing treatment to patients, and many of the rest unable to guarantee when it would be available. The research also shows that at least 19 had a cap on how many eligible patients they would treat in the first year. Dr Jonathan Hazlehurst, an obesity specialist at University Hospitals Birmingham, said many patients were desperate for treatment - and Mounjaro may be a hopeful aid for those eligible. \"Giving people open promises and setting them up for disappointment and failure is clearly grossly unfair,\" he said. \"That's what the current system is doing.\" NICE said in December that the NHS should offer Mounjaro to patients with a BMI over 40 and at least four clinical conditions related to their weight, such as heart disease or type 2 diabetes. It calculated from NHS England data that there were 97,500 patients who should be treated in the first year. But Dr Hazelhurst says NHS England has only provided funding for just over 22,000 patients. Read more:Weight loss and diabetes jabs linked to potentially fatal side effectOzempic to Wegovy - what are the weight loss injections?  \"It shows that there's a lack of political will to fund this adequately,\" he said. \"NHS England says that obesity costs the NHS £11.4bn per annum as a pure NHS cost. \"Yet we can't even afford to properly fund the rollout of a life-changing drug in year one. That just doesn't make any sense.\" Gary - who doesn't want his surname used - weighs 25 stone (158kg) and becomes severely out of breath after climbing only a few stairs. He is eligible for treatment with Mounjaro under the agreed NHS guidelines. But his surgery said \"no\" and told him it would be at least the autumn before the drug would be available in the Hampshire area. \"They said to us that September would be the earliest they going to look at it and then the criteria might change, so there's no knowing if I'm going to get it,\" he said. \"I was so excited when I read about this drug. If I had the drug and lost some weight, it could help me move around, it could help me go fishing again, all kinds of things. \"It's not for vanity. It would be a life changer.\" There are 3.4 million people in England who would qualify for treatment under the NICE eligibility criteria. But NHS England has said it will take 12 years to assess and prescribe to those who need it. Dr Hazlehurst said there would never be such a slow rollout with a new cancer treatment - and yet, obesity also kills. \"There's a huge amount of stigma that drives things to do with obesity care all across the system,\" he said. \"The 'eat less, move more' nonsense doesn't help. \"That is a really unhelpful, harmful and stigmatising approach, particularly in an age of effective treatment.\" Read more from Thomas Moore:Octopus boom off UK coast down to 'perfect storm'Plastics industry and powerful nations battle heats upScientists are on the hunt for dolphin poo A spokesperson for NHS England said it had \"fully supported the rollout\" of Mounjaro. They said: \"We issued guidance and provided funding in March to all Integrated Care Boards to support treatment costs, enable scaling of services and provide wrap-around care, including digital support services.\""
    },
    {
        "title": "BP raises prospect of more job losses as AI drives efficiency",
        "description": "BP has signalled an accelerated effort to bring down costs ahead, refusing to rule out further job losses as artificial intelligence (AI) technology helps drive efficiencies.",
        "url": "https://news.sky.com/story/bp-raises-prospect-of-more-job-losses-as-ai-drives-efficiency-13407113",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bp-petrol-company_6801167.jpg?20250116113343",
        "type": "Technology",
        "Author": "James Sillars",
        "Date Published": "2025-08-05 04:35:00",
        "Headline": "The company had only revealed in January that it was shedding thousands of staff as it pivots back towards core oil and gas operations.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n BP has signalled an accelerated effort to bring down costs ahead, refusing to rule out further job losses as artificial intelligence (AI) technology helps drive efficiencies. The company, which revealed in January that it was to axe almost 8,000 workers and contractors globally as part of a cost-cutting plan, said alongside its second quarter results that it was to review its portfolio of businesses and examine its cost base again. Money latest: Aldi 'loses cheapest supermarket title' BP is under pressure to grow profitability and investor value through a shareholder-driven refocus on oil and gas revenues. Just 24 hours earlier, the company revealed progress through its largest oil and gas discovery, off Brazil's east coast, this century. BP said it was exploring the creation of production facilities at the site. It has made nine other exploration discoveries this year. \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 \n                  Ofwat chief Black to step down ahead of watchdog's abolition\n                 \n                  Money blog: Waitrose and Asda react to latest 'cheapest supermarket' rankings - as Aldi knocked off top spot\n                 BP's share price has lagged those of rivals for many years - a trend that investors have blamed on the now-abandoned shift to renewable energy that began under former boss Bernard Looney. His replacement, Murray Auchincloss, has reportedly come under shareholder pressure to slash costs further, with the Financial Times reporting on Monday that activist investor Elliott was leading that charge based on concerns over high contractor numbers. Mr Auchincloss said on Tuesday that AI was playing a leading role in bolstering efficiency across the business. In an interview with Sky's US partner CNBC, he said: \"We need to keep driving safely to be the very best in the sector we can be, and that's why we're focused on another review to try to drive us towards best in class... inside the sector, and technology plays a huge part in that. \"Just technology is moving so fast, we see tremendous opportunity in that space. So it's good for all seasons to drive cost discipline and capital discipline into the business. And that's what we're focused on.\" When contacted by Sky News, a BP spokesperson suggested the company had no plans for further job losses this year and could not speculate beyond that ahead of the conclusions of the new cost review. BP reported a second quarter underlying replacement cost profit of $2.4bn, down 14% on the same period last year but well ahead of analyst forecasts of $1.8bn. Much of the reduction was down to lower comparable oil and gas prices. It moved to reward investors with a 4% dividend increase and maintained the pace of its share buyback programme at $750m for the quarter. BP said it was making progress in driving shareholder value through both its operational return to oil and gas investment and cost reductions, which stood at $1.7bn over the six months. Shares, up 3% over the year to date ahead of Tuesday's open, were trading 2% higher in early dealing. Derren Nathan, head of equity research at Hargreaves Lansdown, said of the company's figures: \"Production increases, strong results from trading activities, favourable tax rates, and better volumes and margins downstream all played their part. \"It's also upping the ante when it comes to exploration and development, culminating in this week's announcement of an oil find at the offshore Brazilian prospect Bumerangue. \"Its drilling rig intersected a staggering 500m of hydrocarbons. Taking into account the acreage of the block, it's given BP the confidence to declare the largest discovery in 25 years.\""
    },
    {
        "title": "Family of 'loving family man' who died at Oasis concert talk of 'devastation'",
        "description": "The family of a man who fell to his death at the end of an Oasis concert at Wembley Stadium say he \"slipped\" and there are \"questions about the barriers\".",
        "url": "https://news.sky.com/story/oasis-gig-death-witness-saw-similar-incident-and-asks-were-lessons-learned-13407390",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lee-claydon-oasis_6983635.jpg?20250805191312",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-05 15:21:00",
        "Headline": "Lee Claydon, 45, fell to his death at Wembley Stadium on Saturday. His family say he was a hard-working family man who loved his son.",
        "Content": "The family of a man who fell to his death at the end of an Oasis concert at Wembley Stadium say he \"slipped\" and there are \"questions about the barriers\". Lee Claydon, a 45-year-old landscape gardener from Bournemouth in Dorset, had \"everything going for him\", his father said. Clive Claydon, 75, said his son was a \"lovely bloke\" and a \"hard-working family man\" who loved his own son. \"He had everything going for him. I am so devastated I have been to the doctor for tablets and everything to get over it,\" Mr Claydon said. Discussing how the tragedy may have happened, he said his son \"doesn't take drugs [and] may have had a couple of beers but who hadn't there\"? He added: \"People have said horrible things but it was just an accident.\" Lee Claydon was at the gig with his brother and his brother's children who did not see what happened. He was found with \"injuries consistent with a fall\" and pronounced dead at the scene, the Metropolitan Police said. Oasis said they were \"shocked and saddened\" to hear of his death. \"It must have been horrific,\" Clive Claydon said. \"All I know is there was beer everywhere, it's slippery, he slipped apparently, we do not know the rest of it, there's questions about the barriers.\" The Met Police is asking for any witnesses, or anyone with mobile phone footage, to come forward. A fundraising page has been set up. Witness saw similar incident and asks 'were lessons learned'? A woman who saw a man falling from an upper tier at Wembley Stadium in June 2021 says the death of Lee Claydon makes her wonder whether lessons have been learned. Stephanie Good, 39, said a man fell during a Euro 2020 match between England and Croatia. He landed \"right next to where we were\" on the \"stairwell between rows of seats\", she said. Named as Jon, he reportedly survived but suffered two broken ankles, a fractured femur and fractured pelvis just before kick-off. Ms Good said she tried to give feedback but was unable to and felt the \"emergency response was really lacking\". The NHS manager from east London said the tragic incident at the Oasis gig was \"so similar\" to what she witnessed that it made her wonder \"were lessons learned\"? During that incident, among stadium staff \"nobody seemed to know what to do\", she told the Press Association. She thinks the man may have been trying to attach a flag to the front of a stand and \"somehow managed to fall straight over\". She said: \"They (staff) didn't seem well-trained in terms of how to respond to a really big emergency. \"Their stewards were kind of paralysed a little bit by fear, or they just weren't well trained and didn't know how to call for paramedics. \"It was us who were sort of shouting at them that they needed to get some paramedics. \"The first person on the scene wasn't a stadium paramedic or St John Ambulance. It was an off-duty firefighter who had seen the guy fall and ran down to just try and offer some help.\" Read more from Sky News:Tommy Robinson bailed after arrest over alleged assaultPolice should be 'more transparent' over suspects, home sec says Regarding the follow-up, Ms Good said staff moved spectators to other seats but did not ask for witness statements. She added: \"They didn't seek any input from people who'd seen the incident or the aftermath of it. They didn't seem interested in speaking to anybody about it. \"I was a bit concerned, because I felt that the emergency response was really lacking.\" She then tried to get in touch to give feedback, but was unable to do so and did not receive a response to a message on social media, she said. A Wembley spokesperson said: \"Wembley Stadium operates to a very high health and safety standard, fully meeting legal requirements for the safety of spectators and staff, and is certified to and compliant with the ISO 45001 standard. \"We work very closely and collaboratively with all relevant event delivery stakeholders - including event owners, local authorities, the Sports Grounds Safety Authority and the police - to deliver events to high standards of safety, security and service for everyone attending or working in the venue.\""
    },
    {
        "title": "TV presenter Jay Blades charged with two counts of rape ",
        "description": "TV presenter Jay Blades&#160;has been charged with two counts of rape, police have confirmed.",
        "url": "https://news.sky.com/story/tv-presenter-jay-blades-charged-with-two-counts-of-rape160-13407252",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-blades-court_6983257.jpg?20250805114713",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-05 10:55:00",
        "Headline": "Blades found fame on the furniture restoration programme The Repair Shop after he started presenting in 2017.",
        "Content": "TV presenter Jay Blades has been charged with two counts of rape, police have confirmed. West Mercia Police said the 55-year-old is due to appear in court next week. The force said: \"Jason Blades, 55, of Claverley in Shropshire, has been charged with two counts of rape. \"He is due to appear at Telford Magistrates' Court on 13 August 2025.\" Blades found fame on the furniture restoration programme The Repair Shop after he started presenting in 2017. A furniture restorer, he was the face of the popular BBC show that featured people having their treasured objects repaired and rejuvenated. Read more:BBC presenter denies coercive behaviour towards wifeEx-Arsenal player charged with rape appears in court Blades was also the presenter of the BBC's Money For Nothing until 2020 and took part in Celebrity Masterchef, Celebrity Bake Off, and Comic Relief."
    },
    {
        "title": "Sean 'Diddy' Combs denied bail again ahead of sentencing",
        "description": "Sean \"Diddy\" Combs has been denied bail ahead of his sentencing on prostitution-related charges.",
        "url": "https://news.sky.com/story/sean-diddy-combs-denied-bail-again-ahead-of-sentencing-13407158",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-vanity-fair-party_6983157.jpg?20250805092243",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-05 07:54:00",
        "Headline": "Hip-hop mogul Sean 'Diddy' Combs, 55, has been in prison since his arrest in September last year, and will be sentenced in October.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs has been denied bail ahead of his sentencing on prostitution-related charges. Judge Arun Subramanian said the hip-hop mogul had failed to show sufficient evidence he is not a flight risk and also cited admissions of previous violence made during his trial. Combs, 55, has been in prison since his arrest in September last year. During a two-month trial, jurors heard allegations that he had coerced former girlfriends, including singer and model Cassie Ventura, into having drug-fuelled sex marathons with male sex workers, while he watched and filmed them. In July, he was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. The rapper's legal team hailed this a \"victory\" and immediately applied for bail ahead of sentencing, citing his acquittal on the top charges. After this was denied, they submitted another application last week. Judge Subramanian has now rejected the request again. In denying the motion for bail, the judge found Combs had failed to show sufficient evidence to counter arguments he is a flight risk, writing in a court filing: \"Increasing the amount of the bond or devising additional conditions doesn't change the calculus given the circumstances and heavy burden of proof that Combs bears.\" Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs He also found that an argument by the music star's legal team that the squalor and danger of the Metropolitan Detention Center (MDC), where he is being held, did not warrant release. \"The public outcry concerning these conditions has come from all corners,\" the judge wrote. \"But as Combs acknowledges, MDC staff has been able to keep him safe and attend to his needs, even during an incident of threatened violence from an inmate.\" As well as Combs's bail application, his legal team has also filed a motion calling for him to be acquitted or given a new trial on the prostitution-related charges only. The judge has not yet responded to this application.  How long could Diddy be jailed for? Combs is due to be sentenced on 3 October and could be sentenced to up to 20 years in prison. Discussions on sentencing guidelines which followed the jury's verdict suggest it is unlikely he will be jailed for this long, with an estimate of around two to five years, taking into account time already served. However, it is ultimately up to Judge Arun Subramanian to decide the rapper's punishment. On Friday, Donald Trump was asked during an interview about a potential pardon for Combs following speculation about the issue. The president said it was unlikely, adding that the rapper was \"very hostile\" during his presidential campaign. Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture - a Grammy-winning hip-hop artist and business entrepreneur, who presided over an empire ranging from fashion to reality TV. As well as the criminal conviction, he is also facing several civil lawsuits."
    }
]