[
    {
        "title": "About half of Trump's tariffs are now null and void - but his trade war is not over",
        "description": "In one respect this decision is not altogether surprising.",
        "url": "https://news.sky.com/story/about-half-of-trumps-tariffs-are-now-null-and-void-but-his-trade-war-is-not-over-13510088",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-donald-trump-tariffs_7170407.jpg?20260220173455",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2026-02-20 17:14:00",
        "Headline": "The administration may have to refund part, or perhaps even all, of the money paid under tariffs so far following the Supreme Court decision, Sky's Ed Conway says.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n In one respect this decision is not altogether surprising. The way the Supreme Court hearings were going, this seemed the most likely decision from the US judiciary. Even so, it's an enormous blow to the Trump regime. The best place to begin understanding this is to go all the way back in history to the US constitution.  At the heart of it was the notion that the president should not have the unilateral power to set taxes which, back then at least, mostly consisted of tariffs. Tariffs, in other words, needed to be decided by Congress. This wasn't just incidental; it was the cornerstone of the much-celebrated \"separation of powers\". Trump latest: Tariffs snubbed by Supreme Court The downside of this pretty clear constitutional stricture is that getting anything through Congress is often time consuming and cumbersome. So, over the decades, various exceptions were written into law to allow presidents to, say, impose emergency tariffs in the event of national security or balance of payments crises - or because of a specific issue with a particular sector. These exceptions represent a catalogue of obscure legal loopholes where the president can actually impose tariffs unilaterally without having to go through Congress. Understanding this history is quite important to understanding what has just happened. Because much of the small print of how Donald Trump has imposed tariffs thus far has come back to the president's use of these various historic loopholes. So, for instance, the Trade Expansion Act of 1962 has a clause, section 232, that says he can impose tariffs on certain sectors if there is a national security justification. The president used this clause for his tariffs on steel and aluminium As for the famous \"Liberation Day\" tariffs, they were implemented under the International Emergency Economic Powers Act (IEEPA) of 1977. This is really only supposed to be used when the country is in a national emergency of one sort or another. That, certainly, was the president's justification for the Liberation Day tariffs: trade deficits, illegal drug inflows - these, he argued, constituted a national emergency. The main development is that now we know the Supreme Court disagrees. All the IEEPA tariffs, which is to say a fair chunk, about half, of all his levies are now null and void. There is a serious question mark about whether the administration may have to refund part, or perhaps even all, of the money paid thus far under these \"Liberation Day\" tariffs. In one respect, this doesn't fundamentally change anything, insofar as it will probably just force the administration to use some of those other obscure loopholes to recoup extra levies. The White House can blame the judiciary for obstructing the course of politics. Read more from Sky News:Trump directs US government to release files on 'alien life'Trump's peace board pledges billions of dollars to Gaza However, coming as it does as the president's poll ratings slump (in no small part because tariffs are not particularly popular), there is another potential avenue, where this episode forces Trump to concede (to the extent that it would be cast as a concession) that tariffs are not working as he might have hoped. Either way, it's yet more chaos from the on-again-off-again trade war. Doubtless there will be more twists and turns to come."
    },
    {
        "title": "Government to consider new law to remove Andrew Mountbatten-Windsor from royal line of succession",
        "description": "The government is to consider introducing legislation to remove Andrew Mountbatten-Windsor from the royal line of succession, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-consider-new-law-to-remove-andrew-mountbatten-windsor-from-royal-line-of-succession-13510139",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-andrew-windsor-prince-william_7070243.jpg?20251102234213",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-20 19:05:00",
        "Headline": "The move would require consultation and agreement with the other realms of the Commonwealth - but polling suggests four in five Britons would approve. ",
        "Content": "The government is to consider introducing legislation to remove Andrew Mountbatten-Windsor from the royal line of succession, Sky News understands. The former duke was arrested and interviewed under caution on Thursday over allegations of misconduct in public office. Any such move by the government would only happen once the ongoing police investigation into the former duke has concluded. For Buckingham Palace, removing Andrew was \"purely a matter for parliament\" and it \"would never get in the way of that or oppose the will of parliament\", a source told The Times. Calls have been growing in recent days for the King's brother to be removed from the line of succession. But any such changes will require consultation and agreement with the other realms of the Commonwealth. Chief Secretary to the Treasury James Murray told Sky News: \"The government is considering any further steps that might be required, and we're not ruling anything out. \"But at this stage, it would be inappropriate for us to go any further because there is a live police investigation under way.\" Andrew is eighth in line to the throne, behind Prince William and his three children, and Prince Harry and his two children. A YouGov poll showed that 82% of the British public would support removing him from the line of succession. Only 6% disagreed and 12% said they did not know. Andrew had his royal titles removed by the King last year as part of the fallout from his association with Jeffrey Epstein. He has denied any wrongdoing over his links to the paedophile financier, but has not directly responded to the latest allegations. The Metropolitan Police is now speaking to the former duke's protection officers in connection with the latest release of the Epstein files. The force said in a statement that officers were \"aware of the suggestion that London airports may have been used to facilitate human trafficking and sexual exploitation\". Read more from Sky News:How Iran might be preparing for potential US strikeTeen couple found dead at holiday park A spokesperson added that detectives were \"contacting former and serving officers who may have worked closely, in a protection capacity, with Andrew Mountbatten‑Windsor\". Earlier on Friday, officers were seen conducting a second day of searches at his former home in Berkshire. His sister, Anne, the Princess Royal, ignored questions on the case during a visit to a factory in Sheffield. A reporter shouted: \"Afternoon, your royal highness, how do you feel about your brother's arrest?\" The princess did not respond."
    },
    {
        "title": "Charles Bronson pledges to 'expose unlawful sentence' ahead of parole hearing",
        "description": "The Parole Board has confirmed Charles Bronson's&#160;latest bid for release will progress to an oral hearing in the coming months, where Bronson could be invited to make his plea for freedom.",
        "url": "https://news.sky.com/story/charles-bronson-pledges-to-expose-unlawful-sentence-ahead-of-parole-hearing-13510154",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-charles-bronson-bronson_6080360.jpg?20230306183650",
        "type": "Home",
        "Author": "Rebecca Spencer, specialist producer",
        "Date Published": "2026-02-20 20:07:00",
        "Headline": "Britain's 'most notorious prisoner' tells Sky News his five decades behind bars have \"gone on far too long\".",
        "Content": "By Rebecca Spencer, specialist producer  The Parole Board has confirmed Charles Bronson's latest bid for release will progress to an oral hearing in the coming months, where Bronson could be invited to make his plea for freedom. The decision is a hopeful development for one of Britain's longest-serving and most notorious prisoners, and means a fuller examination of his eligibility for release will now take place. Bronson, 73, has spent more than five decades in custody. First jailed in 1974 for armed robbery, repeated violence and hostage-taking resulted in his sentence being increased to life. But after 12 years without a violent conviction, this is now his ninth attempt to seek parole. In a letter to Sky News, Bronson wrote: \"I am 23 years over my tariff. I am forever denied progress. I am forever kept in solitary. They won't even take me off Cat A.\" He went on: \"I have to expose this unlawful sentence and treatment. It's now gone on for far to long [sic] its become a total joke.\" His most recent review had been under consideration \"on the papers\", where written evidence is assessed by the parole board, including reports from prison officials, psychologists and probation staff. However, the board has this week concluded that the case should progress to an oral hearing, where evidence can be tested in person and witnesses questioned directly. The hearing will allow the parole board to assess Bronson's current level of risk in greater depth, before deciding whether he can be safely released into the community. Read more from Sky News:Grey's Anatomy star dies aged 53Man jailed after starving dogs to death Gurdeep Singh, a solicitor acting for Bronson - also known as Charles Salvador - said the move was an important step. \"My hopes for the hearing are that Mr Salvador can finally have some progression,\" he said. \"He has been languishing in solitary confinement for years now without any future plans for him. With the right support in place, there is no reason why he should not be released into the community, allowing Mr Salvador to continue focusing on his charity work with the Born Art Foundation.\" Bronson is expected to be invited to attend the hearing in person, giving him the opportunity to address the panel directly and respond to concerns about his behaviour and future plans if he were to be released. The parole board granted Bronson a public oral hearing in 2023, where he said: \"It's no secret I have had more porridge than Goldilocks and the Three Bears, and I'm sick of it. I've had enough of it. I want to go home.\" He had applied for this year's parole proceedings to be heard in public, a request we understand was rejected. But with the case now moving to an oral stage, he could seek to renew that request. No date has yet been set for the hearing."
    },
    {
        "title": "How Iran might be preparing itself for a potential US strike",
        "description": "Satellite images analysed by Sky News' Data and Forensics team show Iran has fortified its nuclear and defence facilities, alongside conducting live drills with Russian forces amid rising tensions with the US military. ",
        "url": "https://news.sky.com/story/how-iran-might-be-preparing-itself-for-a-potential-us-strike-13510032",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dxf-teaser_7170331.jpg?20260220163723",
        "type": "Home",
        "Author": "Lydia Morrish and Freya Gibson, OSINT producers",
        "Date Published": "2026-02-20 15:39:00",
        "Headline": "While talks continue between the US and Iran, Sky News' Data and Forensics team has been analysing Iran's preparations for potential strikes. ",
        "Content": "By Lydia Morrish and Freya Gibson, OSINT producers  Satellite images analysed by Sky News' Data and Forensics team show Iran has fortified its nuclear and defence facilities, alongside conducting live drills with Russian forces amid rising tensions with the US military.  What we know about activity at Iran's nuclear facilities  Iran appears to be fortifying defences at its nuclear plants and military facilities since strikes by Israel and the US in June 2025 damaged infrastructure at three key sites. Core enrichment activity remains constrained and under close international scrutiny. The main sites affected by last year's strikes were Fordow Fuel Enrichment Plant, Natanz enrichment facility and Isfahan Nuclear Fuel Complex. They are key to Iran's core nuclear infrastructure. The Isfahan Complex is in central Iran, 135 miles south of Tehran, near the city of Natanz. It is central to the nuclear fuel cycle, converting uranium into forms suitable for enrichment. Isfahan includes an underground area where diplomats say much of Iran's enriched uranium has been stored. Iran's authorities have always said they are not trying to develop nuclear weapons. Satellite images from 6 December 2025 to 24 January 2026 show structural repair and new efforts to bury tunnel entrances to the site. Satellite images show \"efforts to prepare for an attack\" from the US, said David Albright, founder and president of the Institute for Science and International Security (ISIS) nonprofit. He told Sky News: \"At nuclear weaponisation sites, we see cleaning up and then, in some cases, rebuilding the facilities.\" He added: \"You have this clear preparation in anticipation for attack, trying to minimise potential weak points.\" The ISIS institute reported on February 9 that \"backfilling the tunnel entrances would help dampen any potential airstrike and also make ground access in a special force raid to seize or destroy any highly enriched uranium that may be housed inside difficult\". At the Natanz nuclear facility, a site built for uranium enrichment, satellite images appear to indicate signs of construction at the Pilot Fuel Enrichment Plant, which was damaged by both US and Israeli air strikes in June. Just over a mile from Natanz, there is a new site, Pickaxe Mountain, also known as Kolang Gaz La. Images show the construction and hardening of tunnel shafts. Albright told Sky News: \"At Pickaxe now, we can clearly see that they've taken steps to strengthen the tunnel entrances, which are a major vulnerability of these underground facilities.\" Deep inside a mountain near the city of Qom, around 90 miles south of Tehran, the Fordow fuel enrichment plant was also largely destroyed by the US, said Albright, with the entrance sealed up shortly after the 2025 strikes. There has been \"very little activity\" there since, he said. \"From our point of view, some of these protection measures, particularly at Isfahan, indicates there's something valuable still inside,\" said Albright. \"Whether it's recoverable or not we don't know.\" Other key military sites  Satellite imagery also shows Tehran repairing and fortifying other complexes essential to Iran's operations. Parchin military complex is one of Iran's most sensitive military sites. It has been covered in concrete, as shown by satellite images from 24 January. Reports suggest that 20 years ago, Tehran conducted tests linked to nuclear bomb detonation methods at the site. Tehran has consistently rejected this. Israel reportedly struck Parchin in October 2024. On 22 January, an analysis by the Institute for Science and International Security (ISIS) pointed to progress in the construction of a \"concrete sarcophagus\" around a newly built facility at Parchin. ISIS reported in November that imagery showed \"ongoing construction and the presence of what appears to resemble a long, cylindrical chamber, maybe a high-explosives containment vessel, likely measuring approximately 36 meters long and 12 meters in diameter, placed inside a building\". It added that high-explosive containment vessels are critical for nuclear weapons. It is not the only roof. Iran also built a roof over a destroyed facility at the Pilot plant to cover it and \"hide activities\", said Albright. Another site being repaired is Tabriz Missile Base in northwest Iran. The site is one of Iran's principal missile launch and storage bases. Satellite images show buildings at the base have been fully repaired since the Israeli strikes in June 2025. Iran's military activity  On 19 January, Russian and Iranian forces conducted joint live drills in the Gulf of Oman and the Indian Ocean. Iran's state-run IRNA news agency said the goal was \"upgrading operational coordination as well as exchange of military experiences\". Sky News has confirmed these drills were launched from Larak Island and Shahid Bahonar Port, both key strategic locations that control the Strait of Hormuz and Iran's main naval hub. This highlights both Iran's military readiness and influence over vital shipping routes. Rear Admiral Hassan Maghsoodloo of the Iranian Navy told Iran International the drills were aimed at promoting security and sustainable maritime cooperation. Mark Cancian, Senior Adviser from the Center for Strategic and International Studies (CSIS), suggested \"Russia is trying to help its partner, but its capabilities are extremely limited because it is totally consumed with the war in Ukraine\". The drills mirrored recent Iranian exercises on 16 and 17 February; the Islamic Revolutionary Guard Corps carried out naval and live-fire operations, including missile launches, across key shipping lanes such as the Strait of Hormuz. Read more:Is the US preparing for military intervention in Iran?Middle East seemingly edging closer to war They occurred amid renewed negotiations between the United States and the Islamic Republic of Iran over Iran's disputed nuclear program. As talks opened, Iranian state media reported live missile fire toward the Strait, prompting its closure for several hours. Iran often carries out military drills in the Strait of Hormuz, but the announced closure went a step further. Cancian said: \"Closing the straits is hard, even impossible, without a lot more military capability. Iran could harass shipping with missiles and mines, though that would bring a response from many nations.\" Among all of this, Iran's Supreme Leader Ayatollah Ali Khamenei posted a statement on X. Iran's naval assets  Sky News, using data from TankerTrackers, tracked several Iranian Navy vessels off the coast of Bandar Abbas on 16 January, including the drone carrier IRIS Shahid Bagheri, confirmed by satellite imagery about 10 km from shore. Frequently seen in this part of the Strait of Hormuz, the ship can deploy around 60 drones in addition to helicopters. Mark Cancian, senior advisor at CSIS, stated that Shahid Bagheri was a \"clever innovation\" and the drone carrier is \"part of that threat against the strait\". Adding that Iran has been threatening the US by aiming the drone carrier directly at the USS Abraham Lincoln, a Nimitz-class aircraft carrier in the US Navy, capable of carrying dozens of aircraft, launching precision strikes, defending itself with advanced weapons, and coordinating naval and joint operations worldwide. When asked if Iran's naval assets were positioned to warn off the US, Cancian said: \"Yes, the Iranian government is being aggressive rhetorically, and the naval movements, along with the joint exercise with the Russians, are meant to reinforce that.\" The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "At least 12 killed in Israeli strikes on Lebanon - including senior Hezbollah official",
        "description": "Israeli airstrikes have killed at least 10 people in Lebanon's Bekaa Valley and another two people in a Palestinian refugee camp, the Lebanese Health Ministry has said.",
        "url": "https://news.sky.com/story/at-least-10-killed-in-israeli-strikes-on-lebanon-including-senior-hezbollah-official-13510151",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lebanon-hezbollah_7170686.jpg?20260221004423",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-20 21:53:00",
        "Headline": "The strikes are among the deadliest reported in eastern Lebanon in recent weeks. ",
        "Content": "Israeli airstrikes have killed at least 10 people in Lebanon's Bekaa Valley and another two people in a Palestinian refugee camp, the Lebanese Health Ministry has said. Hezbollah has confirmed senior leader Hussein Yaghi was killed in the Bekaa attacks. He is the son of former Hezbollah MP Mohamed Yaghi, and his funeral is set to take place on Saturday, according to Hezbollah media. Twenty-four people - including three children - were also injured in the attack. Earlier on Friday, another Israeli strike hit Ain al-Hilweh - a densely populated Palestinian refugee camp near Sidon, killing the two people. The strikes are among the deadliest reported in eastern Lebanon in recent weeks and risk rupturing a US-brokered ceasefire between Israel and Hezbollah, strained by frequent accusations of violations. In a post on X on Friday evening, the Israel Defence Forces (IDF) said: \"STRUCK: Hezbollah command centers used to advance terror attacks against IDF troops and Israel, in the Baalbek area in Lebanon. \"Within the command centers, weapons and funds utilized by Hezbollah were being stored, constituting a violation of the understandings between Israel.\" Referring to the separate strike, the IDF posted hours earlier: \"In response to repeated ceasefire violations, the IDF struck a Hamas command center, from which terrorists operated, in the Ain al-Hilweh area in southern Lebanon.\" Israeli airstrikes in several areas of southern Lebanon early on Thursday morning targeted Hezbollah weapon depots, missile launchers, and other military sites, the IDF said, as reported by The Times of Israel. Read more from Sky News:How Iran might be preparing itself for a potential US strikeNASA says moon mission could blast off next month The strikes were the latest in the Israeli military's campaign against Hezbollah. There have been frequent airstrikes as the military says the terror group continues to try to rebuild its capabilities, contravening the US-brokered ceasefire in November 2024. The truce came after more than a year of war along the border. This included two months of open conflict in which a ground operation in Lebanon's south was carried out by the IDF as it sought to enable the safe return of some 60,000 displaced residents of northern Israel. Hezbollah started attacking Israel on 8 October 2023 - a day after Hamas's invasion of southern Israel, which triggered the war in Gaza. The ground invasion of southern Lebanon, launched in September 2024, significantly damaged the terror group's leadership and stripped back its military capabilities. Israel and Hezbollah were required to withdraw from southern Lebanon, to be replaced by the Lebanese armed forces. Israel has left all but five strategic posts along the border, The Times of Israel reports. The IDF said more than 400 Hezbollah operatives and members of allied terror groups have been killed in strikes since the ceasefire. The Israeli military says it has struck hundreds of Hezbollah sites and has carried out over 1,200 raids and other small operations in southern Lebanon."
    },
    {
        "title": "'The most kind-hearted boy': Families pay tribute after teen couple found dead at holiday park",
        "description": "The families of a teenage couple who died from suspected carbon monoxide poisoning at a holiday park in east Yorkshire have paid tribute. ",
        "url": "https://news.sky.com/story/the-most-kind-hearted-boy-families-pay-tribute-after-teen-couple-found-dead-at-holiday-park-13510111",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cherish-bean-ethan-slater_7170471.png?20260220184209",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-20 18:21:00",
        "Headline": "Cherish Bean, 15, and Ethan Slater, 17, were discovered at a rental property at Little Eden Holiday Park in Bridlington on Wednesday.",
        "Content": "The families of a teenage couple who died from suspected carbon monoxide poisoning at a holiday park in east Yorkshire have paid tribute.  The couple have been named by police, as a second man was arrested. Cherish Bean, 15, and Ethan Slater, 17, were discovered at a rental property at Little Eden Holiday Park in Bridlington on Wednesday. A 42-year-old man has become the second person to be arrested on suspicion of gross negligence manslaughter over their deaths, Humberside Police said. An extension has been granted in relation to a 33-year-old man who was arrested on Thursday, allowing police to detain him for a further 12 hours. An online fundraising page set up for Ethan's family has so far raised more than £16,000. The page says: \"It is with unimaginable heartbreak that I write this. Our son Ethan tragically and unexpectedly passed away at just 17 years old, alongside his beautiful girlfriend. \"No parent should ever have to write these words. No family should ever have to face this pain. \"Ethan had his whole life ahead of him. He'll never get to pass his driving test. He'll never celebrate his 18th birthday. He'll never reach the milestones we all assumed were waiting for him.\" Read more from Sky News:Man denies drugging and raping his wife along with othersTwo charged with murder following death of three-year-old boy The post continues: \"He was the most kind hearted boy. With a natural warmth. He was funny, he was protective and he carried himself with a quiet strength and loyalty that made us so proud to call him our son. \"He was loved beyond measure. A son, a brother, a grandson, a friend. His smile lit up a room, and his absence has left a silence that feels impossible to fill. Our lives will never be the same without him.\" In a separate statement, Cherish's mum paid tribute to her daughter, saying: \"My perfect girl, my angel, has left this world and we are broken as a family. I am broken as a mother, and I will never ever be the same again.\" She added: \"Ethan, bless you darling, such a good boy with a kind heart and I loved you like my own. \"I am broken please respect us whilst we grieve.\" Chief Superintendent Matt Peach from Humberside Police said a cordon remains in place at the holiday park and police \"continue to work in co-ordination with the Health and Safety Executive alongside our partners from Humberside Fire & Rescue, and East Riding of Yorkshire Council\". He said: \"Our thoughts remain with the loved ones of both teenagers, who have been named by their families as 15-year-old Cherish Bean, and 17-year-old Ethan Slater, who tragically lost their lives. \"Specialist trained officers are providing ongoing support through this incredibly distressing time and I would ask again for people to refrain from speculation in respect of their privacy. \"Since we received the call of concern for safety on Wednesday morning, a dedicated team of detectives and specialist officers have continued to carry out detailed inquiries to establish the full circumstances surrounding the deaths, which are thought to be connected to carbon monoxide poisoning.\""
    },
    {
        "title": "Man jailed after starving dogs to death at 'rehoming' centre in Essex",
        "description": "A man has been jailed for five years for what a judge described as the \"prolonged barbaric mistreatment, cruelty and neglect\" of dogs in Essex.",
        "url": "https://news.sky.com/story/man-jailed-for-starving-cats-and-dogs-to-death-at-rehoming-centre-in-essex-13510066",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-oaveed-rahman-animal-cruelty_7170464.jpg?20260220183655",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:15:00",
        "Headline": "Oaveed Rahman took money from his victims by pretending to run an animal charity. But the pets' owners cried in court as the prosecution described the conditions they were found in.",
        "Content": "A man has been jailed for five years for what a judge described as the \"prolonged barbaric mistreatment, cruelty and neglect\" of dogs in Essex. Oaveed Rahman, 26, claimed to be looking after the pets at a rehoming centre called Save A Paw in Crays Hill, Billericay. But Basildon Crown Court heard the animals were left without food and water in filthy conditions. After the site was raided in May last year, officers found the remains of 41 dogs. Some 21 dogs and a cat were rescued, but three of the dogs were so unwell that they had to be put down. A rescued poodle also later went blind. The court heard that Rahman took around £4,800 from his 11 victims by pretending to run an animal charity, deceiving people into handing over their dogs while often asking for payment for rehoming or rehabilitation. The pets' owners cried in court as the prosecution described the conditions the animals were kept in. Faeces were found inside the pens and cages, and many of the dogs were severely underweight, the court heard. Veterinary surgeon Amy Cooper, who attended Rahman's property, said in a statement read to the court: \"I can honestly say what I smelt and saw was the most horrific thing I have ever seen. \"It was clear just from a general initial inspection that these animals were all suffering.\" The dogs found alive had been kept in pens or confined to small spaces. Sentencing Rahman, who appeared via video link from HMP Chelmsford, Judge Richard Conley said his fraud was \"an act of betrayal of epic proportions that has devastated many lives\". \"Many animals taken in by you... were subjected to prolonged barbaric mistreatment, cruelty and neglect. Some of them died directly as a result.\" Read more from Sky News:Man guilty over XL bully attackDogs Trust: 'We are full'Puppy farming to be banned After he was sentenced, one of Rahman's fraud victim in the court shouted: \"F****** bastard, I hope you rot in there you dirty bastard.\" Charities including the RSPCA, Dogs Trust and the National Animal Welfare Trust helped rehome some of the dogs, which are now \"thriving\", police said. They included a Dachshund, French Bulldog, Chow Chow and Staffordshire Cross. An RSPCA spokesperson said it had been \"an extremely upsetting case for everyone\". They added that \"the current lack of regulation and oversight\" of rehoming centres was a \"major concern\". Adam Levy, head of rehoming operations at the Dogs Trust, said the case \"highlights the urgent need for stronger regulation of rehoming organisations, including licensing and regular inspections\". Rahman previously admitted to 11 counts of fraud by false representation and one count of causing unnecessary suffering to an animal, relating to 22 animals in his care. On Friday, he admitted an additional charge of possessing an XL bully - a banned dog breed. He was jailed for a total of five years and given a lifetime order banning him from owning any animals."
    },
    {
        "title": "Barcelona's Sagrada Familia reaches maximum height as cross is placed on Tower of Jesus Christ",
        "description": "Barcelona's soaring Sagrada Familia basilica reached its maximum height on Friday, as a crane placed the upper arm of a cross atop the Tower of Jesus Christ.",
        "url": "https://news.sky.com/story/barcelonas-sagrada-familia-reaches-maximum-height-as-cross-is-placed-on-tower-of-jesus-christ-13510001",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sagrada-familia-barcelona_7170177.jpg?20260220143605",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:35:00",
        "Headline": "Topping the central tower has been a priority ahead of celebrations this June, marking the centenary of architect Antoni Gaudi's death.",
        "Content": "Barcelona's soaring Sagrada Familia basilica reached its maximum height on Friday, as a crane placed the upper arm of a cross atop the Tower of Jesus Christ. The unfinished monument is already the world's tallest church, though Catalan architect Antoni Gaudi's magnum opus remains years away from completion. The church's central piece now towers 566ft above the city, the church said. Topping the central tower has been a priority ahead of celebrations this June, marking the centenary of Gaudi's death. The scaffolding surrounding the central tower is expected to be removed by June, in time for the inauguration of the Tower of Jesus Christ, the church said. The first stone of the Sagrada Familia was placed in 1882, but Gaudi never expected it to be finished in his lifetime. Only one of its multiple towers was completed when he died in 1926 at the age of 73, after being struck by a tram. In recent decades, more work was carried out on the basilica as it became a major international tourist attraction. The inside of the Tower of Jesus Christ is still being worked on, and its exterior is flanked by scaffolding and construction cranes. Read more from Sky News:Climber found guilty after girlfriend froze to death on mountainASOS pays tribute to co-founder after balcony fall death In line with Gaudi's plans, the cross has four arms so its shape can be recognised from any direction, said Sagrada Familia's rector, the Rev Josep Turull. If Barcelona's city government allow it, the original plan also includes a light beam shining from each of the cross's arms, signifying the church's role as a spiritual lighthouse, he added. Millions of tourists visit the Sagrada Familia every year, enthralled by Gaudi's radical aesthetic, combining Catholic symbolism and organic forms, with entrance fees largely funding the ongoing construction. This year, the Sagrada Familia will hold several events to celebrate the Catalan Modernist's legacy, which includes other beautiful buildings in Barcelona and elsewhere in Spain. The Sagrada Familia became the world's tallest church last October, when it rose above the spire of Germany's Ulmer Munster, a Gothic Lutheran church built over 500 years starting in 1377, which stands at 530ft. A prayer verse from the Gloria that Catholics recite at mass is at the base of the cross installed on Friday at Sagrada Familia, the church's rector said. It reads: \"You alone are the Holy One, you alone are the Lord, you alone are the Most High.\""
    },
    {
        "title": "Government to consider new law to remove Andrew Mountbatten-Windsor from royal line of succession",
        "description": "The government is to consider introducing legislation to remove Andrew Mountbatten-Windsor from the royal line of succession, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-consider-new-law-to-remove-andrew-mountbatten-windsor-from-royal-line-of-succession-13510139",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-andrew-windsor-prince-william_7070243.jpg?20251102234213",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 19:05:00",
        "Headline": "The move would require consultation and agreement with the other realms of the Commonwealth - but polling suggests four in five Britons would approve. ",
        "Content": "The government is to consider introducing legislation to remove Andrew Mountbatten-Windsor from the royal line of succession, Sky News understands. The former duke was arrested and interviewed under caution on Thursday over allegations of misconduct in public office. Any such move by the government would only happen once the ongoing police investigation into the former duke has concluded. For Buckingham Palace, removing Andrew was \"purely a matter for parliament\" and it \"would never get in the way of that or oppose the will of parliament\", a source told The Times. Calls have been growing in recent days for the King's brother to be removed from the line of succession. But any such changes will require consultation and agreement with the other realms of the Commonwealth. Chief Secretary to the Treasury James Murray told Sky News: \"The government is considering any further steps that might be required, and we're not ruling anything out. \"But at this stage, it would be inappropriate for us to go any further because there is a live police investigation under way.\" Andrew is eighth in line to the throne, behind Prince William and his three children, and Prince Harry and his two children. A YouGov poll showed that 82% of the British public would support removing him from the line of succession. Only 6% disagreed and 12% said they did not know. Andrew had his royal titles removed by the King last year as part of the fallout from his association with Jeffrey Epstein. He has denied any wrongdoing over his links to the paedophile financier, but has not directly responded to the latest allegations. The Metropolitan Police is now speaking to the former duke's protection officers in connection with the latest release of the Epstein files. The force said in a statement that officers were \"aware of the suggestion that London airports may have been used to facilitate human trafficking and sexual exploitation\". Read more from Sky News:How Iran might be preparing for potential US strikeTeen couple found dead at holiday park A spokesperson added that detectives were \"contacting former and serving officers who may have worked closely, in a protection capacity, with Andrew Mountbatten‑Windsor\". Earlier on Friday, officers were seen conducting a second day of searches at his former home in Berkshire. His sister, Anne, the Princess Royal, ignored questions on the case during a visit to a factory in Sheffield. A reporter shouted: \"Afternoon, your royal highness, how do you feel about your brother's arrest?\" The princess did not respond."
    },
    {
        "title": "Man jailed after starving dogs to death at 'rehoming' centre in Essex",
        "description": "A man has been jailed for five years for what a judge described as the \"prolonged barbaric mistreatment, cruelty and neglect\" of dogs in Essex.",
        "url": "https://news.sky.com/story/man-jailed-for-starving-cats-and-dogs-to-death-at-rehoming-centre-in-essex-13510066",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-oaveed-rahman-animal-cruelty_7170464.jpg?20260220183655",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:15:00",
        "Headline": "Oaveed Rahman took money from his victims by pretending to run an animal charity. But the pets' owners cried in court as the prosecution described the conditions they were found in.",
        "Content": "A man has been jailed for five years for what a judge described as the \"prolonged barbaric mistreatment, cruelty and neglect\" of dogs in Essex. Oaveed Rahman, 26, claimed to be looking after the pets at a rehoming centre called Save A Paw in Crays Hill, Billericay. But Basildon Crown Court heard the animals were left without food and water in filthy conditions. After the site was raided in May last year, officers found the remains of 41 dogs. Some 21 dogs and a cat were rescued, but three of the dogs were so unwell that they had to be put down. A rescued poodle also later went blind. The court heard that Rahman took around £4,800 from his 11 victims by pretending to run an animal charity, deceiving people into handing over their dogs while often asking for payment for rehoming or rehabilitation. The pets' owners cried in court as the prosecution described the conditions the animals were kept in. Faeces were found inside the pens and cages, and many of the dogs were severely underweight, the court heard. Veterinary surgeon Amy Cooper, who attended Rahman's property, said in a statement read to the court: \"I can honestly say what I smelt and saw was the most horrific thing I have ever seen. \"It was clear just from a general initial inspection that these animals were all suffering.\" The dogs found alive had been kept in pens or confined to small spaces. Sentencing Rahman, who appeared via video link from HMP Chelmsford, Judge Richard Conley said his fraud was \"an act of betrayal of epic proportions that has devastated many lives\". \"Many animals taken in by you... were subjected to prolonged barbaric mistreatment, cruelty and neglect. Some of them died directly as a result.\" Read more from Sky News:Man guilty over XL bully attackDogs Trust: 'We are full'Puppy farming to be banned After he was sentenced, one of Rahman's fraud victim in the court shouted: \"F****** bastard, I hope you rot in there you dirty bastard.\" Charities including the RSPCA, Dogs Trust and the National Animal Welfare Trust helped rehome some of the dogs, which are now \"thriving\", police said. They included a Dachshund, French Bulldog, Chow Chow and Staffordshire Cross. An RSPCA spokesperson said it had been \"an extremely upsetting case for everyone\". They added that \"the current lack of regulation and oversight\" of rehoming centres was a \"major concern\". Adam Levy, head of rehoming operations at the Dogs Trust, said the case \"highlights the urgent need for stronger regulation of rehoming organisations, including licensing and regular inspections\". Rahman previously admitted to 11 counts of fraud by false representation and one count of causing unnecessary suffering to an animal, relating to 22 animals in his care. On Friday, he admitted an additional charge of possessing an XL bully - a banned dog breed. He was jailed for a total of five years and given a lifetime order banning him from owning any animals."
    },
    {
        "title": "Man denies drugging and raping his wife along with others ",
        "description": "A man has appeared in court to deny drugging his wife to rape and sexually assault her along with other men.&#160;&#160;&#160;",
        "url": "https://news.sky.com/story/man-denies-drugging-and-raping-his-wife-along-with-others-13510016",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-manchester-minshull-street_7170236.jpg?20260220153404",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2026-02-20 15:02:00",
        "Headline": "The man, who is in his 60s, appeared at Manchester Minshull Street Crown Court along with a dozen other men. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n A man has appeared in court to deny drugging his wife to rape and sexually assault her along with other men.    The defendant, who is in his 60s, but cannot be named for legal reasons, entered not guilty pleas to 48 offences. He is accused of drugging his wife in order to rape and sexually assault her on his own over more than two decades, dating back to the early 2000s. Between 2023 and his arrest last year, he allegedly invited other men to sexually assault and rape his wife while she was unconscious. He appeared at Manchester Minshull Street Crown Court along with 12 other men, aged between 28 and 73, who also cannot be identified. All are charged with conspiracy offences, and all but two are alleged to have also committed so-called contact sexual offences. A man in his 50s pleaded guilty to charges of conspiracy to rape, conspiracy to assault by penetration, conspiracy to administer a substance and assault by penetration. Five of the men are yet to enter pleas, while a total of seven, including the husband, denied the charges. He is charged with 23 counts relating to offences committed on his own - including some multiple incident counts - eight conspiracy offences and 17 attacks allegedly committed with other men. The charges include: • Four counts of conspiracy to rape. • Three counts of conspiracy to commit sexual assault by penetration. • One count of conspiracy administer a substance with intent to overpower to allow sexual activity. • 18 counts of rape. • 13 counts of sexual assault by penetration. • Seven counts of sexual assault. • One count of administering a substance with intent to stupefy or overpower to allow sexual activity. • One count of sharing photographs or films of person in intimate state for purpose of sexual gratification. Appearing by video-link from Forest Bank prison, the clerk took 23 minutes to read out the 18-page indictment as the man pleaded not guilty to each count. Family members of the alleged victim and the defendants sat in the public gallery. Five of his co-defendants appeared alongside him, while another five, who are on bail, appeared in the dock, and two others appeared from different prisons. Another hearing is set for next month, while a 12-week trial has been listed to start on 1 September this year."
    },
    {
        "title": "'The most kind-hearted boy': Families pay tribute after teen couple found dead at holiday park",
        "description": "The families of a teenage couple who died from suspected carbon monoxide poisoning at a holiday park in east Yorkshire have paid tribute. ",
        "url": "https://news.sky.com/story/the-most-kind-hearted-boy-families-pay-tribute-after-teen-couple-found-dead-at-holiday-park-13510111",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cherish-bean-ethan-slater_7170471.png?20260220184209",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 18:21:00",
        "Headline": "Cherish Bean, 15, and Ethan Slater, 17, were discovered at a rental property at Little Eden Holiday Park in Bridlington on Wednesday.",
        "Content": "The families of a teenage couple who died from suspected carbon monoxide poisoning at a holiday park in east Yorkshire have paid tribute.  The couple have been named by police, as a second man was arrested. Cherish Bean, 15, and Ethan Slater, 17, were discovered at a rental property at Little Eden Holiday Park in Bridlington on Wednesday. A 42-year-old man has become the second person to be arrested on suspicion of gross negligence manslaughter over their deaths, Humberside Police said. An extension has been granted in relation to a 33-year-old man who was arrested on Thursday, allowing police to detain him for a further 12 hours. An online fundraising page set up for Ethan's family has so far raised more than £16,000. The page says: \"It is with unimaginable heartbreak that I write this. Our son Ethan tragically and unexpectedly passed away at just 17 years old, alongside his beautiful girlfriend. \"No parent should ever have to write these words. No family should ever have to face this pain. \"Ethan had his whole life ahead of him. He'll never get to pass his driving test. He'll never celebrate his 18th birthday. He'll never reach the milestones we all assumed were waiting for him.\" Read more from Sky News:Man denies drugging and raping his wife along with othersTwo charged with murder following death of three-year-old boy The post continues: \"He was the most kind hearted boy. With a natural warmth. He was funny, he was protective and he carried himself with a quiet strength and loyalty that made us so proud to call him our son. \"He was loved beyond measure. A son, a brother, a grandson, a friend. His smile lit up a room, and his absence has left a silence that feels impossible to fill. Our lives will never be the same without him.\" In a separate statement, Cherish's mum paid tribute to her daughter, saying: \"My perfect girl, my angel, has left this world and we are broken as a family. I am broken as a mother, and I will never ever be the same again.\" She added: \"Ethan, bless you darling, such a good boy with a kind heart and I loved you like my own. \"I am broken please respect us whilst we grieve.\" Chief Superintendent Matt Peach from Humberside Police said a cordon remains in place at the holiday park and police \"continue to work in co-ordination with the Health and Safety Executive alongside our partners from Humberside Fire & Rescue, and East Riding of Yorkshire Council\". He said: \"Our thoughts remain with the loved ones of both teenagers, who have been named by their families as 15-year-old Cherish Bean, and 17-year-old Ethan Slater, who tragically lost their lives. \"Specialist trained officers are providing ongoing support through this incredibly distressing time and I would ask again for people to refrain from speculation in respect of their privacy. \"Since we received the call of concern for safety on Wednesday morning, a dedicated team of detectives and specialist officers have continued to carry out detailed inquiries to establish the full circumstances surrounding the deaths, which are thought to be connected to carbon monoxide poisoning.\""
    },
    {
        "title": "Who are the Team GB athletes hoping for a 'Super Saturday' at the Winter Olympics?",
        "description": "Team GB could extend its record-breaking medal streak at the Winter Olympics with more potential golds this weekend.",
        "url": "https://news.sky.com/story/who-are-the-team-gb-athletes-hoping-for-a-super-saturday-at-the-winter-olympics-13509939",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winter-olympics-curing_7170333.jpg?20260220164228",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 10:35:00",
        "Headline": "From the ice to the snow, Team GB have medal hopefuls in the curling and freestyle skiing halfpipe finals this Saturday, which could put the seal on the nation's best-ever Winter Olympics.",
        "Content": "Team GB could extend its record-breaking medal streak at the Winter Olympics with more potential golds this weekend. Britain's world champion team will go up against Canada in the final of the men's curling, while freestyle skier Zoe Atkin goes into the women's halfpipe final at the top of the leaderboard. Both finals are taking place on Saturday, a week after \"Super Sunday\" when Charlotte Bankes and Huw Nightingale won gold in the mixed team snowboard cross, before Matt Weston and Tabby Stoecker followed suit in the skeleton. The Games in Milan and Cortina are already among Britain's most successful in history. The best medal haul from a Winter Olympics currently stands at five, with only one gold ever being won. Here's everything you need to know about the athletes hoping to add to Britain's medal tally. Bruce Mouat's curling team faced a nail-biting semi-final match against Switzerland before sealing an 8-5 victory to send them into Saturday's final against Canada. Already guaranteed at least a silver medal, the team are aiming to go one step further and improve on the silver they won at the last Games in Beijing in 2022. If they do, they will be the first British men's curling squad to win gold since 1924. The team is made up of: • Bruce Mouat: The skip - essentially the team captain who makes key decisions about strategy and play• Hammy McMillan Jr: The lead - the person who throws the first two stones• Bobby Lammie: The second - the person who throws second• Grant Hardie: The third / vice-skip - the person who throws third and is also vice-captain• Kyle Waddell: The alternate - the person who replaces an injured player and plays a key role in preparations The first four also made up the team for the Beijing Games, while Waddell is returning to the Olympic stage for the first time in eight years. Their route to this year's final has been tense to say the least. During the round-robin stages, Mouat's squad squeezed through with five wins and four defeats, and were the underdogs going into the semi-final against the Swiss, who had won all their nine matches. It was a tight contest, but a point in the sixth end for Britain changed the momentum. Two points in the eighth saw Britain edge in front for the first time, and another two-point score in the 10th sealed the win. Speaking to Sky News ahead of the final, Ross Whyte, who was part of the silver-medal winning squad in 2022, said the team was doing \"amazingly\" and should \"go out there and play like they normally do\" on the weekend. \"They're a great team, and we have high hopes and are praying that they get it done.\" Curling rocked by cheating allegations Team GB now face familiar rivals Canada, led by Brad Jacob, who have been at the centre of cheating allegations that have rocked the sport. The controversy revolves around claims of \"double-touching\" curling stones after their release, with the Canadian men's and women's team, along with Mouat's squad, all accused of the infraction. The dispute began during an explosive match between Sweden and Canada, which led to World Curling officials increasing the level of umpiring. During Team GB's match against Germany, officials said Bobby Lammie touched a stone after releasing it, leading to it being removed. Read more on the controversy here. Zoe Atkin, 23, has qualified top for the women's freestyle skiing halfpipe final, eclipsing Chinese superstar Eileen Gu, who made history in 2022 as the first freestyle skier to win three medals at a single Olympics. She earned a mammoth score of 91.50 on her first qualifying run, easily securing her place in the final, while Gu sits in fifth. The discipline involves skiers going from side to side in a U-shaped structure and launching into the air to perform flips, grabs and spins. Execution and difficulty are all judged, as well as the variety of the tricks. Although having grown up in the US, Atkin is a UK-US dual citizen. Her father, a British national, has previously insisted that Atkin and her sister, fellow freestyle skier and Olympic bronze medallist Izzy Atkin, \"grew up on Ribena and Marmite\". She came into these Games having won the superpipe competition at last month's Aspen X Games, and admitted she was motivated by the prospect of eclipsing her sister's Olympic medal colour. Read more:Norway's Hoesflot Klaebo sets Olympic recordValentine's Day gift for Winter OlympiansLindsey Vonn arrives home after crash \"There's definitely a little bit of rivalry between us, and I think that's more from my side because I'm the little sister,\" Atkin said. \"I grew up kind of in her shadow a little bit, and I feel like only now am I making a name for myself. But she is the whole reason I got into skiing, and she has been my biggest role model. \"She's my best friend, and she would be happy for me, of course, even if I did one-up her.\""
    },
    {
        "title": "Two charged with murder following death of three-year-old boy in London",
        "description": "Two people have been charged with murder after police opened an investigation into the death of a three-year-old boy.",
        "url": "https://news.sky.com/story/two-charged-with-murder-following-death-of-three-year-old-boy-in-woolwich-13509872",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-police-metropolitan-police_7152067.jpg?20260201121321",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 09:15:00",
        "Headline": "Police were called to a hospital on 3 January after concerns were raised over a child who had been admitted with \"serious injuries\". He died 16 days later.",
        "Content": "Two people have been charged with murder after police opened an investigation into the death of a three-year-old boy. Police were called to a hospital on 3 January after concerns were raised over the child - Isiayah Henry, from Woolwich, southeast London - who had been admitted with what have been described as \"serious injuries\". He died on 19 January despite the \"best efforts of medical staff\", police said. After initial enquiries, police began a safeguarding and criminal investigation. Tanisha Henry, 28, of Woolwich, and Mikael Williams, 30, of Southwark, will next appear at Woolwich Crown Court on 22 April. Read more from Sky News:Sky News gains rare access to Bank of England's gold vaultsUniversal vaccine for cold, flu, and allergies moves a step closer They have also been charged with causing or allowing the death of a child. Isiayah's family have been informed and continue to receive support from specialist officers, the Metropolitan Police said. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "End to wintry weather with temperatures up to 16C forecast this weekend",
        "description": "Temperatures could reach 16C (61F) this weekend, marking the end of frosty weather in recent days, which had seen warnings for ice and snow.",
        "url": "https://news.sky.com/story/end-to-wintry-weather-with-temperatures-up-to-16c-forecast-this-weekend-13509937",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-daffodils-kent_7170113.jpg?20260220125140",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 10:31:00",
        "Headline": "The change in weather may lull people into believing spring is just around the corner. But Sky News weather producer Jo Wheeler says \"don't be fooled\".",
        "Content": "Temperatures could reach 16C (61F) this weekend, marking the end of frosty weather in recent days, which had seen warnings for ice and snow. But despite the milder, brighter and spring-like feel for many, some areas are also predicted to get showers and longer spells of heavy rain, increasing the risk of flooding on already saturated ground. Check the weather forecast in your area Sky News weather producer Jo Wheeler said some parts of the UK have experienced 51 consecutive days of rain during the start of 2026. \"If we're looking for a glimmer of hope, let alone a glimmer of sunshine, it will turn milder over the next few days. \"Not a heatwave, let's not get ahead of ourselves, but temperatures surpassing seasonal norms by a few degrees. However, conditions will remain unsettled with bouts of wet and windy weather spreading from the Atlantic.\" After a spell of widespread frost and snow it is now predicted that temperatures will reach the early teens, with the potential for 16C (61F) in the south of England on Saturday, although it will be cooler further north. \n                  One in nine new homes in England built in flood-prone areas, study shows\n                 \n                  UK at risk of more flooding 'for months to come' after record-breaking January\n                 \n                  Fresh snow warning issued for parts of England as flooding expected in more than 70 areas\n                 The highest temperature recorded so far this year was 13.9C (57F) on 6 February. But Atlantic systems will produce wet and windy conditions at times. \"It will be Northern Ireland and western Scotland that will bear the brunt of the wet weather over coming days, putting the highest rainfall totals in the northwest,\" said Wheeler. Read more from Sky News:Homes built in flood-prone areasStorm sweeps road into the sea The risk of flooding remains in some parts of the UK after the start of 2026 brought seemingly relentless rain due to a \"blocking pattern\". Recent figures from the UK Centre for Ecology and Hydrology reveal Northern Ireland and the southwest of England had their wettest January on record. It was also one of the five wettest Januarys since 1890 for southern counties of England. Flooding risk remains On Friday afternoon, more than 60 flood warnings remained in force in England, including the rivers Ebble, Wylye and Avon around Salisbury, River Avon in Ringwood and Christchurch, River Frome around Dorchester and the River Severn in Tewkesbury and the northern outskirts of Gloucester. The Environment Agency has also issued several groundwater flood warnings in parts of Wiltshire, Hampshire and Dorset. Groundwater flooding happens when the water table rises to the surface, with cellars and basements particularly at risk. 'Don't be fooled' Low-pressure systems currently approaching the UK and Ireland are bringing up some warmth from Iberia. \"We can expect temperatures in the low to mid-teens over the weekend and into the coming week, which isn't bad for late February,\" said Wheeler. But she warned against the change in weather lulling people into believing spring is just around the corner. \"Don't be fooled!\" she said. \"There's still the potential for temperatures to return to average values; maybe even lower than average. Gardeners be warned!\" Yellow warnings issued Earlier this week, the Met Office had issued a series of yellow weather warnings for rain, snow and ice, partly caused by Storm Pedro - named by the French equivalent of the Met Office. In addition, cold weather alerts were issued by the UK Health Security Agency (UKHSA) across most of England, apart from London and the southeast, until 6pm on Friday."
    },
    {
        "title": "Drink driving suspect who ran into London nightclub with loaded gun in his rucksack is jailed",
        "description": "An armed man who was chased by police into a crowded nightclub has been jailed.",
        "url": "https://news.sky.com/story/drink-driving-suspect-who-ran-into-london-nightclub-with-loaded-gun-in-his-rucksack-is-jailed-13510012",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-police-drink-driver_7170448.jpg?20260220182803",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-20 22:01:00",
        "Headline": "Footage shows Nathan Ingram, who was also in possession of cocaine, trying to evade police in Hoxton after being told he would be arrested following a failed a breathalyser test.",
        "Content": "An armed man who was chased by police into a crowded nightclub has been jailed. Nathan Ingram, 29, was sentenced to five years' imprisonment at Wood Green Crown Court after running into the venue, with a loaded pistol in his rucksack, in an attempt to evade officers in the early hours of 29 November last year. His black Audi Q2 Sport had been pulled over by officers in Hoxton, east London, and he attempted to flee when he was told that he was going to be arrested for drink-driving after failing a breathalyser test. The Metropolitan Police posted a video of him talking with officers before suddenly making a break for it. He headed for a nightclub across the road before being tackled. Officers later found a loaded Bernardelli 69 self-loading pistol and a small amount of cocaine in his rucksack. Ingram, of Hackney, east London, pleaded guilty to possession of a firearm, ammunition and possession of a class A drug. Police said he was sentenced on 27 January. \n                  Police name suspect in London knife murder as £10,000 reward offered\n                 \n                  Hundreds arrested for phone theft in London - as Met chief calls on courts to stop releasing offenders\n                 \n                  Boy, 13, arrested on suspicion of attempted murder after double stabbing at school\n                 Read more from Sky NewsTwo charged with murder after death of three-year-old boyMan denies drugging and raping his wife along with others Detective Sergeant Charlie Leather, who led the investigation, said: “A dangerous weapon has been taken out of the criminals’ hands thanks to a routine traffic stop by eagle-eyed police officers. “Ingram thought he was quick on his feet - but we were quicker. “We’re determined to get guns off London’s streets. “The heavy jail sentence handed to Ingram is a warning to anyone tempted to keep a firearm that they’ll end up spending years behind bars.”"
    },
    {
        "title": "How Iran might be preparing itself for a potential US strike",
        "description": "Satellite images analysed by Sky News' Data and Forensics team show Iran has fortified its nuclear and defence facilities, alongside conducting live drills with Russian forces amid rising tensions with the US military. ",
        "url": "https://news.sky.com/story/how-iran-might-be-preparing-itself-for-a-potential-us-strike-13510032",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dxf-teaser_7170331.jpg?20260220163723",
        "type": "World",
        "Author": "Lydia Morrish and Freya Gibson, OSINT producers",
        "Date Published": "2026-02-20 15:39:00",
        "Headline": "While talks continue between the US and Iran, Sky News' Data and Forensics team has been analysing Iran's preparations for potential strikes. ",
        "Content": "By Lydia Morrish and Freya Gibson, OSINT producers  Satellite images analysed by Sky News' Data and Forensics team show Iran has fortified its nuclear and defence facilities, alongside conducting live drills with Russian forces amid rising tensions with the US military.  What we know about activity at Iran's nuclear facilities  Iran appears to be fortifying defences at its nuclear plants and military facilities since strikes by Israel and the US in June 2025 damaged infrastructure at three key sites. Core enrichment activity remains constrained and under close international scrutiny. The main sites affected by last year's strikes were Fordow Fuel Enrichment Plant, Natanz enrichment facility and Isfahan Nuclear Fuel Complex. They are key to Iran's core nuclear infrastructure. The Isfahan Complex is in central Iran, 135 miles south of Tehran, near the city of Natanz. It is central to the nuclear fuel cycle, converting uranium into forms suitable for enrichment. Isfahan includes an underground area where diplomats say much of Iran's enriched uranium has been stored. Iran's authorities have always said they are not trying to develop nuclear weapons. Satellite images from 6 December 2025 to 24 January 2026 show structural repair and new efforts to bury tunnel entrances to the site. Satellite images show \"efforts to prepare for an attack\" from the US, said David Albright, founder and president of the Institute for Science and International Security (ISIS) nonprofit. He told Sky News: \"At nuclear weaponisation sites, we see cleaning up and then, in some cases, rebuilding the facilities.\" He added: \"You have this clear preparation in anticipation for attack, trying to minimise potential weak points.\" The ISIS institute reported on February 9 that \"backfilling the tunnel entrances would help dampen any potential airstrike and also make ground access in a special force raid to seize or destroy any highly enriched uranium that may be housed inside difficult\". At the Natanz nuclear facility, a site built for uranium enrichment, satellite images appear to indicate signs of construction at the Pilot Fuel Enrichment Plant, which was damaged by both US and Israeli air strikes in June. Just over a mile from Natanz, there is a new site, Pickaxe Mountain, also known as Kolang Gaz La. Images show the construction and hardening of tunnel shafts. Albright told Sky News: \"At Pickaxe now, we can clearly see that they've taken steps to strengthen the tunnel entrances, which are a major vulnerability of these underground facilities.\" Deep inside a mountain near the city of Qom, around 90 miles south of Tehran, the Fordow fuel enrichment plant was also largely destroyed by the US, said Albright, with the entrance sealed up shortly after the 2025 strikes. There has been \"very little activity\" there since, he said. \"From our point of view, some of these protection measures, particularly at Isfahan, indicates there's something valuable still inside,\" said Albright. \"Whether it's recoverable or not we don't know.\" Other key military sites  Satellite imagery also shows Tehran repairing and fortifying other complexes essential to Iran's operations. Parchin military complex is one of Iran's most sensitive military sites. It has been covered in concrete, as shown by satellite images from 24 January. Reports suggest that 20 years ago, Tehran conducted tests linked to nuclear bomb detonation methods at the site. Tehran has consistently rejected this. Israel reportedly struck Parchin in October 2024. On 22 January, an analysis by the Institute for Science and International Security (ISIS) pointed to progress in the construction of a \"concrete sarcophagus\" around a newly built facility at Parchin. ISIS reported in November that imagery showed \"ongoing construction and the presence of what appears to resemble a long, cylindrical chamber, maybe a high-explosives containment vessel, likely measuring approximately 36 meters long and 12 meters in diameter, placed inside a building\". It added that high-explosive containment vessels are critical for nuclear weapons. It is not the only roof. Iran also built a roof over a destroyed facility at the Pilot plant to cover it and \"hide activities\", said Albright. Another site being repaired is Tabriz Missile Base in northwest Iran. The site is one of Iran's principal missile launch and storage bases. Satellite images show buildings at the base have been fully repaired since the Israeli strikes in June 2025. Iran's military activity  On 19 January, Russian and Iranian forces conducted joint live drills in the Gulf of Oman and the Indian Ocean. Iran's state-run IRNA news agency said the goal was \"upgrading operational coordination as well as exchange of military experiences\". Sky News has confirmed these drills were launched from Larak Island and Shahid Bahonar Port, both key strategic locations that control the Strait of Hormuz and Iran's main naval hub. This highlights both Iran's military readiness and influence over vital shipping routes. Rear Admiral Hassan Maghsoodloo of the Iranian Navy told Iran International the drills were aimed at promoting security and sustainable maritime cooperation. Mark Cancian, Senior Adviser from the Center for Strategic and International Studies (CSIS), suggested \"Russia is trying to help its partner, but its capabilities are extremely limited because it is totally consumed with the war in Ukraine\". The drills mirrored recent Iranian exercises on 16 and 17 February; the Islamic Revolutionary Guard Corps carried out naval and live-fire operations, including missile launches, across key shipping lanes such as the Strait of Hormuz. Read more:Is the US preparing for military intervention in Iran?Middle East seemingly edging closer to war They occurred amid renewed negotiations between the United States and the Islamic Republic of Iran over Iran's disputed nuclear program. As talks opened, Iranian state media reported live missile fire toward the Strait, prompting its closure for several hours. Iran often carries out military drills in the Strait of Hormuz, but the announced closure went a step further. Cancian said: \"Closing the straits is hard, even impossible, without a lot more military capability. Iran could harass shipping with missiles and mines, though that would bring a response from many nations.\" Among all of this, Iran's Supreme Leader Ayatollah Ali Khamenei posted a statement on X. Iran's naval assets  Sky News, using data from TankerTrackers, tracked several Iranian Navy vessels off the coast of Bandar Abbas on 16 January, including the drone carrier IRIS Shahid Bagheri, confirmed by satellite imagery about 10 km from shore. Frequently seen in this part of the Strait of Hormuz, the ship can deploy around 60 drones in addition to helicopters. Mark Cancian, senior advisor at CSIS, stated that Shahid Bagheri was a \"clever innovation\" and the drone carrier is \"part of that threat against the strait\". Adding that Iran has been threatening the US by aiming the drone carrier directly at the USS Abraham Lincoln, a Nimitz-class aircraft carrier in the US Navy, capable of carrying dozens of aircraft, launching precision strikes, defending itself with advanced weapons, and coordinating naval and joint operations worldwide. When asked if Iran's naval assets were positioned to warn off the US, Cancian said: \"Yes, the Iranian government is being aggressive rhetorically, and the naval movements, along with the joint exercise with the Russians, are meant to reinforce that.\" The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Climber found guilty after girlfriend froze to death on Austria's highest mountain",
        "description": "An amateur climber has been found guilty of gross negligent manslaughter after his girlfriend froze to death on Austria's highest mountain.",
        "url": "https://news.sky.com/story/climber-found-guilty-after-girlfriend-froze-to-death-on-austrias-highest-mountain-13509859",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-austria-grossglockner_7169991.jpg?20260220093417",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 08:30:00",
        "Headline": "The Austrian man was accused of making mountaineering errors including starting the climb too late, not making an emergency call before nightfall and allowing his girlfriend to use unsuitable equipment. She died of hypothermia last January. ",
        "Content": "An amateur climber has been found guilty of gross negligent manslaughter after his girlfriend froze to death on Austria's highest mountain. The 37-year-old Austrian man, named only as Thomas P in line with privacy laws, was given a five-month suspended sentence and fined €9,400 (£8,200) by a court in Innsbruck on Thursday over the death of his girlfriend, named as Kerstin G. The 33-year-old died of hypothermia on Grossglockner mountain on 19 January last year. The unusual case caught the attention of social media and has raised questions about the extent of legal liability in the mountains, which climbers generally explore at their own risk. The Innsbruck Public Prosecutors' Office claimed Thomas P should be regarded as the responsible guide because he, unlike his girlfriend, was already highly experienced with alpine high altitude tours and had planned the tour. It accused him of several errors including starting the climb too late in the day, not making an emergency call before nightfall and allowing her to use unsuitable equipment. Defence lawyer Kurt Jelinek argued that all the accusations were unfounded and denied the defendant had a de facto leadership role during the climb, Austrian newspaper Der Standard reported. What happened? The court heard that the couple were around 50m below the summit of the Grossglockner mountain on a freezing winter's night when Kerstin G was exhausted and unable to go any further. The prosecution alleged that although the couple were unable to continue their journey from approximately 8.50pm, Thomas P did not make an emergency call and also did not give any distress signals when a police helicopter flew over around two hours later. At around 2am, the defendant left his girlfriend exposed to strong winds without wrapping her in an emergency blanket or bivouac bag, which she had in her backpack, in an attempt to go and get help from a shelter on the mountain. When asked why this was the case, he told the court the situation had been particularly stressful. After calling mountain police at around 3.30am, a search was not triggered as the man did not make it clear the couple needed rescuing, and he failed to answer calls or WhatsApp messages asking if they needed help. The defendant said his phone had been in airplane mode to save battery. Thomas P, who pleaded not guilty, told the court that he was \"so terribly sorry\". He said that the couple had made all their decisions together and had planned the climbs together, claiming his girlfriend's mountaineering knowledge wasn't far short of his own. During questioning he claimed that he was already suffering from hypothermia and exhaustion and had secured Kerstin G to a rock with a sling before climbing on to get help, newspaper Der Standard reported. He said when he turned back to lie down next to her she had told him to \"go now, go!\" which he claimed had \"saved his life\". Ex-girlfriend testimony During the trial, prosecutors called the defendant's ex-girlfriend as a witness. She said they too had climbed Grossglockner in 2023, and said after an argument over the route he left her alone at night, crying as her headlamp ran out of battery. Read more from Sky News:Inside the Bank of England's gold vaultGrey's Anatomy and Euphoria star dies 'I do not see you as a murderer' The presiding judge, Norbert Hofer, who is an experienced mountaineer, ruled Thomas P should have realised his girlfriend would not be able to complete the climb well before they ran into difficulty. He said she would almost certainly have survived \"if the appropriate measures had been taken\", for example making an emergency call earlier or turning back. He added that he was a better mountaineer than his girlfriend by \"galaxies\", and that she had placed herself in his care. But he said he did not see him \"as a murderer\" or as \"cold-hearted\", acknowledging that he had gone to fetch help. The verdict can be appealed."
    },
    {
        "title": "ASOS pays tribute to co-founder after death from Thailand balcony fall",
        "description": "ASOS has paid tribute to its co-founder after he died in a fall from the balcony of his apartment in Thailand.",
        "url": "https://news.sky.com/story/asos-co-founder-quentin-griffiths-dies-after-thailand-balcony-fall-13509902",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-quentin-griffiths-asos_7170016.jpg?20260220134315",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 10:02:00",
        "Headline": "Police said initial investigations suggest there are no indications of foul play.",
        "Content": "ASOS has paid tribute to its co-founder after he died in a fall from the balcony of his apartment in Thailand. Quentin Griffiths fell from the 17th floor of the apartment block in the seaside resort city of Pattaya on 9 February, Thai have police said. Police said initial investigations suggest there are no indications of foul play. An Asos spokesperson said: \"We're saddened to hear about the passing of Quentin, one of our original co-founders. \"He played an important role in Asos's earliest days and we're forever grateful for his contribution. Our thoughts are with his family and friends.\" Police said CCTV showed no sign of anybody entering Griffiths' apartment, where he lived alone, the force added. His body has been sent for a post-mortem, they added. The police also quoted a Thai friend of Mr Griffiths saying he had been worried about lawsuits from his former wife, who is a Thai national. Documents related to those lawsuits were found in the apartment, they added. Read more from Sky News:UK Athletics admits causing death of Paralympian hit by poleRecord-breaking budget surplus as government's tax income rises Mr Griffiths cofounded fast-fashion retailer ASOS in 2000 and remained a large shareholder after leaving the company. A spokesperson for the Foreign, Commonwealth and Development Office said: \"We are supporting the family of a British national who has died in Thailand and are in contact with the local authorities.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "NASA says moon mission could blast off next month",
        "description": "NASA is planning to send astronauts to the moon next month for the first time in more than half a century.&#160;",
        "url": "https://news.sky.com/story/nasa-says-moon-mission-could-blast-off-next-month-13510084",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis-rocket_7148541.jpg?20260128134730",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:59:00",
        "Headline": "The space agency is aiming to send four crew members around the moon and back. If successful, it would be the first time humans have travelled there in more than 50 years.",
        "Content": "NASA is planning to send astronauts to the moon next month for the first time in more than half a century.  The Artemis ⁠II mission, which aims to send four crew members to orbit around the moon and then return home, could launch as early as 6 March, it was announced on Friday. Jared Isaacman, an administrator at the space agency, said it would be \"a big step toward America's return to the lunar environment\". However, the planned launch, from Florida's Kennedy Space Center, could be pushed back depending on final checks. The crew would become the first astronauts to fly to the moon since Apollo 17 in 1972, but there are no plans for them to land on its surface. A first rehearsal for the launch earlier this month was disrupted after a hydrogen leak was discovered. But a second test was completed on Thursday without any leaks identified after technicians replaced two seals. The 50-hour rehearsal involved fuelling the rocket ​with some 730,000 ​gallons of propellant. The Artemis missions are part of NASA's long-term plans to build a space station - called the Lunar Gateway - where astronauts would be able to live and work, and prepare for missions to Mars."
    },
    {
        "title": "At least 12 killed in Israeli strikes on Lebanon - including senior Hezbollah official",
        "description": "Israeli airstrikes have killed at least 10 people in Lebanon's Bekaa Valley and another two people in a Palestinian refugee camp, the Lebanese Health Ministry has said.",
        "url": "https://news.sky.com/story/at-least-10-killed-in-israeli-strikes-on-lebanon-including-senior-hezbollah-official-13510151",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lebanon-hezbollah_7170686.jpg?20260221004423",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 21:53:00",
        "Headline": "The strikes are among the deadliest reported in eastern Lebanon in recent weeks. ",
        "Content": "Israeli airstrikes have killed at least 10 people in Lebanon's Bekaa Valley and another two people in a Palestinian refugee camp, the Lebanese Health Ministry has said. Hezbollah has confirmed senior leader Hussein Yaghi was killed in the Bekaa attacks. He is the son of former Hezbollah MP Mohamed Yaghi, and his funeral is set to take place on Saturday, according to Hezbollah media. Twenty-four people - including three children - were also injured in the attack. Earlier on Friday, another Israeli strike hit Ain al-Hilweh - a densely populated Palestinian refugee camp near Sidon, killing the two people. The strikes are among the deadliest reported in eastern Lebanon in recent weeks and risk rupturing a US-brokered ceasefire between Israel and Hezbollah, strained by frequent accusations of violations. In a post on X on Friday evening, the Israel Defence Forces (IDF) said: \"STRUCK: Hezbollah command centers used to advance terror attacks against IDF troops and Israel, in the Baalbek area in Lebanon. \"Within the command centers, weapons and funds utilized by Hezbollah were being stored, constituting a violation of the understandings between Israel.\" Referring to the separate strike, the IDF posted hours earlier: \"In response to repeated ceasefire violations, the IDF struck a Hamas command center, from which terrorists operated, in the Ain al-Hilweh area in southern Lebanon.\" Israeli airstrikes in several areas of southern Lebanon early on Thursday morning targeted Hezbollah weapon depots, missile launchers, and other military sites, the IDF said, as reported by The Times of Israel. Read more from Sky News:How Iran might be preparing itself for a potential US strikeNASA says moon mission could blast off next month The strikes were the latest in the Israeli military's campaign against Hezbollah. There have been frequent airstrikes as the military says the terror group continues to try to rebuild its capabilities, contravening the US-brokered ceasefire in November 2024. The truce came after more than a year of war along the border. This included two months of open conflict in which a ground operation in Lebanon's south was carried out by the IDF as it sought to enable the safe return of some 60,000 displaced residents of northern Israel. Hezbollah started attacking Israel on 8 October 2023 - a day after Hamas's invasion of southern Israel, which triggered the war in Gaza. The ground invasion of southern Lebanon, launched in September 2024, significantly damaged the terror group's leadership and stripped back its military capabilities. Israel and Hezbollah were required to withdraw from southern Lebanon, to be replaced by the Lebanese armed forces. Israel has left all but five strategic posts along the border, The Times of Israel reports. The IDF said more than 400 Hezbollah operatives and members of allied terror groups have been killed in strikes since the ceasefire. The Israeli military says it has struck hundreds of Hezbollah sites and has carried out over 1,200 raids and other small operations in southern Lebanon."
    },
    {
        "title": "Undercover Thai police go dancing in lion costume to catch serial burglar",
        "description": "Thai police went undercover in a traditional lion costume in order to get close enough to a serial burglar to pounce on them and arrest them.",
        "url": "https://news.sky.com/story/undercover-thai-police-go-dancing-in-lion-costume-to-catch-serial-burglar-13509831",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-thailand-lion-dancers_7169935.jpg?20260220075708",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 06:42:00",
        "Headline": "Bangkok police footage shows officers dressed in a red-and-gold lion costume dancing towards the suspect as he walks through a Lunar New Year fair.",
        "Content": "Thai police went undercover in a traditional lion costume in order to get close enough to a serial burglar to pounce on them and arrest them. Footage released by the Bangkok police department shows officers dressed in a red-and-gold lion costume dancing towards the suspect as he walked through a Lunar New Year fair on Wednesday. The officer wearing the lion's papier-mache head then leaps at the suspect and quickly pins him to the ground at the temple in Nonthaburi, a province covering part of the Bangkok conurbation. Police said the suspect, a 33-year-old man, is accused of breaking into the home of a local police commander in Bangkok three times earlier this month. He is suspected of making off with valuables worth around 2 million baht (£47,700). Police said they had attempted to arrest the man several times, but he had spotted the officers sent after him and run off. They later identified him by tracing stolen amulets he had sold and learned he frequently visited temples in Nonthaburi. Lion dancers are often part of the Lunar New Year, and the custom allowed the officers to go undercover for the operation. Read more from Sky News:Trump: Release the alien filesDrones armed with lasers to tackle illegal rubbish dumps Police said the suspect confessed to the burglaries, saying he stole to buy drugs and gamble. The force said he had previously been convicted of drug-related offences and burglary."
    },
    {
        "title": "Barcelona's Sagrada Familia reaches maximum height as cross is placed on Tower of Jesus Christ",
        "description": "Barcelona's soaring Sagrada Familia basilica reached its maximum height on Friday, as a crane placed the upper arm of a cross atop the Tower of Jesus Christ.",
        "url": "https://news.sky.com/story/barcelonas-sagrada-familia-reaches-maximum-height-as-cross-is-placed-on-tower-of-jesus-christ-13510001",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sagrada-familia-barcelona_7170177.jpg?20260220143605",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:35:00",
        "Headline": "Topping the central tower has been a priority ahead of celebrations this June, marking the centenary of architect Antoni Gaudi's death.",
        "Content": "Barcelona's soaring Sagrada Familia basilica reached its maximum height on Friday, as a crane placed the upper arm of a cross atop the Tower of Jesus Christ. The unfinished monument is already the world's tallest church, though Catalan architect Antoni Gaudi's magnum opus remains years away from completion. The church's central piece now towers 566ft above the city, the church said. Topping the central tower has been a priority ahead of celebrations this June, marking the centenary of Gaudi's death. The scaffolding surrounding the central tower is expected to be removed by June, in time for the inauguration of the Tower of Jesus Christ, the church said. The first stone of the Sagrada Familia was placed in 1882, but Gaudi never expected it to be finished in his lifetime. Only one of its multiple towers was completed when he died in 1926 at the age of 73, after being struck by a tram. In recent decades, more work was carried out on the basilica as it became a major international tourist attraction. The inside of the Tower of Jesus Christ is still being worked on, and its exterior is flanked by scaffolding and construction cranes. Read more from Sky News:Climber found guilty after girlfriend froze to death on mountainASOS pays tribute to co-founder after balcony fall death In line with Gaudi's plans, the cross has four arms so its shape can be recognised from any direction, said Sagrada Familia's rector, the Rev Josep Turull. If Barcelona's city government allow it, the original plan also includes a light beam shining from each of the cross's arms, signifying the church's role as a spiritual lighthouse, he added. Millions of tourists visit the Sagrada Familia every year, enthralled by Gaudi's radical aesthetic, combining Catholic symbolism and organic forms, with entrance fees largely funding the ongoing construction. This year, the Sagrada Familia will hold several events to celebrate the Catalan Modernist's legacy, which includes other beautiful buildings in Barcelona and elsewhere in Spain. The Sagrada Familia became the world's tallest church last October, when it rose above the spire of Germany's Ulmer Munster, a Gothic Lutheran church built over 500 years starting in 1377, which stands at 530ft. A prayer verse from the Gloria that Catholics recite at mass is at the base of the cross installed on Friday at Sagrada Familia, the church's rector said. It reads: \"You alone are the Holy One, you alone are the Lord, you alone are the Most High.\""
    },
    {
        "title": "About half of Trump's tariffs are now null and void - but his trade war is not over",
        "description": "In one respect this decision is not altogether surprising.",
        "url": "https://news.sky.com/story/about-half-of-trumps-tariffs-are-now-null-and-void-but-his-trade-war-is-not-over-13510088",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-donald-trump-tariffs_7170407.jpg?20260220173455",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2026-02-20 17:14:00",
        "Headline": "The administration may have to refund part, or perhaps even all, of the money paid under tariffs so far following the Supreme Court decision, Sky's Ed Conway says.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n In one respect this decision is not altogether surprising. The way the Supreme Court hearings were going, this seemed the most likely decision from the US judiciary. Even so, it's an enormous blow to the Trump regime. The best place to begin understanding this is to go all the way back in history to the US constitution.  At the heart of it was the notion that the president should not have the unilateral power to set taxes which, back then at least, mostly consisted of tariffs. Tariffs, in other words, needed to be decided by Congress. This wasn't just incidental; it was the cornerstone of the much-celebrated \"separation of powers\". Trump latest: Tariffs snubbed by Supreme Court The downside of this pretty clear constitutional stricture is that getting anything through Congress is often time consuming and cumbersome. So, over the decades, various exceptions were written into law to allow presidents to, say, impose emergency tariffs in the event of national security or balance of payments crises - or because of a specific issue with a particular sector. These exceptions represent a catalogue of obscure legal loopholes where the president can actually impose tariffs unilaterally without having to go through Congress. Understanding this history is quite important to understanding what has just happened. Because much of the small print of how Donald Trump has imposed tariffs thus far has come back to the president's use of these various historic loopholes. So, for instance, the Trade Expansion Act of 1962 has a clause, section 232, that says he can impose tariffs on certain sectors if there is a national security justification. The president used this clause for his tariffs on steel and aluminium As for the famous \"Liberation Day\" tariffs, they were implemented under the International Emergency Economic Powers Act (IEEPA) of 1977. This is really only supposed to be used when the country is in a national emergency of one sort or another. That, certainly, was the president's justification for the Liberation Day tariffs: trade deficits, illegal drug inflows - these, he argued, constituted a national emergency. The main development is that now we know the Supreme Court disagrees. All the IEEPA tariffs, which is to say a fair chunk, about half, of all his levies are now null and void. There is a serious question mark about whether the administration may have to refund part, or perhaps even all, of the money paid thus far under these \"Liberation Day\" tariffs. In one respect, this doesn't fundamentally change anything, insofar as it will probably just force the administration to use some of those other obscure loopholes to recoup extra levies. The White House can blame the judiciary for obstructing the course of politics. Read more from Sky News:Trump directs US government to release files on 'alien life'Trump's peace board pledges billions of dollars to Gaza However, coming as it does as the president's poll ratings slump (in no small part because tariffs are not particularly popular), there is another potential avenue, where this episode forces Trump to concede (to the extent that it would be cast as a concession) that tariffs are not working as he might have hoped. Either way, it's yet more chaos from the on-again-off-again trade war. Doubtless there will be more twists and turns to come."
    },
    {
        "title": "Trump directs US government to release files on 'alien and extraterrestrial life'",
        "description": "Donald Trump has said he will direct the Pentagon and other US agencies to release \"government files related to alien and extraterrestrial life\".",
        "url": "https://news.sky.com/story/trump-directs-us-government-to-release-files-on-alien-and-extraterrestrial-life-13509808",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-georgia-speech_7169772.jpg?20260219214120",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-20 03:12:00",
        "Headline": "It comes just hours after the US president accused Barack Obama of revealing classified information when he said that aliens \"are real\" during a podcast appearance.",
        "Content": "Donald Trump has said he will direct the Pentagon and other US agencies to release \"government files related to alien and extraterrestrial life\". In a post on Truth Social, the US president claimed his decision was \"based on the tremendous interest shown\" and called the matter \"extremely interesting and important\". He wrote: \"Based on the tremendous interest shown, I will be directing the Secretary of War, and other relevant Departments and Agencies, to begin the process of identifying and releasing government files related to alien and extraterrestrial life, unidentified aerial phenomena (UAP), and unidentified flying objects (UFOs), and any and all other information connected to these highly complex, but extremely interesting and important, matters.\" The announcement came just hours after Mr Trump accused Barack Obama of revealing classified information during an interview released on Saturday in which the former president said he believes aliens are real. Appearing on Brian Tyler Cohen's podcast, Mr Obama said: \"They're real, but I haven't seen them, and they're not being kept in Area 51. \"There's no underground facility unless there's this enormous conspiracy and they hid it from the president of the United States.\" In an Instagram post, the 64-year-old clarified that he meant \"the odds are good there's life out there\" and said he had seen \"no evidence\" of alien existence during his term in office\". When asked about Mr Obama's remarks on Thursday, Mr Trump said: \"He's not supposed to be doing that. \"He made a big mistake.\" Asked if he also thinks aliens are real, Mr Trump responded: \"I don't know if they're real or not. \"I don't have an opinion on it. I never talk about it. A lot of people do. A lot of people believe it.\" Read more from Sky News:Trump's Board of Peace pledges billions to GazaAndrew 'clearly has knowledge' on Epstein, claims US politician Earlier this week, Mr Trump's daughter-in-law, Lara Trump, suggest on the New York Post's Pod Force One podcast that the president had a speech prepared on aliens that he would deliver at the \"right time\". However, White House press secretary Karoline Leavitt laughed off any suggestion such a pre-planned speech existed. \"A speech on aliens would be news to me,\" she said."
    },
    {
        "title": "NASA astronauts were 'stranded' in space by life-threatening  mishap, report finds",
        "description": "Butch Wilmore and Suni Williams, the two NASA astronauts \"stranded\" in space, came close to catastrophe because their spacecraft wasn't ready to fly, according to a scathing report by the space agency.",
        "url": "https://news.sky.com/story/nasa-astronauts-were-stranded-in-space-by-life-threatening-mishap-report-finds-13509862",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starliner-boeing_7169995.jpg?20260220094318",
        "type": "US",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-20 08:37:00",
        "Headline": "The Boeing-built craft was on its first crewed test flight to the International Space Station when its thrusters failed, leaving it dangerously out of control.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Butch Wilmore and Suni Williams, the two NASA astronauts \"stranded\" in space, came close to catastrophe because their spacecraft wasn't ready to fly, according to a scathing report by the space agency. The investigation classed the incident as a life-threatening \"Type A mishap\", putting it on a par with the two fatal Space Shuttle disasters in 1986 and 2003. It comes as NASA prepares to launch four astronauts on a mission to loop around the moon on a rocket that has flown only once before, without humans on board. One senior NASA official said of the Starliner incident: \"We almost did have a really terrible day.\" The Boeing-built Starliner capsule was on its first crewed test flight to the International Space Station in June 2024 when its thrusters failed, leaving it dangerously out of control. Mr Wilmore and Ms Williams managed to restart the propulsion system and manually dock with the ISS. But Jared Isaacman, the new NASA chief, told a news conference: \"Had different decisions been made, had thrusters not been recovered, or had docking been unsuccessful, the outcome of this mission could have been very, very different.\" \n                  Boeing knew part in deadly UPS plane crash had failed before, report says\n                 \n                  Boeing workers reject latest offer as company says it's losing tens of millions every day\n                 \n                  Boeing to cut 17,000 jobs amid worker strike and financial losses\n                 The two astronauts had been due to spend 10 days on the ISS, but their stay was extended to nine months while NASA assessed the problem. The capsule was eventually brought back to Earth without the two astronauts, but the new report reveals there were still issues with the thrusters during re-entry. The Boeing Starliner had faced technical challenges throughout its development, including the use of flammable tape on electrical systems and a failure with the parachute system. The report said the hardware failures were compounded by leadership mistakes and a cultural breakdown between Boeing and NASA. Mr Isaacman said the capsule wasn't ready for a crewed flight. Boeing says it has driven \"significant cultural changes\" and made \"substantial progress\" on corrective actions for technical challenges since the incident. Amit Kshatriya, another senior NASA official, said: \"\"This was a really challenging event in our recent history. \"We almost did have a really terrible day.\" NASA initially failed to classify the loss of propulsion as a type A mishap, even though it met the criteria because it was a \"departure from controlled flight.\" The report said agency officials were too focused on getting an operational alternative to the Space X capsule that it relied on to shuttle crew to the ISS. NASA said it led to a risk that was inconsistent with its human spaceflight safety standards. \"The record is now being corrected,\" said Mr Isaacman. Read more from Sky News:Sky News gains rare access to Bank of England's gold vaultsUK has not agreed to let US strike Iran from British bases NASA and Boeing are still trying to work out why the thrusters failed and the Starliner won't fly again until the problem has been resolved. Mr Wilmore and Ms Williams have since retired from the agency. NASA is about to launch a crew on the first mission to loop around the moon in more than 50 years. The new SLS mega-rocket and Orion crew capsule have had a series of problems, including leaks of explosive hydrogen propellant during fuelling and issues with the spacecraft's heatshield. A countdown rehearsal last month was stopped early because hydrogen leaked from a seal between the filling hose and the rocket. Engineers replaced the seal and another countdown test on Thursday night proved successful. NASA says the heatshield has also been upgraded. The first possible launch date for the Artemis mission is 6 March. But NASA has said the crew will only launch when it's confident the rocket is ready."
    },
    {
        "title": "Tributes flood in for Grey's Anatomy star Eric Dane, who has died aged 53",
        "description": "Tributes have flooded in for actor Eric Dane, who died on Friday aged 53.",
        "url": "https://news.sky.com/story/tributes-flood-in-for-greys-anatomy-star-eric-dane-who-has-died-aged-53-13509959",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-eric-dane-death_7170084.jpg?20260220120950",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-20 11:44:00",
        "Headline": "In 2025, the actor went public with the news he had been diagnosed with ALS, later using his platform to advocate for greater awareness of the motor neurone disease.",
        "Content": "Tributes have flooded in for actor Eric Dane, who died on Friday aged 53. He had been diagnosed with with amyotrophic lateral sclerosis (ALS), a progressive neurodegenerative disease. In a statement, a representative said: \"He spent his final days surrounded by dear friends, his devoted wife, and his two beautiful daughters, Billie and Georgia, who were the centre of his world\". Dane's career took off when he joined long-running medical drama Grey's Anatomy as the much-loved Dr Mark Sloan - better known to fans as \"McSteamy\". He played the charming surgeon from 2006 until 2012. His character's mark on the still-running show was so great that Seattle Grace Hospital, where the series is set, was renamed the Grey Sloan Memorial Hospital. The actor was later cast as Cal Jacobs, the antagonist in HBO's hit, Euphoria. \n                  Eric Dane: Grey's Anatomy and Euphoria star dies aged 53\n                 \n                  Dennis the Menace plays 'greatest prank yet' as Royal Mint presses 75-year anniversary 50p coins\n                 \n                  Tetris can help tackle memories of past trauma, study finds\n                 Dane married actress Rebecca Gayheart in 2004, and they have two children. Ashton Kutcher, John Stamos, Nina Dobrev, Robert Patrick, Maria Shriver and Euphoria creator Sam Levinson are among the celebrity names who have also paid tribute to Dane. Kutcher wrote in a post on X: \"The Franklin strip fanatics fantasy football league will miss Mr Eric Dane. \"We know you'll be watching from the booth. Miss you, buddy. Let's keep fighting the fight to solve ALS.\" ALS is one of four main types of motor neurone disease, and the most common, according to the NHS. It's characterised by weakness in the arms and legs that can cause you to trip and drop things. Any form of motor neurone disease gets worse over time, requiring ongoing care from specialists including physios and speech therapists, and is usually life-shortening. There is no cure for motor neurone disease, with treatment focused on easing symptoms. Kevin McKidd, who portrays Owen Hunt on Grey's Anatomy, posted a picture of Dane to his Instagram stories, writing \"Rest in Peace, Buddy\". In 2025, Dane went public with the news he had been diagnosed with ALS, later using his platform to advocate for greater awareness of the disease. Dane and Gayheart wed in 2004, and separated in September 2017. Gayheart filed for divorce in 2018, but later filed to have the petition dismissed.In a December essay for New York magazine's The Cut, reflecting on Dane's diagnosis, Gayheart called their dynamic \"a very complicated relationship, one that's confusing for people\". She said they never got a divorce, but dated other people and lived separately. \"Our love may not be romantic, but it's a familial love.\" Read more from Sky News:'This was addiction': Parents' anger at ZuckerbergNASA astronauts were 'stranded' in space by mishap Actor Patrick Dempsey paid tribute to his Grey's Anatomy co-star, describing him as the \"funniest man\". Speaking on The Chris Evans Breakfast, Dempsey said: \"I just woke up this morning, and it was very sad to read the news. It's hard to put into words. I feel really so sad for his children. \"I was corresponding with him, we were texting, so I spoke to him about a week ago, and some friends of ours went in to see him and he was really starting to lose his ability to speak. \"He was bedridden, and it was very hard for him to swallow, so the quality of his life was deteriorating so rapidly. \"He was the funniest man - he was such a joy to work with - and I want to just remember him in that spirit, because any time he was on set, he brought so much fun to it. \"He had a great sense of humour.\""
    },
    {
        "title": "Record-breaking budget surplus as government's tax income rises",
        "description": "More money than ever has been left over in the public finances due to more tax being paid, official figures show. ",
        "url": "https://news.sky.com/story/record-breaking-budget-surplus-as-governments-tax-income-rises-13509835",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-treasury_7099199.jpg?20251203023603",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-02-20 06:54:00",
        "Headline": "There's good news for the chancellor but the road ahead is not without risks for the public finances.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n More money than ever has been left over in the public finances due to more tax being paid, official figures show.  January had the biggest budget surplus since records began in 1993, according to data from the Office for National Statistics (ONS). It meant the government received more money than it spent last month, leaving £30.4bn left over. Money blog: Every Michelin-starred restaurant with a less than £50 meal It's £15.9bn more than the surplus in January 2025, although the figures are not adjusted for inflation. The surplus is even higher than anticipated by independent forecasters the Office for Budget Responsibility (OBR) - about £6.3bn bigger. Why? \n                  Interest rate cut even more likely next month as inflation falls\n                 \n                  Unemployment hits highest rate in nearly five years\n                 \n                  Economy grows by worse-than-expected 0.1% in final quarter of 2025\n                 While there was little change in government spending, the highest-ever recorded surplus resulted from revenue being \"strongly up\" and lower interest rates, the ONS said. Self-assessed tax revenues were nearly £6bn more than planned for and capital gains tax receipts surged. Lower interest rates have meant borrowing money cost less. The cost of borrowing was £1.5bn in the month, £5bn lower than the time last year. A relief for Reeves It's been described as a \"welcome relief\" and \"good news\" for Chancellor Rachel Reeves by analysts from Big Four accounting firm PWC and economic research firm Pantheon Macroeconomics. \"This decline eases immediate pressure on the public finances\", PWC's economist Nabil Taleb said. Paying more on debt can mean public finances are more exposed to economic shocks. But the path ahead is not without hazards for Ms Reeves. The room she has to spend money before breaking her self-imposed fiscal rules - to bring down government debt and balance the budget by 2030 - has narrowed since the November budget. Lower gross domestic product readings, a key economic measure, may already have eroded the sums Ms Reeves has to spend before breaking her fiscal rules. Anaemic economic growth and a rising unemployment rate could mean tax takes stall. For more information about how we use your data and your rights, you can visit our Privacy Centre. And the January tax revenue figures could be a one-off. The month is key for the exchequer because of the influx of self-assessed income tax receipts. Further evidence economy 'picked up smartly' Good news for the economy also came in the form of retail sales, which recorded a far better than expected January. The total volume of retail sales, which measures the quantity bought, increased by 1.8% last month, the ONS said. It was the largest increase since May 2024. There continued to be \"strong\" sales at online jewellers as they reported \"demand had hit unprecedented levels\", the ONS added. Also selling well were works of art, furniture and technology, This data gave \"further evidence that economic growth picked up smartly in the New Year as budget uncertainty fades\", Pantheon's chief UK economist Rob Wood said. Retail sales figures matter as they measure household consumption, the largest expenditure in the UK economy."
    },
    {
        "title": "FA reminds Man Utd co-owner Sir Jim Ratcliffe of responsibilities after immigration comments",
        "description": "The Football Association has spoken to Manchester United co-owner Sir Jim Ratcliffe to remind him of his responsibilities as a participant in English football, Sky News understands.\n",
        "url": "https://news.sky.com/story/fa-reminds-man-utd-co-owner-sir-jim-ratcliffe-of-responsibilities-after-immigration-comments-13509375",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jim-ratcliffe-ed-conway_7163273.jpg?20260212150129",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:25:00",
        "Headline": "The founder of the INEOS chemicals group told Sky News that Britain had been \"colonised\" by immigrants who were draining resources from the state.",
        "Content": "The Football Association has spoken to Manchester United co-owner Sir Jim Ratcliffe to remind him of his responsibilities as a participant in English football, Sky News understands.\n The intervention from football's governing body follows Sir Jim's comments about immigration. The founder of the INEOS chemicals group told Sky News that Britain had been \"colonised\" by immigrants who were draining resources from the state. It is understood that the FA advised Sir Jim that he should remember his football responsibilities when taking part in media interviews. However, he will not face further action from the governing body over his remarks. Sir Jim, one of Britain's richest men but a resident of tax-free Monaco, had told Sky News: \"You can't have an economy with nine million people on benefits and huge levels of immigrants coming in. \"I mean, the UK has been colonised. It's costing too much money. The UK has been colonised by immigrants, really, hasn't it?\" He later said he was \"sorry that my choice of language has offended some people\". Anti-racism organisation Kick It Out expressed its disappointment that Sir Jim had not faced harsher repercussions for his comments. In a statement, it said: \"Kick It Out is disappointed that Sir Jim Ratcliffe has not been given a stronger sanction for bringing the game into disrepute. \"When speaking in any capacity, he is still a representative and co-owner of Manchester United, which has a global following. \"Unprompted, he brought the club into a TV interview where he was inaccurate with the facts and divisive with his language. \"At a time when various forces are seeking to divide society, football must stand united. We urge those in leadership positions to be mindful of the responsibility they carry. \" His comments had already prompted condemnation from leading figures in football and politics. Prime Minister Sir Keir Starmer called the comments \"offensive and wrong\" and urged the Man United co-owner to apologise. He said in a post on X: \"Britain is a proud, tolerant and diverse country. \"Jim Ratcliffe should apologise.\" Chancellor Rachel Reeves went a step further - calling the comments \"disgusting\". Ratcliffe later did apologise, saying: \"I am sorry that my choice of language has offended some people in the UK and Europe and caused concern.\" Some Man United supporters' groups were unhappy with his apology, however. Read more from Sky News:UEFA investigating alleged racist abuse against Vinicius JuniorUK Athletics admits causing death of Paralympian Preetam Singh of the Stretford Sikhs fans' group said: \"It was a very half-hearted apology, more of a justification of what he said. \"So I would expect, and I would hope, he and the club would maybe come out and make a statement with a proper apology.\" The Premier League club later made a statement distancing themselves from their co-owner's comments. They said Manchester is a city \"anyone can call home\", adding the club boasts a \"diverse group of players, staff and global community of supporters\". Some came out in support of the comments, however. Reform UK leader Nigel Farage said they were \"correct\" but had prompted a backlash because some people \"aren't quite ready for it\"."
    },
    {
        "title": "ASOS pays tribute to co-founder after death from Thailand balcony fall",
        "description": "ASOS has paid tribute to its co-founder after he died in a fall from the balcony of his apartment in Thailand.",
        "url": "https://news.sky.com/story/asos-co-founder-quentin-griffiths-dies-after-thailand-balcony-fall-13509902",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-quentin-griffiths-asos_7170016.jpg?20260220134315",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-20 10:02:00",
        "Headline": "Police said initial investigations suggest there are no indications of foul play.",
        "Content": "ASOS has paid tribute to its co-founder after he died in a fall from the balcony of his apartment in Thailand. Quentin Griffiths fell from the 17th floor of the apartment block in the seaside resort city of Pattaya on 9 February, Thai have police said. Police said initial investigations suggest there are no indications of foul play. An Asos spokesperson said: \"We're saddened to hear about the passing of Quentin, one of our original co-founders. \"He played an important role in Asos's earliest days and we're forever grateful for his contribution. Our thoughts are with his family and friends.\" Police said CCTV showed no sign of anybody entering Griffiths' apartment, where he lived alone, the force added. His body has been sent for a post-mortem, they added. The police also quoted a Thai friend of Mr Griffiths saying he had been worried about lawsuits from his former wife, who is a Thai national. Documents related to those lawsuits were found in the apartment, they added. Read more from Sky News:UK Athletics admits causing death of Paralympian hit by poleRecord-breaking budget surplus as government's tax income rises Mr Griffiths cofounded fast-fashion retailer ASOS in 2000 and remained a large shareholder after leaving the company. A spokesperson for the Foreign, Commonwealth and Development Office said: \"We are supporting the family of a British national who has died in Thailand and are in contact with the local authorities.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Record-breaking budget surplus as government's tax income rises",
        "description": "More money than ever has been left over in the public finances due to more tax being paid, official figures show. ",
        "url": "https://news.sky.com/story/record-breaking-budget-surplus-as-governments-tax-income-rises-13509835",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-treasury_7099199.jpg?20251203023603",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-02-20 06:54:00",
        "Headline": "There's good news for the chancellor but the road ahead is not without risks for the public finances.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n More money than ever has been left over in the public finances due to more tax being paid, official figures show.  January had the biggest budget surplus since records began in 1993, according to data from the Office for National Statistics (ONS). It meant the government received more money than it spent last month, leaving £30.4bn left over. Money blog: Every Michelin-starred restaurant with a less than £50 meal It's £15.9bn more than the surplus in January 2025, although the figures are not adjusted for inflation. The surplus is even higher than anticipated by independent forecasters the Office for Budget Responsibility (OBR) - about £6.3bn bigger. Why? \n                  Interest rate cut even more likely next month as inflation falls\n                 \n                  Unemployment hits highest rate in nearly five years\n                 \n                  Economy grows by worse-than-expected 0.1% in final quarter of 2025\n                 While there was little change in government spending, the highest-ever recorded surplus resulted from revenue being \"strongly up\" and lower interest rates, the ONS said. Self-assessed tax revenues were nearly £6bn more than planned for and capital gains tax receipts surged. Lower interest rates have meant borrowing money cost less. The cost of borrowing was £1.5bn in the month, £5bn lower than the time last year. A relief for Reeves It's been described as a \"welcome relief\" and \"good news\" for Chancellor Rachel Reeves by analysts from Big Four accounting firm PWC and economic research firm Pantheon Macroeconomics. \"This decline eases immediate pressure on the public finances\", PWC's economist Nabil Taleb said. Paying more on debt can mean public finances are more exposed to economic shocks. But the path ahead is not without hazards for Ms Reeves. The room she has to spend money before breaking her self-imposed fiscal rules - to bring down government debt and balance the budget by 2030 - has narrowed since the November budget. Lower gross domestic product readings, a key economic measure, may already have eroded the sums Ms Reeves has to spend before breaking her fiscal rules. Anaemic economic growth and a rising unemployment rate could mean tax takes stall. For more information about how we use your data and your rights, you can visit our Privacy Centre. And the January tax revenue figures could be a one-off. The month is key for the exchequer because of the influx of self-assessed income tax receipts. Further evidence economy 'picked up smartly' Good news for the economy also came in the form of retail sales, which recorded a far better than expected January. The total volume of retail sales, which measures the quantity bought, increased by 1.8% last month, the ONS said. It was the largest increase since May 2024. There continued to be \"strong\" sales at online jewellers as they reported \"demand had hit unprecedented levels\", the ONS added. Also selling well were works of art, furniture and technology, This data gave \"further evidence that economic growth picked up smartly in the New Year as budget uncertainty fades\", Pantheon's chief UK economist Rob Wood said. Retail sales figures matter as they measure household consumption, the largest expenditure in the UK economy."
    },
    {
        "title": "FA reminds Man Utd co-owner Sir Jim Ratcliffe of responsibilities after immigration comments",
        "description": "The Football Association has spoken to Manchester United co-owner Sir Jim Ratcliffe to remind him of his responsibilities as a participant in English football, Sky News understands.\n",
        "url": "https://news.sky.com/story/fa-reminds-man-utd-co-owner-sir-jim-ratcliffe-of-responsibilities-after-immigration-comments-13509375",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jim-ratcliffe-ed-conway_7163273.jpg?20260212150129",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:25:00",
        "Headline": "The founder of the INEOS chemicals group told Sky News that Britain had been \"colonised\" by immigrants who were draining resources from the state.",
        "Content": "The Football Association has spoken to Manchester United co-owner Sir Jim Ratcliffe to remind him of his responsibilities as a participant in English football, Sky News understands.\n The intervention from football's governing body follows Sir Jim's comments about immigration. The founder of the INEOS chemicals group told Sky News that Britain had been \"colonised\" by immigrants who were draining resources from the state. It is understood that the FA advised Sir Jim that he should remember his football responsibilities when taking part in media interviews. However, he will not face further action from the governing body over his remarks. Sir Jim, one of Britain's richest men but a resident of tax-free Monaco, had told Sky News: \"You can't have an economy with nine million people on benefits and huge levels of immigrants coming in. \"I mean, the UK has been colonised. It's costing too much money. The UK has been colonised by immigrants, really, hasn't it?\" He later said he was \"sorry that my choice of language has offended some people\". Anti-racism organisation Kick It Out expressed its disappointment that Sir Jim had not faced harsher repercussions for his comments. In a statement, it said: \"Kick It Out is disappointed that Sir Jim Ratcliffe has not been given a stronger sanction for bringing the game into disrepute. \"When speaking in any capacity, he is still a representative and co-owner of Manchester United, which has a global following. \"Unprompted, he brought the club into a TV interview where he was inaccurate with the facts and divisive with his language. \"At a time when various forces are seeking to divide society, football must stand united. We urge those in leadership positions to be mindful of the responsibility they carry. \" His comments had already prompted condemnation from leading figures in football and politics. Prime Minister Sir Keir Starmer called the comments \"offensive and wrong\" and urged the Man United co-owner to apologise. He said in a post on X: \"Britain is a proud, tolerant and diverse country. \"Jim Ratcliffe should apologise.\" Chancellor Rachel Reeves went a step further - calling the comments \"disgusting\". Ratcliffe later did apologise, saying: \"I am sorry that my choice of language has offended some people in the UK and Europe and caused concern.\" Some Man United supporters' groups were unhappy with his apology, however. Read more from Sky News:UEFA investigating alleged racist abuse against Vinicius JuniorUK Athletics admits causing death of Paralympian Preetam Singh of the Stretford Sikhs fans' group said: \"It was a very half-hearted apology, more of a justification of what he said. \"So I would expect, and I would hope, he and the club would maybe come out and make a statement with a proper apology.\" The Premier League club later made a statement distancing themselves from their co-owner's comments. They said Manchester is a city \"anyone can call home\", adding the club boasts a \"diverse group of players, staff and global community of supporters\". Some came out in support of the comments, however. Reform UK leader Nigel Farage said they were \"correct\" but had prompted a backlash because some people \"aren't quite ready for it\"."
    },
    {
        "title": "Trump directs US government to release files on 'alien and extraterrestrial life'",
        "description": "Donald Trump has said he will direct the Pentagon and other US agencies to release \"government files related to alien and extraterrestrial life\".",
        "url": "https://news.sky.com/story/trump-directs-us-government-to-release-files-on-alien-and-extraterrestrial-life-13509808",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-georgia-speech_7169772.jpg?20260219214120",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-20 03:12:00",
        "Headline": "It comes just hours after the US president accused Barack Obama of revealing classified information when he said that aliens \"are real\" during a podcast appearance.",
        "Content": "Donald Trump has said he will direct the Pentagon and other US agencies to release \"government files related to alien and extraterrestrial life\". In a post on Truth Social, the US president claimed his decision was \"based on the tremendous interest shown\" and called the matter \"extremely interesting and important\". He wrote: \"Based on the tremendous interest shown, I will be directing the Secretary of War, and other relevant Departments and Agencies, to begin the process of identifying and releasing government files related to alien and extraterrestrial life, unidentified aerial phenomena (UAP), and unidentified flying objects (UFOs), and any and all other information connected to these highly complex, but extremely interesting and important, matters.\" The announcement came just hours after Mr Trump accused Barack Obama of revealing classified information during an interview released on Saturday in which the former president said he believes aliens are real. Appearing on Brian Tyler Cohen's podcast, Mr Obama said: \"They're real, but I haven't seen them, and they're not being kept in Area 51. \"There's no underground facility unless there's this enormous conspiracy and they hid it from the president of the United States.\" In an Instagram post, the 64-year-old clarified that he meant \"the odds are good there's life out there\" and said he had seen \"no evidence\" of alien existence during his term in office\". When asked about Mr Obama's remarks on Thursday, Mr Trump said: \"He's not supposed to be doing that. \"He made a big mistake.\" Asked if he also thinks aliens are real, Mr Trump responded: \"I don't know if they're real or not. \"I don't have an opinion on it. I never talk about it. A lot of people do. A lot of people believe it.\" Read more from Sky News:Trump's Board of Peace pledges billions to GazaAndrew 'clearly has knowledge' on Epstein, claims US politician Earlier this week, Mr Trump's daughter-in-law, Lara Trump, suggest on the New York Post's Pod Force One podcast that the president had a speech prepared on aliens that he would deliver at the \"right time\". However, White House press secretary Karoline Leavitt laughed off any suggestion such a pre-planned speech existed. \"A speech on aliens would be news to me,\" she said."
    },
    {
        "title": "NASA says moon mission could blast off next month",
        "description": "NASA is planning to send astronauts to the moon next month for the first time in more than half a century.&#160;",
        "url": "https://news.sky.com/story/nasa-says-moon-mission-could-blast-off-next-month-13510084",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nasa-artemis-rocket_7148541.jpg?20260128134730",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-20 16:59:00",
        "Headline": "The space agency is aiming to send four crew members around the moon and back. If successful, it would be the first time humans have travelled there in more than 50 years.",
        "Content": "NASA is planning to send astronauts to the moon next month for the first time in more than half a century.  The Artemis ⁠II mission, which aims to send four crew members to orbit around the moon and then return home, could launch as early as 6 March, it was announced on Friday. Jared Isaacman, an administrator at the space agency, said it would be \"a big step toward America's return to the lunar environment\". However, the planned launch, from Florida's Kennedy Space Center, could be pushed back depending on final checks. The crew would become the first astronauts to fly to the moon since Apollo 17 in 1972, but there are no plans for them to land on its surface. A first rehearsal for the launch earlier this month was disrupted after a hydrogen leak was discovered. But a second test was completed on Thursday without any leaks identified after technicians replaced two seals. The 50-hour rehearsal involved fuelling the rocket ​with some 730,000 ​gallons of propellant. The Artemis missions are part of NASA's long-term plans to build a space station - called the Lunar Gateway - where astronauts would be able to live and work, and prepare for missions to Mars."
    },
    {
        "title": "NASA astronauts were 'stranded' in space by life-threatening  mishap, report finds",
        "description": "Butch Wilmore and Suni Williams, the two NASA astronauts \"stranded\" in space, came close to catastrophe because their spacecraft wasn't ready to fly, according to a scathing report by the space agency.",
        "url": "https://news.sky.com/story/nasa-astronauts-were-stranded-in-space-by-life-threatening-mishap-report-finds-13509862",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starliner-boeing_7169995.jpg?20260220094318",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-20 08:37:00",
        "Headline": "The Boeing-built craft was on its first crewed test flight to the International Space Station when its thrusters failed, leaving it dangerously out of control.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Butch Wilmore and Suni Williams, the two NASA astronauts \"stranded\" in space, came close to catastrophe because their spacecraft wasn't ready to fly, according to a scathing report by the space agency. The investigation classed the incident as a life-threatening \"Type A mishap\", putting it on a par with the two fatal Space Shuttle disasters in 1986 and 2003. It comes as NASA prepares to launch four astronauts on a mission to loop around the moon on a rocket that has flown only once before, without humans on board. One senior NASA official said of the Starliner incident: \"We almost did have a really terrible day.\" The Boeing-built Starliner capsule was on its first crewed test flight to the International Space Station in June 2024 when its thrusters failed, leaving it dangerously out of control. Mr Wilmore and Ms Williams managed to restart the propulsion system and manually dock with the ISS. But Jared Isaacman, the new NASA chief, told a news conference: \"Had different decisions been made, had thrusters not been recovered, or had docking been unsuccessful, the outcome of this mission could have been very, very different.\" \n                  Boeing knew part in deadly UPS plane crash had failed before, report says\n                 \n                  Boeing workers reject latest offer as company says it's losing tens of millions every day\n                 \n                  Boeing to cut 17,000 jobs amid worker strike and financial losses\n                 The two astronauts had been due to spend 10 days on the ISS, but their stay was extended to nine months while NASA assessed the problem. The capsule was eventually brought back to Earth without the two astronauts, but the new report reveals there were still issues with the thrusters during re-entry. The Boeing Starliner had faced technical challenges throughout its development, including the use of flammable tape on electrical systems and a failure with the parachute system. The report said the hardware failures were compounded by leadership mistakes and a cultural breakdown between Boeing and NASA. Mr Isaacman said the capsule wasn't ready for a crewed flight. Boeing says it has driven \"significant cultural changes\" and made \"substantial progress\" on corrective actions for technical challenges since the incident. Amit Kshatriya, another senior NASA official, said: \"\"This was a really challenging event in our recent history. \"We almost did have a really terrible day.\" NASA initially failed to classify the loss of propulsion as a type A mishap, even though it met the criteria because it was a \"departure from controlled flight.\" The report said agency officials were too focused on getting an operational alternative to the Space X capsule that it relied on to shuttle crew to the ISS. NASA said it led to a risk that was inconsistent with its human spaceflight safety standards. \"The record is now being corrected,\" said Mr Isaacman. Read more from Sky News:Sky News gains rare access to Bank of England's gold vaultsUK has not agreed to let US strike Iran from British bases NASA and Boeing are still trying to work out why the thrusters failed and the Starliner won't fly again until the problem has been resolved. Mr Wilmore and Ms Williams have since retired from the agency. NASA is about to launch a crew on the first mission to loop around the moon in more than 50 years. The new SLS mega-rocket and Orion crew capsule have had a series of problems, including leaks of explosive hydrogen propellant during fuelling and issues with the spacecraft's heatshield. A countdown rehearsal last month was stopped early because hydrogen leaked from a seal between the filling hose and the rocket. Engineers replaced the seal and another countdown test on Thursday night proved successful. NASA says the heatshield has also been upgraded. The first possible launch date for the Artemis mission is 6 March. But NASA has said the crew will only launch when it's confident the rocket is ready."
    },
    {
        "title": "Tributes flood in for Grey's Anatomy star Eric Dane, who has died aged 53",
        "description": "Tributes have flooded in for actor Eric Dane, who died on Friday aged 53.",
        "url": "https://news.sky.com/story/tributes-flood-in-for-greys-anatomy-star-eric-dane-who-has-died-aged-53-13509959",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-eric-dane-death_7170084.jpg?20260220120950",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-20 11:44:00",
        "Headline": "In 2025, the actor went public with the news he had been diagnosed with ALS, later using his platform to advocate for greater awareness of the motor neurone disease.",
        "Content": "Tributes have flooded in for actor Eric Dane, who died on Friday aged 53. He had been diagnosed with with amyotrophic lateral sclerosis (ALS), a progressive neurodegenerative disease. In a statement, a representative said: \"He spent his final days surrounded by dear friends, his devoted wife, and his two beautiful daughters, Billie and Georgia, who were the centre of his world\". Dane's career took off when he joined long-running medical drama Grey's Anatomy as the much-loved Dr Mark Sloan - better known to fans as \"McSteamy\". He played the charming surgeon from 2006 until 2012. His character's mark on the still-running show was so great that Seattle Grace Hospital, where the series is set, was renamed the Grey Sloan Memorial Hospital. The actor was later cast as Cal Jacobs, the antagonist in HBO's hit, Euphoria. \n                  Eric Dane: Grey's Anatomy and Euphoria star dies aged 53\n                 \n                  Dennis the Menace plays 'greatest prank yet' as Royal Mint presses 75-year anniversary 50p coins\n                 \n                  Tetris can help tackle memories of past trauma, study finds\n                 Dane married actress Rebecca Gayheart in 2004, and they have two children. Ashton Kutcher, John Stamos, Nina Dobrev, Robert Patrick, Maria Shriver and Euphoria creator Sam Levinson are among the celebrity names who have also paid tribute to Dane. Kutcher wrote in a post on X: \"The Franklin strip fanatics fantasy football league will miss Mr Eric Dane. \"We know you'll be watching from the booth. Miss you, buddy. Let's keep fighting the fight to solve ALS.\" ALS is one of four main types of motor neurone disease, and the most common, according to the NHS. It's characterised by weakness in the arms and legs that can cause you to trip and drop things. Any form of motor neurone disease gets worse over time, requiring ongoing care from specialists including physios and speech therapists, and is usually life-shortening. There is no cure for motor neurone disease, with treatment focused on easing symptoms. Kevin McKidd, who portrays Owen Hunt on Grey's Anatomy, posted a picture of Dane to his Instagram stories, writing \"Rest in Peace, Buddy\". In 2025, Dane went public with the news he had been diagnosed with ALS, later using his platform to advocate for greater awareness of the disease. Dane and Gayheart wed in 2004, and separated in September 2017. Gayheart filed for divorce in 2018, but later filed to have the petition dismissed.In a December essay for New York magazine's The Cut, reflecting on Dane's diagnosis, Gayheart called their dynamic \"a very complicated relationship, one that's confusing for people\". She said they never got a divorce, but dated other people and lived separately. \"Our love may not be romantic, but it's a familial love.\" Read more from Sky News:'This was addiction': Parents' anger at ZuckerbergNASA astronauts were 'stranded' in space by mishap Actor Patrick Dempsey paid tribute to his Grey's Anatomy co-star, describing him as the \"funniest man\". Speaking on The Chris Evans Breakfast, Dempsey said: \"I just woke up this morning, and it was very sad to read the news. It's hard to put into words. I feel really so sad for his children. \"I was corresponding with him, we were texting, so I spoke to him about a week ago, and some friends of ours went in to see him and he was really starting to lose his ability to speak. \"He was bedridden, and it was very hard for him to swallow, so the quality of his life was deteriorating so rapidly. \"He was the funniest man - he was such a joy to work with - and I want to just remember him in that spirit, because any time he was on set, he brought so much fun to it. \"He had a great sense of humour.\""
    },
    {
        "title": "Eric Dane: Grey's Anatomy and Euphoria star dies aged 53",
        "description": "Actor Eric Dane, best known for his roles in TV series Grey's Anatomy and Euphoria, has died aged 53.",
        "url": "https://news.sky.com/story/eric-dane-greys-anatomy-and-euphoria-star-dies-aged-53-13509807",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-eric-dane-actor_7169862.jpg?20260220031436",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-20 03:02:00",
        "Headline": "Described as \"determined to make a difference for others\" with ALS disease, his representatives said he would be \"lovingly remembered\" and \"deeply missed\".",
        "Content": "Actor Eric Dane, best known for his roles in TV series Grey's Anatomy and Euphoria, has died aged 53. His representatives said he died from amyotrophic lateral sclerosis (ALS), known also as Lou Gehrig's disease. Dane announced his diagnosis last year, and had become an advocate for ALS awareness before his death. \"He spent his final days surrounded by dear friends, his devoted wife, and his two beautiful daughters, Billie and Georgia, who were the centre of his world,\" said a statement. Described as \"determined to make a difference for others\" with the disease, his representatives said he would be \"lovingly remembered\" and \"deeply missed\". \"Eric adored his fans and is forever grateful for the outpouring of love and support he's received,\" they added. ALS is one of four main types of motor neurone disease, and the most common, according to the NHS. It's characterised by weakness in the arms and legs that can cause you to trip and drop things. Any form of motor neurone disease gets worse over time, requiring ongoing care from specialists including physios and speech therapists, and is usually life-shortening. There is no cure for motor neurone disease, with treatment focused on easing symptoms. Read more from Sky News:Andrew released after arrestSky News gains rare access to Bank's gold vaults Dane starred in ABC medical drama Grey's Anatomy from 2006 until 2012, and reprised his role in 2021. He was also celebrated for his part in HBO's Euphoria. Other appearances included Saved By The Bell, Gideon's Crossing, Marley & Me, and X-Men: The Last Stand. He was married to Rebecca Gayheart, a fellow actor and model. His memoir is due to be published later this year."
    }
]