[
    {
        "title": "Eurostar passengers brace for further disruption after day of cancellations",
        "description": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
        "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122308.jpg?20251230164934",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 22:39:00",
        "Headline": "Train services to and from continental Europe were suspended for much of Tuesday after a power supply failure due to a technical fault.",
        "Content": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday. Train services to and from continental Europe - on both Eurostar and Le Shuttle - were suspended for much of the day after a power supply failure due to a technical fault and a failed Le Shuttle blocking all routes. The disruption upended New Year's plans for thousands of passengers in London, Paris, Brussels and Amsterdam during ⁠one of the busiest travel weeks of the year. Repairs are under way to try to fix the issue. Eurostar said it was resuming some of its services gradually around 3pm on Tuesday, but passengers were urged to stay away. As of the early hours of Friday, the first Eurostar trains to Paris, Brussels, and Amsterdam around 6am show as cancelled, while Le Shuttle records delays of at least an hour to people's booked departure times. Eurostar told passengers: \"As the overhead power supply issues in the Channel Tunnel still remain, only one line is available to run trains on. \"This means there will continue to be delays and longer journey times than usual this evening. \"Therefore, we continue to advise our customers to rebook their journey for another day if possible, with free exchanges available. \"We also advise customers not to come to our stations if their trains have already been cancelled.\" It added: \"Although outside of our control, we apologise for the disruption today and will continue to keep customers updated with the latest information and support them with rescheduling their bookings.\" Getlink, which operates the tunnel infrastructure, said repairs to the power supply were under way and that traffic services were slowly being restored in both directions. \"Our teams are working to restore the situation as quickly as possible. Waiting times will be adjusted throughout the day,\" the company added. \"Eurotunnel apologises for the inconvenience and thanks its customers for their patience and understanding.\" The Channel Tunnel accommodates Eurostar services as well as LeShuttle vehicle-carrying trains between the UK and France. Read more:Passengers' rights after Channel Tunnel disruptionFamilies devastated over ruined New Year trips Among those affected was cancer patient Ethlyn Buckmire, who had spent £3,500 on her son's dream 10th birthday trip to Disneyland, only for their train to be turned away at the Channel Tunnel. Ms Buckmire told Sky News she did not take out travel insurance because her cancer diagnosis made the premiums too expensive. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Another family, from Nigeria, faced being \"stranded\" in London without a hotel after their Paris-bound train was also turned back."
    },
    {
        "title": "Travel disrupted by Channel Tunnel chaos? Here are your rights",
        "description": "If you're one of the many passengers whose holiday travel plans have been dashed by Channel Tunnel chaos, this is the help and compensation you should be getting. ",
        "url": "https://news.sky.com/story/travel-disrupted-by-channel-tunnel-chaos-here-are-your-rights-13488772",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-travel_7122388.jpg?20251230190357",
        "type": "Home",
        "Author": "Brad Young",
        "Date Published": "2025-12-30 18:52:00",
        "Headline": "Hundreds of passengers faced disappointment and delay after a power fault halted trains. From accommodation to refunds, here's what those impacted are entitled to.",
        "Content": "\n          Live news reporter\n              @bradley_jyoung\n If you're one of the many passengers whose holiday travel plans have been dashed by Channel Tunnel chaos, this is the help and compensation you should be getting.  Eurostar rules Under Eurostar's customer charter, travellers have a choice of three options in the event of cancellations or delays of an hour or more. The options are: Exchange your booking to travel in the same class at a different time or date; E-voucher: Cancel your booking and claim a voucher, to be redeemed within 12 months from eurostar.com; Refund: Cancel your booking and claim a refund for the value of your ticket (but not for any booking or exchange fees). \n                  Eurostar passengers brace for further disruption after day of cancellations\n                 \n                  Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says\n                 \n                  Eurostar chaos leaves cancer patient set to lose £3.5k\n                 Eurostar says passengers have three months to decide which option to take. Refunds will be processed within 28 days. If a customer travels on the next available service the same day, they are also entitled to claim delay compensation. Stuck overnight? If you cannot continue your journey on the day of travel, Eurostar says it \"may\" be able to cover expenses incurred as a direct result of the delayed or cancelled train. This includes overnight accommodation; food; transport between the station and your accommodation; and the cost of calling anyone who was waiting for you at your destination. To claim, you'll need to fill in a form on Eurostar's website, so make sure you have your tickets, receipts and bank details to hand. LeShuttle rules Drivers using this service are entitled to a full refund in the event of cancellation. The rules for delays are less generous, with customers offered a voucher if they've waited for an hour or more. This is where travel insurance comes in handy, often facilitating claims against advanced bookings like hotels and activities - so check if you're covered. What does the government say? Shadow transport secretary Richard Holden has called on the government to ensure passengers are \"properly compensated\" for the \"chaos\". Department for Transport guidance stipulates that when trains are delayed for more than an hour, passengers should be offered: Meals and refreshments \"in reasonable relation to the waiting time\" if these are available on the train or station or can be reasonably supplied; Accommodation and transport when an overnight stay is necessary. What does \"reasonable\" mean? When disruption causes delays to a \"very large number of passengers\", it is not considered reasonable to expect an operator to distribute refreshments, according to the DfT. Operators should put in place alternatives, such as a voucher system, it says. Read more:Eurostar chaos leaves cancer patient set to lose £3.5kMan arrested after hospital staff attacked with weapon LNER free travel offer Anyone who had to abandon their journey to London King's Cross on an LNER train due to the disruption on Tuesday is allowed to travel back home for free using the same ticket, the East Coast Main Line operator said. Customers choosing to defer their Eurostar travel to a different day may also use their existing LNER ticket to travel."
    },
    {
        "title": "JFK's granddaughter Tatiana Schlossberg dies aged 35 ",
        "description": "John F Kennedy's granddaughter Tatiana Schlossberg has died at the age of 35, just a month after revealing her terminal cancer diagnosis.",
        "url": "https://news.sky.com/story/jfks-granddaughter-tatiana-schlossberg-dies-aged-35-13488780",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tatiana-schlossberg_7089323.jpg?20251123115034",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 19:28:00",
        "Headline": "The 35-year-old's death comes just a month after she shared her terminal cancer diagnosis in an essay which criticised her relative, current US health secretary Robert F Kennedy Jr.",
        "Content": "John F Kennedy's granddaughter Tatiana Schlossberg has died at the age of 35, just a month after revealing her terminal cancer diagnosis. A post on the JFK Library Foundation's Instagram account said Ms Schlossberg, the daughter of former US ambassador Caroline Kennedy, died on Tuesday. \"Our beautiful Tatiana passed away this morning,\" it read. \"She will always be in our hearts.\" The post was signed off as being from Ms Schlossberg's husband, George, and their two children, Edwin and Josephine, as well as her parents and siblings. The 35-year-old's father is designer and artist Edwin Schlossberg. She had one brother, Jack, and a sister, Rose, who donated stem cells for her cancer treatment. Ms Schlossberg, an environmental journalist, attacked her relative Robert F Kennedy Jr as she revealed her cancer diagnosis on the anniversary of JFK's assassination in November. She said measures backed by RFK Jr, a long-time vaccine critic, could hurt cancer patients. \n                  A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?\n                 \n                  Alleged strikes on Vladimir Putin residence 'not good', Donald Trump says\n                 \n                  It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all\n                 Ms Schlossberg wrote in an essay for The New Yorker: \"As I spent more and more of my life under the care of doctors, nurses, and researchers striving to improve the lives of others, I watched as Bobby cut nearly a half billion dollars for research into mRNA vaccines, technology that could be used against certain cancers.\" After the birth of her second child, a doctor noticed her high white blood cell count, which turned out to be acute myeloid leukaemia with a rare mutation. Ms Schlossberg wrote she has undergone rounds of chemotherapy, two stem cell transplants and participated in clinical trials. She also spoke of fearing her young children would not remember her."
    },
    {
        "title": "Two trains carrying tourists to Machu Picchu crash - as one person killed",
        "description": "At least one person has been killed and around 30 passengers have been injured after two trains taking tourists to Machu Picchu in Peru crashed.",
        "url": "https://news.sky.com/story/two-trains-carrying-tourists-to-machu-picchu-crash-as-one-person-killed-13488953",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peru-machu-picchu_7122788.jpg?20251231001657",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 23:58:00",
        "Headline": "The collision involved a train coming from the famed archaeological site and a train headed there in the early afternoon near Qoriwayrachina, also an archaeological site, according to the company operating the railway.",
        "Content": "At least one person has been killed and around 30 passengers have been injured after two trains taking tourists to Machu Picchu in Peru crashed. The collision involved a train coming from the famed archaeological site and a train headed there in the early afternoon near Qoriwayrachina, also an archaeological site, according to the company operating the railway. The person who was killed was a railway worker, Jhonathan Castillo Gonzalez, a captain with the police department in the nearby city of Cuzco, said. He said that train services along the line connecting Machu Picchu with Cuzco were suspended after the accident. Authorities have not shared details regarding the cause of the crash. Footage shared by local media showed train carriages with broken windows and dented sides, which were stuck on tracks set between a forest and a rock wall. Around 1.5 million people flock to Machu Picchu every year, most of whom arrive by train. \n                  Two British women complete record-breaking row across Pacific Ocean\n                 \n                  Rocks on train tracks leave 900 Machu Picchu tourists stranded due to protest\n                 \n                  Three Scottish brothers set new world record for 9,000-mile row across Pacific Ocean\n                 The archaeological site was built by the Incas in the 15th century and served as a sanctuary for the Inca emperors. Machu Picchu is known for its dry-stone brick walls and its three primary structures, including the Temple of the Sun."
    },
    {
        "title": "Israel suspends 37 aid organisations from operating in Gaza",
        "description": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules.",
        "url": "https://news.sky.com/story/israel-suspends-37-aid-organisations-from-operating-in-gaza-13488815",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gaza-palestinians_7122544.jpg?20251230211645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 20:54:00",
        "Headline": "The groups have criticised the timing of the suspension, with one saying \"the needs in Gaza are enormous\" despite the ceasefire.",
        "Content": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules. Israel has said the rules are aimed at preventing Hamas and other militant groups from infiltrating the aid organisations - but the relief agencies have said the ban will harm the enclave's population, which remains desperately in need of aid. Under the new regulations, any organisation that has called for boycotts against Israel, denied the October 7 attack or shared support for any of the court cases against Israeli leaders or soldiers can be disqualified from working in the Gaza Strip. Another requirement is for aid groups to register the names of their workers. Israel's Ministry of Diaspora Affairs has said 37 groups failed to comply with the rules and will be suspended. This is roughly 15% of the organisations operating in Gaza. It said Doctors Without Borders, also known by its French acronym MSF, has failed to respond to Israeli claims that some of its workers were associated with Hamas or Islamic Jihad. MSF has denied the accusations about their staff. It also said Israel's decision will have a catastrophic impact in Gaza, where they support around 20% of hospital beds and a third of births. \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 \n                  'We will finish Hamas if they don't give us Rani,' says mother of last Israeli hostage in Gaza\n                 \n                  The year America changed - 2025 in review\n                 Other suspended groups include Action Against Hunger, ActionAid and CARE. While Israel has alleged the move will have a limited impact on the ground, the affected organisations say the timing is devastating. Read more:Pope laments suffering in GazaIsrael approves new West Bank settlements Shaina Low, from the now-suspended Norwegian Refugee Council, said: \"Despite the ceasefire, the needs in Gaza are enormous.\" \"Not being able to send staff into Gaza means all of the workload falls on our exhausted local staff,\" she continued. The fragile ceasefire has been in place since October. Some of the groups have said they did not meet Israel's demand for information on their Palestinian staff due to fears they could be targeted by Israel, and because of European data protection laws. Israel has said the groups will have their licences revoked on 1 January and if they are located in Israel, they must leave by 1 March. They can appeal the decisions. Israeli fire kills 10-year-old, hospital says The suspension comes as the Shifa Hospital said on Tuesday that Israeli fire had killed a 10-year-old girl and wounded another person in Gaza City near the yellow line that delineates areas under Israeli control. The Israeli military did not immediately comment on the incident but has said troops operating near the yellow line would target anyone who approached or threatened soldiers. The Gaza Health Ministry said on Monday that 71,266 Palestinians have been killed in Gaza. This total did not include the girl. The ministry, part of the Hamas-run government, does not differentiate between civilians and combatants. The United Nations and independent experts consider the Health Ministry the most reliable source on war casualties. Israel disputes its figures but has not provided its own."
    },
    {
        "title": "Tory shadow minister accused of 'conflict of interest' over Abramovich case",
        "description": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him.",
        "url": "https://news.sky.com/story/tory-shadow-minister-accused-of-conflict-of-interest-over-abramovich-case-13488724",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-roman-abramovich-chelsea-sale_6933801.jpg?20250603143334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:55:00",
        "Headline": "The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\".",
        "Content": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him. Justice minister Jake Richards told Sky News Lord Wolfson needs to \"do one or the other\" - serve Kemi Badenoch on her shadow front bench or work for Mr Abramovich. The Russian businessman is caught up in a legal battle with the Jersey government after it launched an investigation into the source of more than £5.3bn in assets linked to him which are held there. According to several reports, the legal action is said to be delaying the release of funds from Mr Abramovich's sale of Chelsea FC, which the UK Government wants to see used to help rebuild Ukraine after the war ends. The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\". But speaking to Sky's political correspondent Mhari Aurora, Mr Richards said the story \"stinks to high heaven\" and Ms Badenoch, the Conservative Party leader, \"should be taking action rather than just ignoring it\". He said: \"We have a situation where the shadow attorney general, one of the senior members of the shadow cabinet... is working for Roman Abramovich. \n                  Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah\n                 \n                  Cabinet Office blames 'administrative error' over mistaken release of historical Andrew documents\n                 \n                  Angola and Namibia agree to take back illegal migrants and criminals\n                 \"Abramovich, as many of your viewers will no doubt know, has a lot of money and we, the government, are trying to take action to recover some of those assets which were gained from Putin's Russia to help with the Ukrainian war effort. \"We think it cannot be right that the shadow attorney general on the one hand is advising Kemi Badenoch about this issue and on the other hand is getting paid by Roman Abramovich to do the same. There's a clear conflict of interest.\" The Conservatives have argued that lawyers take on cases regardless of who their client is, pointing out that Labour's attorney general, Richard Hermer, has previously represented Shamima Begum and Gerry Adams. However, Mr Richards said Labour \"are nor criticising Lord Wolfson for taking on this case, we're saying he can't take on this case and serve as a shadow attorney general\". He said: \"We have an attorney general at the moment who has represented lots of clients in the past but he's now serving as a frontline politician so he doesn't do both at the same time. \"Lord Wolfson has to choose one or the other. Is he working for the Conservative Party and His Majesty's opposition or is he working for Roman Abramovich? He shouldn't be able to do both.\" This comes after Mr Richards wrote to Ms Badenoch asking whether Lord Wolfson had recused himself from any party policy regarding the former Chelsea owner's assets. He also asked her to clarify whether the opposition was aligned with the government position that Mr Abramovich must transfer more than £2.5bn to benefit the people of Ukraine. A Conservative Party spokesman said: \"Lord Wolfson is instructed in on-going legal proceedings in Jersey. He is not instructed on the Chelsea FC matter. \"Jake Richards' comments are pure politics, and they show Labour still does not understand how the Bar works. Barristers act for clients, not causes.\" They added: \"And it's a bit rich from this government. Labour should stop throwing mud. Their own Attorney General has acted for Gerry Adams and involved himself in the Shamima Begum case. This is rank hypocrisy. \"The Conservative Party led the way on supporting Ukraine and we remain committed to their cause. To suggest anything else is just Labour sinking to new depths.\""
    },
    {
        "title": "Eurostar chaos leaves cancer patient set to lose £3.5k",
        "description": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday. ",
        "url": "https://news.sky.com/story/eurostar-chaos-leaves-cancer-patient-set-to-lose-16335k-as-another-family-is-stranded-in-london-13488738",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122310.jpg?20251230165018",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 16:19:00",
        "Headline": "An issue in the Channel Tunnel led to the cancellation of almost all Eurostar services to and from London just one day before New Year's Eve. ",
        "Content": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday.  The train network was forced to cancel almost all of its London-Europe services after issues in the Channel Tunnel, including a failed Le Shuttle train. The Buckmire Edwards family left King's Cross St Pancras at 7am only to be stranded \"for hours and hours\" outside the Channel Tunnel. They were later brought back to London. Eurostar latest: Channel Tunnel partially reopens Mum Ethlyn told Sky News she had spent £3,500 on a dream trip to Disneyland to celebrate her son's 10th birthday with her partner and 10-month-old baby. She said they did not take out travel insurance because her cancer diagnosis made the premiums too expensive - so they now face losing all the money. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Dante, nine, said: \"It's been quite a journey because ever since my mum has been through cancer, she has been having a baby, chemotherapy, she has still coped, so I think she is doing a very great job.\" \"I'm very proud of this journey that she has been through,\" he added. Family 'stranded' with no hotel booking While the Buckmire Edwards said they would return to their London home, passengers from further afield faced being stranded in the capital just one day before New Year's Eve. Charles Nduka-Eze said his family, from Nigeria, were having \"a complete disaster\" after their Paris-bound train was turned back to London. The group had checked out of a London hotel and had already paid for their hotel rooms in the French capital, as well as tickets for Disneyland and river cruises. Read more: Travel disrupted? Here are your rights Speaking at King's Cross St Pancras, he said: \"I'm not concerned about the refund for now, I'm thinking about what to do. \"We don't know what's going on so I've got a sister over there trying to find out what's the next thing to do because we're just confused, to be honest.\" His sister added that the group were now \"stranded\". 'Romance on hold' as NYE minibreak is ruined Meanwhile, a man travelling to Paris for New Year's Eve with his partner said \"We'll have to put romance on hold.\" John Paul, from Peterborough, was gifted the trip as a surprise from his partner Lucy and the pair spent five hours on a Paris-bound train before it unexpectedly returned to London. Speaking at King's Cross St Pancras, the 46-year-old said: \"I think the thing is, at the minute, there's no clear information and obviously, we've lost a lot of money, haven't we?\" Paul said they had a river cruise in Paris and the Eiffel Tower booked for the evening. Eurostar initially told passengers to postpone their journeys, before later suspending all trains to and from London until further notice. It later said some services would resume but \"strongly advised\" all passengers to refrain from travelling. More from Sky News:Two arrested after death of elderly man hit by carAdmin 'error' blamed for Andrew document release The Eurostar trains were unable to operate due to an issue with the overhead power supply in the Channel Tunnel and a subsequent failed Le Shuttle train, which was moved from the tunnel on Tuesday afternoon. Eurostar operations across Europe were also affected. In Folkestone, Kent, queues formed as Le Shuttle services were postponed and delayed. They gradually resumed on Tuesday afternoon."
    },
    {
        "title": "Man arrested after hospital staff attacked with weapon",
        "description": "A man has been arrested after hospital staff were allegedly attacked with a weapon which police say may have been a crowbar. ",
        "url": "https://news.sky.com/story/man-arrested-after-five-people-assaulted-with-weapon-at-a-hospital-13488722",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-merseyside-newton_7122354.jpg?20251230182135",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:58:00",
        "Headline": "Police say they have arrested a 20-year-old man, originally from Afghanistan, on suspicion of five counts of wounding with intent; affray and criminal damage",
        "Content": "A man has been arrested after hospital staff were allegedly attacked with a weapon which police say may have been a crowbar.  Merseyside Police said a man is believed to have gone to Newton Community Hospital, in Newton-le-Willows, to ask for an appointment on Tuesday afternoon, but became \"increasingly agitated\" when his request was refused and he was asked to leave. A worker in a nearby shop said police were called to the scene when an injured woman fled to get help. Sugedaran Shanmugaraja said 10 or 15 police cars arrived at the scene and that nurses came into the shop to treat the woman. A 20-year-old man, who police say is originally from Afghanistan, has been arrested on suspicion of five counts of wounding with intent; affray and criminal damage. He has been taken to a police station in Merseyside and remains in custody. Officers were called to the hospital just after 12pm following reports of people being attacked with what may have been a crowbar, police said. A man is reported to have damaged a counter before assaulting people, they added. The victims are being treated by paramedics at the hospital for injuries which are not believed to be life-threatening. Read more:Two arrested after death of elderly man hit by carAdmin 'error' blamed for Andrew document release  Councillor Seve Gomez-Aspron raced to the scene after receiving a phone call from his father, who lives next to the hospital. His father had called \"to say a family friend had run to his house to tell him that someone was attacking staff within the hospital and damaging the reception area,\" he said. \"I live nearby, so I told him to call the police and I rushed to the hospital and so I got there within a few minutes. \"I can only thank Merseyside Police and North West Ambulance Service for such a swift and efficient response, running into a scenario where danger is unknown.\" Members of the public are being advised to avoid the area while enquiries continue."
    },
    {
        "title": "Thieves drill into German bank vault to steal valuables worth tens of millions of euros",
        "description": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes. ",
        "url": "https://news.sky.com/story/thieves-drill-into-german-bank-vault-to-steal-valuables-worth-tens-of-millions-of-euros-13488710",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-germany-bank-heist_7122340.jpg?20251230174628",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-30 13:58:00",
        "Headline": "The gang took advantage of the Christmas holidays and got into the building through a next door parking garage.",
        "Content": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes.  Police said the gang took advantage of the Christmas holidays to carry out the heist in the western city of Gelsenkirchen and got into the building through a next door parking garage. Witnesses saw several men carrying large bags in the stairwell of the garage overnight on Saturday, while CCTV footage - which has not been released - captured a black Audi RS 6 leaving early on Monday morning. Masked suspects, including one who operated the exit barrier, were seen inside the vehicle, which had been stolen in Hanover, around 150 miles away, according to police. A picture taken inside the ransacked bank vault shows a circular hole drilled through a thick wall with items strewn across the floor. The thieves broke into thousands of safe deposit boxes, with initial estimates placing the value of the raid between 10 and 90 million euros, according to police spokesperson Thomas Nowaczyk. A fire alarm was triggered at the bank on Saturday and police and firefighters arrived at around 6.15am but found no evidence of damage, with the break-in not discovered until Monday morning. \n                  Jail for burglars who used Grindr dating app to dupe victims\n                 \n                  Six immigration officers charged over alleged thefts from migrants\n                 \n                  Non-crime hate incidents should be scrapped, police leaders say\n                 Potential victims of the raid gathered outside the Sparkasse bank on Tuesday morning, but the doors remained locked and police told them to go home, according to local media reports. Read more from Sky News:Police looking for two men after pedestrian killed in collisionAnthony Joshua in 'stable' condition after crash A statement on the bank's website said the branch would remain closed, with details for a hotline for affected customers. \"Over the Christmas holidays, the customer safe deposit box area of the Buer branch was broken into,\" the bank said. \"More than 95% of the customer safe deposit boxes were forced open by as-yet-unknown perpetrators. \"Due to the extensive damage, customers cannot access this area until further notice.\""
    },
    {
        "title": "Eurostar passengers brace for further disruption after day of cancellations",
        "description": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
        "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122308.jpg?20251230164934",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 22:39:00",
        "Headline": "Train services to and from continental Europe were suspended for much of Tuesday after a power supply failure due to a technical fault.",
        "Content": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday. Train services to and from continental Europe - on both Eurostar and Le Shuttle - were suspended for much of the day after a power supply failure due to a technical fault and a failed Le Shuttle blocking all routes. The disruption upended New Year's plans for thousands of passengers in London, Paris, Brussels and Amsterdam during ⁠one of the busiest travel weeks of the year. Repairs are under way to try to fix the issue. Eurostar said it was resuming some of its services gradually around 3pm on Tuesday, but passengers were urged to stay away. As of the early hours of Friday, the first Eurostar trains to Paris, Brussels, and Amsterdam around 6am show as cancelled, while Le Shuttle records delays of at least an hour to people's booked departure times. Eurostar told passengers: \"As the overhead power supply issues in the Channel Tunnel still remain, only one line is available to run trains on. \"This means there will continue to be delays and longer journey times than usual this evening. \"Therefore, we continue to advise our customers to rebook their journey for another day if possible, with free exchanges available. \"We also advise customers not to come to our stations if their trains have already been cancelled.\" It added: \"Although outside of our control, we apologise for the disruption today and will continue to keep customers updated with the latest information and support them with rescheduling their bookings.\" Getlink, which operates the tunnel infrastructure, said repairs to the power supply were under way and that traffic services were slowly being restored in both directions. \"Our teams are working to restore the situation as quickly as possible. Waiting times will be adjusted throughout the day,\" the company added. \"Eurotunnel apologises for the inconvenience and thanks its customers for their patience and understanding.\" The Channel Tunnel accommodates Eurostar services as well as LeShuttle vehicle-carrying trains between the UK and France. Read more:Passengers' rights after Channel Tunnel disruptionFamilies devastated over ruined New Year trips Among those affected was cancer patient Ethlyn Buckmire, who had spent £3,500 on her son's dream 10th birthday trip to Disneyland, only for their train to be turned away at the Channel Tunnel. Ms Buckmire told Sky News she did not take out travel insurance because her cancer diagnosis made the premiums too expensive. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Another family, from Nigeria, faced being \"stranded\" in London without a hotel after their Paris-bound train was also turned back."
    },
    {
        "title": "Eurostar chaos leaves cancer patient set to lose £3.5k",
        "description": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday. ",
        "url": "https://news.sky.com/story/eurostar-chaos-leaves-cancer-patient-set-to-lose-16335k-as-another-family-is-stranded-in-london-13488738",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122310.jpg?20251230165018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 16:19:00",
        "Headline": "An issue in the Channel Tunnel led to the cancellation of almost all Eurostar services to and from London just one day before New Year's Eve. ",
        "Content": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday.  The train network was forced to cancel almost all of its London-Europe services after issues in the Channel Tunnel, including a failed Le Shuttle train. The Buckmire Edwards family left King's Cross St Pancras at 7am only to be stranded \"for hours and hours\" outside the Channel Tunnel. They were later brought back to London. Eurostar latest: Channel Tunnel partially reopens Mum Ethlyn told Sky News she had spent £3,500 on a dream trip to Disneyland to celebrate her son's 10th birthday with her partner and 10-month-old baby. She said they did not take out travel insurance because her cancer diagnosis made the premiums too expensive - so they now face losing all the money. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Dante, nine, said: \"It's been quite a journey because ever since my mum has been through cancer, she has been having a baby, chemotherapy, she has still coped, so I think she is doing a very great job.\" \"I'm very proud of this journey that she has been through,\" he added. Family 'stranded' with no hotel booking While the Buckmire Edwards said they would return to their London home, passengers from further afield faced being stranded in the capital just one day before New Year's Eve. Charles Nduka-Eze said his family, from Nigeria, were having \"a complete disaster\" after their Paris-bound train was turned back to London. The group had checked out of a London hotel and had already paid for their hotel rooms in the French capital, as well as tickets for Disneyland and river cruises. Read more: Travel disrupted? Here are your rights Speaking at King's Cross St Pancras, he said: \"I'm not concerned about the refund for now, I'm thinking about what to do. \"We don't know what's going on so I've got a sister over there trying to find out what's the next thing to do because we're just confused, to be honest.\" His sister added that the group were now \"stranded\". 'Romance on hold' as NYE minibreak is ruined Meanwhile, a man travelling to Paris for New Year's Eve with his partner said \"We'll have to put romance on hold.\" John Paul, from Peterborough, was gifted the trip as a surprise from his partner Lucy and the pair spent five hours on a Paris-bound train before it unexpectedly returned to London. Speaking at King's Cross St Pancras, the 46-year-old said: \"I think the thing is, at the minute, there's no clear information and obviously, we've lost a lot of money, haven't we?\" Paul said they had a river cruise in Paris and the Eiffel Tower booked for the evening. Eurostar initially told passengers to postpone their journeys, before later suspending all trains to and from London until further notice. It later said some services would resume but \"strongly advised\" all passengers to refrain from travelling. More from Sky News:Two arrested after death of elderly man hit by carAdmin 'error' blamed for Andrew document release The Eurostar trains were unable to operate due to an issue with the overhead power supply in the Channel Tunnel and a subsequent failed Le Shuttle train, which was moved from the tunnel on Tuesday afternoon. Eurostar operations across Europe were also affected. In Folkestone, Kent, queues formed as Le Shuttle services were postponed and delayed. They gradually resumed on Tuesday afternoon."
    },
    {
        "title": "Man arrested after hospital staff attacked with weapon",
        "description": "A man has been arrested after hospital staff were allegedly attacked with a weapon which police say may have been a crowbar. ",
        "url": "https://news.sky.com/story/man-arrested-after-five-people-assaulted-with-weapon-at-a-hospital-13488722",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-merseyside-newton_7122354.jpg?20251230182135",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:58:00",
        "Headline": "Police say they have arrested a 20-year-old man, originally from Afghanistan, on suspicion of five counts of wounding with intent; affray and criminal damage",
        "Content": "A man has been arrested after hospital staff were allegedly attacked with a weapon which police say may have been a crowbar.  Merseyside Police said a man is believed to have gone to Newton Community Hospital, in Newton-le-Willows, to ask for an appointment on Tuesday afternoon, but became \"increasingly agitated\" when his request was refused and he was asked to leave. A worker in a nearby shop said police were called to the scene when an injured woman fled to get help. Sugedaran Shanmugaraja said 10 or 15 police cars arrived at the scene and that nurses came into the shop to treat the woman. A 20-year-old man, who police say is originally from Afghanistan, has been arrested on suspicion of five counts of wounding with intent; affray and criminal damage. He has been taken to a police station in Merseyside and remains in custody. Officers were called to the hospital just after 12pm following reports of people being attacked with what may have been a crowbar, police said. A man is reported to have damaged a counter before assaulting people, they added. The victims are being treated by paramedics at the hospital for injuries which are not believed to be life-threatening. Read more:Two arrested after death of elderly man hit by carAdmin 'error' blamed for Andrew document release  Councillor Seve Gomez-Aspron raced to the scene after receiving a phone call from his father, who lives next to the hospital. His father had called \"to say a family friend had run to his house to tell him that someone was attacking staff within the hospital and damaging the reception area,\" he said. \"I live nearby, so I told him to call the police and I rushed to the hospital and so I got there within a few minutes. \"I can only thank Merseyside Police and North West Ambulance Service for such a swift and efficient response, running into a scenario where danger is unknown.\" Members of the public are being advised to avoid the area while enquiries continue."
    },
    {
        "title": "Travel disrupted by Channel Tunnel chaos? Here are your rights",
        "description": "If you're one of the many passengers whose holiday travel plans have been dashed by Channel Tunnel chaos, this is the help and compensation you should be getting. ",
        "url": "https://news.sky.com/story/travel-disrupted-by-channel-tunnel-chaos-here-are-your-rights-13488772",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-travel_7122388.jpg?20251230190357",
        "type": "UK",
        "Author": "Brad Young",
        "Date Published": "2025-12-30 18:52:00",
        "Headline": "Hundreds of passengers faced disappointment and delay after a power fault halted trains. From accommodation to refunds, here's what those impacted are entitled to.",
        "Content": "\n          Live news reporter\n              @bradley_jyoung\n If you're one of the many passengers whose holiday travel plans have been dashed by Channel Tunnel chaos, this is the help and compensation you should be getting.  Eurostar rules Under Eurostar's customer charter, travellers have a choice of three options in the event of cancellations or delays of an hour or more. The options are: Exchange your booking to travel in the same class at a different time or date; E-voucher: Cancel your booking and claim a voucher, to be redeemed within 12 months from eurostar.com; Refund: Cancel your booking and claim a refund for the value of your ticket (but not for any booking or exchange fees). \n                  Eurostar passengers brace for further disruption after day of cancellations\n                 \n                  Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says\n                 \n                  Eurostar chaos leaves cancer patient set to lose £3.5k\n                 Eurostar says passengers have three months to decide which option to take. Refunds will be processed within 28 days. If a customer travels on the next available service the same day, they are also entitled to claim delay compensation. Stuck overnight? If you cannot continue your journey on the day of travel, Eurostar says it \"may\" be able to cover expenses incurred as a direct result of the delayed or cancelled train. This includes overnight accommodation; food; transport between the station and your accommodation; and the cost of calling anyone who was waiting for you at your destination. To claim, you'll need to fill in a form on Eurostar's website, so make sure you have your tickets, receipts and bank details to hand. LeShuttle rules Drivers using this service are entitled to a full refund in the event of cancellation. The rules for delays are less generous, with customers offered a voucher if they've waited for an hour or more. This is where travel insurance comes in handy, often facilitating claims against advanced bookings like hotels and activities - so check if you're covered. What does the government say? Shadow transport secretary Richard Holden has called on the government to ensure passengers are \"properly compensated\" for the \"chaos\". Department for Transport guidance stipulates that when trains are delayed for more than an hour, passengers should be offered: Meals and refreshments \"in reasonable relation to the waiting time\" if these are available on the train or station or can be reasonably supplied; Accommodation and transport when an overnight stay is necessary. What does \"reasonable\" mean? When disruption causes delays to a \"very large number of passengers\", it is not considered reasonable to expect an operator to distribute refreshments, according to the DfT. Operators should put in place alternatives, such as a voucher system, it says. Read more:Eurostar chaos leaves cancer patient set to lose £3.5kMan arrested after hospital staff attacked with weapon LNER free travel offer Anyone who had to abandon their journey to London King's Cross on an LNER train due to the disruption on Tuesday is allowed to travel back home for free using the same ticket, the East Coast Main Line operator said. Customers choosing to defer their Eurostar travel to a different day may also use their existing LNER ticket to travel."
    },
    {
        "title": "Tory shadow minister accused of 'conflict of interest' over Abramovich case",
        "description": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him.",
        "url": "https://news.sky.com/story/tory-shadow-minister-accused-of-conflict-of-interest-over-abramovich-case-13488724",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-roman-abramovich-chelsea-sale_6933801.jpg?20250603143334",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:55:00",
        "Headline": "The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\".",
        "Content": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him. Justice minister Jake Richards told Sky News Lord Wolfson needs to \"do one or the other\" - serve Kemi Badenoch on her shadow front bench or work for Mr Abramovich. The Russian businessman is caught up in a legal battle with the Jersey government after it launched an investigation into the source of more than £5.3bn in assets linked to him which are held there. According to several reports, the legal action is said to be delaying the release of funds from Mr Abramovich's sale of Chelsea FC, which the UK Government wants to see used to help rebuild Ukraine after the war ends. The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\". But speaking to Sky's political correspondent Mhari Aurora, Mr Richards said the story \"stinks to high heaven\" and Ms Badenoch, the Conservative Party leader, \"should be taking action rather than just ignoring it\". He said: \"We have a situation where the shadow attorney general, one of the senior members of the shadow cabinet... is working for Roman Abramovich. \n                  Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah\n                 \n                  Cabinet Office blames 'administrative error' over mistaken release of historical Andrew documents\n                 \n                  Angola and Namibia agree to take back illegal migrants and criminals\n                 \"Abramovich, as many of your viewers will no doubt know, has a lot of money and we, the government, are trying to take action to recover some of those assets which were gained from Putin's Russia to help with the Ukrainian war effort. \"We think it cannot be right that the shadow attorney general on the one hand is advising Kemi Badenoch about this issue and on the other hand is getting paid by Roman Abramovich to do the same. There's a clear conflict of interest.\" The Conservatives have argued that lawyers take on cases regardless of who their client is, pointing out that Labour's attorney general, Richard Hermer, has previously represented Shamima Begum and Gerry Adams. However, Mr Richards said Labour \"are nor criticising Lord Wolfson for taking on this case, we're saying he can't take on this case and serve as a shadow attorney general\". He said: \"We have an attorney general at the moment who has represented lots of clients in the past but he's now serving as a frontline politician so he doesn't do both at the same time. \"Lord Wolfson has to choose one or the other. Is he working for the Conservative Party and His Majesty's opposition or is he working for Roman Abramovich? He shouldn't be able to do both.\" This comes after Mr Richards wrote to Ms Badenoch asking whether Lord Wolfson had recused himself from any party policy regarding the former Chelsea owner's assets. He also asked her to clarify whether the opposition was aligned with the government position that Mr Abramovich must transfer more than £2.5bn to benefit the people of Ukraine. A Conservative Party spokesman said: \"Lord Wolfson is instructed in on-going legal proceedings in Jersey. He is not instructed on the Chelsea FC matter. \"Jake Richards' comments are pure politics, and they show Labour still does not understand how the Bar works. Barristers act for clients, not causes.\" They added: \"And it's a bit rich from this government. Labour should stop throwing mud. Their own Attorney General has acted for Gerry Adams and involved himself in the Shamima Begum case. This is rank hypocrisy. \"The Conservative Party led the way on supporting Ukraine and we remain committed to their cause. To suggest anything else is just Labour sinking to new depths.\""
    },
    {
        "title": "No 10 issued apology over John Major's birthday message to Queen Mother",
        "description": "John Major's Downing Street sent a grovelling apology after the prime minister birthday telegram to the Queen Mother was addressed in an \"improper manner\", newly-released government documents show. ",
        "url": "https://news.sky.com/story/no-10-issued-apology-over-john-majors-birthday-message-to-queen-mother-13488651",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-queen-mother-john-major_7122049.jpg?20251230091435",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 09:06:00",
        "Headline": "The note from the then prime minister's private office is revealed in newly-released government documents. ",
        "Content": "John Major's Downing Street sent a grovelling apology after the prime minister birthday telegram to the Queen Mother was addressed in an \"improper manner\", newly-released government documents show.  The files released to the National Archives in Kew, west London, do not make clear the details of the faux pas. But the papers reveal the Queen Mother's private secretary Captain Sir Alastair Aird phoned Number 10 demanding an explanation as to why the 1994 greeting for her 94th birthday had been \"incorrectly addressed\". Roderic Lyne, from Mr Major's private office, wrote back after an investigation to apologise for the error. But he insisted Downing Street staff were \"sticklers for the correct form\" and not to blame, instead suggesting BT were responsible for the blunder. \"The message itself, as it left our hands, was entirely correct,\" he wrote. \"However, in transmitting it, it appears that British Telecom most unfortunately addressed the telegram in the improper manner which you described. \"I am so sorry that this happened. Our own staff are sticklers for the correct form, as you would imagine. \"Perhaps the solution would be for us to abandon telegrams, which seem in any case to be going out of fashion.\" Despite the mistake, the Queen Mother still telegrammed Mr Major, who was prime minister between 1990 and 1997, and his wife, Norma, to thank them. \"I was very touched by your kind message of good wishes on my birthday and send you both my warm thanks,\" she said. The Queen Mother died in 2002, aged 101. Government records are released to the archives and made public after 20 years, although files relating to the Royal Family are regularly withheld under the Public Records Act. The Cabinet Office, which is responsible for transferring the files, has blamed an \"administrative error\" after documents relating to Andrew Mountbatten-Windsor were released unredacted to journalists by mistake."
    },
    {
        "title": "Two arrested after elderly pedestrian dies following collision with car in Gillingham",
        "description": "Two men have been arrested after a pedestrian in his 80s died following a collision with a car that saw him carried along the road.",
        "url": "https://news.sky.com/story/police-arrest-two-men-after-death-of-80-year-old-hit-by-car-in-gillingham-13488719",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-kent-police-car-police-car_6593941.jpg?20251230112636",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:37:00",
        "Headline": "Detectives released CCTV images showing two hooded men dressed in dark clothing on foot and are still seeking one of the pair.",
        "Content": "Two men have been arrested after a pedestrian in his 80s died following a collision with a car that saw him carried along the road. Kent Police said the man was initially struck by a grey Mercedes estate on the A289 Gads Hill in Gillingham, Kent, just after midnight on Monday. The man was found on Grange Lane in the town. Detectives investigating the crash released CCTV images which showed two hooded men dressed in dark clothing on a pavement on foot, with one appearing to be running while carrying a number plate. South East Coast Ambulance paramedics treated the male pedestrian at the scene, but he later died, the force said. Read more:New Year Honours: Idris Elba among those knightedRelease of Andrew documents blamed on admin error A 29-year-old man from the nearby town of Chatham and a 28-year-old man with no address have been arrested over the crash and are being questioned in custody. One of the men from the CCTV images is still being sought."
    },
    {
        "title": "West Midlands Police apologises to MPs for 'confusion' caused by Maccabi Tel Aviv ban evidence",
        "description": "The head of West Midlands Police has apologised to MPs after the force provided misleading evidence related to the contentious ban on Maccabi Tel Aviv fans from a match at Aston Villa that has spiralled into a political row.",
        "url": "https://news.sky.com/story/west-midlands-police-apologises-to-mps-for-confusion-caused-by-maccabi-tel-aviv-ban-evidence-13488758",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maccabi-tel-aviv-fans_7055538.jpg?20251019163238",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-12-30 17:44:00",
        "Headline": "Maccabi Tel Aviv fans were banned from attending Aston Villa's ground when the two sides faced each other in the Europa League in November.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The head of West Midlands Police has apologised to MPs after the force provided misleading evidence related to the contentious ban on Maccabi Tel Aviv fans from a match at Aston Villa that has spiralled into a political row. The letter was submitted by Chief Constable Craig Guildford, after he was recalled to parliament next Tuesday to explain previous evidence - a rare move by the cross-party Home Affairs Select Committee. He is due to appear alongside Assistant Chief Constable Mike O'Hara, who told the MPs on 1 December that members of Birmingham's Jewish community supported excluding the Israeli club's fans from the politically-charged Europa League match in November. \"We can confirm that there is no documented feedback from Jewish representatives prior to the decision being communicated which expressed support for the ban on Maccabi Tel Aviv fans,\" Mr Guildford wrote in a letter published today by the committee. \"ACC O'Hara and I would like to take this opportunity to formally apologise to the Home Affairs Select Committee for any confusion caused and would like to reassure you that there was never any intention to mislead whatsoever.\" But he claimed that in recent weeks, members of the Jewish community have privately supported the decision taken in October. Police pushed for the ban to be imposed by the Birmingham City Council's Safety Advisory Group, as Sky News first revealed, over the potential threat posed by Maccabi hooligans around Villa Park, given recent racist chanting against Arabs and Palestinians. \n                  Maccabi Tel Aviv FC given fan ban and €20,000 fine by UEFA for 'racist' chanting\n                 \n                  FIFA announces £45 World Cup tickets in climbdown after outcry over pricing\n                 \n                  Paris Saint-Germain ordered to pay Kylian Mbappe €60m  French court rules\n                 The decision was challenged by Prime Minister Sir Keir Starmer and the club, which claimed violence in 2024 around a match in the Netherlands had been mischaracterised by West Midlands Police by underplaying attacks on the Israelis by locals in Amsterdam. Incidents around that match were central to the decision taken in Birmingham. Mr Guildford has provided MPs with the UK Football Policing Unit's notes after a call with Dutch police, including claims \"Maccabi fans prepared to confront and fight officers\". The unit did reference a \"national mobilisation of Muslim youths\" and reports of \"hit and run style attacks on Maccabi fans\" in retribution. Officials from Birmingham City Council will also be questioned by MPs next Tuesday. The council has now confirmed to committee chair Dame Karen Bradley that a law firm is being commissioned to independently review the decision to improve their governance. Maccabi faced the ban despite having no recent UEFA sanctions for fan misconduct. But since the Villa match, UEFA has punished Maccabi for anti-Palestinian racist chanting at their match in Germany against Stuttgart, where their fans were allowed to attend last month. As well as a €20,000 (£17,500) fine, they were handed a suspended ban on being allowed fans at an away match in Europe. West Midlands Police also confirmed to MPs the visit to Villa Park of Swiss club Young Boys was only classified as medium risk, unlike the high-risk Maccabi game, despite their three sets of UEFA punishments since 2023 for fan unrest. Sky News revealed details of that risk assessment after West Midlands police officers were assaulted by Young Boys fans. One man was jailed for two months while three others were also charged over the disorder. The letter from West Midlands Police does not address how their original Maccabi intelligence assessment referenced a previous match in England for the club against West Ham in 2023 which never happened."
    },
    {
        "title": "Eurostar passengers brace for further disruption after day of cancellations",
        "description": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday.",
        "url": "https://news.sky.com/story/eurostar-passengers-brace-for-further-disruption-after-day-of-cancellations-13488920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122308.jpg?20251230164934",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 22:39:00",
        "Headline": "Train services to and from continental Europe were suspended for much of Tuesday after a power supply failure due to a technical fault.",
        "Content": "Eurostar passengers are braced for more possible delays and cancellations after the train network was forced to cancel large parts of its London-Europe service on Tuesday. Train services to and from continental Europe - on both Eurostar and Le Shuttle - were suspended for much of the day after a power supply failure due to a technical fault and a failed Le Shuttle blocking all routes. The disruption upended New Year's plans for thousands of passengers in London, Paris, Brussels and Amsterdam during ⁠one of the busiest travel weeks of the year. Repairs are under way to try to fix the issue. Eurostar said it was resuming some of its services gradually around 3pm on Tuesday, but passengers were urged to stay away. As of the early hours of Friday, the first Eurostar trains to Paris, Brussels, and Amsterdam around 6am show as cancelled, while Le Shuttle records delays of at least an hour to people's booked departure times. Eurostar told passengers: \"As the overhead power supply issues in the Channel Tunnel still remain, only one line is available to run trains on. \"This means there will continue to be delays and longer journey times than usual this evening. \"Therefore, we continue to advise our customers to rebook their journey for another day if possible, with free exchanges available. \"We also advise customers not to come to our stations if their trains have already been cancelled.\" It added: \"Although outside of our control, we apologise for the disruption today and will continue to keep customers updated with the latest information and support them with rescheduling their bookings.\" Getlink, which operates the tunnel infrastructure, said repairs to the power supply were under way and that traffic services were slowly being restored in both directions. \"Our teams are working to restore the situation as quickly as possible. Waiting times will be adjusted throughout the day,\" the company added. \"Eurotunnel apologises for the inconvenience and thanks its customers for their patience and understanding.\" The Channel Tunnel accommodates Eurostar services as well as LeShuttle vehicle-carrying trains between the UK and France. Read more:Passengers' rights after Channel Tunnel disruptionFamilies devastated over ruined New Year trips Among those affected was cancer patient Ethlyn Buckmire, who had spent £3,500 on her son's dream 10th birthday trip to Disneyland, only for their train to be turned away at the Channel Tunnel. Ms Buckmire told Sky News she did not take out travel insurance because her cancer diagnosis made the premiums too expensive. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Another family, from Nigeria, faced being \"stranded\" in London without a hotel after their Paris-bound train was also turned back."
    },
    {
        "title": "Eurostar chaos leaves cancer patient set to lose £3.5k",
        "description": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday. ",
        "url": "https://news.sky.com/story/eurostar-chaos-leaves-cancer-patient-set-to-lose-16335k-as-another-family-is-stranded-in-london-13488738",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-eurostar-pancras_7122310.jpg?20251230165018",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 16:19:00",
        "Headline": "An issue in the Channel Tunnel led to the cancellation of almost all Eurostar services to and from London just one day before New Year's Eve. ",
        "Content": "A cancer patient who was taking her family to Disneyland is among the thousands of passengers whose travel plans were ruined by Eurostar cancellations on Tuesday.  The train network was forced to cancel almost all of its London-Europe services after issues in the Channel Tunnel, including a failed Le Shuttle train. The Buckmire Edwards family left King's Cross St Pancras at 7am only to be stranded \"for hours and hours\" outside the Channel Tunnel. They were later brought back to London. Eurostar latest: Channel Tunnel partially reopens Mum Ethlyn told Sky News she had spent £3,500 on a dream trip to Disneyland to celebrate her son's 10th birthday with her partner and 10-month-old baby. She said they did not take out travel insurance because her cancer diagnosis made the premiums too expensive - so they now face losing all the money. \"We are going to try and go home and salvage the rest of the holiday season and try and celebrate his birthday some other way,\" she said, \"but to be honest, I don't have the energy, I really don't. We were so looking forward to that trip.\" Dante, nine, said: \"It's been quite a journey because ever since my mum has been through cancer, she has been having a baby, chemotherapy, she has still coped, so I think she is doing a very great job.\" \"I'm very proud of this journey that she has been through,\" he added. Family 'stranded' with no hotel booking While the Buckmire Edwards said they would return to their London home, passengers from further afield faced being stranded in the capital just one day before New Year's Eve. Charles Nduka-Eze said his family, from Nigeria, were having \"a complete disaster\" after their Paris-bound train was turned back to London. The group had checked out of a London hotel and had already paid for their hotel rooms in the French capital, as well as tickets for Disneyland and river cruises. Read more: Travel disrupted? Here are your rights Speaking at King's Cross St Pancras, he said: \"I'm not concerned about the refund for now, I'm thinking about what to do. \"We don't know what's going on so I've got a sister over there trying to find out what's the next thing to do because we're just confused, to be honest.\" His sister added that the group were now \"stranded\". 'Romance on hold' as NYE minibreak is ruined Meanwhile, a man travelling to Paris for New Year's Eve with his partner said \"We'll have to put romance on hold.\" John Paul, from Peterborough, was gifted the trip as a surprise from his partner Lucy and the pair spent five hours on a Paris-bound train before it unexpectedly returned to London. Speaking at King's Cross St Pancras, the 46-year-old said: \"I think the thing is, at the minute, there's no clear information and obviously, we've lost a lot of money, haven't we?\" Paul said they had a river cruise in Paris and the Eiffel Tower booked for the evening. Eurostar initially told passengers to postpone their journeys, before later suspending all trains to and from London until further notice. It later said some services would resume but \"strongly advised\" all passengers to refrain from travelling. More from Sky News:Two arrested after death of elderly man hit by carAdmin 'error' blamed for Andrew document release The Eurostar trains were unable to operate due to an issue with the overhead power supply in the Channel Tunnel and a subsequent failed Le Shuttle train, which was moved from the tunnel on Tuesday afternoon. Eurostar operations across Europe were also affected. In Folkestone, Kent, queues formed as Le Shuttle services were postponed and delayed. They gradually resumed on Tuesday afternoon."
    },
    {
        "title": "Iranian university students join protests over soaring cost of living",
        "description": "University students in Iran have joined shopkeepers and bazaar merchants in protests over the country's soaring cost of living.",
        "url": "https://news.sky.com/story/iranian-university-students-join-protests-over-soaring-cost-of-living-13488739",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-iran-protests_7122339.jpg?20251230174357",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 16:28:00",
        "Headline": "Iran's currency, the rial, has lost nearly half its value against the US dollar in 2025, with inflation reaching 42.5% in December as the country bears US sanctions and threats of Israeli strikes.",
        "Content": "University students in Iran have joined shopkeepers and bazaar merchants in protests over the country's soaring cost of living. Footage showed scores of people marching along a street in the capital Tehran, chanting \"rest in peace Reza Shah\", a reference to the founder of the royal dynasty ousted in the 1979 Islamic revolution. The semi-official Fars News Agency said hundreds of students held protests at four universities in Tehran on Tuesday. Video from Monday showed people gathering in central Tehran and chanting slogans. Iran's currency, the rial, has lost nearly half its value against the US dollar in 2025, with inflation reaching 42.5% in December and the price of food rising as much as 72% as the country bears US sanctions and threats of Israeli strikes. Iran's President Masoud Pezeshkian said he had asked the interior minister to listen to the \"legitimate demands\" of the protesters. A spokesperson for the government said a dialogue mechanism would be set up and would include talks with protest leaders. \"We officially recognise the protests,\" they said on Tuesday. \"We hear ​their voices and we know that this originates from natural pressure arising from the pressure on people's livelihoods.\" The demonstrations are the first major protests since Israeli and US strikes on Iran in June, which prompted outpourings of patriotic solidarity. Read more from Sky News:Review ordered in case of British-Egyptian activistChina fires rockets into waters off Taiwan Iran's economy has been suffering for years after Donald Trump reimposed US sanctions during his first term as president in 2018 and ended an international deal over the country's nuclear programme. United Nations sanctions on the country were also reimposed in September. Inflation is currently pushing many prices beyond the means of most people. Iran faced protests across the country in 2022 over price hikes, including for bread. The country's clerical rulers were rocked by the boldest unrest yet in years over the same period and into 2023 after the death of a young Iranian Kurdish woman, Mahsa Amini, in the custody of the morality police, who enforce strict dress codes. The country is still under intense international pressure, with Mr Trump on Monday saying he might back another round of Israeli airstrikes if Tehran resumes work on ballistic missiles or a nuclear weapons programme. The US and Israel conducted airstrikes on Iran's military and nuclear installations over 12 days in June, aimed at stopping what they said were efforts to develop the means to build an atomic weapon. Iran has said its nuclear energy programme is entirely peaceful and claimed it has not tried to build a nuclear bomb."
    },
    {
        "title": "Two trains carrying tourists to Machu Picchu crash - as one person killed",
        "description": "At least one person has been killed and around 30 passengers have been injured after two trains taking tourists to Machu Picchu in Peru crashed.",
        "url": "https://news.sky.com/story/two-trains-carrying-tourists-to-machu-picchu-crash-as-one-person-killed-13488953",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peru-machu-picchu_7122788.jpg?20251231001657",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 23:58:00",
        "Headline": "The collision involved a train coming from the famed archaeological site and a train headed there in the early afternoon near Qoriwayrachina, also an archaeological site, according to the company operating the railway.",
        "Content": "At least one person has been killed and around 30 passengers have been injured after two trains taking tourists to Machu Picchu in Peru crashed. The collision involved a train coming from the famed archaeological site and a train headed there in the early afternoon near Qoriwayrachina, also an archaeological site, according to the company operating the railway. The person who was killed was a railway worker, Jhonathan Castillo Gonzalez, a captain with the police department in the nearby city of Cuzco, said. He said that train services along the line connecting Machu Picchu with Cuzco were suspended after the accident. Authorities have not shared details regarding the cause of the crash. Footage shared by local media showed train carriages with broken windows and dented sides, which were stuck on tracks set between a forest and a rock wall. Around 1.5 million people flock to Machu Picchu every year, most of whom arrive by train. \n                  Two British women complete record-breaking row across Pacific Ocean\n                 \n                  Rocks on train tracks leave 900 Machu Picchu tourists stranded due to protest\n                 \n                  Three Scottish brothers set new world record for 9,000-mile row across Pacific Ocean\n                 The archaeological site was built by the Incas in the 15th century and served as a sanctuary for the Inca emperors. Machu Picchu is known for its dry-stone brick walls and its three primary structures, including the Temple of the Sun."
    },
    {
        "title": "Israel suspends 37 aid organisations from operating in Gaza",
        "description": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules.",
        "url": "https://news.sky.com/story/israel-suspends-37-aid-organisations-from-operating-in-gaza-13488815",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gaza-palestinians_7122544.jpg?20251230211645",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 20:54:00",
        "Headline": "The groups have criticised the timing of the suspension, with one saying \"the needs in Gaza are enormous\" despite the ceasefire.",
        "Content": "Israel says it is suspending more than 30 humanitarian organisations, including Doctors Without Borders, from operating in Gaza for failing to comply with new registration rules. Israel has said the rules are aimed at preventing Hamas and other militant groups from infiltrating the aid organisations - but the relief agencies have said the ban will harm the enclave's population, which remains desperately in need of aid. Under the new regulations, any organisation that has called for boycotts against Israel, denied the October 7 attack or shared support for any of the court cases against Israeli leaders or soldiers can be disqualified from working in the Gaza Strip. Another requirement is for aid groups to register the names of their workers. Israel's Ministry of Diaspora Affairs has said 37 groups failed to comply with the rules and will be suspended. This is roughly 15% of the organisations operating in Gaza. It said Doctors Without Borders, also known by its French acronym MSF, has failed to respond to Israeli claims that some of its workers were associated with Hamas or Islamic Jihad. MSF has denied the accusations about their staff. It also said Israel's decision will have a catastrophic impact in Gaza, where they support around 20% of hospital beds and a third of births. \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 \n                  'We will finish Hamas if they don't give us Rani,' says mother of last Israeli hostage in Gaza\n                 \n                  The year America changed - 2025 in review\n                 Other suspended groups include Action Against Hunger, ActionAid and CARE. While Israel has alleged the move will have a limited impact on the ground, the affected organisations say the timing is devastating. Read more:Pope laments suffering in GazaIsrael approves new West Bank settlements Shaina Low, from the now-suspended Norwegian Refugee Council, said: \"Despite the ceasefire, the needs in Gaza are enormous.\" \"Not being able to send staff into Gaza means all of the workload falls on our exhausted local staff,\" she continued. The fragile ceasefire has been in place since October. Some of the groups have said they did not meet Israel's demand for information on their Palestinian staff due to fears they could be targeted by Israel, and because of European data protection laws. Israel has said the groups will have their licences revoked on 1 January and if they are located in Israel, they must leave by 1 March. They can appeal the decisions. Israeli fire kills 10-year-old, hospital says The suspension comes as the Shifa Hospital said on Tuesday that Israeli fire had killed a 10-year-old girl and wounded another person in Gaza City near the yellow line that delineates areas under Israeli control. The Israeli military did not immediately comment on the incident but has said troops operating near the yellow line would target anyone who approached or threatened soldiers. The Gaza Health Ministry said on Monday that 71,266 Palestinians have been killed in Gaza. This total did not include the girl. The ministry, part of the Hamas-run government, does not differentiate between civilians and combatants. The United Nations and independent experts consider the Health Ministry the most reliable source on war casualties. Israel disputes its figures but has not provided its own."
    },
    {
        "title": "Looking back at 2025 - in satellite images ",
        "description": "An earthquake, wildfires, war and a funeral are among the world events that satellite images have helped Sky News cover this year. ",
        "url": "https://news.sky.com/story/looking-back-at-2025-in-satellite-images-13488715",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-copernicus-hurricane-melissa_7122236.png?20251230134708",
        "type": "World",
        "Author": "Sky News OSINT team",
        "Date Published": "2025-12-30 14:21:00",
        "Headline": "Photographs taken from space have helped the Sky News Data and Forensics team cover natural disasters, war and humanitarian crises.",
        "Content": "By Sky News OSINT team  An earthquake, wildfires, war and a funeral are among the world events that satellite images have helped Sky News cover this year.  Here we reflect on some of the most impactful pictures. January: California wildfires, Altadena From 7 to 31 January, fires blazed across parts of Los Angeles and San Diego, powered by strong winds and dry conditions on the ground. They killed at least 30 people and caused an estimated 440 indirect deaths as a result of the fires, according to a study published in the JAMA medical journal in August. February: Attacks on a refugee camp in Sudan In February, Sudanese paramilitary Rapid Support Forces (RSF) fighters stormed the Zamzam refugee camp in North Darfur, setting fire to buildings and killing civilians. \n                  Eurostar passengers brace for further disruption after day of cancellations\n                 \n                  Eurostar chaos leaves cancer patient set to lose £3.5k\n                 \n                  Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says\n                 Satellite images from Vantor show how buildings and stalls were burned during the attack. Sudan's deadly civil war raged on throughout the year. March: An earthquake causes major destruction in Myanmar On 28 March, a deadly 7.7 magnitude earthquake hit Myanmar, causing between 3,600 and 5,350 deaths, according to United Nations agency estimates. Buildings across the country collapsed, displacing an estimated 200,000 people. April: The funeral for Pope Francis Thousands of people gathered outside St Peter's Basilica in the Vatican on 26 April to mourn Pope Francis. The Argentinian pontiff became known for a more progressive approach during his 12-year papacy. He died aged 88 on 21 April. May: GPS jamming on the Baltic coast In recent years, radio jamming and electronic interference have intensified. These activities introduce powerful artificial frequencies, which interfere with and can be identified by synthetic-aperture radar (SAR) imagery. SAR imagery is created by sending radio signals from space to the earth and measuring the signals that bounce back. This example shows the banding effect interference can produce, visible over the Russian enclave Kaliningrad, a growing source of claims by analysts of GPS interference. June: Ukraine drones hit Russian airbases On 1 June, several Russian aircraft bombers suffered damage and destruction after a number of surprise Ukrainian drone attacks. High-resolution satellite imagery from 4 June shows visible damage and cleanup operations at Belaya and Olenya key airbases. July: Crowds overwhelm aid trucks in Gaza On 26 July in south Gaza, hundreds of Palestinians appeared to crowd around an aid convoy in scenes of overwhelm seen from space as people struggled to access food. A month later, famine was declared in Gaza City by the Integrated Food Security Phase Classification (IPC) - a globally recognised system for classifying the severity of food insecurity and malnutrition. August: 'Alligator Alcatraz' construction temporarily halted New construction at Donald Trump's Florida immigration centre was temporarily halted by a US judge in August, citing environmental concerns. Detainees moved into the facility on an abandoned airport site 43 miles from Miami in July, after just eight days of construction. Experts suggested the site was flawed, facing flooding near electrics during a storm as the first detainees were scheduled to arrive. September: Nepal government palace burns during 'Gen Z' protests On 9 September, Nepal's federal parliament building in capital Kathmandu was set alight during youth-led protests. Dozens died during the unrest, prompted by a since-reversed government decision to block 26 social media platforms and widespread claims of corruption among the young generation. Damage to the palace grounds and buildings can be seen from satellite imagery comparing the start and end of the year. October: Hurricane Mellissa The category 5 hurricane - the worst natural disaster to make landfall in Jamaica since records began - devastated parts of the Caribbean on 28 October. The World Bank estimated the storm's physical damage at $8.8bn (41% of Jamaica's 2024 GDP), including major flooding, damaged buildings and blocked roads. One of the Copernicus Sentinel-2 satellites captured Melissa's eye a few hours before hitting Jamaica's southern coast. November: Advanced US warship arrives in the Caribbean Sea On 16 November, the US sent USS Gerald R Ford to the Caribbean in what the Trump administration said was a counter-drugs operation. It has been widely interpreted as a move to put pressure on Venezuelan President Nicolás Maduro's regime. The arrival of the ship marked the largest build-up of US firepower in the region in generations; it was seen on satellite imagery off the coast of Puerto Rico on 17 November. December: New York City festive lights Striking nighttime satellite imagery from Vantor's WorldView Legion shows Manhattan's festive glow on 4 December. One night before, on the evening of 3 December, the city lit its iconic Christmas tree at Rockefeller Plaza, which can be seen near St Patrick's Cathedral. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?",
        "description": "Two December days in Palm Beach and I have sunburn and whiplash.",
        "url": "https://news.sky.com/story/a-head-spinning-two-days-of-trump-diplomacy-but-how-much-was-theatrical-hot-air-13488600",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump_7121778.jpg?20251229220229",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-12-30 02:57:00",
        "Headline": "President Donald Trump met with Volodymyr Zelenskyy and Benjamin Netanyahu, and it was a fitting way to end the year, writes Sky's Mark Stone.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Two December days in Palm Beach and I have sunburn and whiplash. The sunburn is my fault. But Donald Trump is to blame for the whiplash, such is his style of diplomacy. He'd have it no other way. He's busy making things happen. That's how he frames it. But let's take stock because there has been a lot to process. What's actually been achieved over these past two days, how much was just theatrical hot air, and what surprises were there? Let's begin with the Middle East and the visit of Israeli Prime Minister Benjamin Netanyahu. \"An outstanding meeting.\" That's how Netanyahu's spokesman described the day to me as it all wrapped up. You can see why he might think this. Netanyahu got what he came for. • Trump's commitment to bomb Iran again (if US intelligence concludes, as Israeli spooks do, that it is indeed rearming)? Tick. • Trump to blame Hamas as being wholly responsible for the faltering Gaza ceasefire and for preventing phase two from progressing? Tick. • Trump to heap praise on Netanyahu as the saviour of Israel and wartime leader like no other? Tick (and one for the election campaign video). • Trump to publicly state that Netanyahu should be pardoned in his corruption case and press Israel's president to enact the pardon forthwith? Tick. There's a lot to process just there. Trump saying he remains locked and loaded on Iran. Trump threatening \"all hell\" on Hamas. How will all this play out in 2026? If he follows through (big if), how will his base react domestically? There's so much to consider. There were some intriguing divergences between Netanyahu and Trump, one on Syria and the other on the West Bank. On Syria, Trump said he wanted to thaw relations between the new Syrian president and Israel. Good luck to him if he can. It would be an achievement and welcome. On the West Bank, Trump suggested he was worried about settler violence and expansion. It's a huge issue, it threatens Trump's vision for the region. Again - if he can stop the violence and expansion, that would be an achievement. I'm not holding my breath. 👉 Follow Trump100 on your podcast app 👈  But, as ever, there was more too; the stuff we didn't expect from the two free-flowing impromptu news conferences at which the American president did almost all the talking. He was asked about an attack on Venezuela which, casually and vaguely, he'd dropped into an earlier interview. He confirmed that, yes, he'd ordered an attack on a \"big facility\" in Venezuela. That's big news - the first American land attack. Yet it was just another moment in this second day of Mar-a-Lago diplomacy. Then there was his response to what appears to be a massive Chinese military dress rehearsal for a blockade of Taiwan. Was Trump worried? No, he said. \"Nothing worries me.\" Just chill? Or doesn't really care? It's hard to know sometimes. A day earlier, it had been Ukraine's president at Mar-a-Lago. Is it ironic or just mad that Volodymyr Zelenskyy was coming from his city of actual palaces, including his own presidential palace, to a Disneyland town called Palm Beach and the faux-palace of a former real estate tycoon to beg for support for his country's future. It seemed to go well though. Ukrainian officials told me they were very pleased with the commitment Trump gave on security guarantees. They glossed over the wholly important issue of how long those guarantees last or whether they can trust Trump's word. What choice do they have? Of course, there was more. President Trump spoke to Russian President Vladimir Putin twice - before and after the Zelenskyy meeting. And it was what he said after the second call that piqued interest. He announced that Putin had told him Ukraine had attacked one of his homes with a swarm of drones. Zelenskyy had already called the claim out as lies. The suggestion from Kyiv is that if it happened it was a false flag to try to derail the peace process because Putin doesn't want peace. But Trump's tone suggested he was taking Putin's word for it. Remember, in his first term, Trump took Putin's word over that of his own intelligence agencies. And so, a head-spinning two days of news; a fitting way to end the year. 2026 is an election year for Donald Trump. The midterms are in November. He needs to focus on the \"home front\", as his vice-president subtly reminded him a couple of months ago. The economy and the cost of living, not foreign conflicts. Trump knows that. But so do America's adversaries and its troublesome allies. What will they gamble on in 2026, knowing that he may not care, or may just go along with it. Buckle up."
    },
    {
        "title": "Thieves drill into German bank vault to steal valuables worth tens of millions of euros",
        "description": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes. ",
        "url": "https://news.sky.com/story/thieves-drill-into-german-bank-vault-to-steal-valuables-worth-tens-of-millions-of-euros-13488710",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-germany-bank-heist_7122340.jpg?20251230174628",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 13:58:00",
        "Headline": "The gang took advantage of the Christmas holidays and got into the building through a next door parking garage.",
        "Content": "Thieves have drilled into a German savings bank vault to steal millions of pounds worth of valuables from safety deposit boxes.  Police said the gang took advantage of the Christmas holidays to carry out the heist in the western city of Gelsenkirchen and got into the building through a next door parking garage. Witnesses saw several men carrying large bags in the stairwell of the garage overnight on Saturday, while CCTV footage - which has not been released - captured a black Audi RS 6 leaving early on Monday morning. Masked suspects, including one who operated the exit barrier, were seen inside the vehicle, which had been stolen in Hanover, around 150 miles away, according to police. A picture taken inside the ransacked bank vault shows a circular hole drilled through a thick wall with items strewn across the floor. The thieves broke into thousands of safe deposit boxes, with initial estimates placing the value of the raid between 10 and 90 million euros, according to police spokesperson Thomas Nowaczyk. A fire alarm was triggered at the bank on Saturday and police and firefighters arrived at around 6.15am but found no evidence of damage, with the break-in not discovered until Monday morning. \n                  Jail for burglars who used Grindr dating app to dupe victims\n                 \n                  Six immigration officers charged over alleged thefts from migrants\n                 \n                  Non-crime hate incidents should be scrapped, police leaders say\n                 Potential victims of the raid gathered outside the Sparkasse bank on Tuesday morning, but the doors remained locked and police told them to go home, according to local media reports. Read more from Sky News:Police looking for two men after pedestrian killed in collisionAnthony Joshua in 'stable' condition after crash A statement on the bank's website said the branch would remain closed, with details for a hotline for affected customers. \"Over the Christmas holidays, the customer safe deposit box area of the Buer branch was broken into,\" the bank said. \"More than 95% of the customer safe deposit boxes were forced open by as-yet-unknown perpetrators. \"Due to the extensive damage, customers cannot access this area until further notice.\""
    },
    {
        "title": "Bangladesh's first female prime minister Khaleda Zia dies at 80",
        "description": "Bangladesh's first female prime minister Khaleda Zia has died following a prolonged illness, her political party has said.",
        "url": "https://news.sky.com/story/bangladeshs-first-female-prime-minister-khaleda-zia-dies-at-80-13488601",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-khaleda-zia-bangladesh_7121962.jpg?20251230035446",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-30 03:42:00",
        "Headline": "During her years in and out of power, Bangladesh's politics came to be defined by Khaleda Zia's bitter feud with rival Sheikh Hasina - with the two women alternating between government and opposition.",
        "Content": "Bangladesh's first female prime minister Khaleda Zia has died following a prolonged illness, her political party has said. Ms Zia led the country as head of the Bangladesh Nationalist Party (BNP) from 1991 to 1996, and again from 2001 to 2006. During her years in and out of power, the nation's politics came to be defined by her bitter feud with rival Sheikh Hasina. The two women alternated between government and opposition - and Ms Zia served time in prison over corruption charges, but was acquitted earlier this year. The BNP announced her death in posts shared on social media on Tuesday. She had been suffering from ill health in recent years, including advanced cirrhosis of the liver, arthritis, diabetes, and chest and heart problems, doctors said. At the beginning of 2025 she travelled to London for medical treatment, staying for four months before returning home. Before her career in politics, Ms Zia was a wife and mother devoted to raising ‍her two sons, until her husband, military leader and then president Ziaur Rahman, was assassinated in an attempted army coup in 1981. She became head of the BNP, founded by her husband, three years later, and vowed to deliver on his aim of \"liberating Bangladesh from poverty and economic backwardness\". At the time, both she and Ms Hasina led a popular uprising for democracy that toppled military ruler Hussain Muhammad Ershad in 1990. The following year, Bangladesh held what was hailed as the country's first free election - with Ms Zia winning a surprise victory over Ms Hasina, becoming the country's first female prime minister, and years of bitter rivalry beginning. In 2018, when Ms Hasina was in power, Ms Zia and aides were convicted of stealing some $250,000 in foreign donations ​received by an orphanage trust set up during her second term as prime minister. She was jailed but moved to house arrest on humanitarian grounds in March 2020, as her health deteriorated. Read more from Sky News:New Year Honours revealedSky News quiz of the year Ms Hasina, who led the country from 1996 to 2001 and again from 2009 to 2024, was ousted in a mass uprising and fled the country in August 2024 - and Ms Zia was freed from house arrest. Earlier this year, she was acquitted by Bangladesh's Supreme Court. Though Ms Zia had been out of power for almost 20 years, she and her party continued to command much support. The BNP is ⁠seen as the frontrunner to win the next parliamentary election set to take place in February - and her eldest son and acting chairman of the party, Tarique Rahman, 60, is widely seen as a strong candidate to become ​prime minister."
    },
    {
        "title": "A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?",
        "description": "Two December days in Palm Beach and I have sunburn and whiplash.",
        "url": "https://news.sky.com/story/a-head-spinning-two-days-of-trump-diplomacy-but-how-much-was-theatrical-hot-air-13488600",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump_7121778.jpg?20251229220229",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-12-30 02:57:00",
        "Headline": "President Donald Trump met with Volodymyr Zelenskyy and Benjamin Netanyahu, and it was a fitting way to end the year, writes Sky's Mark Stone.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Two December days in Palm Beach and I have sunburn and whiplash. The sunburn is my fault. But Donald Trump is to blame for the whiplash, such is his style of diplomacy. He'd have it no other way. He's busy making things happen. That's how he frames it. But let's take stock because there has been a lot to process. What's actually been achieved over these past two days, how much was just theatrical hot air, and what surprises were there? Let's begin with the Middle East and the visit of Israeli Prime Minister Benjamin Netanyahu. \"An outstanding meeting.\" That's how Netanyahu's spokesman described the day to me as it all wrapped up. You can see why he might think this. Netanyahu got what he came for. • Trump's commitment to bomb Iran again (if US intelligence concludes, as Israeli spooks do, that it is indeed rearming)? Tick. • Trump to blame Hamas as being wholly responsible for the faltering Gaza ceasefire and for preventing phase two from progressing? Tick. • Trump to heap praise on Netanyahu as the saviour of Israel and wartime leader like no other? Tick (and one for the election campaign video). • Trump to publicly state that Netanyahu should be pardoned in his corruption case and press Israel's president to enact the pardon forthwith? Tick. There's a lot to process just there. Trump saying he remains locked and loaded on Iran. Trump threatening \"all hell\" on Hamas. How will all this play out in 2026? If he follows through (big if), how will his base react domestically? There's so much to consider. There were some intriguing divergences between Netanyahu and Trump, one on Syria and the other on the West Bank. On Syria, Trump said he wanted to thaw relations between the new Syrian president and Israel. Good luck to him if he can. It would be an achievement and welcome. On the West Bank, Trump suggested he was worried about settler violence and expansion. It's a huge issue, it threatens Trump's vision for the region. Again - if he can stop the violence and expansion, that would be an achievement. I'm not holding my breath. 👉 Follow Trump100 on your podcast app 👈  But, as ever, there was more too; the stuff we didn't expect from the two free-flowing impromptu news conferences at which the American president did almost all the talking. He was asked about an attack on Venezuela which, casually and vaguely, he'd dropped into an earlier interview. He confirmed that, yes, he'd ordered an attack on a \"big facility\" in Venezuela. That's big news - the first American land attack. Yet it was just another moment in this second day of Mar-a-Lago diplomacy. Then there was his response to what appears to be a massive Chinese military dress rehearsal for a blockade of Taiwan. Was Trump worried? No, he said. \"Nothing worries me.\" Just chill? Or doesn't really care? It's hard to know sometimes. A day earlier, it had been Ukraine's president at Mar-a-Lago. Is it ironic or just mad that Volodymyr Zelenskyy was coming from his city of actual palaces, including his own presidential palace, to a Disneyland town called Palm Beach and the faux-palace of a former real estate tycoon to beg for support for his country's future. It seemed to go well though. Ukrainian officials told me they were very pleased with the commitment Trump gave on security guarantees. They glossed over the wholly important issue of how long those guarantees last or whether they can trust Trump's word. What choice do they have? Of course, there was more. President Trump spoke to Russian President Vladimir Putin twice - before and after the Zelenskyy meeting. And it was what he said after the second call that piqued interest. He announced that Putin had told him Ukraine had attacked one of his homes with a swarm of drones. Zelenskyy had already called the claim out as lies. The suggestion from Kyiv is that if it happened it was a false flag to try to derail the peace process because Putin doesn't want peace. But Trump's tone suggested he was taking Putin's word for it. Remember, in his first term, Trump took Putin's word over that of his own intelligence agencies. And so, a head-spinning two days of news; a fitting way to end the year. 2026 is an election year for Donald Trump. The midterms are in November. He needs to focus on the \"home front\", as his vice-president subtly reminded him a couple of months ago. The economy and the cost of living, not foreign conflicts. Trump knows that. But so do America's adversaries and its troublesome allies. What will they gamble on in 2026, knowing that he may not care, or may just go along with it. Buckle up."
    },
    {
        "title": "2026 preview: The most consequential year in modern American history?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160;",
        "url": "https://news.sky.com/story/2026-preview-the-most-consequential-year-in-modern-american-history-13488297",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-30 05:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    Martha Kelner, James Matthews and Mark Stone look ahead to what promises to be a rollercoaster and consequential 2026 in America and beyond. What could define next year? And what can we learn from this year just gone to help us read the runes? We go through it all on this New Year's special. You can catch up on last week's episode where the team looked back on a wild and topsy-turvy 2025 in America here. You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "JFK's granddaughter Tatiana Schlossberg dies aged 35 ",
        "description": "John F Kennedy's granddaughter Tatiana Schlossberg has died at the age of 35, just a month after revealing her terminal cancer diagnosis.",
        "url": "https://news.sky.com/story/jfks-granddaughter-tatiana-schlossberg-dies-aged-35-13488780",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tatiana-schlossberg_7089323.jpg?20251123115034",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-30 19:28:00",
        "Headline": "The 35-year-old's death comes just a month after she shared her terminal cancer diagnosis in an essay which criticised her relative, current US health secretary Robert F Kennedy Jr.",
        "Content": "John F Kennedy's granddaughter Tatiana Schlossberg has died at the age of 35, just a month after revealing her terminal cancer diagnosis. A post on the JFK Library Foundation's Instagram account said Ms Schlossberg, the daughter of former US ambassador Caroline Kennedy, died on Tuesday. \"Our beautiful Tatiana passed away this morning,\" it read. \"She will always be in our hearts.\" The post was signed off as being from Ms Schlossberg's husband, George, and their two children, Edwin and Josephine, as well as her parents and siblings. The 35-year-old's father is designer and artist Edwin Schlossberg. She had one brother, Jack, and a sister, Rose, who donated stem cells for her cancer treatment. Ms Schlossberg, an environmental journalist, attacked her relative Robert F Kennedy Jr as she revealed her cancer diagnosis on the anniversary of JFK's assassination in November. She said measures backed by RFK Jr, a long-time vaccine critic, could hurt cancer patients. \n                  A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?\n                 \n                  Alleged strikes on Vladimir Putin residence 'not good', Donald Trump says\n                 \n                  It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all\n                 Ms Schlossberg wrote in an essay for The New Yorker: \"As I spent more and more of my life under the care of doctors, nurses, and researchers striving to improve the lives of others, I watched as Bobby cut nearly a half billion dollars for research into mRNA vaccines, technology that could be used against certain cancers.\" After the birth of her second child, a doctor noticed her high white blood cell count, which turned out to be acute myeloid leukaemia with a rare mutation. Ms Schlossberg wrote she has undergone rounds of chemotherapy, two stem cell transplants and participated in clinical trials. She also spoke of fearing her young children would not remember her."
    },
    {
        "title": "Tory shadow minister accused of 'conflict of interest' over Abramovich case",
        "description": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him.",
        "url": "https://news.sky.com/story/tory-shadow-minister-accused-of-conflict-of-interest-over-abramovich-case-13488724",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-roman-abramovich-chelsea-sale_6933801.jpg?20250603143334",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-30 14:55:00",
        "Headline": "The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\".",
        "Content": "Labour has accused the Conservative shadow attorney of a \"conflict of interest\" after it emerged he is acting as a lawyer for Roman Abramovich, despite UK sanctions against him. Justice minister Jake Richards told Sky News Lord Wolfson needs to \"do one or the other\" - serve Kemi Badenoch on her shadow front bench or work for Mr Abramovich. The Russian businessman is caught up in a legal battle with the Jersey government after it launched an investigation into the source of more than £5.3bn in assets linked to him which are held there. According to several reports, the legal action is said to be delaying the release of funds from Mr Abramovich's sale of Chelsea FC, which the UK Government wants to see used to help rebuild Ukraine after the war ends. The Tories said Lord Wolfson is not instructed on the matter of Chelsea FC and branded Labour's attack \"pure politics\". But speaking to Sky's political correspondent Mhari Aurora, Mr Richards said the story \"stinks to high heaven\" and Ms Badenoch, the Conservative Party leader, \"should be taking action rather than just ignoring it\". He said: \"We have a situation where the shadow attorney general, one of the senior members of the shadow cabinet... is working for Roman Abramovich. \n                  Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah\n                 \n                  Cabinet Office blames 'administrative error' over mistaken release of historical Andrew documents\n                 \n                  Angola and Namibia agree to take back illegal migrants and criminals\n                 \"Abramovich, as many of your viewers will no doubt know, has a lot of money and we, the government, are trying to take action to recover some of those assets which were gained from Putin's Russia to help with the Ukrainian war effort. \"We think it cannot be right that the shadow attorney general on the one hand is advising Kemi Badenoch about this issue and on the other hand is getting paid by Roman Abramovich to do the same. There's a clear conflict of interest.\" The Conservatives have argued that lawyers take on cases regardless of who their client is, pointing out that Labour's attorney general, Richard Hermer, has previously represented Shamima Begum and Gerry Adams. However, Mr Richards said Labour \"are nor criticising Lord Wolfson for taking on this case, we're saying he can't take on this case and serve as a shadow attorney general\". He said: \"We have an attorney general at the moment who has represented lots of clients in the past but he's now serving as a frontline politician so he doesn't do both at the same time. \"Lord Wolfson has to choose one or the other. Is he working for the Conservative Party and His Majesty's opposition or is he working for Roman Abramovich? He shouldn't be able to do both.\" This comes after Mr Richards wrote to Ms Badenoch asking whether Lord Wolfson had recused himself from any party policy regarding the former Chelsea owner's assets. He also asked her to clarify whether the opposition was aligned with the government position that Mr Abramovich must transfer more than £2.5bn to benefit the people of Ukraine. A Conservative Party spokesman said: \"Lord Wolfson is instructed in on-going legal proceedings in Jersey. He is not instructed on the Chelsea FC matter. \"Jake Richards' comments are pure politics, and they show Labour still does not understand how the Bar works. Barristers act for clients, not causes.\" They added: \"And it's a bit rich from this government. Labour should stop throwing mud. Their own Attorney General has acted for Gerry Adams and involved himself in the Shamima Begum case. This is rank hypocrisy. \"The Conservative Party led the way on supporting Ukraine and we remain committed to their cause. To suggest anything else is just Labour sinking to new depths.\""
    }
]