[
    {
        "title": "Police investigating 'multiple leads' in Charlie Kirk killing as FBI release images of 'person of interest'",
        "description": "Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\". ",
        "url": "https://news.sky.com/story/charlie-kirk-fbi-wants-to-trace-black-clad-person-in-sunglasses-and-hat-over-shooting-of-trump-ally-13428812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7017310.jpg?20250911171053",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-11 13:38:00",
        "Headline": "The suspect in the killing of Charlie Kirk has been confirmed as a male who \"appears to be of college age\", authorities have said.",
        "Content": " Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\".  The images show a person wearing a black baseball cap, black long-sleeved shirt, black trousers and sunglasses. FBI officials in the Salt Lake City office also announced a $100,000 (£73,000) reward in exchange for information leading to the identification of the attacker. Follow the latest updates on Charlie Kirk's killing Earlier, authorities said the sniper was thought to have jumped off a roof and fled into a neighbourhood after firing one shot. They also said the suspect was a male who \"appears to be of college age\" and blended in on the Utah Valley University campus in Orem where Mr Kirk was killed. Mr Kirk, a 31-year-old right-wing influencer, was fatally shot in the neck on Wednesday afternoon while speaking to university students at an event. He died in hospital after being shot. The rifle suspected of being used in the shooting has been found. In a briefing on Thursday, FBI agent Robert Bohls said: \"I can tell you that we have recovered what we believe is the weapon that was used in yesterday's shooting... is a high-powered bolt action rifle. \"That rifle was recovered in a wooded area where the shooter had fled. The FBI laboratory will be analysing this weapon.\" Investigators have collected a footwear impression, a palm print, and forearm imprints for analysis. Read more: Who was Charlie Kirk?Moment gunshot heard at university event - Watch The father-of-two was the chief executive and co-founder of Turning Point USA, a prominent organisation that engages conservative youth on school campuses. He had millions of followers across social media. Mr Kirk and Turning Point USA played a key role in driving youth support for Mr Trump in last November's presidential election. His events at college campuses nationwide typically drew large crowds. Many people listened both in person and online to Mr Kirk, as he advocated for conservatism among younger generations and became a leading voice in the Make America Great Again (MAGA) movement. President Donald Trump paid tribute to Mr Kirk while on stage at a 9/11 memorial event in Virginia, saying he would be awarding him the Presidential Medal of Freedom. \"Before we begin, let me express the horror and grief so many Americans at the heinous assassination of Charlie Kirk have felt,\" Mr Trump said. \"Charlie was a giant of his generation, a champion of liberty and an inspiration to millions and millions of people. Our prayers are with his wonderful wife, Erika, and his beautiful children.\" He later added the FBI was making \"big progress\" in finding the shooter and he has \"an indication\" of the motive, but declined to expand. \"He's an animal, total animal, hopefully they'll have him and they'll get him.\""
    },
    {
        "title": "What we know about how Charlie Kirk was killed",
        "description": "Chaos broke out at Utah Valley University when prominent right-wing influencer Charlie Kirk was shot dead in front of thousands of people. ",
        "url": "https://news.sky.com/story/what-we-know-about-how-charlie-kirk-was-killed-13428871",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7017281.jpg?20250911163830",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-11 15:13:00",
        "Headline": "Sky News' Data & Forensics team has tracked and mapped the events before, during and after the shooting to answer questions about the attack. ",
        "Content": " Chaos broke out at Utah Valley University when prominent right-wing influencer Charlie Kirk was shot dead in front of thousands of people.  Mr Kirk, 31, was speaking to students about mass shootings on Wednesday when he was shot in the neck, leading students to flee and a manhunt for the killer beginning. Many questions remain, with differing accounts and multiple videos across social media. The Sky News Data and Forensic team has tracked and mapped the events before, during and after the killing to find out as much as possible about what happened. When and where did the shooting happen?  Mr Kirk was speaking to around 3,000 people from under a small white tent on the campus when he was shot. The event was part of his \"prove me wrong\" series, which saw the right-wing influencer visit campuses across the country and debate contentious subjects like gun control, free speech, LGBTQ+ rights and abortion rights with left-wing students. The event began at roughly 12pm local time. Mr Kirk was taking questions about mass shootings and gun violence when, at roughly 12.20pm, he was shot. It was a single shot that struck him in the neck, a university spokesman confirmed. Madison Lattin, who was standing only a few dozen feet to the left of Mr Kirk when he was shot, said: \"Blood is falling and dripping down, and you're just like so scared, not just for him but your own safety.\" Footage from the scene showed Mr Kirk being carried away within seconds of the shooting. Where did the shot come from?  In a statement on Thursday, the FBI said they had tracked the gunman's movements onto the campus, \"through the stairwells, up to the roof, across the roof, to a shooting location\". They said they first tracked his movements from 11.52am, when they said he arrived on campus. Videos from the event show the gunman was on top of the Losee Centre building - just over 130m away from where Kirk was speaking, according to an online measuring tool. Two videos show a figure on the roof before and immediately after a shot is fired. The first video shows what appears to be someone lying down. The person filming says \"he just ran from over there\" - pointing in the direction of a stairwell coming up the roof. The second video is filmed in the moments after the shot is fired. You see a silhouette that appears to stand and move away from the roof's edge. Using videos taken near the stage, Sky News was able to confirm that this position has a direct line of sight to where Kirk was sitting at the time of the attack. Audio analyst Rob Maher has estimated the distance the shot travelled, reaching a similar conclusion to Sky News' analysis. \"The time gap between the crack sound and the pop sound in the recordings close to the podium is about 240 milliseconds,\" he told Sky News. \"Since the exact trajectory of the bullet and the bullet's speed is not known, I have to make an assumption that the bullet speed was likely about 800 meters per second. With that assumption, the time gap indicates that the firearm was likely about 140m from the podium\". What weapon was used?  The weapon suspected of being used in the shooting has been found, according to FBI agent Robert Bohls, who told a news briefing in Orem, Utah, that it was a \"high-powered, bolt-action rifle\". \"That rifle was recovered in a wooded area where the shooter had fled,\" he said. \"The FBI laboratory will be analysing this weapon.\" Mr Bohls added that they also found an \"impression of a palm print and forearm imprints for analysis\"; however the shooter remained at large. Firearms consultant David Dyson told Sky News that, based on the range from where they are believed to have fired, the gunman would likely need to be a somewhat skilled target shooter. But he suggested that while the shot may be difficult for anyone without experience, it's \"not a great range\" for someone with practice. \"There's target disciplines, for instance, [at] 800m. So you can shoot quite accurately at far greater distances than 150 yards,\" he said. \"If we're in that sort of ballpark, then you're not looking at somebody with phenomenal skill,\" he added. What do we know about the shooter? A manhunt is under way for the killer, which began on the university campus but has now extended beyond. Police radio recordings show the first mention of the incident at 12.26pm, about six minutes after the shooting occurred. Officers were on the scene within minutes, with one officer describing the suspect at 12.35pm as \"wearing jeans, black shirt, black mask, long rifle\".   By 12.58pm, 32 mins after the shooting, armed officers could be seen checking the perimeter of the Losee building. In an update on Thursday, authorities offered a few more details about the shooter, who they referred to as a male. Beau Mason, commissioner of the Department of Public Safety, said he \"appears to be of college age\" and that he \"blended in well with a college institution\". The authorities added they were \"doing everything we can to find him\" but that \"we're not sure how far he has gone yet\". The FBI later released images of a \"person of interest\" in the shooting. Two people were arrested after the shooting, but neither was determined to have any connection with the shooting and were later released. What sort of security was on site?  Witnesses have spoken about a supposed lack of security checkpoints, with people being able to walk into the event with backpacks without being searched. \"Anybody in the world could park anywhere around the university and walk right in,\" one witness told Sky News affiliate NBC news. Read more:Who was Charlie Kirk? The young MAGA influencer 'admired' by TrumpKilling of MAGA icon could be a moment of jeopardy for America The UVU website states that \"generally, anyone is allowed to enter areas that are open to the public\" but non-public areas are restricted by \"access cards, locked doors, or monitored entryways\". A 2012 drone video shows the area around the shooter's location on the 4th floor. A metal railing encloses an accessible balcony area which means that to reach the roof where the shot was taken, they could have climbed or jumped over the railing. Extra security measures were put in place for the event. UVU Police Chief Jeff Long said six police officers were there as well as plainclothes police officers in the crowd. Chief Long confirmed that Mr Kirk also had a security team, which travels with him, and said he coordinated with Mr Kirk's lead security officer. Analysis of the videos from the event show at least four men, who appear to be Kirk's security team, surrounding the stage. \"We train for these things, and you think you have these things covered,\" Chief Jeff Long said in his statement last night. \"You try to get your bases covered and unfortunately today we didn't\". The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "Asylum seekers come face-to-face with migrant hotel critics",
        "description": "\"It makes me sad. We left when our country had the troubles so we should have in this world&#8230; the humanity\".",
        "url": "https://news.sky.com/story/what-did-we-do-wrong-asylum-seekers-come-face-to-face-with-migrant-hotel-critics-13428610",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tamworth-johnson_7016865.jpg?20250911105851",
        "type": "Home",
        "Author": "Becky Johnson",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "Some in Tamworth, Staffordshire, are \"annoyed, angry and fuming\" that asylum seekers are being housed in hotels - but those coming to the town say their \"only hope was England\".",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  \"It makes me sad. We left when our country had the troubles so we should have in this world… the humanity\". We're sitting in a cafe in Tamworth and Noor, 19, is explaining how it feels to know there are people in the town who don't want him here. Noor is from Afghanistan and came to the UK on a small boat. The cafe is close to the asylum hotel where he's staying. He's agreed to come along with four other men from the hotel to speak to locals about the concern in the town over the Staffordshire hotel being used to house asylum seekers. There was a peaceful demonstration outside the hotel last month. But last year, a protest here turned ugly. Windows were smashed, petrol bombs thrown, and part of the hotel was set alight. Among the locals in the cafe is Tom, 25, who reveals he was at both protests. \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 \n                  Labour consider using military barracks to house small boat migrants - as almost 1,100 arrive in one day\n                 \n                  Revealed: Huge rise in protests being dealt with by police\n                 He says he was persuaded to go by friends and explains to the group why they decided to go. \"They were annoyed, angry, fuming that the government had let them [asylum seekers] live in a hotel,\" he says. Noor, who speaks the best English of the asylum seekers in the group, replies: \"What did we do wrong?\" \"Your government accepts us as asylum seekers,\" he continues. Tom thinks. \"I'm more annoyed with the government than you guys,\" he tells them. 'A place to get the golden ticket' Noor explains to the group how he ended up in the UK. He left Afghanistan four years ago with his family but they were separated on the journey. He doesn't know where they are. Heather, a 29-year-old local accountant, speaks up. \"When people protest, I'm like, why don't you protest near the government?\" she asks. \"Why don't you take your issue to them rather than being outside the hotel?\" \"Those asylum seekers aren't going to change the policy at all,\" she adds. \"It's just going to make them fearful.\" Each of the locals in the cafe has their own take on why some don't like the asylum seekers living in their town. \"I think they feel like they're living better than the British people, some of them, and it's almost like they feel offended,\" says Andrew, 47. \"Some people in the UK see how the asylum seekers are coming over to Britain because they see it as a place to get the golden ticket,\" he adds.  Heather agrees. She says the NHS is a draw and the UK also has \"different border control regulations that might be seen as weaker than in some other countries\". \"You get to stay in a hotel,\" she tells the asylum seekers. \"You get the free health care. And so I think that's why they're a little bit annoyed.\" Noor replies: \"One thing I should tell you is that when we cross the English Channel, it means we don't care about our life. It's very dangerous.\" Read more:Protesters on why they oppose asylum hotelsThe key numbers driving the immigration debate Links to the UK I'm keen to know why they chose to come to Britain. Noor tells the group it's because he has a relative here and speaks the language. Azim, 22, who is also from Afghanistan, says he came here because people in the UK \"have respect to Islam\". He also has a family member here. I ask them if they could have claimed asylum in France, but Noor says his \"only hope was England\". He says it's \"better for education\" here. All the men agree it's seen as the better place to come. The conversation moves to the protests this summer which began in Epping, Essex, after an asylum seeker there was charged with sexually assaulting a schoolgirl - an offence he has now been convicted of.  Noor believes British people have a right to be angry about that. He tells the group he believes that asylum seekers who commit crimes \"should get back to their country\". \"We also [do] not support them,\" he says. Over the course of the meeting, the mood becomes more relaxed. People with different views find some common ground.  Noor tells the group that if things improve in Afghanistan he would like to go back there one day. If not, he hopes he'll stay in the UK and earn enough to repay in taxes the bill for the hotel he's staying in now. It has been a frank exchange. Some in this town will never want asylum seekers here and people like Noor and Azim know it. But they were placed here by the Home Office and can only wait until their asylum claims are processed."
    },
    {
        "title": "No 10 appointed Mandelson despite security concerns, Sky News understands",
        "description": "The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands.",
        "url": "https://news.sky.com/story/no-10-appointed-mandelson-despite-security-concerns-sky-news-understands-13428814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016850.jpg?20250911104627",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-09-11 13:44:00",
        "Headline": "Number 10 say developed vetting was done by the Foreign, Commonwealth and Development Office in the normal way.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands. Downing Street today defended the extensive vetting process which senior civil servants go through in order to get jobs, raising questions about whether or not they missed something or No 10 ignored their advice. Politics Live: Mandelson sacked as US ambassador following 'new information' Sky News has been told by two sources that the security services did flag concerns as part of the process. No 10 did not judge these concerns as enough to stop the ambassadorial appointment. It is not known whether all of the detail was shared with Prime Minister Sir Keir Starmer personally. Sky News has been told some members of the security services are unhappy with what has taken place in Downing Street. \n                  Without Angela Rayner 'there will be no holding back' Labour's left wing\n                 \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 Lord Mandelson is close to Sir Keir's chief of staff, Morgan McSweeney, who is known to have been keen on the appointment - and the pair spoke regularly. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". \"This is managed at departmental level by the agency responsible, and any suggestion that No 10 was involved is untrue,\" he told reporters. Asked repeatedly if any concerns were flagged to No 10 by the agencies that conducted the vetting of Lord Mandelson, he did not dismiss the assertion, repeating that No10 did not conduct the vetting.  Conservative leader Kemi Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". \"That is another unforgiveable error of judgement from Keir Starmer,\" Ms Badenoch said.  The Liberal Democrats have called for a full review of vetting procedures. \"Our country cannot be put in a position where we could be embarrassed on the international stage because of the Government not carrying out appropriate levels of due diligence,\" the party's deputy leader Daisy Cooper said. Read more:Starmer sacks Mandelson as US ambassadorAnalysis: Mandelson is never far from a scandal Lord Mandelson was sacked as the UK's ambassador to the US by Sir Keir earlier on Thursday over his ties to disgraced financier Jeffrey Epstein. The prime minister, who selected Lord Mandelson for the role, made the decision after new emails revealed the Labour peer sent messages of support to Epstein even as he faced jail for sex offences in 2008. In one particular message, Lord Mandelson had suggested that Epstein's first conviction was wrongful and should be challenged. The Foreign Office said the emails showed \"the depth and extent of Peter Mandelson's relationship with Jeffrey Epstein is materially different from that known at the time of his appointment\".  The decision to sack the diplomat was made by the prime minister and Foreign Secretary Yvette Cooper on Thursday morning, Sky News understands. This was after Sir Keir had reviewed all the new available information last night. It comes after a string of allegations around the diplomat's relationship with Epstein, which emerged in the media this week, including a 2003 birthday message in which he called the sex offender his \"best pal\". Further allegations were then published in The Telegraph on Wednesday morning, suggesting that Lord Mandelson had emailed Epstein to set up business meetings following the latter's conviction for child sex offences in 2008. Additional emails were then published detailing how the diplomat wrote to Epstein the day before he went to prison in June 2008 to serve time for soliciting sex from a minor. Lord Mandelson said: \"I think the world of you.\"  Lord Mandelson has written a letter to staff at the British embassy in Washington following his sacking. He says that being ambassador has been \"the privilege of my life\" and that he \"deeply regrets\" the circumstances around his departure. The former US ambassador adds that he continues \"to feel utterly awful about my association with Epstein 20 years ago and the plight of his victims\"."
    },
    {
        "title": "Starmer ousted Mandelson quickly - but questions remain about his political judgement",
        "description": "Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n",
        "url": "https://news.sky.com/story/starmer-ousted-mandelson-quickly-but-questions-remain-about-his-political-judgement-13428934",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016989.jpg?20250911152442",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-11 18:02:00",
        "Headline": "This is not the first time Lord Mandelson has resigned in disgrace. So why did Starmer let him back in?",
        "Content": "\n          Political editor\n              @BethRigby\n  Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n It was a friendship that endured even beyond Epstein's convictions and one on Thursday that ended Lord Mandelson's political career. Politics Live: Starmer accused of 'blatant disregard for national security considerations' When emails emerged of exchanges between the two men showing Lord Mandelson remaining supportive of Epstein even after he was convicted for the sex trafficking of underage girls, it was clear he had to go. Lord Mandelson tried to cling on. The PM summarily relieved him of his duties. There had initially been an appetite to keep him, in order to avoid embarrassing Donald Trump, who himself is being asked questions about his association with Epstein - and hates it. But when these emails emerged, it was clear to No 10 that the scandal would blow up the state visit and Mandelson had to go. \n                  How Sky News was frozen out by UK embassy after asking Mandelson about Epstein links\n                 \n                  Read Peter Mandelson's letter to US embassy staff after being sacked\n                 \n                  Mandelson sacked over Epstein \n                 But what was also true was that even attempting to keep him in these circumstances could blow up Sir Keir Starmer. The parliamentary party - and particularly many of the women MPs - were absolutely furious that Mandelson had backed a convicted paedophile against women and girls who had, to quote one victim, been passed to men by Epstein like fruit trays. The spectre of a powerful man like Mandelson trying to protect him and even the thought of the PM trying to row in behind was absolutely unconscionable. As Harriet Harman said on our Electoral Dysfunction podcast before he was sacked: \"These young women talked about the ruination of their lives by this man abusing his wealth and his power.  \"And the idea that Peter Mandelson sided with Epstein in that situation - and this is always the question - whose side are you on? \"You've got to be on the side of the vulnerable and not against the person who commits criminal offences, abusing their power.\" Harman also said she thought the prime minister would have been in \"anguish\" over having to defend Mandelson in the Commons. He looked almost as green as the green benches on Wednesday as he insisted he had full confidence in his ambassador, despite warnings from Mandelson himself that more embarrassing material was about to emerge. When that material did emerge, I understand that the PM spent the evening in Downing Street going through the material and then summoned his new Foreign Secretary Yvette Cooper, who has been a tireless champion in the fight to end violence against women and girls, for a meeting in which they decided to sack Mandelson. Read more:No 10 appointed Mandelson despite concernsAnalysis - why wasn't Mandelson fired yesterday?  That the US ambassador didn’t go of his own accord has angered many MPs and probably the PM, who has a record of prosecuting child sex offenders and made halving violence against women and girls a priority for this government. Now Mandelson has gone. But, with the end of that comes new questions. Questions about Keir Starmer’s political judgement. This is not the first time Lord Mandelson has resigned in disgrace. He stepped down as trade secretary over a loan from a colleague he failed to register under Tony Blair, and then quit again as Northern Ireland secretary over a cash for passports scandal. And now the question is, in light of the Epstein connection, why did Starmer let him back in? There is talk around Westminster that his key advisers had backed the move and Starmer had some reservations. As well he might, because in the end, the scandal of it all stops at the PM’s door. There are questions as to whether No 10 ignored concerns raised by the appointment and Badenoch is asking for full transparency. My colleague, Sam Coates, was told by two sources that the security services did flag concerns as part of the process.  It is not known whether all of the detail was shared with the prime minister personally. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". Then there is a bigger picture. Two weeks into a supposed reset, two scandals and two key figures gone from government. This was a PM who promised to do politics differently and clean up after the scandal-ridden Tory years. Peter Mandelson’s return to government and ousting in this manner casts a long shadow over the PM and that promise, and raises serious questions about the PM’s political judgement. It also casts a shadow over the upcoming state visit. It was only on Wednesday that No 10 was thinking about trying to keep Mandelson to try to avoid putting the spotlight back onto President Trump. With the White House, Royal Family and the UK government all tarnished by association with sex offender Jeffrey Epstein, this was an issue they all wanted to avoid and now it is top of the agenda."
    },
    {
        "title": "'They're in conditions you can't even imagine': Son of UK couple held in Iran renews plea for their release",
        "description": "\"Mum is teaching yoga and English to her cellmates in Iranian prison.\"",
        "url": "https://news.sky.com/story/theyre-in-conditions-you-cant-even-imagine-son-of-uk-couple-held-in-iran-renews-plea-for-their-release-13428712",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017162.jpg?20250911143110",
        "type": "Home",
        "Author": "John Sparks",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Speaking to Sky News, their son Joe Bennett explains how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds.",
        "Content": "\n          International correspondent\n              @sparkomat\n  \"Mum is teaching yoga and English to her cellmates in Iranian prison.\" It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Last week, during a long-awaited visit from British ambassador Hugo Shorter, it was confirmed that the pair continue to endure tough conditions with no indication of how - or when - the legal process will proceed. \"They're both coping, making the best of a bad situation. They're in conditions you can't even imagine.\" Speaking to Sky News, their son Joe Bennett explained how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds. \"The beds are stacked three high. It's unsanitary. It's hot. There are often power outages and they're in 50-degree heat.\" Lindsay and Craig, both 52, were arrested in early January in Iran, as they crossed the country on motorbikes as part of an around-the-world adventure. The couple had left Spain just a few weeks earlier and were aiming to drive all the way to Australia. They were charged with espionage and have been transferred to various prisons around Iran, with little information provided to British diplomatic staff about their whereabouts. Joe and the rest of the family have only managed to speak to their parents once on the phone. \"In a brief conversation that I had with my mum, we managed to share a laugh and a lot of tears as well. But it's a test of time, how long they can keep this up for.\" The UK ambassador's meeting with Craig was the first in over four months, and despite suffering from untreated dental pain, he quipped about becoming a \"reluctant Arsenal supporter\" while watching football on television with other prisoners. The couple were previously held together in a facility in the Iranian city of Kerman but have been moved to separate prisons in the capital, Tehran. Family members are calling on the Iranians to move Lindsay into the same facility where Craig is being detained. Their son acknowledged in his interview with Sky News that he was frustrated with his parents when they were arrested in January. Family members had urged them not to travel through the country. \"I had that natural reaction that some of the public do - why did they go? It's idiotic, you're going against the advice, and it serves them right. That's fair enough when you don't know them [but] just picture your parents having a bit of a sense of adventure… it's a different story.\" The Foreign, Commonwealth and Development Office says it is \"deeply concerned\" about the couple, adding, \"we continue to raise this case directly with the Iranian authorities\". Members of the Foreman family are urging the British government and the new foreign secretary, Yvette Cooper, to take direct action to improve harsh prison conditions and urgently organise for Lindsay and Craig's release. \"I need them home, you know, and I need them home as soon as possible. We need them, the family miss them dearly - so we're going to do everything we can to make that possible.\""
    },
    {
        "title": "Jair Bolsonaro: Brazil's former president sentenced to 27 years in jail for attempted coup",
        "description": "Brazil's former president Jair Bolsonaro has been sentenced to 27 years and three months in prison for attempting a coup to stay in power after his 2022 election defeat.",
        "url": "https://news.sky.com/story/jair-bolsonaro-brazils-former-president-sentenced-to-27-years-in-jail-for-attempted-coup-13428791",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jair-bolsonaro-brazil_7017478.jpg?20250911214647",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-11 13:08:00",
        "Headline": "A panel of Brazilian Supreme Court justices has sentenced the former president to 27 years and three months in prison for attempting a coup to stay in power.",
        "Content": "Brazil's former president Jair Bolsonaro has been sentenced to 27 years and three months in prison for attempting a coup to stay in power after his 2022 election defeat. The far-right politician, who ruled Brazil between 2019 and 2022, is currently under house arrest in the capital, Brasilia. A panel of five Supreme Court justices handed down the sentence several hours after they found the 70-year-old guilty on five counts. The counts were trying to stage a coup, being part of an armed criminal organisation, attempting violent abolition of the democratic rule of law, being implicated in violence, and posing a serious threat to the state's assets and listed heritage. Bolsonaro's lawyers have said they will appeal the verdict. The ruling will deepen political divisions in Brazil and is also likely to prompt a backlash from the United States government - with Donald Trump already sharing his thoughts on the vote. President Trump, an ally of Bolsonaro, has said he was surprised and \"very unhappy\" with the decision. \n                  Brazil's former president placed under house arrest after social media post\n                 \n                  Trump's trade war gets personal\n                 \n                  Brazil: Eight dead in hot air balloon crash, say officials\n                 Speaking to reporters outside the White House, he said he always found Bolsonaro \"outstanding\" and said the conviction is \"very bad for Brazil\". Mr Trump previously called the case a \"witch hunt\", slapped Brazil with tariff hikes, and revoked US visas for most members of Brazil's high court. Bolsonaro is the first former Brazilian president to be convicted of attempting a coup. He has not attended the court proceedings, and on Thursday, he was seen at the garage of his property, but did not talk to the media. Read more from Sky News:What we know about how Charlie Kirk was killedRead Mandelson's letter to US embassy staff after being sacked Justice Alexandre de Moraes, who has been overseeing the case, said on Tuesday that Bolsonaro was the leader of a coup plot and of a criminal organisation, and voted in favour of convicting him. Justices Flavio Dino, Carmen Lucia, and Cristiano Zanin sided with Justice Moraes in the trial. On Wednesday, another justice, Luiz Fux, disagreed and voted to acquit the ex-president of all charges. Justice Lucia said she was convinced by the evidence the attorney general's office put forward against Bolsonaro, saying: \"He is the instigator, the leader of an organisation that orchestrated every possible move to maintain or seize power.\" Bolsonaro had been previously banned from running for office until 2030 in a different case. He is expected to choose an heir who is likely to challenge President Luiz Inacio Lula da Silva next year."
    },
    {
        "title": "Vulnerable children in care being let down by 'dysfunctional' system, watchdog warns",
        "description": "The annual cost of children's residential care has almost doubled to &#163;3.1bn since 2019, putting pressure on local authority finances.",
        "url": "https://news.sky.com/story/vulnerable-children-in-care-being-let-down-by-dysfunctional-system-watchdog-warns-13428922",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-care-nao-children_7017384.png?20250911183936",
        "type": "Home",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "Children in residential care in England are moved around frequently, placed far from their original homes, and increasingly confined against their wishes, due to systemic failings outlined in a damning report by the National Audit Office.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n The annual cost of children's residential care has almost doubled to £3.1bn since 2019, putting pressure on local authority finances. The focus of the National Audit Office report is to evaluate the Department for Education's (DfE) response to the challenges facing local authorities, which have a duty to place looked after children. Its conclusion is that the system isn't providing value for money, with inadequate government oversight and lack of data contributing to the issue. One in seven children in residential care were moved home at least twice over the course of a year, as of the latest data for March 2024. And nearly 8,000 children in residential care in England are now placed more than 20 miles from their original family home. There are regional differences in supply affecting the availability of places, with more homes in cheaper areas such as the north west, while three in five children in the south west are placed far from home. \"Our main concern is that children are not being supported in the most appropriate setting for them. That will impact outcomes for them,\" Emma Willson, NAO director of value for money in education, told Sky News. The report highlights that looked after children already face numerous challenges - two in three have a history of abuse and neglect, and those leaving care are three times more likely not to be in education, training, or employment than their peers. \"For the department [DfE] to better fulfil its role overseeing the sector, it needs to build better information on both the supply and the availability of places, but also on the children's needs for those places to be able match,\" Ms Willson, who was lead author of the report, said. The distribution of homes that can support specific needs varies significantly, with fewer than 10% of homes in London able to support children with complex needs including autism and learning difficulties, as of the latest snapshot from 2020. A previous Ofsted report, published in 2022 found that 80% of children living in children's homes had special educational needs, much higher than the 52% of all looked after children and 15% of all children. Providers are responsible for staff recruitment and training so they can meet the needs of children in their care. However, the lack of suitable settings for children with complex needs means they are moved further from home as a result. Pressure on funding In recent years, the availability of foster placements has decreased, which the DfE suggests is due to wider economic pressures and housing shortages. Overall, spending on looked after children has increased by almost £3bn to £8.1bn from 2019/20 to 2023/24. The increase in spending on residential care contributed to more than half of increased spending. This is because local authorities have become more reliant on residential care, with 16,510 children in residential care in March 2024, an increase of 10% from 2020. A limited number of places for those children has resulted in a \"dysfunctional market\" where local authorities compete for places resulting in increasing costs. Most of the increase in overall number of residential providers is in the private sector, rather than through local authority or voluntary provision, and private provision now accounts for 84% of the market, increased from 76% five years ago. Though the number of homes has increased by 63%, the government does not hold data on how many places are available by provider, Ms Willson said. Barriers to opening new homes include staff shortages, high property prices, and difficulty securing planning permission. The average spend per child for a private residential placement in 2023/24 was £318,400 - an increase of 32% in real terms from £239,800 in 2019/20, while cases have been identified where costs are more than 10 times as high. A separate report from 2022 by the Competition Markets Authority found above expected profits. It estimated that from 2016 to 2020, the 15 largest private providers had average profit rates of 22.6% for children's homes, with prices increasing above inflation. 'A dysfunctional market' Sir Geoffrey Clifton-Brown, chair of the Committee of Public Accounts, said that \"skyrocketing\" costs of residential care \"have placed additional strain on already precarious local authority finances\". \"Lack of coordinated commissioning, insufficient forward planning and mismatches between supply and demand have all fuelled a dysfunctional market, as local authorities compete for placements and providers drive up prices,\" he commented. \"Although DfE has taken some steps towards establishing a more productive and resilient residential care market, it must do more to implement timely and decisive measures, ensuring that children are provided with the right care, in the right place, at the right cost.\" Local authorities have been turning to unregistered providers, and Ofsted reports indicate that at least 86% of local authorities had used such care. In 2023/24 there were 982 children confirmed to be placed in children's homes that were not registered with regulator Ofsted - which is illegal - increasing nearly sixfold from 147 in 2020/21. When sent a warning letter, just 6% of unregistered providers went on to apply for registration, and subsequently only 8% of those were approved, as of the latest figures for 2023/24. In December 2024, the Children's Commissioner found that 31% of children in unregistered placements were subject to a deprivation of liberty order court order, which is used to prevent people moving freely without permission or supervision under the mental health act. Recommendations for improvements As of July 2025, the DfE expects to invest £508m in capital funding across projects to create around 640 additional places in children's homes by 2029. \"The main finding there is that the department needs to better understand the places it has available to understand how this current spend on capital investment will actually address the gaps. Without that information it will not be able to tell whether it's been investing its capital investment in the right places to give children the right support in the right areas,\" Ms Willson said. \"The department does not have the data that it needs to, for example, identify a reasonable price or reasonable cost for residential care homes or to identify excessive profits,\" she added. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "Big questions remain over Harry and William's relationship despite a positive week",
        "description": "So that's it. The visit where Prince Harry met the King, after 19 months estranged from his father.",
        "url": "https://news.sky.com/story/big-questions-remain-over-harry-and-williams-relationship-despite-a-positive-week-13428911",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-sussex-prince-harry_7016906.jpg?20250911112100",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-11 16:55:00",
        "Headline": "The Duke of Sussex spent time with The Diana Award, an organisation set up in his mother's name and a team that he's never lost touch with.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  So that's it. The visit where Prince Harry met the King, after 19 months estranged from his father. There's no doubt it was the moment everyone was looking out for, but it was part of a trip that said so much more about Harry and where he's at right now. Before heading for the airport there was time for one last engagement. And one that had family at its heart. He spent time with The Diana Award, an organisation set up in his mother's name and a team that he's never lost touch with. In fact, with the CEO now having his personal email address, she told me it feels like they've had more contact since he embarked on this new life. In a week where all eyeballs have been on him, and who he's seen, they were aiming for the young people helped by the charity to take centre stage, but Harry's words of encouragement felt particularly personal and a reflection on his own journey. \"In every single young person and middle-aged person, and probably old people as well, our mental health and our emotional health through our nervous system is being tested every single day. And this proven model of being engaged with or finding your purpose with social action, it really does work\" he said, adding: \"My point is that if you're a young person it can sometimes feel as though you're lost and separated from a group and you feel isolated. But I can assure you that there's nothing wrong with you.\" This has felt like a very different trip back for him, where he seemed less isolated. With less secrecy about what he's been doing, there's been a calmness to it. It's five years since he left, and this week felt a little bit like we were watching in action how he's wanted this new life to play out. It feels like his move away from the UK has given him more of a global focus to his work, but with the heaviest reminder that he still wants to make a difference to his charity partners in the UK. Read more:Prince Harry says King is 'great' after first meeting for 19 monthsMeeting feels like a positive step - even if full reconciliation is likely to take time  Talking to the young people at The Diana Award event, I heard him say on a number of occasions, \"this isn't just about charity, it's an investment in your generation.\" For him, this is about being actively socially engaged, showing that style of empathetic leadership and using his convening power to leverage more support for the causes he cares about. Sound familiar? It's the same ethos I've heard from Prince William. And that's why there was a poignancy to the last event. The Diana Award is the one organisation that he still shares with his brother, and sadly, despite the positivity of the week, the big questions over their relationship still remain. An issue that they'd both agree should be just left to them."
    },
    {
        "title": "Final two candidates confirmed in Labour's deputy leadership race ",
        "description": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round. ",
        "url": "https://news.sky.com/story/final-two-candidates-confirmed-in-labours-deputy-leadership-race-13428905",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-11 16:37:00",
        "Headline": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will now battle for the support of the wider party membership. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round.  Ms Phillipson secured 175 nominations from colleagues by Thursday's 5pm deadline, while Ms Powell was backed by 117 MPs, according to the official tally from the Parliamentary Labour Party (PLP). Politics Live: Read Lord Peter Mandelson's letter to US embassy staff after being sacked Bell Ribeiro-Addy, the left-wing candidate, was much further adrift with 24 nominations - well shy of the 80 required to make it through to the next stage. In a video posted on X after the results came in, Ms Phillipson said she would give party members a \"strong voice at the cabinet table\". \"I'm so proud to have received the most nominations from Labour MPs and from seats right across the country,\" she added. \"My message to members is simple: I want to unite our party and our movement, deliver the change our country needs and beat Reform.\" \n                  No 10 appointed Mandelson despite security concerns, Sky News understands\n                 \n                  Starmer ousted Mandelson quickly - but questions remain about his political judgement\n                 \n                  Mandelson sacked over Epstein \n                 Meanwhile Ms Powell, who was sacked in Sir Keir Starmer's reshuffle last week, said she looked forward to making the case \"about the kind of full-time deputy leader I would be; laser focussed on connecting with our communities\". She vowed to act as a \"bridge for all parts\" of the party, adding: \"At a time when there are forces trying to spread division and hatred, Labour must be the voice of unity and hope.\" Ms Ribeiro-Addy announced earlier that she had not hit the threshold, posting on social media: \"Unfortunately, I have not secured the high number of nominations required to proceed in the deputy leadership contest. \"I am disappointed that the full range of Labour members' views will not be represented on the ballot paper.\" Three other candidates - housing minister Alison McGovern, Liverpool Wavertree MP Paula Barker and chair of the foreign affairs select committee Dame Emily Thornberry, all dropped out in the last 24 hours after struggling to get anywhere near 80 nominations. Many MPs had wanted a third candidate to make it to the next round to offer an alternative to the membership, as Ms Powell and Ms Phillipson, who appeared as the early frontrunners, are seen to be similar. One reluctant backer of Ms Powell's told Sky News that while she is \"more left than Bridget\" she is \"hardly a socialist\". Nominations only opened on Tuesday, leading to accusations from the left of a \"stitch-up\" aimed at preventing outsiders from having time to shore up a high level of support. (80 MPs is 20% of the parliamentary party).  Labour's ruling National Executive Committee set the rules of the contest, which was triggered by the resignation of Angela Rayner after she admitted to underpaying stamp duty on a flat she bought in Hove. The race is an unwelcome distraction for the prime minister, who just last week launched his phase two \"reset\" following a difficult first year in office and weeks of negative headlines on immigration. This was before the row over Ms Rayner's tax affairs kicked off - forcing her to also quit as housing secretary and deputy prime minister and sparking a wider government reshuffle. Some are seeing the race as a referendum on Sir Keir's leadership, with those unhappy with the direction of the party more likely to get behind Ms Powell, the MP for Manchester Central. However she has not been openly critical of the prime minister. As a cabinet minister, Houghton & Sunderland South MP Ms Phillipson is more likely to attract those loyal to the Labour leadership who want to avoid widening divisions within the party. Read More:Labour deputy leadership contest: How does it work and who is eligible to vote? The two finalists will now have to gain the backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties, in order to make it onto the ballot paper for the final vote of the membership. The result will be announced on 25 October, with the contest threatening to overshadow the upcoming annual party conference at the end of September. The deputy leader has the potential to be a powerful and influential figure as the link between members and the parliamentary Labour Party, and will have a key role in election campaigns. They can't be sacked by Sir Keir as they have their own mandate. However, whoever wins is unlikely to be made deputy prime minister. That position has gone to David Lammy, the former foreign secretary who is now also the justice secretary."
    },
    {
        "title": "Asylum seekers come face-to-face with migrant hotel critics",
        "description": "\"It makes me sad. We left when our country had the troubles so we should have in this world&#8230; the humanity\".",
        "url": "https://news.sky.com/story/what-did-we-do-wrong-asylum-seekers-come-face-to-face-with-migrant-hotel-critics-13428610",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tamworth-johnson_7016865.jpg?20250911105851",
        "type": "UK",
        "Author": "Becky Johnson",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "Some in Tamworth, Staffordshire, are \"annoyed, angry and fuming\" that asylum seekers are being housed in hotels - but those coming to the town say their \"only hope was England\".",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  \"It makes me sad. We left when our country had the troubles so we should have in this world… the humanity\". We're sitting in a cafe in Tamworth and Noor, 19, is explaining how it feels to know there are people in the town who don't want him here. Noor is from Afghanistan and came to the UK on a small boat. The cafe is close to the asylum hotel where he's staying. He's agreed to come along with four other men from the hotel to speak to locals about the concern in the town over the Staffordshire hotel being used to house asylum seekers. There was a peaceful demonstration outside the hotel last month. But last year, a protest here turned ugly. Windows were smashed, petrol bombs thrown, and part of the hotel was set alight. Among the locals in the cafe is Tom, 25, who reveals he was at both protests. \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 \n                  Labour consider using military barracks to house small boat migrants - as almost 1,100 arrive in one day\n                 \n                  Revealed: Huge rise in protests being dealt with by police\n                 He says he was persuaded to go by friends and explains to the group why they decided to go. \"They were annoyed, angry, fuming that the government had let them [asylum seekers] live in a hotel,\" he says. Noor, who speaks the best English of the asylum seekers in the group, replies: \"What did we do wrong?\" \"Your government accepts us as asylum seekers,\" he continues. Tom thinks. \"I'm more annoyed with the government than you guys,\" he tells them. 'A place to get the golden ticket' Noor explains to the group how he ended up in the UK. He left Afghanistan four years ago with his family but they were separated on the journey. He doesn't know where they are. Heather, a 29-year-old local accountant, speaks up. \"When people protest, I'm like, why don't you protest near the government?\" she asks. \"Why don't you take your issue to them rather than being outside the hotel?\" \"Those asylum seekers aren't going to change the policy at all,\" she adds. \"It's just going to make them fearful.\" Each of the locals in the cafe has their own take on why some don't like the asylum seekers living in their town. \"I think they feel like they're living better than the British people, some of them, and it's almost like they feel offended,\" says Andrew, 47. \"Some people in the UK see how the asylum seekers are coming over to Britain because they see it as a place to get the golden ticket,\" he adds.  Heather agrees. She says the NHS is a draw and the UK also has \"different border control regulations that might be seen as weaker than in some other countries\". \"You get to stay in a hotel,\" she tells the asylum seekers. \"You get the free health care. And so I think that's why they're a little bit annoyed.\" Noor replies: \"One thing I should tell you is that when we cross the English Channel, it means we don't care about our life. It's very dangerous.\" Read more:Protesters on why they oppose asylum hotelsThe key numbers driving the immigration debate Links to the UK I'm keen to know why they chose to come to Britain. Noor tells the group it's because he has a relative here and speaks the language. Azim, 22, who is also from Afghanistan, says he came here because people in the UK \"have respect to Islam\". He also has a family member here. I ask them if they could have claimed asylum in France, but Noor says his \"only hope was England\". He says it's \"better for education\" here. All the men agree it's seen as the better place to come. The conversation moves to the protests this summer which began in Epping, Essex, after an asylum seeker there was charged with sexually assaulting a schoolgirl - an offence he has now been convicted of.  Noor believes British people have a right to be angry about that. He tells the group he believes that asylum seekers who commit crimes \"should get back to their country\". \"We also [do] not support them,\" he says. Over the course of the meeting, the mood becomes more relaxed. People with different views find some common ground.  Noor tells the group that if things improve in Afghanistan he would like to go back there one day. If not, he hopes he'll stay in the UK and earn enough to repay in taxes the bill for the hotel he's staying in now. It has been a frank exchange. Some in this town will never want asylum seekers here and people like Noor and Azim know it. But they were placed here by the Home Office and can only wait until their asylum claims are processed."
    },
    {
        "title": "'They're in conditions you can't even imagine': Son of UK couple held in Iran renews plea for their release",
        "description": "\"Mum is teaching yoga and English to her cellmates in Iranian prison.\"",
        "url": "https://news.sky.com/story/theyre-in-conditions-you-cant-even-imagine-son-of-uk-couple-held-in-iran-renews-plea-for-their-release-13428712",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017162.jpg?20250911143110",
        "type": "UK",
        "Author": "John Sparks",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Speaking to Sky News, their son Joe Bennett explains how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds.",
        "Content": "\n          International correspondent\n              @sparkomat\n  \"Mum is teaching yoga and English to her cellmates in Iranian prison.\" It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Last week, during a long-awaited visit from British ambassador Hugo Shorter, it was confirmed that the pair continue to endure tough conditions with no indication of how - or when - the legal process will proceed. \"They're both coping, making the best of a bad situation. They're in conditions you can't even imagine.\" Speaking to Sky News, their son Joe Bennett explained how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds. \"The beds are stacked three high. It's unsanitary. It's hot. There are often power outages and they're in 50-degree heat.\" Lindsay and Craig, both 52, were arrested in early January in Iran, as they crossed the country on motorbikes as part of an around-the-world adventure. The couple had left Spain just a few weeks earlier and were aiming to drive all the way to Australia. They were charged with espionage and have been transferred to various prisons around Iran, with little information provided to British diplomatic staff about their whereabouts. Joe and the rest of the family have only managed to speak to their parents once on the phone. \"In a brief conversation that I had with my mum, we managed to share a laugh and a lot of tears as well. But it's a test of time, how long they can keep this up for.\" The UK ambassador's meeting with Craig was the first in over four months, and despite suffering from untreated dental pain, he quipped about becoming a \"reluctant Arsenal supporter\" while watching football on television with other prisoners. The couple were previously held together in a facility in the Iranian city of Kerman but have been moved to separate prisons in the capital, Tehran. Family members are calling on the Iranians to move Lindsay into the same facility where Craig is being detained. Their son acknowledged in his interview with Sky News that he was frustrated with his parents when they were arrested in January. Family members had urged them not to travel through the country. \"I had that natural reaction that some of the public do - why did they go? It's idiotic, you're going against the advice, and it serves them right. That's fair enough when you don't know them [but] just picture your parents having a bit of a sense of adventure… it's a different story.\" The Foreign, Commonwealth and Development Office says it is \"deeply concerned\" about the couple, adding, \"we continue to raise this case directly with the Iranian authorities\". Members of the Foreman family are urging the British government and the new foreign secretary, Yvette Cooper, to take direct action to improve harsh prison conditions and urgently organise for Lindsay and Craig's release. \"I need them home, you know, and I need them home as soon as possible. We need them, the family miss them dearly - so we're going to do everything we can to make that possible.\""
    },
    {
        "title": "No 10 appointed Mandelson despite security concerns, Sky News understands",
        "description": "The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands.",
        "url": "https://news.sky.com/story/no-10-appointed-mandelson-despite-security-concerns-sky-news-understands-13428814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016850.jpg?20250911104627",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-09-11 13:44:00",
        "Headline": "Number 10 say developed vetting was done by the Foreign, Commonwealth and Development Office in the normal way.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands. Downing Street today defended the extensive vetting process which senior civil servants go through in order to get jobs, raising questions about whether or not they missed something or No 10 ignored their advice. Politics Live: Mandelson sacked as US ambassador following 'new information' Sky News has been told by two sources that the security services did flag concerns as part of the process. No 10 did not judge these concerns as enough to stop the ambassadorial appointment. It is not known whether all of the detail was shared with Prime Minister Sir Keir Starmer personally. Sky News has been told some members of the security services are unhappy with what has taken place in Downing Street. \n                  Without Angela Rayner 'there will be no holding back' Labour's left wing\n                 \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 Lord Mandelson is close to Sir Keir's chief of staff, Morgan McSweeney, who is known to have been keen on the appointment - and the pair spoke regularly. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". \"This is managed at departmental level by the agency responsible, and any suggestion that No 10 was involved is untrue,\" he told reporters. Asked repeatedly if any concerns were flagged to No 10 by the agencies that conducted the vetting of Lord Mandelson, he did not dismiss the assertion, repeating that No10 did not conduct the vetting.  Conservative leader Kemi Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". \"That is another unforgiveable error of judgement from Keir Starmer,\" Ms Badenoch said.  The Liberal Democrats have called for a full review of vetting procedures. \"Our country cannot be put in a position where we could be embarrassed on the international stage because of the Government not carrying out appropriate levels of due diligence,\" the party's deputy leader Daisy Cooper said. Read more:Starmer sacks Mandelson as US ambassadorAnalysis: Mandelson is never far from a scandal Lord Mandelson was sacked as the UK's ambassador to the US by Sir Keir earlier on Thursday over his ties to disgraced financier Jeffrey Epstein. The prime minister, who selected Lord Mandelson for the role, made the decision after new emails revealed the Labour peer sent messages of support to Epstein even as he faced jail for sex offences in 2008. In one particular message, Lord Mandelson had suggested that Epstein's first conviction was wrongful and should be challenged. The Foreign Office said the emails showed \"the depth and extent of Peter Mandelson's relationship with Jeffrey Epstein is materially different from that known at the time of his appointment\".  The decision to sack the diplomat was made by the prime minister and Foreign Secretary Yvette Cooper on Thursday morning, Sky News understands. This was after Sir Keir had reviewed all the new available information last night. It comes after a string of allegations around the diplomat's relationship with Epstein, which emerged in the media this week, including a 2003 birthday message in which he called the sex offender his \"best pal\". Further allegations were then published in The Telegraph on Wednesday morning, suggesting that Lord Mandelson had emailed Epstein to set up business meetings following the latter's conviction for child sex offences in 2008. Additional emails were then published detailing how the diplomat wrote to Epstein the day before he went to prison in June 2008 to serve time for soliciting sex from a minor. Lord Mandelson said: \"I think the world of you.\"  Lord Mandelson has written a letter to staff at the British embassy in Washington following his sacking. He says that being ambassador has been \"the privilege of my life\" and that he \"deeply regrets\" the circumstances around his departure. The former US ambassador adds that he continues \"to feel utterly awful about my association with Epstein 20 years ago and the plight of his victims\"."
    },
    {
        "title": "Starmer ousted Mandelson quickly - but questions remain about his political judgement",
        "description": "Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n",
        "url": "https://news.sky.com/story/starmer-ousted-mandelson-quickly-but-questions-remain-about-his-political-judgement-13428934",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016989.jpg?20250911152442",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-11 18:02:00",
        "Headline": "This is not the first time Lord Mandelson has resigned in disgrace. So why did Starmer let him back in?",
        "Content": "\n          Political editor\n              @BethRigby\n  Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n It was a friendship that endured even beyond Epstein's convictions and one on Thursday that ended Lord Mandelson's political career. Politics Live: Starmer accused of 'blatant disregard for national security considerations' When emails emerged of exchanges between the two men showing Lord Mandelson remaining supportive of Epstein even after he was convicted for the sex trafficking of underage girls, it was clear he had to go. Lord Mandelson tried to cling on. The PM summarily relieved him of his duties. There had initially been an appetite to keep him, in order to avoid embarrassing Donald Trump, who himself is being asked questions about his association with Epstein - and hates it. But when these emails emerged, it was clear to No 10 that the scandal would blow up the state visit and Mandelson had to go. \n                  How Sky News was frozen out by UK embassy after asking Mandelson about Epstein links\n                 \n                  Read Peter Mandelson's letter to US embassy staff after being sacked\n                 \n                  Mandelson sacked over Epstein \n                 But what was also true was that even attempting to keep him in these circumstances could blow up Sir Keir Starmer. The parliamentary party - and particularly many of the women MPs - were absolutely furious that Mandelson had backed a convicted paedophile against women and girls who had, to quote one victim, been passed to men by Epstein like fruit trays. The spectre of a powerful man like Mandelson trying to protect him and even the thought of the PM trying to row in behind was absolutely unconscionable. As Harriet Harman said on our Electoral Dysfunction podcast before he was sacked: \"These young women talked about the ruination of their lives by this man abusing his wealth and his power.  \"And the idea that Peter Mandelson sided with Epstein in that situation - and this is always the question - whose side are you on? \"You've got to be on the side of the vulnerable and not against the person who commits criminal offences, abusing their power.\" Harman also said she thought the prime minister would have been in \"anguish\" over having to defend Mandelson in the Commons. He looked almost as green as the green benches on Wednesday as he insisted he had full confidence in his ambassador, despite warnings from Mandelson himself that more embarrassing material was about to emerge. When that material did emerge, I understand that the PM spent the evening in Downing Street going through the material and then summoned his new Foreign Secretary Yvette Cooper, who has been a tireless champion in the fight to end violence against women and girls, for a meeting in which they decided to sack Mandelson. Read more:No 10 appointed Mandelson despite concernsAnalysis - why wasn't Mandelson fired yesterday?  That the US ambassador didn’t go of his own accord has angered many MPs and probably the PM, who has a record of prosecuting child sex offenders and made halving violence against women and girls a priority for this government. Now Mandelson has gone. But, with the end of that comes new questions. Questions about Keir Starmer’s political judgement. This is not the first time Lord Mandelson has resigned in disgrace. He stepped down as trade secretary over a loan from a colleague he failed to register under Tony Blair, and then quit again as Northern Ireland secretary over a cash for passports scandal. And now the question is, in light of the Epstein connection, why did Starmer let him back in? There is talk around Westminster that his key advisers had backed the move and Starmer had some reservations. As well he might, because in the end, the scandal of it all stops at the PM’s door. There are questions as to whether No 10 ignored concerns raised by the appointment and Badenoch is asking for full transparency. My colleague, Sam Coates, was told by two sources that the security services did flag concerns as part of the process.  It is not known whether all of the detail was shared with the prime minister personally. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". Then there is a bigger picture. Two weeks into a supposed reset, two scandals and two key figures gone from government. This was a PM who promised to do politics differently and clean up after the scandal-ridden Tory years. Peter Mandelson’s return to government and ousting in this manner casts a long shadow over the PM and that promise, and raises serious questions about the PM’s political judgement. It also casts a shadow over the upcoming state visit. It was only on Wednesday that No 10 was thinking about trying to keep Mandelson to try to avoid putting the spotlight back onto President Trump. With the White House, Royal Family and the UK government all tarnished by association with sex offender Jeffrey Epstein, this was an issue they all wanted to avoid and now it is top of the agenda."
    },
    {
        "title": "Vulnerable children in care being let down by 'dysfunctional' system, watchdog warns",
        "description": "The annual cost of children's residential care has almost doubled to &#163;3.1bn since 2019, putting pressure on local authority finances.",
        "url": "https://news.sky.com/story/vulnerable-children-in-care-being-let-down-by-dysfunctional-system-watchdog-warns-13428922",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-care-nao-children_7017384.png?20250911183936",
        "type": "UK",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "Children in residential care in England are moved around frequently, placed far from their original homes, and increasingly confined against their wishes, due to systemic failings outlined in a damning report by the National Audit Office.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n The annual cost of children's residential care has almost doubled to £3.1bn since 2019, putting pressure on local authority finances. The focus of the National Audit Office report is to evaluate the Department for Education's (DfE) response to the challenges facing local authorities, which have a duty to place looked after children. Its conclusion is that the system isn't providing value for money, with inadequate government oversight and lack of data contributing to the issue. One in seven children in residential care were moved home at least twice over the course of a year, as of the latest data for March 2024. And nearly 8,000 children in residential care in England are now placed more than 20 miles from their original family home. There are regional differences in supply affecting the availability of places, with more homes in cheaper areas such as the north west, while three in five children in the south west are placed far from home. \"Our main concern is that children are not being supported in the most appropriate setting for them. That will impact outcomes for them,\" Emma Willson, NAO director of value for money in education, told Sky News. The report highlights that looked after children already face numerous challenges - two in three have a history of abuse and neglect, and those leaving care are three times more likely not to be in education, training, or employment than their peers. \"For the department [DfE] to better fulfil its role overseeing the sector, it needs to build better information on both the supply and the availability of places, but also on the children's needs for those places to be able match,\" Ms Willson, who was lead author of the report, said. The distribution of homes that can support specific needs varies significantly, with fewer than 10% of homes in London able to support children with complex needs including autism and learning difficulties, as of the latest snapshot from 2020. A previous Ofsted report, published in 2022 found that 80% of children living in children's homes had special educational needs, much higher than the 52% of all looked after children and 15% of all children. Providers are responsible for staff recruitment and training so they can meet the needs of children in their care. However, the lack of suitable settings for children with complex needs means they are moved further from home as a result. Pressure on funding In recent years, the availability of foster placements has decreased, which the DfE suggests is due to wider economic pressures and housing shortages. Overall, spending on looked after children has increased by almost £3bn to £8.1bn from 2019/20 to 2023/24. The increase in spending on residential care contributed to more than half of increased spending. This is because local authorities have become more reliant on residential care, with 16,510 children in residential care in March 2024, an increase of 10% from 2020. A limited number of places for those children has resulted in a \"dysfunctional market\" where local authorities compete for places resulting in increasing costs. Most of the increase in overall number of residential providers is in the private sector, rather than through local authority or voluntary provision, and private provision now accounts for 84% of the market, increased from 76% five years ago. Though the number of homes has increased by 63%, the government does not hold data on how many places are available by provider, Ms Willson said. Barriers to opening new homes include staff shortages, high property prices, and difficulty securing planning permission. The average spend per child for a private residential placement in 2023/24 was £318,400 - an increase of 32% in real terms from £239,800 in 2019/20, while cases have been identified where costs are more than 10 times as high. A separate report from 2022 by the Competition Markets Authority found above expected profits. It estimated that from 2016 to 2020, the 15 largest private providers had average profit rates of 22.6% for children's homes, with prices increasing above inflation. 'A dysfunctional market' Sir Geoffrey Clifton-Brown, chair of the Committee of Public Accounts, said that \"skyrocketing\" costs of residential care \"have placed additional strain on already precarious local authority finances\". \"Lack of coordinated commissioning, insufficient forward planning and mismatches between supply and demand have all fuelled a dysfunctional market, as local authorities compete for placements and providers drive up prices,\" he commented. \"Although DfE has taken some steps towards establishing a more productive and resilient residential care market, it must do more to implement timely and decisive measures, ensuring that children are provided with the right care, in the right place, at the right cost.\" Local authorities have been turning to unregistered providers, and Ofsted reports indicate that at least 86% of local authorities had used such care. In 2023/24 there were 982 children confirmed to be placed in children's homes that were not registered with regulator Ofsted - which is illegal - increasing nearly sixfold from 147 in 2020/21. When sent a warning letter, just 6% of unregistered providers went on to apply for registration, and subsequently only 8% of those were approved, as of the latest figures for 2023/24. In December 2024, the Children's Commissioner found that 31% of children in unregistered placements were subject to a deprivation of liberty order court order, which is used to prevent people moving freely without permission or supervision under the mental health act. Recommendations for improvements As of July 2025, the DfE expects to invest £508m in capital funding across projects to create around 640 additional places in children's homes by 2029. \"The main finding there is that the department needs to better understand the places it has available to understand how this current spend on capital investment will actually address the gaps. Without that information it will not be able to tell whether it's been investing its capital investment in the right places to give children the right support in the right areas,\" Ms Willson said. \"The department does not have the data that it needs to, for example, identify a reasonable price or reasonable cost for residential care homes or to identify excessive profits,\" she added. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "Final two candidates confirmed in Labour's deputy leadership race ",
        "description": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round. ",
        "url": "https://news.sky.com/story/final-two-candidates-confirmed-in-labours-deputy-leadership-race-13428905",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-11 16:37:00",
        "Headline": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will now battle for the support of the wider party membership. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round.  Ms Phillipson secured 175 nominations from colleagues by Thursday's 5pm deadline, while Ms Powell was backed by 117 MPs, according to the official tally from the Parliamentary Labour Party (PLP). Politics Live: Read Lord Peter Mandelson's letter to US embassy staff after being sacked Bell Ribeiro-Addy, the left-wing candidate, was much further adrift with 24 nominations - well shy of the 80 required to make it through to the next stage. In a video posted on X after the results came in, Ms Phillipson said she would give party members a \"strong voice at the cabinet table\". \"I'm so proud to have received the most nominations from Labour MPs and from seats right across the country,\" she added. \"My message to members is simple: I want to unite our party and our movement, deliver the change our country needs and beat Reform.\" \n                  No 10 appointed Mandelson despite security concerns, Sky News understands\n                 \n                  Starmer ousted Mandelson quickly - but questions remain about his political judgement\n                 \n                  Mandelson sacked over Epstein \n                 Meanwhile Ms Powell, who was sacked in Sir Keir Starmer's reshuffle last week, said she looked forward to making the case \"about the kind of full-time deputy leader I would be; laser focussed on connecting with our communities\". She vowed to act as a \"bridge for all parts\" of the party, adding: \"At a time when there are forces trying to spread division and hatred, Labour must be the voice of unity and hope.\" Ms Ribeiro-Addy announced earlier that she had not hit the threshold, posting on social media: \"Unfortunately, I have not secured the high number of nominations required to proceed in the deputy leadership contest. \"I am disappointed that the full range of Labour members' views will not be represented on the ballot paper.\" Three other candidates - housing minister Alison McGovern, Liverpool Wavertree MP Paula Barker and chair of the foreign affairs select committee Dame Emily Thornberry, all dropped out in the last 24 hours after struggling to get anywhere near 80 nominations. Many MPs had wanted a third candidate to make it to the next round to offer an alternative to the membership, as Ms Powell and Ms Phillipson, who appeared as the early frontrunners, are seen to be similar. One reluctant backer of Ms Powell's told Sky News that while she is \"more left than Bridget\" she is \"hardly a socialist\". Nominations only opened on Tuesday, leading to accusations from the left of a \"stitch-up\" aimed at preventing outsiders from having time to shore up a high level of support. (80 MPs is 20% of the parliamentary party).  Labour's ruling National Executive Committee set the rules of the contest, which was triggered by the resignation of Angela Rayner after she admitted to underpaying stamp duty on a flat she bought in Hove. The race is an unwelcome distraction for the prime minister, who just last week launched his phase two \"reset\" following a difficult first year in office and weeks of negative headlines on immigration. This was before the row over Ms Rayner's tax affairs kicked off - forcing her to also quit as housing secretary and deputy prime minister and sparking a wider government reshuffle. Some are seeing the race as a referendum on Sir Keir's leadership, with those unhappy with the direction of the party more likely to get behind Ms Powell, the MP for Manchester Central. However she has not been openly critical of the prime minister. As a cabinet minister, Houghton & Sunderland South MP Ms Phillipson is more likely to attract those loyal to the Labour leadership who want to avoid widening divisions within the party. Read More:Labour deputy leadership contest: How does it work and who is eligible to vote? The two finalists will now have to gain the backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties, in order to make it onto the ballot paper for the final vote of the membership. The result will be announced on 25 October, with the contest threatening to overshadow the upcoming annual party conference at the end of September. The deputy leader has the potential to be a powerful and influential figure as the link between members and the parliamentary Labour Party, and will have a key role in election campaigns. They can't be sacked by Sir Keir as they have their own mandate. However, whoever wins is unlikely to be made deputy prime minister. That position has gone to David Lammy, the former foreign secretary who is now also the justice secretary."
    },
    {
        "title": "Big questions remain over Harry and William's relationship despite a positive week",
        "description": "So that's it. The visit where Prince Harry met the King, after 19 months estranged from his father.",
        "url": "https://news.sky.com/story/big-questions-remain-over-harry-and-williams-relationship-despite-a-positive-week-13428911",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-sussex-prince-harry_7016906.jpg?20250911112100",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-11 16:55:00",
        "Headline": "The Duke of Sussex spent time with The Diana Award, an organisation set up in his mother's name and a team that he's never lost touch with.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  So that's it. The visit where Prince Harry met the King, after 19 months estranged from his father. There's no doubt it was the moment everyone was looking out for, but it was part of a trip that said so much more about Harry and where he's at right now. Before heading for the airport there was time for one last engagement. And one that had family at its heart. He spent time with The Diana Award, an organisation set up in his mother's name and a team that he's never lost touch with. In fact, with the CEO now having his personal email address, she told me it feels like they've had more contact since he embarked on this new life. In a week where all eyeballs have been on him, and who he's seen, they were aiming for the young people helped by the charity to take centre stage, but Harry's words of encouragement felt particularly personal and a reflection on his own journey. \"In every single young person and middle-aged person, and probably old people as well, our mental health and our emotional health through our nervous system is being tested every single day. And this proven model of being engaged with or finding your purpose with social action, it really does work\" he said, adding: \"My point is that if you're a young person it can sometimes feel as though you're lost and separated from a group and you feel isolated. But I can assure you that there's nothing wrong with you.\" This has felt like a very different trip back for him, where he seemed less isolated. With less secrecy about what he's been doing, there's been a calmness to it. It's five years since he left, and this week felt a little bit like we were watching in action how he's wanted this new life to play out. It feels like his move away from the UK has given him more of a global focus to his work, but with the heaviest reminder that he still wants to make a difference to his charity partners in the UK. Read more:Prince Harry says King is 'great' after first meeting for 19 monthsMeeting feels like a positive step - even if full reconciliation is likely to take time  Talking to the young people at The Diana Award event, I heard him say on a number of occasions, \"this isn't just about charity, it's an investment in your generation.\" For him, this is about being actively socially engaged, showing that style of empathetic leadership and using his convening power to leverage more support for the causes he cares about. Sound familiar? It's the same ethos I've heard from Prince William. And that's why there was a poignancy to the last event. The Diana Award is the one organisation that he still shares with his brother, and sadly, despite the positivity of the week, the big questions over their relationship still remain. An issue that they'd both agree should be just left to them."
    },
    {
        "title": "Chelsea hit with 74 charges by FA",
        "description": "Chelsea have been hit with 74 charges by the Football Association. ",
        "url": "https://news.sky.com/story/chelsea-hit-with-74-charges-by-fa-13428519",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-chelsea-premier-league_7016949.jpg?20250911114832",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-11 05:07:00",
        "Headline": "The charges relate to alleged breaches of the FA's agent regulations and third-party investment in players.",
        "Content": "Chelsea have been hit with 74 charges by the Football Association.  The charges relate to alleged breaches of the FA's agent regulations and third-party investment in players. The alleged breaches took place between 2009 and 2022, when the club was owned by Russian billionaire Roman Abramovich. They primarily relate to events which occurred between the 2010-11 and 2015-16 seasons. Chelsea said the issues were self-declared after the new owners discovered \"incomplete financial reporting\" when reviewing the club's activity during the takeover process. The Premier League club added: \"We will continue working collaboratively with the FA to conclude this matter as swiftly as possible.\" Sky Sports News understands there will not be a points deduction or sporting sanction if the charges are upheld but Chelsea could face a punishment similar to their recent settlement with UEFA, a €10m (£8.57m) fine. \n                  Asylum seekers come face-to-face with migrant hotel critics\n                 \n                  'They're in conditions you can't even imagine': Son of UK couple held in Iran renews plea for their release\n                 \n                  No 10 appointed Mandelson despite security concerns, Sky News understands\n                 SSN's chief correspondent, Kaveh Solhekol, said due diligence carried out by Chelsea's owners, BlueCo, during the takeover process \"is believed to have uncovered payments connected to transfers to offshore companies and players' families and representatives. \"The payments are believed to be millions of pounds and were not registered in accounts submitted to the FA, the Premier League and UEFA.\" Sky Sports News understands the transfers which raised potential concerns are believed to include deals for players such as Eden Hazard, Samuel Eto'o and Willian. There is no suggestion of any wrongdoing on the part of those players. Independent accounting analysts are understood to have informed Chelsea that even if the alleged irregular payments had been reported correctly at the appropriate times, the club would have always remained compliant with the Premier League's profitability and sustainability rules (PSR). In August 2023, Premier League chief executive Richard Masters said his organisation was investigating \"historical\" financial issues that the club had self-reported to the Premier League and to the FA. A league investigation into whether the club breached any of its rules remains ongoing, the Press Association understands. A spokesperson for Abramovich has been contacted for comment. Read more on Sky News:Lineker takes presenter prizeLord Mandelson sackedClub celebrates pop legend's support The previous month, Chelsea agreed to pay European football's governing body €10m after owning up to \"incomplete financial reporting\" under the Russian's regime. UEFA said it had been \"proactively\" approached with the information by Chelsea's new ownership group. The club has until 19 September to respond to the charges, the FA said."
    },
    {
        "title": "Man arrested after fire at MP Sharon Hodgson's constituency office",
        "description": "A man has been arrested following a fire at the constituency office of Labour MP Sharon Hodgson.",
        "url": "https://news.sky.com/story/police-investigation-after-incident-at-mp-sharon-hodgsons-constituency-office-13428624",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-hodgson_7016929.jpg?20250911114002",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-11 09:18:00",
        "Headline": "\"An incident occurred overnight at Sharon's office,\" a spokesperson for the Washington and Gateshead South MP said. Pictures from the scene show extensive fire damage.",
        "Content": " A man has been arrested following a fire at the constituency office of Labour MP Sharon Hodgson. Northumbria Police said the man, in his 20s, was arrested on suspicion of criminal damage and arson and remains in custody. \"Shortly after 12.20am today [Thursday], we were alerted to a fire at a premises on Woodland Terrace in the Washington area,\" a spokesperson said. \"Emergency services attended and no one is reported to have been injured in the incident.\" Tyne and Wear Fire and Rescue Service were called to the scene at Vermont House, home to the Sunderland constituency office of the Washington and Gateshead South MP, just past midnight. Drone pictures show extensive damage to the building. \"An incident occurred overnight at Sharon's office,\" a spokesperson for the Labour MP said. \"We will not be commenting or speculating while there is an ongoing police investigation, what we are clear on is there is no place for this kind of violence in our society. \"Sharon will not be deterred and will continue to support her constituents in Washington and Gateshead South as she does day in, day out. Constituents should get in touch with their issues by emailing in the usual way.\" Ms Hodgson has been a Labour MP in the north east of England since 2005. She is also the vice chair of Labour Friends of Israel. Chief fire officer, Peter Heath, said: \"I want to commend our crews for their swift and professional response to this serious incident. Their actions ensured the fire was contained quickly and safely, with no reported casualties. \"We continue to work closely with our partners as investigations progress.\" Councillor Phil Tye, chair of the Tyne and Wear Fire and Rescue Authority, said: \"Our thoughts are with everyone affected by this incident. I'd like to thank our firefighters and control staff for their dedication and teamwork during what may be a challenging investigation. \"We remain committed to supporting our communities and partners.\""
    },
    {
        "title": "Jair Bolsonaro: Brazil's former president sentenced to 27 years in jail for attempted coup",
        "description": "Brazil's former president Jair Bolsonaro has been sentenced to 27 years and three months in prison for attempting a coup to stay in power after his 2022 election defeat.",
        "url": "https://news.sky.com/story/jair-bolsonaro-brazils-former-president-sentenced-to-27-years-in-jail-for-attempted-coup-13428791",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jair-bolsonaro-brazil_7017478.jpg?20250911214647",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-11 13:08:00",
        "Headline": "A panel of Brazilian Supreme Court justices has sentenced the former president to 27 years and three months in prison for attempting a coup to stay in power.",
        "Content": "Brazil's former president Jair Bolsonaro has been sentenced to 27 years and three months in prison for attempting a coup to stay in power after his 2022 election defeat. The far-right politician, who ruled Brazil between 2019 and 2022, is currently under house arrest in the capital, Brasilia. A panel of five Supreme Court justices handed down the sentence several hours after they found the 70-year-old guilty on five counts. The counts were trying to stage a coup, being part of an armed criminal organisation, attempting violent abolition of the democratic rule of law, being implicated in violence, and posing a serious threat to the state's assets and listed heritage. Bolsonaro's lawyers have said they will appeal the verdict. The ruling will deepen political divisions in Brazil and is also likely to prompt a backlash from the United States government - with Donald Trump already sharing his thoughts on the vote. President Trump, an ally of Bolsonaro, has said he was surprised and \"very unhappy\" with the decision. \n                  Brazil's former president placed under house arrest after social media post\n                 \n                  Trump's trade war gets personal\n                 \n                  Brazil: Eight dead in hot air balloon crash, say officials\n                 Speaking to reporters outside the White House, he said he always found Bolsonaro \"outstanding\" and said the conviction is \"very bad for Brazil\". Mr Trump previously called the case a \"witch hunt\", slapped Brazil with tariff hikes, and revoked US visas for most members of Brazil's high court. Bolsonaro is the first former Brazilian president to be convicted of attempting a coup. He has not attended the court proceedings, and on Thursday, he was seen at the garage of his property, but did not talk to the media. Read more from Sky News:What we know about how Charlie Kirk was killedRead Mandelson's letter to US embassy staff after being sacked Justice Alexandre de Moraes, who has been overseeing the case, said on Tuesday that Bolsonaro was the leader of a coup plot and of a criminal organisation, and voted in favour of convicting him. Justices Flavio Dino, Carmen Lucia, and Cristiano Zanin sided with Justice Moraes in the trial. On Wednesday, another justice, Luiz Fux, disagreed and voted to acquit the ex-president of all charges. Justice Lucia said she was convinced by the evidence the attorney general's office put forward against Bolsonaro, saying: \"He is the instigator, the leader of an organisation that orchestrated every possible move to maintain or seize power.\" Bolsonaro had been previously banned from running for office until 2030 in a different case. He is expected to choose an heir who is likely to challenge President Luiz Inacio Lula da Silva next year."
    },
    {
        "title": "Police investigating 'multiple leads' in Charlie Kirk killing as FBI release images of 'person of interest'",
        "description": "Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\". ",
        "url": "https://news.sky.com/story/charlie-kirk-fbi-wants-to-trace-black-clad-person-in-sunglasses-and-hat-over-shooting-of-trump-ally-13428812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7017310.jpg?20250911171053",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-11 13:38:00",
        "Headline": "The suspect in the killing of Charlie Kirk has been confirmed as a male who \"appears to be of college age\", authorities have said.",
        "Content": " Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\".  The images show a person wearing a black baseball cap, black long-sleeved shirt, black trousers and sunglasses. FBI officials in the Salt Lake City office also announced a $100,000 (£73,000) reward in exchange for information leading to the identification of the attacker. Follow the latest updates on Charlie Kirk's killing Earlier, authorities said the sniper was thought to have jumped off a roof and fled into a neighbourhood after firing one shot. They also said the suspect was a male who \"appears to be of college age\" and blended in on the Utah Valley University campus in Orem where Mr Kirk was killed. Mr Kirk, a 31-year-old right-wing influencer, was fatally shot in the neck on Wednesday afternoon while speaking to university students at an event. He died in hospital after being shot. The rifle suspected of being used in the shooting has been found. In a briefing on Thursday, FBI agent Robert Bohls said: \"I can tell you that we have recovered what we believe is the weapon that was used in yesterday's shooting... is a high-powered bolt action rifle. \"That rifle was recovered in a wooded area where the shooter had fled. The FBI laboratory will be analysing this weapon.\" Investigators have collected a footwear impression, a palm print, and forearm imprints for analysis. Read more: Who was Charlie Kirk?Moment gunshot heard at university event - Watch The father-of-two was the chief executive and co-founder of Turning Point USA, a prominent organisation that engages conservative youth on school campuses. He had millions of followers across social media. Mr Kirk and Turning Point USA played a key role in driving youth support for Mr Trump in last November's presidential election. His events at college campuses nationwide typically drew large crowds. Many people listened both in person and online to Mr Kirk, as he advocated for conservatism among younger generations and became a leading voice in the Make America Great Again (MAGA) movement. President Donald Trump paid tribute to Mr Kirk while on stage at a 9/11 memorial event in Virginia, saying he would be awarding him the Presidential Medal of Freedom. \"Before we begin, let me express the horror and grief so many Americans at the heinous assassination of Charlie Kirk have felt,\" Mr Trump said. \"Charlie was a giant of his generation, a champion of liberty and an inspiration to millions and millions of people. Our prayers are with his wonderful wife, Erika, and his beautiful children.\" He later added the FBI was making \"big progress\" in finding the shooter and he has \"an indication\" of the motive, but declined to expand. \"He's an animal, total animal, hopefully they'll have him and they'll get him.\""
    },
    {
        "title": "'They're in conditions you can't even imagine': Son of UK couple held in Iran renews plea for their release",
        "description": "\"Mum is teaching yoga and English to her cellmates in Iranian prison.\"",
        "url": "https://news.sky.com/story/theyre-in-conditions-you-cant-even-imagine-son-of-uk-couple-held-in-iran-renews-plea-for-their-release-13428712",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017162.jpg?20250911143110",
        "type": "World",
        "Author": "John Sparks",
        "Date Published": "2025-09-11 23:01:00",
        "Headline": "It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Speaking to Sky News, their son Joe Bennett explains how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds.",
        "Content": "\n          International correspondent\n              @sparkomat\n  \"Mum is teaching yoga and English to her cellmates in Iranian prison.\" It's now over eight months since British couple Lindsay and Craig Foreman were detained in Iran. Last week, during a long-awaited visit from British ambassador Hugo Shorter, it was confirmed that the pair continue to endure tough conditions with no indication of how - or when - the legal process will proceed. \"They're both coping, making the best of a bad situation. They're in conditions you can't even imagine.\" Speaking to Sky News, their son Joe Bennett explained how the couple have been crammed into cells with more than 50 other prisoners, while suffering constant back pain caused by metal bunk beds. \"The beds are stacked three high. It's unsanitary. It's hot. There are often power outages and they're in 50-degree heat.\" Lindsay and Craig, both 52, were arrested in early January in Iran, as they crossed the country on motorbikes as part of an around-the-world adventure. The couple had left Spain just a few weeks earlier and were aiming to drive all the way to Australia. They were charged with espionage and have been transferred to various prisons around Iran, with little information provided to British diplomatic staff about their whereabouts. Joe and the rest of the family have only managed to speak to their parents once on the phone. \"In a brief conversation that I had with my mum, we managed to share a laugh and a lot of tears as well. But it's a test of time, how long they can keep this up for.\" The UK ambassador's meeting with Craig was the first in over four months, and despite suffering from untreated dental pain, he quipped about becoming a \"reluctant Arsenal supporter\" while watching football on television with other prisoners. The couple were previously held together in a facility in the Iranian city of Kerman but have been moved to separate prisons in the capital, Tehran. Family members are calling on the Iranians to move Lindsay into the same facility where Craig is being detained. Their son acknowledged in his interview with Sky News that he was frustrated with his parents when they were arrested in January. Family members had urged them not to travel through the country. \"I had that natural reaction that some of the public do - why did they go? It's idiotic, you're going against the advice, and it serves them right. That's fair enough when you don't know them [but] just picture your parents having a bit of a sense of adventure… it's a different story.\" The Foreign, Commonwealth and Development Office says it is \"deeply concerned\" about the couple, adding, \"we continue to raise this case directly with the Iranian authorities\". Members of the Foreman family are urging the British government and the new foreign secretary, Yvette Cooper, to take direct action to improve harsh prison conditions and urgently organise for Lindsay and Craig's release. \"I need them home, you know, and I need them home as soon as possible. We need them, the family miss them dearly - so we're going to do everything we can to make that possible.\""
    },
    {
        "title": "Qatari PM says Israel 'killed any hope' of releasing hostages as criticism over Doha attack intensifies",
        "description": "Qatar's prime minister said Israel has \"killed any hope\" of seeing more hostages returned from Gaza after carrying out an attack targeting Hamas leadership in his country.&#160;",
        "url": "https://news.sky.com/story/qatari-pm-says-israel-killed-any-hope-of-releasing-hostages-as-criticism-over-doha-attack-intensifies-13428564",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-doha-qatar_7015380.jpg?20250909162305",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-11 07:52:00",
        "Headline": "Sheikh Mohammed bin Abdulrahman Al Thani intensified his criticism of Israeli Prime Minister Benjamin Netanyahu over Tuesday's unprecedented strike on Qatar, which killed at least six people.",
        "Content": " Qatar's prime minister said Israel has \"killed any hope\" of seeing more hostages returned from Gaza after carrying out an attack targeting Hamas leadership in his country.  Sheikh Mohammed bin Abdulrahman Al Thani intensified his criticism of Israeli Prime Minister Benjamin Netanyahu over Tuesday's unprecedented strike on Qatar, which killed at least six people. \"I was meeting one of the hostage's families the morning of the attack,\" Sheikh Mohammed told CNN in an interview aired late Wednesday. \"They are counting on this [ceasefire] mediation, they have no other hope for that.\" Sheikh Mohammed added that he thought Netanyahu had \"just killed any hope for those hostages\".  A total of 48 Israeli hostages captured during Hamas' 7 October attacks on southern Israel have not been returned home. With its attack in Qatar, Israel had sought to kill the political leaders of the Islamist group Hamas. \n                  Journalist whose wife and children killed in Gaza says 'world treating us with indifference'\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  Bombs in Doha and drones in Poland \n                 Hamas has said its top leaders survived the airstrike, but five members were killed, including the son of its exiled Gaza chief and top negotiator Khalil al Hayya. The Israeli military operation in Doha has been widely condemned internationally and was particularly sensitive as Qatar has been mediating negotiations to bring about a ceasefire in the war in Gaza. US President Donald Trump reportedly held a heated phone call with Mr Netanyahu after the attack, telling him his decision to target Hamas leadership in Qatar was not wise, according to The Wall Street Journal. There has been no immediate acknowledgement of the remarks from Mr Netanyahu, however, he's continued to defend the strikes and threatened further action against Qatar. \"I say to Qatar and all nations who harbour terrorists, you either expel them or you bring them to justice,\" Mr Netanyahu said. \"Because if you don't, we will.\" Read more: Israel has crossed a huge diplomatic red line with Qatar strikeTrump has 'heated call' with Netanyahu over Qatar strike A senior figure in the Qatari government, Dr Majed Al-Ansari, was the one to announce to the world on X that America's call to alert them to the attack came 10 minutes after the first explosion sounded in Doha. Dr Al-Ansari, who serves as Qatar's foreign ministry spokesperson, recounted the moment of the attack to Sky News' correspondent Sally Lockwood. \"I was coming home to my family and the moment I stepped out of the car I started hearing the loud noises that can only be compared to bombs,\" he said. \"Being a diplomat and working for the foreign ministry throughout the mediation that we have conducted, I immediately knew that that meant that something terrible has happened. \"I can't tell you enough how as a father living here in Qatar, that moment was a moment of reckoning for me and for all my countrymen and people who reside here in Qatar, where our lives were at risk because of the narcissistic and personal ambitions of a political operator who wants to throw the whole region into chaos.\""
    },
    {
        "title": "'Europe's last dictator' frees more than 50 prisoners to ease sanctions in Trump trade ",
        "description": "A mass prisoner release for sanctions relief.",
        "url": "https://news.sky.com/story/europes-last-dictator-frees-over-50-prisoners-to-ease-sanctions-in-massive-moment-what-does-it-all-mean-13428920",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sviatlana-tsikhanouskaya_7017374.jpg?20250911182411",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-09-11 15:53:00",
        "Headline": "Some 52 detainees of various nationalities, including the UK, were freed in what is the biggest pardoning of political prisoners so far by Belarusian President Alexander Lukashenko, who has ruled the country for 31 years.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n A mass prisoner release for sanctions relief. That's the latest trade Donald Trump has made and it's with Belarusian President Alexander Lukashenko. It came after surprise talks in Minsk between US officials and the man often described as Europe's last dictator. We knew the two sides were talking - previous contacts led to the release of leading opposition activist Siarhei Tsikhanouski in June - but a prisoner release this big was unexpected. Some 52 detainees of various nationalities, including the UK, were freed in what is the biggest pardoning of political prisoners so far by Lukashenko, who has ruled Belarus for 31 years. It's far short of the 1,300 prisoners whose release Trump has been calling for since a phone call with Lukashenko last month. But it's a massive moment for a country where all forms of dissent and political freedoms have been practically wiped out. Similarly seismic is the lifting of some sanctions on the Belarusian national airline Belavia. It's only limited - allowing it to buy spare parts and service its fleet - and simultaneously benefits an American business in Boeing, but it's nevertheless symbolic. The first permanent removal of US sanctions, on either Russia or Belarus, since the invasion of Ukraine. So what does it mean? From Alexander Lukashenko, it's a sign that he wants to rekindle relations with the West after years of crippling sanctions. But don't expect any further prisoner releases to happen quickly. Political detainees are his bargaining chip - free them all and he loses his leverage. It'll be a drip feed. For Donald Trump, it could be an attempt to get closer to Vladimir Putin. Lukashenko is a close ally of the Russian president and could provide a strategic back-channel through which to apply pressure on the Kremlin when it comes to peace talks. But it could be more selfish than that, and merely his latest attempt to secure the Nobel Peace Prize. Read more from Sky News:Qatari PM says Israel 'killed any hope' of freeing hostagesUK to mass-produce drones to help Ukraine After all, Trump only raised the issue of Belarusian prisoners with Lukashenko last month, after receiving a plea from Dmitry Bolkunets, an exiled opposition activist, who told the US president he would nominate him for the Nobel prize if he was successful in liberating any prisoners. Either way, the timing is curious to say the least. It comes only a day after the incursion of multiple Russian drones into Polish and NATO airspace. According to Warsaw, some of the drones were even launched from neighbouring Belarus. This is further evidence, as if it's needed, that Trump is willing to ignore the noise, and the norms, in pursuit of his deal-centric diplomacy."
    },
    {
        "title": "UK to mass-produce drones to help Ukraine counter Russian air attacks",
        "description": "The UK will begin large-scale production of advanced interceptor drones to help Ukraine defend against Russian aerial assaults.",
        "url": "https://news.sky.com/story/uk-to-mass-produce-drones-to-help-ukraine-counter-russian-air-attacks-13428504",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kyiv-ukraine-russia-war-invasion_7015707.jpg?20250911101715",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-11 02:31:00",
        "Headline": "It marks the first initiative under a tech-sharing initiative between London and Kyiv, after Sir Keir Starmer and Volodymyr Zelenskyy signed an industrial deal earlier this year.",
        "Content": "The UK will begin large-scale production of advanced interceptor drones to help Ukraine defend against Russian aerial assaults. The drones, designed by Ukraine with support from British scientists, are highly effective at destroying the one-way attack aircraft Moscow continues to launch at Ukrainian cities, according to the Ministry of Defence (MoD). The announcement comes after suspected Russian drones that violated Polish airspace during overnight attacks on Ukraine were shot down by Polish and NATO forces. It was the first time a NATO country is known to have fired shots during Russia's war in Ukraine, raising concerns that the conflict is escalating. Britain said it was looking to help reinforce Poland's air defences. Defence Secretary John Healey is set to share more details about the new drone project at a trade show in London today. It is the first initiative under a technology-sharing agreement with Kyiv. 'A first of its kind deal' Prime Minister Sir Keir Starmer called the joint project \"a landmark moment\" and said the UK will continue to step up its support for Ukraine alongside allies. The MoD has said the new drones have already proved effective against the Iranian Shahed drones used by Russia, and are much cheaper to produce than traditional air defence missiles. Sir Keir and President Volodymyr Zelenskyy unveiled the UK-Ukraine industrial partnership earlier this summer. The agreement was expanded last week in Kyiv, where the defence secretary signed a deal enabling the joint development and sharing of intellectual property. \"This deal is a first of its kind, giving UK industry unprecedented access to the latest equipment designs, supporting Ukraine in its fight to defend against Putin's illegal invasion and showing how defence can be an engine for growth as we deliver on our Plan for Change,\" Mr Healey said. On Wednesday, Mr Healey held talks with defence officials from Poland, Italy, France and Germany, and condemned Russia's \"reckless\" incursion into Polish airspace. He said he asked the UK Armed Forces to look at options to bolster NATO's air defence over Poland.  Escalating tensions Polish Prime Minister Donald Tusk said the incursion by Russian drones marked \"the closest we have been to open conflict since World War Two\", but added that there was \"no reason to believe we're on the brink of war\". He said his country has asked that NATO's Article 4 be invoked, which allows alliance members to consult with other members on issues. Unlike Article 5, which has only been invoked once, Article 4 has been invoked seven times in NATO's history. Read more from Sky News:How Putin is testing the WestThe pivotal question for NATO following Poland incident Moscow denied responsibility for the incident, with the Russian defence ministry saying its drones had carried out a major attack in western Ukraine, but it had not planned to hit any locations in Poland. Poland reported that 19 aerial objects, many originating from Belarus, entered its airspace. The EU's top diplomat, Kaja Kallas, warned that \"Russia's war is escalating\" and called on the bloc to \"raise the cost on Moscow\" and invest in Europe's defence. Kremlin spokesperson Dmitry Peskov has said the EU and NATO \"accuse Russia of provocations on a daily basis\" and \"most of the time without even trying to present at least some kind of argument\"."
    },
    {
        "title": "Ireland will not participate in Eurovision if Israel is allowed to take part",
        "description": "Ireland will not participate in the Eurovision Song Contest next year if Israel is allowed to take part, RTE has announced.",
        "url": "https://news.sky.com/story/ireland-will-not-participate-in-eurovision-if-israel-is-allowed-to-take-part-13428743",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eden-golan-israel_7017103.jpg?20250911135805",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-11 12:05:00",
        "Headline": "Eurovision Song Contest's director Martin Green has said he would \"respect\" the decision of any country which chooses not to participate in the competition.",
        "Content": "Ireland will not participate in the Eurovision Song Contest next year if Israel is allowed to take part, RTE has announced. The Irish broadcaster said in a statement that a number of European Broadcasting Union (EBU) members raised concerns over the participation of Israel in the competition at the union's general assembly in July. RTE added that its \"position\" is that Ireland will not take part in the 2026 Eurovision Song Contest if the participation of Israel goes ahead. The broadcaster will make its \"final decision regarding Ireland's participation\" once the EBU decides whether Israel will take part, the statement continues. It adds: \"RTE wishes to thank the EBU for the extensive consultation process that was initiated on foot of that meeting, and the extension of the option to withdraw from participation without penalty to December.\" The statement added: \"RTE feels that Ireland's participation would be unconscionable given the ongoing and appalling loss of lives in Gaza. \"RTE is also deeply concerned by the targeted killing of journalists in Gaza, and the denial of access to international journalists to the territory, and the plight of the remaining hostages.\" \n                  Jair Bolsonaro: Brazil's former president sentenced to 27 years in jail for attempted coup\n                 \n                  Police investigating 'multiple leads' in Charlie Kirk killing as FBI release images of 'person of interest'\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 Ireland has won Eurovision seven times, the joint most of any country along with Sweden. Its last win was in 1996. Read more:Mandelson sacked as US ambassadorChelsea hit with 74 charges by FA  Eurovision Song Contest director Martin Green said: \"We understand the concerns and deeply held views around the ongoing conflict in the Middle East. We are still consulting with all EBU Members to gather views on how we manage participation and geopolitical tensions around the Eurovision Song Contest. \"Broadcasters have until mid-December to confirm if they wish to take part in next year's event in Vienna. It is up to each member to decide if they want to take part in the contest and we would respect any decision broadcasters make.\" The 70th anniversary edition of the contest is due to take place in Vienna, Austria, in May after Austrian entry JJ won with his song Wasted Love in Basel, Switzerland, earlier this year. Ireland was represented by Emmy in Basel, with the song Laika Party, while Israel was represented by Yuval Raphael, with her song New Day Will Rise. There has been growing controversy about Israel's participation in Eurovision with protests in host cities in the last two years."
    },
    {
        "title": "Police investigating 'multiple leads' in Charlie Kirk killing as FBI release images of 'person of interest'",
        "description": "Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\". ",
        "url": "https://news.sky.com/story/charlie-kirk-fbi-wants-to-trace-black-clad-person-in-sunglasses-and-hat-over-shooting-of-trump-ally-13428812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7017310.jpg?20250911171053",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-11 13:38:00",
        "Headline": "The suspect in the killing of Charlie Kirk has been confirmed as a male who \"appears to be of college age\", authorities have said.",
        "Content": " Police are investigating multiple leads in the deadly shooting of Trump ally Charlie Kirk in Utah after the FBI released two photos of a \"person of interest\".  The images show a person wearing a black baseball cap, black long-sleeved shirt, black trousers and sunglasses. FBI officials in the Salt Lake City office also announced a $100,000 (£73,000) reward in exchange for information leading to the identification of the attacker. Follow the latest updates on Charlie Kirk's killing Earlier, authorities said the sniper was thought to have jumped off a roof and fled into a neighbourhood after firing one shot. They also said the suspect was a male who \"appears to be of college age\" and blended in on the Utah Valley University campus in Orem where Mr Kirk was killed. Mr Kirk, a 31-year-old right-wing influencer, was fatally shot in the neck on Wednesday afternoon while speaking to university students at an event. He died in hospital after being shot. The rifle suspected of being used in the shooting has been found. In a briefing on Thursday, FBI agent Robert Bohls said: \"I can tell you that we have recovered what we believe is the weapon that was used in yesterday's shooting... is a high-powered bolt action rifle. \"That rifle was recovered in a wooded area where the shooter had fled. The FBI laboratory will be analysing this weapon.\" Investigators have collected a footwear impression, a palm print, and forearm imprints for analysis. Read more: Who was Charlie Kirk?Moment gunshot heard at university event - Watch The father-of-two was the chief executive and co-founder of Turning Point USA, a prominent organisation that engages conservative youth on school campuses. He had millions of followers across social media. Mr Kirk and Turning Point USA played a key role in driving youth support for Mr Trump in last November's presidential election. His events at college campuses nationwide typically drew large crowds. Many people listened both in person and online to Mr Kirk, as he advocated for conservatism among younger generations and became a leading voice in the Make America Great Again (MAGA) movement. President Donald Trump paid tribute to Mr Kirk while on stage at a 9/11 memorial event in Virginia, saying he would be awarding him the Presidential Medal of Freedom. \"Before we begin, let me express the horror and grief so many Americans at the heinous assassination of Charlie Kirk have felt,\" Mr Trump said. \"Charlie was a giant of his generation, a champion of liberty and an inspiration to millions and millions of people. Our prayers are with his wonderful wife, Erika, and his beautiful children.\" He later added the FBI was making \"big progress\" in finding the shooter and he has \"an indication\" of the motive, but declined to expand. \"He's an animal, total animal, hopefully they'll have him and they'll get him.\""
    },
    {
        "title": "What we know about how Charlie Kirk was killed",
        "description": "Chaos broke out at Utah Valley University when prominent right-wing influencer Charlie Kirk was shot dead in front of thousands of people. ",
        "url": "https://news.sky.com/story/what-we-know-about-how-charlie-kirk-was-killed-13428871",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7017281.jpg?20250911163830",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-11 15:13:00",
        "Headline": "Sky News' Data & Forensics team has tracked and mapped the events before, during and after the shooting to answer questions about the attack. ",
        "Content": " Chaos broke out at Utah Valley University when prominent right-wing influencer Charlie Kirk was shot dead in front of thousands of people.  Mr Kirk, 31, was speaking to students about mass shootings on Wednesday when he was shot in the neck, leading students to flee and a manhunt for the killer beginning. Many questions remain, with differing accounts and multiple videos across social media. The Sky News Data and Forensic team has tracked and mapped the events before, during and after the killing to find out as much as possible about what happened. When and where did the shooting happen?  Mr Kirk was speaking to around 3,000 people from under a small white tent on the campus when he was shot. The event was part of his \"prove me wrong\" series, which saw the right-wing influencer visit campuses across the country and debate contentious subjects like gun control, free speech, LGBTQ+ rights and abortion rights with left-wing students. The event began at roughly 12pm local time. Mr Kirk was taking questions about mass shootings and gun violence when, at roughly 12.20pm, he was shot. It was a single shot that struck him in the neck, a university spokesman confirmed. Madison Lattin, who was standing only a few dozen feet to the left of Mr Kirk when he was shot, said: \"Blood is falling and dripping down, and you're just like so scared, not just for him but your own safety.\" Footage from the scene showed Mr Kirk being carried away within seconds of the shooting. Where did the shot come from?  In a statement on Thursday, the FBI said they had tracked the gunman's movements onto the campus, \"through the stairwells, up to the roof, across the roof, to a shooting location\". They said they first tracked his movements from 11.52am, when they said he arrived on campus. Videos from the event show the gunman was on top of the Losee Centre building - just over 130m away from where Kirk was speaking, according to an online measuring tool. Two videos show a figure on the roof before and immediately after a shot is fired. The first video shows what appears to be someone lying down. The person filming says \"he just ran from over there\" - pointing in the direction of a stairwell coming up the roof. The second video is filmed in the moments after the shot is fired. You see a silhouette that appears to stand and move away from the roof's edge. Using videos taken near the stage, Sky News was able to confirm that this position has a direct line of sight to where Kirk was sitting at the time of the attack. Audio analyst Rob Maher has estimated the distance the shot travelled, reaching a similar conclusion to Sky News' analysis. \"The time gap between the crack sound and the pop sound in the recordings close to the podium is about 240 milliseconds,\" he told Sky News. \"Since the exact trajectory of the bullet and the bullet's speed is not known, I have to make an assumption that the bullet speed was likely about 800 meters per second. With that assumption, the time gap indicates that the firearm was likely about 140m from the podium\". What weapon was used?  The weapon suspected of being used in the shooting has been found, according to FBI agent Robert Bohls, who told a news briefing in Orem, Utah, that it was a \"high-powered, bolt-action rifle\". \"That rifle was recovered in a wooded area where the shooter had fled,\" he said. \"The FBI laboratory will be analysing this weapon.\" Mr Bohls added that they also found an \"impression of a palm print and forearm imprints for analysis\"; however the shooter remained at large. Firearms consultant David Dyson told Sky News that, based on the range from where they are believed to have fired, the gunman would likely need to be a somewhat skilled target shooter. But he suggested that while the shot may be difficult for anyone without experience, it's \"not a great range\" for someone with practice. \"There's target disciplines, for instance, [at] 800m. So you can shoot quite accurately at far greater distances than 150 yards,\" he said. \"If we're in that sort of ballpark, then you're not looking at somebody with phenomenal skill,\" he added. What do we know about the shooter? A manhunt is under way for the killer, which began on the university campus but has now extended beyond. Police radio recordings show the first mention of the incident at 12.26pm, about six minutes after the shooting occurred. Officers were on the scene within minutes, with one officer describing the suspect at 12.35pm as \"wearing jeans, black shirt, black mask, long rifle\".   By 12.58pm, 32 mins after the shooting, armed officers could be seen checking the perimeter of the Losee building. In an update on Thursday, authorities offered a few more details about the shooter, who they referred to as a male. Beau Mason, commissioner of the Department of Public Safety, said he \"appears to be of college age\" and that he \"blended in well with a college institution\". The authorities added they were \"doing everything we can to find him\" but that \"we're not sure how far he has gone yet\". The FBI later released images of a \"person of interest\" in the shooting. Two people were arrested after the shooting, but neither was determined to have any connection with the shooting and were later released. What sort of security was on site?  Witnesses have spoken about a supposed lack of security checkpoints, with people being able to walk into the event with backpacks without being searched. \"Anybody in the world could park anywhere around the university and walk right in,\" one witness told Sky News affiliate NBC news. Read more:Who was Charlie Kirk? The young MAGA influencer 'admired' by TrumpKilling of MAGA icon could be a moment of jeopardy for America The UVU website states that \"generally, anyone is allowed to enter areas that are open to the public\" but non-public areas are restricted by \"access cards, locked doors, or monitored entryways\". A 2012 drone video shows the area around the shooter's location on the 4th floor. A metal railing encloses an accessible balcony area which means that to reach the roof where the shot was taken, they could have climbed or jumped over the railing. Extra security measures were put in place for the event. UVU Police Chief Jeff Long said six police officers were there as well as plainclothes police officers in the crowd. Chief Long confirmed that Mr Kirk also had a security team, which travels with him, and said he coordinated with Mr Kirk's lead security officer. Analysis of the videos from the event show at least four men, who appear to be Kirk's security team, surrounding the stage. \"We train for these things, and you think you have these things covered,\" Chief Jeff Long said in his statement last night. \"You try to get your bases covered and unfortunately today we didn't\". The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "Who was Charlie Kirk? The young MAGA influencer 'admired' by Trump",
        "description": "Right-wing influencer Charlie Kirk has died after being shot while speaking to a large crowd on a university campus in Utah.",
        "url": "https://news.sky.com/story/who-was-charlie-kirk-the-young-maga-influencer-admired-by-trump-13428623",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-maga_7016852.jpg?20250911105122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-11 09:20:00",
        "Headline": "The 31-year-old, followed by millions of people on social media, was shot dead on Wednesday while hosting a debate among university students.",
        "Content": "Right-wing influencer Charlie Kirk has died after being shot while speaking to a large crowd on a university campus in Utah. He was speaking to students about mass shootings on Wednesday when he was shot in the neck, leading students to flee and triggering a manhunt for the killer. The 31-year-old Trump faithful was used to scores of people listening to him, both in person and online, as he advocated for conservatism among younger generations and became a leading voice in the Make America Great Again (MAGA) movement. \"No one understood or had the Heart of the Youth in the United States of America better than Charlie. He was loved and admired by ALL, especially me, and now, he is no longer with us,\" the president wrote on Truth Social after his death. But who was Charlie Kirk, what were his views and how did he become so influential?  From high school protests to the president's ally Despite being younger than many of his contemporaries, Mr Kirk, born in Chicago in 1993, had been a staple of the right for some time. His first taste of activism came when he and a classmate launched a protest against the rising price of food at his high school cafeteria. Soon after, as a high school senior, he wrote an opinion piece for the conservative news site Breitbart, in which he discussed liberalism in textbooks. It catapulted him into politics, helping him get appearances on Fox News and at right-wing rallies, where he soon met activist Bill Montgomery. Live updates on manhunt for Kirk's killer They co-founded Turning Point USA, a non-profit aimed at mobilising college-age Republicans, when Mr Kirk was just 18, in 2012. Turning Point would soon attach itself to Donald Trump's presidential campaign in 2016, and went on to become a hugely successful entity, raising hundreds of millions of dollars as it helped build a coalition of young conservatives around the country. The group's website says it has 450 members of staff and presences in 3,000 high schools and college campuses. While the organisation thrived, Mr Kirk became the young face of the MAGA movement on social media platforms, pushing Mr Trump's big points, including his false claim that the 2020 election was stolen. A day before the January 6th riots in 2021, he wrote on X that he was organising for \"buses of patriots\" to Washington to \"fight for the president\". At the time of his death, father-of-two Mr Kirk had become one of the biggest online voices on the American right, with 7.3 million followers on TikTok, 7 million on Instagram, 5 million on X and 3.5 million on YouTube. His podcast, The Charlie Kirk Show, is downloaded between 500,000 and 750,000 times each day, according to NBC News, and consistently charts highly on Spotify and Apple. His influence was not lost on Mr Trump. He often spoke favourably about Mr Kirk, including multiple times on the campaign trail last year. During a rally in Washington, the day before he was sworn in for a second term in January, Mr Trump told attendees: \"Charlie Kirk is here. And I want to thank Charlie. Charlie is fantastic. I mean, this guy.\" He also appeared last October at a Turning Point USA political rally in Phoenix, saying: \"I want to express my tremendous gratitude to Charlie Kirk. He's really an amazing guy. Amazing guy.\" Kirk shot while holding debate on mass shootings He was fierce in his right-wing views and a strong communicator, making him a polarising figure. Critics accused him of promoting falsehoods and conspiracy theories on issues including COVID-19, climate change and the 2020 US election. Yet Mr Kirk, however firm his beliefs, was always keen to hear opinions he disagreed with, often setting up \"prove me wrong\" tables at university events where people were encouraged to challenge his views. He would regularly debate left-wing students on contentious topics like gun control, free speech LGBTQ+ rights and abortion rights. It was during one of his \"prove me wrong\" segments at Utah Valley University - this one centred on mass shootings - that he was shot.  His friend Hogan Gidley, who was deputy press secretary for Mr Trump between 2019 and 2020, says what Mr Kirk did for MAGA and for conservatism is \"unparalleled\". \"At the same time, what he did to try to showcase the importance of discussion, just getting out there and saying your ideas, that's what's unbelievable,\" he adds, speaking to Sky's Trump 100 podcast. \"He kind of paved the way for so many in the younger generation to say, you don't have to be violent, you can use your words, you can use information, you can use data… he was a pioneer in that way.\"  Mr Kirk's own death was entirely against what he stood for, Mr Gidley says. \"He changed some hearts, he changed some minds - he made people angry,\" he says. \"But that's OK, because that's part of discussion and honest debate. \"What this devolved into… was something that was violent and that was disgusting and deplorable. It has no place in American politics, but debate and discussion absolutely do and Charlie Kirk led that way.\" Trump 'filled with grief and anger' Friends, admirers and those on the other side of politics have been paying tribute to Mr Kirk. Among them has been the president, who hailed him as a \"great, and even legendary\" figure who was \"loved and admired by all, especially me\".  In a video message, he said: \"I am filled with grief and anger at the heinous assassination of Charlie Kirk. \"He inspired millions and tonight all who knew him and loved him are united in shock and horror. \"This is a dark moment for America,\" Mr Trump added, as he vowed a crackdown on \"political violence\". Read more:Killing could be a moment of jeopardy for AmericaEyewitness: Even as mourners gathered, the blame game began Tributes have also come from former liberal presidents Joe Biden and Barack Obama. \"This kind of despicable violence has no place in our democracy,\" Mr Obama said. \"Michelle and I will be praying for Charlie's family tonight, especially his wife Erika and their two young children.\" What is happening now?  A manhunt is under way for Mr Kirk's killer, which began on the university campus but has now extended beyond. Two people were arrested after the shooting, but neither was determined to have any connection with the shooting and were later released, according to Utah public safety officials. As of late on Wednesday, no one was in custody, but the authorities are searching for a new person of interest. \"This is a dark day for our state. It's a tragic day for our nation,\" said Utah governor Spencer Cox. \"I want to be very clear, this is a political assassination.\""
    },
    {
        "title": "'Unique American phenomena' - The string of bloody political violence in the MAGA era",
        "description": "The killing of MAGA influencer Charlie Kirk is another grim episode in a continuing cycle of violence running through US politics.&#160;&#160;",
        "url": "https://news.sky.com/story/unique-american-phenomena-the-string-of-bloody-political-violence-in-the-maga-era-13428620",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-shooting_7016833.jpg?20250911102243",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-09-11 09:18:00",
        "Headline": "The death of Charlie Kirk raises familiar questions about political violence, gun control and how America became so deeply - and perhaps irrevocably - divided.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The killing of MAGA influencer Charlie Kirk is another grim episode in a continuing cycle of violence running through US politics.   An icon in right-wing youth circles, the media personality and podcaster was an ally of President Donald Trump and had a huge following. His death raises familiar questions about political violence, gun control and how America became so deeply - and perhaps irrevocably - divided. Here, Sky News looks at some of the most high-profile acts of violence in the US political scene since President Trump was first elected in 2016. It is not intended to be an exhaustive list. 2017: Shooting at charity baseball game injures prominent Republican politician Congressman Steve Scalise was among five wounded when a gunman opened fire in Virginia on people training for a charity baseball game. The ardent Trump supporter, who went on to become House majority leader, was injured as he and fellow Republicans practiced for a game against their Democratic rivals in Congress. The gunman, 66-year-old James T Hodgkinson, from Illinois, was shot by police and later died. He belonged to a Facebook group called \"Terminate the Republican Party\". 2018: Pipe bombs mailed to Democrats  In October 2018, several bombs were posted to high-profile critics of President Trump. A crude pipe bomb was discovered sent to President Barack Obama at his family home, hours after another was found addressed to Hillary Clinton. Pizza deliveryman Cesar Sayoc pleaded guilty to posting 16 devices \"designed to look like pipe bombs\". He claimed not to have wanted to hurt anyone, but acknowledged there was a risk the bombs could explode. Sayoc's lawyers argued that he was motivated by his obsession with President Trump and his anger at Democrats, whom he blamed for the vandalism of his van, which displayed Trump stickers, NPR reported. 2020: The plot to kidnap Gretchen Whitmer In October 2020, a plot by members of right-wing militia groups to kidnap Michigan Governor Gretchen Whitmer was foiled. Prosecutors said the plan was to break into Ms Whitmer's vacation home, kidnap her at gunpoint, and take her to stand \"trial\" on bogus treason charges and face execution. The group responsible were angry over public health measures imposed by the governor during the COVID-19 pandemic, and the attempted kidnapping was aimed at pushing America into armed conflict with the 2020 presidential election approaching, prosecutors said.  2021: Storming of the Capitol Perhaps the most high-profile episode of political violence in the US this century, many believe that the January 6 riots could have resulted in a coup. The incident in Washington DC saw crowds motivated by false claims that the 2020 election was stolen pour into the Capitol building. Four people died on the day of the violence and a number of police officers who were on duty have since taken their own lives. Efforts to impeach and prosecute President Trump over the tumultuous episode failed, with any investigations being abandoned following his re-election last year. Upon his return to the White House, he issued sweeping pardons for those jailed over the assault on the Capitol, including freeing people serving hefty sentences for seditious conspiracy. 2022: Attempted assassination of Brett Kavanaugh In June 2022, a man from California attempted to assassinate conservative Supreme Court Justice Brett Kavanaugh at his home in a DC suburb. Dressed in black, Nicholas John Roske was armed with a gun and knife and carried zip ties when he arrived in the middle of the night, authorities said. After his arrest, Roske told a police detective that he was upset by a leaked draft opinion suggesting the Supreme Court intended to overrule Roe v. Wade, the landmark abortion case, the FBI said. He pleaded guilty to attempted murder earlier this year. 2022: Attempted kidnap of Nancy Pelosi In October the same year, David DePape broke into then-US House speaker Nancy Pelosi's home and assaulted her husband with a hammer. DePape admitted that he intended to hold Ms Pelosi hostage and \"break her kneecaps\" if she lied to him, saying his plan was to end what he viewed as government corruption. He was found guilty and sentenced to 30 years in prison. 2024: Donald Trump shot at campaign rally The shot heard around the world, and the picture that may have won him the election. There have been multiple assassination attempts against President Trump, including the one in July 2024 when he was shot and wounded in his ear by 20-year-old Thomas Matthew Crooks. Crooks' motivations remain unclear. He was a registered Republican voter but federal campaign finance reports also show he gave $15 to a progressive political action committee on 20 January 2021, the day Biden was sworn into office. March 2025: New Mexico Republican Party HQ fire A blaze at the New Mexico Republican Party headquarters in March this year was being treated as arson. Incendiary materials were found on the scene, authorities said, and spray paint on the side of the building read \"ICE=KKK\". ICE - Immigration and Customs Enforcement - have become an increasingly visual presence in President Trump's sweeping deportations. April 2025: Democrat Governor's house set alight Pennsylvania Governor Josh Shapiro and his family were forced to flee in the middle of the night during Passover after an alleged arsonist set fire to their home in April 2025. A high-profile Democrat linked with presidential ambitions, Mr Shapiro said he, his wife, their four children, two dogs and another family were evacuated as the fire service tackled the flames. The motive was not immediately clear, but Mr Shapiro said officials believe it was a targeted attack. Attacks linked to anti-Musk sentiment Earlier this year, Elon Musk and his DOGE outfit were very high-profile in the Trump administration as they took a chainsaw to federal spending. The billionaire and his companies have been targeted by protesters and vandalism since he made what looked like a Nazi salute at Mr Trump's inauguration. May 2025: Two Israeli embassy employees killed in DC In May, two Israeli embassy workers were shot dead after they left an event at the Capital Jewish Museum in Washington DC. The suspect, Elias Rodriguez, from Chicago, was seen in footage chanting \"free, free Palestine\" as he was arrested. He is alleged to have told police: \"I did it for Gaza\". Authorities were investigating the killings of Sarah Milgrim and her boyfriend Yaron Lischinsky as both a hate crime against the Jewish community and terrorism. June 2025: Two Minnesota politicians and their spouses shot  In June, Minnesota state representative Melissa Hortman and her husband were shot dead in their home. John Hoffman, a state senator also for Minnesota, and his wife were also shot in their home but survived. Both politicians were members of the Minnesota Democratic-Farmer-Labor Party. Governor Tim Walz, Kamala Harris' running mate in the election last year, called it a \"politically-motivated assassination\". August 2025: Attack on CDC by vaccine sceptic In August, a man who had blamed the COVID-19 vaccine for making him depressed opened fire on the headquarters of America's national public health agency. Alleged shooter Patrick Joseph White tried to enter the CDC (Centres for Disease Control and Prevention) HQ in Atlanta but was stopped by guards. DeKalb County Police Officer David Rose, who had three children, was shot dead while responding to the incident. A 'unique American phenomena'? Professor Clionadh Raleigh, chief executive of the ACLED conflict data organisation, said Kirk's killing is \"another reminder of the ever-present risk of gun violence in the US\". But she added that such killings \"emphasise a unique American phenomena\". \"Despite politics in the US being strongly partisan and polarised, US political violence does not display any partisan inclination. \"The 'politics' behind this violence is rarely driven by an agenda, and is often incoherent and individualised.\" She added: \"The main threat in US political violence today comes from lone extremists, not organised militias or anything resembling precursors to civil war.\""
    },
    {
        "title": "What is Turning Point USA – the MAGA movement founded by Charlie Kirk?",
        "description": "Charlie Kirk was assassinated on the first stop of Turning Point USA's 'American Comeback Tour' of university campuses.",
        "url": "https://news.sky.com/story/what-is-turning-point-usa-8211-the-maga-movement-founded-by-charlie-kirk-13428550",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-tpusa-turning-point_7016938.jpg?20250911114605",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-11 06:50:00",
        "Headline": "TPUSA recruits 'field representatives' at universities and high schools in all 50 states to create forums for right-wing discussions on the economy, race, religion, and other issues.",
        "Content": "Charlie Kirk was assassinated on the first stop of Turning Point USA's 'American Comeback Tour' of university campuses. The 'prove me wrong' event where he was shot dead on Wednesday was one of thousands Kirk had hosted since he co-founded the movement in 2012. Manhunt underway for Kirk killer' - latest Turning Point claims to be the \"largest Conservative student movement\" in the US with groups at more than 3,500 universities and high schools, and \"exists to educate young people about the importance of limited government, free markets, and freedom\" - according to its website. Kirk and his wider movement have been credited with the surge in Gen Z voters who helped re-elect Donald Trump as president last year. In his tribute on Truth Social, Mr Trump said they had \"brought young people into the political process… better than anybody ever\".  What is Turning Point USA - and what does it stand for? Turning Point (TPUSA) is often described as one of the biggest youth movements in the US. It was set up as a non-profit organisation in the wake of Barack Obama's re-election to educate more young people about conservative politics and encourage others to spread the word. It recruits 'field representatives' at universities and high schools in all 50 states to create forums for right-wing discussions on the economy, race, religion, and other issues. TPUSA claims to be \"effectively reshaping the culture on college campuses\" and says its members are \"encouraged to be leaders in their communities and educate others on American ideals\". It describes its high school sub-section as a \"mobilisation of America's most spirited anti-woke warriors\" and a \"new generation of pro-America patriots\". Some of its campus events have led to clashes with left-wing groups. Read more:Who was Charlie Kirk?Eyewitness: The blame game for Kirk's death beginsKirk tributes pour in across political divide Kirk co-founded TPUSA the day after he finished high school with the help of ultra-conservative Tea Party activist Bill Montgomery, who convinced him to abandon his plans to go to university after hearing him speak. It is funded largely by conservative donors. Both the movement and Kirk himself have been in the spotlight over controversies, having expressed anti-transgender, COVID-sceptic, and pro-gun views, as well as support for the false claims that the 2020 election was \"stolen\" from Mr Trump. What else does it do? Outside of its schools and universities programmes, TPUSA hosts six national summits and eight regional conferences a year - and has several spin-off groups. Turning Point Action is its grassroots political arm, which talks to voters and helps get conservative candidates elected. Turning Point Faith focuses specifically on religious advocacy, and Turning Point Endowment is responsible for the organisation's charitable and financial activities. The movement has its own podcasts, which boast millions of downloads. The Charlie Kirk Show was hosted by Charlie himself and focuses largely on right-wing politics, while the Culture Apothecary is presented by Alex Clark and promotes conservative attitudes towards health, such as scepticism around birth control. In 2016, TPUSA created a Professor Watchlist website to list any academics it deemed to \"discriminate against conservative students and advance leftist propaganda in the classroom\". Similarly in 2021, it set up the School Board Watchlist, which publishes the names of school governors who have endorsed what it describes as \"anti-racist curricula\" or COVID mask mandates. In 2023, it merged with an organisation called Blexit, originally set up in response to a police killing of a black man in Minneapolis in 2016. Like TPUSA, the Blexit Foundation has 'chapters' and 'grassroots warriors' who promote the \"black exit from victimhood mentality\" and \"dispel the notion\" that black people are \"oppressed simply because of the colour of their skin\". This year, Kirk's wife, former Miss Arizona Erika Kirk, hosted TPUSA's largest ever young conservative women's event, where she encouraged them to put marriage and children above their careers. What's the link to MAGA and Donald Trump? TPUSA is often credited with galvanising young Trump supporters - during his successful 2016 and 2024 election campaigns, as well as the one that ended in defeat to Joe Biden in 2020. Mr Trump has spoken at TPUSA events alongside other prominent Republicans such as his former Vice President Mike Pence, Vice President JD Vance, and Florida Governor Ron DeSantis. Kirk attended both the president's inaugurations and was invited to visit him at the White House on several occasions. At his father's second inauguration ball in January, Donald Trump Jr described Kirk as \"one of the true rockstars of this movement\". In 2020, Kirk published a book called The MAGA Doctrine, taking its name from the Trump campaign slogan 'Make America Great Again'. In it, he claims: \"The movement that brought Donald Trump to the White House has better ideas than the old right or the new left. It's time the rest of America started listening.\" His supporters described it as a \"powerful reminder of the true narrative of freedom and greatness that swept Donald Trump to the presidency\". Although the term is loosely used to describe Trump supporters, since 2023, MAGA has been registered as a 'super PAC' or 'independent expenditure-only political action committee'. This means it is free to spend as much money as it wants on supporting him, but is banned from funding his official presidential campaigns directly."
    },
    {
        "title": "Lord Mandelson's exit leaves Donald Trump and his already controversial state visit in the lurch",
        "description": "Donald Trump's state visit was looking controversial enough.",
        "url": "https://news.sky.com/story/lord-mandelsons-exit-leaves-donald-trump-and-his-already-controversial-state-visit-in-the-lurch-13428826",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mandelson-trump_7012551.jpg?20250906052432",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-11 13:49:00",
        "Headline": "An effective ambassador to the court of King Donald, Lord Mandelson's departure from his key diplomatic role could hardly come at a worse time.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump's state visit was looking controversial enough. It is now happening off the back of a scandal that's claimed the scalp of the prime minister's man in Washington. That is more than unfortunate. Mandelson latest: 'New information' on Epstein link For all the faults that lost him his job, Lord Mandelson was an effective ambassador to the court of King Donald. He went from someone many thought completely unpalatable to the US president to earning the nickname the Trump whisperer. Peter Mandelson's charm, oleaginous to some, was ideally suited to stroking the presidential ego - as evidenced in that extraordinary Oval Office moment as Trump unveiled his trade agreement with the UK. And it was deployed in the grand Lutyens mansion that is the ambassador's residence on Massachusetts Avenue, courting the great and the good of the Trump era Washington. Replacing Lord Mandelson will take time.  A political appointment will be quicker than a civil service pick but there is unlikely to be time for either before Trump's state visit next week. Who is in the running to be US ambassador? Sir Keir Starmer could send back the former ambassador Karen Pierce. A skilled veteran diplomat, she is highly regarded by all sides of Washington's divided politics. But reappointing her would be an admission the prime minister made a mistake appointing Mr Mandelson instead of keeping her on, say diplomatic observers. Other possible contenders include former foreign secretary David Milliband, or former EU foreign affairs supremo Baroness Catherine Ashton. Also on the list of civil service favourites is Sir Philip Barton, the former deputy ambassador to Washington and permanent under-secretary at the Foreign Office. Mr Starmer could not have lost his ambassador at a worse time. When he invited Mr Trump for a second state visit, flourishing the King's letter in the Oval Office, it was seen as clever diplomacy. But Donald Trump's erratic behaviour has taken the shine off the achievement. That trade agreement with the UK - unveiled with such fanfare and nurtured by Lord Mandelson - has fallen short of its initial promise under deeper scrutiny. And the prime minister and the King will now be hosting a US president at odds with his European allies over Ukraine. Read more:No 10 appointed Mandelson despite concernsAnalysis - why wasn't Mandelson fired yesterday? Donald Trump has proven suspiciously close to Vladimir Putin, and, like the Russian leader, opposed to an immediate ceasefire and, for now at least, more severe sanctions on Russia's oil trade. The president's conduct over Iran and Gaza, and his unorthodox trade policies, deepen the chasm between the US and His Majesty's Government. His visit here will be unwelcome and deeply unpopular among many. That is only likely to aggravate relations with this prickly president further. Lord Mandelson's ability to reduce the fallout and navigate deeply problematic waters will be sorely missed."
    },
    {
        "title": "MPs seek COVID-19-style financial support cyberattack hit Jaguar Land Rover",
        "description": "An influential committee of MPs is seeking COVID-19-style financial support for Jaguar Land Rover as it tries to recover from a cyberattack. ",
        "url": "https://news.sky.com/story/mps-seek-covid-19-style-financial-support-cyberattack-hit-jaguar-land-rover-13428874",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-jaguar-land-rover_6876730.jpg?20250405140117",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-11 15:42:00",
        "Headline": "Firms across JLR's supply chain have warned the Business and Trade Committee of disruption to their businesses.",
        "Content": "An influential committee of MPs is seeking COVID-19-style financial support for Jaguar Land Rover as it tries to recover from a cyberattack.  After a week of plant closures, the Committee for Business and Trade has written to the chancellor, asking her what is being offered to the carmaker \"to mitigate the risk of significant, long-term commercial damage to affected firms\". The 34,000 UK workers of Jaguar Land Rover (JLR) are to remain at home until at least next week after a cyberattack discovered last week halted operations. Money blog: Football fans can be rejected from job if they support rival team Staff are still being paid from JLR sites in Halewood, Merseyside, and Solihull and Wolverhampton in the West Midlands, but the entire economy around the West Midlands is affected. JLR suppliers Evtec, WHS Plastics, SurTec and OPmobility have had to temporarily lay off roughly 6,000 staff. Operations could be disrupted for \"most of September\" or worse, according to a report from The Sunday Times. \n                  Jaguar Land Rover getting 'daily' support as workers told to stay at home\n                 \n                  Jaguar Land Rover staff home for another day as company reels from cyber attack\n                 \n                  Woman and three teenagers arrested over M&S, Co-op and Harrods cyber attacks\n                 On Thursday, Business and Trade Committee chair Liam Byrne wrote to Chancellor Rachel Reeves, saying: \"Firms across the supply chain are now warning the committee of disruption to both upstream and downstream businesses. \"This disruption, we are told, may imminently pose very significant risks to cashflow.\" Intervention, akin to the emergency steps taken to secure British Steel production, is suggested by Mr Byrne to \"protect sovereign areas of strength in the UK's industrial, scientific and technological base\". A group of English-speaking hackers claimed responsibility for the JLR attack via a Telegram platform called Scattered Lapsus$ Hunters, an amalgamation of the names of hacking groups Scattered Spider, Lapsus$ and ShinyHunters.  Scattered Spider, a loose group of relatively young hackers, were behind the Co-Op, Harrods and M&S attacks. Four people were arrested for their suspected involvement in the April attacks and have been bailed."
    },
    {
        "title": "M&S tech chief leaves months after cyber attack cost it £300m",
        "description": "The Marks & Spencer (M&S) executive responsible for its technology function is leaving the retailer months after a devastating cyber attack which disrupted its systems at a cost of hundreds of millions of pounds.",
        "url": "https://news.sky.com/story/ms-tech-chief-leaves-months-after-cyberattack-cost-it-163300m-13428656",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-11 10:11:00",
        "Headline": "Rachel Higham, a former BT and WPP executive who only joined Marks & Spencer last year, is leaving the company months after a devastating cyber attack, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Marks & Spencer (M&S) executive responsible for its technology function is leaving the retailer months after a devastating cyber attack which disrupted its systems at a cost of hundreds of millions of pounds. Sky News has learnt that Rachel Higham, M&S's chief digital and technology officer, is leaving the company. A former WPP and BT Group executive, Ms Higham was hired by M&S early last year. Money latest: How to give your child a financial head start Her departure was announced in an internal memo circulated on Thursday. In it, the company said she was \"stepping back from her role\". \"Rachel has been a steady hand and calm head at an extraordinary time for the business, and we wish her well for the future\". \n                  Woman and three teenagers arrested over M&S, Co-op and Harrods cyber attacks\n                 \n                  Cyber attack on M&S involved 'sophisticated impersonation', chairman says\n                 \n                  M&S resumes limited online sales after ransomware attack\n                  The April cyber attack on M&S, which was conducted by a group called Scattered Spider, brought its online operations to a halt, underlining the growing threat posed by such incidents. Its click-and-collect service is now back up and running, and the retailer expects part of its costs to be covered by insurance. M&S said early last month that it was not looking to replace Ms Higham following an enquiry from Sky News. It was unclear who would succeed her in the role or whether she would be eligible for a payoff. An M&S spokeswoman confirmed on Thursday that the memo was genuine but refused to comment further."
    },
    {
        "title": "Cinema giant Vue picks finance chief ahead of potential float",
        "description": "Vue, Europe's largest cinema operator, will on Friday announce the appointment of a new finance chief as its owners pave the way for a strategic review which could lead to a stock market flotation.",
        "url": "https://news.sky.com/story/cinema-giant-vue-picks-finance-chief-ahead-of-potential-float-13428903",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vue-cinema_7017371.jpg?20250911181720",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-11 16:34:00",
        "Headline": "Europe's largest cinema operator will on Friday announce the appointment of James McArthur as its chief financial officer as its owners pave the way for an eventual stock market listing, Sky News learns",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Vue, Europe's largest cinema operator, will on Friday announce the appointment of a new finance chief as its owners pave the way for a strategic review which could lead to a stock market flotation. Sky News has learnt that James McArthur, the former chief financial and transformation officer at HK Expeditions, the global expedition cruise company, will join the executive leadership team at Vue. His arrival will come as the shareholders who took control of the chain in a post-pandemic financial restructuring prepare to explore options for the business in the next 12 months. Money blog: Football fans can be rejected from job if they support rival team While no decisions have been taken or a formal process initiated, banking sources believe Vue is likely to examine opportunities for a sale or stock market listing in 2026. The business was previously owned by the Alberta Investment Management Corporation (AIMCo) and Omers, two Canadian pension funds. Mr McArthur will work alongside Tim Richards, Vue's founder and chief executive. The group now operates from more than 220 sites in eight countries, with close to 2,000 screens. It is a major player in the UK, where it has benefited from the crisis that saw Cineworld plunged into insolvency proceedings. Vue has launched a premium large-format experience called EPIC, which features new vision and sound technologies and is designed to differentiate the company from rivals, which also include Odeon. Read more:P&O Ferries hires new boss'Data affected' in Jaguar Land Rover cyber attack In a statement issued to Sky News, Mr Richards said: \"With our expanding estate, growing slate and fast-paced programme of investments and innovations, [Mr McArthur's] experience and expertise come at the perfect time.\" Vue declined to comment on the possibility of a stock market listing or other form of transaction."
    },
    {
        "title": "John Lewis blames budget tax hikes for deeper loss",
        "description": "The John Lewis Partnership (JLP) has blamed budget tax hikes for a deeper half-year loss.",
        "url": "https://news.sky.com/story/john-lewis-blames-budget-tax-hikes-for-deeper-loss-13428540",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-waitrose-store_6283976.jpg?20230914065101",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-11 06:06:00",
        "Headline": "The partnership says that despite the impact of the packaging tax and raised employer NI contributions, it is on track to grow annual profits thanks to a focus on investment ",
        "Content": "The John Lewis Partnership (JLP) has blamed budget tax hikes for a deeper half-year loss. The UK's largest employee-owned business, which owns John Lewis department stores and Waitrose supermarkets, reported a headline loss before tax and exceptional items of £34m for the six months to 26 July. That compared to a £5m loss in the same period last year. The higher figure was reached despite a 4% rise in group sales to £6.2bn. Money latest: How to give your child a financial head start \"This result was significantly impacted by costs not present in the equivalent prior period\", the partnership explained, \"including £29m of costs for the new Extended Producer Responsibility (EPR) packaging levy (where we took the full annual cost in our first half results), alongside higher National Insurance Contributions (NICs)\". JLP said the loss figure also reflected additional investment in its systems and growth-led teams. On a bottom line basis, the losses stood at £88m - up from £30m - as some exceptional costs associated with the group's turnaround and some non-cash impairments were included. \n                  MPs seek COVID-19-style financial support cyberattack hit Jaguar Land Rover\n                 \n                  M&S tech chief leaves months after cyber attack cost it £300m\n                 \n                  Cinema giant Vue picks finance chief ahead of potential float\n                 JLP insisted it was on track to grow profitability in the core second half of its financial year, despite a \"challenging\" macroeconomic environment, as both operations were outperforming in their respective markets.  The company cited benefits from its investment, which hit £191m over the six months, have been prioritised over partner bonuses during several years of recovery for the group that have seen underperforming department stores closed and jobs lost. Jason Tarry, the former Tesco executive who has chaired the partnership for a year, said the outlook was positive despite consumer confidence remaining subdued. \"Our clear focus on accelerating investment in our customers and our brands is working: more customers are shopping with us, driving sales, and helping Waitrose and John Lewis outperform their markets\", he said. \"We achieved our highest recorded levels of positive customer satisfaction, a testament to the great service of our partners. \"The investments we are making, combined with our plans for peak trading, provide a strong foundation for the remainder of the year. \"While we are reporting a loss in the first half, we're well positioned to deliver full-year profit growth, which we'll continue to invest in our customers and partners.\" Market analysts have cautioned that the sales figures are likely to have been flattered by the disruption to trading at rival M&S, which suffered a cyber attack in April. But Robyn Duffy, consumer markets senior analyst at RSM UK, said of the sales uplift: \"Waitrose’s performance has been a key driver, benefiting from a renewed focus on its food proposition, including a greater emphasis on lower prices and a more effective adoption of technology to improve the customer experience. \"Meanwhile, the John Lewis retail arm is successfully drawing in customers through a combination of revitalised physical stores, a focus on meaningful brand partnerships, and the reintroduction of its Never Knowingly Undersold price matching strategy.\" "
    },
    {
        "title": "P&O Ferries hires successor to controversial boss Peter Hebblethwaite",
        "description": "P&O Ferries has hired a former DFDS executive as successor to Peter Hebblethwaite, the man whose controversial fire-and-rehire policy earned him the nickname \"Britain's most hated boss\".",
        "url": "https://news.sky.com/story/po-ferries-hires-successor-to-controversial-boss-hebblethwaite-13428718",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-ferries-dover_6747123.jpg?20241113084438",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-11 11:38:00",
        "Headline": "The DP World-owned passenger ferry operator has recruited Kasper Moos, a former DFDS executive, to replace 'Britain's most hated boss', Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n P&O Ferries has hired a former DFDS executive as successor to Peter Hebblethwaite, the man whose controversial fire-and-rehire policy earned him the nickname \"Britain's most hated boss\". Sky News has learnt that Kasper Moos, a Dane, will become the chief executive of P&O Ferries later this month. Mr Moos, who has also held senior roles at AP Moller Maersk, the conglomerate, said in a memo circulated to P&O Ferries employees on Thursday: \"This is a globally recognised brand in the ferry industry, one that today provides vital passenger and freight connections between the UK and continental Europe, and within the UK. \"I am looking forward to getting to work, continuing the transformation of this great company, and ensuring we are providing our customers with the high quality service they need.\" Money latest: How to give your child a financial head start His arrival this month will ensure a smooth succession at the helm of the company, following Mr Hebblethwaite's scandal-hit tenure, in which he sacked hundreds of seafarers and replaced them with cheaper agency staff. Mr Hebblethwaite joined the ranks of Britain's most notorious corporate figures in 2022 when P&O Ferries, a subsidiary of the giant Dubai-based ports operator DP World, said it was sacking 800 staff with immediate effect - some of whom learned their fate via a video message. \n                  Passengers 'dropping like flies' after suspected norovirus outbreak on P&O cruise ship\n                 \n                  P&O spent £47m sacking and replacing 786 mainly British seafarers in 2022\n                 \n                  Why P&O Ferries' pariah status may never change\n                 The policy, which Mr Hebblethwaite defended to MPs during subsequent select committee hearings, erupted into a national scandal, prompting changes in the law to give workers greater protection. P&O Ferries carries 4.5 million passengers annually on routes between the UK and continental European ports including Calais and Rotterdam. It also operates a route between Northern Ireland and Scotland, and is a major freight carrier. The company's losses soared during the pandemic, with DP World - its sole shareholder - supporting it through hundreds of millions of pounds in loans. Its most recent accounts, which were significantly delayed, showed a significant reduction in losses in 2023 to just over £90m. The reduction from the previous year's figure of almost £250m was partly attributed to cost reduction exercises. Mr Hebblethwaite had argued since the mass sackings of 2022 that the company would have gone bust without the drastic cost-cutting that it entailed. The company insisted at the time that those affected by the redundancies had been offered \"enhanced\" packages to leave. Last October, the then transport secretary, Louise Haigh, said: \"The mass sacking by P&O Ferries was a national scandal which can never be allowed to happen again,\" adding that measures to protect seafarers from \"rogue employers\" would prevent a repetition. The minister's description of P&O Ferries as \"rogue\", and suggestion that consumers should boycott the company, sparked a row that threatened to overshadow the government's International Investment Summit last October. Sky News's business and economics correspondent, Paul Kelso, revealed that DP World had withdrawn from participating in the event, and paused a £1bn investment announcement. The company relented after Sir Keir Starmer publicly distanced the government from Ms Haigh's characterisation of DP World. A P&O Ferries spokesman confirmed Mr Moos's appointment."
    },
    {
        "title": "Final two candidates confirmed in Labour's deputy leadership race ",
        "description": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round. ",
        "url": "https://news.sky.com/story/final-two-candidates-confirmed-in-labours-deputy-leadership-race-13428905",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-11 16:37:00",
        "Headline": "Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will now battle for the support of the wider party membership. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Education Secretary Bridget Phillipson and former Commons leader Lucy Powell will go head-to-head for Labour's deputy leadership after the other candidates failed to make it through the first round.  Ms Phillipson secured 175 nominations from colleagues by Thursday's 5pm deadline, while Ms Powell was backed by 117 MPs, according to the official tally from the Parliamentary Labour Party (PLP). Politics Live: Read Lord Peter Mandelson's letter to US embassy staff after being sacked Bell Ribeiro-Addy, the left-wing candidate, was much further adrift with 24 nominations - well shy of the 80 required to make it through to the next stage. In a video posted on X after the results came in, Ms Phillipson said she would give party members a \"strong voice at the cabinet table\". \"I'm so proud to have received the most nominations from Labour MPs and from seats right across the country,\" she added. \"My message to members is simple: I want to unite our party and our movement, deliver the change our country needs and beat Reform.\" \n                  No 10 appointed Mandelson despite security concerns, Sky News understands\n                 \n                  Starmer ousted Mandelson quickly - but questions remain about his political judgement\n                 \n                  Mandelson sacked over Epstein \n                 Meanwhile Ms Powell, who was sacked in Sir Keir Starmer's reshuffle last week, said she looked forward to making the case \"about the kind of full-time deputy leader I would be; laser focussed on connecting with our communities\". She vowed to act as a \"bridge for all parts\" of the party, adding: \"At a time when there are forces trying to spread division and hatred, Labour must be the voice of unity and hope.\" Ms Ribeiro-Addy announced earlier that she had not hit the threshold, posting on social media: \"Unfortunately, I have not secured the high number of nominations required to proceed in the deputy leadership contest. \"I am disappointed that the full range of Labour members' views will not be represented on the ballot paper.\" Three other candidates - housing minister Alison McGovern, Liverpool Wavertree MP Paula Barker and chair of the foreign affairs select committee Dame Emily Thornberry, all dropped out in the last 24 hours after struggling to get anywhere near 80 nominations. Many MPs had wanted a third candidate to make it to the next round to offer an alternative to the membership, as Ms Powell and Ms Phillipson, who appeared as the early frontrunners, are seen to be similar. One reluctant backer of Ms Powell's told Sky News that while she is \"more left than Bridget\" she is \"hardly a socialist\". Nominations only opened on Tuesday, leading to accusations from the left of a \"stitch-up\" aimed at preventing outsiders from having time to shore up a high level of support. (80 MPs is 20% of the parliamentary party).  Labour's ruling National Executive Committee set the rules of the contest, which was triggered by the resignation of Angela Rayner after she admitted to underpaying stamp duty on a flat she bought in Hove. The race is an unwelcome distraction for the prime minister, who just last week launched his phase two \"reset\" following a difficult first year in office and weeks of negative headlines on immigration. This was before the row over Ms Rayner's tax affairs kicked off - forcing her to also quit as housing secretary and deputy prime minister and sparking a wider government reshuffle. Some are seeing the race as a referendum on Sir Keir's leadership, with those unhappy with the direction of the party more likely to get behind Ms Powell, the MP for Manchester Central. However she has not been openly critical of the prime minister. As a cabinet minister, Houghton & Sunderland South MP Ms Phillipson is more likely to attract those loyal to the Labour leadership who want to avoid widening divisions within the party. Read More:Labour deputy leadership contest: How does it work and who is eligible to vote? The two finalists will now have to gain the backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties, in order to make it onto the ballot paper for the final vote of the membership. The result will be announced on 25 October, with the contest threatening to overshadow the upcoming annual party conference at the end of September. The deputy leader has the potential to be a powerful and influential figure as the link between members and the parliamentary Labour Party, and will have a key role in election campaigns. They can't be sacked by Sir Keir as they have their own mandate. However, whoever wins is unlikely to be made deputy prime minister. That position has gone to David Lammy, the former foreign secretary who is now also the justice secretary."
    },
    {
        "title": "No 10 appointed Mandelson despite security concerns, Sky News understands",
        "description": "The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands.",
        "url": "https://news.sky.com/story/no-10-appointed-mandelson-despite-security-concerns-sky-news-understands-13428814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016850.jpg?20250911104627",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-11 13:44:00",
        "Headline": "Number 10 say developed vetting was done by the Foreign, Commonwealth and Development Office in the normal way.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The security services expressed concern about the appointment of Lord Mandelson as ambassador to Washington, but No 10 went ahead anyway, Sky News understands. Downing Street today defended the extensive vetting process which senior civil servants go through in order to get jobs, raising questions about whether or not they missed something or No 10 ignored their advice. Politics Live: Mandelson sacked as US ambassador following 'new information' Sky News has been told by two sources that the security services did flag concerns as part of the process. No 10 did not judge these concerns as enough to stop the ambassadorial appointment. It is not known whether all of the detail was shared with Prime Minister Sir Keir Starmer personally. Sky News has been told some members of the security services are unhappy with what has taken place in Downing Street. \n                  Without Angela Rayner 'there will be no holding back' Labour's left wing\n                 \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 Lord Mandelson is close to Sir Keir's chief of staff, Morgan McSweeney, who is known to have been keen on the appointment - and the pair spoke regularly. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". \"This is managed at departmental level by the agency responsible, and any suggestion that No 10 was involved is untrue,\" he told reporters. Asked repeatedly if any concerns were flagged to No 10 by the agencies that conducted the vetting of Lord Mandelson, he did not dismiss the assertion, repeating that No10 did not conduct the vetting.  Conservative leader Kemi Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". \"That is another unforgiveable error of judgement from Keir Starmer,\" Ms Badenoch said.  The Liberal Democrats have called for a full review of vetting procedures. \"Our country cannot be put in a position where we could be embarrassed on the international stage because of the Government not carrying out appropriate levels of due diligence,\" the party's deputy leader Daisy Cooper said. Read more:Starmer sacks Mandelson as US ambassadorAnalysis: Mandelson is never far from a scandal Lord Mandelson was sacked as the UK's ambassador to the US by Sir Keir earlier on Thursday over his ties to disgraced financier Jeffrey Epstein. The prime minister, who selected Lord Mandelson for the role, made the decision after new emails revealed the Labour peer sent messages of support to Epstein even as he faced jail for sex offences in 2008. In one particular message, Lord Mandelson had suggested that Epstein's first conviction was wrongful and should be challenged. The Foreign Office said the emails showed \"the depth and extent of Peter Mandelson's relationship with Jeffrey Epstein is materially different from that known at the time of his appointment\".  The decision to sack the diplomat was made by the prime minister and Foreign Secretary Yvette Cooper on Thursday morning, Sky News understands. This was after Sir Keir had reviewed all the new available information last night. It comes after a string of allegations around the diplomat's relationship with Epstein, which emerged in the media this week, including a 2003 birthday message in which he called the sex offender his \"best pal\". Further allegations were then published in The Telegraph on Wednesday morning, suggesting that Lord Mandelson had emailed Epstein to set up business meetings following the latter's conviction for child sex offences in 2008. Additional emails were then published detailing how the diplomat wrote to Epstein the day before he went to prison in June 2008 to serve time for soliciting sex from a minor. Lord Mandelson said: \"I think the world of you.\"  Lord Mandelson has written a letter to staff at the British embassy in Washington following his sacking. He says that being ambassador has been \"the privilege of my life\" and that he \"deeply regrets\" the circumstances around his departure. The former US ambassador adds that he continues \"to feel utterly awful about my association with Epstein 20 years ago and the plight of his victims\"."
    },
    {
        "title": "Starmer ousted Mandelson quickly - but questions remain about his political judgement",
        "description": "Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n",
        "url": "https://news.sky.com/story/starmer-ousted-mandelson-quickly-but-questions-remain-about-his-political-judgement-13428934",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7016989.jpg?20250911152442",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-11 18:02:00",
        "Headline": "This is not the first time Lord Mandelson has resigned in disgrace. So why did Starmer let him back in?",
        "Content": "\n          Political editor\n              @BethRigby\n  Jeffrey Epstein and Peter Mandelson, the paedophile and the peer. \n It was a friendship that endured even beyond Epstein's convictions and one on Thursday that ended Lord Mandelson's political career. Politics Live: Starmer accused of 'blatant disregard for national security considerations' When emails emerged of exchanges between the two men showing Lord Mandelson remaining supportive of Epstein even after he was convicted for the sex trafficking of underage girls, it was clear he had to go. Lord Mandelson tried to cling on. The PM summarily relieved him of his duties. There had initially been an appetite to keep him, in order to avoid embarrassing Donald Trump, who himself is being asked questions about his association with Epstein - and hates it. But when these emails emerged, it was clear to No 10 that the scandal would blow up the state visit and Mandelson had to go. \n                  How Sky News was frozen out by UK embassy after asking Mandelson about Epstein links\n                 \n                  Read Peter Mandelson's letter to US embassy staff after being sacked\n                 \n                  Mandelson sacked over Epstein \n                 But what was also true was that even attempting to keep him in these circumstances could blow up Sir Keir Starmer. The parliamentary party - and particularly many of the women MPs - were absolutely furious that Mandelson had backed a convicted paedophile against women and girls who had, to quote one victim, been passed to men by Epstein like fruit trays. The spectre of a powerful man like Mandelson trying to protect him and even the thought of the PM trying to row in behind was absolutely unconscionable. As Harriet Harman said on our Electoral Dysfunction podcast before he was sacked: \"These young women talked about the ruination of their lives by this man abusing his wealth and his power.  \"And the idea that Peter Mandelson sided with Epstein in that situation - and this is always the question - whose side are you on? \"You've got to be on the side of the vulnerable and not against the person who commits criminal offences, abusing their power.\" Harman also said she thought the prime minister would have been in \"anguish\" over having to defend Mandelson in the Commons. He looked almost as green as the green benches on Wednesday as he insisted he had full confidence in his ambassador, despite warnings from Mandelson himself that more embarrassing material was about to emerge. When that material did emerge, I understand that the PM spent the evening in Downing Street going through the material and then summoned his new Foreign Secretary Yvette Cooper, who has been a tireless champion in the fight to end violence against women and girls, for a meeting in which they decided to sack Mandelson. Read more:No 10 appointed Mandelson despite concernsAnalysis - why wasn't Mandelson fired yesterday?  That the US ambassador didn’t go of his own accord has angered many MPs and probably the PM, who has a record of prosecuting child sex offenders and made halving violence against women and girls a priority for this government. Now Mandelson has gone. But, with the end of that comes new questions. Questions about Keir Starmer’s political judgement. This is not the first time Lord Mandelson has resigned in disgrace. He stepped down as trade secretary over a loan from a colleague he failed to register under Tony Blair, and then quit again as Northern Ireland secretary over a cash for passports scandal. And now the question is, in light of the Epstein connection, why did Starmer let him back in? There is talk around Westminster that his key advisers had backed the move and Starmer had some reservations. As well he might, because in the end, the scandal of it all stops at the PM’s door. There are questions as to whether No 10 ignored concerns raised by the appointment and Badenoch is asking for full transparency. My colleague, Sam Coates, was told by two sources that the security services did flag concerns as part of the process.  It is not known whether all of the detail was shared with the prime minister personally. The prime minister's official spokesman said No 10 \"was not involved in the security vetting process\". Badenoch said the latest revelations \"point yet again to the terrible judgement of Keir Starmer\". She added that it is \"imperative that all documents relating to Peter Mandelson's appointment are released immediately\". Then there is a bigger picture. Two weeks into a supposed reset, two scandals and two key figures gone from government. This was a PM who promised to do politics differently and clean up after the scandal-ridden Tory years. Peter Mandelson’s return to government and ousting in this manner casts a long shadow over the PM and that promise, and raises serious questions about the PM’s political judgement. It also casts a shadow over the upcoming state visit. It was only on Wednesday that No 10 was thinking about trying to keep Mandelson to try to avoid putting the spotlight back onto President Trump. With the White House, Royal Family and the UK government all tarnished by association with sex offender Jeffrey Epstein, this was an issue they all wanted to avoid and now it is top of the agenda."
    },
    {
        "title": "Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers",
        "description": "The government is deploying AI-generated code in software, as it maintains it can save &#163;45bn in the Civil Service by using the technology.",
        "url": "https://news.sky.com/story/govt-still-hoping-for-16345bn-in-savings-from-ai-as-trial-shows-time-saved-for-programmers-13428771",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liz-kendall-downing-street_7003816.jpg?20250828172104",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-09-11 12:45:00",
        "Headline": "A trial using AI to help civil servants with programming has saved them a month of working time per year. The push to use AI for saving money will be welcomed by the Treasury ahead of the budget.",
        "Content": "\n          Political reporter\n              @TimJ_B\n The government is deploying AI-generated code in software, as it maintains it can save £45bn in the Civil Service by using the technology. The policy to save the vast sum of money was championed by former technology secretary Peter Kyle, who was promoted to business secretary in the reshuffle last weekend. The baton has now been passed to Liz Kendall, who was the work and pensions secretary who oversaw Labour's failed attempts to save money through reforming welfare. Politics live: Follow the latest updates With all government departments being told to find savings ahead of the budget, saving cash by deploying artificial intelligence will be music to the ears of the Treasury. Technology minister Kanishka Narayan - also a new appointee - said: \"With a £45 billion jackpot at stake, it's not an opportunity we can pass up, as it can help cut backlogs and save money.\" Using AI assistants to help with programming is now extremely common in the private sector, and is a marketed use of the likes of Google's Gemini and GitHub Copilot - both of which the government has deployed as part of its trial. \n                  Fake celebrity chatbots among those sending harmful content to children 'every five minutes'\n                 \n                  The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'\n                 \n                  'Game-changing' AI stethoscopes could detect heart conditions in seconds\n                 A spokesperson from the Department for Science, Innovation and Technology (DSIT) said 1,000 \"tech experts\" had been using the approved AI assistants, across 50 government departments. They claim the development is saving workers an hour a day of work - the equivalent to 28 working days a year. This included working on healthcare technology, as well as the development of 'Humphrey' - the government's own AI helper for civil servants. The spokesperson said: \"The time savings from the AI assistants mostly came from using them to write first drafts of code that experts then edit, or using them to review existing code. \"Only 15% of code generated by the AI coding assistants was used without any edits - showing that engineers were taking care to check and correct AI-generated code where needed.\" One of the challenges with using AI to assist with programming is that the time saved by getting AI to write code can sometimes end up being spent, as this process still requires expertise to plan, verify, edit and debug. Read more:AI at heart of Starmer's Civil Service savingsGovt speeding up AI adoption for officials According to the government, 72% of people who used the tools said they were good value for money, and 58% said they would like to keep using them. Some 65% said they were completing tasks faster and 56% said they were solving problems more efficiently. Technology minister Mr Narayan said: \"For too long, essential public services have been slow to use new technology - we have a lot of catching up to do. These results show that our engineers are hungry to use AI to get that work done more quickly, and know how to use it safely. \"This is exactly how I want us to use AI and other technology to make sure we are delivering the standard of public services people expect - both in terms of accuracy and efficiency.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Tara Brady, the president of Google Cloud in Europe, the Middle East, and Asia, said the company is \"thrilled\" with impact of Gemini's Code Assist. She added that the trial \"underscores the transformative potential of AI in enhancing productivity and problem-solving for coding professionals, and highlights the successful collaboration stemming from Google Cloud's strategic partnership agreement with the UK government.\""
    },
    {
        "title": "How Sky News was frozen out by UK embassy after asking Mandelson about Epstein links",
        "description": "Jeffrey Epstein was always an issue for Peter Mandelson.&#160;",
        "url": "https://news.sky.com/story/how-sky-news-was-frozen-out-by-uk-embassy-after-asking-mandelson-about-epstein-links-13428948",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mandelson-epstein_6929096.jpg?20250911195602",
        "type": "Politics",
        "Author": "Mark Stone",
        "Date Published": "2025-09-11 18:37:00",
        "Headline": "After an interview by Sky's James Matthews, he and Mark Stone both received angry messages from the embassy team. The ambassador was very unhappy with the exchange. One source said at the time: \"He was furious and you guys are in the deep freeze.\"",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Jeffrey Epstein was always an issue for Peter Mandelson.  Well before the revelations of this week, the Epstein cloud hung over him and he knew it. Back in May, Sky News was offered a chance to speak to him. He'd just finished a speech at an event in Washington and his communications team had suggested that if we wanted some time with him then he'd be available briefly as he left the event.  My colleague James Matthews waited outside the event for him to emerge. When he did, James asked him about the speech and the prospects of a trade deal. He then asked about Epstein. \"I'm not answering any questions about him,\" he said. \"My knowledge of him is something that I regret. I wish I'd never met him in the first place.\" \"Why did you have an association with him?\" he was asked. \"Why did many people meet him? He was a prolific networker and I wish I never met him in the first place,\" Mandelson said. We now know that for him to define his Epstein links as ''my knowledge of him\" was a huge misrepresentation of the truth. Read more:Starmer sacks Mandelson as US ambassadorNo 10 appointed Mandelson despite security concernsRead Mandelson's letter to US embassy staff after being sacked  After the interview, James and I both received angry messages from the embassy team. I have since learnt that the ambassador was very unhappy with the exchange. One source told me at the time: \"He was furious and you guys are in the deep freeze.\" Notably, Sky was not invited to briefings with the embassy for a few months, and engagement with the embassy was more challenging. We were not alone. In February, as he prepared to become the new ambassador, the Financial Times asked Mandelson about his relationship with Epstein. \"I regret ever meeting him or being introduced to him by his partner Ghislaine Maxwell,\" he told the paper. \"I regret even more the hurt he caused to many young women. I'm not going to go into this. It's an FT obsession and frankly you can all f*ck off. OK?\" The Prince of Darkness couldn't spin his way out of this."
    },
    {
        "title": "Why didn't Keir Starmer fire Peter Mandelson yesterday? ",
        "description": "Peter Mandelson's position was completely unsustainable, but it took Sir Keir Starmer 24 hours after everybody else to realise the inevitable.",
        "url": "https://news.sky.com/story/why-did-it-take-keir-starmer-so-long-to-fire-peter-mandelson-13428674",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-peter-mandelson_7015969.jpg?20250910110646",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-11 10:33:00",
        "Headline": "A full day after it was obvious to most that the US ambassador's tenure was unsustainable, the PM stood by his man.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Peter Mandelson's position was completely unsustainable, but it took Sir Keir Starmer 24 hours after everybody else to realise the inevitable. In the chaotic interim, this generated the extraordinary spectacle of No10 saying that they had full confidence in their man in Washington because - and it feels incredible to type this - No10 had been fully aware that the peer had an extended relationship with a convicted paedophile after the point he had been to jail in the US, and was content with this situation. An incredible state of affairs. Politics latest: Follow live updates This is why the issue has become a matter of Starmer's judgement almost as much as Peter Mandelson's. Indeed, there were echoes here of the Chris Pincher affair that led to Boris Johnson's downfall - a leader stubbornly defending acts which revolted the bulk of the party, in a tone deaf act of self-harm. And revolted, they were. \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 \n                  Bridget Phillipson emerges as frontrunner in Labour's deputy leadership race\n                 \n                  Bridget Phillipson describes how 'Mam was threatened with a baseball bat'\n                 Almost the entire Labour Party was reacting with horror at the revelation, and even more so at the defence. Less than 24 hours before his departure, Starmer was saying: \"The ambassador has repeatedly expressed his deep regret for association with him, he's right to do so. I have confidence in him and he's playing an important role in the UK-US relationship.\" Words of certainty - but done once again without access to full facts.  Read more:Starmer sacks Mandelson as US ambassadorAnalysis: Mandelson is never far from a scandal Dangerously, the PM was also defending a vetting process which would by implication put him in possession of facts that should have ruled Mandelson out of that job. \"Full due process has gone through when the appointment was made,\" he said. Now the line from a junior foreign office minister is that Mandelson hadn't told him. So either the vetting failed or this isn't quite accurate. My understanding is that no one in government knows the last time Mandelson did see Epstein - the absence of certainty on that key fact must have set off alarm bells. Right now, No10 will be thinking and hoping that, with just six days to go until the state visit by Donald Trump, which was meant to be organised by Mandelson, people will not focus too much on this question. However, given the current rate of one big beast in government being sacked every week, this will ultimately land at Starmer's feet."
    },
    {
        "title": "Man arrested after fire at MP Sharon Hodgson's constituency office",
        "description": "A man has been arrested following a fire at the constituency office of Labour MP Sharon Hodgson.",
        "url": "https://news.sky.com/story/police-investigation-after-incident-at-mp-sharon-hodgsons-constituency-office-13428624",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-hodgson_7016929.jpg?20250911114002",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-11 09:18:00",
        "Headline": "\"An incident occurred overnight at Sharon's office,\" a spokesperson for the Washington and Gateshead South MP said. Pictures from the scene show extensive fire damage.",
        "Content": " A man has been arrested following a fire at the constituency office of Labour MP Sharon Hodgson. Northumbria Police said the man, in his 20s, was arrested on suspicion of criminal damage and arson and remains in custody. \"Shortly after 12.20am today [Thursday], we were alerted to a fire at a premises on Woodland Terrace in the Washington area,\" a spokesperson said. \"Emergency services attended and no one is reported to have been injured in the incident.\" Tyne and Wear Fire and Rescue Service were called to the scene at Vermont House, home to the Sunderland constituency office of the Washington and Gateshead South MP, just past midnight. Drone pictures show extensive damage to the building. \"An incident occurred overnight at Sharon's office,\" a spokesperson for the Labour MP said. \"We will not be commenting or speculating while there is an ongoing police investigation, what we are clear on is there is no place for this kind of violence in our society. \"Sharon will not be deterred and will continue to support her constituents in Washington and Gateshead South as she does day in, day out. Constituents should get in touch with their issues by emailing in the usual way.\" Ms Hodgson has been a Labour MP in the north east of England since 2005. She is also the vice chair of Labour Friends of Israel. Chief fire officer, Peter Heath, said: \"I want to commend our crews for their swift and professional response to this serious incident. Their actions ensured the fire was contained quickly and safely, with no reported casualties. \"We continue to work closely with our partners as investigations progress.\" Councillor Phil Tye, chair of the Tyne and Wear Fire and Rescue Authority, said: \"Our thoughts are with everyone affected by this incident. I'd like to thank our firefighters and control staff for their dedication and teamwork during what may be a challenging investigation. \"We remain committed to supporting our communities and partners.\""
    },
    {
        "title": "John Lewis blames budget tax hikes for deeper loss",
        "description": "The John Lewis Partnership (JLP) has blamed budget tax hikes for a deeper half-year loss.",
        "url": "https://news.sky.com/story/john-lewis-blames-budget-tax-hikes-for-deeper-loss-13428540",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-waitrose-store_6283976.jpg?20230914065101",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-11 06:06:00",
        "Headline": "The partnership says that despite the impact of the packaging tax and raised employer NI contributions, it is on track to grow annual profits thanks to a focus on investment ",
        "Content": "The John Lewis Partnership (JLP) has blamed budget tax hikes for a deeper half-year loss. The UK's largest employee-owned business, which owns John Lewis department stores and Waitrose supermarkets, reported a headline loss before tax and exceptional items of £34m for the six months to 26 July. That compared to a £5m loss in the same period last year. The higher figure was reached despite a 4% rise in group sales to £6.2bn. Money latest: How to give your child a financial head start \"This result was significantly impacted by costs not present in the equivalent prior period\", the partnership explained, \"including £29m of costs for the new Extended Producer Responsibility (EPR) packaging levy (where we took the full annual cost in our first half results), alongside higher National Insurance Contributions (NICs)\". JLP said the loss figure also reflected additional investment in its systems and growth-led teams. On a bottom line basis, the losses stood at £88m - up from £30m - as some exceptional costs associated with the group's turnaround and some non-cash impairments were included. \n                  MPs seek COVID-19-style financial support cyberattack hit Jaguar Land Rover\n                 \n                  M&S tech chief leaves months after cyber attack cost it £300m\n                 \n                  Cinema giant Vue picks finance chief ahead of potential float\n                 JLP insisted it was on track to grow profitability in the core second half of its financial year, despite a \"challenging\" macroeconomic environment, as both operations were outperforming in their respective markets.  The company cited benefits from its investment, which hit £191m over the six months, have been prioritised over partner bonuses during several years of recovery for the group that have seen underperforming department stores closed and jobs lost. Jason Tarry, the former Tesco executive who has chaired the partnership for a year, said the outlook was positive despite consumer confidence remaining subdued. \"Our clear focus on accelerating investment in our customers and our brands is working: more customers are shopping with us, driving sales, and helping Waitrose and John Lewis outperform their markets\", he said. \"We achieved our highest recorded levels of positive customer satisfaction, a testament to the great service of our partners. \"The investments we are making, combined with our plans for peak trading, provide a strong foundation for the remainder of the year. \"While we are reporting a loss in the first half, we're well positioned to deliver full-year profit growth, which we'll continue to invest in our customers and partners.\" Market analysts have cautioned that the sales figures are likely to have been flattered by the disruption to trading at rival M&S, which suffered a cyber attack in April. But Robyn Duffy, consumer markets senior analyst at RSM UK, said of the sales uplift: \"Waitrose’s performance has been a key driver, benefiting from a renewed focus on its food proposition, including a greater emphasis on lower prices and a more effective adoption of technology to improve the customer experience. \"Meanwhile, the John Lewis retail arm is successfully drawing in customers through a combination of revitalised physical stores, a focus on meaningful brand partnerships, and the reintroduction of its Never Knowingly Undersold price matching strategy.\" "
    },
    {
        "title": "Lord Mandelson's exit leaves Donald Trump and his already controversial state visit in the lurch",
        "description": "Donald Trump's state visit was looking controversial enough.",
        "url": "https://news.sky.com/story/lord-mandelsons-exit-leaves-donald-trump-and-his-already-controversial-state-visit-in-the-lurch-13428826",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mandelson-trump_7012551.jpg?20250906052432",
        "type": "Politics",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-11 13:49:00",
        "Headline": "An effective ambassador to the court of King Donald, Lord Mandelson's departure from his key diplomatic role could hardly come at a worse time.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump's state visit was looking controversial enough. It is now happening off the back of a scandal that's claimed the scalp of the prime minister's man in Washington. That is more than unfortunate. Mandelson latest: 'New information' on Epstein link For all the faults that lost him his job, Lord Mandelson was an effective ambassador to the court of King Donald. He went from someone many thought completely unpalatable to the US president to earning the nickname the Trump whisperer. Peter Mandelson's charm, oleaginous to some, was ideally suited to stroking the presidential ego - as evidenced in that extraordinary Oval Office moment as Trump unveiled his trade agreement with the UK. And it was deployed in the grand Lutyens mansion that is the ambassador's residence on Massachusetts Avenue, courting the great and the good of the Trump era Washington. Replacing Lord Mandelson will take time.  A political appointment will be quicker than a civil service pick but there is unlikely to be time for either before Trump's state visit next week. Who is in the running to be US ambassador? Sir Keir Starmer could send back the former ambassador Karen Pierce. A skilled veteran diplomat, she is highly regarded by all sides of Washington's divided politics. But reappointing her would be an admission the prime minister made a mistake appointing Mr Mandelson instead of keeping her on, say diplomatic observers. Other possible contenders include former foreign secretary David Milliband, or former EU foreign affairs supremo Baroness Catherine Ashton. Also on the list of civil service favourites is Sir Philip Barton, the former deputy ambassador to Washington and permanent under-secretary at the Foreign Office. Mr Starmer could not have lost his ambassador at a worse time. When he invited Mr Trump for a second state visit, flourishing the King's letter in the Oval Office, it was seen as clever diplomacy. But Donald Trump's erratic behaviour has taken the shine off the achievement. That trade agreement with the UK - unveiled with such fanfare and nurtured by Lord Mandelson - has fallen short of its initial promise under deeper scrutiny. And the prime minister and the King will now be hosting a US president at odds with his European allies over Ukraine. Read more:No 10 appointed Mandelson despite concernsAnalysis - why wasn't Mandelson fired yesterday? Donald Trump has proven suspiciously close to Vladimir Putin, and, like the Russian leader, opposed to an immediate ceasefire and, for now at least, more severe sanctions on Russia's oil trade. The president's conduct over Iran and Gaza, and his unorthodox trade policies, deepen the chasm between the US and His Majesty's Government. His visit here will be unwelcome and deeply unpopular among many. That is only likely to aggravate relations with this prickly president further. Lord Mandelson's ability to reduce the fallout and navigate deeply problematic waters will be sorely missed."
    },
    {
        "title": "Ireland will not participate in Eurovision if Israel is allowed to take part",
        "description": "Ireland will not participate in the Eurovision Song Contest next year if Israel is allowed to take part, RTE has announced.",
        "url": "https://news.sky.com/story/ireland-will-not-participate-in-eurovision-if-israel-is-allowed-to-take-part-13428743",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eden-golan-israel_7017103.jpg?20250911135805",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-11 12:05:00",
        "Headline": "Eurovision Song Contest's director Martin Green has said he would \"respect\" the decision of any country which chooses not to participate in the competition.",
        "Content": "Ireland will not participate in the Eurovision Song Contest next year if Israel is allowed to take part, RTE has announced. The Irish broadcaster said in a statement that a number of European Broadcasting Union (EBU) members raised concerns over the participation of Israel in the competition at the union's general assembly in July. RTE added that its \"position\" is that Ireland will not take part in the 2026 Eurovision Song Contest if the participation of Israel goes ahead. The broadcaster will make its \"final decision regarding Ireland's participation\" once the EBU decides whether Israel will take part, the statement continues. It adds: \"RTE wishes to thank the EBU for the extensive consultation process that was initiated on foot of that meeting, and the extension of the option to withdraw from participation without penalty to December.\" The statement added: \"RTE feels that Ireland's participation would be unconscionable given the ongoing and appalling loss of lives in Gaza. \"RTE is also deeply concerned by the targeted killing of journalists in Gaza, and the denial of access to international journalists to the territory, and the plight of the remaining hostages.\" \n                  Jair Bolsonaro: Brazil's former president sentenced to 27 years in jail for attempted coup\n                 \n                  Police investigating 'multiple leads' in Charlie Kirk killing as FBI release images of 'person of interest'\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 Ireland has won Eurovision seven times, the joint most of any country along with Sweden. Its last win was in 1996. Read more:Mandelson sacked as US ambassadorChelsea hit with 74 charges by FA  Eurovision Song Contest director Martin Green said: \"We understand the concerns and deeply held views around the ongoing conflict in the Middle East. We are still consulting with all EBU Members to gather views on how we manage participation and geopolitical tensions around the Eurovision Song Contest. \"Broadcasters have until mid-December to confirm if they wish to take part in next year's event in Vienna. It is up to each member to decide if they want to take part in the contest and we would respect any decision broadcasters make.\" The 70th anniversary edition of the contest is due to take place in Vienna, Austria, in May after Austrian entry JJ won with his song Wasted Love in Basel, Switzerland, earlier this year. Ireland was represented by Emmy in Basel, with the song Laika Party, while Israel was represented by Yuval Raphael, with her song New Day Will Rise. There has been growing controversy about Israel's participation in Eurovision with protests in host cities in the last two years."
    },
    {
        "title": "Gary Lineker ends Ant and Dec winning streak at National Television Awards months after antisemitism row",
        "description": "Former Match Of The Day presenter Gary Lineker has won the best TV presenter prize at the National Television Awards - months after he left the BBC following an antisemitism row.",
        "url": "https://news.sky.com/story/gary-lineker-ends-ant-and-dec-winning-streak-at-national-television-awards-months-after-antisemitism-row-13428542",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gary-lineker_7016703.jpg?20250911080014",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-11 06:06:00",
        "Headline": "Lineker's win at the National Television Awards ends Ant and Dec's 23-year streak in scooping the best presenter prize.",
        "Content": "Former Match Of The Day presenter Gary Lineker has won the best TV presenter prize at the National Television Awards - months after he left the BBC following an antisemitism row. Lineker, 64, apologised \"unreservedly\" in May after he shared a post on Instagram about Zionism which featured an image of a rat - a symbol used to represent Jewish people in antisemitic propaganda, including in Nazi Germany. The former England footballer said in a statement that he would \"never knowingly share anything antisemitic\" and that he removed the post when he \"became aware of the issue\". He announced he was leaving the BBC days later, saying that \"stepping back now feels like the responsible course of action\". Lineker had presented Match Of The Day since 1999 and was the BBC's highest-paid on-air talent when he stepped down. Prior to the antisemitism row in May, Lineker already had a reputation for sharing political views on social media - something which went against the BBC's impartiality rules. This included posts about Tory migrant policy, Brexit, Qatar's human rights record and a documentary about Gaza. \n                  'We may see more things coming out': BBC chief quizzed by MPs about talent 'scandal'\n                 \n                  100 firefighters tackle blaze at former BBC television centre in London's White City\n                 \n                  Observer editor-in-chief James Harding says BBC should be 'put beyond reach of politicians'\n                  Collecting his \"TV Presenter Of The Year\" award last night, Lineker said: \"I think it demonstrates that perhaps it's OK sometimes for us to use our platform to speak up on behalf of those who have no voice.\" Lineker's win at the National Television Awards also ended Ant and Dec's 23-year streak in scooping the best presenter prize. Speaking at the winners' press conference after the ceremony, the former Match Of The Day host said the presenting duo, whose real names are Anthony McPartlin and Declan Donnelly, are \"brilliant\" and that \"it's an honour to follow in their footsteps\". Reflecting on life after presenting Match Of The Day, Lineker added: \"I'm doing great. I'm enjoying having weekends off for the first time in my adult life, which has been great fun. \"I'm still watching loads of football, still doing the same sort of things, and I've got a new show coming up for ITV, which I start filming next week - The Box, which goes out, I think, probably next year.\" Read more:Lineker's most controversial postsLineker leaves Match Of The Day  Asked if the award proves he has not been cancelled, he said: \"I don't think anyone seriously thought that I was cancelled at any point. \"It was obviously just a mistake and oversight. And I think everyone saw it for that. \"So I was never in the slightest bit concerned for that.\" Former England footballer Alan Shearer, a Match Of The Day pundit who worked alongside Lineker on the show, posted on X: \"Yesssss @GaryLineker congratulations.\" The former footballer also beat competition from The Traitors host Claudia Winkleman, This Morning's Alison Hammond and TV presenter and reality star Stacey Solomon to win the best presenter prize."
    }
]