[
    {
        "title": "Israel-Hamas war: 'Vast amounts of aid needed to stave off catastrophic health crisis in Gaza,' UN warns ",
        "description": "Israel has agreed to support a \"one-week scale-up of aid\" in Gaza - but the United Nations has warned more action is needed to \"stave off famine and a catastrophic health crisis\".",
        "url": "https://news.sky.com/story/israel-hamas-war-vast-amounts-of-aid-needed-to-stave-off-catastrophic-health-crisis-in-gaza-un-warns-13402838",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinian-aid_6975674.jpg?20250728020954",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 23:40:00",
        "Headline": "The UN's aid chief Tom Fletcher made the remarks as Israel began limited pauses in fighting in Gaza for 10 hours a day to address the humanitarian situation.",
        "Content": " Israel has agreed to support a \"one-week scale-up of aid\" in Gaza - but the United Nations has warned more action is needed to \"stave off famine and a catastrophic health crisis\". UN aid chief Tom Fletcher made the remarks as Israel began limited pauses in fighting across three areas of Gaza for 10 hours a day to address the worsening humanitarian situation. Israel cut off all supplies to Gaza's population from the start of March. It then reopened aid centres with new restrictions in May, but said the supply had to be controlled to prevent it from being stolen by Hamas militants. On Saturday, reports referencing US government data said there was no evidence Hamas had stolen aid from UN agencies. Images of emaciated Palestinian children have led to widespread criticism of Israel's actions in Gaza, including by allies who are calling for an end to the war. Mr Fletcher said one in three people in Gaza \"hasn't eaten for days\" and \"children are wasting away\". He added: \"We welcome Israel's decision to support a one-week scale-up of aid, including lifting customs barriers on food, medicine and fuel from Egypt and the reported designation of secure routes for UN humanitarian convoys. \n                  Aid is sitting idle in Gaza - where there is now widespread malnutrition\n                 \n                  Gaza: More than 30 people killed 'as Israeli troops open fire towards Palestinians waiting for aid' \n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 \"Some movement restrictions appear to have been eased today, with initial reports indicating that over 100 truckloads were collected. \"This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis. Across the UN agencies and humanitarian community, we are mobilised to save as many lives as we can.\" The Israel Defence Forces said yesterday that it is halting military operations in Muwasi, Deir al Balah and Gaza City daily from 10am to 8pm local time (8am to 6pm UK time) until further notice. Combat operations have continued outside of this 10-hour window. Health officials in Gaza said Israeli strikes killed at least 41 Palestinians overnight into Sunday morning, including 26 seeking aid. In a statement, the IDF said it would also establish secure routes to help the UN and aid agencies deliver food and other supplies. Israel's announcement of what it calls a \"tactical pause\" in fighting comes after it resumed airdrops of aid into Gaza. While the IDF reiterated claims there is \"no starvation\" in the territory, it said the airdrops would include \"seven pallets of aid containing flour, sugar and canned food to be provided by international organisations\". Palestinian sources confirmed that aid had begun dropping in northern parts of the territory. Sabreen Hasson, a Palestinian mother who travelled to an aid point near the Zikim crossing to collect supplies, said: \"I came to get flour for my children because they have not tasted flour for more than a week, and thank God, God provided me with a kilo of rice with difficulty.\" But Samira Yahda, who was in Zawaida in central Gaza, said: \"We saw the planes, but we didn't see what they dropped... they said trucks would pass, but we didn't see the trucks.\" Another Palestinian told the AP news agency that some people feared going out and having a box of aid fall on their children. Read more:What does recognising a Palestinian state mean?Parents of IDF soldier taken hostage fear he'll be one of last freed25% of young children 'now malnourished in Gaza'  Gaza is expected to be a focus during talks Sir Keir Starmer and Donald Trump in Scotland today. Downing Street said Sir Keir will raise \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during the meeting at the US president's Turnberry golf course in Ayrshire. Reports also suggest the prime minister is planning to interrupt the summer recess and recall his cabinet to discuss the crisis on Tuesday. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal... they want to die\". Meanwhile the exiled head of Hamas in Gaza, Khalil al Hayya, has warned ceasefire negotiations with Israel were \"meaningless under continued blockade and starvation\". In a recorded speech, he added: \"The immediate and dignified delivery of food and medicine to our people is the only serious and genuine indication of whether continuing the negotiations is worthwhile.\"  During a meeting with the European Commission President Ursula von der Leyen yesterday, Mr Trump emphasised the importance of securing the release of hostages held by Palestinian militants in Gaza. He said: \"They don't want to give them back, and so Israel is going to have to make a decision.  \"I know what I'd do, but I don't think it's appropriate that I say it. But Israel is going to have to make a decision,\" he said. Mr Trump also repeated claims, without evidence, that Hamas was stealing food coming into Gaza and selling it."
    },
    {
        "title": "Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza",
        "description": "Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-for-donald-trump-trade-talks-as-pm-walks-diplomatic-line-between-eu-allies-and-us-on-gaza-13402794",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-donad-trump_6975578.jpg?20250727214920",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-07-27 21:30:00",
        "Headline": "Despite some reports that Donald Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later. Downing Street said the prime minister would discuss \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during discussions at the president's Turnberry golf course in Ayrshire. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal… they want to die\". Sir Keir has tried to forge close personal ties with the president - frequently praising his actions on the world stage despite clear foreign policy differences between the US and UK. The approach seemed to pay off in May when Mr Trump announced the agreement of a trade deal with the UK that would see several tariffs lowered. The two leaders are expected to discuss this agreement when they meet, with the prime minister likely to press the president for a lowering of outstanding tariffs on imports such as steel.  Prior to the visit, the White House said the talks would allow them to \"refine the historic US-UK trade deal\". That comes hot on the heels of the US reaching an agreement with the EU, which Mr Trump described as the \"biggest dal ever made\". This will see 15% tariffs imposed on most European goods entering America, despite the president previously threatening a 30% levy.  Extracting promises from the president on the Middle East may be harder though. Despite some reports that Mr Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies. As he did over the Ukraine war, Sir Keir will have to walk a diplomatic line between the UK's European allies and the White House. On Thursday, French President Emmanuel Macron announced his country would formally recognise a Palestinian state in September, the first member of the G7 to do so. That move was dismissed by Mr Trump, who said it \"doesn't carry any weight\". Read more from Sky News:US and EU agree trade deal - with bloc facing 15% tariffsGeldof accuses Israel of 'lying' about Gaza starvation  The UK, French and German leaders spoke over the weekend and agreed to work together on the \"next phase\" in Gaza that would see transitional governance and security arrangements put in place, alongside the large-scale delivery of aid. Under pressure from members of his own party and cabinet to follow France and signal formal recognition of Palestine, Sir Keir has gradually become more critical of Israel in recent months. On Friday, the prime minister said \"the starvation and denial of humanitarian aid to the Palestinian people, the increasing violence from extremist settler groups, and Israel's disproportionate military escalation in Gaza are all indefensible\". Government sources say UK recognition is a matter of \"when, not if\" - but it's thought Downing Street wants to ensure any announcement is made at a time when it can have the greatest diplomatic impact.  Cabinet ministers will be convened in the coming days, during the summer recess, to discuss the situation in Gaza. The UK has also been working with Jordan to air drop supplies, after Israel said it would allow foreign countries to provide aid to the territory. Donald Trump's trip to Scotland comes ahead of his second state visit to the UK in September. Downing Street says Ukraine will also likely be discussed in the meeting with both men reflecting on what can be done to force Russia back to the negotiating table. After the meeting at Turnberry, the prime minister will travel with the president to Aberdeen for a private engagement. Mr Trump is also expected to meet Scottish First Minister John Swinney."
    },
    {
        "title": "At least three killed after train derailed in Germany, police say",
        "description": "At least three people have died after a train derailed in southern Germany, police have said.",
        "url": "https://news.sky.com/story/at-least-three-killed-after-train-derailed-in-germany-police-say-13402766",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-train-derailed-germany_6975529.jpg?20250727203049",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 19:12:00",
        "Headline": "A federal police spokesperson in Stuttgart told Sky News earlier on Sunday that the incident took place near the town of Riedlingen at around 6.10pm.",
        "Content": "At least three people have died after a train derailed in southern Germany, police have said. A spokesperson for the Federal Police Inspectorate in Stuttgart told Sky News earlier that the incident took place near the town of Riedlingen. Two train carriages came off the rails between the town and Munderkingen at around 6.10pm local time on Sunday, with around 100 people aboard. Photos from the scene showed parts of the train on its side as rescuers climbed atop the carriages. It was not immediately clear how many people had been injured. Passengers have since been evacuated from the train. Federal and local police said the cause of the incident remains under investigation. The Reuters news agency reported that the train was on a 55-mile route between Sigmaringen and Ulm in the state of Baden-Wurttemberg. \n                  Berlin school evacuated as children suffer breathing difficulties amid 'irritant gas', police say\n                 \n                  German Chancellor Friedrich Merz is meeting Donald Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off? \n                 \n                  Cologne: Around 20,000 people being evacuated after unexploded Second World War bombs discovered\n                 Read more from Sky News:Diseased cows cause Tour de France diversionUS and EU agree trade deal - with bloc facing 15% tariffsPlane makes dramatic plunge to avoid another aircraft In a post on X, German Chancellor Friedrich Merz said he mourned the victims and gave his condolences. Deutsche Bahn, Germany's main national railway operator, also said in a statement that it was cooperating with investigators"
    },
    {
        "title": "US and EU agree trade deal - with bloc facing 15% tariffs on goods into America",
        "description": "The United States and European Union have reached an agreement on a trade deal, says Donald Trump.",
        "url": "https://news.sky.com/story/us-and-eu-agree-trade-deal-says-donald-trump-13402672",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6975464.jpg?20250727184756",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 17:04:00",
        "Headline": "Speaking after talks at his Turnberry golf resort, President Donald Trump said it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture.",
        "Content": " The United States and European Union have reached an agreement on a trade deal, says Donald Trump. The announcement was made as the US president met European Commission chief Ursula von der Leyen at one of his golf resorts in Scotland. Speaking after talks in Turnberry, Mr Trump told reporters it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture. The US will impose 15% tariffs on most EU goods entering America, after Mr Trump had threatened a 30% levy. The deal includes $600bn (£446bn) of EU investments in the US, and the bloc will buy $750bn (£558bn) of US energy and also purchase American military equipment. Mr Trump said: \"I think it's great that we made a deal today instead of playing games and maybe not making a deal at all.\" \"I think it's the biggest deal ever made.\" \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Donald Trump gives his view on chances of US-EU trade deal - while on the golf course\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 He said: \"We are agreeing that the tariff... for automobiles and everything else will be a straight across tariff of 15%.\" However, the 15% baseline rate would not apply to steel and aluminium, for which a 50% tariff would stay in place. Ms Von der Leyen said: \"We have a trade deal between the two largest economies in the world and it's a big deal, it's a huge deal. It will bring stability, it will bring predictability, that's very important for our businesses on both sides of the Atlantic.\" She said the agreement would include 15% tariffs \"across the board\", and it would help rebalance trade between the two large trading partners. She said the levy rate was the \"best we could get\" regarding the car sector. But she added that there was \"no decision\" on the spirits sector, which was one of those areas where the details in the framework trade deal would have to be examined in the coming weeks. Read more from Sky News:Wildfires break out in Greece, Turkey and AlbaniaConservatives vow to ban doctor strikes Mr Trump had earlier said the main sticking point was \"fairness\", citing barriers to US exports of cars and agriculture. He went into the talks demanding fairer trade with the 27-member bloc and threatening steep tariffs to achieve that, while insisting the US will not go below 15% import taxes. For months, Mr Trump has threatened most of the world with large tariffs in the hope of shrinking major US trade deficits with many key trading partners, including the EU. In case there was no deal and the US had imposed 30% tariffs from 1 August, the EU has prepared counter-tariffs on €93bn (£81bn) of US goods. Ahead of their meeting on Sunday, Ms Von der Leyen described Mr Trump as a \"tough negotiator and dealmaker\". The deal mirrors parts of the framework agreement the US clinched with Japan last week."
    },
    {
        "title": "Firefighters tackle blazes as wildfires break out in Greece, Turkey and Albania",
        "description": "Firefighters are battling blazes that have broken out across several countries in southeast Europe, fuelled by dry conditions, high winds and extreme temperatures.",
        "url": "https://news.sky.com/story/firefighters-tackle-blazes-as-wildfires-break-out-in-greece-turkey-and-albania-13402410",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-greece-wildfires_6974951.jpg?20250727074522",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 06:52:00",
        "Headline": "A politician in Turkey described the scene as \"an apocalypse\" as forests burned and more than 1,100 firefighters battled the flames. Meanwhile, in Greece, some suburbs of Athens have been evacuated.",
        "Content": " Firefighters are battling blazes that have broken out across several countries in southeast Europe, fuelled by dry conditions, high winds and extreme temperatures. A firefighter has died and thousands of people have been evacuated in a weekend that has seen dozens of fires scorch forests and burn houses to the ground. More than 50 wildfires have erupted in Greece in the past 24 hours, leading to evacuations in some Athens suburbs and a request to the EU for six firefighting planes. A politician in Turkey's fourth-largest city of Bursa described the scene as \"an apocalypse\" as forests burned and more than 1,100 firefighters tried to control the flames. Turkey Wildfires have engulfed Turkey for weeks, and on Friday the government declared two western provinces, Izmir and Bilecik, disaster areas. Fire crews confronted 76 separate blazes across the country on Saturday, forestry minister Ibrahim Yamukli said. Almost 1,800 people were forced to flee their homes in villages to the northeast of Bursa, where a firefighter died from a heart attack while on the job, the city's mayor, Mustafa Bozbey, said. Orhan Saribal, an opposition parliamentarian for the province, described the scene as \"an apocalypse\". Turkey recorded its highest ever temperature of 50.5C (123F) in the southeastern Sirnak province on Friday. Fourteen people have died in recent weeks, including 10 rescue volunteers and forestry workers killed on Wednesday in a fire in the west of the country. Greece Parts of Athens have been evacuated after more than 50 wildfires broke out in 24 hours. People living in the suburb of Kryoneri, around 12.5 miles (20 km) northeast of the Greek capital, were told to move to safe areas on Saturday. At least five people, most of them elderly with respiratory problems, have been treated in hospital for burns or smoke inhalation. Photos showed houses and tree-covered hills on fire as temperatures hit 38C (100F), and dry conditions and high winds fanned the flames. Fire service spokesman Vassilis Vathrakoyannis said that under such conditions, wildfires \"expand very quickly and become dangerous\", adding: \"These conditions are expected to prevail over the coming days.\" There have been reports of damage, he said, and authorities \"will take stock when the fires have been put out\". At least 335 firefighters are also battling three major fires on Greece's two largest islands - Crete in the south and Evia north of Athens - and also on the island of Kythera, northwest of Crete. Greece has also received support from the Czech Republic, with a fire service based there saying they sent a team to support Greek firefighters battling a forest blaze near the town of Nea Artaki. Read more on Sky News:Israel pauses Gaza fighting amid hunger crisis11 stabbed in US store Albania In neighbouring Albania, 26 fires broke out throughout the country on Saturday, following a large fire near the southern Albanian town of Delvina on Friday, which injured three people and forced the evacuation of about 2,000 residents. Kosovo In Kosovo, firefighters managed to extinguish 17 blazes fuelled by strong winds while 12 others remained active, officials said. Eight cows were killed in the southern town of Prizren, after a fire engulfed a farm, local emergency services said, while 40 sheep died in a fire in the east of the country."
    },
    {
        "title": "Conservatives vow to ban doctor strikes - as Kemi Badenoch hits out at 'militant' union",
        "description": "The Conservatives would ban strikes for doctors, Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/conservatives-vow-to-ban-doctor-strikes-as-kemi-badenoch-hits-out-at-militant-union-13402480",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-junior-doctors-doctors_6960821.jpg?20250727124453",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 13:49:00",
        "Headline": "The Tory leader says she will treat doctors the same as the army and police, who are banned from taking industrial action.",
        "Content": " The Conservatives would ban strikes for doctors, Kemi Badenoch has said. The Tory leader said she would treat doctors the same as the army and police in order to bring the walkouts to an end. Politics latest: UK 'committed' to recognising Palestine as a state - but govt won't say when Under UK law, police officers, members of the armed forces and some prison officers are banned from striking. Resident doctors - previously known as junior doctors - began their five-day strike across England on Friday as part of an escalating row between NHS bosses and the British Medical Association (BMA) over pay. Last July, they were awarded a raise of 22% over two years, the highest public sector award in recent years. But the BMA has argued that pay has declined significantly since 2008 when adjusting for inflation and is calling for a pay rise of 29.2% to reverse \"pay erosion\". The latest deal saw doctors given a 4% increase, plus £750 \"on a consolidated basis\" - which comes to an average rise of 5.4%. Speaking to reporters, MS Badenoch said it was now Tory policy to ban strikes for resident doctors, arguing the BMA had become \"too militant\". \"We have seen 11 strikes in the last sort of 18 months, two years,\" she said. \"People are dying and it's costing the NHS billions. We need to bring these strikes to an end.\" She said she would also introduce minimum service levels for strikes - something that was brought in under Liz Truss's short tenure as prime minister before being repealed by the current government. The Conservatives argue their proposals would bring the UK in line with other nations across the world, including Australia and Canada, where restrictions on doctors striking are tighter. Read more:Everything you need to know about the doctors' strikeGovt vows to protect 'pavement pints' Meanwhile, Greece, Italy and Portugal have laws ensuring minimum service levels are in place across their health services. Speaking to Sunday Morning with Trevor Phillips, Dr Tom Dolphin, the chair of the BMA, said doctors \"don't want to be on strike\" but felt they had no choice. \"The reason that we are worried about the NHS and we're worried about the workforce in the NHS, is because doctors are being undervalued,\" he said. \"They're leaving the NHS in large numbers, and what we're trying to do is make sure that the offer that's there from the NHS, the pay, the total reward package, is enough to recruit and retain the best doctors that the patients deserve in the NHS.\" A Department of Health spokesperson said: \"We know that previous rounds of strikes caused much wider levels of harm and so this government is doing things differently. \"Working with NHS leaders, we've put in measures to keep as much urgent and planned care available and safe as we possibly can. \"During these strikes, all other NHS staff (including consultants and other specialist doctors) will still be working, and the focus of the NHS will be on ensuring as many services as possible continue to operate safely.\""
    },
    {
        "title": "Man charged after 150mph police chase on A12",
        "description": "A man has been charged after driving at more than 150mph during a car chase with police in Essex on Saturday.",
        "url": "https://news.sky.com/story/man-charged-after-150mph-police-chase-on-a12-13402610",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-essex-police-logo_6347720.jpg?20231104142016",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-27 15:16:00",
        "Headline": "Majid Masoud Saad, 31, from Barking, east London, has been charged with drink driving, dangerous driving and failing to stop for police.",
        "Content": "A man has been charged after driving at more than 150mph during a car chase with police in Essex on Saturday. Majid Masoud Saad, 31, from Barking, east London, has been charged with drink driving, dangerous driving and failing to stop for police. Essex Police stated that the driver was reaching speeds of more than 150mph during the chase, with London's Metropolitan Police initially in pursuit. The Essex force then said that \"the vehicle was pursued, and several tactics were used to stop it at Ongar\". Saad was bailed and is scheduled to appear at Basildon Magistrates' Court on 4 September."
    },
    {
        "title": "Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege ",
        "description": "A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion.",
        "url": "https://news.sky.com/story/heathrow-funded-group-sending-incredibly-misleading-mail-to-homes-across-west-london-campaigners-allege-13390542",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emirates-airbus-a380_6806347.jpg?20250121132517",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-27 03:13:00",
        "Headline": "Back Heathrow is funded by the airport, and headed by a former minister and member of Labour's policy forum. But the funding is not disclosed on Back Heathrow's newsletter or website.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion. The group, called Back Heathrow, sent leaflets to people living near the airport, claiming expansion could be the route to a \"greener\" airport and suggesting it would mean only the \"cleanest and quietest aircraft\" fly there. It comes as the airport prepares to submit its planning application for a third runway ahead of the 31 July deadline, following the government's statement of support for the expansion. Back Heathrow calls itself a \"local campaign group of over 100,000 residents\" and does not mention the funding it receives from the airport in the newsletter. Its website also does not mention the current financial support and says it \"initially launched with funding from Heathrow Airport but we have since grown\". Back Heathrow also told Sky News it had \"always been open\" about the support it receives from the airport. At the bottom of every web page, the organisation says: \"Back Heathrow is a group of residents, businesses and community groups who have come together to defend the jobs that rely on Heathrow and to campaign for its secure future.\" Heathrow Airport said it had always been clear about funding Back Heathrow, but would not disclose how much it provides. Who's behind Back Heathrow? The group's executive director is former Labour minister Parmjit Dhanda, who was MP for Gloucester from 2001 to 2010 and sits on the National Policy Forum - the body responsible for developing Labour policy. Latest accounts for Back Heathrow show it had five employees, including its two directors, in the financial year ending 30 June 2024. The second director is John Braggins, a former campaign adviser to Tony Blair. The business had £243,961 in cash, the accounts show. What are the group saying? In the newsletter, executive director Mr Dhanda said people ask if Heathrow is sustainable. In answering the question, he appeared to suggest the airport can dictate what types of planes use Heathrow. \"We can build a cleaner, greener and smarter airport - using more sustainable aviation fuel, ensuring only the cleanest and quietest aircraft fly here, reduce stacking in our skies and modernise our airspace to cut emissions in flight,\" he wrote. When asked by Sky News what Back Heathrow meant and what the source for the claim was, the organisation pointed to the airport's traffic light system of noise and emission measurements for the 50 largest airlines serving Heathrow. \"The scheme helps to see what areas certain airlines are excelling in and where improvements can be made,\" a spokesperson said. But those \"cleaner and greener\" claims were dismissed as \"myths\" by one campaigner. Finlay Asher is an aerospace engineer and co-founder of Safe Landing, a group of aviation workers and enthusiasts seeking climate improvements in the industry. He said the emissions savings from sustainable aviation fuel (SAF) were \"highly debatable\" - but added that even if they were taken at face value, use of these fuels is \"relatively low\" and so only provides small emissions reductions. \"Air traffic growth at Heathrow will wipe this out,\" he said. Mr Asher also disputed the claim that only the cleanest and quietest aircraft will fly at Heathrow. \"There is no policy in place which prevents older generation aircraft from being operated out of any airport,\" he said. As for reducing \"stacking\" - where aircraft wait over an airport to land - Mr Asher said if that's the goal, \"adding more aircraft to the sky won't make this easier\".   Opposition to Back Heathrow's claims also came from Rob Barnstone, founding member of the No Third Runway Coalition, which is funded by five local authorities surrounding Heathrow Airport. He said that regardless of fuel efficiencies or new quieter engines, having the additional 260,000 flights Heathrow has said will be created with an extra runway - in addition to the airport's current cap of 480,000 - would create \"an awful lot of noise\". \"For all the best will in the world, Heathrow is a very, very, very noisy neighbour... When you're adding a quarter of a million additional flights, that's going to create an awful lot of emissions, even if they're using planes that are ever so slightly less environmentally damaging than previous planes,\" Mr Barnstone said. Green claims Under the heading of \"UK sustainable fuel industry for Heathrow\", Back Heathrow said \"advances in electric and hydrogen powered aircraft can ensure we meet our environmental targets\". Elaborating on this, Back Heathrow told Sky News: \"Zero-emission electric and hydrogen aircraft are very much the end goal for civil aviation and countries like Norway have set 2040 as the year that all of their short-haul flights will be by electric planes.\" The statement was called \"incredibly misleading\" by Dr Alex Chapman, senior economist at the left-leaning think tank New Economics Foundation (NEF). \"There's just absolutely no confidence that those aircraft are going to have any meaningful impact on emissions and commercial aviation in any reasonable time frame. And, yeah, we can all speculate as to what may not happen in 50 years' time. But I think the people living around the airport should be given the information about what's actually realistic.\" Even if the technology were available, the runway may not be ready for it, Dr Chapman said. \"Perhaps more importantly, there's been no indication so far that the proposed new runway is being built to cater for those types of aircraft, because a runway that caters to electrical, hydrogen powered aircraft would be very different to one that was for conventional fuel, particularly in terms of the fuelling infrastructure around it that would be required: pipes to pipe hydrogen, massive charging power facilities.\"  While work is under way to develop electric aircraft, there are currently no commercial electric flights taking place. The best-case scenario is battery-powered flights that may be suitable for short journeys. But as a major international airport, more than 40% of Heathrow's flights are long-haul and medium-haul. And while airlines such as easyJet have called for government funding to develop hydrogen flying suitable for short-haul flights, there are obstacles to making regular commercial flights a reality. Providing enough hydrogen for the plane journeys from renewable sources will be challenging, as will transporting the fuel, and reworking airport infrastructure for hydrogen refuelling. Plans for hydrogen aircraft are at least a decade away, with Airbus saying it wants to get a 100-seat hydrogen plane in the air by 2035 - although Back Heathrow's estimates for a third runway have flights taking off in 2034. For now, rising emissions from flying are risking the UK's climate targets, according to the independent government advisers of the Climate Change Committee, who found flights contribute more greenhouse gas than the entire electricity supply sector. Expanding at 'full capacity' On the first page of the newsletter, Back Heathrow says \"Heathrow is at full capacity\", but the company told Sky News the airport has been \"operating at 98% capacity since 2005\". Despite its 98% capacity, Heathrow Airport has broken passenger number records every year for the past 14 years - excluding the pandemic years of 2020 to 2023. Dr Chapman said Heathrow is at capacity regarding the government-imposed flight cap, not at the capacity of the current runway infrastructure. \"So if the government were, for example, to lift that cap on the number of aircraft movements, it's pretty likely that they could actually fly 10% to 20% more flights out of the existing infrastructure,\" he said. As aeroplanes have expanded to carry more passengers, the airport has welcomed more people, he added. The airport earlier this month announced plans to increase its capacity by 10 million passengers a year, before a third runway is built, and to raise the charge paid by passengers to fund the investment. Read more:New internet rules come into force - here's what is changingGood economic news as sunny weather boosted retail sales How have the group and the airport responded? A Heathrow spokesperson said: \"Back Heathrow represents tens of thousands of local people who want to make their views known on the importance of Heathrow to their communities and livelihoods today and into the future. \"We have always been clear that, alongside individual residents, local business groups and trade unions, we provide funding for Back Heathrow to provide a voice for local people who historically have not been heard in the debate about expanding Heathrow.\" Speaking for the campaign group, Mr Dhanda said: \"At Back Heathrow we are proud of our link to Heathrow Airport (the clue is in the name). \"We have always been open about the fact that we receive support from the airport and that they helped set the organisation up to balance the debate about expansion at a time when the voices of ordinary working people from the diverse communities around Heathrow were not being heard.\" \"Back Heathrow also receives support from trade unions, local businesses and residents from amongst the 100,000 registered supporters it now has,\" he added. \"We want an end to the dither and delay. Back Heathrow supporters want to see economic growth and the thousands of new jobs and apprenticeships a new runway will create.\" "
    },
    {
        "title": "Man charged after 150mph police chase on A12",
        "description": "A man has been charged after driving at more than 150mph during a car chase with police in Essex on Saturday.",
        "url": "https://news.sky.com/story/man-charged-after-150mph-police-chase-on-a12-13402610",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-essex-police-logo_6347720.jpg?20231104142016",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-27 15:16:00",
        "Headline": "Majid Masoud Saad, 31, from Barking, east London, has been charged with drink driving, dangerous driving and failing to stop for police.",
        "Content": "A man has been charged after driving at more than 150mph during a car chase with police in Essex on Saturday. Majid Masoud Saad, 31, from Barking, east London, has been charged with drink driving, dangerous driving and failing to stop for police. Essex Police stated that the driver was reaching speeds of more than 150mph during the chase, with London's Metropolitan Police initially in pursuit. The Essex force then said that \"the vehicle was pursued, and several tactics were used to stop it at Ongar\". Saad was bailed and is scheduled to appear at Basildon Magistrates' Court on 4 September."
    },
    {
        "title": "England hold nerve in penalty shootout to win Women's Euros again",
        "description": "England have retained their Women's Euros title after beating Spain on penalties in a tense final. ",
        "url": "https://news.sky.com/story/england-hold-nerve-in-penalty-shootout-to-win-womens-euros-again-13402574",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-euros_6975520.jpg?20250727200605",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-27 18:37:00",
        "Headline": "Substitute Chloe Kelly scored the winning penalty for Sarina Wiegman's side after a tense final in Basel as England retained their European title. ",
        "Content": " England have retained their Women's Euros title after beating Spain on penalties in a tense final.  Alessia Russo cancelled out Mariona Caldentey's 25th-minute header in the second half as the game finished 1-1 after 90 minutes. Spain had the better of extra-time but could not break down the England defence, so the match went to penalties in Basel, Switzerland. England retain Euros title - live reaction Substitute Chloe Kelly, who provided the cross for Russo's equaliser, fired in the winning penalty for Sarina Wiegman's side as they won the shootout 3-1. Hannah Hampton made two excellent saves in the shootout before Kelly, who scored the winner in extra-time at Wembley in 2022, took advantage of Salma Paralluelo's miss. \"I'm so proud, so proud of this team, so grateful to wear this badge, and I'm so proud to be English ... I was cool, I was composed and I knew I was going to hit the back of the net,\" Kelly said. \n                  Women's Euros: Calls for extra bank holiday as Lionesses successfully defend their title\n                 \n                  Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege \n                 \n                  England started the Euros being doubted - but showed resolve, resilience and relentlessness\n                  The final was the first time since the inaugural edition in 1984, in which England were beaten by Sweden, that the game was decided by a penalty shootout. \"Unbelievable, incredible, showing throughout this tournament we can come back when we go a goal down, and we have that grit,\" goalkeeper Hampton said. \"We've got English blood in us, so we never say die and we just keep going, and we did that today. Prime Minister Sir Keir Starmer congratulated the team on retaining their European crown. In a post on X, Sir Keir said: \"Champions! Congratulations @Lionesses - what a team. What a game. What drama. \"You dug deep when it mattered most and you've made the nation proud. History makers.\" The Prince of Wales attended the match with his daughter Princess Charlotte and was seen celebrating with those around him. William was among those to heap praise on striker Michelle Agyemang, who was named young player of the tournament. As the presentation ceremony took place, William exchanged words with Agyemang, appearing to say, \"Well played, fantastic, well done\"."
    },
    {
        "title": "Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza",
        "description": "Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-for-donald-trump-trade-talks-as-pm-walks-diplomatic-line-between-eu-allies-and-us-on-gaza-13402794",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-donad-trump_6975578.jpg?20250727214920",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-07-27 21:30:00",
        "Headline": "Despite some reports that Donald Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later. Downing Street said the prime minister would discuss \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during discussions at the president's Turnberry golf course in Ayrshire. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal… they want to die\". Sir Keir has tried to forge close personal ties with the president - frequently praising his actions on the world stage despite clear foreign policy differences between the US and UK. The approach seemed to pay off in May when Mr Trump announced the agreement of a trade deal with the UK that would see several tariffs lowered. The two leaders are expected to discuss this agreement when they meet, with the prime minister likely to press the president for a lowering of outstanding tariffs on imports such as steel.  Prior to the visit, the White House said the talks would allow them to \"refine the historic US-UK trade deal\". That comes hot on the heels of the US reaching an agreement with the EU, which Mr Trump described as the \"biggest dal ever made\". This will see 15% tariffs imposed on most European goods entering America, despite the president previously threatening a 30% levy.  Extracting promises from the president on the Middle East may be harder though. Despite some reports that Mr Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies. As he did over the Ukraine war, Sir Keir will have to walk a diplomatic line between the UK's European allies and the White House. On Thursday, French President Emmanuel Macron announced his country would formally recognise a Palestinian state in September, the first member of the G7 to do so. That move was dismissed by Mr Trump, who said it \"doesn't carry any weight\". Read more from Sky News:US and EU agree trade deal - with bloc facing 15% tariffsGeldof accuses Israel of 'lying' about Gaza starvation  The UK, French and German leaders spoke over the weekend and agreed to work together on the \"next phase\" in Gaza that would see transitional governance and security arrangements put in place, alongside the large-scale delivery of aid. Under pressure from members of his own party and cabinet to follow France and signal formal recognition of Palestine, Sir Keir has gradually become more critical of Israel in recent months. On Friday, the prime minister said \"the starvation and denial of humanitarian aid to the Palestinian people, the increasing violence from extremist settler groups, and Israel's disproportionate military escalation in Gaza are all indefensible\". Government sources say UK recognition is a matter of \"when, not if\" - but it's thought Downing Street wants to ensure any announcement is made at a time when it can have the greatest diplomatic impact.  Cabinet ministers will be convened in the coming days, during the summer recess, to discuss the situation in Gaza. The UK has also been working with Jordan to air drop supplies, after Israel said it would allow foreign countries to provide aid to the territory. Donald Trump's trip to Scotland comes ahead of his second state visit to the UK in September. Downing Street says Ukraine will also likely be discussed in the meeting with both men reflecting on what can be done to force Russia back to the negotiating table. After the meeting at Turnberry, the prime minister will travel with the president to Aberdeen for a private engagement. Mr Trump is also expected to meet Scottish First Minister John Swinney."
    },
    {
        "title": "Conservatives vow to ban doctor strikes - as Kemi Badenoch hits out at 'militant' union",
        "description": "The Conservatives would ban strikes for doctors, Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/conservatives-vow-to-ban-doctor-strikes-as-kemi-badenoch-hits-out-at-militant-union-13402480",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-junior-doctors-doctors_6960821.jpg?20250727124453",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-27 13:49:00",
        "Headline": "The Tory leader says she will treat doctors the same as the army and police, who are banned from taking industrial action.",
        "Content": " The Conservatives would ban strikes for doctors, Kemi Badenoch has said. The Tory leader said she would treat doctors the same as the army and police in order to bring the walkouts to an end. Politics latest: UK 'committed' to recognising Palestine as a state - but govt won't say when Under UK law, police officers, members of the armed forces and some prison officers are banned from striking. Resident doctors - previously known as junior doctors - began their five-day strike across England on Friday as part of an escalating row between NHS bosses and the British Medical Association (BMA) over pay. Last July, they were awarded a raise of 22% over two years, the highest public sector award in recent years. But the BMA has argued that pay has declined significantly since 2008 when adjusting for inflation and is calling for a pay rise of 29.2% to reverse \"pay erosion\". The latest deal saw doctors given a 4% increase, plus £750 \"on a consolidated basis\" - which comes to an average rise of 5.4%. Speaking to reporters, MS Badenoch said it was now Tory policy to ban strikes for resident doctors, arguing the BMA had become \"too militant\". \"We have seen 11 strikes in the last sort of 18 months, two years,\" she said. \"People are dying and it's costing the NHS billions. We need to bring these strikes to an end.\" She said she would also introduce minimum service levels for strikes - something that was brought in under Liz Truss's short tenure as prime minister before being repealed by the current government. The Conservatives argue their proposals would bring the UK in line with other nations across the world, including Australia and Canada, where restrictions on doctors striking are tighter. Read more:Everything you need to know about the doctors' strikeGovt vows to protect 'pavement pints' Meanwhile, Greece, Italy and Portugal have laws ensuring minimum service levels are in place across their health services. Speaking to Sunday Morning with Trevor Phillips, Dr Tom Dolphin, the chair of the BMA, said doctors \"don't want to be on strike\" but felt they had no choice. \"The reason that we are worried about the NHS and we're worried about the workforce in the NHS, is because doctors are being undervalued,\" he said. \"They're leaving the NHS in large numbers, and what we're trying to do is make sure that the offer that's there from the NHS, the pay, the total reward package, is enough to recruit and retain the best doctors that the patients deserve in the NHS.\" A Department of Health spokesperson said: \"We know that previous rounds of strikes caused much wider levels of harm and so this government is doing things differently. \"Working with NHS leaders, we've put in measures to keep as much urgent and planned care available and safe as we possibly can. \"During these strikes, all other NHS staff (including consultants and other specialist doctors) will still be working, and the focus of the NHS will be on ensuring as many services as possible continue to operate safely.\""
    },
    {
        "title": "Bishop in dressing gown interrupts church concert - and asks crowd to 'leave my house'",
        "description": "A disgruntled bishop in a dressing gown has interrupted a church concert in London - telling singers to stop their \"terrible racket\" and \"leave his house\".",
        "url": "https://news.sky.com/story/this-is-a-terrible-racket-bishop-in-dressing-gown-interrupts-church-concert-and-asks-crowd-to-leave-my-house-13402383",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bishop-church_6974905.jpg?20250727014901",
        "type": "UK",
        "Author": "Connor Sephton",
        "Date Published": "2025-07-27 00:29:00",
        "Headline": "\"This work deserves respect, not to be disparaged as a terrible racket,\" an audience member told Sky News. \"They put their heart and soul into it.\"",
        "Content": "\n          News reporter\n              @ConnorSephton\n  A disgruntled bishop in a dressing gown has interrupted a church concert in London - telling singers to stop their \"terrible racket\" and \"leave his house\". The City Academy Voices choir was coming to the end of their performance at St Andrew's in Holborn on Friday night when the lights were suddenly turned off. Footage on TikTok shows Jonathan Baker, the bishop of Fulham, standing barefoot at a microphone - as bemused performers and a 300-strong audience look on. \"You are in my house. It's gone past 10pm and this is a terrible racket,\" he said. \"Goodnight. You are in my house - can you leave it now please. Thank you, it's over.\" A church employee then asked the crowd to leave quietly and for the musicians to step down from the stage, attracting boos from the audience. The choir went on to perform one last song, an A cappella version of ABBA's Dancing Queen, before bringing their show to a close. Benedict Collins, who was attending the concert with his 10-year-old daughter, told Sky News he initially thought the interruption was a staged joke. \n                  Police offer £20k reward one year after fatal stabbing of 20-year-old in Newham\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Two teenagers sentenced to at least 15 years for machete murder of boy, 14, on London bus\n                 \"The church willingly rents out the premises for performances, for money,\" he said. \"They can hardly be surprised if they take bookings for concerts and there is music in the hall.\" Mr Collins said the talented choir had \"worked like mad\" on the performance - and criticised the bishop's remarks. \"This work deserves respect, not to be disparaged as a 'terrible racket',\" he added. \"The people here had put their heart and soul into it. The bishop cut them off in midstream, preventing soloists who had worked their hardest from singing - and preventing the audience, which included people of all ages, from enjoying it to the end.\" Read more UK news:Botox-like injections spark botulism outbreakAge verification tools on adult sites bypassed A spokesperson for the Diocese of London had told The Guardian: \"Bishop Jonathan reached out to the organisers on Saturday to apologise for his late-night appearance at the concert, which he now understands had overrun due to technical difficulties.\" But Mr Collins told Sky News that he felt this statement was \"mealy mouthed\". He added: \"I hope the bishop is well and okay. It's possible he just had a bad day. An unambiguous apology would help, one that recognises why his behaviour wasn't acceptable.\""
    },
    {
        "title": "Govt vows to protect 'pavement pints' and make it easier for pubs to extend their opening hours ",
        "description": "\"A wave of new cafes, bars, music venues and outdoor dining\" could come to the UK - as the government unveils plans to overhaul planning rules and \"breathe new life into the high street\".",
        "url": "https://news.sky.com/story/govt-vows-to-protect-pavement-pints-and-make-it-easier-for-pubs-to-extend-their-opening-hours-13402388",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-southbank-london-pub_5399801.jpg?20250727042839",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-27 02:21:00",
        "Headline": "The government claims its proposals will \"put the buzz back into our town centres\" but the hospitality industry warns it needs urgent tax reform to \"offset the immediate and mounting cost pressures\" which are putting firms out of business.",
        "Content": "\"A wave of new cafes, bars, music venues and outdoor dining\" could come to the UK - as the government unveils plans to overhaul planning rules and \"breathe new life into the high street\". Under the proposals, ministers also want to reform licensing rules to make it easier for disused shops to be converted into hospitality venues. In a statement, Chancellor Rachel Reeves said she planned to scrap \"clunky, outdated rules... to protect pavement pints, al fresco dining and street parties\". The reforms also aim to prevent existing pubs, clubs, and music venues from suffering noise complaints when new properties hit the market. Developers who decide to build near those sites will be required to soundproof their buildings. As part of dedicated \"hospitality zones\", permission for al fresco dining, street parties and extended opening hours will be fast-tracked. The government says the reforms aim to modernise outdated planning and licensing rules as part of its Plan for Change, to help small businesses and improve local communities. \n                  Owner of Cote restaurant chain cooks up sale plan\n                 \n                  A pub a day to close this year, industry body warns as it calls for cut to tax burden\n                 \n                  'We will see closures': The industries hit hardest by national insurance hike\n                 The rough plans will be subject to a \"call for evidence\" which could further shape policy. Business Secretary Jonathan Reynolds said the proposals will \"put the buzz back into our town centres\". \"Red tape has stood in the way of people's business ideas for too long. Today we're slashing those barriers to giving small business owners the freedom to flourish,\" he said. The hospitality industry has broadly welcomed the changes but argued tax reform was also essential. Kate Nicholls, chairwoman of UKHospitality, described the proposals as \"positive and encouraging\". However, she added: \"They can't on their own offset the immediate and mounting cost pressures facing hospitality businesses which threaten to tax out of existence the businesses and jobs that today's announcement seeks to support.\" Read more from Sky News:Licensing reforms for London venuesPubs forced to adapt to survive While supporting the reforms, Emma McClarkin, chief executive of the British Beer and Pub Association (BBPA), had a similar message. \"These changes must go hand in hand with meaningful business rates reform, mitigating staggering employment costs, and a cut in beer duty so that pubs can thrive at the heart of the community,\" she said. In July, BBPA estimated that 378 pubs will shut this year across England, Wales and Scotland, compared with 350 closures in 2024, which it said would amount to more than 5,600 direct job losses.  Bar chain Brewdog announced this week that it would close 10 sites, partly blaming \"rising costs, increased regulation, and economic pressures\". Andrew Griffith MP, shadow business secretary, said: \"Though any cutting of red tape for hospitality businesses is welcome, this is pure hypocrisy and inconsistency from Labour.\" He said the government was \"crippling the hospitality industry by doubling business rates, imposing a jobs tax and a full-on strangulation of employment red tape\"."
    },
    {
        "title": "Israel-Hamas war: 'Vast amounts of aid needed to stave off catastrophic health crisis in Gaza,' UN warns ",
        "description": "Israel has agreed to support a \"one-week scale-up of aid\" in Gaza - but the United Nations has warned more action is needed to \"stave off famine and a catastrophic health crisis\".",
        "url": "https://news.sky.com/story/israel-hamas-war-vast-amounts-of-aid-needed-to-stave-off-catastrophic-health-crisis-in-gaza-un-warns-13402838",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinian-aid_6975674.jpg?20250728020954",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 23:40:00",
        "Headline": "The UN's aid chief Tom Fletcher made the remarks as Israel began limited pauses in fighting in Gaza for 10 hours a day to address the humanitarian situation.",
        "Content": " Israel has agreed to support a \"one-week scale-up of aid\" in Gaza - but the United Nations has warned more action is needed to \"stave off famine and a catastrophic health crisis\". UN aid chief Tom Fletcher made the remarks as Israel began limited pauses in fighting across three areas of Gaza for 10 hours a day to address the worsening humanitarian situation. Israel cut off all supplies to Gaza's population from the start of March. It then reopened aid centres with new restrictions in May, but said the supply had to be controlled to prevent it from being stolen by Hamas militants. On Saturday, reports referencing US government data said there was no evidence Hamas had stolen aid from UN agencies. Images of emaciated Palestinian children have led to widespread criticism of Israel's actions in Gaza, including by allies who are calling for an end to the war. Mr Fletcher said one in three people in Gaza \"hasn't eaten for days\" and \"children are wasting away\". He added: \"We welcome Israel's decision to support a one-week scale-up of aid, including lifting customs barriers on food, medicine and fuel from Egypt and the reported designation of secure routes for UN humanitarian convoys. \n                  Aid is sitting idle in Gaza - where there is now widespread malnutrition\n                 \n                  Gaza: More than 30 people killed 'as Israeli troops open fire towards Palestinians waiting for aid' \n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 \"Some movement restrictions appear to have been eased today, with initial reports indicating that over 100 truckloads were collected. \"This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis. Across the UN agencies and humanitarian community, we are mobilised to save as many lives as we can.\" The Israel Defence Forces said yesterday that it is halting military operations in Muwasi, Deir al Balah and Gaza City daily from 10am to 8pm local time (8am to 6pm UK time) until further notice. Combat operations have continued outside of this 10-hour window. Health officials in Gaza said Israeli strikes killed at least 41 Palestinians overnight into Sunday morning, including 26 seeking aid. In a statement, the IDF said it would also establish secure routes to help the UN and aid agencies deliver food and other supplies. Israel's announcement of what it calls a \"tactical pause\" in fighting comes after it resumed airdrops of aid into Gaza. While the IDF reiterated claims there is \"no starvation\" in the territory, it said the airdrops would include \"seven pallets of aid containing flour, sugar and canned food to be provided by international organisations\". Palestinian sources confirmed that aid had begun dropping in northern parts of the territory. Sabreen Hasson, a Palestinian mother who travelled to an aid point near the Zikim crossing to collect supplies, said: \"I came to get flour for my children because they have not tasted flour for more than a week, and thank God, God provided me with a kilo of rice with difficulty.\" But Samira Yahda, who was in Zawaida in central Gaza, said: \"We saw the planes, but we didn't see what they dropped... they said trucks would pass, but we didn't see the trucks.\" Another Palestinian told the AP news agency that some people feared going out and having a box of aid fall on their children. Read more:What does recognising a Palestinian state mean?Parents of IDF soldier taken hostage fear he'll be one of last freed25% of young children 'now malnourished in Gaza'  Gaza is expected to be a focus during talks Sir Keir Starmer and Donald Trump in Scotland today. Downing Street said Sir Keir will raise \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during the meeting at the US president's Turnberry golf course in Ayrshire. Reports also suggest the prime minister is planning to interrupt the summer recess and recall his cabinet to discuss the crisis on Tuesday. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal... they want to die\". Meanwhile the exiled head of Hamas in Gaza, Khalil al Hayya, has warned ceasefire negotiations with Israel were \"meaningless under continued blockade and starvation\". In a recorded speech, he added: \"The immediate and dignified delivery of food and medicine to our people is the only serious and genuine indication of whether continuing the negotiations is worthwhile.\"  During a meeting with the European Commission President Ursula von der Leyen yesterday, Mr Trump emphasised the importance of securing the release of hostages held by Palestinian militants in Gaza. He said: \"They don't want to give them back, and so Israel is going to have to make a decision.  \"I know what I'd do, but I don't think it's appropriate that I say it. But Israel is going to have to make a decision,\" he said. Mr Trump also repeated claims, without evidence, that Hamas was stealing food coming into Gaza and selling it."
    },
    {
        "title": "At least three killed after train derailed in Germany, police say",
        "description": "At least three people have died after a train derailed in southern Germany, police have said.",
        "url": "https://news.sky.com/story/at-least-three-killed-after-train-derailed-in-germany-police-say-13402766",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-train-derailed-germany_6975529.jpg?20250727203049",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 19:12:00",
        "Headline": "A federal police spokesperson in Stuttgart told Sky News earlier on Sunday that the incident took place near the town of Riedlingen at around 6.10pm.",
        "Content": "At least three people have died after a train derailed in southern Germany, police have said. A spokesperson for the Federal Police Inspectorate in Stuttgart told Sky News earlier that the incident took place near the town of Riedlingen. Two train carriages came off the rails between the town and Munderkingen at around 6.10pm local time on Sunday, with around 100 people aboard. Photos from the scene showed parts of the train on its side as rescuers climbed atop the carriages. It was not immediately clear how many people had been injured. Passengers have since been evacuated from the train. Federal and local police said the cause of the incident remains under investigation. The Reuters news agency reported that the train was on a 55-mile route between Sigmaringen and Ulm in the state of Baden-Wurttemberg. \n                  Berlin school evacuated as children suffer breathing difficulties amid 'irritant gas', police say\n                 \n                  German Chancellor Friedrich Merz is meeting Donald Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off? \n                 \n                  Cologne: Around 20,000 people being evacuated after unexploded Second World War bombs discovered\n                 Read more from Sky News:Diseased cows cause Tour de France diversionUS and EU agree trade deal - with bloc facing 15% tariffsPlane makes dramatic plunge to avoid another aircraft In a post on X, German Chancellor Friedrich Merz said he mourned the victims and gave his condolences. Deutsche Bahn, Germany's main national railway operator, also said in a statement that it was cooperating with investigators"
    },
    {
        "title": "Democratic Republic of Congo: At least 34 people killed after Islamic State-backed rebels attack Catholic church",
        "description": "Islamic State-backed rebels killed at least 34 people in an attack at a Catholic church in eastern Congo on Sunday, according to officials.",
        "url": "https://news.sky.com/story/democratic-republic-of-congo-at-least-34-people-killed-after-islamic-state-backed-rebels-attack-catholic-church-13402556",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-drc-congo-komanda-adf_6975289.jpg?20250727164048",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 15:50:00",
        "Headline": "A civil society leader in Komanda told the AP news agency that the attack was believed to have been carried out by the Allied Democratic Forces (ADF), a Ugandan Islamist rebel group.",
        "Content": "Islamic State-backed rebels killed at least 34 people in an attack at a Catholic church in eastern Congo on Sunday, according to officials. A civil society leader in Komanda, in the northeastern Democratic Republic of Congo, told the AP news agency that the attack was believed to have been carried out by the Allied Democratic Forces (ADF), a Ugandan Islamist rebel group. Dieudonne Duranthabo, civil society coordinator, said: \"The bodies of the victims are still at the scene of the tragedy, and volunteers are preparing how to bury them in a mass grave that we are preparing in a compound of the Catholic church.\" He condemned the attack \"in a town where all the security officials are present\" before adding: \"We demand military intervention as soon as possible, since we are told the enemy is still near our town.\" Other city officials told the Reuters news agency that 38 people were killed, 15 injured, and several others were still missing. Read more:Thailand and Cambodia agree to peace talksTurkey faces 'truly great disaster' amid wildfiresBaby Zainab starved to death in Gaza Christophe Munyanderu, a human rights activist present at the scene in Komanda, said shots were heard overnight, but people at first thought it was thieves. \"The rebels mainly attacked Christians who were spending the night in the Catholic church,\" he said. \"Unfortunately, these people were killed with machetes or bullets.\" The ADF was formed by disparate small groups in Uganda in the late 1990s following alleged discontent with former president Yoweri Museveni. In 2002, following military assaults by Ugandan forces, the group moved its activities to the neighbouring DRC, and has since been responsible for the killings of thousands of civilians. According to a 2019 report on terrorism from the US Department of State, the ADF established ties with Islamic State in late 2018 It comes after at least five other people were killed in an attack on the nearby village of Machongani, where a search is ongoing. \"They took several people into the bush,\" Lossa Dhekana, a civil society leader in Ituri province, told the AP, \"we do not know their destination or their number\"."
    },
    {
        "title": "US and EU agree trade deal - with bloc facing 15% tariffs on goods into America",
        "description": "The United States and European Union have reached an agreement on a trade deal, says Donald Trump.",
        "url": "https://news.sky.com/story/us-and-eu-agree-trade-deal-says-donald-trump-13402672",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6975464.jpg?20250727184756",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 17:04:00",
        "Headline": "Speaking after talks at his Turnberry golf resort, President Donald Trump said it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture.",
        "Content": " The United States and European Union have reached an agreement on a trade deal, says Donald Trump. The announcement was made as the US president met European Commission chief Ursula von der Leyen at one of his golf resorts in Scotland. Speaking after talks in Turnberry, Mr Trump told reporters it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture. The US will impose 15% tariffs on most EU goods entering America, after Mr Trump had threatened a 30% levy. The deal includes $600bn (£446bn) of EU investments in the US, and the bloc will buy $750bn (£558bn) of US energy and also purchase American military equipment. Mr Trump said: \"I think it's great that we made a deal today instead of playing games and maybe not making a deal at all.\" \"I think it's the biggest deal ever made.\" \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Donald Trump gives his view on chances of US-EU trade deal - while on the golf course\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 He said: \"We are agreeing that the tariff... for automobiles and everything else will be a straight across tariff of 15%.\" However, the 15% baseline rate would not apply to steel and aluminium, for which a 50% tariff would stay in place. Ms Von der Leyen said: \"We have a trade deal between the two largest economies in the world and it's a big deal, it's a huge deal. It will bring stability, it will bring predictability, that's very important for our businesses on both sides of the Atlantic.\" She said the agreement would include 15% tariffs \"across the board\", and it would help rebalance trade between the two large trading partners. She said the levy rate was the \"best we could get\" regarding the car sector. But she added that there was \"no decision\" on the spirits sector, which was one of those areas where the details in the framework trade deal would have to be examined in the coming weeks. Read more from Sky News:Wildfires break out in Greece, Turkey and AlbaniaConservatives vow to ban doctor strikes Mr Trump had earlier said the main sticking point was \"fairness\", citing barriers to US exports of cars and agriculture. He went into the talks demanding fairer trade with the 27-member bloc and threatening steep tariffs to achieve that, while insisting the US will not go below 15% import taxes. For months, Mr Trump has threatened most of the world with large tariffs in the hope of shrinking major US trade deficits with many key trading partners, including the EU. In case there was no deal and the US had imposed 30% tariffs from 1 August, the EU has prepared counter-tariffs on €93bn (£81bn) of US goods. Ahead of their meeting on Sunday, Ms Von der Leyen described Mr Trump as a \"tough negotiator and dealmaker\". The deal mirrors parts of the framework agreement the US clinched with Japan last week."
    },
    {
        "title": "Firefighters tackle blazes as wildfires break out in Greece, Turkey and Albania",
        "description": "Firefighters are battling blazes that have broken out across several countries in southeast Europe, fuelled by dry conditions, high winds and extreme temperatures.",
        "url": "https://news.sky.com/story/firefighters-tackle-blazes-as-wildfires-break-out-in-greece-turkey-and-albania-13402410",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-greece-wildfires_6974951.jpg?20250727074522",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 06:52:00",
        "Headline": "A politician in Turkey described the scene as \"an apocalypse\" as forests burned and more than 1,100 firefighters battled the flames. Meanwhile, in Greece, some suburbs of Athens have been evacuated.",
        "Content": " Firefighters are battling blazes that have broken out across several countries in southeast Europe, fuelled by dry conditions, high winds and extreme temperatures. A firefighter has died and thousands of people have been evacuated in a weekend that has seen dozens of fires scorch forests and burn houses to the ground. More than 50 wildfires have erupted in Greece in the past 24 hours, leading to evacuations in some Athens suburbs and a request to the EU for six firefighting planes. A politician in Turkey's fourth-largest city of Bursa described the scene as \"an apocalypse\" as forests burned and more than 1,100 firefighters tried to control the flames. Turkey Wildfires have engulfed Turkey for weeks, and on Friday the government declared two western provinces, Izmir and Bilecik, disaster areas. Fire crews confronted 76 separate blazes across the country on Saturday, forestry minister Ibrahim Yamukli said. Almost 1,800 people were forced to flee their homes in villages to the northeast of Bursa, where a firefighter died from a heart attack while on the job, the city's mayor, Mustafa Bozbey, said. Orhan Saribal, an opposition parliamentarian for the province, described the scene as \"an apocalypse\". Turkey recorded its highest ever temperature of 50.5C (123F) in the southeastern Sirnak province on Friday. Fourteen people have died in recent weeks, including 10 rescue volunteers and forestry workers killed on Wednesday in a fire in the west of the country. Greece Parts of Athens have been evacuated after more than 50 wildfires broke out in 24 hours. People living in the suburb of Kryoneri, around 12.5 miles (20 km) northeast of the Greek capital, were told to move to safe areas on Saturday. At least five people, most of them elderly with respiratory problems, have been treated in hospital for burns or smoke inhalation. Photos showed houses and tree-covered hills on fire as temperatures hit 38C (100F), and dry conditions and high winds fanned the flames. Fire service spokesman Vassilis Vathrakoyannis said that under such conditions, wildfires \"expand very quickly and become dangerous\", adding: \"These conditions are expected to prevail over the coming days.\" There have been reports of damage, he said, and authorities \"will take stock when the fires have been put out\". At least 335 firefighters are also battling three major fires on Greece's two largest islands - Crete in the south and Evia north of Athens - and also on the island of Kythera, northwest of Crete. Greece has also received support from the Czech Republic, with a fire service based there saying they sent a team to support Greek firefighters battling a forest blaze near the town of Nea Artaki. Read more on Sky News:Israel pauses Gaza fighting amid hunger crisis11 stabbed in US store Albania In neighbouring Albania, 26 fires broke out throughout the country on Saturday, following a large fire near the southern Albanian town of Delvina on Friday, which injured three people and forced the evacuation of about 2,000 residents. Kosovo In Kosovo, firefighters managed to extinguish 17 blazes fuelled by strong winds while 12 others remained active, officials said. Eight cows were killed in the southern town of Prizren, after a fire engulfed a farm, local emergency services said, while 40 sheep died in a fire in the east of the country."
    },
    {
        "title": "Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues",
        "description": "Thai and Cambodian leaders will meet in Malaysia for talks to end the cross-border fighting that has seen dozens of people killed.",
        "url": "https://news.sky.com/story/thailand-and-cambodia-agree-to-peace-talks-after-trump-intervention-but-shelling-continues-13402462",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cambodia-oddar-meanchey_6975015.jpg?20250727100815",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 09:45:00",
        "Headline": "Thai and Cambodian leaders have agreed to meet for ceasefire talks. But even as hopes for a lasting peace grew, each country accused the other of shelling targets across the disputed border areas.",
        "Content": "Thai and Cambodian leaders will meet in Malaysia for talks to end the cross-border fighting that has seen dozens of people killed. The move comes after Donald Trump intervened, suggesting to the leaders of both countries that continued hostilities would harm their chances of getting a trade deal with the US. He posted about the conversations on his social media platform Truth Social on Saturday and later said both sides agreed to meet to negotiate a ceasefire. Later on Sunday, the US's leading diplomat, Marco Rubio, in phone calls to the foreign ministers of both countries, told them Washington was prepared to facilitate talks and urged them to de-escalate and agree to a ceasefire immediately, the state department said in a statement. At least 34 people, including 13 civilians, have died, while more than 200,000 have been forced to leave their homes to escape the fighting, now into its fourth day. Cambodian Prime Minister Hun Manet said on Sunday his country agreed to pursue an \"immediate and unconditional ceasefire\". He said Mr Trump told him that Thailand had also agreed to halt attacks following the US leader's conversation with Acting Thai Prime Minister Phumtham Wechayachai. The Cambodian leader said it was \"positive news for the soldiers and people of both countries\". Thailand's foreign ministry expressed cautious support, reporting that its leader told Mr Trump Thailand agreed in principle to a ceasefire while insisting on the need for \"sincere intention\" from its South East Asian neighbour. He called for swift bilateral talks to discuss concrete steps toward a peaceful resolution, the ministry said. But even as hopes for a lasting peace grew, hours later in the early hours of Sunday, each accused the other of shelling targets across the disputed border areas. Read more:Why have tensions escalated?Clashes before, but this time feels different - analysis  In what appeared to be a sign of immediate progress, Malaysia's state news agency, Bernama, quoting Malaysia's foreign minister Mohamad Hasan, said the two leaders will open peace talks in Malaysia on Monday. The two nations have been at loggerheads over border areas for decades, and simmering tensions escalated into an exchange of gunfire, shelling and rockets on 24 July, with both sides accusing one another of initiating the violence. Both countries recalled their ambassadors, and Thailand closed its border crossings with Cambodia. Relations between the pair deteriorated sharply after an armed confrontation in May that killed a Cambodian soldier. Nationalist passions on both sides have further inflamed the situation. Both countries claim to own the ancient Ta Muen Thom temple along the border of Thailand's Surin province and Cambodia's Oddar Meanchey province, among other areas."
    },
    {
        "title": "England hold nerve in penalty shootout to win Women's Euros again",
        "description": "England have retained their Women's Euros title after beating Spain on penalties in a tense final. ",
        "url": "https://news.sky.com/story/england-hold-nerve-in-penalty-shootout-to-win-womens-euros-again-13402574",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-euros_6975520.jpg?20250727200605",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-27 18:37:00",
        "Headline": "Substitute Chloe Kelly scored the winning penalty for Sarina Wiegman's side after a tense final in Basel as England retained their European title. ",
        "Content": " England have retained their Women's Euros title after beating Spain on penalties in a tense final.  Alessia Russo cancelled out Mariona Caldentey's 25th-minute header in the second half as the game finished 1-1 after 90 minutes. Spain had the better of extra-time but could not break down the England defence, so the match went to penalties in Basel, Switzerland. England retain Euros title - live reaction Substitute Chloe Kelly, who provided the cross for Russo's equaliser, fired in the winning penalty for Sarina Wiegman's side as they won the shootout 3-1. Hannah Hampton made two excellent saves in the shootout before Kelly, who scored the winner in extra-time at Wembley in 2022, took advantage of Salma Paralluelo's miss. \"I'm so proud, so proud of this team, so grateful to wear this badge, and I'm so proud to be English ... I was cool, I was composed and I knew I was going to hit the back of the net,\" Kelly said. \n                  Women's Euros: Calls for extra bank holiday as Lionesses successfully defend their title\n                 \n                  Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege \n                 \n                  England started the Euros being doubted - but showed resolve, resilience and relentlessness\n                  The final was the first time since the inaugural edition in 1984, in which England were beaten by Sweden, that the game was decided by a penalty shootout. \"Unbelievable, incredible, showing throughout this tournament we can come back when we go a goal down, and we have that grit,\" goalkeeper Hampton said. \"We've got English blood in us, so we never say die and we just keep going, and we did that today. Prime Minister Sir Keir Starmer congratulated the team on retaining their European crown. In a post on X, Sir Keir said: \"Champions! Congratulations @Lionesses - what a team. What a game. What drama. \"You dug deep when it mattered most and you've made the nation proud. History makers.\" The Prince of Wales attended the match with his daughter Princess Charlotte and was seen celebrating with those around him. William was among those to heap praise on striker Michelle Agyemang, who was named young player of the tournament. As the presentation ceremony took place, William exchanged words with Agyemang, appearing to say, \"Well played, fantastic, well done\"."
    },
    {
        "title": "US and EU agree trade deal - with bloc facing 15% tariffs on goods into America",
        "description": "The United States and European Union have reached an agreement on a trade deal, says Donald Trump.",
        "url": "https://news.sky.com/story/us-and-eu-agree-trade-deal-says-donald-trump-13402672",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6975464.jpg?20250727184756",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-27 17:04:00",
        "Headline": "Speaking after talks at his Turnberry golf resort, President Donald Trump said it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture.",
        "Content": " The United States and European Union have reached an agreement on a trade deal, says Donald Trump. The announcement was made as the US president met European Commission chief Ursula von der Leyen at one of his golf resorts in Scotland. Speaking after talks in Turnberry, Mr Trump told reporters it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture. The US will impose 15% tariffs on most EU goods entering America, after Mr Trump had threatened a 30% levy. The deal includes $600bn (£446bn) of EU investments in the US, and the bloc will buy $750bn (£558bn) of US energy and also purchase American military equipment. Mr Trump said: \"I think it's great that we made a deal today instead of playing games and maybe not making a deal at all.\" \"I think it's the biggest deal ever made.\" \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Donald Trump gives his view on chances of US-EU trade deal - while on the golf course\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 He said: \"We are agreeing that the tariff... for automobiles and everything else will be a straight across tariff of 15%.\" However, the 15% baseline rate would not apply to steel and aluminium, for which a 50% tariff would stay in place. Ms Von der Leyen said: \"We have a trade deal between the two largest economies in the world and it's a big deal, it's a huge deal. It will bring stability, it will bring predictability, that's very important for our businesses on both sides of the Atlantic.\" She said the agreement would include 15% tariffs \"across the board\", and it would help rebalance trade between the two large trading partners. She said the levy rate was the \"best we could get\" regarding the car sector. But she added that there was \"no decision\" on the spirits sector, which was one of those areas where the details in the framework trade deal would have to be examined in the coming weeks. Read more from Sky News:Wildfires break out in Greece, Turkey and AlbaniaConservatives vow to ban doctor strikes Mr Trump had earlier said the main sticking point was \"fairness\", citing barriers to US exports of cars and agriculture. He went into the talks demanding fairer trade with the 27-member bloc and threatening steep tariffs to achieve that, while insisting the US will not go below 15% import taxes. For months, Mr Trump has threatened most of the world with large tariffs in the hope of shrinking major US trade deficits with many key trading partners, including the EU. In case there was no deal and the US had imposed 30% tariffs from 1 August, the EU has prepared counter-tariffs on €93bn (£81bn) of US goods. Ahead of their meeting on Sunday, Ms Von der Leyen described Mr Trump as a \"tough negotiator and dealmaker\". The deal mirrors parts of the framework agreement the US clinched with Japan last week."
    },
    {
        "title": "Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza",
        "description": "Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-for-donald-trump-trade-talks-as-pm-walks-diplomatic-line-between-eu-allies-and-us-on-gaza-13402794",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-donad-trump_6975578.jpg?20250727214920",
        "type": "US",
        "Author": "Rob Powell",
        "Date Published": "2025-07-27 21:30:00",
        "Headline": "Despite some reports that Donald Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later. Downing Street said the prime minister would discuss \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during discussions at the president's Turnberry golf course in Ayrshire. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal… they want to die\". Sir Keir has tried to forge close personal ties with the president - frequently praising his actions on the world stage despite clear foreign policy differences between the US and UK. The approach seemed to pay off in May when Mr Trump announced the agreement of a trade deal with the UK that would see several tariffs lowered. The two leaders are expected to discuss this agreement when they meet, with the prime minister likely to press the president for a lowering of outstanding tariffs on imports such as steel.  Prior to the visit, the White House said the talks would allow them to \"refine the historic US-UK trade deal\". That comes hot on the heels of the US reaching an agreement with the EU, which Mr Trump described as the \"biggest dal ever made\". This will see 15% tariffs imposed on most European goods entering America, despite the president previously threatening a 30% levy.  Extracting promises from the president on the Middle East may be harder though. Despite some reports that Mr Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies. As he did over the Ukraine war, Sir Keir will have to walk a diplomatic line between the UK's European allies and the White House. On Thursday, French President Emmanuel Macron announced his country would formally recognise a Palestinian state in September, the first member of the G7 to do so. That move was dismissed by Mr Trump, who said it \"doesn't carry any weight\". Read more from Sky News:US and EU agree trade deal - with bloc facing 15% tariffsGeldof accuses Israel of 'lying' about Gaza starvation  The UK, French and German leaders spoke over the weekend and agreed to work together on the \"next phase\" in Gaza that would see transitional governance and security arrangements put in place, alongside the large-scale delivery of aid. Under pressure from members of his own party and cabinet to follow France and signal formal recognition of Palestine, Sir Keir has gradually become more critical of Israel in recent months. On Friday, the prime minister said \"the starvation and denial of humanitarian aid to the Palestinian people, the increasing violence from extremist settler groups, and Israel's disproportionate military escalation in Gaza are all indefensible\". Government sources say UK recognition is a matter of \"when, not if\" - but it's thought Downing Street wants to ensure any announcement is made at a time when it can have the greatest diplomatic impact.  Cabinet ministers will be convened in the coming days, during the summer recess, to discuss the situation in Gaza. The UK has also been working with Jordan to air drop supplies, after Israel said it would allow foreign countries to provide aid to the territory. Donald Trump's trip to Scotland comes ahead of his second state visit to the UK in September. Downing Street says Ukraine will also likely be discussed in the meeting with both men reflecting on what can be done to force Russia back to the negotiating table. After the meeting at Turnberry, the prime minister will travel with the president to Aberdeen for a private engagement. Mr Trump is also expected to meet Scottish First Minister John Swinney."
    },
    {
        "title": "Michigan: 11 people stabbed in US supermarket - with six in critical condition",
        "description": "At least 11 people have been stabbed at a Walmart supermarket in Michigan, with six in a critical condition.",
        "url": "https://news.sky.com/story/michigan-11-people-stabbed-in-us-supermarket-with-six-in-critical-condition-13402385",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-walmart-michigan_6974913.jpg?20250727022545",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-27 01:10:00",
        "Headline": "\"It was really scary. Me and my sister were just freaking out,\" one eyewitness said. \"This is something you see out of the movies.\"",
        "Content": "At least 11 people have been stabbed at a Walmart supermarket in Michigan, with six in a critical condition. Officials say a suspect is in custody - and at this stage, it is believed the attack was a \"random act\" that involved a folding-style knife near the checkout area. Sheriff Michael Shea told reporters: \"Eleven is 11 too many, but thank God it wasn't more.\" The suspect, who is from Michigan, is not known to police - and was captured within three minutes thanks to \"citizen involvement\". The attack unfolded in Traverse City - and Tiffany DeFell, who was in the car park at the time, described scenes of chaos. \"It was really scary. Me and my sister were just freaking out,\" she said. \"This is something you see out of the movies.\" Beyond the six people in a critical condition, it is believed the remaining five were seriously hurt. All 11 are still being treated in hospital. \n                  US and EU agree trade deal - with bloc facing 15% tariffs on goods into America\n                 \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Florida: Arrests after children 'kept in cages under bunk beds and sprayed in face as punishment'\n                 Michigan Governor Gretchen Whitmer said: \"Our thoughts are with the victims and the community reeling from this brutal act of violence.\" A Walmart spokesperson added that the retailer is working closely with law enforcement. \"Violence like this is unacceptable. Our thoughts are with those who were injured and we're thankful for the swift action of first responders,\" a statement said. At this stage, the ages of the victims is unclear - but it is not thought any of the victims were Walmart employees. Traverse City is about 255 miles northwest of Detroit."
    },
    {
        "title": "Florida: Arrests after children 'kept in cages under bunk beds and sprayed in face as punishment'",
        "description": "Four people have been arrested after being accused of abusing nine children in Florida.",
        "url": "https://news.sky.com/story/florida-arrests-after-children-kept-in-cages-under-bunk-beds-and-sprayed-in-face-as-punishment-13402393",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brian-griffeth-jill-griffeth_6974928.jpg?20250727051533",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-27 04:15:00",
        "Headline": "Husband and wife Brian and Jill Griffeth - along with Dallin and Liberty Griffeth - were accused of treating their adopted children differently.",
        "Content": "Four people have been arrested after being accused of abusing nine children in Florida. Officials allege they were kept in cages made of plywood under bunk beds and sprayed in the face with vinegar as a form of punishment. Husband and wife Brian and Jill Griffeth - along with Dallin and Liberty Griffeth - have now been charged with aggravated child abuse. The children are aged between 7 and 16, and it is believed four had been adopted. According to the local sheriff's office, the adopted children were \"treated unfairly compared to the biological children\" - and did not know their full names or birthdays. Prosecutors claim they were beaten with canes, given non-prescribed medication, and ordered to lie about what was happening in their Fort White home. When investigators visited the property, the adopted children were working on chores while the biological siblings played or watched TV. \n                  US and EU agree trade deal - with bloc facing 15% tariffs on goods into America\n                 \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Michigan: 11 people stabbed in US supermarket - with six in critical condition\n                 All of the children have now been removed from the property. An investigation began after someone at their local church, who is legally required to report suspected cases of child abuse or neglect, raised concerns. A few days before the four were arrested, one of the children was also caught with a functioning electronic stun gun at a church camp."
    },
    {
        "title": "US and EU agree trade deal - with bloc facing 15% tariffs on goods into America",
        "description": "The United States and European Union have reached an agreement on a trade deal, says Donald Trump.",
        "url": "https://news.sky.com/story/us-and-eu-agree-trade-deal-says-donald-trump-13402672",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6975464.jpg?20250727184756",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-27 17:04:00",
        "Headline": "Speaking after talks at his Turnberry golf resort, President Donald Trump said it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture.",
        "Content": " The United States and European Union have reached an agreement on a trade deal, says Donald Trump. The announcement was made as the US president met European Commission chief Ursula von der Leyen at one of his golf resorts in Scotland. Speaking after talks in Turnberry, Mr Trump told reporters it was the \"biggest deal ever made\" and will be \"great for cars\" as well as having a \"big impact\" on agriculture. The US will impose 15% tariffs on most EU goods entering America, after Mr Trump had threatened a 30% levy. The deal includes $600bn (£446bn) of EU investments in the US, and the bloc will buy $750bn (£558bn) of US energy and also purchase American military equipment. Mr Trump said: \"I think it's great that we made a deal today instead of playing games and maybe not making a deal at all.\" \"I think it's the biggest deal ever made.\" \n                  Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza\n                 \n                  Donald Trump gives his view on chances of US-EU trade deal - while on the golf course\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 He said: \"We are agreeing that the tariff... for automobiles and everything else will be a straight across tariff of 15%.\" However, the 15% baseline rate would not apply to steel and aluminium, for which a 50% tariff would stay in place. Ms Von der Leyen said: \"We have a trade deal between the two largest economies in the world and it's a big deal, it's a huge deal. It will bring stability, it will bring predictability, that's very important for our businesses on both sides of the Atlantic.\" She said the agreement would include 15% tariffs \"across the board\", and it would help rebalance trade between the two large trading partners. She said the levy rate was the \"best we could get\" regarding the car sector. But she added that there was \"no decision\" on the spirits sector, which was one of those areas where the details in the framework trade deal would have to be examined in the coming weeks. Read more from Sky News:Wildfires break out in Greece, Turkey and AlbaniaConservatives vow to ban doctor strikes Mr Trump had earlier said the main sticking point was \"fairness\", citing barriers to US exports of cars and agriculture. He went into the talks demanding fairer trade with the 27-member bloc and threatening steep tariffs to achieve that, while insisting the US will not go below 15% import taxes. For months, Mr Trump has threatened most of the world with large tariffs in the hope of shrinking major US trade deficits with many key trading partners, including the EU. In case there was no deal and the US had imposed 30% tariffs from 1 August, the EU has prepared counter-tariffs on €93bn (£81bn) of US goods. Ahead of their meeting on Sunday, Ms Von der Leyen described Mr Trump as a \"tough negotiator and dealmaker\". The deal mirrors parts of the framework agreement the US clinched with Japan last week."
    },
    {
        "title": "Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege ",
        "description": "A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion.",
        "url": "https://news.sky.com/story/heathrow-funded-group-sending-incredibly-misleading-mail-to-homes-across-west-london-campaigners-allege-13390542",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emirates-airbus-a380_6806347.jpg?20250121132517",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-27 03:13:00",
        "Headline": "Back Heathrow is funded by the airport, and headed by a former minister and member of Labour's policy forum. But the funding is not disclosed on Back Heathrow's newsletter or website.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion. The group, called Back Heathrow, sent leaflets to people living near the airport, claiming expansion could be the route to a \"greener\" airport and suggesting it would mean only the \"cleanest and quietest aircraft\" fly there. It comes as the airport prepares to submit its planning application for a third runway ahead of the 31 July deadline, following the government's statement of support for the expansion. Back Heathrow calls itself a \"local campaign group of over 100,000 residents\" and does not mention the funding it receives from the airport in the newsletter. Its website also does not mention the current financial support and says it \"initially launched with funding from Heathrow Airport but we have since grown\". Back Heathrow also told Sky News it had \"always been open\" about the support it receives from the airport. At the bottom of every web page, the organisation says: \"Back Heathrow is a group of residents, businesses and community groups who have come together to defend the jobs that rely on Heathrow and to campaign for its secure future.\" Heathrow Airport said it had always been clear about funding Back Heathrow, but would not disclose how much it provides. Who's behind Back Heathrow? The group's executive director is former Labour minister Parmjit Dhanda, who was MP for Gloucester from 2001 to 2010 and sits on the National Policy Forum - the body responsible for developing Labour policy. Latest accounts for Back Heathrow show it had five employees, including its two directors, in the financial year ending 30 June 2024. The second director is John Braggins, a former campaign adviser to Tony Blair. The business had £243,961 in cash, the accounts show. What are the group saying? In the newsletter, executive director Mr Dhanda said people ask if Heathrow is sustainable. In answering the question, he appeared to suggest the airport can dictate what types of planes use Heathrow. \"We can build a cleaner, greener and smarter airport - using more sustainable aviation fuel, ensuring only the cleanest and quietest aircraft fly here, reduce stacking in our skies and modernise our airspace to cut emissions in flight,\" he wrote. When asked by Sky News what Back Heathrow meant and what the source for the claim was, the organisation pointed to the airport's traffic light system of noise and emission measurements for the 50 largest airlines serving Heathrow. \"The scheme helps to see what areas certain airlines are excelling in and where improvements can be made,\" a spokesperson said. But those \"cleaner and greener\" claims were dismissed as \"myths\" by one campaigner. Finlay Asher is an aerospace engineer and co-founder of Safe Landing, a group of aviation workers and enthusiasts seeking climate improvements in the industry. He said the emissions savings from sustainable aviation fuel (SAF) were \"highly debatable\" - but added that even if they were taken at face value, use of these fuels is \"relatively low\" and so only provides small emissions reductions. \"Air traffic growth at Heathrow will wipe this out,\" he said. Mr Asher also disputed the claim that only the cleanest and quietest aircraft will fly at Heathrow. \"There is no policy in place which prevents older generation aircraft from being operated out of any airport,\" he said. As for reducing \"stacking\" - where aircraft wait over an airport to land - Mr Asher said if that's the goal, \"adding more aircraft to the sky won't make this easier\".   Opposition to Back Heathrow's claims also came from Rob Barnstone, founding member of the No Third Runway Coalition, which is funded by five local authorities surrounding Heathrow Airport. He said that regardless of fuel efficiencies or new quieter engines, having the additional 260,000 flights Heathrow has said will be created with an extra runway - in addition to the airport's current cap of 480,000 - would create \"an awful lot of noise\". \"For all the best will in the world, Heathrow is a very, very, very noisy neighbour... When you're adding a quarter of a million additional flights, that's going to create an awful lot of emissions, even if they're using planes that are ever so slightly less environmentally damaging than previous planes,\" Mr Barnstone said. Green claims Under the heading of \"UK sustainable fuel industry for Heathrow\", Back Heathrow said \"advances in electric and hydrogen powered aircraft can ensure we meet our environmental targets\". Elaborating on this, Back Heathrow told Sky News: \"Zero-emission electric and hydrogen aircraft are very much the end goal for civil aviation and countries like Norway have set 2040 as the year that all of their short-haul flights will be by electric planes.\" The statement was called \"incredibly misleading\" by Dr Alex Chapman, senior economist at the left-leaning think tank New Economics Foundation (NEF). \"There's just absolutely no confidence that those aircraft are going to have any meaningful impact on emissions and commercial aviation in any reasonable time frame. And, yeah, we can all speculate as to what may not happen in 50 years' time. But I think the people living around the airport should be given the information about what's actually realistic.\" Even if the technology were available, the runway may not be ready for it, Dr Chapman said. \"Perhaps more importantly, there's been no indication so far that the proposed new runway is being built to cater for those types of aircraft, because a runway that caters to electrical, hydrogen powered aircraft would be very different to one that was for conventional fuel, particularly in terms of the fuelling infrastructure around it that would be required: pipes to pipe hydrogen, massive charging power facilities.\"  While work is under way to develop electric aircraft, there are currently no commercial electric flights taking place. The best-case scenario is battery-powered flights that may be suitable for short journeys. But as a major international airport, more than 40% of Heathrow's flights are long-haul and medium-haul. And while airlines such as easyJet have called for government funding to develop hydrogen flying suitable for short-haul flights, there are obstacles to making regular commercial flights a reality. Providing enough hydrogen for the plane journeys from renewable sources will be challenging, as will transporting the fuel, and reworking airport infrastructure for hydrogen refuelling. Plans for hydrogen aircraft are at least a decade away, with Airbus saying it wants to get a 100-seat hydrogen plane in the air by 2035 - although Back Heathrow's estimates for a third runway have flights taking off in 2034. For now, rising emissions from flying are risking the UK's climate targets, according to the independent government advisers of the Climate Change Committee, who found flights contribute more greenhouse gas than the entire electricity supply sector. Expanding at 'full capacity' On the first page of the newsletter, Back Heathrow says \"Heathrow is at full capacity\", but the company told Sky News the airport has been \"operating at 98% capacity since 2005\". Despite its 98% capacity, Heathrow Airport has broken passenger number records every year for the past 14 years - excluding the pandemic years of 2020 to 2023. Dr Chapman said Heathrow is at capacity regarding the government-imposed flight cap, not at the capacity of the current runway infrastructure. \"So if the government were, for example, to lift that cap on the number of aircraft movements, it's pretty likely that they could actually fly 10% to 20% more flights out of the existing infrastructure,\" he said. As aeroplanes have expanded to carry more passengers, the airport has welcomed more people, he added. The airport earlier this month announced plans to increase its capacity by 10 million passengers a year, before a third runway is built, and to raise the charge paid by passengers to fund the investment. Read more:New internet rules come into force - here's what is changingGood economic news as sunny weather boosted retail sales How have the group and the airport responded? A Heathrow spokesperson said: \"Back Heathrow represents tens of thousands of local people who want to make their views known on the importance of Heathrow to their communities and livelihoods today and into the future. \"We have always been clear that, alongside individual residents, local business groups and trade unions, we provide funding for Back Heathrow to provide a voice for local people who historically have not been heard in the debate about expanding Heathrow.\" Speaking for the campaign group, Mr Dhanda said: \"At Back Heathrow we are proud of our link to Heathrow Airport (the clue is in the name). \"We have always been open about the fact that we receive support from the airport and that they helped set the organisation up to balance the debate about expansion at a time when the voices of ordinary working people from the diverse communities around Heathrow were not being heard.\" \"Back Heathrow also receives support from trade unions, local businesses and residents from amongst the 100,000 registered supporters it now has,\" he added. \"We want an end to the dither and delay. Back Heathrow supporters want to see economic growth and the thousands of new jobs and apprenticeships a new runway will create.\" "
    },
    {
        "title": "Wise set for resounding victory in battle with co-founder Hinrikus",
        "description": "The &#163;10bn payments company Wise is poised to win a resounding triumph in a battle with its co-founder over plans to shift its primary stock market listing to the US.",
        "url": "https://news.sky.com/story/wise-set-for-resounding-victory-in-battle-with-co-founder-hinrikus-13402476",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wise-bank_6969917.jpg?20250721132310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-27 10:29:00",
        "Headline": "Skaala is expected to win \"very limited\" support for its bid to derail the £10.5bn payments company's plan to extend dual-class voting until the mid-2030s, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The £10bn payments company Wise is poised to win a resounding triumph in a battle with its co-founder over plans to shift its primary stock market listing to the US. Sky News understands that Wise will disclose on Monday that only a small minority of investors have backed efforts by Skaala - the investment vehicle of Taavet Hinrikus - to derail moves to extend its dual-class voting structure until the mid-2030s. Skaala has argued that the move, which would entrench the power of his former business partner, Wise's chief executive Kristi Kaarmann, is undemocratic and has not been handled transparently. The dual-class voting extension is wrapped up in the wider vote on the US listing, while Mr Hinrikus has argued that the issues should be put to shareholders separately. Banking and investor sources said on Sunday that they expected Skaala to win \"very limited\" support given the short timeframe in which it had been trying to persuade other investors to oppose Wise's resolutions. An extraordinary general meeting will take place on Monday, with 75% of each of the A and B class shareholders by value and a simple majority of the number of shareholders who vote needed to carry the resolutions. Last week, Skaala accused Wise of \"misleading\" its own investors and warned that a move to extend its current governance arrangements could be derailed in the High Court, Sky News revealed on Thursday. \n                  US and EU agree trade deal - with bloc facing 15% tariffs on goods into America\n                 \n                  Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege \n                 \n                  Money blog: 'He made me eat cheaper brands than him and said I'd die in a car crash - but this is why I couldn't leave'\n                 Skaala said a Wise statement claiming support from three key independent advisory firms had been inaccurate, and queried why a correction had not been issued through formal stock market channels. Skaala, which owns just over 5% of the company, also accused Wise's chairman, David Wells, of making claims which were \"legally and commercially unfounded\". \"Skaala has put forward several practical, legally viable options for Wise to address shareholder concerns,\" it told Sky News on Thursday. \"These include proposing two alternative schemes of arrangement - both facilitating the US dual-listing, but offering shareholders the choice to approve it either with or without the 10-year extension of the dual-class voting rights. \"Wise has thus far rejected these proposals out of hand.\" Skaala also claimed there was \"a substantial risk the [High] Court will decline to sanction [the proposals] at the sanctions hearing in [the second quarter of 2026], given the procedural, fairness and transparency issues surrounding the scheme as presented\". \"In such a scenario, the dual listing would be materially delayed - possibly by months - and significant cost and risk would be introduced unnecessarily. \"This entirely avoidable situation is the direct result of the Company's insistence on securing enhanced voting rights for CEO Kristo Käärmann under the current proposal,\" Skaala said. Wise's existing dual-class structure was put in place in 2021, when the company floated in London with a pledge that it would revert to a single class of shares five years after its stock market debut. Shares in Wise, which has a market capitalisation of £10.5bn, have risen by more than 40% in the last year. Wise declined to comment."
    },
    {
        "title": "Sir Keir Starmer set for Donald Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza",
        "description": "Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-for-donald-trump-trade-talks-as-pm-walks-diplomatic-line-between-eu-allies-and-us-on-gaza-13402794",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-donad-trump_6975578.jpg?20250727214920",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-07-27 21:30:00",
        "Headline": "Despite some reports that Donald Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland later. Downing Street said the prime minister would discuss \"what more can be done to secure the ceasefire [in the Middle East] urgently\", during discussions at the president's Turnberry golf course in Ayrshire. Talks in Qatar over a ceasefire ended on Thursday after the US and Israel withdrew their negotiating teams.  Mr Trump blamed Hamas for the collapse of negotiations as he left the US for Scotland, saying the militant group \"didn't want to make a deal… they want to die\". Sir Keir has tried to forge close personal ties with the president - frequently praising his actions on the world stage despite clear foreign policy differences between the US and UK. The approach seemed to pay off in May when Mr Trump announced the agreement of a trade deal with the UK that would see several tariffs lowered. The two leaders are expected to discuss this agreement when they meet, with the prime minister likely to press the president for a lowering of outstanding tariffs on imports such as steel.  Prior to the visit, the White House said the talks would allow them to \"refine the historic US-UK trade deal\". That comes hot on the heels of the US reaching an agreement with the EU, which Mr Trump described as the \"biggest dal ever made\". This will see 15% tariffs imposed on most European goods entering America, despite the president previously threatening a 30% levy.  Extracting promises from the president on the Middle East may be harder though. Despite some reports that Mr Trump is growing frustrated with Israel, there is a clear difference in tone between the US and its Western allies. As he did over the Ukraine war, Sir Keir will have to walk a diplomatic line between the UK's European allies and the White House. On Thursday, French President Emmanuel Macron announced his country would formally recognise a Palestinian state in September, the first member of the G7 to do so. That move was dismissed by Mr Trump, who said it \"doesn't carry any weight\". Read more from Sky News:US and EU agree trade deal - with bloc facing 15% tariffsGeldof accuses Israel of 'lying' about Gaza starvation  The UK, French and German leaders spoke over the weekend and agreed to work together on the \"next phase\" in Gaza that would see transitional governance and security arrangements put in place, alongside the large-scale delivery of aid. Under pressure from members of his own party and cabinet to follow France and signal formal recognition of Palestine, Sir Keir has gradually become more critical of Israel in recent months. On Friday, the prime minister said \"the starvation and denial of humanitarian aid to the Palestinian people, the increasing violence from extremist settler groups, and Israel's disproportionate military escalation in Gaza are all indefensible\". Government sources say UK recognition is a matter of \"when, not if\" - but it's thought Downing Street wants to ensure any announcement is made at a time when it can have the greatest diplomatic impact.  Cabinet ministers will be convened in the coming days, during the summer recess, to discuss the situation in Gaza. The UK has also been working with Jordan to air drop supplies, after Israel said it would allow foreign countries to provide aid to the territory. Donald Trump's trip to Scotland comes ahead of his second state visit to the UK in September. Downing Street says Ukraine will also likely be discussed in the meeting with both men reflecting on what can be done to force Russia back to the negotiating table. After the meeting at Turnberry, the prime minister will travel with the president to Aberdeen for a private engagement. Mr Trump is also expected to meet Scottish First Minister John Swinney."
    },
    {
        "title": "Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege ",
        "description": "A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion.",
        "url": "https://news.sky.com/story/heathrow-funded-group-sending-incredibly-misleading-mail-to-homes-across-west-london-campaigners-allege-13390542",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emirates-airbus-a380_6806347.jpg?20250121132517",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-27 03:13:00",
        "Headline": "Back Heathrow is funded by the airport, and headed by a former minister and member of Labour's policy forum. But the funding is not disclosed on Back Heathrow's newsletter or website.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion. The group, called Back Heathrow, sent leaflets to people living near the airport, claiming expansion could be the route to a \"greener\" airport and suggesting it would mean only the \"cleanest and quietest aircraft\" fly there. It comes as the airport prepares to submit its planning application for a third runway ahead of the 31 July deadline, following the government's statement of support for the expansion. Back Heathrow calls itself a \"local campaign group of over 100,000 residents\" and does not mention the funding it receives from the airport in the newsletter. Its website also does not mention the current financial support and says it \"initially launched with funding from Heathrow Airport but we have since grown\". Back Heathrow also told Sky News it had \"always been open\" about the support it receives from the airport. At the bottom of every web page, the organisation says: \"Back Heathrow is a group of residents, businesses and community groups who have come together to defend the jobs that rely on Heathrow and to campaign for its secure future.\" Heathrow Airport said it had always been clear about funding Back Heathrow, but would not disclose how much it provides. Who's behind Back Heathrow? The group's executive director is former Labour minister Parmjit Dhanda, who was MP for Gloucester from 2001 to 2010 and sits on the National Policy Forum - the body responsible for developing Labour policy. Latest accounts for Back Heathrow show it had five employees, including its two directors, in the financial year ending 30 June 2024. The second director is John Braggins, a former campaign adviser to Tony Blair. The business had £243,961 in cash, the accounts show. What are the group saying? In the newsletter, executive director Mr Dhanda said people ask if Heathrow is sustainable. In answering the question, he appeared to suggest the airport can dictate what types of planes use Heathrow. \"We can build a cleaner, greener and smarter airport - using more sustainable aviation fuel, ensuring only the cleanest and quietest aircraft fly here, reduce stacking in our skies and modernise our airspace to cut emissions in flight,\" he wrote. When asked by Sky News what Back Heathrow meant and what the source for the claim was, the organisation pointed to the airport's traffic light system of noise and emission measurements for the 50 largest airlines serving Heathrow. \"The scheme helps to see what areas certain airlines are excelling in and where improvements can be made,\" a spokesperson said. But those \"cleaner and greener\" claims were dismissed as \"myths\" by one campaigner. Finlay Asher is an aerospace engineer and co-founder of Safe Landing, a group of aviation workers and enthusiasts seeking climate improvements in the industry. He said the emissions savings from sustainable aviation fuel (SAF) were \"highly debatable\" - but added that even if they were taken at face value, use of these fuels is \"relatively low\" and so only provides small emissions reductions. \"Air traffic growth at Heathrow will wipe this out,\" he said. Mr Asher also disputed the claim that only the cleanest and quietest aircraft will fly at Heathrow. \"There is no policy in place which prevents older generation aircraft from being operated out of any airport,\" he said. As for reducing \"stacking\" - where aircraft wait over an airport to land - Mr Asher said if that's the goal, \"adding more aircraft to the sky won't make this easier\".   Opposition to Back Heathrow's claims also came from Rob Barnstone, founding member of the No Third Runway Coalition, which is funded by five local authorities surrounding Heathrow Airport. He said that regardless of fuel efficiencies or new quieter engines, having the additional 260,000 flights Heathrow has said will be created with an extra runway - in addition to the airport's current cap of 480,000 - would create \"an awful lot of noise\". \"For all the best will in the world, Heathrow is a very, very, very noisy neighbour... When you're adding a quarter of a million additional flights, that's going to create an awful lot of emissions, even if they're using planes that are ever so slightly less environmentally damaging than previous planes,\" Mr Barnstone said. Green claims Under the heading of \"UK sustainable fuel industry for Heathrow\", Back Heathrow said \"advances in electric and hydrogen powered aircraft can ensure we meet our environmental targets\". Elaborating on this, Back Heathrow told Sky News: \"Zero-emission electric and hydrogen aircraft are very much the end goal for civil aviation and countries like Norway have set 2040 as the year that all of their short-haul flights will be by electric planes.\" The statement was called \"incredibly misleading\" by Dr Alex Chapman, senior economist at the left-leaning think tank New Economics Foundation (NEF). \"There's just absolutely no confidence that those aircraft are going to have any meaningful impact on emissions and commercial aviation in any reasonable time frame. And, yeah, we can all speculate as to what may not happen in 50 years' time. But I think the people living around the airport should be given the information about what's actually realistic.\" Even if the technology were available, the runway may not be ready for it, Dr Chapman said. \"Perhaps more importantly, there's been no indication so far that the proposed new runway is being built to cater for those types of aircraft, because a runway that caters to electrical, hydrogen powered aircraft would be very different to one that was for conventional fuel, particularly in terms of the fuelling infrastructure around it that would be required: pipes to pipe hydrogen, massive charging power facilities.\"  While work is under way to develop electric aircraft, there are currently no commercial electric flights taking place. The best-case scenario is battery-powered flights that may be suitable for short journeys. But as a major international airport, more than 40% of Heathrow's flights are long-haul and medium-haul. And while airlines such as easyJet have called for government funding to develop hydrogen flying suitable for short-haul flights, there are obstacles to making regular commercial flights a reality. Providing enough hydrogen for the plane journeys from renewable sources will be challenging, as will transporting the fuel, and reworking airport infrastructure for hydrogen refuelling. Plans for hydrogen aircraft are at least a decade away, with Airbus saying it wants to get a 100-seat hydrogen plane in the air by 2035 - although Back Heathrow's estimates for a third runway have flights taking off in 2034. For now, rising emissions from flying are risking the UK's climate targets, according to the independent government advisers of the Climate Change Committee, who found flights contribute more greenhouse gas than the entire electricity supply sector. Expanding at 'full capacity' On the first page of the newsletter, Back Heathrow says \"Heathrow is at full capacity\", but the company told Sky News the airport has been \"operating at 98% capacity since 2005\". Despite its 98% capacity, Heathrow Airport has broken passenger number records every year for the past 14 years - excluding the pandemic years of 2020 to 2023. Dr Chapman said Heathrow is at capacity regarding the government-imposed flight cap, not at the capacity of the current runway infrastructure. \"So if the government were, for example, to lift that cap on the number of aircraft movements, it's pretty likely that they could actually fly 10% to 20% more flights out of the existing infrastructure,\" he said. As aeroplanes have expanded to carry more passengers, the airport has welcomed more people, he added. The airport earlier this month announced plans to increase its capacity by 10 million passengers a year, before a third runway is built, and to raise the charge paid by passengers to fund the investment. Read more:New internet rules come into force - here's what is changingGood economic news as sunny weather boosted retail sales How have the group and the airport responded? A Heathrow spokesperson said: \"Back Heathrow represents tens of thousands of local people who want to make their views known on the importance of Heathrow to their communities and livelihoods today and into the future. \"We have always been clear that, alongside individual residents, local business groups and trade unions, we provide funding for Back Heathrow to provide a voice for local people who historically have not been heard in the debate about expanding Heathrow.\" Speaking for the campaign group, Mr Dhanda said: \"At Back Heathrow we are proud of our link to Heathrow Airport (the clue is in the name). \"We have always been open about the fact that we receive support from the airport and that they helped set the organisation up to balance the debate about expansion at a time when the voices of ordinary working people from the diverse communities around Heathrow were not being heard.\" \"Back Heathrow also receives support from trade unions, local businesses and residents from amongst the 100,000 registered supporters it now has,\" he added. \"We want an end to the dither and delay. Back Heathrow supporters want to see economic growth and the thousands of new jobs and apprenticeships a new runway will create.\" "
    },
    {
        "title": "Govt vows to protect 'pavement pints' and make it easier for pubs to extend their opening hours ",
        "description": "\"A wave of new cafes, bars, music venues and outdoor dining\" could come to the UK - as the government unveils plans to overhaul planning rules and \"breathe new life into the high street\".",
        "url": "https://news.sky.com/story/govt-vows-to-protect-pavement-pints-and-make-it-easier-for-pubs-to-extend-their-opening-hours-13402388",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-southbank-london-pub_5399801.jpg?20250727042839",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-27 02:21:00",
        "Headline": "The government claims its proposals will \"put the buzz back into our town centres\" but the hospitality industry warns it needs urgent tax reform to \"offset the immediate and mounting cost pressures\" which are putting firms out of business.",
        "Content": "\"A wave of new cafes, bars, music venues and outdoor dining\" could come to the UK - as the government unveils plans to overhaul planning rules and \"breathe new life into the high street\". Under the proposals, ministers also want to reform licensing rules to make it easier for disused shops to be converted into hospitality venues. In a statement, Chancellor Rachel Reeves said she planned to scrap \"clunky, outdated rules... to protect pavement pints, al fresco dining and street parties\". The reforms also aim to prevent existing pubs, clubs, and music venues from suffering noise complaints when new properties hit the market. Developers who decide to build near those sites will be required to soundproof their buildings. As part of dedicated \"hospitality zones\", permission for al fresco dining, street parties and extended opening hours will be fast-tracked. The government says the reforms aim to modernise outdated planning and licensing rules as part of its Plan for Change, to help small businesses and improve local communities. \n                  Owner of Cote restaurant chain cooks up sale plan\n                 \n                  A pub a day to close this year, industry body warns as it calls for cut to tax burden\n                 \n                  'We will see closures': The industries hit hardest by national insurance hike\n                 The rough plans will be subject to a \"call for evidence\" which could further shape policy. Business Secretary Jonathan Reynolds said the proposals will \"put the buzz back into our town centres\". \"Red tape has stood in the way of people's business ideas for too long. Today we're slashing those barriers to giving small business owners the freedom to flourish,\" he said. The hospitality industry has broadly welcomed the changes but argued tax reform was also essential. Kate Nicholls, chairwoman of UKHospitality, described the proposals as \"positive and encouraging\". However, she added: \"They can't on their own offset the immediate and mounting cost pressures facing hospitality businesses which threaten to tax out of existence the businesses and jobs that today's announcement seeks to support.\" Read more from Sky News:Licensing reforms for London venuesPubs forced to adapt to survive While supporting the reforms, Emma McClarkin, chief executive of the British Beer and Pub Association (BBPA), had a similar message. \"These changes must go hand in hand with meaningful business rates reform, mitigating staggering employment costs, and a cut in beer duty so that pubs can thrive at the heart of the community,\" she said. In July, BBPA estimated that 378 pubs will shut this year across England, Wales and Scotland, compared with 350 closures in 2024, which it said would amount to more than 5,600 direct job losses.  Bar chain Brewdog announced this week that it would close 10 sites, partly blaming \"rising costs, increased regulation, and economic pressures\". Andrew Griffith MP, shadow business secretary, said: \"Though any cutting of red tape for hospitality businesses is welcome, this is pure hypocrisy and inconsistency from Labour.\" He said the government was \"crippling the hospitality industry by doubling business rates, imposing a jobs tax and a full-on strangulation of employment red tape\"."
    },
    {
        "title": "Conservatives vow to ban doctor strikes - as Kemi Badenoch hits out at 'militant' union",
        "description": "The Conservatives would ban strikes for doctors, Kemi Badenoch has said.",
        "url": "https://news.sky.com/story/conservatives-vow-to-ban-doctor-strikes-as-kemi-badenoch-hits-out-at-militant-union-13402480",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-junior-doctors-doctors_6960821.jpg?20250727124453",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-27 13:49:00",
        "Headline": "The Tory leader says she will treat doctors the same as the army and police, who are banned from taking industrial action.",
        "Content": " The Conservatives would ban strikes for doctors, Kemi Badenoch has said. The Tory leader said she would treat doctors the same as the army and police in order to bring the walkouts to an end. Politics latest: UK 'committed' to recognising Palestine as a state - but govt won't say when Under UK law, police officers, members of the armed forces and some prison officers are banned from striking. Resident doctors - previously known as junior doctors - began their five-day strike across England on Friday as part of an escalating row between NHS bosses and the British Medical Association (BMA) over pay. Last July, they were awarded a raise of 22% over two years, the highest public sector award in recent years. But the BMA has argued that pay has declined significantly since 2008 when adjusting for inflation and is calling for a pay rise of 29.2% to reverse \"pay erosion\". The latest deal saw doctors given a 4% increase, plus £750 \"on a consolidated basis\" - which comes to an average rise of 5.4%. Speaking to reporters, MS Badenoch said it was now Tory policy to ban strikes for resident doctors, arguing the BMA had become \"too militant\". \"We have seen 11 strikes in the last sort of 18 months, two years,\" she said. \"People are dying and it's costing the NHS billions. We need to bring these strikes to an end.\" She said she would also introduce minimum service levels for strikes - something that was brought in under Liz Truss's short tenure as prime minister before being repealed by the current government. The Conservatives argue their proposals would bring the UK in line with other nations across the world, including Australia and Canada, where restrictions on doctors striking are tighter. Read more:Everything you need to know about the doctors' strikeGovt vows to protect 'pavement pints' Meanwhile, Greece, Italy and Portugal have laws ensuring minimum service levels are in place across their health services. Speaking to Sunday Morning with Trevor Phillips, Dr Tom Dolphin, the chair of the BMA, said doctors \"don't want to be on strike\" but felt they had no choice. \"The reason that we are worried about the NHS and we're worried about the workforce in the NHS, is because doctors are being undervalued,\" he said. \"They're leaving the NHS in large numbers, and what we're trying to do is make sure that the offer that's there from the NHS, the pay, the total reward package, is enough to recruit and retain the best doctors that the patients deserve in the NHS.\" A Department of Health spokesperson said: \"We know that previous rounds of strikes caused much wider levels of harm and so this government is doing things differently. \"Working with NHS leaders, we've put in measures to keep as much urgent and planned care available and safe as we possibly can. \"During these strikes, all other NHS staff (including consultants and other specialist doctors) will still be working, and the focus of the NHS will be on ensuring as many services as possible continue to operate safely.\""
    },
    {
        "title": "Heathrow-funded group sending 'incredibly misleading' mail to homes across west London, campaigners allege ",
        "description": "A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion.",
        "url": "https://news.sky.com/story/heathrow-funded-group-sending-incredibly-misleading-mail-to-homes-across-west-london-campaigners-allege-13390542",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emirates-airbus-a380_6806347.jpg?20250121132517",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-27 03:13:00",
        "Headline": "Back Heathrow is funded by the airport, and headed by a former minister and member of Labour's policy forum. But the funding is not disclosed on Back Heathrow's newsletter or website.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  A campaign group for a third runway at Heathrow that gets funding from the airport has been distributing \"incredibly misleading\" information to households in west London, according to opponents of the expansion. The group, called Back Heathrow, sent leaflets to people living near the airport, claiming expansion could be the route to a \"greener\" airport and suggesting it would mean only the \"cleanest and quietest aircraft\" fly there. It comes as the airport prepares to submit its planning application for a third runway ahead of the 31 July deadline, following the government's statement of support for the expansion. Back Heathrow calls itself a \"local campaign group of over 100,000 residents\" and does not mention the funding it receives from the airport in the newsletter. Its website also does not mention the current financial support and says it \"initially launched with funding from Heathrow Airport but we have since grown\". Back Heathrow also told Sky News it had \"always been open\" about the support it receives from the airport. At the bottom of every web page, the organisation says: \"Back Heathrow is a group of residents, businesses and community groups who have come together to defend the jobs that rely on Heathrow and to campaign for its secure future.\" Heathrow Airport said it had always been clear about funding Back Heathrow, but would not disclose how much it provides. Who's behind Back Heathrow? The group's executive director is former Labour minister Parmjit Dhanda, who was MP for Gloucester from 2001 to 2010 and sits on the National Policy Forum - the body responsible for developing Labour policy. Latest accounts for Back Heathrow show it had five employees, including its two directors, in the financial year ending 30 June 2024. The second director is John Braggins, a former campaign adviser to Tony Blair. The business had £243,961 in cash, the accounts show. What are the group saying? In the newsletter, executive director Mr Dhanda said people ask if Heathrow is sustainable. In answering the question, he appeared to suggest the airport can dictate what types of planes use Heathrow. \"We can build a cleaner, greener and smarter airport - using more sustainable aviation fuel, ensuring only the cleanest and quietest aircraft fly here, reduce stacking in our skies and modernise our airspace to cut emissions in flight,\" he wrote. When asked by Sky News what Back Heathrow meant and what the source for the claim was, the organisation pointed to the airport's traffic light system of noise and emission measurements for the 50 largest airlines serving Heathrow. \"The scheme helps to see what areas certain airlines are excelling in and where improvements can be made,\" a spokesperson said. But those \"cleaner and greener\" claims were dismissed as \"myths\" by one campaigner. Finlay Asher is an aerospace engineer and co-founder of Safe Landing, a group of aviation workers and enthusiasts seeking climate improvements in the industry. He said the emissions savings from sustainable aviation fuel (SAF) were \"highly debatable\" - but added that even if they were taken at face value, use of these fuels is \"relatively low\" and so only provides small emissions reductions. \"Air traffic growth at Heathrow will wipe this out,\" he said. Mr Asher also disputed the claim that only the cleanest and quietest aircraft will fly at Heathrow. \"There is no policy in place which prevents older generation aircraft from being operated out of any airport,\" he said. As for reducing \"stacking\" - where aircraft wait over an airport to land - Mr Asher said if that's the goal, \"adding more aircraft to the sky won't make this easier\".   Opposition to Back Heathrow's claims also came from Rob Barnstone, founding member of the No Third Runway Coalition, which is funded by five local authorities surrounding Heathrow Airport. He said that regardless of fuel efficiencies or new quieter engines, having the additional 260,000 flights Heathrow has said will be created with an extra runway - in addition to the airport's current cap of 480,000 - would create \"an awful lot of noise\". \"For all the best will in the world, Heathrow is a very, very, very noisy neighbour... When you're adding a quarter of a million additional flights, that's going to create an awful lot of emissions, even if they're using planes that are ever so slightly less environmentally damaging than previous planes,\" Mr Barnstone said. Green claims Under the heading of \"UK sustainable fuel industry for Heathrow\", Back Heathrow said \"advances in electric and hydrogen powered aircraft can ensure we meet our environmental targets\". Elaborating on this, Back Heathrow told Sky News: \"Zero-emission electric and hydrogen aircraft are very much the end goal for civil aviation and countries like Norway have set 2040 as the year that all of their short-haul flights will be by electric planes.\" The statement was called \"incredibly misleading\" by Dr Alex Chapman, senior economist at the left-leaning think tank New Economics Foundation (NEF). \"There's just absolutely no confidence that those aircraft are going to have any meaningful impact on emissions and commercial aviation in any reasonable time frame. And, yeah, we can all speculate as to what may not happen in 50 years' time. But I think the people living around the airport should be given the information about what's actually realistic.\" Even if the technology were available, the runway may not be ready for it, Dr Chapman said. \"Perhaps more importantly, there's been no indication so far that the proposed new runway is being built to cater for those types of aircraft, because a runway that caters to electrical, hydrogen powered aircraft would be very different to one that was for conventional fuel, particularly in terms of the fuelling infrastructure around it that would be required: pipes to pipe hydrogen, massive charging power facilities.\"  While work is under way to develop electric aircraft, there are currently no commercial electric flights taking place. The best-case scenario is battery-powered flights that may be suitable for short journeys. But as a major international airport, more than 40% of Heathrow's flights are long-haul and medium-haul. And while airlines such as easyJet have called for government funding to develop hydrogen flying suitable for short-haul flights, there are obstacles to making regular commercial flights a reality. Providing enough hydrogen for the plane journeys from renewable sources will be challenging, as will transporting the fuel, and reworking airport infrastructure for hydrogen refuelling. Plans for hydrogen aircraft are at least a decade away, with Airbus saying it wants to get a 100-seat hydrogen plane in the air by 2035 - although Back Heathrow's estimates for a third runway have flights taking off in 2034. For now, rising emissions from flying are risking the UK's climate targets, according to the independent government advisers of the Climate Change Committee, who found flights contribute more greenhouse gas than the entire electricity supply sector. Expanding at 'full capacity' On the first page of the newsletter, Back Heathrow says \"Heathrow is at full capacity\", but the company told Sky News the airport has been \"operating at 98% capacity since 2005\". Despite its 98% capacity, Heathrow Airport has broken passenger number records every year for the past 14 years - excluding the pandemic years of 2020 to 2023. Dr Chapman said Heathrow is at capacity regarding the government-imposed flight cap, not at the capacity of the current runway infrastructure. \"So if the government were, for example, to lift that cap on the number of aircraft movements, it's pretty likely that they could actually fly 10% to 20% more flights out of the existing infrastructure,\" he said. As aeroplanes have expanded to carry more passengers, the airport has welcomed more people, he added. The airport earlier this month announced plans to increase its capacity by 10 million passengers a year, before a third runway is built, and to raise the charge paid by passengers to fund the investment. Read more:New internet rules come into force - here's what is changingGood economic news as sunny weather boosted retail sales How have the group and the airport responded? A Heathrow spokesperson said: \"Back Heathrow represents tens of thousands of local people who want to make their views known on the importance of Heathrow to their communities and livelihoods today and into the future. \"We have always been clear that, alongside individual residents, local business groups and trade unions, we provide funding for Back Heathrow to provide a voice for local people who historically have not been heard in the debate about expanding Heathrow.\" Speaking for the campaign group, Mr Dhanda said: \"At Back Heathrow we are proud of our link to Heathrow Airport (the clue is in the name). \"We have always been open about the fact that we receive support from the airport and that they helped set the organisation up to balance the debate about expansion at a time when the voices of ordinary working people from the diverse communities around Heathrow were not being heard.\" \"Back Heathrow also receives support from trade unions, local businesses and residents from amongst the 100,000 registered supporters it now has,\" he added. \"We want an end to the dither and delay. Back Heathrow supporters want to see economic growth and the thousands of new jobs and apprenticeships a new runway will create.\" "
    },
    {
        "title": "Bishop in dressing gown interrupts church concert - and asks crowd to 'leave my house'",
        "description": "A disgruntled bishop in a dressing gown has interrupted a church concert in London - telling singers to stop their \"terrible racket\" and \"leave his house\".",
        "url": "https://news.sky.com/story/this-is-a-terrible-racket-bishop-in-dressing-gown-interrupts-church-concert-and-asks-crowd-to-leave-my-house-13402383",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bishop-church_6974905.jpg?20250727014901",
        "type": "Strange",
        "Author": "Connor Sephton",
        "Date Published": "2025-07-27 00:29:00",
        "Headline": "\"This work deserves respect, not to be disparaged as a terrible racket,\" an audience member told Sky News. \"They put their heart and soul into it.\"",
        "Content": "\n          News reporter\n              @ConnorSephton\n  A disgruntled bishop in a dressing gown has interrupted a church concert in London - telling singers to stop their \"terrible racket\" and \"leave his house\". The City Academy Voices choir was coming to the end of their performance at St Andrew's in Holborn on Friday night when the lights were suddenly turned off. Footage on TikTok shows Jonathan Baker, the bishop of Fulham, standing barefoot at a microphone - as bemused performers and a 300-strong audience look on. \"You are in my house. It's gone past 10pm and this is a terrible racket,\" he said. \"Goodnight. You are in my house - can you leave it now please. Thank you, it's over.\" A church employee then asked the crowd to leave quietly and for the musicians to step down from the stage, attracting boos from the audience. The choir went on to perform one last song, an A cappella version of ABBA's Dancing Queen, before bringing their show to a close. Benedict Collins, who was attending the concert with his 10-year-old daughter, told Sky News he initially thought the interruption was a staged joke. \n                  Police offer £20k reward one year after fatal stabbing of 20-year-old in Newham\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Two teenagers sentenced to at least 15 years for machete murder of boy, 14, on London bus\n                 \"The church willingly rents out the premises for performances, for money,\" he said. \"They can hardly be surprised if they take bookings for concerts and there is music in the hall.\" Mr Collins said the talented choir had \"worked like mad\" on the performance - and criticised the bishop's remarks. \"This work deserves respect, not to be disparaged as a 'terrible racket',\" he added. \"The people here had put their heart and soul into it. The bishop cut them off in midstream, preventing soloists who had worked their hardest from singing - and preventing the audience, which included people of all ages, from enjoying it to the end.\" Read more UK news:Botox-like injections spark botulism outbreakAge verification tools on adult sites bypassed A spokesperson for the Diocese of London had told The Guardian: \"Bishop Jonathan reached out to the organisers on Saturday to apologise for his late-night appearance at the concert, which he now understands had overrun due to technical difficulties.\" But Mr Collins told Sky News that he felt this statement was \"mealy mouthed\". He added: \"I hope the bishop is well and okay. It's possible he just had a bad day. An unambiguous apology would help, one that recognises why his behaviour wasn't acceptable.\""
    }
]