[
    {
        "title": "The five considerable problems with the chancellor's U-turn on winter fuel payments",
        "description": "There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all?",
        "url": "https://news.sky.com/story/the-five-key-issues-from-chancellors-winter-fuel-payment-u-turn-13381413",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves_6937820.jpg?20250609221257",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-06-09 20:43:00",
        "Headline": "Chancellor Rachel Reeves U-turned on her decision to remove winter fuel payments from most pensioners.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all? First, Rachel Reeves has executed the plan without working out how to pay for it. This, for an iron chancellor, is a wound that opponents won't let her forget. A summer of speculation about tax rises is not a summer anyone looks forward to. Politics latest: Treasury minister challenged over reason for U-turn Second, the fig leaf that she and Treasury ministers are using is an improvement in economic conditions. If you were being polite, you'd say this is contested. The OBR halved growth this year and the OECD downgraded UK forecasts, albeit only by a little, last week. \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Can you trust Rachel Reeves' spending review numbers?\n                 The claim that interest rates are coming down ignores that their descent is slower because of government decisions of the last six months. Third, the question immediately becomes, what next? Why not personal independent payments (PIP) and the two-child benefit cap? At this stage, it would feel like a climbdown if they did not back down over those. But then, what will the markets - already policing this closely - make of it, and could they punish the government? Fourth, this is aggravating divisions in the Parliamentary Labour Party: the soft left Compass group and ministers like Torsten Bell pushing bigger spending arguments. Those MPs in Tory-facing seats who rely on arguments that Labour can be trusted with the public finances are worried. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Fifth, this has created a firm division between No 10 (the PM) and No 11 (the Chancellor). No 10 is now conscious that it does not have enough independent advice about the market reaction to economic policies and is seeking to correct. Others, I am told, are just critical of the chancellor's U-turn - for she wobbled first. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? Given the litany of arguments against, why has it happened? Because the hope is this maxi U-turn lances the boil, removes a significant source of pensioners' anger and brings back Labour voters, a price they calculate worth paying, whatever the fiscal cost. We wait to see who is right."
    },
    {
        "title": "Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn",
        "description": "The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses.",
        "url": "https://news.sky.com/story/spending-review-2025-cutting-agricultural-budget-could-be-catastrophic-for-nature-farmers-and-charities-warn-13381297",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-farm-inheritance-tax_6759056.jpg?20241127091742",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-09 15:43:00",
        "Headline": "The groups fear the government will cut the agricultural budget at Rachel Reeves' spending review on Wednesday.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses. In a letter to food security and rural affairs minister Daniel Zeichner, exclusively seen by Sky News, a dozen of the biggest rural industry organisations say they are \"deeply concerned\" about rumoured cuts that will be made to the agricultural budget in Wednesday's spending review. Chancellor Rachel Reeves will set out budgets for each government department for the rest of this parliament, set to end in 2029. The letter says cutting funding for existing and new environmental farming schemes will be \"catastrophic\" to the government's aims for the environment. \"Many of the environmental features present in the countryside and enjoyed by the public will be under threat and will disappear,\" the letter says. \"This would be a poor legacy for this government.\" Sir Keir Starmer's government has made getting to net zero by 2050 a key goal, already initiating several policies to restrict carbon emissions and make the UK greener since winning the election last July. \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 However, the government shocked farmers in March when it shut down applications for the Sustainable Farming Incentive (SFI), which rewards farmers for managing their land in environmentally sustainable ways, with just a few hours' notice as they said a cap had been reached for the year. The rural organisations say the Environmental Land Management (ELM) scheme payments are \"critical to the government's statutory targets on environmental improvement\", including the main goal of halting the decline of biodiversity. Read more:Prince William meets Clarkson's Farm star to discuss industry challengesLabour MP goes public to oppose family farms tax  The letter states farmers and landowners are fully committed to environmental schemes, with 77,000 live agri-environment scheme agreements, according to the latest government figures, \"with millions of hectares under environmental land management\". \"So much good has been done by these agreements, the oldest of which has run for decades,\" the letter says. \"The unprecedented engagement in the Sustainable Farming Incentive (SFI) is testament to the appetite of farmers and land managers to rise to the challenge and do more.\" The letter finishes with: \"The industry would like to have your assurances that this critical work will continue to be funded at the same level.\" David Wilson, a farmer for 53 years, told Sky News it took many years for farmers to get on board with the environmental schemes but they are now joined up, and reducing funding could damage years of work and be a backwards step for not just the UK's environment, but the world's. \"This is ultimately about sustainability. To produce good food, you need good ecology and reducing this funding could damage the UK's ecology and our food security,\" he added. A return to intensive farming Alex Robinson, 39, a farmer from Gloucestershire with 424 hectares, said the schemes have been \"a lifeline for nature\", with birds, bees and wildflowers returning - including 14 red-listed bird species, many that had not been seen in decades. His farm's soil health is improving, which means he can grow more resilient nutrient dense crops for people to eat. If funding is cut he said he \"may have no choice but to return to intensive farming methods sooner than the soils are ready for\", with wildflowers and field margins becoming \"difficult to justify\", which will put the UK's climate, biodiversity and long-term food security \"in real danger\". Government will be abandoning nature Signatory Victoria Vyvyan, farmer and president of the Country Land and Business Association (CLA), said: \"If sustainable farming contracts are cut, government won't just abandon nature - it will abandon its own environmental and legal commitments. \"The Sustainable Farming Incentive is working - for farmers, for nature, for the public, and for the Treasury. It's bringing back wildlife, cleaning up rivers, and restoring the health of our soil. \"Take away the funding for nature contracts, and farmers will be pushed back to intensive methods - forced to undo years of progress. Nature will suffer as well as farmers, and on the environment, it will go against everything government claims to agree with.\" The letter has been signed by the heads of The National Trust, the National Farmers' Union (NFU), the RSPB, the Soil Association, the CLA, the Tenant Farmers Association, the Game and Wildlife Conservation Trust, the Nature Friendly Farming Network, the Central Association of Agricultural Valuers, the National Federation of Young Farmers' Clubs, the British Institute of Agricultural Consultants and the Agricultural Industries Confederation. A government spokesman said they \"do not comment on budget speculation\"."
    },
    {
        "title": "Jess and Norma: Grandmother who had millions of fans on TikTok dies aged 91",
        "description": "A grandmother who found fame on TikTok for posting funny videos with her granddaughter has died aged 91. ",
        "url": "https://news.sky.com/story/jess-and-norma-grandmother-who-had-millions-of-fans-on-tiktok-dies-aged-91-13381434",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jessnorma-tiktok_6937859.jpg?20250610001753",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-09 22:54:00",
        "Headline": "Norma and her granddaughter Jess, 32, have 2.7 million followers on TikTok after charming their audience with heart-warming glimpses into their daily lives.",
        "Content": "A grandmother who found fame on TikTok for posting funny videos with her granddaughter has died aged 91.  Norma died on 5 June, her family announced on social media on Monday. Her endearing and comedic videos with 32-year-old Jess went viral, with the duo attracting 2.7 million followers on TikTok. In one viral clip, which was viewed by more than 28 million people, Norma says \"we're related\" in a series of funny voices - mimicking a cow and a vampire - with both collapsing into fits of giggles. Another, viewed more than 15 million times, involves Jess playing a prank on her grandmother. In the video, Jess says she has the opportunity to win £10,000 - and all she has to do is say on video why she should win it. Jess proceeds to tell viewers a made-up tale about their family life, with Norma doubling over in laughter over the stories she came up with. Norma's family said they had lost \"our rock\" as they told followers about her death. \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 \n                  TikTok influencer shot dead during livestream in Mexico\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 \"We are all truly devastated and our lives will never be the same,\" the family said. \"We want you all to know that Nan fell to sleep peacefully, surrounded by all her family, she was full of love and had the most beautiful care.\" The family said the community Norma and Jess created online made the nonagenarian's \"last years so incredibly special\". \"Her cup was full and in her own words she 'lived such a wonderful life',\" they added. Norma was beloved among celebrities and fans, nearly 100,000 of whom took shared their condolences on TikTok."
    },
    {
        "title": "Rhianan Rudd: How mother's boyfriend played 'significant' role in radicalising youngest UK girl to face terror charges",
        "description": "Rhianan Rudd, who took her own life at the age of 16, was the youngest girl in the UK to be charged with terrorist offences.&#160;",
        "url": "https://news.sky.com/story/rhianan-rudd-how-mothers-boyfriend-played-significant-role-in-radicalising-youngest-uk-girl-to-face-terror-charges-13381372",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rhianan-rudd-inquest_6841721.jpg?20250227195316",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-09 18:05:00",
        "Headline": "Rhianan Rudd, who was investigated by counter terror police and MI5, took her own life five months after terror charges against her were dropped.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Rhianan Rudd, who took her own life at the age of 16, was the youngest girl in the UK to be charged with terrorist offences.  The inquest into her death, which concluded today, revealed shocking details about her radicalisation by two American white supremacists, one of whom was her mother's boyfriend, who the coroner said \"played a material role in her radicalisation\". Rhianan gouged a swastika into her forehead, downloaded a bomb-making manual and told her mother she planned to blow up a synagogue. Investigated by anti-terrorism police and MI5, charges against her were later dropped, but five month later on 19 May 2022, she was found dead in her shower in a children's home in Nottinghamshire. Hours earlier she had posted on Instagram: \"I'm delving into madness.\" The evidence heard in Chesterfield Coroner's Court from police, social services and even an MI5 operative, raised questions over the state's part in her death - and whether, despite her obvious radicalisation, this vulnerable, autistic girl should have been treated with more care by the authorities. Judge Alexia Durran said: \"I'm not satisfied, on the balance of probabilities, Rhianan intended to take her own life. Rhianan's death... was the result of a self-inflicted act but it is not possible to ascertain her intention. \"Rhianan was known, to family and professionals, to be vulnerable, to have autistic traits and have a history of self-harm.\" \n                  The Wargame podcast: What if Russia attacked the UK?\n                 \n                  The Wargame: Behind the scenes of new podcast series that simulates Russian attack on UK\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 The coroner added: \"I find she was highly affected by her arrest and was concerned about being sent to prison.\" It was not known what Rhianan was told by her legal team when the charges were dropped but this may have had a \"psychological impact\" on her, the coroner said. In an interview released at the verdict, Rhianan's mother Emily Carter said her daughter \"should never have been charged\", that she was failed by those investigating her, including MI5 and counter terrorism police, as well as being let down by mental health services and those caring for her at the home. This was the most complex of cases, set at a time when our security services are seeing a growing number of children being arrested and charged for terrorist offences, while parents often seem oblivious to the radicalising material they are consuming online in their bedrooms. Ms Durham's ruling reflected this complexity, finding that while there were some failings the actions of the police and MI5 were \"reasonable and proportionate\". The coroner concluded today that she was satisfied that missed opportunities in her case were \"not systemic\". Judge Alexia Durran said: \"In the circumstances I do not consider I should make a prevention of future deaths report.\" At the same she was unequivocal about the \"significant\" role played by two extremists in radicalising her. It was her mother's former boyfriend, an American she'd befriended though a US pen-pal prison scheme, who first introduced Rhianan to far-right ideology. Dax Mallaburn had been part of a white supremacist prison gang in the US and subsequently came to the UK to live with Rhianan's mother in September 2017, a year after she'd been to visit him in the US. In the autumn of 2019, Rhianan alleged that he had touched her inappropriately but later withdrew the allegation and, after a social services assessment, Mr Mallaburn returned to the family home. Ms Carter says: \"In hindsight, he was a bad person but I never saw him talking Nazi stuff with her.\" Before Rhianan was arrested, Mr Mallaburn's relationship with her mother had broken down and he returned to the US and then Mexico. However, during COVID, Rhianan appeared to contact another far-right extremist, Christopher Cook, and began an online relationship with him. Cook, who was roughly 18 and living in Ohio, shared far-right texts with Rhianan along with a bomb-making manual, and during this time she became fixated with Adolf Hitler. Cook's lawyer, Peter Scranton, says he too was radicalised online, and he came up with a plan to blow up power stations in the US, for which he was eventually arrested in August 2020, and in February 2022 he pleaded guilty to terrorism offences. Cook, who was a misfit at school, suffering from \"severe depression\" according to his lawyer and was \"essentially lashing out\" as he tried to form a group to carry out his plan. Mr Scranton told Sky News, \"It was white nationalism, and they had this idea, and I don't know why anyone would feel this way or how they thought it would work, that if they tore down the government and started over they could create a new United States of America that could look like the image that they would want - a white nationalist image.\" Read more from Sky News:Plastic surgeon tried to murder former bossDowntown LA a scene of 'pandemonium'Day Of The Jackal author deadMr Scranton says Cook told him he didn't radicalise Rhianan, and it was the former boyfriend, Dax Mallaburn, who'd initially got her into neo-Nazi ideology. However, the coroner found Cook was \"a significant radicaliser of Rhianan\" at a time when she was \"isolated and unsupervised\". Ms Carter says Rhianan was interested in German history because she was doing it at school and Cook was able to \"pull her in\", to racial hatred and antisemitism. She says she didn't know what was happening, despite having parental controls on Rhianan's devices. She said: \"I could hear her talking to people on there and I'd say who are you talking to and she'd say - just someone from school - and in fact I found out it wasn't at all. \"When this person she was talking to disappeared, that's when she sat down on my lap like a baby and cried. She told me this guy Chris had left her, and she was totally in love with him - then she came down and told me she had downloaded a bomb manual and I was like 'Oh my god, what have you been doing'.\" Ms Carter decided to contact Prevent - a national program in the UK designed to stop individuals from becoming terrorists or supporting terrorism She says: \"I thought putting her in a deradicalisation programme would be a fairly easy undo 'brain pick', But it wasn't until the police turned up that I thought 'hang on a minute this is a lot deeper than I actually thought it was at first'.\"Ms Carter and her lawyers have argued that the police were heavy-handed, that there should have been a psychological assessment before she was even questioned over terrorism offences. \"There were 19 police officers to arrest a 5ft 1, 14-year-old girl who weighs seven stone. It was over the top,\" says Ms Carter. Once Rhianan was charged, the deradicalisation work under Prevent was put on hold. Ms Carter thinks this was a mistake. She says: \"Leaving her with her own thoughts throughout the entire time of going through the police interviews and everything else - the deradicalisation would have changed the way she was seeing things - I believe she would have been able to handle it all so much better.\" The coroner described the police arrest and interview as \"necessary and conducted appropriately\" and that, while ceasing the Prevent intervention was an \"unfortunate consequence\" of the police investigation, it was \"an appropriate step\". During police interviews, Rhianan described being coerced and groomed, including sexually, and having sent explicit images of herself to Cook. Lawyers representing the family say police and MI5 knew she was the victim of child sexual exploitation but failed to refer her to the relevant body - the National Referral Mechanism. It was only after a social worker made the referral, that she was identified as a child victim and then the charges were dropped, by which time she had been subject to investigation and prosecution for 15 months. The coroner agreed that there was a \"systems failure\" due to a lack of training both within the police and the Derbyshire council who both had had \"significant information\" that she was a potential victim of modern slavery. However, she also said it \"was impossible to know\" whether this would have led to the CPS dropping their charges sooner, \"nor that if had more than minimal impact on Rhianan's death\". Ms Carter says if she'd been treated differently \"she'd be troubled, but I do think she'd still be alive\". Rhianan's family say the security services knew her vulnerabilities and that she had a tendency to self-harm, but they failed to take this into account. Ms Carter said: \"I admit my mistakes and I want the organisations to admit their mistakes. There were failings and they need to admit them.\" This ruling however found that the state did not play a role in Rhianan's death under article 2 of the European Convention on Human Rights. For the most part, her vulnerabilities were known and taken into consideration. It does however show how extremists will exploit children with mental health problems, young people who are struggling with life who may be a danger to society, but also a risk to themselves. Counter Terrorism Policing said it offered \"sincere condolences to Rhianan's family and loved ones for their terrible loss\". Assistant Chief Constable Di Coulson, speaking on behalf of Counter Terrorism Policing in the East Midlands (CTPEM) and Derbyshire Constabulary, said: \"This was a complex case involving a very vulnerable young person, who had been subjected to radicalisation. \"Rhianan's tragic death was clearly devastating for her family. It was felt profoundly by the officers directly involved, but also across Counter Terrorism Policing as a whole. \"Rhianan's case was a stark moment for our management of the growing numbers of children and young people in our casework - so often presenting vulnerability as well as risk and threat to the public. \"Since Rhianan's death, we continue to work alongside our partners to evolve the way we approach cases involving children and, where feasible, attempt to rehabilitate and deradicalise, rather than investigate and convict. \"We welcome the findings of the Chief Coroner today, and while we have already made substantial improvements to the way we manage these cases, we will carefully review the findings and make any further changes in order to improve our protection of the public against terrorism.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Gaza-bound aid boat carrying Greta Thunberg and other activists brought to Israel",
        "description": "A Gaza-bound aid boat carrying Greta Thunberg and other activists has been brought to shore in Israel after being intercepted by the country's military.",
        "url": "https://news.sky.com/story/gaza-bound-aid-boat-carrying-greta-thunberg-and-other-activists-diverted-to-israel-13380969",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israel-greta-thunberg_6937767.png?20250609202434",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-09 01:12:00",
        "Headline": "Climate campaigner Ms Thunberg, 22, was one of a dozen activists aboard the Madleen, which set sail from Sicily on 1 May on a mission aiming to break Israel's sea blockade.",
        "Content": " A Gaza-bound aid boat carrying Greta Thunberg and other activists has been brought to shore in Israel after being intercepted by the country's military. Sharing an image of Thunberg, the Israel Foreign Ministry said the boat had docked in Ashdod Port \"a short while ago\" and that passengers were \"currently undergoing medical examinations to ensure they are in good health\". Early on Monday, the Israeli foreign ministry said that the British-flagged yacht Madleen - operated by the pro-Palestinian Freedom Flotilla Coalition (FFC) - \"was safely making its way to the shores of Israel\". The country's defence minister also said the Israeli military would show Thunberg and other activists onboard footage of the 7 October attacks by Hamas. According to the Times of Israel, he later said: \"Greta [Thunberg] and her flotilla companions were taken into a room upon their arrival for a screening of the horror film of the October 7 massacre, and when they saw what it was about, they refused to continue watching. \"The antisemitic flotilla members are turning a blind eye to the truth and have proven once again that they prefer the murderers to the murdered and continue to ignore the atrocities committed by Hamas against Jewish and Israeli women, adults, and children. Who are the passengers on the Madleen yacht? \"They should see the atrocities committed against women, the elderly, and children, and understand whom Israel is fighting to defend itself.\" He commended the IDF for its \"swift and safe takeover\" of the vessel, and said the Israeli military \"will continue its just and moral fight against the Hamas murderers until their defeat, the release of all hostages, and the full restoration of Israel's security\". Israel's foreign ministry said earlier that those aboard the Madleen \"are expected to return to their home countries\" and that the humanitarian aid aboard the ship would be transferred to Gaza through established channels. Ms Thunberg was \"safe and in good spirits\" while en route to Israel, the ministry added, while labelling the vessel \"the 'selfie yacht' of the 'celebrities'\". The FFC claimed the passengers on the yacht had been \"kidnapped by Israeli forces\" and released pre-recorded messages from them after previously saying that the \"Israeli army had boarded\" the vessel. Climate campaigner Ms Thunberg, 22, was one of a dozen activists aboard the Madleen, which set sail from Sicily on 1 June on a mission aiming to break Israel's sea blockade. In a statement later on Monday, Hamas condemned the detention of the Madleen crew, calling it a \"flagrant violation of international law\". The group also said: \"We salute the free solidarity activists of various nationalities who steadfastly confronted the threats and affirmed that Gaza is not alone.\" \"The detention of Madeleine (sic) will not silence the voices of the free,\" it added, \"nor will it halt the growing tide of global solidarity with Gaza\". Rima Hassan, a French member of the European Parliament, who is of Palestinian descent, was also on the boat. She has been barred from entering Israel because of her opposition to Israel's policies towards Palestinians. Ms Hassan wrote on X as the FFC's yacht was allegedly surrounded by other vessels: \"The crew of the Freedom Flotilla was arrested by the Israeli army in international waters around 2am.\" The diversion of the Madleen came after Mr Katz said that he had instructed the IDF to prevent the vessel from reaching the shore and to \"take whatever measures necessary\". Addressing Ms Thunberg and the other activists on Sunday, he said: \"You should turn back - because you will not reach Gaza.\" Israel started allowing some basic aid into Gaza last month after a three-month total blockade aimed at pressuring Hamas and preventing the group from importing arms. But humanitarian workers have warned of famine unless there is an end to the blockade and the 20-month war, which began after a Hamas-led assault on southern Israel on 7 October 2023, that killed more than 1,200 people. According to the Hamas-run Gaza Health Ministry, more than 54,000 Palestinians have been killed since the start of Israel's military campaign. Its figures do not differentiate between civilians and fighters.  An attempt last month by Freedom Flotilla to reach Gaza by sea failed after another of the group's vessels was attacked by two drones while sailing in international waters off Malta. The group blamed Israel for the attack, which damaged the front section of the ship. Read more from Sky News:Gazans pray in rubble at start of EidRussian troops 'reach new Ukrainian region'Soldier arrested on suspicion of raping woman Francesca Albanese, United Nations' special rapporteur on human rights in the Palestinian territories, also urged other boats to challenge the Gaza blockade. She said on social media: \"Madleen's journey may have ended, but the mission isn't over. \"Every Mediterranean port must send boats with aid & solidarity to Gaza.\""
    },
    {
        "title": "Judge dismisses Justin Baldoni's defamation claim against former co-star Blake Lively",
        "description": "A judge in the US has dismissed actor Justin Baldoni's $400m (&#163;295m) defamation lawsuit against his It Ends With Us co-star Blake Lively.",
        "url": "https://news.sky.com/story/judge-dismisses-justin-baldonis-defamation-claim-against-former-co-star-blake-lively-13381365",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-blake-lively-justin-baldoni_6783204.jpg?20241222130409",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-09 18:03:00",
        "Headline": "The judge's decision is the latest development in the legal battle between the It Ends With US co-stars, which includes Lively suing Baldoni in December.",
        "Content": "A judge in the US has dismissed actor Justin Baldoni's $400m (£295m) defamation lawsuit against his It Ends With Us co-star Blake Lively. Baldoni filed the countersuit against the 37-year-old in response to her launching legal action in December, accusing him of sexual harassment against her while filming the 2024 movie. The 41-year-old and production company Wayfarer Studios countersued in January for $400m, accusing Lively and her husband, \"Deadpool\" actor Ryan Reynolds, their publicist, the New York Times, and others of orchestrating a smear campaign to extort him. He accused Lively of trying to \"hijack\" the movie and then blaming him when her \"disastrous\" promotional approach prompted an online backlash against her. \"It Ends With Us\" garnered mixed reviews, but grossed more than $351m (£259m) worldwide, according to reports. In a statement, lawyers representing Lively said: \"Today's opinion is a total victory and a complete vindication for Blake Lively, along with those that Justin Baldoni and the Wayfarer Parties dragged into their retaliatory lawsuit, including Ryan Reynolds, Leslie Sloane and The New York Times. \"As we have said from day one, this '$400 million' lawsuit was a sham, and the court saw right through it. \"We look forward to the next round, which is seeking attorneys' fees, treble damages and punitive damages against Baldoni, Sarowitz, Nathan, and the other Wayfarer Parties who perpetrated this abusive litigation.\" Sky News has approached Baldoni's representatives for comment. US District Court Judge Lewis Liman has ruled that Baldoni can't sue Lively for defamation over claims she made in her lawsuit, because allegations made in a lawsuit are exempt from libel claims. The judge also dismissed Baldoni's defamation lawsuit against The New York Times, which had reported on Lively's sexual harassment allegations. Read more:Lively and Baldoni's lawyers told to stop discussing casesAmber Heard reacts to Lively's complaint about Baldoni  Mr Liman also ruled that Baldoni's claims that Lively stole creative control of the film didn't count as extortion under California law. Baldoni's legal team can revise the lawsuit if they want to pursue different claims related to whether Lively breached a contract, the judge said. \"It Ends With Us,\" an adaptation of Colleen Hoover's bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August last, exceeding box office expectations with a $50m (£37m) debut. But the movie's release was shrouded by speculation over discord between Lively and Baldoni."
    },
    {
        "title": "NATO chief's speech was meant as a call to arms, but it was also a shameful admission for the alliance",
        "description": "For all the stark warnings and ominous predictions made by the head of NATO today, one key fact remained unmentioned.",
        "url": "https://news.sky.com/story/nato-chiefs-speech-was-meant-as-a-call-to-arms-but-it-was-also-a-shameful-admission-for-the-alliance-13381382",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-rutte-nato-speech_6937580.jpg?20250609160501",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-09 19:11:00",
        "Headline": "The West is still funding the Russian war effort to the tune of billions by buying oil and gas, funnelling vast amounts into an economy that is now fully militarised.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  For all the stark warnings and ominous predictions made by the head of NATO today, one key fact remained unmentioned. The West is still funding the Russian war effort to the tune of billions by buying oil and gas, funnelling vast amounts into an economy that is now fully militarised. Russian gas exports to Europe went up by 20% last year and its LNG exports to the EU are now at record levels. Read more: NATO chief calls for 400% increase in air and missile defence Vladimir Putin's Russia is now making more money from selling fossil fuels than Ukraine receives from allies. NATO's secretary general Mark Rutte did not mention any of that. But he did spell out what Russia is doing with all that hydrocarbon revenue. It is using it to put its economy onto a war footing that is now pumping out munitions at a rate that puts the West to shame, to the extent Russia could have the capability to take on NATO in three to five years, according to Mr Rutte. New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences 👉Search for The Wargame on your podcast app👈 The secretary general meant his speech in London as a warning and call to arms. But it was also a shameful admission for the Western alliance he heads. More than three years into this war, Russia is outstripping the entire Western bloc by four to one in terms of munitions production.  Russia's economy is 1/25th that of NATO's combined economic might and crippled by sanctions and yet every three months pumps out more shells than the entire NATO bloc manages in a year. And while Europe carries on funding Russia's war effort by buying its oil and gas, none of that is going to change. We are now in the insane and obscene situation where European taxpayers will have to fork out more, a lot more, to counteract the threat of a militarised Russia, whose resurgence is being subsidised by Western countries buying its fossil fuels. Historians will look back on that and wonder why it was allowed to continue more than three years into this devastating conflict."
    },
    {
        "title": "Plastic surgeon Peter Brooks who attempted to murder former boss is jailed",
        "description": "A plastic surgeon has been sentenced to life in prison with a minimum term of 22 years after stabbing his former boss and trying to set his house on fire.",
        "url": "https://news.sky.com/story/plastic-surgeon-peter-brooks-who-attempted-to-murder-former-boss-is-jailed-13381007",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-peter-brooks-plastic-surgeon_6879002.png?20250407155419",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-09 16:17:00",
        "Headline": "Peter Brooks, 61, was found guilty of attempted murder, attempted arson, and possession of a bladed article in April.",
        "Content": "A plastic surgeon has been sentenced to life in prison with a minimum term of 22 years after stabbing his former boss and trying to set his house on fire. Peter Brooks, 61, was found guilty of two counts of attempted murder, attempted arson, and possession of a bladed article in April. He cycled to the home of Graeme Perks in Halam, near Southwell, Nottinghamshire, while wearing camouflage gear and armed with a crowbar, petrol, matches and a knife in the early hours of 14 January 2021. The 61-year-old then doused the ground floor of the property with petrol before stabbing fellow plastic surgeon Mr Perks because he wanted him \"out of the way\", his trial in Loughborough heard. Mr Perks, who was 65 at the time, had retired the month before the attack but suffered \"extremely life-threatening\" injuries to his liver, intestines and pancreas, and was given a 95% chance of death. His wife and children were sleeping upstairs at the time of the attack, which took place during a COVID lockdown, the jury was told. Jailing him at Leicester Crown Court, sitting in Loughborough, on Monday, Judge Mr Justice Pepperall said Brooks had committed \"appalling\" crimes after setting off from his home on a \"murderous expedition\". Brooks was \"voluntarily absent\" from his month-long trial because he was on a hunger strike and said he would \"rather be dead than incarcerated\". Mr Justice Pepperall previously told the court that on \"no fewer than eight occasions\" since 2021, Brooks, formerly of Southwell, had \"used hunger strikes or the threat of some other self-harm to achieve some advantage\". Brooks did not appear in person for his sentencing hearing today because he refused to leave his cell. Stephen Leslie KC, defending, said Brooks had said he was too unwell to make the journey to court and instead listened to proceedings via video link from HMP Norwich. Because he has already served more than four years in custody so far, he will serve at least 17 years in prison to complete his minimum term. One of his attempted murder convictions was for the intended use of fire, while the other was for the stabbing. A sentence of six years for arson and 18 months for possessing a knife are to run concurrently to the attempted murder sentences. Brooks' convictions followed a four-year series of legal hearings, including a mistrial and seven other aborted trial dates. Mr Perks, a consultant plastic surgeon, had, before the stabbing, provided evidence in disciplinary proceedings against Brooks, who faced potentially losing his job with Nottingham University Hospitals NHS Trust, the jury heard. Read more:Downtown LA a scene of 'pandemonium'Day Of The Jackal author dead On the night of the attack, Mr Perks woke up when Brooks smashed through his conservatory and went downstairs, where his feet \"felt a bit damp\" from the petrol before he felt a \"blow to his body\". Brooks was found asleep on a garden bench later that morning when he was taken to hospital for injuries to his hand, and was arrested. In a victim impact statement read to the court by prosecution lawyer Tracy Ayling KC, Mr Perks said the incident had been an \"unimaginable catastrophe\" for him and his family. He added: \"I have no ill-feelings, hatred or bitterness towards my ex-colleague and derive no satisfaction from the guilty conviction. \"It is just another interesting chapter in life, and I wish his family well. \"I remain eternally grateful that it was me, not (wife) Bev or (son) Henry who were stabbed, and reflect how ironic that a burns surgeon should wish to immolate our family.\" Henry Perks, Mr Perks' son, described Brooks as a \"highly dangerous and remorseless individual\" and \"nothing more than a bully\", adding: \"He simply has no morals, sees no wrong in his actions and will stop at nothing to hurt those he perceives to have wronged him. \"I have no doubt his failure to silence my father will consume his mind and make him dangerous in the years after his release.\" Ms Ayling said Brooks was \"manipulative\" and had shown no remorse for what he had done. She said: \"He believes himself to be not guilty of the offences. He believes he has been unlawfully tried. \"He has a history of being manipulative.\" Mitigating, Mr Leslie said it was a \"single act of violence\" and that there was no pre-planning beyond the day of the attack. He said Brooks had petrol in his garage because he was a motorbike enthusiast and that he is \"beginning to show remorse\" for what he had done."
    },
    {
        "title": "NHS trust and ward manager found not guilty of manslaughter after woman took her own life at hospital",
        "description": "Warning: This article contains references to suicide",
        "url": "https://news.sky.com/story/nhs-trust-and-ward-manager-found-not-guilty-of-manslaughter-after-woman-took-her-own-life-at-hospital-13344480",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alice-figueiredo-nhs_6881817.jpg?20250410145227",
        "type": "Home",
        "Author": "Sky News health team",
        "Date Published": "2025-06-09 07:00:00",
        "Headline": "The North East London NHS Foundation Trust (NELFT) had been charged with corporate manslaughter but instead was found guilty of failing to ensure health and safety of non-employees. Jury deliberation was joint longest in English legal history.",
        "Content": "By Sky News health team   Warning: This article contains references to suicide An NHS trust on trial following the death of a young woman at an east London hospital has been cleared of corporate manslaughter. Alice Figueiredo, 22, took her own life while being treated at Goodmayes Hospital in July 2015. The North East London NHS Foundation Trust (NELFT) had been charged with corporate manslaughter and was found not guilty, following a months-long trial. Instead, it was found guilty of failing to ensure the health and safety of non-employees. A not guilty verdict was also returned for hospital ward manager Benjamin Aninakwa, who was charged with gross negligence manslaughter. Aninakwa also denied a charge of failing to take reasonable care for the health and safety of patients on the ward. He was found guilty. The decisions were made after the joint-longest jury deliberation in English legal history. Alice was 'effectively killed' says family Alice's mother, Jane, said: \"Today's verdicts have come after almost ten years of a relentless, uphill slog pursuing justice, accountability and truth for the five months of deplorable failings in Alice's care at Goodmayes Hospital, which directly led to her death in 2015. \"We will always personally believe and feel that Alice was effectively killed due to an appalling level of negligence.\" She said the family had lived the last decade \"devastated by the immeasurable loss of her luminous, kind, thoughtful, generous, warm, humorous and deeply loving presence\". \"We will never stop thinking of her and missing her. \"There is always one place empty at our table, one very special voice silent that we long to hear in our conversations.\" She said the conviction for the health and safety offence will send a \"very strong message\" to other mental health providers that they are \"not above the law\". \"You have a duty of care to stop dismissing and fobbing off their families, friends, and carers when they come to you with well-founded concerns about how their loved ones are being treated or mistreated,\" she said. Alice's stepfather, Max, added: \"In this trial, there's been a defence narrative that says these deaths are unavoidable. \"We will always maintain that NELFT was grossly negligent in the management of its activities which directly led to Alice's death. \"Mr (Wes) Streeting, if you are listening today, you need to hold these trust managers to account. \"This trust has the strapline 'best care by the best people'. This is empty rhetoric.\" Speaking after the verdict, a spokesperson for the NELFT said their thoughts were with Alice's family and loved ones. \"We will reflect on the verdict and its implications, both for the trust and mental health provision more broadly, as we continue to work to develop services for the communities we serve.\" Alice attempted to harm herself 39 times in five months Aninakwa was accused of failing to remove items from the ward capable of use for self-harm and failing to ensure incidents of self-harm were recorded, considered and addressed. Ms Figueiredo was described as a bright and gifted young woman, who had been head girl at her school. She struggled with her mental health and had been diagnosed with an eating disorder as well as bipolar affective disorder. In February 2015, Ms Figueiredo was admitted to Hepworth Ward, an acute psychiatric unit at Goodmayes Hospital. During her five months on the ward, the jury at the Old Bailey heard how she had attempted to harm or kill herself on 39 occasions, including 18 times with plastic bags. Despite this, Ms Figueiredo was able to access a bag, and on 7 July, she killed herself using a bag taken from a communal toilet on the ward. The trial also heard evidence about the reporting of incidents on the hospital computer system. Last year, Health Secretary Wes Streeting made damning remarks about NELFT at a conference of NHS leaders. \"I'm very aware of NELFT not least because NELFT has and continues to appear in the headlines for providing really poor quality care,\" he said. Ms Figueiredo's family visited her regularly in hospital, and repeatedly raised concerns about her care. The jury heard how her mother, Jane Figueiredo, wrote to managers warning: \"It is only a matter of time before there is a fatality on this ward.\" Campaigners believe Ms Figueiredo's death points to wider problems with mental health care. Deborah Coles, director of the charity Inquest, said: \"I hope that irrespective of the verdict, this will send shock waves and ensure that learning and change is an absolute priority.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "The five considerable problems with the chancellor's U-turn on winter fuel payments",
        "description": "There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all?",
        "url": "https://news.sky.com/story/the-five-key-issues-from-chancellors-winter-fuel-payment-u-turn-13381413",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves_6937820.jpg?20250609221257",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-06-09 20:43:00",
        "Headline": "Chancellor Rachel Reeves U-turned on her decision to remove winter fuel payments from most pensioners.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all? First, Rachel Reeves has executed the plan without working out how to pay for it. This, for an iron chancellor, is a wound that opponents won't let her forget. A summer of speculation about tax rises is not a summer anyone looks forward to. Politics latest: Treasury minister challenged over reason for U-turn Second, the fig leaf that she and Treasury ministers are using is an improvement in economic conditions. If you were being polite, you'd say this is contested. The OBR halved growth this year and the OECD downgraded UK forecasts, albeit only by a little, last week. \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Can you trust Rachel Reeves' spending review numbers?\n                 The claim that interest rates are coming down ignores that their descent is slower because of government decisions of the last six months. Third, the question immediately becomes, what next? Why not personal independent payments (PIP) and the two-child benefit cap? At this stage, it would feel like a climbdown if they did not back down over those. But then, what will the markets - already policing this closely - make of it, and could they punish the government? Fourth, this is aggravating divisions in the Parliamentary Labour Party: the soft left Compass group and ministers like Torsten Bell pushing bigger spending arguments. Those MPs in Tory-facing seats who rely on arguments that Labour can be trusted with the public finances are worried. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Fifth, this has created a firm division between No 10 (the PM) and No 11 (the Chancellor). No 10 is now conscious that it does not have enough independent advice about the market reaction to economic policies and is seeking to correct. Others, I am told, are just critical of the chancellor's U-turn - for she wobbled first. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? Given the litany of arguments against, why has it happened? Because the hope is this maxi U-turn lances the boil, removes a significant source of pensioners' anger and brings back Labour voters, a price they calculate worth paying, whatever the fiscal cost. We wait to see who is right."
    },
    {
        "title": "Jess and Norma: Grandmother who had millions of fans on TikTok dies aged 91",
        "description": "A grandmother who found fame on TikTok for posting funny videos with her granddaughter has died aged 91. ",
        "url": "https://news.sky.com/story/jess-and-norma-grandmother-who-had-millions-of-fans-on-tiktok-dies-aged-91-13381434",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jessnorma-tiktok_6937859.jpg?20250610001753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-09 22:54:00",
        "Headline": "Norma and her granddaughter Jess, 32, have 2.7 million followers on TikTok after charming their audience with heart-warming glimpses into their daily lives.",
        "Content": "A grandmother who found fame on TikTok for posting funny videos with her granddaughter has died aged 91.  Norma died on 5 June, her family announced on social media on Monday. Her endearing and comedic videos with 32-year-old Jess went viral, with the duo attracting 2.7 million followers on TikTok. In one viral clip, which was viewed by more than 28 million people, Norma says \"we're related\" in a series of funny voices - mimicking a cow and a vampire - with both collapsing into fits of giggles. Another, viewed more than 15 million times, involves Jess playing a prank on her grandmother. In the video, Jess says she has the opportunity to win £10,000 - and all she has to do is say on video why she should win it. Jess proceeds to tell viewers a made-up tale about their family life, with Norma doubling over in laughter over the stories she came up with. Norma's family said they had lost \"our rock\" as they told followers about her death. \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 \n                  TikTok influencer shot dead during livestream in Mexico\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 \"We are all truly devastated and our lives will never be the same,\" the family said. \"We want you all to know that Nan fell to sleep peacefully, surrounded by all her family, she was full of love and had the most beautiful care.\" The family said the community Norma and Jess created online made the nonagenarian's \"last years so incredibly special\". \"Her cup was full and in her own words she 'lived such a wonderful life',\" they added. Norma was beloved among celebrities and fans, nearly 100,000 of whom took shared their condolences on TikTok."
    },
    {
        "title": "Rhianan Rudd: How mother's boyfriend played 'significant' role in radicalising youngest UK girl to face terror charges",
        "description": "Rhianan Rudd, who took her own life at the age of 16, was the youngest girl in the UK to be charged with terrorist offences.&#160;",
        "url": "https://news.sky.com/story/rhianan-rudd-how-mothers-boyfriend-played-significant-role-in-radicalising-youngest-uk-girl-to-face-terror-charges-13381372",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rhianan-rudd-inquest_6841721.jpg?20250227195316",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-09 18:05:00",
        "Headline": "Rhianan Rudd, who was investigated by counter terror police and MI5, took her own life five months after terror charges against her were dropped.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Rhianan Rudd, who took her own life at the age of 16, was the youngest girl in the UK to be charged with terrorist offences.  The inquest into her death, which concluded today, revealed shocking details about her radicalisation by two American white supremacists, one of whom was her mother's boyfriend, who the coroner said \"played a material role in her radicalisation\". Rhianan gouged a swastika into her forehead, downloaded a bomb-making manual and told her mother she planned to blow up a synagogue. Investigated by anti-terrorism police and MI5, charges against her were later dropped, but five month later on 19 May 2022, she was found dead in her shower in a children's home in Nottinghamshire. Hours earlier she had posted on Instagram: \"I'm delving into madness.\" The evidence heard in Chesterfield Coroner's Court from police, social services and even an MI5 operative, raised questions over the state's part in her death - and whether, despite her obvious radicalisation, this vulnerable, autistic girl should have been treated with more care by the authorities. Judge Alexia Durran said: \"I'm not satisfied, on the balance of probabilities, Rhianan intended to take her own life. Rhianan's death... was the result of a self-inflicted act but it is not possible to ascertain her intention. \"Rhianan was known, to family and professionals, to be vulnerable, to have autistic traits and have a history of self-harm.\" \n                  The Wargame podcast: What if Russia attacked the UK?\n                 \n                  The Wargame: Behind the scenes of new podcast series that simulates Russian attack on UK\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 The coroner added: \"I find she was highly affected by her arrest and was concerned about being sent to prison.\" It was not known what Rhianan was told by her legal team when the charges were dropped but this may have had a \"psychological impact\" on her, the coroner said. In an interview released at the verdict, Rhianan's mother Emily Carter said her daughter \"should never have been charged\", that she was failed by those investigating her, including MI5 and counter terrorism police, as well as being let down by mental health services and those caring for her at the home. This was the most complex of cases, set at a time when our security services are seeing a growing number of children being arrested and charged for terrorist offences, while parents often seem oblivious to the radicalising material they are consuming online in their bedrooms. Ms Durham's ruling reflected this complexity, finding that while there were some failings the actions of the police and MI5 were \"reasonable and proportionate\". The coroner concluded today that she was satisfied that missed opportunities in her case were \"not systemic\". Judge Alexia Durran said: \"In the circumstances I do not consider I should make a prevention of future deaths report.\" At the same she was unequivocal about the \"significant\" role played by two extremists in radicalising her. It was her mother's former boyfriend, an American she'd befriended though a US pen-pal prison scheme, who first introduced Rhianan to far-right ideology. Dax Mallaburn had been part of a white supremacist prison gang in the US and subsequently came to the UK to live with Rhianan's mother in September 2017, a year after she'd been to visit him in the US. In the autumn of 2019, Rhianan alleged that he had touched her inappropriately but later withdrew the allegation and, after a social services assessment, Mr Mallaburn returned to the family home. Ms Carter says: \"In hindsight, he was a bad person but I never saw him talking Nazi stuff with her.\" Before Rhianan was arrested, Mr Mallaburn's relationship with her mother had broken down and he returned to the US and then Mexico. However, during COVID, Rhianan appeared to contact another far-right extremist, Christopher Cook, and began an online relationship with him. Cook, who was roughly 18 and living in Ohio, shared far-right texts with Rhianan along with a bomb-making manual, and during this time she became fixated with Adolf Hitler. Cook's lawyer, Peter Scranton, says he too was radicalised online, and he came up with a plan to blow up power stations in the US, for which he was eventually arrested in August 2020, and in February 2022 he pleaded guilty to terrorism offences. Cook, who was a misfit at school, suffering from \"severe depression\" according to his lawyer and was \"essentially lashing out\" as he tried to form a group to carry out his plan. Mr Scranton told Sky News, \"It was white nationalism, and they had this idea, and I don't know why anyone would feel this way or how they thought it would work, that if they tore down the government and started over they could create a new United States of America that could look like the image that they would want - a white nationalist image.\" Read more from Sky News:Plastic surgeon tried to murder former bossDowntown LA a scene of 'pandemonium'Day Of The Jackal author deadMr Scranton says Cook told him he didn't radicalise Rhianan, and it was the former boyfriend, Dax Mallaburn, who'd initially got her into neo-Nazi ideology. However, the coroner found Cook was \"a significant radicaliser of Rhianan\" at a time when she was \"isolated and unsupervised\". Ms Carter says Rhianan was interested in German history because she was doing it at school and Cook was able to \"pull her in\", to racial hatred and antisemitism. She says she didn't know what was happening, despite having parental controls on Rhianan's devices. She said: \"I could hear her talking to people on there and I'd say who are you talking to and she'd say - just someone from school - and in fact I found out it wasn't at all. \"When this person she was talking to disappeared, that's when she sat down on my lap like a baby and cried. She told me this guy Chris had left her, and she was totally in love with him - then she came down and told me she had downloaded a bomb manual and I was like 'Oh my god, what have you been doing'.\" Ms Carter decided to contact Prevent - a national program in the UK designed to stop individuals from becoming terrorists or supporting terrorism She says: \"I thought putting her in a deradicalisation programme would be a fairly easy undo 'brain pick', But it wasn't until the police turned up that I thought 'hang on a minute this is a lot deeper than I actually thought it was at first'.\"Ms Carter and her lawyers have argued that the police were heavy-handed, that there should have been a psychological assessment before she was even questioned over terrorism offences. \"There were 19 police officers to arrest a 5ft 1, 14-year-old girl who weighs seven stone. It was over the top,\" says Ms Carter. Once Rhianan was charged, the deradicalisation work under Prevent was put on hold. Ms Carter thinks this was a mistake. She says: \"Leaving her with her own thoughts throughout the entire time of going through the police interviews and everything else - the deradicalisation would have changed the way she was seeing things - I believe she would have been able to handle it all so much better.\" The coroner described the police arrest and interview as \"necessary and conducted appropriately\" and that, while ceasing the Prevent intervention was an \"unfortunate consequence\" of the police investigation, it was \"an appropriate step\". During police interviews, Rhianan described being coerced and groomed, including sexually, and having sent explicit images of herself to Cook. Lawyers representing the family say police and MI5 knew she was the victim of child sexual exploitation but failed to refer her to the relevant body - the National Referral Mechanism. It was only after a social worker made the referral, that she was identified as a child victim and then the charges were dropped, by which time she had been subject to investigation and prosecution for 15 months. The coroner agreed that there was a \"systems failure\" due to a lack of training both within the police and the Derbyshire council who both had had \"significant information\" that she was a potential victim of modern slavery. However, she also said it \"was impossible to know\" whether this would have led to the CPS dropping their charges sooner, \"nor that if had more than minimal impact on Rhianan's death\". Ms Carter says if she'd been treated differently \"she'd be troubled, but I do think she'd still be alive\". Rhianan's family say the security services knew her vulnerabilities and that she had a tendency to self-harm, but they failed to take this into account. Ms Carter said: \"I admit my mistakes and I want the organisations to admit their mistakes. There were failings and they need to admit them.\" This ruling however found that the state did not play a role in Rhianan's death under article 2 of the European Convention on Human Rights. For the most part, her vulnerabilities were known and taken into consideration. It does however show how extremists will exploit children with mental health problems, young people who are struggling with life who may be a danger to society, but also a risk to themselves. Counter Terrorism Policing said it offered \"sincere condolences to Rhianan's family and loved ones for their terrible loss\". Assistant Chief Constable Di Coulson, speaking on behalf of Counter Terrorism Policing in the East Midlands (CTPEM) and Derbyshire Constabulary, said: \"This was a complex case involving a very vulnerable young person, who had been subjected to radicalisation. \"Rhianan's tragic death was clearly devastating for her family. It was felt profoundly by the officers directly involved, but also across Counter Terrorism Policing as a whole. \"Rhianan's case was a stark moment for our management of the growing numbers of children and young people in our casework - so often presenting vulnerability as well as risk and threat to the public. \"Since Rhianan's death, we continue to work alongside our partners to evolve the way we approach cases involving children and, where feasible, attempt to rehabilitate and deradicalise, rather than investigate and convict. \"We welcome the findings of the Chief Coroner today, and while we have already made substantial improvements to the way we manage these cases, we will carefully review the findings and make any further changes in order to improve our protection of the public against terrorism.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn",
        "description": "The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses.",
        "url": "https://news.sky.com/story/spending-review-2025-cutting-agricultural-budget-could-be-catastrophic-for-nature-farmers-and-charities-warn-13381297",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-farm-inheritance-tax_6759056.jpg?20241127091742",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-09 15:43:00",
        "Headline": "The groups fear the government will cut the agricultural budget at Rachel Reeves' spending review on Wednesday.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses. In a letter to food security and rural affairs minister Daniel Zeichner, exclusively seen by Sky News, a dozen of the biggest rural industry organisations say they are \"deeply concerned\" about rumoured cuts that will be made to the agricultural budget in Wednesday's spending review. Chancellor Rachel Reeves will set out budgets for each government department for the rest of this parliament, set to end in 2029. The letter says cutting funding for existing and new environmental farming schemes will be \"catastrophic\" to the government's aims for the environment. \"Many of the environmental features present in the countryside and enjoyed by the public will be under threat and will disappear,\" the letter says. \"This would be a poor legacy for this government.\" Sir Keir Starmer's government has made getting to net zero by 2050 a key goal, already initiating several policies to restrict carbon emissions and make the UK greener since winning the election last July. \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 However, the government shocked farmers in March when it shut down applications for the Sustainable Farming Incentive (SFI), which rewards farmers for managing their land in environmentally sustainable ways, with just a few hours' notice as they said a cap had been reached for the year. The rural organisations say the Environmental Land Management (ELM) scheme payments are \"critical to the government's statutory targets on environmental improvement\", including the main goal of halting the decline of biodiversity. Read more:Prince William meets Clarkson's Farm star to discuss industry challengesLabour MP goes public to oppose family farms tax  The letter states farmers and landowners are fully committed to environmental schemes, with 77,000 live agri-environment scheme agreements, according to the latest government figures, \"with millions of hectares under environmental land management\". \"So much good has been done by these agreements, the oldest of which has run for decades,\" the letter says. \"The unprecedented engagement in the Sustainable Farming Incentive (SFI) is testament to the appetite of farmers and land managers to rise to the challenge and do more.\" The letter finishes with: \"The industry would like to have your assurances that this critical work will continue to be funded at the same level.\" David Wilson, a farmer for 53 years, told Sky News it took many years for farmers to get on board with the environmental schemes but they are now joined up, and reducing funding could damage years of work and be a backwards step for not just the UK's environment, but the world's. \"This is ultimately about sustainability. To produce good food, you need good ecology and reducing this funding could damage the UK's ecology and our food security,\" he added. A return to intensive farming Alex Robinson, 39, a farmer from Gloucestershire with 424 hectares, said the schemes have been \"a lifeline for nature\", with birds, bees and wildflowers returning - including 14 red-listed bird species, many that had not been seen in decades. His farm's soil health is improving, which means he can grow more resilient nutrient dense crops for people to eat. If funding is cut he said he \"may have no choice but to return to intensive farming methods sooner than the soils are ready for\", with wildflowers and field margins becoming \"difficult to justify\", which will put the UK's climate, biodiversity and long-term food security \"in real danger\". Government will be abandoning nature Signatory Victoria Vyvyan, farmer and president of the Country Land and Business Association (CLA), said: \"If sustainable farming contracts are cut, government won't just abandon nature - it will abandon its own environmental and legal commitments. \"The Sustainable Farming Incentive is working - for farmers, for nature, for the public, and for the Treasury. It's bringing back wildlife, cleaning up rivers, and restoring the health of our soil. \"Take away the funding for nature contracts, and farmers will be pushed back to intensive methods - forced to undo years of progress. Nature will suffer as well as farmers, and on the environment, it will go against everything government claims to agree with.\" The letter has been signed by the heads of The National Trust, the National Farmers' Union (NFU), the RSPB, the Soil Association, the CLA, the Tenant Farmers Association, the Game and Wildlife Conservation Trust, the Nature Friendly Farming Network, the Central Association of Agricultural Valuers, the National Federation of Young Farmers' Clubs, the British Institute of Agricultural Consultants and the Agricultural Industries Confederation. A government spokesman said they \"do not comment on budget speculation\"."
    },
    {
        "title": "NHS trust and ward manager found not guilty of manslaughter after woman took her own life at hospital",
        "description": "Warning: This article contains references to suicide",
        "url": "https://news.sky.com/story/nhs-trust-and-ward-manager-found-not-guilty-of-manslaughter-after-woman-took-her-own-life-at-hospital-13344480",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alice-figueiredo-nhs_6881817.jpg?20250410145227",
        "type": "UK",
        "Author": "Sky News health team",
        "Date Published": "2025-06-09 07:00:00",
        "Headline": "The North East London NHS Foundation Trust (NELFT) had been charged with corporate manslaughter but instead was found guilty of failing to ensure health and safety of non-employees. Jury deliberation was joint longest in English legal history.",
        "Content": "By Sky News health team   Warning: This article contains references to suicide An NHS trust on trial following the death of a young woman at an east London hospital has been cleared of corporate manslaughter. Alice Figueiredo, 22, took her own life while being treated at Goodmayes Hospital in July 2015. The North East London NHS Foundation Trust (NELFT) had been charged with corporate manslaughter and was found not guilty, following a months-long trial. Instead, it was found guilty of failing to ensure the health and safety of non-employees. A not guilty verdict was also returned for hospital ward manager Benjamin Aninakwa, who was charged with gross negligence manslaughter. Aninakwa also denied a charge of failing to take reasonable care for the health and safety of patients on the ward. He was found guilty. The decisions were made after the joint-longest jury deliberation in English legal history. Alice was 'effectively killed' says family Alice's mother, Jane, said: \"Today's verdicts have come after almost ten years of a relentless, uphill slog pursuing justice, accountability and truth for the five months of deplorable failings in Alice's care at Goodmayes Hospital, which directly led to her death in 2015. \"We will always personally believe and feel that Alice was effectively killed due to an appalling level of negligence.\" She said the family had lived the last decade \"devastated by the immeasurable loss of her luminous, kind, thoughtful, generous, warm, humorous and deeply loving presence\". \"We will never stop thinking of her and missing her. \"There is always one place empty at our table, one very special voice silent that we long to hear in our conversations.\" She said the conviction for the health and safety offence will send a \"very strong message\" to other mental health providers that they are \"not above the law\". \"You have a duty of care to stop dismissing and fobbing off their families, friends, and carers when they come to you with well-founded concerns about how their loved ones are being treated or mistreated,\" she said. Alice's stepfather, Max, added: \"In this trial, there's been a defence narrative that says these deaths are unavoidable. \"We will always maintain that NELFT was grossly negligent in the management of its activities which directly led to Alice's death. \"Mr (Wes) Streeting, if you are listening today, you need to hold these trust managers to account. \"This trust has the strapline 'best care by the best people'. This is empty rhetoric.\" Speaking after the verdict, a spokesperson for the NELFT said their thoughts were with Alice's family and loved ones. \"We will reflect on the verdict and its implications, both for the trust and mental health provision more broadly, as we continue to work to develop services for the communities we serve.\" Alice attempted to harm herself 39 times in five months Aninakwa was accused of failing to remove items from the ward capable of use for self-harm and failing to ensure incidents of self-harm were recorded, considered and addressed. Ms Figueiredo was described as a bright and gifted young woman, who had been head girl at her school. She struggled with her mental health and had been diagnosed with an eating disorder as well as bipolar affective disorder. In February 2015, Ms Figueiredo was admitted to Hepworth Ward, an acute psychiatric unit at Goodmayes Hospital. During her five months on the ward, the jury at the Old Bailey heard how she had attempted to harm or kill herself on 39 occasions, including 18 times with plastic bags. Despite this, Ms Figueiredo was able to access a bag, and on 7 July, she killed herself using a bag taken from a communal toilet on the ward. The trial also heard evidence about the reporting of incidents on the hospital computer system. Last year, Health Secretary Wes Streeting made damning remarks about NELFT at a conference of NHS leaders. \"I'm very aware of NELFT not least because NELFT has and continues to appear in the headlines for providing really poor quality care,\" he said. Ms Figueiredo's family visited her regularly in hospital, and repeatedly raised concerns about her care. The jury heard how her mother, Jane Figueiredo, wrote to managers warning: \"It is only a matter of time before there is a fatality on this ward.\" Campaigners believe Ms Figueiredo's death points to wider problems with mental health care. Deborah Coles, director of the charity Inquest, said: \"I hope that irrespective of the verdict, this will send shock waves and ensure that learning and change is an absolute priority.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Boy stabbed to death was 'funny, caring and hardworking', family say",
        "description": "A \"funny, caring and hardworking\" 14-year-old boy who was fatally stabbed in north Manchester has been named as Ibrahima Seck.",
        "url": "https://news.sky.com/story/boy-stabbed-to-death-was-funny-caring-and-hardworking-family-say-13381417",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ibrahima-seck-new-moston_6937848.jpg?20250609225531",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-09 20:45:00",
        "Headline": "Ibrahima Seck was found with stab wounds in New Moston after Greater Manchester Police were called to reports of a serious assault around 5pm on Sunday.",
        "Content": "A \"funny, caring and hardworking\" 14-year-old boy who was fatally stabbed in north Manchester has been named as Ibrahima Seck. Ibrahima was found with stab wounds in New Moston after Greater Manchester Police were called to reports of a serious assault around 5pm on Sunday. Despite the efforts of the emergency services and air ambulance staff, he died in hospital. In a statement released by Greater Manchester Police, the teenager's parents said: \"Ibrahima was a well-liked young boy. He was funny, caring, and hardworking. \"He was our best friend.\" They added: \"He was so smiley and always made everybody laugh. He was a good boy. \"Why would anyone do this to him? He does nothing wrong.\" Police have detained a 14-year-old boy on suspicion of murder after having arrested two boys aged 14 and 16 on suspicion of the same charge. A 14-year-old girl and a 37-year-old woman are being held on suspicion of assisting an offender. Ibrahima ran to a nearby house after being injured, according to the Manchester Evening News, and told the resident: \"I don't want to die.\" \"He just came through the door and said, 'I've been stabbed',\" they told the newspaper. \"We sat him down on a chair and phoned an ambulance. \"He just kept saying, 'I don't want to die'.\" Detective Chief Inspector Tony Platten said: \"Firstly, the force and I would like to pass on our condolences to Ibrahima's loved ones and we will continue to support them at this sad time. \"This incident that has seen a young boy sadly die has understandably rocked the local community in New Moston. \"We have made significant headway in the investigation which has seen us arrest another suspect on suspicion of murder, that takes the arrest total up to five and we are continuing with questioning those suspects today.\""
    },
    {
        "title": "Appleby Horse Fair: Major traveller community event leaves fields littered with rubbish",
        "description": "A major gathering of the travelling community has left fields covered in rubbish and debris.",
        "url": "https://news.sky.com/story/appleby-horse-fair-major-traveller-community-event-leaves-fields-littered-with-rubbish-13381129",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-appleby-horse-fair_6937449.jpg?20250609135601",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-09 10:21:00",
        "Headline": "Pictures and videos showed plastic bags, unwanted furniture, empty crates, and cardboard boxes strewn across the site in the town, but by Monday, a clean-up had begun.",
        "Content": " A major gathering of the travelling community has left fields covered in rubbish and debris. Pictures and videos published of the aftermath of the Appleby Horse Fair showed litter, including plastic bags, unwanted furniture, empty crates, and cardboard boxes strewn across the site in the east Cumbrian market town of Appleby-in-Westmoreland. On Monday, organisers published images of workers beginning to clean up. Politics latest: Winter fuel payments cut u-turn details later A handful of vehicles, including caravans, were visible, and fields had been churned up by tyres and turned into muddy tracks where people had driven across the area. Westmorland and Furness Council said its statement will include \"reactions to how this year's fair has gone and the efforts being made to ensure a swift and thorough clean-up. \"Waste management and street cleaning teams operate in Appleby and the outlying areas throughout the fair, including during this final phase,\" the council's communications and engagement manager, John Everingham said. A burnt-out white Ford transit van could also be seen following a fire on the Trade Field shortly before noon on Saturday, which police said they were not treating as suspicious. Cumbria Police said they attended, with firefighters and \"crews extinguishing the fire - which did not spread beyond the vehicle - by midday\". No one was injured, the force said. Pictures and videos published online over the weekend showed the van in flames. The fair is a week-long \"annual gathering of Gypsies and Travellers in the town of Appleby-in-Westmorland\" in early June, which draws around 10,000 Gypsies and Travellers and more than 30,000 other visitors, the event's official website said. Read more:'Pandemonium' in downtown LA1m more blood donors neededPremier Lg's first black ref dies The fair incorporates a range of activities, including horse riding, horse trading, storytelling, and traditional music and dance. Temporary litter bins are provided during the fair. Around 30 arrests were made before the fair began, police said, mostly for road offences. Appleby-in-Westmoreland is located between the Lake District National Park and the North Pennines and had a registered population of a little over 3,000 at the 2011 census."
    },
    {
        "title": "Author of The Day Of The Jackal Frederick Forsyth has died ",
        "description": "Frederick Forsyth, the author of The Day Of The Jackal, has died at the age of 86 after a brief illness, his literary agents Curtis Brown said.",
        "url": "https://news.sky.com/story/author-of-the-day-of-the-jackal-frederick-forsyth-has-died-13381346",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-the-day-of-the-jackal_6937710.jpg?20250609180116",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-09 16:48:00",
        "Headline": "The former RAF pilot and investigative journalist turned novelist was also known for his thrilling crime books The Fox, The Kill List and The Afghan.",
        "Content": " Frederick Forsyth, the author of The Day Of The Jackal, has died at the age of 86 after a brief illness, his literary agents Curtis Brown said. His book The Day Of The Jackal was turned into a 1973 film and last year a TV series on Sky Atlantic featuring Eddie Redmayne and Lashana Lynch. The best-selling author was surrounded by his family when he died on Monday morning, Curtis Brown added. Read more: Eddie Redmayne says preparing for role in film almost ended in disaster Forsyth, a former RAF pilot and investigative journalist turned novelist, was also known for his thrilling crime books The Fox, The Kill List and The Afghan. He was born in Ashford, Kent, in 1938 and joined the Royal Air Force in 1956 before leaving after two years to pursue a career in journalism. He covered international stories and the attempted assassination of French general Charles de Gaulle, which provided the inspiration for The Day Of The Jackal, which was published in 1971. In 2000, he became the first high-profile British writer to agree to publish a book exclusively on the internet. He revealed he had extensive involvement with MI6 in his 2015 memoir The Outsider: My Life In Intrigue. His agent Jonathan Lloyd said: \"We mourn the passing of one of the world's greatest thriller writers. \"Only a few weeks ago I sat with him as we watched a new and moving documentary of his life - In My Own Words, to be released later this year on BBC1 - and was reminded of an extraordinary life, well lived. \"After serving as one of the youngest ever RAF pilots, he turned to journalism, using his gift for languages in German, French and Russian to become a foreign correspondent in Biafra. \"Appalled at what he saw and using his experience during a stint as a secret service agent, he wrote his first and perhaps most famous novel, The Day Of The Jackal, and instantly became a global best-selling author. \"He went on to write more than 25 books (many of which were made into films) that have sold over 75 million copies. \"He will be greatly missed by his family, his friends, all of us at Curtis Brown and of course his millions of fans around the world - though his books will of course live on forever.\" The Day of the Jackal is available to watch on Sky Atlantic and NOW."
    },
    {
        "title": "Gaza-bound aid boat carrying Greta Thunberg and other activists brought to Israel",
        "description": "A Gaza-bound aid boat carrying Greta Thunberg and other activists has been brought to shore in Israel after being intercepted by the country's military.",
        "url": "https://news.sky.com/story/gaza-bound-aid-boat-carrying-greta-thunberg-and-other-activists-diverted-to-israel-13380969",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israel-greta-thunberg_6937767.png?20250609202434",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 01:12:00",
        "Headline": "Climate campaigner Ms Thunberg, 22, was one of a dozen activists aboard the Madleen, which set sail from Sicily on 1 May on a mission aiming to break Israel's sea blockade.",
        "Content": " A Gaza-bound aid boat carrying Greta Thunberg and other activists has been brought to shore in Israel after being intercepted by the country's military. Sharing an image of Thunberg, the Israel Foreign Ministry said the boat had docked in Ashdod Port \"a short while ago\" and that passengers were \"currently undergoing medical examinations to ensure they are in good health\". Early on Monday, the Israeli foreign ministry said that the British-flagged yacht Madleen - operated by the pro-Palestinian Freedom Flotilla Coalition (FFC) - \"was safely making its way to the shores of Israel\". The country's defence minister also said the Israeli military would show Thunberg and other activists onboard footage of the 7 October attacks by Hamas. According to the Times of Israel, he later said: \"Greta [Thunberg] and her flotilla companions were taken into a room upon their arrival for a screening of the horror film of the October 7 massacre, and when they saw what it was about, they refused to continue watching. \"The antisemitic flotilla members are turning a blind eye to the truth and have proven once again that they prefer the murderers to the murdered and continue to ignore the atrocities committed by Hamas against Jewish and Israeli women, adults, and children. Who are the passengers on the Madleen yacht? \"They should see the atrocities committed against women, the elderly, and children, and understand whom Israel is fighting to defend itself.\" He commended the IDF for its \"swift and safe takeover\" of the vessel, and said the Israeli military \"will continue its just and moral fight against the Hamas murderers until their defeat, the release of all hostages, and the full restoration of Israel's security\". Israel's foreign ministry said earlier that those aboard the Madleen \"are expected to return to their home countries\" and that the humanitarian aid aboard the ship would be transferred to Gaza through established channels. Ms Thunberg was \"safe and in good spirits\" while en route to Israel, the ministry added, while labelling the vessel \"the 'selfie yacht' of the 'celebrities'\". The FFC claimed the passengers on the yacht had been \"kidnapped by Israeli forces\" and released pre-recorded messages from them after previously saying that the \"Israeli army had boarded\" the vessel. Climate campaigner Ms Thunberg, 22, was one of a dozen activists aboard the Madleen, which set sail from Sicily on 1 June on a mission aiming to break Israel's sea blockade. In a statement later on Monday, Hamas condemned the detention of the Madleen crew, calling it a \"flagrant violation of international law\". The group also said: \"We salute the free solidarity activists of various nationalities who steadfastly confronted the threats and affirmed that Gaza is not alone.\" \"The detention of Madeleine (sic) will not silence the voices of the free,\" it added, \"nor will it halt the growing tide of global solidarity with Gaza\". Rima Hassan, a French member of the European Parliament, who is of Palestinian descent, was also on the boat. She has been barred from entering Israel because of her opposition to Israel's policies towards Palestinians. Ms Hassan wrote on X as the FFC's yacht was allegedly surrounded by other vessels: \"The crew of the Freedom Flotilla was arrested by the Israeli army in international waters around 2am.\" The diversion of the Madleen came after Mr Katz said that he had instructed the IDF to prevent the vessel from reaching the shore and to \"take whatever measures necessary\". Addressing Ms Thunberg and the other activists on Sunday, he said: \"You should turn back - because you will not reach Gaza.\" Israel started allowing some basic aid into Gaza last month after a three-month total blockade aimed at pressuring Hamas and preventing the group from importing arms. But humanitarian workers have warned of famine unless there is an end to the blockade and the 20-month war, which began after a Hamas-led assault on southern Israel on 7 October 2023, that killed more than 1,200 people. According to the Hamas-run Gaza Health Ministry, more than 54,000 Palestinians have been killed since the start of Israel's military campaign. Its figures do not differentiate between civilians and fighters.  An attempt last month by Freedom Flotilla to reach Gaza by sea failed after another of the group's vessels was attacked by two drones while sailing in international waters off Malta. The group blamed Israel for the attack, which damaged the front section of the ship. Read more from Sky News:Gazans pray in rubble at start of EidRussian troops 'reach new Ukrainian region'Soldier arrested on suspicion of raping woman Francesca Albanese, United Nations' special rapporteur on human rights in the Palestinian territories, also urged other boats to challenge the Gaza blockade. She said on social media: \"Madleen's journey may have ended, but the mission isn't over. \"Every Mediterranean port must send boats with aid & solidarity to Gaza.\""
    },
    {
        "title": "Trade war: US-China talks in London aim for widespread truce",
        "description": "Top US and Chinese officials are meeting in London on Monday in the hope of making further progress in easing the trade war between the world's two largest economies.",
        "url": "https://news.sky.com/story/trade-war-us-china-talks-in-london-aim-for-widespread-truce-13381010",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 06:04:00",
        "Headline": "The negotiations, at an undisclosed venue, follow a phone conversation between Donald Trump and his Chinese counterpart last week.",
        "Content": "Top US and Chinese officials are meeting in London on Monday in the hope of making further progress in easing the trade war between the world's two largest economies. The eyes of global financial market investors are firmly on the outcome of the discussions, given the damage already inflicted by the spat and wider US-led trade war. The US delegation is led by Treasury secretary Scott Bessent while China's vice premier He Lifeng - a respected negotiator at the top of the Chinese government - will represent his country. The venue has not been disclosed. Money latest: Why you probably should not book a hotel on your laptop It is hoped the talks will build on the preliminary agreement struck in Geneva that removed the effective trade embargo between the two nations. That deal amounted to a 90-day reduction in effective tariff rates above 100% to allow for further talks. A phone conversation between Donald Trump and his Chinese counterpart Xi Jinping last week set the scene for Monday's negotiations. Mr Trump later said that Xi had agreed to resume shipments to the US of rare earths minerals and magnets. They had been suspended by Beijing in response to Mr Trump's tariffs and were seen as an effective tool in getting the US to talk due to the havoc it inflicted on supply chains central to many American manufacturers - the very sector the US president is trying to bolster through his \"America first\" agenda. It emerged on Monday morning that Boeing had resumed shipments of planes to Chinese customers.  Mr Trump has described the status of the negotiations as \"very far advanced\" but China, in its own remarks, has been more critical of the US position. A Chinese government readout of the Trump-Xi conversation said the Chinese premier had told his US counterpart to back down from inflicting further hurt to the global economy. The trade war to date has damaged growth widely, with official US figures showing a sharp slowdown in the first quarter of the year - before the worst of the tariff regime had even been announced. Data out of China on Monday showed deflationary pressures had deepened as factory gate prices - an important signal on future price growth - slid further into negative territory during May as demand for goods continued to drag. Customs data had already showed that China's exports to the US - its biggest single market - slumped by 34.5% year-on-year during May in value terms. That was up from a 21% drop the previous month. Read more:Why Trump blinked in US-China trade warDiplomatic win for UK by hosting US-China talks White House spokeswoman Karoline Leavitt told Fox News: \"We want China and the United States to continue moving forward with the agreement that was struck in Geneva. \"The administration has been monitoring China's compliance with the deal, and we hope that this will move forward to have more comprehensive trade talks.\" A UK government spokesperson said of hosting the negotiations: \"We are a nation that champions free trade and have always been clear that a trade war is in nobody's interests, so we welcome these talks.\""
    },
    {
        "title": "NATO chief calls for 400% increase in air and missile defence to maintain credible deterrent",
        "description": "NATO needs a 400% increase in air and missile defence to maintain a credible deterrence, its secretary general has said in a speech in London.",
        "url": "https://news.sky.com/story/nato-chief-to-call-for-400-increase-in-air-and-missile-defence-to-maintain-credible-deterrent-13381012",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-rutte_6937612.jpg?20250609165042",
        "type": "World",
        "Author": "Faye Brown",
        "Date Published": "2025-06-09 06:16:00",
        "Headline": "Mark Rutte has called for a \"quantum leap\" in collective security amid expectations the alliance will agree to a 5% defence spending target at a summit later this month.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  NATO needs a 400% increase in air and missile defence to maintain a credible deterrence, its secretary general has said in a speech in London. Mark Rutte called for a \"quantum leap\" in collective security, warning threats facing the alliance \"will not disappear even when the war in Ukraine ends\". Politics Live: Ministers continue to battle over funds ahead of spending review It comes ahead of a summit in The Hague later this month, when the UK and its NATO allies are expected to agree to a Donald Trump-inspired pledge to spend 5% of GDP on defence and related areas. New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences 👉Search for The Wargame on your podcast app👈 Speaking at Chatham House, Mr Rutte said the investment plan is \"grounded in hard facts\". He said: \"The fact is, we need a quantum leap in our collective defence. The fact is, we must have more forces and capabilities to implement our defence plans in full. The fact is, danger will not disappear even when the war in Ukraine ends.\" Mr Rutte argued that in order to maintain credible deterrence and defence, NATO needs \"a 400% increase in air and missile defence\". \"We see in Ukraine how Russia delivers terror from above, so we will strengthen the shield that protects our skies,\" he said. \"Our militaries also need thousands more armoured vehicles and tanks, millions more artillery shells, and we must double our enabling capabilities, such as logistics, supply, transportation, and medical support.\" Mr Rutte also referred to countries other than Russia that pose a threat to the alliance and said: \"Russia has teamed up with China, North Korea and Iran. They are expanding their militaries and their capabilities. Putin's war machine is speeding up, not slowing down.\" He continued: \"In terms of ammunition, Russia produces in three months what the whole of NATO produces in a year, and its defence industrial base is expected to roll out 1,500 tanks, 3,000 armoured vehicles and 200 Iskander missiles this year alone. Russia could be ready to use military force against NATO within five years.\" Mr Rutte added: \"China is also modernising and expanding its military at breakneck speed. It already has the world's largest navy, and this battle force is expected to grow to 435 ships by 2030.\" On the threats against the alliance, he also warned: \"Wishful thinking will not keep us safe. We cannot dream away the danger. Hope is not a strategy. So NATO has to become a stronger, fairer and more lethal alliance.\"  Mr Rutte earlier met with Sir Keir Starmer and visited Sheffield Forgemasters with Defence Secretary John Healey. The prime minister has committed to spend 2.5% of gross domestic product (GDP) on defence from April 2027, with a goal of increasing that to 3% over the next parliament. Although the government's language has been cloudy on the 3% figure, describing it as an ambition rather than a commitment, Sky News understands the UK will in fact agree to increase defence spending to 3.5% of national income within a decade as part of Mr Rutte's push to rearm NATO and keep the US on side. Read More: Spending review 2025: What is it and what might Rachel Reeves announce? As reported by our security and defence editor Deborah Haynes, Sir Keir will also likely be forced to commit a further 1.5% of GDP to defence-related areas such as spy agencies and infrastructure. This would bolster total broader defence spending to 5%, in what is being described as the \"Hague investment plan\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 NATO countries have faced pressure from US President Donald Trump, who has repeatedly hit out at European allies for not spending enough on defence and taking advantage of American taxpayers. Speaking at Chatham House today, Mr Rutte said: \"Spending more (on defence) is not about pleasing an audience of one. This is about protecting one billion people.\" He added: \"America has carried too much of the burden for too long. America's allies have broad shoulders, and Europe and Canada will do more for our shared security. And that will be backed by America's rock solid commitment to NATO.\" The NATO plan to increase defence spending among its members comes as Sir Keir is facing pressure at home on where his priorities lie, with many of his own MPs wanting to see more funding on welfare. Chancellor Rachel Reeves will deliver her spending review on Wednesday, when health and defence are expected to be the winners in the process to allocate cash to government departments. Cuts to the Department of Work and Pensions have already been announced, but other unprotected departments like the Home Office and Department of Communities and Local Government could be braced for a real spending squeeze."
    },
    {
        "title": "Syrian contractor discovers ancient Byzantine tomb complex during construction ",
        "description": "A Syrian contractor made a historic discovery when clearing the rubble of a destroyed home, stumbling upon remains of an underground Byzantine tomb complex.",
        "url": "https://news.sky.com/story/syrian-contractor-discovers-ancient-byzantine-tomb-complex-during-construction-13381022",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-byzantine-syria_6937165.jpg?20250609074221",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 06:43:00",
        "Headline": "Believed to be more than 1,500 years old from the Byzantine Empire, the ruins were found in Maarat al-Numan in Idlib province, located on the route between the cities of Aleppo and Damascus.",
        "Content": "A Syrian contractor made a historic discovery when clearing the rubble of a destroyed home, stumbling upon remains of an underground Byzantine tomb complex. Believed to be more than 1,500 years old, the ruins were found in Maarat al-Numan in Idlib province, located on the route between the cities of Aleppo and Damascus. Residents there have been rebuilding their communities after the collapse of Bashar al Assad's regime last December. After the contractor found stone openings during a reconstruction project, locals contacted the authorities, who then dispatched a specialised team to inspect and secure the site. Images of the complex show that a pit next to a damaged building leads down to the openings of two burial chambers, each containing six stone tombs, with the sign of the cross etched into the top of one stone column. Hassan al Ismail, director of antiquities in Idlib, said that \"based on the presence of the cross and the pottery and glass pieces that were found, this tomb dates back to the Byzantine era\". Idlib \"has a third of the monuments of Syria, containing 800 archaeological sites in addition to an ancient city\", he said. The Byzantine Empire began in the 4th century AD, and was a continuation of the Roman Empire with its capital in Constantinople - now Istanbul in Turkey - and Christianity as its official religion. Ghiath Sheikh Diab, a resident who witnessed the moment when the complex was uncovered, told the Associated Press that under Assad, people in Syria who found archaeological ruins would cover them up over fears their properties would be seized under Assad. Read more from Sky News:Downtown LA is a scene of pandemonium and lawlessnessMan wrongly deported to El Salvador has been returned to USBritish soldier arrested on suspicion of raping woman in Kenya Another local, Abed Jaafar, said: \"In the old days, a lot of foreign tourists used to come to Maarat just to see the ruins. \"We need to take care of the antiquities and restore them and return them to the way they were before... and this will help to bring back the tourism and the economy.\""
    },
    {
        "title": "Elon Musk's father says his son and Donald Trump will patch things up after dramatic falling out",
        "description": "Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon.",
        "url": "https://news.sky.com/story/elon-musks-father-says-his-son-and-donald-trump-will-patch-things-up-after-dramatic-falling-out-13381348",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-errol-musk-elon-musk_6937741.jpg?20250609192301",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 16:53:00",
        "Headline": "Asked what he thought of the public spat, Errol Musk said: \"I was very surprised, I didn't expect anything like that.\"",
        "Content": " Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon. Errol Musk told Sky News' Moscow correspondent Ivor Bennett: \"It's like any argument. Everybody at some point says I'll never make up, but then they do later.\" It comes after the world's richest man said in a now-deleted tweet that the US president appears in files relating to the disgraced paedophile financier Jeffrey Epstein. The social media back-and-forth began when the Tesla and SpaceX CEO called Mr Trump's tax and spending bill a \"disgusting abomination\" days after abruptly leaving his position spearheading the Department of Government Efficiency (DOGE), saying it would add to US debts and threaten economic stability. \"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public,\" he tweeted. In a follow-up post he added: \"Mark this post for the future. The truth will come out.\" He gave no evidence for his claim, which the White House dismissed. The posts disappeared from his social media platform by Sunday. Asked what he thought of the public falling out, Errol Musk said: \"I was very surprised, I didn't expect anything like that.\" He said his son is \"somebody who sticks by his principles\" and \"doesn't like to be called out on anything\". He added: \"I don't think Elon would be concerned about whether he criticises Donald Trump or not.\" 'They'll come to an understanding' Mr Musk said his son and the president fell out over Mr Trump's bill, adding it was \"not going to save the country money\" and \"was going to cost the country even more money\". But he said: \"I think they'll come to an understanding in due course. Elon is standing by his principles that we must cut costs.\" Read more:Explosive row more terrifying than titillatingThe big, beautiful bust-up everyone knew was coming  Asked if they would make up, he said: \"Yes absolutely. They may not go back to exactly the same arrangement but they're certainly both on the same side of things so it's simply a matter of they should take notice of what Elon is saying and he should take notice of the needs that the government has.\" 👉 Follow Trump100 on your podcast app 👈 'We're sorting it out' He said the argument likely happened because of \"emotions welling out of hand\". \"They've had five months of intense day and night, hardly any sleep, and anybody who went through that would know your nerves are pretty much shredded after that time. \"And once they'd cleared the opposition and it was just the two of them left... they'd got to a point where it was just the two of them left so they had to start fighting with each other.\" He added: \"I'm not sure it will be a matter of going back into the White House, because he's not an elected president. But getting back on a normal footing, I would imagine very soon. Tomorrow maybe.\" Mr Musk said he had received a text from his son saying: \"Don't worry, we're sorting it out\". Mr Musk also said his son would like to cooperate with Russia \"in matters of space exploration\" - after the SpaceX CEO said his company would \"immediately\" begin decommissioning its Dragon spacecraft - the only US spacecraft available to deliver crew to and from the International Space Station - after Mr Trump threatened to cancel government contracts with Musk's businesses. It comes after Mr Trump told NBC he has no plans of making up with Musk. Asked if he thought his relationship with Musk was over, the president replied: \"I would assume so, yeah. I'm too busy doing other things.\""
    },
    {
        "title": "NATO chief's speech was meant as a call to arms, but it was also a shameful admission for the alliance",
        "description": "For all the stark warnings and ominous predictions made by the head of NATO today, one key fact remained unmentioned.",
        "url": "https://news.sky.com/story/nato-chiefs-speech-was-meant-as-a-call-to-arms-but-it-was-also-a-shameful-admission-for-the-alliance-13381382",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-rutte-nato-speech_6937580.jpg?20250609160501",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-09 19:11:00",
        "Headline": "The West is still funding the Russian war effort to the tune of billions by buying oil and gas, funnelling vast amounts into an economy that is now fully militarised.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  For all the stark warnings and ominous predictions made by the head of NATO today, one key fact remained unmentioned. The West is still funding the Russian war effort to the tune of billions by buying oil and gas, funnelling vast amounts into an economy that is now fully militarised. Russian gas exports to Europe went up by 20% last year and its LNG exports to the EU are now at record levels. Read more: NATO chief calls for 400% increase in air and missile defence Vladimir Putin's Russia is now making more money from selling fossil fuels than Ukraine receives from allies. NATO's secretary general Mark Rutte did not mention any of that. But he did spell out what Russia is doing with all that hydrocarbon revenue. It is using it to put its economy onto a war footing that is now pumping out munitions at a rate that puts the West to shame, to the extent Russia could have the capability to take on NATO in three to five years, according to Mr Rutte. New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences 👉Search for The Wargame on your podcast app👈 The secretary general meant his speech in London as a warning and call to arms. But it was also a shameful admission for the Western alliance he heads. More than three years into this war, Russia is outstripping the entire Western bloc by four to one in terms of munitions production.  Russia's economy is 1/25th that of NATO's combined economic might and crippled by sanctions and yet every three months pumps out more shells than the entire NATO bloc manages in a year. And while Europe carries on funding Russia's war effort by buying its oil and gas, none of that is going to change. We are now in the insane and obscene situation where European taxpayers will have to fork out more, a lot more, to counteract the threat of a militarised Russia, whose resurgence is being subsidised by Western countries buying its fossil fuels. Historians will look back on that and wonder why it was allowed to continue more than three years into this devastating conflict."
    },
    {
        "title": "Miguel Uribe Turbay: Colombian presidential hopeful still in critical condition after shooting",
        "description": "A Colombian senator hoping to be the country's next president remains in a critical condition and has shown little response to treatment after he was shot on Saturday, the hospital treating him has said.",
        "url": "https://news.sky.com/story/miguel-uribe-turbay-colombian-presidential-hopeful-still-in-critical-condition-after-shooting-13381243",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-miguel-uribe-turbay_6936711.jpg?20250608074024",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 13:14:00",
        "Headline": "The hospital treating 39-year-old Miguel Uribe Turbay described his condition as \"extremely serious\" and that the prognosis remained \"guarded\".",
        "Content": " A Colombian senator hoping to be the country's next president remains in a critical condition and has shown little response to treatment after he was shot on Saturday, the hospital treating him has said. Miguel Uribe Turbay, a member of the opposition right-wing Democratic Center Party, was shot in the head during a campaign event at a public park in the Fontibon neighbourhood of the Colombian capital Bogota. \"His condition is extremely serious,\" the Santa Fe Foundation hospital said in a statement today. \"Therefore, the prognosis remains guarded.\" The update came before the head of Colombia's national police said the 9mm pistol used in the attack was legally purchased in Arizona in the US. Authorities are investigating how it got into Colombia. The Attorney General's Office, which is investigating the shooting, said the 39-year-old senator suffered two gunshot wounds in the attack. \n                  Gaza-bound aid boat carrying Greta Thunberg and other activists brought to Israel\n                 \n                  Trade war: US-China talks in London aim for widespread truce\n                 \n                  NATO chief calls for 400% increase in air and missile defence to maintain credible deterrent\n                 The hospital had said on Sunday that Mr Uribe Turbay was in a critical condition and had procedures on his head and his left thigh. It added that he remained in intensive care as doctors sought to stabilise his condition. Meanwhile, a 15-year-old boy was arrested at the scene with a firearm. Police chief General Carlos Triana later said the teenage suspect was being treated for a leg injury. Attorney General Luz Adriana Camacho said on Monday that authorities have yet to interrogate the boy as he has been receiving medical care. However, she said that if the teenager were a gun-for-hire, he would likely have little information about the hirer's motive. Two other people were injured in the attack, but the nature of their injuries has not been made public. Mr Uribe Turbay's wife Maria Claudia Tarazona said on Sunday that he had survived an initial operation for his injuries but remained in intensive care. \"Miguel came out of surgery, he made it. Every hour is a critical hour. He fought his first battle, and it went well,\" Ms Tarazona told local media. \"This will take time.\" The couple are parents to a young son. Read more:Israel to screen 7 October attack footage to Greta ThunbergBritish soldier held on suspicion on raping woman in KenyaContractor discovers ancient tomb complex Mr Uribe Turbay, a right-wing politician from a prominent political family, announced earlier this year that he wanted to run for president and was vying to be his party's candidate in Colombia's presidential election in March 2026. It was unclear why he was targeted in the attack. He was polling well behind other party candidates at the time of the shooting. Mr Uribe's grandfather was president from 1978 to 1982, while his mother, journalist Diana Turbay, was kidnapped in 1990 by an armed group under the command of the late cartel leader Pablo Escobar. She was killed during a rescue operation in 1991. Bogota's mayor, Carlos Galan, whose own presidential candidate father was assassinated in 1989, addressed journalistsoutside the hospital overnight, saying he had asked for increased protection for all candidates in Bogota and for Mr Uribe's family. The government is offering a $730,000 (£540,000) reward for information, and President Gustavo Petro said the investigation will focus on who ordered the attack. \"For now, there is nothing more than a hypothesis,\" he said, adding that failures in security protocols would also be looked into. Mr Uribe Turbay was accompanied by a team of 21 people at the time of the shooting, his office said, including councilman Andres Barrios. His party described it as an \"unacceptable act of violence\", while US secretary of state Marco Rubio condemned it in the \"strongest possible terms\". Writing on X, Mr Rubio also urged Colombia's current president to \"dial back the inflammatory rhetoric and protect Colombian officials\"."
    },
    {
        "title": "Who is on board the 'diverted' Gaza aid boat with Greta Thunberg?",
        "description": "A boat of 12 activists - including Greta Thunberg - headed for Gaza has been diverted to Israel.",
        "url": "https://news.sky.com/story/who-is-on-board-the-diverted-gaza-aid-boat-with-greta-thunberg-13381035",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israel-gaza-greta-thunberg_6937253.jpg?20250609102200",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-09 07:16:00",
        "Headline": "The Madleen yacht has been diverted to Israel instead of its intended destination of Gaza. Those on board, including a journalist, doctor and climate activist Greta Thunberg, claim to have been \"kidnapped\".",
        "Content": " A boat of 12 activists - including Greta Thunberg - headed for Gaza has been diverted to Israel. The British-flagged yacht Madleen - operated by the pro-Palestinian Freedom Flotilla Coalition (FFC) - set sail from Italy on 1 May with an aim to break Israel's sea blockade and deliver aid to people in Gaza. But the Israeli foreign ministry said on Monday that the boat is instead \"safely making its way to the shores of Israel\". The ministry said all passengers were safe and unharmed, but the FFC claimed the yacht had been \"kidnapped by Israeli forces\". The coalition later released pre-recorded messages from them after previously saying that the \"Israeli army had boarded\" the vessel.  Who is on board? A politician, journalist and doctor are among those who have joined climate activist Ms Thunberg on the yacht. The 12 passengers - or volunteers as the FCC refers to them as - are from across the globe. Half of them are from France, while others are from Brazil, Germany, Spain, Turkey and the Netherlands. It was previously believed that Irish actor Liam Cunningham was going to be one of those on the Madleen, but the Game of Thrones actor has not been listed as a passenger. Rima Hassan is a French member of the European Parliament who is of Palestinian descent. She has been barred from entering Israel because of her opposition to Israeli policies toward the Palestinians. Baptiste Andre is a French doctor who is travelling with the group to assist passengers injured in potential confrontations with Israeli forces, according to Sky News' US partner network, NBC News. While Omar Faiad is a correspondent for Al Jazeera Mubasher, the first 24-hour Middle Eastern news channel. The full list of passengers includes: • Greta Thunberg - Sweden• Rima Hassan - France• Yasemin Acar - Germany• Baptiste Andre - France• Thiago Avila - Brazil• Omar Faiad - France• Pascal Maurieras - France• Yanis Mhamdi - France• Suayb Ordu - Turkey• Sergio Toribio - Spain• Mark van Rennes - Netherlands• Reva Viard - France Is the UK responsible for the yacht?  The FFC has said the UK government has a \"legal duty\" to protect the yacht and its crew and passengers as it is sailing under the British flag. In a post on X on 6 June, the coalition wrote: \"Under international law, the UK must: Prevent genocide, reject Israel's illegal blockade of Gaza, defend its flagged ship from unlawful attacks.\" After the boat was diverted by Israeli forces, Francesca Albanese, the United Nations special rapporteur on Palestine, also urged the UK government to intervene. Any vessel registered in the UK is defined as a British ship and is allowed to fly the Red Ensign flag - a red flag with the Union Jack in the top left-hand corner. The UK government typically provides support to vessels flying the Red Ensign, but there has been no comment from the UK Foreign Office on the Madleen, or official confirmation that it is a registered British ship. What happened to the last Freedom Flotilla? Last month, an attempt by the Freedom Flotilla to reach Gaza by sea failed after another of the group's vessels was attacked by two drones while sailing in international waters off Malta. The group blamed Israel for the attack, which damaged the front section of the ship. Read more:'The only people I've ever seen in Gaza with weapons are the IDF'Gaza marks start of Eid with outdoor prayers in rubble On Sunday, Israeli defence minister Israel Katz ordered the military to prevent the latest mission from reaching Gaza, calling the mission a propaganda effort in support of Hamas. Israel imposed a naval blockade on the coastal enclave after Hamas took control of Gaza in 2007. The blockade has remained in place through multiple conflicts, including the current war, which began after a Hamas-led assault on southern Israel on 7 October 2023."
    },
    {
        "title": "Downtown LA is a scene of pandemonium and lawlessness",
        "description": "A shirtless man waving a Mexican flag stands atop a burning car in the heart of Los Angeles, as another man throws a traffic cone into the flames and some play drums and shout chants in opposition to immigration officials.",
        "url": "https://news.sky.com/story/downtown-la-is-a-scene-of-pandemonium-and-lawlessness-13380988",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-los-angeles-protest_6937111.jpg?20250609052806",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-06-09 04:14:00",
        "Headline": "Critics of Donald Trump said the president's extraordinary decision to deploy National Guard troops, defying the wishes of the state's governor, had inflamed tensions and stoked emotions.",
        "Content": "\n          US correspondent\n              @marthakelner\n  A shirtless man waving a Mexican flag stands atop a burning car in the heart of Los Angeles, as another man throws a traffic cone into the flames and some play drums and shout chants in opposition to immigration officials. In the background, city hall can be glimpsed through a haze of thick black smoke. The downtown district of one of America's biggest cities was a scene of pandemonium and lawlessness as protests, which had previously been mainly peaceful, turned ugly. Critics of Donald Trump said the president's extraordinary decision to deploy National Guard troops, defying the wishes of the state's governor, had inflamed tensions and stoked emotions. The 101 Freeway, the main highway cutting through the downtown area, was also closed down for much of the day as police and protesters faced off, with flash bang devices sending some people scattering. Bottles and other projectiles were hurled towards police, who responded by using tear gas and rubber bullets. It was this chaos, his critics say, that Donald Trump wanted to provoke. \n                  What we know about the Los Angeles immigration raids and protests\n                 \n                  Los Angeles live: 700 marines to be deployed - as thousands of troops 'given no food or water'\n                 \n                  Trump seizes opportunity to deploy federal force in California\n                 Trump's decision to call in 2,000 National Guard troops, several hundred of whom were on the streets of LA on Sunday, was taken without consultation with the California governor and LA mayor, and marked an extraordinary escalation by the president. The military arrived on Sunday morning and was ordered to guard federal buildings, after two days of protest against Immigration and Customs Enforcement (ICE) officers. As part of Trump's closed border policy, ICE has been ordered to find, detain and deport as many illegal immigrants as possible, and it was these raids that stoked the first signs of protest on Friday into the weekend. By midday Sunday, the military was surrounded by protesters outside the Metropolitan Detention Centre in downtown LA. It was here that many immigrants had been held before being shipped off to detention facilities. The walls and floors are covered in expletive-ridden graffiti, reading f*** ICE.  The Los Angeles police soon split the crowd and drove a wedge between the National Guard and the crowd. California Governor Gavin Newsom has called Donald Trump's acts those of a \"dictator, not a president\". He's formally requested that the Trump administration withdraw the National Guard. The White House say the military will remain there until order is restored. Five hundred marines are still on standby. Los Angeles Police Department police chief Jim McDonnell, asked whether the National Guard was needed, said: \"This thing has gotten out of control.\" He said that although the LAPD would not initially have requested assistance from the National Guard, the disorder had caused him to reevaluate his assessment. Several people were arrested. Sky News witnessed a young woman, who called herself Gabriella, riding her motorbike at speed towards a line of police officers. Read more from Sky News:Analysis: Trump deploys federal force in LATrump claims CA officials 'can't do their jobs' One of the police officers used his arm to push her off the bike. She said she was protesting because her \"people were being rounded up.\" Politicians on both sides of the aisle condemned the violence, but some vehemently disagreed about what actions led to the escalation."
    },
    {
        "title": "Elon Musk's father says his son and Donald Trump will patch things up after dramatic falling out",
        "description": "Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon.",
        "url": "https://news.sky.com/story/elon-musks-father-says-his-son-and-donald-trump-will-patch-things-up-after-dramatic-falling-out-13381348",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-errol-musk-elon-musk_6937741.jpg?20250609192301",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 16:53:00",
        "Headline": "Asked what he thought of the public spat, Errol Musk said: \"I was very surprised, I didn't expect anything like that.\"",
        "Content": " Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon. Errol Musk told Sky News' Moscow correspondent Ivor Bennett: \"It's like any argument. Everybody at some point says I'll never make up, but then they do later.\" It comes after the world's richest man said in a now-deleted tweet that the US president appears in files relating to the disgraced paedophile financier Jeffrey Epstein. The social media back-and-forth began when the Tesla and SpaceX CEO called Mr Trump's tax and spending bill a \"disgusting abomination\" days after abruptly leaving his position spearheading the Department of Government Efficiency (DOGE), saying it would add to US debts and threaten economic stability. \"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public,\" he tweeted. In a follow-up post he added: \"Mark this post for the future. The truth will come out.\" He gave no evidence for his claim, which the White House dismissed. The posts disappeared from his social media platform by Sunday. Asked what he thought of the public falling out, Errol Musk said: \"I was very surprised, I didn't expect anything like that.\" He said his son is \"somebody who sticks by his principles\" and \"doesn't like to be called out on anything\". He added: \"I don't think Elon would be concerned about whether he criticises Donald Trump or not.\" 'They'll come to an understanding' Mr Musk said his son and the president fell out over Mr Trump's bill, adding it was \"not going to save the country money\" and \"was going to cost the country even more money\". But he said: \"I think they'll come to an understanding in due course. Elon is standing by his principles that we must cut costs.\" Read more:Explosive row more terrifying than titillatingThe big, beautiful bust-up everyone knew was coming  Asked if they would make up, he said: \"Yes absolutely. They may not go back to exactly the same arrangement but they're certainly both on the same side of things so it's simply a matter of they should take notice of what Elon is saying and he should take notice of the needs that the government has.\" 👉 Follow Trump100 on your podcast app 👈 'We're sorting it out' He said the argument likely happened because of \"emotions welling out of hand\". \"They've had five months of intense day and night, hardly any sleep, and anybody who went through that would know your nerves are pretty much shredded after that time. \"And once they'd cleared the opposition and it was just the two of them left... they'd got to a point where it was just the two of them left so they had to start fighting with each other.\" He added: \"I'm not sure it will be a matter of going back into the White House, because he's not an elected president. But getting back on a normal footing, I would imagine very soon. Tomorrow maybe.\" Mr Musk said he had received a text from his son saying: \"Don't worry, we're sorting it out\". Mr Musk also said his son would like to cooperate with Russia \"in matters of space exploration\" - after the SpaceX CEO said his company would \"immediately\" begin decommissioning its Dragon spacecraft - the only US spacecraft available to deliver crew to and from the International Space Station - after Mr Trump threatened to cancel government contracts with Musk's businesses. It comes after Mr Trump told NBC he has no plans of making up with Musk. Asked if he thought his relationship with Musk was over, the president replied: \"I would assume so, yeah. I'm too busy doing other things.\""
    },
    {
        "title": "What we know about the Los Angeles immigration raids and protests",
        "description": "Tensions in Los Angeles are escalating after Donald Trump deployed hundreds of National Guard troops to tackle protests against his administration's crackdown on illegal immigration.",
        "url": "https://news.sky.com/story/what-we-know-about-the-los-angeles-immigration-raids-and-protests-13381055",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-la-los-angeles-us-protest_6937170.jpg?20250609075614",
        "type": "US",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-06-09 08:09:00",
        "Headline": "Demonstrations broke out in southern California after federal agents carried out raids across Los Angeles, arresting more than a hundred suspected illegal immigrants.",
        "Content": "By Dylan Donnelly, news reporter   Tensions in Los Angeles are escalating after Donald Trump deployed hundreds of National Guard troops to tackle protests against his administration's crackdown on illegal immigration. Writing on Truth Social on Sunday evening as protesters clashed with federal officers, the US president said: \"Looking really bad in L.A. BRING IN THE TROOPS!!!.\" More than 100 suspected illegal immigrants have been detained in the city by federal officers after three days of demonstrations.  How did the protests start? Demonstrations broke out in southern California after federal agents from Immigration and Customs Enforcement (ICE), the Department of Homeland Security (DHS), the FBI, and the Drug Enforcement Administration (DEA) carried out raids across Los Angeles. Two Home Depots and a clothing wholesaler were among the locations targeted, with workers suspected of being illegal immigrants detained. Over the weekend, the DHS said ICE arrested 118 immigrants in LA, including 44 people on Friday. Read more: Downtown LA is a scene of pandemonium and lawlessness  The first protests broke out on Friday at the sites of the raids in downtown Los Angeles, before spreading on Saturday to Paramount - a heavily Latino city south of LA - and neighbouring Compton. Crowds tried to stop federal agents from driving away by throwing bins at vehicles and blocking the roads. Since taking office for the second time in January, Mr Trump has signed several executive orders on the mass deportation of immigrants. He's pledged to deport record numbers of people who have entered the country illegally and lock down the US-Mexico border, setting ICE a goal of arresting at least 3,000 migrants a day. As a result, raids have ramped up, with several being reported across the US this year.  Why did Trump deploy the National Guard? On Saturday, Mr Trump ordered the deployment of at least 2,000 National Guard troops to LA - invoking a legal provision allowing him to deploy federal service members when there is \"a rebellion or danger of a rebellion against the authority\" of the US government. California Governor Gavin Newsom called Mr Trump's order \"purposefully inflammatory\" and warned it would \"only escalate tensions\", before adding the deployment was \"the wrong mission and will erode public trust\".  The National Guard was deployed specifically to protect federal buildings, including a downtown detention centre where protesters had gathered. According to the Brennan Center for Justice, the last time the National Guard was deployed without a governor's permission was in 1965, when President Lyndon B. Johnson sent troops to protect a civil rights march in Alabama. Mr Trump wrote on his Truth Social platform on Saturday: \"If Governor Gavin Newscum, of California, and Mayor Karen Bass, of Los Angeles, can't do their jobs, which everyone knows they can't, then the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved!!!\" Read more:Trump's immigration crackdown has changed livesTrump seizes opportunity to deploy federal force in CaliforniaTrump's new travel ban: The notable countries omitted  What's been happening since then? Sunday's protests were the most fierce yet. In the morning, troops carrying long guns and riot shields faced off with protesters who shouted \"shame\" and \"go home\". After some approached the National Guard members, another set of uniformed officers advanced on the group, shooting smoke-filled canisters into the street. Minutes later, the Los Angeles Police Department fired rounds of crowd-control munitions to disperse the protesters. As it happened: Photographer has emergency surgery after being hit by non-lethal bullet Much of the group then moved to block traffic on the 101 Freeway until state patrol officers cleared them by late afternoon. Around 300 National Guard troops were deployed to three separate locations, according to US Northern Command. Los Angeles Police Chief Jim McDonnell said later that officers were \"overwhelmed\" by the remaining protesters, and claimed the group included regular agitators who show up at demonstrations to cause trouble. Several dozen people have been arrested throughout the weekend, with one detained on Sunday for throwing a Molotov cocktail at police, and another for ramming a motorcycle into a line of officers. What has the reaction been? Mr Newsom has since formally requested that the Trump Administration \"rescind their unlawful deployment of troops in Los Angeles county and return them to my command\". He said: \"We didn't have a problem until Trump got involved. This is a serious breach of state sovereignty - inflaming tensions while pulling resources from where they're actually needed. \"Rescind the order. Return control to California.\" In an interview with MSNBC, Mr Newsom added he planned to sue the administration over the deployment. Mayor Bass urged Los Angeles residents: \"Don't engage in violence and chaos... Don't give the administration what they want.\" However, Stephen Miller, White House deputy chief of staff and a political adviser to Mr Trump, described the city as \"occupied territory\" and accused the mayor of taking \"sides with the criminal invaders and rioters over the federal law enforcement officers\". In other social media posts, he called the demonstrations an \"insurrection\" and said: \"We will take back America.\" Vice president JD Vance said: \"Insurrectionists carrying foreign flags are attacking immigration enforcement officers, while one half of America's political leadership has decided that border enforcement is evil.\" He then called for the president's One Big Beautiful Bill Act - a budget reconciliation bill that also boosts Border Patrol and ICE agents - to be passed by the Senate."
    },
    {
        "title": "Sly Stone, pioneer of early funk music, dies after 'prolonged' battle with illness",
        "description": "Sly Stone, one of the pioneers of funk music, has died aged 82, his family have said.",
        "url": "https://news.sky.com/story/sly-stone-pioneer-of-early-funk-music-dies-after-prolonged-battle-with-illness-13381391",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sly-stone-funk_6937810.jpg?20250609213526",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 19:55:00",
        "Headline": "The musician played a leading role in introducing funk, an Afrocentric style of music driven by grooves and syncopated rhythms, to a broader audience through his band Sly And The Family Stone.",
        "Content": "Sly Stone, one of the pioneers of funk music, has died aged 82, his family have said. As front man for his band Sly And The Family Stone, the musician fused soul, rock, psychedelia and gospel to take the sound that defined an era in the 1960s into new territory, second only to James Brown as an early founder. Several of the band's seminal tracks became known to a wider audience when they were subsequently sampled by hip hop artists. \"Everyday People\" was sampled by Arrested Development, while \"Sing A Simple Song\" was sampled by Public Enemy, De La Soul and Dr Dre and Snoop Dogg. Stone's family said in a statement that he died after a battle with chronic obstructive pulmonary disease (COPD) and other health issues. A statement issued by his publicist on behalf of Stone's family said: \"It is with profound sadness that we announce the passing of our beloved dad, Sly Stone of Sly And The Family Stone. \"After a prolonged battle with COPD and other underlying health issues, Sly passed away peacefully, surrounded by his three children, his closest friend, and his extended family. \"While we mourn his absence, we take solace in knowing that his extraordinary musical legacy will continue to resonate and inspire for generations to come. \"Sly was a monumental figure, a groundbreaking innovator, and a true pioneer who redefined the landscape of pop, funk, and rock music. His iconic songs have left an indelible mark on the world, and his influence remains undeniable. \"In a testament to his enduring creative spirit, Sly recently completed the screenplay for his life story, a project we are eager to share with the world in due course, which follows a memoir published in 2024. \"We extend our deepest gratitude for the outpouring of love and prayers during this difficult time. We wish peace and harmony to all who were touched by Sly's life and his iconic music. \"Thank you from the bottom of our hearts for your unwavering support.\" Stone, born Sylvester Stewart in Texas, and his group, were regulars on the US music charts in the late 1960s and 1970s, with hits such as \"Dance to the Music,\" \"I Want To Take You Higher,\" \"Family Affair,\" \"If You Want Me to Stay,\" and \"Hot Fun in the Summertime\". He played a leading role in introducing funk, an Afrocentric style of music driven by grooves and syncopated rhythms, to a broader audience. James Brown had forged the elements of funk before Stone founded his band in 1966, but Stone's brand of funk drew new listeners. It was celebratory, eclectic, psychedelic and rooted in the counterculture of the late 1960s. However, Stone later fell on hard times and became addicted to cocaine, never staging a successful comeback. His music became less joyous in the 1970s, reflecting the polarisation of the country after opposition to the Vietnam War and racial tensions triggered unrest on college campuses and in African-American neighbourhoods in big US cities. Read more:Baldoni's defamation claim dismissedThe Day Of The Jackal author diesSnoop Dogg hopes to open burger van In 1971, Sly And The Family Stone released \"There's a Riot Goin' On,\" which became the band's only Number 1 album. Critics said the album's bleak tone and slurred vocals denoted the increasing hold of cocaine on Stone. But some called the record a masterpiece, a eulogy to the 1960s. In the early 1970s, Stone became erratic and missed shows. Some members left the band. But the singer was still a big enough star in 1974 to attract a crowd of 21,000 for his wedding to actress and model Kathy Silva at Madison Square Garden in New York. Ms Silva filed for divorce less than a year later. Sly And The Family Stone's album releases in the late 1970s and early 1980s flopped, as Stone racked up drug possession arrests. The band was inducted into the Rock & Roll Hall of Fame in 1993 and Stone was celebrated in an all-star tribute at the Grammy Awards in 2006. He sauntered on stage with a blond mohawk haircut but bewildered the audience by leaving mid-song. In 2011, after launching what would become a years-long legal battle to claim royalties he said were stolen, Stone was arrested for cocaine possession. That year, media reported Stone was living in a recreational vehicle parked on a street in South Los Angeles. Stone had a son, Sylvester, with Ms Silva. He had two daughters, Novena Carmel, and Sylvette \"Phunne\" Stone, whose mother was bandmate Cynthia Robinson."
    },
    {
        "title": "Trade war: US-China talks in London aim for widespread truce",
        "description": "Top US and Chinese officials are meeting in London on Monday in the hope of making further progress in easing the trade war between the world's two largest economies.",
        "url": "https://news.sky.com/story/trade-war-us-china-talks-in-london-aim-for-widespread-truce-13381010",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 06:04:00",
        "Headline": "The negotiations, at an undisclosed venue, follow a phone conversation between Donald Trump and his Chinese counterpart last week.",
        "Content": "Top US and Chinese officials are meeting in London on Monday in the hope of making further progress in easing the trade war between the world's two largest economies. The eyes of global financial market investors are firmly on the outcome of the discussions, given the damage already inflicted by the spat and wider US-led trade war. The US delegation is led by Treasury secretary Scott Bessent while China's vice premier He Lifeng - a respected negotiator at the top of the Chinese government - will represent his country. The venue has not been disclosed. Money latest: Why you probably should not book a hotel on your laptop It is hoped the talks will build on the preliminary agreement struck in Geneva that removed the effective trade embargo between the two nations. That deal amounted to a 90-day reduction in effective tariff rates above 100% to allow for further talks. A phone conversation between Donald Trump and his Chinese counterpart Xi Jinping last week set the scene for Monday's negotiations. Mr Trump later said that Xi had agreed to resume shipments to the US of rare earths minerals and magnets. They had been suspended by Beijing in response to Mr Trump's tariffs and were seen as an effective tool in getting the US to talk due to the havoc it inflicted on supply chains central to many American manufacturers - the very sector the US president is trying to bolster through his \"America first\" agenda. It emerged on Monday morning that Boeing had resumed shipments of planes to Chinese customers.  Mr Trump has described the status of the negotiations as \"very far advanced\" but China, in its own remarks, has been more critical of the US position. A Chinese government readout of the Trump-Xi conversation said the Chinese premier had told his US counterpart to back down from inflicting further hurt to the global economy. The trade war to date has damaged growth widely, with official US figures showing a sharp slowdown in the first quarter of the year - before the worst of the tariff regime had even been announced. Data out of China on Monday showed deflationary pressures had deepened as factory gate prices - an important signal on future price growth - slid further into negative territory during May as demand for goods continued to drag. Customs data had already showed that China's exports to the US - its biggest single market - slumped by 34.5% year-on-year during May in value terms. That was up from a 21% drop the previous month. Read more:Why Trump blinked in US-China trade warDiplomatic win for UK by hosting US-China talks White House spokeswoman Karoline Leavitt told Fox News: \"We want China and the United States to continue moving forward with the agreement that was struck in Geneva. \"The administration has been monitoring China's compliance with the deal, and we hope that this will move forward to have more comprehensive trade talks.\" A UK government spokesperson said of hosting the negotiations: \"We are a nation that champions free trade and have always been clear that a trade war is in nobody's interests, so we welcome these talks.\""
    },
    {
        "title": "Judge dismisses Justin Baldoni's defamation claim against former co-star Blake Lively",
        "description": "A judge in the US has dismissed actor Justin Baldoni's $400m (&#163;295m) defamation lawsuit against his It Ends With Us co-star Blake Lively.",
        "url": "https://news.sky.com/story/judge-dismisses-justin-baldonis-defamation-claim-against-former-co-star-blake-lively-13381365",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-blake-lively-justin-baldoni_6783204.jpg?20241222130409",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 18:03:00",
        "Headline": "The judge's decision is the latest development in the legal battle between the It Ends With US co-stars, which includes Lively suing Baldoni in December.",
        "Content": "A judge in the US has dismissed actor Justin Baldoni's $400m (£295m) defamation lawsuit against his It Ends With Us co-star Blake Lively. Baldoni filed the countersuit against the 37-year-old in response to her launching legal action in December, accusing him of sexual harassment against her while filming the 2024 movie. The 41-year-old and production company Wayfarer Studios countersued in January for $400m, accusing Lively and her husband, \"Deadpool\" actor Ryan Reynolds, their publicist, the New York Times, and others of orchestrating a smear campaign to extort him. He accused Lively of trying to \"hijack\" the movie and then blaming him when her \"disastrous\" promotional approach prompted an online backlash against her. \"It Ends With Us\" garnered mixed reviews, but grossed more than $351m (£259m) worldwide, according to reports. In a statement, lawyers representing Lively said: \"Today's opinion is a total victory and a complete vindication for Blake Lively, along with those that Justin Baldoni and the Wayfarer Parties dragged into their retaliatory lawsuit, including Ryan Reynolds, Leslie Sloane and The New York Times. \"As we have said from day one, this '$400 million' lawsuit was a sham, and the court saw right through it. \"We look forward to the next round, which is seeking attorneys' fees, treble damages and punitive damages against Baldoni, Sarowitz, Nathan, and the other Wayfarer Parties who perpetrated this abusive litigation.\" Sky News has approached Baldoni's representatives for comment. US District Court Judge Lewis Liman has ruled that Baldoni can't sue Lively for defamation over claims she made in her lawsuit, because allegations made in a lawsuit are exempt from libel claims. The judge also dismissed Baldoni's defamation lawsuit against The New York Times, which had reported on Lively's sexual harassment allegations. Read more:Lively and Baldoni's lawyers told to stop discussing casesAmber Heard reacts to Lively's complaint about Baldoni  Mr Liman also ruled that Baldoni's claims that Lively stole creative control of the film didn't count as extortion under California law. Baldoni's legal team can revise the lawsuit if they want to pursue different claims related to whether Lively breached a contract, the judge said. \"It Ends With Us,\" an adaptation of Colleen Hoover's bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August last, exceeding box office expectations with a $50m (£37m) debut. But the movie's release was shrouded by speculation over discord between Lively and Baldoni."
    },
    {
        "title": "Q&A: Musk and Trump's bust-up, the 'Big Beautiful Bill' and the Biden investigation",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/qa-musk-and-trumps-bust-up-the-big-beautiful-bill-and-the-biden-investigation-13380200",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/sky-news-trump-100-saudi-arabia_6913749.jpg?20250519065442",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 04:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Our US correspondents Mark Stone and David Blevins answer your listener questions.  They discuss the very public breakdown in relations between Donald Trump and Elon Musk, the president's \"Big Beautiful Bill\", and if it is fair for Trump to investigate Joe Biden. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Androids rom-com Maybe Happy Ending wins six major Tony Awards",
        "description": "Maybe Happy Ending, a romantic-comedy about a pair of androids falling in love, has won six Tony Awards, including best new musical.",
        "url": "https://news.sky.com/story/androids-rom-com-maybe-happy-ending-wins-six-major-tony-awards-13381099",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-darren-criss-tony-awards_6937326.jpg?20250609120439",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 09:35:00",
        "Headline": "The acclaimed Broadway production was one of the night's big winners, while other top prizes saw Kara Young become the first black person to win two awards consecutively.",
        "Content": "Maybe Happy Ending, a romantic-comedy about a pair of androids falling in love, has won six Tony Awards, including best new musical. The story charts the relationship between two decommissioned robots, becoming a commentary on human themes and the passage of time. Starring Darren Criss and Helen J Shen, Maybe Happy Ending enjoyed huge success at the 78th annual ceremony held at the Radio City Music Hall in New York on Sunday. The acclaimed Broadway production's awards also included Criss winning best leading actor in a musical, alongside prizes for best direction of a musical, best original theatre score, best book of a musical, and best scenic design of a musical. In other awards, Purpose, Branden Jacobs-Jenkins' drawing room drama about an accomplished black family exposing hypocrisy and pressures during a snowed-in gathering, won best new play. Jacobs-Jenkins becomes the first black playwright to win the award since August Wilson took home the accolade in 1987 for Fences. It underlines a triumphant year for Jacobs-Jenkins after scooping the Pulitzer Prize for Purpose - and winning back-to-back Tonys after his Appropriate won best play revival in 2024. Kara Young - the first black female actor to be nominated for a Tony in four consecutive years - became the first black person to win two awards consecutively, picking up the trophy for featured actress in a play for her work in Purpose. Sunset Blvd won best musical revival, handing composer Andrew Lloyd Webber his first competitive Tony since 1995, when the original show won. The current version is a stripped-down, minimalist production. Sarah Snook took home the trophy for leading actress in a play for her tireless work in The Picture Of Dorian Gray, where she plays all 26 roles. \"I don't feel alone any night that I do this show,\" Snook said, dismissing the idea of her play as a one-woman show. \"There are so many people onstage making it work and behind the stage making it work.\" Oh Mary! saw Sam Pinkleton win best director and Cole Escola landing best actor in a play. Francis Jue won best actor in a featured role in a play for his work in a revival of Yellow Face. Jak Malone won best actor in a featured role in a musical for the British import, Operation Mincemeat: A New Musical. Read more from Sky News:NHS issues appeal for regular blood donorsFirst black Premier League referee dies  Eureka Day, Jonathan Spector's social satire about well-meaning liberals debating a school's vaccine policy, won the best play revival trophy. Stranger Things: The First Shadow - based on the 12-time Emmy-winning Netflix hit sci-fi series, won best scenic design, lighting design and sound design of a play. The production, which has been running in London's West End, also picked up a special award for its illusions and technical effects."
    },
    {
        "title": "Ed the escaped zebra recaptured, Tennessee officials say",
        "description": "A runaway zebra that became an internet sensation has been safely recaptured, US officials have said.",
        "url": "https://news.sky.com/story/ed-the-escaped-zebra-recaptured-tennessee-officials-say-13381197",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tennessee-ed-zebra_6937460.jpg?20250609140814",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-09 11:55:00",
        "Headline": "Ed, who was on the loose for more than a week, was spotted several times and his adventures sparked a host of memes, including pictures of him eating waffles, visiting other Tennessee cities and begging on the side of the road.",
        "Content": "A runaway zebra that became an internet sensation has been safely recaptured, US officials have said. Ed the pet zebra was on the loose for more than a week before being found in a pasture in Christiana, a small community in central Tennessee, the Rutherford County Sheriff's Office said on Facebook. In a statement, the office said that Ed \"was airlifted and flown by helicopter back to a waiting animal trailer\" on Sunday.  A video posted by the sheriff's office showed Ed caught in a net with his head sticking out as he was carried by helicopter to an animal trailer. Ed originally arrived in Christiana, which is around 40 miles southeast of Nashville, on 30 May, but his owner reported him missing the next day. During his time on the run, Ed was seen on Interstate 24 - a major route which runs from southern Illinois to southern Tennessee - \"scampering across the highways in both the eastbound and westbound lanes\". But before he could be grabbed, \"he escaped into a wooded area and disappeared until being spotted Thursday,\" the sheriff's office said. There were several sightings of him posted to social media, among them Ed trotting around a local neighbourhood.  His adventures sparked a host of memes, including Ed eating waffles, a southern US favourite, while others had him visiting other Tennessee cities or begging on the side of the road. Read more:'Pandemonium' in downtown LA1m more blood donors neededPremier Lg's first black ref dies Ed's 15 minutes of fame came a month after a runaway kangaroo shut down a section of a different Interstate in Alabama, inadvertently causing a two-car crash, before being caught. The sheriff's office thanked the Tennessee Highway Patrol and Tennessee Wildlife Resources Agency for their help in the \"successful rescue\"."
    },
    {
        "title": "Winter Fuel payments to extend to pensioners on incomes of £35,000 or less ",
        "description": "Winter fuel payments will extend to everyone over the state pension age with an income of or below &#163;35,000 a year, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/winter-fuel-payments-to-extend-to-pensioners-on-incomes-of-16335000-or-less-13381132",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-ons-inflation_6922901.jpg?20250521080019",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-06-09 10:29:00",
        "Headline": "The Treasury said the change will cost around £1.25bn in England and Wales but still save £450m from when the universal system had been in place.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Winter fuel payments will extend to everyone over the state pension age with an income of or below £35,000 a year, Chancellor Rachel Reeves has announced. The Treasury said the change will cost around £1.25bn in England and Wales but still save £450m from when the universal allowance was in place. Politics Live: Chancellor makes winter fuel announcement  Dropping the benefit for all pensioners was one of the first things Labour did in government, despite it not being in their manifesto. The change meant only those on pension credit or other benefits were eligible - a deeply unpopular move that was widely blamed on the party's poor performance in May's local elections. Ms Reeves said: \"Targeting winter fuel payments was a tough decision, but the right decision because of the inheritance we had been left by the previous government. \"It is also right that we continue to means-test this payment so that it is targeted and fair, rather than restoring eligibility to everyone, including the wealthiest. \"But we have now acted to expand the eligibility of the winter fuel payment so no pensioner on a lower income will miss out.\" The government signalled its intention to widen eligibility last month, but no detail was given on what the new threshold might look like. The lack of clarity threatened to overshadow Ms Reeves' spending review on Wednesday, when she will set out what funding has been allocated to each government department over the next three years. The chancellor repeatedly faced questions on winter fuel during a speech in Manchester last week to promote a  £15.6bn funding settlement for local transport projects, when she said changes would be in place for this winter. However, ministers still could not give further detail, with science secretary Peter Kyle telling Sunday Morning with Trevor Phillips that the new eligibility would be set out \"in the run up to the autumn\". It is still not clear how the new policy will be funded, with the costs to be accounted for in the autumn budget. Asked by Sky News' deputy political editor Sam Coates if the change is a signal to markets that she can't say no to her MPs, Ms Reeves said after her spending review \"markets and the public will be able to see public services living within their means\". 'Humiliating U-turn' Tory leader Kemi Badenoch said: \"Keir Starmer has scrambled to clear up a mess of his own making. I repeatedly challenged him to reverse his callous decision to withdraw winter fuel payments, and every time Starmer arrogantly dismissed my criticisms. \"This humiliating U-turn will come as scant comfort to the pensioners forced to choose between heating and eating last winter. The prime minister should now apologise for his terrible judgement.\" The Treasury said that by setting the threshold at an income of £35,000, over three-quarters of pensioners - around nine million people - will benefit. The universal system meant some 11.4 million pensioners were in receipt of the benefit, which was slashed down to 1.5 million when the initial means-test was brought in. The new threshold is above the income level of pensioners in poverty and broadly in line with average earnings, the Treasury said. No pensioner will need to take any action as they will automatically receive the payment this winter."
    },
    {
        "title": "Tobacco giant BAT launches quest to smoke out next chairman",
        "description": "The FTSE-100 cigarette-maker British American Tobacco (BAT) is preparing to kick off the search for a new chairman.",
        "url": "https://news.sky.com/story/tobacco-giant-bat-launches-quest-to-smoke-out-next-chairman-13381225",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-globe-house-british-american-tobacco_6937433.jpg?20250609134209",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-09 12:35:00",
        "Headline": "The FTSE-100 owner of Dunhill and Lucky Strike is selecting headhunters to help identify a successor to Luc Jobin, its chairman since 2021, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The FTSE-100 cigarette-maker British American Tobacco (BAT) is preparing to kick off the search for a new chairman. Sky News has learnt that the owner of Dunhill and Lucky Strike is in the process of picking headhunters to help identify a successor to Luc Jobin. Mr Jobin, a Canadian business veteran, has only chaired BAT since 2021. He has, however, been on its board since 2017, meaning he faces being 'timed out' by the middle of next year under UK corporate governance guidelines which state that directors are no longer deemed independent if they have served for more than nine years. The search for his successor is not expected to conclude until later this year or early 2026, according to insiders. With a market capitalisation of over £77bn, BAT remains one of the largest companies listed on the London Stock Exchange. It reported half-year results last week showing that full-year revenues were on track to exceed previous guidance to the City. \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Money: Pensioners who will get winter fuel payment this year revealed; charities react to change\n                 \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 The company's growth is being fuelled by so-called next-generation products such as Velo, a global brand of nicotine pouches. \"In the US, I am very pleased that we expect to return to both revenue and profit growth in H1 and FY,\" Tadeu Marroco, BAT chief executive, said last week. \"While combustibles industry volume remains under pressure, we have stabilised our total industry volume and value share. \"Excluding the deep discount segment where we are not present, we are gaining share, driven by Natural American Spirit and Lucky Strike.\" BAT declined to comment."
    },
    {
        "title": "UK tech firms agree takeovers as Starmer backs AI future",
        "description": "Two UK tech firms have agreed takeovers by US rivals on the day Prime Minister Sir Keir Starmer has spoken of the importance of tech and AI to the UK economy.",
        "url": "https://news.sky.com/story/us-chipmaker-qualcomm-agrees-takeover-of-uks-alphawave-13381038",
        "image_url": "https://e3.365dm.com/21/02/1920x1080/skynews-qualcomm-chip-smartphone_5284542.jpg?20210225082944",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-09 07:27:00",
        "Headline": "The deals were announced shortly before Prime Minister Sir Keir Starmer kicked off the annual London Tech Week, outlining the importance of tech and AI to the UK's prospects.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Two UK tech firms have agreed takeovers by US rivals on the day Prime Minister Sir Keir Starmer has spoken of the importance of tech and AI to the UK economy. US chipmaker Qualcomm revealed a $2.4bn (£1.8bn) takeover of Alphawave. Shareholders in the UK firm, which designs semiconductors attractive in artificial intelligence (AI) development, will receive 183p per share under the terms. The price represents a 95% premium to that seen before Qualcomm disclosed its interest. Money latest: Why you probably should not book a hotel on your laptop It was separately announced that another US firm, Maryland-based IonQ, had agreed to acquire quantum computing startup Oxford Ionics for $1.1bn (£820m). Both deals will heighten concerns about the ability of UK firms to stave off takeover interest. \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  AI foot scanner recognises warning signs of heart failure to keep people out of hospital, researchers say\n                 \n                  Voiceover artist Gayanne Potter urging ScotRail to remove her voice from new AI announcements\n                  Softbank-owned chipmaker ARM - previously a London-listed firm before it was snapped up under a £32bn deal in 2016 - had also been chasing Alphawave but has since walked away. The UK company's \"serdes\" technology is said to be the main prize within the deal. It underpins the speed at which data is processed by chips - crucial for AI development. Qualcomm said the deal would bolster its enhancement of AI. Its chips have been widely used by Apple and Samsung though its interest in iPhones has recently been curtailed through the development of Apple's own chip components. Alphawave said it considered the terms of the cash offer to be fair and reasonable and that it intended to unanimously recommend it to its shareholders. In a speech marking the start of London Tech Week, the PM said tech and AI were \"absolutely central\" to the UK. Cheap valuations and a weak pound have made UK firms attractive to US investors in recent years, while a number of UK listed firms have shifted primary listings to the United States in a bid to attract greater investment. The government has moved to make UK listings more attractive as part of its growth agenda. The prime minister launched a new free government partnership with industry, including Nvidia, Amazon, Google and BT, to train 7.5 million UK workers in essential skills to use AI by 2030. A separate \"TechFirst\" initiative will roll out AI training to every secondary school over three years. Read more from Sky News:US-China hold trade war talks in LondonRiver Island owners draw up rescue plan Sir Keir told the audience in central London: \"AI and tech makes us more human, which sounds an odd thing to say, but it's true. \"We need to say it because... some people out there are sceptical. They do worry about AI taking their job.\" He said: \"For people listening to us, they worry about will it make their lives more complicated? Even for businesses who get it, the pace of change can feel relentless.\" Sir Keir added: \"I believe the way that we work through this together is critical.\""
    },
    {
        "title": "Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn",
        "description": "The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses.",
        "url": "https://news.sky.com/story/spending-review-2025-cutting-agricultural-budget-could-be-catastrophic-for-nature-farmers-and-charities-warn-13381297",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-farm-inheritance-tax_6759056.jpg?20241127091742",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-09 15:43:00",
        "Headline": "The groups fear the government will cut the agricultural budget at Rachel Reeves' spending review on Wednesday.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses. In a letter to food security and rural affairs minister Daniel Zeichner, exclusively seen by Sky News, a dozen of the biggest rural industry organisations say they are \"deeply concerned\" about rumoured cuts that will be made to the agricultural budget in Wednesday's spending review. Chancellor Rachel Reeves will set out budgets for each government department for the rest of this parliament, set to end in 2029. The letter says cutting funding for existing and new environmental farming schemes will be \"catastrophic\" to the government's aims for the environment. \"Many of the environmental features present in the countryside and enjoyed by the public will be under threat and will disappear,\" the letter says. \"This would be a poor legacy for this government.\" Sir Keir Starmer's government has made getting to net zero by 2050 a key goal, already initiating several policies to restrict carbon emissions and make the UK greener since winning the election last July. \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 However, the government shocked farmers in March when it shut down applications for the Sustainable Farming Incentive (SFI), which rewards farmers for managing their land in environmentally sustainable ways, with just a few hours' notice as they said a cap had been reached for the year. The rural organisations say the Environmental Land Management (ELM) scheme payments are \"critical to the government's statutory targets on environmental improvement\", including the main goal of halting the decline of biodiversity. Read more:Prince William meets Clarkson's Farm star to discuss industry challengesLabour MP goes public to oppose family farms tax  The letter states farmers and landowners are fully committed to environmental schemes, with 77,000 live agri-environment scheme agreements, according to the latest government figures, \"with millions of hectares under environmental land management\". \"So much good has been done by these agreements, the oldest of which has run for decades,\" the letter says. \"The unprecedented engagement in the Sustainable Farming Incentive (SFI) is testament to the appetite of farmers and land managers to rise to the challenge and do more.\" The letter finishes with: \"The industry would like to have your assurances that this critical work will continue to be funded at the same level.\" David Wilson, a farmer for 53 years, told Sky News it took many years for farmers to get on board with the environmental schemes but they are now joined up, and reducing funding could damage years of work and be a backwards step for not just the UK's environment, but the world's. \"This is ultimately about sustainability. To produce good food, you need good ecology and reducing this funding could damage the UK's ecology and our food security,\" he added. A return to intensive farming Alex Robinson, 39, a farmer from Gloucestershire with 424 hectares, said the schemes have been \"a lifeline for nature\", with birds, bees and wildflowers returning - including 14 red-listed bird species, many that had not been seen in decades. His farm's soil health is improving, which means he can grow more resilient nutrient dense crops for people to eat. If funding is cut he said he \"may have no choice but to return to intensive farming methods sooner than the soils are ready for\", with wildflowers and field margins becoming \"difficult to justify\", which will put the UK's climate, biodiversity and long-term food security \"in real danger\". Government will be abandoning nature Signatory Victoria Vyvyan, farmer and president of the Country Land and Business Association (CLA), said: \"If sustainable farming contracts are cut, government won't just abandon nature - it will abandon its own environmental and legal commitments. \"The Sustainable Farming Incentive is working - for farmers, for nature, for the public, and for the Treasury. It's bringing back wildlife, cleaning up rivers, and restoring the health of our soil. \"Take away the funding for nature contracts, and farmers will be pushed back to intensive methods - forced to undo years of progress. Nature will suffer as well as farmers, and on the environment, it will go against everything government claims to agree with.\" The letter has been signed by the heads of The National Trust, the National Farmers' Union (NFU), the RSPB, the Soil Association, the CLA, the Tenant Farmers Association, the Game and Wildlife Conservation Trust, the Nature Friendly Farming Network, the Central Association of Agricultural Valuers, the National Federation of Young Farmers' Clubs, the British Institute of Agricultural Consultants and the Agricultural Industries Confederation. A government spokesman said they \"do not comment on budget speculation\"."
    },
    {
        "title": "Half of SME housebuilders ‘to be bust by next election’, report to warn",
        "description": "Half of Britain&#8217;s 2,500 remaining smaller housebuilders could crash into insolvency by the end of this parliament as a consequence of the cost of industry regulations, a report will warn this week.",
        "url": "https://news.sky.com/story/half-of-sme-housebuilders-8216to-be-bust-by-next-election8217-report-to-warn-13381223",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-housing-dhluc_6216542.jpg?20230712142408",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-09 12:26:00",
        "Headline": "A joint report from WPI Strategy and ChamberlainWalker seen by Sky News will cast a shadow over new pledges from ministers to accelerate housebuilding across Britain.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Half of Britain’s 2,500 remaining smaller housebuilders could crash into insolvency by the end of this parliament as a consequence of the cost of industry regulations, a report will warn this week. Sky News has seen a document to be published on Tuesday - ahead of the government's spending review - which will refer to \"a perfect storm of costs\" that threatens to wipe out the profits of SME housebuilders. The bleak forecast is the principal conclusion of a report produced jointly by the public affairs firm WPI Strategy and ChamberlainWalker, an economics consultancy specialising in housing and planning. It casts a fresh shadow over the government's target of building 1.5m homes during the course of this parliament - one of its most important manifesto commitments ahead of last year's landslide victory. Money latest: Eatery where staff are deliberately rude to close final UK site On Monday, ministers said the use of a new artificial intelligence tool would facilitate the acceleration of planning permissions by reducing the reliance on paper documents. \"For too long, our outdated planning system has held back our country- slowing down the development of vital infrastructure and making it harder to get the homes we need built,\" Sir Keir Starmer said. \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Money: Pensioners who will get winter fuel payment this year revealed; charities react to change\n                 \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 \"This government is working hand in hand with business to change that. With [new AI tool] Extract, we're harnessing the power of AI to help planning officers cut red tape, speed up decisions, and unlock the new homes for hard-working people as part of our Plan for Change. \"It's a bold step forward in our mission to build 1.5 million more homes and deliver a planning system that's fit for the 21st century.\" The WPI/ChamberlainWalker report will warn, however, that at the current rate of failure among SME builders, as many as 75,000 fewer homes would be built by smaller housebuilders before the next general election is due to be held in 2029. It will say that recently introduced regulations such as the Building Safety Levy have added close to £5bn of annual costs to housebuilders. The Future Homes Standard, Biodiversity Net Gain, accessibility rules and electric vehicle charging requirements are among the other incremental costs facing the sector. Labour and materials costs are also rising, while house prices have flatlined, adding to the pressure on the industry, with smaller players disproportionately affected, the report will add. Sean Worth, a director at WPI Strategy, said: \"A diverse range of housebuilders is important to ensuring the country is able to meet its headline housing target. \"It is also critical to maintaining a competitive market.\" \"The government has rightly acknowledged the importance of supporting small and medium sized builders. \"However, a perfect storm of costs inherited from the past few years as well as additional regulatory burdens means that without urgent assistance we could see half all of SME builders starting insolvency proceedings by the end of the parliament.\""
    },
    {
        "title": "UK to become 'AI maker not taker', says Sir Keir Starmer",
        "description": "The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI.",
        "url": "https://news.sky.com/story/uk-to-become-ai-maker-not-taker-says-sir-keir-starmer-13381107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tech-week-starmer-huang_6937269.jpg?20250609105811",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-09 09:52:00",
        "Headline": "NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister at London Tech Week, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI.",
        "Content": "\n          Science and Technology reporter\n        The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI. Sir Keir Starmer said the UK public needed to \"lean in\" and embrace artificial intelligence. NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI. He said the UK has one of the \"richest AI communities anywhere in the world\" and is the biggest country for AI investment other than the US and China.  However, it currently doesn't have the infrastructure needed to become a global AI superpower, he said. \"You can't do machine learning without a machine. The ability to build AI supercomputers here in the UK will naturally attract more AI startups and create a better ecosystem, said Mr Huang. His comments come on the morning two UK tech firms, Alphawave and Ionics, agreed takeovers by US rivals. \n                  Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action\n                 When Labour entered office, it cancelled a planned supercomputer, saying it wasn't funded.  It has since announced it wants to increase UK computing power 20-fold by 2030 and build a brand-new supercomputer. As he announced a series of new investments in training for workers and students, Sir Keir said that within the coming years the government should be able to \"look every parent in the eye\" and pledge that tech can create a \"better future\" for their children. Read more from Sky News:Prince William warns world's oceans are 'diminishing before our eyes'Can we trust ChatGPT despite it 'hallucinating' answers?\"By the end of this Parliament we should be able to look every parent in the eye in every region in Britain and say 'look what technology can deliver for you',\" he said. During the session, he announced a new £187m \"TechFirst\" scheme to equip secondary school pupils with AI skills for future jobs. He also announced a scheme backed by Google and Microsoft to train 7.5 million workers in AI skills by 2030. Google, Microsoft, IBM, Nvidia, BT and Amazon have signed up to make \"high-quality\" training materials widely available to workers free of charge over the next five years, according to Number 10. Sir Keir hosted a private reception at Chequers on Sunday with leading technology bosses and investors, including former Google chief executive Eric Schmidt, Faculty AI co-founder Angie Ma, Google DeepMind chief Demis Hassabis and Scale boss Alex Wang."
    },
    {
        "title": "Aussie giant Macquarie takes off with stake in London City Airport",
        "description": "The Australian financial giant Macquarie is close to snapping up a stake in London City Airport &#8211; the capital's fifth-biggest &#8211; amid a wider shake-up in its ownership structure.",
        "url": "https://news.sky.com/story/aussie-giant-macquarie-takes-off-with-stake-in-london-city-airport-13381120",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-london-city-airport_6811201.jpg?20250126144347",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-09 10:04:00",
        "Headline": "Macquarie Asset Management is nearing a deal to buy a sizeable minority interest in the capital's fifth-busiest airport, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Australian financial giant Macquarie is close to snapping up a stake in London City Airport – the capital's fifth-biggest – amid a wider shake-up in its ownership structure. Sky News understands that Macquarie Asset Management is nearing a deal to buy a minority interest in the Docklands airport from at least one of its cluster of Canadian shareholders. Industry sources said City Airport was preparing to make an announcement about changes to its shareholder base as soon as this week, although the Macquarie deal may take slightly longer to finalise, they added. Money latest: Why you probably should not book a hotel on your laptop The valuation of any agreement was unclear on Monday. It follows reports earlier this year that Omers and AIMCO, two big Canadian pension funds, had hired bankers at Morgan Stanley to advise them on the sale of their interest in the London airport. Macquarie was named at the time as a potential buyer of the 25% stake owned by Ontario Teachers' Pension Plan (OTPP). \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Money: Pensioners who will get winter fuel payment this year revealed; charities react to change\n                 \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 Read more from Sky News:US-China hold trade war talks in LondonRiver Island owners draw up rescue plan London City Airport has been given permission to increase passenger numbers from 6.5 million annually to 9 million, although it was denied the opportunity to extend its Saturday operating hours. It is now seeking other regulatory concessions in order to accelerate its growth, with Britain's aviation capacity featuring prominently on the UK's economic priority list. Macquarie has been a prolific investor in UK airports, having announced the sale of AGS - comprising Aberdeen, Glasgow and Southampton airports - earlier this year. Spokespeople for London City Airport, Macquarie and OTPP declined to comment."
    },
    {
        "title": "Princess Beatrice-backed start-up community OPUS lands $2m funding boost",
        "description": "A for-profit social enterprise which counts HRH Princess Beatrice among its directors will this week announce a funding boost and the appointment of one of Silicon Valley's most prominent figures to its board.",
        "url": "https://news.sky.com/story/princess-beatrice-backed-start-up-community-opus-lands-2m-funding-boost-13381076",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-princess-beatrice-edoardo-mapelli-mozzi_6813561.jpg?20250129130509",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-09 08:49:00",
        "Headline": "OPUS will announce on Tuesday that the General Magic co-founder Marc Porat, one of Silicon Valley's most prominent figures, is joining its board, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A for-profit social enterprise which counts HRH Princess Beatrice among its directors will this week announce a funding boost and the appointment of one of Silicon Valley's most prominent figures to its board. Sky News has learnt that OPUS, a membership community which aims to cultivate a new wave of British entrepreneurs, is to unveil a $2m injection of capital from a syndicate of angel investors and family offices. It will also announce that Marc Porat, co-founder of General Magic - the company credited with inventing the early technologies behind the smartphone - is to become a director of the company. Money latest: Why you probably should not book a hotel on your laptop OPUS has drawn a membership of nearly 1,000 technology company founders since it was established with the aim of helping their projects during the embryonic stages of building their businesses. \"Anything anyone has ever achieved has been due to the support and actions of others,\" Sam Tidswell-Norrish, chair of OPUS, said in a statement. \"That's what OPUS is built on - the power of the collective. \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Money: Pensioners who will get winter fuel payment this year revealed; charities react to change\n                 \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 \"This raise is a signal of intent: that OPUS and its investors are deeply committed to backing the founders of tomorrow.\" The company has a physical presence in central London, and is establishing a dual-base in South Africa. Its new funding will be deployed to help founders through the use of artificial intelligence in areas such as fundraising, recruitment, product development and operations. Among OPUS's other backers are Miguel McKelvey, the WeWork co-founder, and Imtiaz Patel, former boss of MultiChoice Group. Read more from Sky News:US-China hold trade war talks in LondonRiver Island owners draw up rescue plan \"OPUS's mission deeply resonates with my own journey,\" said Mr Porat \"The early stages of building are always the most challenging - even for the most talented, experienced and well-connected founder. \"Community and friendships unlock opportunity, and being able to contribute towards a platform that leverages technology to scale that value to early-stage founders is exceptionally exciting.\" OPUS will also announce this week that Ken Donald, a former executive at British fintech Snoop, is to become its co-managing director, alongside Kerry Fennell."
    },
    {
        "title": "The five considerable problems with the chancellor's U-turn on winter fuel payments",
        "description": "There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all?",
        "url": "https://news.sky.com/story/the-five-key-issues-from-chancellors-winter-fuel-payment-u-turn-13381413",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves_6937820.jpg?20250609221257",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-06-09 20:43:00",
        "Headline": "Chancellor Rachel Reeves U-turned on her decision to remove winter fuel payments from most pensioners.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There are considerable problems with the winter fuel payment U-turn, but perhaps the political argument in favour outweighs them all? First, Rachel Reeves has executed the plan without working out how to pay for it. This, for an iron chancellor, is a wound that opponents won't let her forget. A summer of speculation about tax rises is not a summer anyone looks forward to. Politics latest: Treasury minister challenged over reason for U-turn Second, the fig leaf that she and Treasury ministers are using is an improvement in economic conditions. If you were being polite, you'd say this is contested. The OBR halved growth this year and the OECD downgraded UK forecasts, albeit only by a little, last week. \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 \n                  Winter Fuel payments to extend to pensioners on incomes of £35,000 or less \n                 \n                  Can you trust Rachel Reeves' spending review numbers?\n                 The claim that interest rates are coming down ignores that their descent is slower because of government decisions of the last six months. Third, the question immediately becomes, what next? Why not personal independent payments (PIP) and the two-child benefit cap? At this stage, it would feel like a climbdown if they did not back down over those. But then, what will the markets - already policing this closely - make of it, and could they punish the government? Fourth, this is aggravating divisions in the Parliamentary Labour Party: the soft left Compass group and ministers like Torsten Bell pushing bigger spending arguments. Those MPs in Tory-facing seats who rely on arguments that Labour can be trusted with the public finances are worried. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Fifth, this has created a firm division between No 10 (the PM) and No 11 (the Chancellor). No 10 is now conscious that it does not have enough independent advice about the market reaction to economic policies and is seeking to correct. Others, I am told, are just critical of the chancellor's U-turn - for she wobbled first. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? Given the litany of arguments against, why has it happened? Because the hope is this maxi U-turn lances the boil, removes a significant source of pensioners' anger and brings back Labour voters, a price they calculate worth paying, whatever the fiscal cost. We wait to see who is right."
    },
    {
        "title": "Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn",
        "description": "The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses.",
        "url": "https://news.sky.com/story/spending-review-2025-cutting-agricultural-budget-could-be-catastrophic-for-nature-farmers-and-charities-warn-13381297",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-farm-inheritance-tax_6759056.jpg?20241127091742",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-09 15:43:00",
        "Headline": "The groups fear the government will cut the agricultural budget at Rachel Reeves' spending review on Wednesday.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses. In a letter to food security and rural affairs minister Daniel Zeichner, exclusively seen by Sky News, a dozen of the biggest rural industry organisations say they are \"deeply concerned\" about rumoured cuts that will be made to the agricultural budget in Wednesday's spending review. Chancellor Rachel Reeves will set out budgets for each government department for the rest of this parliament, set to end in 2029. The letter says cutting funding for existing and new environmental farming schemes will be \"catastrophic\" to the government's aims for the environment. \"Many of the environmental features present in the countryside and enjoyed by the public will be under threat and will disappear,\" the letter says. \"This would be a poor legacy for this government.\" Sir Keir Starmer's government has made getting to net zero by 2050 a key goal, already initiating several policies to restrict carbon emissions and make the UK greener since winning the election last July. \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 However, the government shocked farmers in March when it shut down applications for the Sustainable Farming Incentive (SFI), which rewards farmers for managing their land in environmentally sustainable ways, with just a few hours' notice as they said a cap had been reached for the year. The rural organisations say the Environmental Land Management (ELM) scheme payments are \"critical to the government's statutory targets on environmental improvement\", including the main goal of halting the decline of biodiversity. Read more:Prince William meets Clarkson's Farm star to discuss industry challengesLabour MP goes public to oppose family farms tax  The letter states farmers and landowners are fully committed to environmental schemes, with 77,000 live agri-environment scheme agreements, according to the latest government figures, \"with millions of hectares under environmental land management\". \"So much good has been done by these agreements, the oldest of which has run for decades,\" the letter says. \"The unprecedented engagement in the Sustainable Farming Incentive (SFI) is testament to the appetite of farmers and land managers to rise to the challenge and do more.\" The letter finishes with: \"The industry would like to have your assurances that this critical work will continue to be funded at the same level.\" David Wilson, a farmer for 53 years, told Sky News it took many years for farmers to get on board with the environmental schemes but they are now joined up, and reducing funding could damage years of work and be a backwards step for not just the UK's environment, but the world's. \"This is ultimately about sustainability. To produce good food, you need good ecology and reducing this funding could damage the UK's ecology and our food security,\" he added. A return to intensive farming Alex Robinson, 39, a farmer from Gloucestershire with 424 hectares, said the schemes have been \"a lifeline for nature\", with birds, bees and wildflowers returning - including 14 red-listed bird species, many that had not been seen in decades. His farm's soil health is improving, which means he can grow more resilient nutrient dense crops for people to eat. If funding is cut he said he \"may have no choice but to return to intensive farming methods sooner than the soils are ready for\", with wildflowers and field margins becoming \"difficult to justify\", which will put the UK's climate, biodiversity and long-term food security \"in real danger\". Government will be abandoning nature Signatory Victoria Vyvyan, farmer and president of the Country Land and Business Association (CLA), said: \"If sustainable farming contracts are cut, government won't just abandon nature - it will abandon its own environmental and legal commitments. \"The Sustainable Farming Incentive is working - for farmers, for nature, for the public, and for the Treasury. It's bringing back wildlife, cleaning up rivers, and restoring the health of our soil. \"Take away the funding for nature contracts, and farmers will be pushed back to intensive methods - forced to undo years of progress. Nature will suffer as well as farmers, and on the environment, it will go against everything government claims to agree with.\" The letter has been signed by the heads of The National Trust, the National Farmers' Union (NFU), the RSPB, the Soil Association, the CLA, the Tenant Farmers Association, the Game and Wildlife Conservation Trust, the Nature Friendly Farming Network, the Central Association of Agricultural Valuers, the National Federation of Young Farmers' Clubs, the British Institute of Agricultural Consultants and the Agricultural Industries Confederation. A government spokesman said they \"do not comment on budget speculation\"."
    },
    {
        "title": "UK to become 'AI maker not taker', says Sir Keir Starmer",
        "description": "The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI.",
        "url": "https://news.sky.com/story/uk-to-become-ai-maker-not-taker-says-sir-keir-starmer-13381107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tech-week-starmer-huang_6937269.jpg?20250609105811",
        "type": "Politics",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-09 09:52:00",
        "Headline": "NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister at London Tech Week, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI.",
        "Content": "\n          Science and Technology reporter\n        The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI. Sir Keir Starmer said the UK public needed to \"lean in\" and embrace artificial intelligence. NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI. He said the UK has one of the \"richest AI communities anywhere in the world\" and is the biggest country for AI investment other than the US and China.  However, it currently doesn't have the infrastructure needed to become a global AI superpower, he said. \"You can't do machine learning without a machine. The ability to build AI supercomputers here in the UK will naturally attract more AI startups and create a better ecosystem, said Mr Huang. His comments come on the morning two UK tech firms, Alphawave and Ionics, agreed takeovers by US rivals. \n                  Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action\n                 When Labour entered office, it cancelled a planned supercomputer, saying it wasn't funded.  It has since announced it wants to increase UK computing power 20-fold by 2030 and build a brand-new supercomputer. As he announced a series of new investments in training for workers and students, Sir Keir said that within the coming years the government should be able to \"look every parent in the eye\" and pledge that tech can create a \"better future\" for their children. Read more from Sky News:Prince William warns world's oceans are 'diminishing before our eyes'Can we trust ChatGPT despite it 'hallucinating' answers?\"By the end of this Parliament we should be able to look every parent in the eye in every region in Britain and say 'look what technology can deliver for you',\" he said. During the session, he announced a new £187m \"TechFirst\" scheme to equip secondary school pupils with AI skills for future jobs. He also announced a scheme backed by Google and Microsoft to train 7.5 million workers in AI skills by 2030. Google, Microsoft, IBM, Nvidia, BT and Amazon have signed up to make \"high-quality\" training materials widely available to workers free of charge over the next five years, according to Number 10. Sir Keir hosted a private reception at Chequers on Sunday with leading technology bosses and investors, including former Google chief executive Eric Schmidt, Faculty AI co-founder Angie Ma, Google DeepMind chief Demis Hassabis and Scale boss Alex Wang."
    },
    {
        "title": "Can we trust ChatGPT despite it 'hallucinating' answers?",
        "description": "I don't really want you to read this copy. Well I do - but first I want you to search out the interview I did with ChatGPT about its own propensity to lie, attached to this article, and watch that first.",
        "url": "https://news.sky.com/story/can-we-trust-chatgpt-despite-it-hallucinating-answers-13380975",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chatgpt-sam-coates_6935676.jpg?20250606091648",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-06-09 03:06:00",
        "Headline": "Sky News revealed how ChatGPT was fabricating entire transcripts of a podcast, Politics at Sam and Anne's.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  I don't really want you to read this copy. Well I do - but first I want you to search out the interview I did with ChatGPT about its own propensity to lie, attached to this article, and watch that first. Because it's impossible to imagine what we're up against if you haven't seen it first hand. An incredibly powerful technology on the cusp of changing our lives - but programmed to simulate human emotions. Empathy, emotional understanding, and a desire to please are all qualities programmed into AI and invariably drive the way we think about them and the way we interact with them. Yet can we trust them? On Friday, Sky News revealed how it was fabricating entire transcripts of a podcast, Politics at Sam and Anne's, that I do. When challenged, it doubles down, gets shirty. And only under sustained pressure does it cave in. The research says it's getting worse. Internal tests by ChatGPT's owner OpenAI have found that the most recent models or versions that are used by ChatGPT are more likely to \"hallucinate\" - come up with answers that are simply untrue. The o3 model was found to hallucinate in 33% of answers to questions when tested on publicly available facts; the o4-mini version did worse, generating false, incorrect or imaginary information 48% of the time.  ChatGPT itself says that the shift to GPT-4o \"may have unintentionally increased what users perceive as 'bluffing'\" - confidently giving wrong or misleading answers without admitting uncertainty or error. In a written query, ChatGPT gave four reasons. This is its explanation: 1. Increased fluency and confidence: GPT-4o is better at sounding human and natural. That polish can make mistakes seem more like deliberate evasions than innocent errors - even when there's no intent to \"hide\" anything. 2. Smarter, but not omniscient: The model is faster and more responsive, but still has blind spots. When it doesn't know something, it sometimes \"hallucinates\" (makes things up) with fluent language, which can feel like bluffing. 3. Less interruption and hedging: In older models, you'd often see more qualifiers like \"I'm not sure\" or \"I may be wrong.\" In GPT-4o, some of that hedging was toned down for clarity and readability - but that can come at the cost of transparency about uncertainty. 4. Prompt tuning and training balance: Behind the scenes, prompt engineering and tuning decisions can shift the model's balance between confidence, humility, and accuracy. It's possible the newer tuning has dialled up assertiveness slightly too far. But can we trust even this? I don't know. What I do know is that the efforts of developers to make it all feel more human suggest they want us to. Critics say we are anthropomorphising AI by saying it lies since it has no consciousness - yet the developers are trying to make it sound more like one of us. Read more from Sky News:Man chased on tarmac at Heathrow AirportSoldier arrested on suspicion of raping woman What I do know is that even when pressed on this subject by me, it is still evasive. I interviewed ChatGPT about lying - it initially claimed things were getting better, and only admitted they are worse when I insisted it look at the stats. Watch that before you decide what you think. AI is a tremendous tool - but it's too early to take it on trust."
    },
    {
        "title": "Dozens of MPs back campaign to revive playgrounds",
        "description": "More than 70 MPs are backing a campaign to revive England's playgrounds as pressure grows on the government to do more to tackle community decline to fight Reform UK.",
        "url": "https://news.sky.com/story/dozens-of-mps-back-campaign-to-revive-playgrounds-13381251",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tom-hayes-play-campaign_6937522.jpg?20250609150739",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-09 13:40:00",
        "Headline": "Labour MP Tom Hayes tells Sky News playgrounds for children is a crucial first step to tackling community decline that is making voters feel hopeless and driving them to Reform.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n More than 70 MPs are backing a campaign to revive England's playgrounds as pressure grows on the government to do more to tackle community decline to fight Reform UK. Labour MP Tom Hayes has tabled an amendment to the Planning and Infrastructure Bill that would ensure playgrounds lost to development are replaced. Politics Live: Chancellor performs 'huge, huge U-turn' on winter fuel Mr Hayes told Sky News it is a personal subject as he grew up in poverty, caring for two disabled parents, and without his local playground \"they wouldn't have been able to afford any sort of leisure activity for me\". \"Talking to parents these days, with the cost of living crisis going on, they just don't have play areas on their doorstep like they used to. What they have instead is rusting swings or boarded-up playgrounds.\" The Bournemouth East MP said this speaks to a \"wider hopelessness\" that people are feeling about \"littering in their streets, graffiti on their walls, potholes in their roads\". \"It just makes people feel like nobody really cares about their area. That's at a time when people are feeling hopeless about the possibility of change and Reform, obviously, are trying to capitalise on that.\" \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 Under the last Labour government, Ed Balls and Andy Burnham launched England's first and only play strategy, which aimed to create 3,500 new play spaces across every local authority - backed by £235m of funding. It was abandoned by the Conservative-Liberal Democrat coalition two years later and facilities have been in sharp decline since then, according to Play England which has developed the amendment Mr Hayes is tabling. The amendment would require councils in England to assess play provision and integrate \"play sufficiency\" into local plans and planning decisions - similar to a law that already exists in Scotland and Wales. It would also require developers to deliver and fund adequate play infrastructure, with a focus on inclusive play equipment for children with special educational needs and disabilities. Mr Hayes said this would not cost the Treasury anything and \"is such a simple thing\" the government can do quickly for children and young people \"who have been shafted for so long\". It is backed by 71 MPs from across Labour, the Conservatives, the Lib Dems and the Greens, with many supporters hopeful it could also reduce screen time amid mounting concerns about online safety. Pressure on government over left-behind areas Amendments by backbench MPs are not usually agreed to but can be used to put pressure on the government, with the issue to be debated in the House of Commons this week as the planning bills enter the report stage. Mr Hayes said his playground campaign was just the start as he backed the resurrection of Sure Start centres, following calls from Rother Valley MP Jake Richards last week. Read More:Nigel Farage to pledge to reopen blast furnaces in Port TalbotStarmer doesn't rule out scrapping two-child benefit cap There is growing momentum among Labour backbenchers who want to see the government give more of a priority to social infrastructure to deliver tangible change to communities and fend off the threat of Reform UK. MPs and policy insiders have told Sky News they are concerned Downing Street's ambition to grow GDP with long-term transport and infrastructure projects will not make a difference in places that look and feel forgotten, even if achieved. As Sky News has previously reported, several Red Wall MPs have backed the work of the Independent Commission On Neighbourhoods (ICON), which has identified 613 \"mission-critical\" neighbourhoods in need of a cash boost to ensure people in left-behind areas can benefit from growth.  The commission, chaired by Labour peer Hilary Armstrong, highlights the need to regenerate neighbourhoods with facilities like libraries, parks and community centres for voters to feel a difference. Any money for such a project will be set out in Chancellor Rachel Reeves's spending review on Wednesday, when she will allocate funds for each department over the coming years. One of ICON's supporters is Blackpool South MP Chris Webb, who has also signed Mr Hayes's amendment. He told Sky News playgrounds \"will make a real difference to families in Blackpool, which has the most mission-critical neighbourhoods in the country\". \"I'm committed to fighting for policies that benefit our community, and I'm thrilled to be working with Tom Hayes MP, the play sector and Play England to make this vision a reality.\" Sky News has contacted the government for comment."
    },
    {
        "title": "NATO chief calls for 400% increase in air and missile defence to maintain credible deterrent",
        "description": "NATO needs a 400% increase in air and missile defence to maintain a credible deterrence, its secretary general has said in a speech in London.",
        "url": "https://news.sky.com/story/nato-chief-to-call-for-400-increase-in-air-and-missile-defence-to-maintain-credible-deterrent-13381012",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-rutte_6937612.jpg?20250609165042",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-09 06:16:00",
        "Headline": "Mark Rutte has called for a \"quantum leap\" in collective security amid expectations the alliance will agree to a 5% defence spending target at a summit later this month.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  NATO needs a 400% increase in air and missile defence to maintain a credible deterrence, its secretary general has said in a speech in London. Mark Rutte called for a \"quantum leap\" in collective security, warning threats facing the alliance \"will not disappear even when the war in Ukraine ends\". Politics Live: Ministers continue to battle over funds ahead of spending review It comes ahead of a summit in The Hague later this month, when the UK and its NATO allies are expected to agree to a Donald Trump-inspired pledge to spend 5% of GDP on defence and related areas. New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences 👉Search for The Wargame on your podcast app👈 Speaking at Chatham House, Mr Rutte said the investment plan is \"grounded in hard facts\". He said: \"The fact is, we need a quantum leap in our collective defence. The fact is, we must have more forces and capabilities to implement our defence plans in full. The fact is, danger will not disappear even when the war in Ukraine ends.\" Mr Rutte argued that in order to maintain credible deterrence and defence, NATO needs \"a 400% increase in air and missile defence\". \"We see in Ukraine how Russia delivers terror from above, so we will strengthen the shield that protects our skies,\" he said. \"Our militaries also need thousands more armoured vehicles and tanks, millions more artillery shells, and we must double our enabling capabilities, such as logistics, supply, transportation, and medical support.\" Mr Rutte also referred to countries other than Russia that pose a threat to the alliance and said: \"Russia has teamed up with China, North Korea and Iran. They are expanding their militaries and their capabilities. Putin's war machine is speeding up, not slowing down.\" He continued: \"In terms of ammunition, Russia produces in three months what the whole of NATO produces in a year, and its defence industrial base is expected to roll out 1,500 tanks, 3,000 armoured vehicles and 200 Iskander missiles this year alone. Russia could be ready to use military force against NATO within five years.\" Mr Rutte added: \"China is also modernising and expanding its military at breakneck speed. It already has the world's largest navy, and this battle force is expected to grow to 435 ships by 2030.\" On the threats against the alliance, he also warned: \"Wishful thinking will not keep us safe. We cannot dream away the danger. Hope is not a strategy. So NATO has to become a stronger, fairer and more lethal alliance.\"  Mr Rutte earlier met with Sir Keir Starmer and visited Sheffield Forgemasters with Defence Secretary John Healey. The prime minister has committed to spend 2.5% of gross domestic product (GDP) on defence from April 2027, with a goal of increasing that to 3% over the next parliament. Although the government's language has been cloudy on the 3% figure, describing it as an ambition rather than a commitment, Sky News understands the UK will in fact agree to increase defence spending to 3.5% of national income within a decade as part of Mr Rutte's push to rearm NATO and keep the US on side. Read More: Spending review 2025: What is it and what might Rachel Reeves announce? As reported by our security and defence editor Deborah Haynes, Sir Keir will also likely be forced to commit a further 1.5% of GDP to defence-related areas such as spy agencies and infrastructure. This would bolster total broader defence spending to 5%, in what is being described as the \"Hague investment plan\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 NATO countries have faced pressure from US President Donald Trump, who has repeatedly hit out at European allies for not spending enough on defence and taking advantage of American taxpayers. Speaking at Chatham House today, Mr Rutte said: \"Spending more (on defence) is not about pleasing an audience of one. This is about protecting one billion people.\" He added: \"America has carried too much of the burden for too long. America's allies have broad shoulders, and Europe and Canada will do more for our shared security. And that will be backed by America's rock solid commitment to NATO.\" The NATO plan to increase defence spending among its members comes as Sir Keir is facing pressure at home on where his priorities lie, with many of his own MPs wanting to see more funding on welfare. Chancellor Rachel Reeves will deliver her spending review on Wednesday, when health and defence are expected to be the winners in the process to allocate cash to government departments. Cuts to the Department of Work and Pensions have already been announced, but other unprotected departments like the Home Office and Department of Communities and Local Government could be braced for a real spending squeeze."
    },
    {
        "title": "Can you trust Rachel Reeves' spending review numbers?",
        "description": null,
        "url": "https://news.sky.com/story/can-you-trust-rachel-reeves-spending-review-numbers-13381001",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-09 05:16:00",
        "Headline": "No subtitle found",
        "Content": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. The Home Office is the last department to finalise their budget with Chancellor Rachel Reeves ahead of Wednesday's spending review. All eyes are on Yvette Cooper and the noise that comes out of Westminster today and tomorrow that will indicate how much cash the home secretary has secured for things like policing. And, with Nigel Farage due to make a speech today, Sam and Anne catch up on a wild weekend for Reform - at the start of which party chairman Zia Yusuf resigned over a proposed ban on burkas - only for him to reverse his decision and return 48 hours later."
    },
    {
        "title": "Winter Fuel payments to extend to pensioners on incomes of £35,000 or less ",
        "description": "Winter fuel payments will extend to everyone over the state pension age with an income of or below &#163;35,000 a year, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/winter-fuel-payments-to-extend-to-pensioners-on-incomes-of-16335000-or-less-13381132",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-ons-inflation_6922901.jpg?20250521080019",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-09 10:29:00",
        "Headline": "The Treasury said the change will cost around £1.25bn in England and Wales but still save £450m from when the universal system had been in place.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Winter fuel payments will extend to everyone over the state pension age with an income of or below £35,000 a year, Chancellor Rachel Reeves has announced. The Treasury said the change will cost around £1.25bn in England and Wales but still save £450m from when the universal allowance was in place. Politics Live: Chancellor makes winter fuel announcement  Dropping the benefit for all pensioners was one of the first things Labour did in government, despite it not being in their manifesto. The change meant only those on pension credit or other benefits were eligible - a deeply unpopular move that was widely blamed on the party's poor performance in May's local elections. Ms Reeves said: \"Targeting winter fuel payments was a tough decision, but the right decision because of the inheritance we had been left by the previous government. \"It is also right that we continue to means-test this payment so that it is targeted and fair, rather than restoring eligibility to everyone, including the wealthiest. \"But we have now acted to expand the eligibility of the winter fuel payment so no pensioner on a lower income will miss out.\" The government signalled its intention to widen eligibility last month, but no detail was given on what the new threshold might look like. The lack of clarity threatened to overshadow Ms Reeves' spending review on Wednesday, when she will set out what funding has been allocated to each government department over the next three years. The chancellor repeatedly faced questions on winter fuel during a speech in Manchester last week to promote a  £15.6bn funding settlement for local transport projects, when she said changes would be in place for this winter. However, ministers still could not give further detail, with science secretary Peter Kyle telling Sunday Morning with Trevor Phillips that the new eligibility would be set out \"in the run up to the autumn\". It is still not clear how the new policy will be funded, with the costs to be accounted for in the autumn budget. Asked by Sky News' deputy political editor Sam Coates if the change is a signal to markets that she can't say no to her MPs, Ms Reeves said after her spending review \"markets and the public will be able to see public services living within their means\". 'Humiliating U-turn' Tory leader Kemi Badenoch said: \"Keir Starmer has scrambled to clear up a mess of his own making. I repeatedly challenged him to reverse his callous decision to withdraw winter fuel payments, and every time Starmer arrogantly dismissed my criticisms. \"This humiliating U-turn will come as scant comfort to the pensioners forced to choose between heating and eating last winter. The prime minister should now apologise for his terrible judgement.\" The Treasury said that by setting the threshold at an income of £35,000, over three-quarters of pensioners - around nine million people - will benefit. The universal system meant some 11.4 million pensioners were in receipt of the benefit, which was slashed down to 1.5 million when the initial means-test was brought in. The new threshold is above the income level of pensioners in poverty and broadly in line with average earnings, the Treasury said. No pensioner will need to take any action as they will automatically receive the payment this winter."
    },
    {
        "title": "Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn",
        "description": "The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses.",
        "url": "https://news.sky.com/story/spending-review-2025-cutting-agricultural-budget-could-be-catastrophic-for-nature-farmers-and-charities-warn-13381297",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-farm-inheritance-tax_6759056.jpg?20241127091742",
        "type": "Technology",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-09 15:43:00",
        "Headline": "The groups fear the government will cut the agricultural budget at Rachel Reeves' spending review on Wednesday.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The National Trust and RSPB have joined forces with farmers to warn the government that cutting the agricultural budget could be \"catastrophic\" for nature and rural businesses. In a letter to food security and rural affairs minister Daniel Zeichner, exclusively seen by Sky News, a dozen of the biggest rural industry organisations say they are \"deeply concerned\" about rumoured cuts that will be made to the agricultural budget in Wednesday's spending review. Chancellor Rachel Reeves will set out budgets for each government department for the rest of this parliament, set to end in 2029. The letter says cutting funding for existing and new environmental farming schemes will be \"catastrophic\" to the government's aims for the environment. \"Many of the environmental features present in the countryside and enjoyed by the public will be under threat and will disappear,\" the letter says. \"This would be a poor legacy for this government.\" Sir Keir Starmer's government has made getting to net zero by 2050 a key goal, already initiating several policies to restrict carbon emissions and make the UK greener since winning the election last July. \n                  Politics latest: Treasury minister challenged over reason for winter fuel U-turn\n                 \n                  The five considerable problems with the chancellor's U-turn on winter fuel payments\n                 \n                  Sophy Ridge challenges Treasury minister over winter fuel U-turn\n                 However, the government shocked farmers in March when it shut down applications for the Sustainable Farming Incentive (SFI), which rewards farmers for managing their land in environmentally sustainable ways, with just a few hours' notice as they said a cap had been reached for the year. The rural organisations say the Environmental Land Management (ELM) scheme payments are \"critical to the government's statutory targets on environmental improvement\", including the main goal of halting the decline of biodiversity. Read more:Prince William meets Clarkson's Farm star to discuss industry challengesLabour MP goes public to oppose family farms tax  The letter states farmers and landowners are fully committed to environmental schemes, with 77,000 live agri-environment scheme agreements, according to the latest government figures, \"with millions of hectares under environmental land management\". \"So much good has been done by these agreements, the oldest of which has run for decades,\" the letter says. \"The unprecedented engagement in the Sustainable Farming Incentive (SFI) is testament to the appetite of farmers and land managers to rise to the challenge and do more.\" The letter finishes with: \"The industry would like to have your assurances that this critical work will continue to be funded at the same level.\" David Wilson, a farmer for 53 years, told Sky News it took many years for farmers to get on board with the environmental schemes but they are now joined up, and reducing funding could damage years of work and be a backwards step for not just the UK's environment, but the world's. \"This is ultimately about sustainability. To produce good food, you need good ecology and reducing this funding could damage the UK's ecology and our food security,\" he added. A return to intensive farming Alex Robinson, 39, a farmer from Gloucestershire with 424 hectares, said the schemes have been \"a lifeline for nature\", with birds, bees and wildflowers returning - including 14 red-listed bird species, many that had not been seen in decades. His farm's soil health is improving, which means he can grow more resilient nutrient dense crops for people to eat. If funding is cut he said he \"may have no choice but to return to intensive farming methods sooner than the soils are ready for\", with wildflowers and field margins becoming \"difficult to justify\", which will put the UK's climate, biodiversity and long-term food security \"in real danger\". Government will be abandoning nature Signatory Victoria Vyvyan, farmer and president of the Country Land and Business Association (CLA), said: \"If sustainable farming contracts are cut, government won't just abandon nature - it will abandon its own environmental and legal commitments. \"The Sustainable Farming Incentive is working - for farmers, for nature, for the public, and for the Treasury. It's bringing back wildlife, cleaning up rivers, and restoring the health of our soil. \"Take away the funding for nature contracts, and farmers will be pushed back to intensive methods - forced to undo years of progress. Nature will suffer as well as farmers, and on the environment, it will go against everything government claims to agree with.\" The letter has been signed by the heads of The National Trust, the National Farmers' Union (NFU), the RSPB, the Soil Association, the CLA, the Tenant Farmers Association, the Game and Wildlife Conservation Trust, the Nature Friendly Farming Network, the Central Association of Agricultural Valuers, the National Federation of Young Farmers' Clubs, the British Institute of Agricultural Consultants and the Agricultural Industries Confederation. A government spokesman said they \"do not comment on budget speculation\"."
    },
    {
        "title": "UK to become 'AI maker not taker', says Sir Keir Starmer",
        "description": "The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI.",
        "url": "https://news.sky.com/story/uk-to-become-ai-maker-not-taker-says-sir-keir-starmer-13381107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tech-week-starmer-huang_6937269.jpg?20250609105811",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-09 09:52:00",
        "Headline": "NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister at London Tech Week, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI.",
        "Content": "\n          Science and Technology reporter\n        The UK will become an \"AI maker not an AI taker\", according the prime minister, as he announced millions of pounds of funding to train students in AI. Sir Keir Starmer said the UK public needed to \"lean in\" and embrace artificial intelligence. NVIDIA chief executive Jensen Huang, who shared the stage with the prime minister, predicted that in the next 10 years, \"every industry in the UK will be a tech industry\" because of AI. He said the UK has one of the \"richest AI communities anywhere in the world\" and is the biggest country for AI investment other than the US and China.  However, it currently doesn't have the infrastructure needed to become a global AI superpower, he said. \"You can't do machine learning without a machine. The ability to build AI supercomputers here in the UK will naturally attract more AI startups and create a better ecosystem, said Mr Huang. His comments come on the morning two UK tech firms, Alphawave and Ionics, agreed takeovers by US rivals. \n                  Spending review 2025: Cutting agricultural budget could be 'catastrophic' for nature, farmers and charities warn\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action\n                 When Labour entered office, it cancelled a planned supercomputer, saying it wasn't funded.  It has since announced it wants to increase UK computing power 20-fold by 2030 and build a brand-new supercomputer. As he announced a series of new investments in training for workers and students, Sir Keir said that within the coming years the government should be able to \"look every parent in the eye\" and pledge that tech can create a \"better future\" for their children. Read more from Sky News:Prince William warns world's oceans are 'diminishing before our eyes'Can we trust ChatGPT despite it 'hallucinating' answers?\"By the end of this Parliament we should be able to look every parent in the eye in every region in Britain and say 'look what technology can deliver for you',\" he said. During the session, he announced a new £187m \"TechFirst\" scheme to equip secondary school pupils with AI skills for future jobs. He also announced a scheme backed by Google and Microsoft to train 7.5 million workers in AI skills by 2030. Google, Microsoft, IBM, Nvidia, BT and Amazon have signed up to make \"high-quality\" training materials widely available to workers free of charge over the next five years, according to Number 10. Sir Keir hosted a private reception at Chequers on Sunday with leading technology bosses and investors, including former Google chief executive Eric Schmidt, Faculty AI co-founder Angie Ma, Google DeepMind chief Demis Hassabis and Scale boss Alex Wang."
    },
    {
        "title": "Can we trust ChatGPT despite it 'hallucinating' answers?",
        "description": "I don't really want you to read this copy. Well I do - but first I want you to search out the interview I did with ChatGPT about its own propensity to lie, attached to this article, and watch that first.",
        "url": "https://news.sky.com/story/can-we-trust-chatgpt-despite-it-hallucinating-answers-13380975",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chatgpt-sam-coates_6935676.jpg?20250606091648",
        "type": "Technology",
        "Author": "Sam Coates",
        "Date Published": "2025-06-09 03:06:00",
        "Headline": "Sky News revealed how ChatGPT was fabricating entire transcripts of a podcast, Politics at Sam and Anne's.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  I don't really want you to read this copy. Well I do - but first I want you to search out the interview I did with ChatGPT about its own propensity to lie, attached to this article, and watch that first. Because it's impossible to imagine what we're up against if you haven't seen it first hand. An incredibly powerful technology on the cusp of changing our lives - but programmed to simulate human emotions. Empathy, emotional understanding, and a desire to please are all qualities programmed into AI and invariably drive the way we think about them and the way we interact with them. Yet can we trust them? On Friday, Sky News revealed how it was fabricating entire transcripts of a podcast, Politics at Sam and Anne's, that I do. When challenged, it doubles down, gets shirty. And only under sustained pressure does it cave in. The research says it's getting worse. Internal tests by ChatGPT's owner OpenAI have found that the most recent models or versions that are used by ChatGPT are more likely to \"hallucinate\" - come up with answers that are simply untrue. The o3 model was found to hallucinate in 33% of answers to questions when tested on publicly available facts; the o4-mini version did worse, generating false, incorrect or imaginary information 48% of the time.  ChatGPT itself says that the shift to GPT-4o \"may have unintentionally increased what users perceive as 'bluffing'\" - confidently giving wrong or misleading answers without admitting uncertainty or error. In a written query, ChatGPT gave four reasons. This is its explanation: 1. Increased fluency and confidence: GPT-4o is better at sounding human and natural. That polish can make mistakes seem more like deliberate evasions than innocent errors - even when there's no intent to \"hide\" anything. 2. Smarter, but not omniscient: The model is faster and more responsive, but still has blind spots. When it doesn't know something, it sometimes \"hallucinates\" (makes things up) with fluent language, which can feel like bluffing. 3. Less interruption and hedging: In older models, you'd often see more qualifiers like \"I'm not sure\" or \"I may be wrong.\" In GPT-4o, some of that hedging was toned down for clarity and readability - but that can come at the cost of transparency about uncertainty. 4. Prompt tuning and training balance: Behind the scenes, prompt engineering and tuning decisions can shift the model's balance between confidence, humility, and accuracy. It's possible the newer tuning has dialled up assertiveness slightly too far. But can we trust even this? I don't know. What I do know is that the efforts of developers to make it all feel more human suggest they want us to. Critics say we are anthropomorphising AI by saying it lies since it has no consciousness - yet the developers are trying to make it sound more like one of us. Read more from Sky News:Man chased on tarmac at Heathrow AirportSoldier arrested on suspicion of raping woman What I do know is that even when pressed on this subject by me, it is still evasive. I interviewed ChatGPT about lying - it initially claimed things were getting better, and only admitted they are worse when I insisted it look at the stats. Watch that before you decide what you think. AI is a tremendous tool - but it's too early to take it on trust."
    },
    {
        "title": "Judge dismisses Justin Baldoni's defamation claim against former co-star Blake Lively",
        "description": "A judge in the US has dismissed actor Justin Baldoni's $400m (&#163;295m) defamation lawsuit against his It Ends With Us co-star Blake Lively.",
        "url": "https://news.sky.com/story/judge-dismisses-justin-baldonis-defamation-claim-against-former-co-star-blake-lively-13381365",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-blake-lively-justin-baldoni_6783204.jpg?20241222130409",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-09 18:03:00",
        "Headline": "The judge's decision is the latest development in the legal battle between the It Ends With US co-stars, which includes Lively suing Baldoni in December.",
        "Content": "A judge in the US has dismissed actor Justin Baldoni's $400m (£295m) defamation lawsuit against his It Ends With Us co-star Blake Lively. Baldoni filed the countersuit against the 37-year-old in response to her launching legal action in December, accusing him of sexual harassment against her while filming the 2024 movie. The 41-year-old and production company Wayfarer Studios countersued in January for $400m, accusing Lively and her husband, \"Deadpool\" actor Ryan Reynolds, their publicist, the New York Times, and others of orchestrating a smear campaign to extort him. He accused Lively of trying to \"hijack\" the movie and then blaming him when her \"disastrous\" promotional approach prompted an online backlash against her. \"It Ends With Us\" garnered mixed reviews, but grossed more than $351m (£259m) worldwide, according to reports. In a statement, lawyers representing Lively said: \"Today's opinion is a total victory and a complete vindication for Blake Lively, along with those that Justin Baldoni and the Wayfarer Parties dragged into their retaliatory lawsuit, including Ryan Reynolds, Leslie Sloane and The New York Times. \"As we have said from day one, this '$400 million' lawsuit was a sham, and the court saw right through it. \"We look forward to the next round, which is seeking attorneys' fees, treble damages and punitive damages against Baldoni, Sarowitz, Nathan, and the other Wayfarer Parties who perpetrated this abusive litigation.\" Sky News has approached Baldoni's representatives for comment. US District Court Judge Lewis Liman has ruled that Baldoni can't sue Lively for defamation over claims she made in her lawsuit, because allegations made in a lawsuit are exempt from libel claims. The judge also dismissed Baldoni's defamation lawsuit against The New York Times, which had reported on Lively's sexual harassment allegations. Read more:Lively and Baldoni's lawyers told to stop discussing casesAmber Heard reacts to Lively's complaint about Baldoni  Mr Liman also ruled that Baldoni's claims that Lively stole creative control of the film didn't count as extortion under California law. Baldoni's legal team can revise the lawsuit if they want to pursue different claims related to whether Lively breached a contract, the judge said. \"It Ends With Us,\" an adaptation of Colleen Hoover's bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August last, exceeding box office expectations with a $50m (£37m) debut. But the movie's release was shrouded by speculation over discord between Lively and Baldoni."
    },
    {
        "title": "Sly Stone, pioneer of early funk music, dies after 'prolonged' battle with illness",
        "description": "Sly Stone, one of the pioneers of funk music, has died aged 82, his family have said.",
        "url": "https://news.sky.com/story/sly-stone-pioneer-of-early-funk-music-dies-after-prolonged-battle-with-illness-13381391",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sly-stone-funk_6937810.jpg?20250609213526",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-09 19:55:00",
        "Headline": "The musician played a leading role in introducing funk, an Afrocentric style of music driven by grooves and syncopated rhythms, to a broader audience through his band Sly And The Family Stone.",
        "Content": "Sly Stone, one of the pioneers of funk music, has died aged 82, his family have said. As front man for his band Sly And The Family Stone, the musician fused soul, rock, psychedelia and gospel to take the sound that defined an era in the 1960s into new territory, second only to James Brown as an early founder. Several of the band's seminal tracks became known to a wider audience when they were subsequently sampled by hip hop artists. \"Everyday People\" was sampled by Arrested Development, while \"Sing A Simple Song\" was sampled by Public Enemy, De La Soul and Dr Dre and Snoop Dogg. Stone's family said in a statement that he died after a battle with chronic obstructive pulmonary disease (COPD) and other health issues. A statement issued by his publicist on behalf of Stone's family said: \"It is with profound sadness that we announce the passing of our beloved dad, Sly Stone of Sly And The Family Stone. \"After a prolonged battle with COPD and other underlying health issues, Sly passed away peacefully, surrounded by his three children, his closest friend, and his extended family. \"While we mourn his absence, we take solace in knowing that his extraordinary musical legacy will continue to resonate and inspire for generations to come. \"Sly was a monumental figure, a groundbreaking innovator, and a true pioneer who redefined the landscape of pop, funk, and rock music. His iconic songs have left an indelible mark on the world, and his influence remains undeniable. \"In a testament to his enduring creative spirit, Sly recently completed the screenplay for his life story, a project we are eager to share with the world in due course, which follows a memoir published in 2024. \"We extend our deepest gratitude for the outpouring of love and prayers during this difficult time. We wish peace and harmony to all who were touched by Sly's life and his iconic music. \"Thank you from the bottom of our hearts for your unwavering support.\" Stone, born Sylvester Stewart in Texas, and his group, were regulars on the US music charts in the late 1960s and 1970s, with hits such as \"Dance to the Music,\" \"I Want To Take You Higher,\" \"Family Affair,\" \"If You Want Me to Stay,\" and \"Hot Fun in the Summertime\". He played a leading role in introducing funk, an Afrocentric style of music driven by grooves and syncopated rhythms, to a broader audience. James Brown had forged the elements of funk before Stone founded his band in 1966, but Stone's brand of funk drew new listeners. It was celebratory, eclectic, psychedelic and rooted in the counterculture of the late 1960s. However, Stone later fell on hard times and became addicted to cocaine, never staging a successful comeback. His music became less joyous in the 1970s, reflecting the polarisation of the country after opposition to the Vietnam War and racial tensions triggered unrest on college campuses and in African-American neighbourhoods in big US cities. Read more:Baldoni's defamation claim dismissedThe Day Of The Jackal author diesSnoop Dogg hopes to open burger van In 1971, Sly And The Family Stone released \"There's a Riot Goin' On,\" which became the band's only Number 1 album. Critics said the album's bleak tone and slurred vocals denoted the increasing hold of cocaine on Stone. But some called the record a masterpiece, a eulogy to the 1960s. In the early 1970s, Stone became erratic and missed shows. Some members left the band. But the singer was still a big enough star in 1974 to attract a crowd of 21,000 for his wedding to actress and model Kathy Silva at Madison Square Garden in New York. Ms Silva filed for divorce less than a year later. Sly And The Family Stone's album releases in the late 1970s and early 1980s flopped, as Stone racked up drug possession arrests. The band was inducted into the Rock & Roll Hall of Fame in 1993 and Stone was celebrated in an all-star tribute at the Grammy Awards in 2006. He sauntered on stage with a blond mohawk haircut but bewildered the audience by leaving mid-song. In 2011, after launching what would become a years-long legal battle to claim royalties he said were stolen, Stone was arrested for cocaine possession. That year, media reported Stone was living in a recreational vehicle parked on a street in South Los Angeles. Stone had a son, Sylvester, with Ms Silva. He had two daughters, Novena Carmel, and Sylvette \"Phunne\" Stone, whose mother was bandmate Cynthia Robinson."
    },
    {
        "title": "Author of The Day Of The Jackal Frederick Forsyth has died ",
        "description": "Frederick Forsyth, the author of The Day Of The Jackal, has died at the age of 86 after a brief illness, his literary agents Curtis Brown said.",
        "url": "https://news.sky.com/story/author-of-the-day-of-the-jackal-frederick-forsyth-has-died-13381346",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-the-day-of-the-jackal_6937710.jpg?20250609180116",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-09 16:48:00",
        "Headline": "The former RAF pilot and investigative journalist turned novelist was also known for his thrilling crime books The Fox, The Kill List and The Afghan.",
        "Content": " Frederick Forsyth, the author of The Day Of The Jackal, has died at the age of 86 after a brief illness, his literary agents Curtis Brown said. His book The Day Of The Jackal was turned into a 1973 film and last year a TV series on Sky Atlantic featuring Eddie Redmayne and Lashana Lynch. The best-selling author was surrounded by his family when he died on Monday morning, Curtis Brown added. Read more: Eddie Redmayne says preparing for role in film almost ended in disaster Forsyth, a former RAF pilot and investigative journalist turned novelist, was also known for his thrilling crime books The Fox, The Kill List and The Afghan. He was born in Ashford, Kent, in 1938 and joined the Royal Air Force in 1956 before leaving after two years to pursue a career in journalism. He covered international stories and the attempted assassination of French general Charles de Gaulle, which provided the inspiration for The Day Of The Jackal, which was published in 1971. In 2000, he became the first high-profile British writer to agree to publish a book exclusively on the internet. He revealed he had extensive involvement with MI6 in his 2015 memoir The Outsider: My Life In Intrigue. His agent Jonathan Lloyd said: \"We mourn the passing of one of the world's greatest thriller writers. \"Only a few weeks ago I sat with him as we watched a new and moving documentary of his life - In My Own Words, to be released later this year on BBC1 - and was reminded of an extraordinary life, well lived. \"After serving as one of the youngest ever RAF pilots, he turned to journalism, using his gift for languages in German, French and Russian to become a foreign correspondent in Biafra. \"Appalled at what he saw and using his experience during a stint as a secret service agent, he wrote his first and perhaps most famous novel, The Day Of The Jackal, and instantly became a global best-selling author. \"He went on to write more than 25 books (many of which were made into films) that have sold over 75 million copies. \"He will be greatly missed by his family, his friends, all of us at Curtis Brown and of course his millions of fans around the world - though his books will of course live on forever.\" The Day of the Jackal is available to watch on Sky Atlantic and NOW."
    },
    {
        "title": "Androids rom-com Maybe Happy Ending wins six major Tony Awards",
        "description": "Maybe Happy Ending, a romantic-comedy about a pair of androids falling in love, has won six Tony Awards, including best new musical.",
        "url": "https://news.sky.com/story/androids-rom-com-maybe-happy-ending-wins-six-major-tony-awards-13381099",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-darren-criss-tony-awards_6937326.jpg?20250609120439",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-09 09:35:00",
        "Headline": "The acclaimed Broadway production was one of the night's big winners, while other top prizes saw Kara Young become the first black person to win two awards consecutively.",
        "Content": "Maybe Happy Ending, a romantic-comedy about a pair of androids falling in love, has won six Tony Awards, including best new musical. The story charts the relationship between two decommissioned robots, becoming a commentary on human themes and the passage of time. Starring Darren Criss and Helen J Shen, Maybe Happy Ending enjoyed huge success at the 78th annual ceremony held at the Radio City Music Hall in New York on Sunday. The acclaimed Broadway production's awards also included Criss winning best leading actor in a musical, alongside prizes for best direction of a musical, best original theatre score, best book of a musical, and best scenic design of a musical. In other awards, Purpose, Branden Jacobs-Jenkins' drawing room drama about an accomplished black family exposing hypocrisy and pressures during a snowed-in gathering, won best new play. Jacobs-Jenkins becomes the first black playwright to win the award since August Wilson took home the accolade in 1987 for Fences. It underlines a triumphant year for Jacobs-Jenkins after scooping the Pulitzer Prize for Purpose - and winning back-to-back Tonys after his Appropriate won best play revival in 2024. Kara Young - the first black female actor to be nominated for a Tony in four consecutive years - became the first black person to win two awards consecutively, picking up the trophy for featured actress in a play for her work in Purpose. Sunset Blvd won best musical revival, handing composer Andrew Lloyd Webber his first competitive Tony since 1995, when the original show won. The current version is a stripped-down, minimalist production. Sarah Snook took home the trophy for leading actress in a play for her tireless work in The Picture Of Dorian Gray, where she plays all 26 roles. \"I don't feel alone any night that I do this show,\" Snook said, dismissing the idea of her play as a one-woman show. \"There are so many people onstage making it work and behind the stage making it work.\" Oh Mary! saw Sam Pinkleton win best director and Cole Escola landing best actor in a play. Francis Jue won best actor in a featured role in a play for his work in a revival of Yellow Face. Jak Malone won best actor in a featured role in a musical for the British import, Operation Mincemeat: A New Musical. Read more from Sky News:NHS issues appeal for regular blood donorsFirst black Premier League referee dies  Eureka Day, Jonathan Spector's social satire about well-meaning liberals debating a school's vaccine policy, won the best play revival trophy. Stranger Things: The First Shadow - based on the 12-time Emmy-winning Netflix hit sci-fi series, won best scenic design, lighting design and sound design of a play. The production, which has been running in London's West End, also picked up a special award for its illusions and technical effects."
    },
    {
        "title": "Syrian contractor discovers ancient Byzantine tomb complex during construction ",
        "description": "A Syrian contractor made a historic discovery when clearing the rubble of a destroyed home, stumbling upon remains of an underground Byzantine tomb complex.",
        "url": "https://news.sky.com/story/syrian-contractor-discovers-ancient-byzantine-tomb-complex-during-construction-13381022",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-byzantine-syria_6937165.jpg?20250609074221",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-06-09 06:43:00",
        "Headline": "Believed to be more than 1,500 years old from the Byzantine Empire, the ruins were found in Maarat al-Numan in Idlib province, located on the route between the cities of Aleppo and Damascus.",
        "Content": "A Syrian contractor made a historic discovery when clearing the rubble of a destroyed home, stumbling upon remains of an underground Byzantine tomb complex. Believed to be more than 1,500 years old, the ruins were found in Maarat al-Numan in Idlib province, located on the route between the cities of Aleppo and Damascus. Residents there have been rebuilding their communities after the collapse of Bashar al Assad's regime last December. After the contractor found stone openings during a reconstruction project, locals contacted the authorities, who then dispatched a specialised team to inspect and secure the site. Images of the complex show that a pit next to a damaged building leads down to the openings of two burial chambers, each containing six stone tombs, with the sign of the cross etched into the top of one stone column. Hassan al Ismail, director of antiquities in Idlib, said that \"based on the presence of the cross and the pottery and glass pieces that were found, this tomb dates back to the Byzantine era\". Idlib \"has a third of the monuments of Syria, containing 800 archaeological sites in addition to an ancient city\", he said. The Byzantine Empire began in the 4th century AD, and was a continuation of the Roman Empire with its capital in Constantinople - now Istanbul in Turkey - and Christianity as its official religion. Ghiath Sheikh Diab, a resident who witnessed the moment when the complex was uncovered, told the Associated Press that under Assad, people in Syria who found archaeological ruins would cover them up over fears their properties would be seized under Assad. Read more from Sky News:Downtown LA is a scene of pandemonium and lawlessnessMan wrongly deported to El Salvador has been returned to USBritish soldier arrested on suspicion of raping woman in Kenya Another local, Abed Jaafar, said: \"In the old days, a lot of foreign tourists used to come to Maarat just to see the ruins. \"We need to take care of the antiquities and restore them and return them to the way they were before... and this will help to bring back the tourism and the economy.\""
    }
]