[
    {
        "title": "At least 13 people confirmed dead and more than 20 missing from girls camp in Texas flooding  ",
        "description": "At least 13 people have been killed in the US state of Texas after heavy rain caused flash flooding, according to local media reports.",
        "url": "https://news.sky.com/story/at-least-13-people-confirmed-dead-and-more-than-20-missing-from-girls-camp-in-texas-flooding-13392488",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-flood-texas_6957436.jpg?20250704221222",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-04 14:57:00",
        "Headline": "The missing children were among more than 700 who were at a summer camp when floodwaters swept through at around 4am local time.",
        "Content": " At least 13 people have been killed in the US state of Texas after heavy rain caused flash flooding, according to local media reports. Officials have also said 23 children are missing from a girls' camp in Texas. As much as 10 inches (25 centimetres) of heavy rain fell in just a few hours overnight in central Kerr County, causing flash flooding of the Guadalupe River. An official in the city of Kerville told reporters the flooding struck before dawn \"over a very short period of time that could not be predicted, even with the radar\". Judge Rob Kelly, the chief elected official in the county, confirmed fatalities from the flooding and dozens of water rescues so far. The judge told reporters at a news conference that \"most\" of the bodies are yet to be identified. \"We're trying to get the identity of these folks, but we don't have it yet,\" he said. \n                  King Of The Hill and Parks And Recreation actor Jonathan Joss shot dead in Texas\n                 \n                  Man charged after British student nurse stabbed to death in Texas 'following fight over cat'\n                 \n                  Texas: Second child with measles dies as US outbreak spreads\n                 More than 20 girls unaccounted for  Emergency services are continuing a frantic search to find those missing - including 23 girls. The children were among more than 700 who were at a summer camp when floodwaters swept through at around 4am local time. Most of the campers are safe but they could not be immediately evacuated because high waters have made local roads unusable, authorities said. \"Everybody is doing everything in their power to get these kids out,\" Judge Kelly said. Asked why more precautions were not taken amid forecasts for stormy weather, Judge Kelly insisted a disaster of such magnitude was unforeseen. \"We have floods all the time. This is the most dangerous river valley in the United States,\" he said, adding, \"We had no reason to believe this was going to be anything like what's happened here. None whatsoever.\" Search teams are flying 14 helicopters and a dozen drones over the area, while hundreds of emergency personnel are on the ground conducting rescues. People desperately searching for their loved ones have posted comments on a Facebook post from the Kerr County sheriff's office. One woman said she couldn't reach her daughter, who had rented a cabin with her husband and two children. She pleaded for officials to release the names of those who have been evacuated."
    },
    {
        "title": "Inside Iran's Evin Prison - as Tehran says damage shows Israel targeted civilians",
        "description": "It is one of the most notorious and secret places in Iran.",
        "url": "https://news.sky.com/story/inside-irans-notorious-evin-prison-as-tehran-says-damage-shows-israel-targeted-civilians-13392407",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-evin-prison-iran_6957141.jpg?20250704160749",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-04 14:45:00",
        "Headline": "The authorities say at least 71 people were killed in air strikes at the prison, some of them inmates, but also visiting family members. But our visit highlighted the prison's notoriety too.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  It is one of the most notorious and secret places in Iran. Somewhere foreign journalists are never allowed to visit or film. The prison where dissidents and critics of Iran's government disappear - some never to be seen again. But we went there today, invited by Iranian authorities eager to show the damage done there by Israel. Evin Prison was hit by Israeli airstrikes the day before a ceasefire ended a 12-day war with Iran. The damage is much greater than thought at the time. We walked through what's left of its gates, now a mass of rubble and twisted metal, among just a handful of foreign news media allowed in. A few hundred yards in, we were shown a building Iranians say was the prison's hospital. Behind iron bars, every one of the building's windows had been blown in. Medical equipment and hospital beds had been ripped apart and shredded. It felt eerie being somewhere normally shut off to the outside world. On the hill above us, untouched by the airstrikes, the buildings where inmates are incarcerated in reportedly horrific conditions, ominous watch towers silhouetted against the sky. Evin felt rundown and neglected. There was something ineffably sad and oppressive about the atmosphere as we wandered through the compound. The Iranians had their reasons to bring us here. The authorities say at least 71 people were killed in the air strikes, some of them inmates, but also visiting family members. Iran says this is evidence that Israel was not just targeting military or nuclear sites but civilian locations too. But the press visit highlighted the prison's notoriety too. Iran's critics and human rights groups say Evin is synonymous with the brutal oppression of political prisoners and opponents, and its practice of hostage diplomacy too. British dual nationals, including Nazanin Zaghari-Ratcliffe were held here for years before being released in 2022 in exchange for concessions from the UK. Read more:Iran: Still a chance for peace talks with USWhy Netanyahu wants a 60-day ceasefire - analysis Interviewed about the Israeli airstrikes at the time, Ms Zaghari-Ratcliffe showed only characteristic empathy with her former fellow inmates. Trapped in their cells, she said they must have been terrified. The Israelis have not fully explained why they put Evin on their target list, but on the same day, the Israeli military said it was \"attacking regime targets and government repression bodies in the heart of Tehran\". The locus of their strikes were the prison's two entrances. If they were trying to enable a jailbreak, they failed. No one is reported to have escaped, several inmates are thought to have died. The breaches the Israeli missiles made in the jail's perimeter are being closed again quickly. We filmed as a team of masons worked to shut off the outside world again, brick by brick."
    },
    {
        "title": "Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music",
        "description": "Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait.",
        "url": "https://news.sky.com/story/gallagher-brothers-share-a-high-five-and-hug-as-oasis-reunite-on-stage-after-16-years-13392600",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff-gig-concert_6957384.jpg?20250704234946",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-04 22:23:00",
        "Headline": "Oasis sounded almost as good as they ever have when they performed on stage at Cardiff's Principality Stadium during the first night of their world tour.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait. After the split in 2009, for many years Noel said he would never go back - and for a long time, as the brothers exchanged insults through separate interviews (and on social media, for Liam), it seemed pretty unlikely to ever happen. But now, here they are. As they walked out on stage at Cardiff's Principality Stadium, all eyes were on the Gallaghers for a sense of their relationship - dare we say it, friendship? - now after all these years. As it happened: How Oasis's first gig together in 16 years unfolded There was no reference to their fall-out or making up, but the gestures were there - lifting hands together as they walked out for the first time. Headlines and tweets of speculation and then confirmation of the reunion filled the screens as the show started. \"This is happening,\" said one, repeatedly. In the end, it was all about the music. \n                  Oasis tour: What you need to know - and why Cardiff is the first stop\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 \n                  Liam Gallagher hits out at  Edinburgh council after Oasis fans branded 'rowdy'\n                 Liam has received criticism in the past for his voice not being what it once was, but back on stage with his brother tonight he delivered exactly what fans would have hoped for - a raw, steely-eyed performance, snarling vocals, and the swagger that makes him arguably the greatest frontman of his day. This was Oasis sounding almost as good as they ever have.  They opened with Hello, because of course, \"it's good to be back\". And then Acquiesce, and those lyrics: \"Because we need each other/ We believe in one another.\" The song is said to be about friendship in the wider sense, rather than their brotherly bond and sibling rivalry, but you can't help but feel like it means something here. Over two hours, they played favourite after favourite - including Morning Glory, Some Might Say, Cigarettes & Alcohol, Supersonic and Roll With It. In the mid-section, Liam takes his break for Noel to sing Talk Tonight, Half The World Away and Little By Little; the tempo slows but there is by no means a lull, with the fans singing all his words back to him. Liam returns for hits including Stand By Me, Slide Away, Whatever and Live Forever, before sending the crowd wild (or even wilder) with Rock And Roll Star. When the reunion announcement was made last summer, it quickly became overshadowed by the controversy of dynamic pricing causing prices to rocket. As he has done on X before, Liam addressed the issue on stage with a joke. \"Was it worth the £4,000 you paid for the ticket?\" he shouted at one point. \"Yeah,\" the crowd shouts back; seemingly all is forgiven. After Rock And Roll Star, the dream that very quickly became a reality for this band, Noel introduced the rest of the group, calling Bonehead a \"legend\". Then he acknowledges all their young fans, some who maybe weren't even born when they split. \"This one is for all the people in their 20s who've never seen us before, who've kept this shit going,\" he says before the encore starts with The Masterplan. Noel follows with Don't Look Back In Anger, and the screens fill with Manchester bees in reference to the arena bombing and how the song became the sound of hope and defiance for the city afterwards.  During Wonderwall, there's a nice touch as Liam sings to the crowd: \"There are many things I would like to say to you, but I don't speak Welsh.\" It is at the end of Champagne Supernova, which closes the set, that it happens; Noel puts down his guitar, and they come together for a high-five and a back-slap, a blink-and-you'd miss it hug.  Read more:What you need to know about the Oasis tourLiam Gallagher hits out at council after fans branded 'rowdy' \"Right then, beautiful people, this is it,\" Liam had told the crowd as he introduced the song just a few minutes earlier. \"Nice one for putting up with us over the years.\" From the roar of the audience, it's safe to say most people here would agree it's been worth it."
    },
    {
        "title": "Palestine Action to be banned as terrorist organisation at midnight – after losing late legal challenge ",
        "description": "Palestine Action will be banned as a terrorist group after losing a legal challenge less than two hours before the law comes into force. \n",
        "url": "https://news.sky.com/story/palestine-action-loses-bid-to-gain-temporary-block-on-government-ban-13392244",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-high-court-palestine-action_6956885.jpg?20250704111515",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-07-04 09:19:00",
        "Headline": "The protest group is set to be added to the list of proscribed terrorist groups from midnight.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Palestine Action will be banned as a terrorist group after losing a legal challenge less than two hours before the law comes into force. \n MPs overwhelmingly voted in favour of Home Secretary Yvette Cooper's decision to proscribe the protest group under the Terrorism Act 2000 and Lords have backed the move. The law change, which adds Palestine Action to the list of banned organisations along with the likes of al Qaeda, ISIS and Hezbollah, will come into force at midnight. It makes membership of, or support for, the direct action group a criminal offence punishable by up to 14 years in prison, while even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. Ms Cooper announced plans to proscribe Palestine Action after two Voyager aircraft were allegedly damaged at RAF Brize Norton in Oxfordshire on 20 June, which police said caused around £7m worth of damage. But the High Court heard the decision had been taken before the incident and as early as March this year. Huda Ammori, the co-founder of Palestine Action, is seeking to bring a legal challenge against the Home Office with a hearing for permission to bring a judicial review set to take place during the week of 21 July. \n                  Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music\n                 \n                  Former Arsenal player Thomas Partey charged with rape\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 Her lawyers applied for \"interim relief\" on Friday to temporarily block the legislation from coming into force until that hearing, arguing the Irish author Sally Rooney, who wrote Normal People, was among supporters who fear the \"ramifications\". But Mr Justice Chamberlain refused the application, saying: \"I have concluded that the harm which would ensue if interim relief is refused but the claim later succeeds is insufficient to outweigh the strong public interest in maintaining the order in force.\" He refused permission to appeal but lawyers representing Ms Ammori applied directly to the Court of Appeal for a rare urgent hearing to challenge the decision. Three judges, including the Lady Chief Justice Baroness Carr, refused permission to appeal in a ruling less than two hours before the ban was due to come into force. Around two hundred protestors earlier gathered outside court in support of the group, with some banging drums, waving Palestinian flags, wearing the keffiyeh scarf or holding placards and signs. Counter-protesters also arrived amid a heavy police presence. Raza Husain KC - one of 13 barristers inside a courtroom packed with journalists and members of the public - said his client Ms Ammori was inspired by the \"long tradition\" of direct action in the UK from suffragettes and activists protesting against apartheid and the Iraq war. \"This is the first time in our history a direct action, civil disobedience group which does not advocate violence has sought to be proscribed as terrorists,\" he said. \"We ask you to suspend, in the first instance until 21 July, what we say is an ill-considered, discriminatory, authoritarian abuse of statutory power that is alien to the basic tradition of common law and contrary to the Human Rights Act.\" Blinne Ni Ghralaigh KC, also representing Ms Ammori, said, along with the hundreds of T-shirts in circulation, the red boiler suits associated with the group and even kaffiyehs could \"arouse suspicion of membership\". She said the ban would have a \"chilling effect\" on protest and free speech, criminalising \"a huge range of behaviour\", and having \"severe and far reaching\" consequences capable of impacting \"vast numbers\" of people across the UK and further afield. But Ben Watson KC, representing the government, said former members would still be free to express their views, and would not be treated any differently even if their protests involved direct action which is criminal. He argued a temporary block would be a \"serious disfigurement of the statutory regime\" and Palestine Action could challenge the home secretary's decision at a specialist tribunal, rather than at the High Court. \"The serious issue to be tried is met in full by the adequate alternative remedy that parliament has provided,\" he said. \"Even if the court does conclude that there is some residual scope for judicial review… then we respectfully submit that the court needs to look at the bespoke regime that parliament has provided.\""
    },
    {
        "title": "Emma Raducanu out of Wimbledon after losing to world number one Aryna Sabalenka",
        "description": "Emma Raducanu has been knocked out of Wimbledon after losing to top seed Aryna Sabalenka in the third round.",
        "url": "https://news.sky.com/story/emma-raducanu-out-of-wimbledon-after-losing-to-world-number-one-aryna-sabalenka-13392582",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-emma-raducanu-wimbledon_6957469.jpg?20250704223610",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-04 21:17:00",
        "Headline": "The 22-year-old British player lost to the Belarusian who won in straight sets 7-6 6-4 after two hours under the roof on Centre Court.",
        "Content": "Emma Raducanu has been knocked out of Wimbledon after losing to top seed Aryna Sabalenka in the third round. The British number one went toe-to-toe at times with Sabalenka and put in arguably her best performance in years, with the first set decided on a tie-break. But the 22-year-old eventually lost to the Belarusian player who won in straight sets 7-6 6-4 after two hours under the roof on Centre Court. The world number one has now set up a fourth-round clash with Belgium's Elise Mertens. Raducanu's defeat means there is only one Briton left in the women's singles - Sonay Kartal. Kartal, the British number three, plays Russian Anastasia Pavlyuchenkova in round four. In the men's singles, Cameron Norrie is the only Briton left in the draw and he will face Chilean qualifier Nicolas Jarry in the last 16. \n                  Which British tennis players are still in Wimbledon?\n                 \n                  How much do tennis players earn in prize money at Wimbledon - and why Alcaraz's next opponent may not be able to claim his full amount\n                 \n                  Meet the three British teenagers handed Wimbledon wildcards\n                 In the Raducanu match, the first set took 74 minutes, with the British star saving seven set points and creating one of her own, while she led 4-1 in the second. Raducanu was one point away from taking a 5-1 lead, and it seemed she might pull off one of the most improbable wins against an opponent who has contested the last three Grand Slam finals. But it was not meant to be as Sabalenka recovered to win the last five games and extinguish Raducanu's hopes of reaching the fourth round for a third time. Sabalenka, 27, said of her rival: \"She played such incredible tennis and she pushed me really hard to get this win. I fight for every point like crazy. \"I'm super happy to see her healthy and back on track. I'm pretty sure that she will be back in the top 10 soon. \"What an atmosphere, my ears are still hurting. I was telling myself, just pretend they're cheering for you, and I was having goosebumps.\""
    },
    {
        "title": "Starmer would be foolish not to recognise the threat posed by a left-wing Corbyn party",
        "description": "Those of us who remember Jeremy Corbyn's leadership of the Labour Party with a fond nostalgia will never forget how chaotic it was.",
        "url": "https://news.sky.com/story/starmer-would-be-foolish-not-to-recognise-the-threat-posed-by-a-left-wing-corbyn-party-13392478",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeremy-corbyn-keir_6957272.jpg?20250704205645",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-07-04 16:51:00",
        "Headline": "\"His new party will be enough to lose Labour many, many seats in 2029,\" said Reform UK's Zia Yusuf.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Those of us who remember Jeremy Corbyn's leadership of the Labour Party with a fond nostalgia will never forget how chaotic it was. I recall a shadow cabinet reshuffle briefing that took place after midnight and, on another occasion, a phone call at 1.50am to inform me Mr Corbyn had sacked Hilary Benn from the shadow cabinet. And so we shouldn't be surprised that his attempt to launch a new left-wing party to challenge Sir Keir Starmer has already descended into chaos and farce. And it hasn't even been launched yet and doesn't have a name! As botched launches go, so far it's classic Corbyn. Though to be fair, the chaos isn't entirely his fault. The Financial Times quoted an ally of Mr Corbyn claiming he was frustrated that Zarah Sultana, the 31-year-old MP for Coventry South, announced he was launching a new party without consulting him first. \"Zarah has really overplayed her hand,\" according to the ally. \n                  How easy is it to set up a new political party?\n                 \n                  MP Zarah Sultana who was ousted from Labour announces new party with Jeremy Corbyn - but he says 'discussions ongoing'\n                 \n                  Labour MPs back Corbyn's calls for Chilcot-style inquiry into UK's role in Gaza war\n                 \"She jumped the gun to get the data and the donations.\" Then came an embarrassing rebuff from Mr Corbyn's two most senior allies during his leadership, his shadow chancellor John McDonnell and shadow home secretary Diane Abbott. Mr McDonell told me: \"Just to be absolutely clear, I am a Labour Party member. I have had the whip suspended, that's all, and I expect it back. \"Sad to see Zarah has gone, but I am remaining in the party and hope the whip will be restored soon.\" Labour's opponents, not surprisingly, are gloating, however. \"He has awful policies but is a vastly superior politician to Starmer,\" declared Reform UK's Zia Yusuf. \"His new party will be enough to lose Labour many, many seats in 2029. Likelihood of a Reform majority thus improve nicely.\" Politics latest: Follow live updates Sir Keir will no doubt claim Mr Corbyn's new party demonstrates how much his Labour Party has changed. It's a claim we've heard many times before. But the Labour leader and his top team would be foolish to dismiss the threat posed by Mr Corbyn, if and when he does indeed launch a new party. The other abiding memory of the Corbyn leadership is those mass rallies, with his adoring supporters singing \"Oh, Jeremy Corbyn!\" Let's not forget, either, how he rocked Glastonbury in 2017. Mr Corbyn may not get the backing of many Labour or independent pro-Gaza MPs. But left-wing Labour activists will flock to join a new Corbyn party in their thousands. Mr Corbyn is promising \"real change\", a \"new kind of political party\" and he says \"discussions are ongoing\". Watch this space, in other words. Some things never change, of course. Those things include the chaotic style of Mr Corbyn's leadership. But even with a botched launch, once his party is up and running it could potentially inflict real damage on Sir Keir's party. In elections next year and beyond, Labour could face the prospect of losing votes on the right to Reform UK and votes on the left to Mr Corbyn. With his massive cult following, Mr Corbyn has already demonstrated his ability to embarrass Sir Keir, when he won his Islington North seat as an independent in last year's general election. Now 76, opponents will claim Mr Corbyn is growing old disgracefully. But the old rebel loves nothing more than a protest, a march and a rally. He's not finished yet!"
    },
    {
        "title": "Former Arsenal player Thomas Partey charged with rape",
        "description": "Former Arsenal midfielder Thomas Partey has been charged with five counts of rape.",
        "url": "https://news.sky.com/story/former-arsenal-player-thomas-partey-charged-with-rape-13392365",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-partey-arsenal_6957062.jpg?20250704144608",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-04 13:37:00",
        "Headline": "The incidents are alleged to have taken place between 2021 and 2022. ",
        "Content": "Former Arsenal midfielder Thomas Partey has been charged with five counts of rape. The 32-year-old has also been charged with one count of sexual assault. Two of the counts of rape relate to one woman, three counts relate to a second woman, and the one count of sexual assault relates to a third woman. The incidents are alleged to have taken place between 2021 and 2022. Metropolitan Police said he is due to appear at Westminster Magistrates' Court on Tuesday 5 August. \"The charges follow an investigation by detectives, which commenced in February 2022 after police first received a report of rape,\" the force said. Detective Superintendent Andy Furphy said: \"Our priority remains providing support to the women who have come forward.\" Defence lawyer said: \"Thomas Partey denies all the charges against him. He has fully cooperated with the police and CPS throughout their three-year investigation. \"He now welcomes the opportunity to finally clear his name. Given that there are now ongoing legal proceedings, my client is unable to comment further.\" Partey has just left Arsenal after his contract expired and was said to be attracting interest from clubs including Juventus, Barcelona and Fenerbahce. The Ghanaian player was at the Emirates for five years after signing from Atletico Madrid and has also played dozens of times for his country. His time with Arsenal was marked by recurring injuries but he played 130 times for the club in the Premier League, including 35 times last season when he scored four goals. Anyone who has information about the case, or has been impacted by it, is being asked to contact the Met Police. "
    },
    {
        "title": "Details of Emmanuel Macron's unconventional UK state visit revealed - could Trump's be similar?",
        "description": "A personal greeting from the Prince and Princess of Wales and a carriage procession through Windsor await Emmanuel Macron and his wife, as the royals roll out the red carpet for the French president.",
        "url": "https://news.sky.com/story/details-of-macrons-unconventional-uk-state-visit-revealed-could-trumps-be-similar-13392233",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-emmanuel-macron-brigitte-macron_6927910.jpg?20250704103104",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-04 09:07:00",
        "Headline": "Events will centre around Windsor rather than Buckingham Palace, with the French leader and his wife getting the obligatory state banquet as well as visiting a horse they gave to Queen Elizabeth II for her jubilee. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n A personal greeting from the Prince and Princess of Wales and a carriage procession through Windsor await Emmanuel Macron and his wife, as the royals roll out the red carpet for the French president. Details of the French state visit next week have been released, with a different look from usual, as the important diplomatic event takes place in Windsor and not around Buckingham Palace. In the first unusual step, the Prince and Princess of Wales will travel out to RAF Northolt and personally meet Mr Macron and his wife Brigitte off their plane, before travelling with them to Windsor. The King and Queen will then formally greet their guests on a special royal dais constructed in Datchet Road in Windsor town centre, with the castle the backdrop as gun salutes sound in nearby Home Park.  There will then be a carriage procession through the town and along part of the Long Walk, which leads to Windsor Castle, before the full ceremonial welcome takes place in the castle's quadrangle. Later, a grand state banquet will be held with both the King and President Macron giving speeches. Kensington Palace has not confirmed if Kate will attend. At a cancer wellbeing centre in Colchester this week, she talked about her \"rollercoaster\" cancer journey and how during recovery it can still be difficult to \"function normally at home as you perhaps once used to\".  Mr Macron's state visit, from 8 to 10 July, is the first at Windsor Castle rather than Buckingham Palace, in more than a decade - since that of Irish president Michael D Higgins in 2014. Windsor has been chosen because of refurbishment at Buckingham Palace. State visits are seen as the ultimate diplomatic gift the UK can offer, with the royals' soft power used to strengthen diplomatic ties. The French president will also visit the Palace of Westminster on Tuesday, where he will address parliamentarians in the Royal Gallery and meet opposition leaders at Lancaster House. On Wednesday, the president and Mrs Macron will join Prime Minister Sir Keir Starmer and Lady Starmer for lunch at Downing Street, ahead of a UK-France summit at Number 10 on Thursday. But it will be the personal touches that will no doubt make this a special visit for the Macrons. The King and Queen will take them to see a horse - Fabuleu de Maucour, a 10-year-old grey gelding Mr Macron gifted to known horse-lover Queen Elizabeth II in 2022 for her Platinum Jubilee. They will also view a Charabanc carriage from the Royal Mews, a present to Queen Victoria from King Louis-Philippe of France in 1844. And the Macrons will privately pay their respects and lay flowers at the late Queen's tomb in St George's Chapel in Windsor. The King - as ranger of Windsor Great Park - will also invite the president to tour the Windsor Castle Gardens, including areas of nature restoration and biodiversity and the wider Great Park. Read more from Sky News:Twenty hurt in Rome petrol station explosionRoman settlement uncovered after rare swords found The last state visit to the UK from France was in March 2008. The King and Queen paid their own a state visit to France in September 2023 and enjoyed a warm rapport with Mr and Mrs Macron, who will stay in the castle during their trip. Interestingly, the arrangements could be seen as a potential template for US President Donald Trump's high-profile state visit in September."
    },
    {
        "title": "Exclusive: Watchdog upholds nearly 100% of complaints about special educational needs in England",
        "description": "A watchdog is upholding 96% of the complaints it investigates about the provision of special educational needs in England, according to figures shared exclusively with Sky News.",
        "url": "https://news.sky.com/story/exclusive-watchdog-upholds-nearly-100-of-complaints-about-special-educational-needs-in-england-13391457",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/2372206090640195507_5799727.jpg?20250702181422",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-07-04 23:01:00",
        "Headline": "Complaints about providing support for children with Special Educational Needs and Disabilities (SEND) have risen almost 250% in the last five years.",
        "Content": "\n          North of England correspondent\n       A watchdog is upholding 96% of the complaints it investigates about the provision of special educational needs in England, according to figures shared exclusively with Sky News. The local government and social care ombudsman is the last port of call for families who have exhausted the complaints process at their local council when they cannot get the right support for their children. Amerdeep Somal, who heads the organisation, told Sky News the number of complaints they are receiving about Special Educational Needs and Disabilities (SEND) has also risen almost 250% in the last five years. She said: \"Some of those children will never reach their full potential. Often children lose years of their education and their development - sometimes at pivotal stages. \"We're seeing complaints about not doing assessments for Education Health and Care Plans, not doing reviews in good time, support specified in the plan not being put into place in schools - and also poor communication so parents don't know what is happening. \"There's been a huge surge in demand for plans. That means more complaints. That means more resources. More children need to be assessed, and that means more specialist input in schools. And that hasn't been keeping pace with the demands. \"The situation can't continue as it is at the moment - we need radical and urgent reform.\" \n                  London Welsh language school secures funding - but long-term future still in doubt\n                 \n                  Teachers given new guidance in dealing with AI-generated child sexual abuse material\n                 \n                  University of Dundee bosses quit after 'scathing' report into financial crisis\n                 In Sefton, 15-year-old Jacob is one of the children who has fallen through the cracks. He has needs, including autism and ADHD, and has not had a consistent school place for four years. His mum, Geraldine Pollock, says schools keep saying they cannot meet his needs, sometimes even after enrolling him. Currently, he has been out of school for over nine months, and Geraldine spends her days trying to teach him at home to the best of her ability. \"Absolutely horrific - that is the only word that I can use to describe it. I never, ever envisaged that, as a family, we would be put in this situation,\" she said. Geraldine says she almost lost her job because she had no option but to care for Jacob herself, and is still only able to work part-time. As soon as Jacob started at his latest school, she asked them to tell her upfront if they would not be able to meet his needs. \"I thought, we cannot go back to the dark place that we've been in,\" she said. \"They reassured me they had put everything in place - and they actually hadn't.\" \"When I think of it now, I think 'How I could I be so naive?' I never once thought you would literally be left on your own,\" she added. David Moorhead is another special needs parent in Sefton, Merseyside, who helps run a group called Voice of the Families, which has come together to push for more help for their children. What started as an informal group for local parents to support each other has now ballooned to more than 500 families. David says he was \"gobsmacked\" by the number of parents just in his area who all feel their children have been failed. \"Parents have left jobs, left careers just to be with their child. One mother had to cancel her own operation because there was no one to look after her child. \"Going out for a family meal, going on holiday - these aren't realities because your child needs a lot of attention, a lot support in order for them to flourish. \"They just push you off a cliff and you fall - and when you ask for help, it just doesn't come.\" Sefton Council said in a statement: \"We are working with the Voice of the Families group - we have listened to them and understand their concerns and will continue to feed their experiences into our improvements as a service so we can better support families on this journey. \"The demand for SEND support and the challenges in the system are seen across the country and we are working hard to meet the growing need for SEND support in Sefton. We have, and will continue to, pursue every avenue to expand our specialist SEND provision to meet the demand in our borough.\" Read more from Sky News:Report: All teachers need SEND trainingSchools hit by spiralling cost of special needsParents struggling to access special needs The Department for Education said it accepts the SEND system needs to be reformed, and is currently consulting on what shape that will take. The government plans to publish a White Paper in the autumn setting out the reforms, and says it recognises the 'immense need' in the sector."
    },
    {
        "title": "Bhim Kohli death: Sentence for 15-year-old boy who killed elderly man to be reviewed",
        "description": "A 15-year-old boy who killed a man in a Leicestershire park will have his sentence reviewed because it may have been too lenient.",
        "url": "https://news.sky.com/story/bhim-kohli-death-sentence-for-15-year-old-boy-who-killed-elderly-man-to-be-reviewed-13392437",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bhim-kohli-leicester_6935298.jpg?20250605171618",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-04 15:49:00",
        "Headline": "The child was handed a term of seven years' detention in June for the manslaughter of 80-year-old Bhim Kohli. It will be reviewed by the Court of Appeal under the unduly lenient sentence scheme.",
        "Content": "A 15-year-old boy who killed a man in a Leicestershire park will have his sentence reviewed because it may have been too lenient. The child, who cannot be named because of his age, was handed a term of seven years' detention in June for the manslaughter of 80-year-old Bhim Kohli. The Court of Appeal will review it under the unduly lenient sentence scheme. A spokesperson for the Attorney General's Office said: \"The Solicitor General, Lucy Rigby KC MP, was appalled by this violent, cowardly attack on an innocent man. She wishes to express her deepest sympathies to Bhim Kohli's friends and family at this difficult time. \"After undertaking a detailed review of the case, the Solicitor General concluded the sentence of the 15-year-old boy could be referred to the Court of Appeal. The court will determine if the sentence is increased or not.\" A 13-year-old girl was spared a custodial sentence for the same offence. She was aged 12 at the time of the incident on 1 September last year and was given a three-year youth rehabilitation order. It is believed the girl's sentence will not be referred to the Court of Appeal as the threshold had not been met. \n                  Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music\n                 \n                  Former Arsenal player Thomas Partey charged with rape\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 Both children had denied their part in killing the elderly dog walker, who died in hospital the day after the attack. But they were convicted of manslaugher by a jury in April, while the boy, who was aged 14 at the time of the killing, was cleared of murder. Leicester Crown Court heard Mr Kohli was racially abused when the boy pushed, kicked and punched him, and the girl encouraged him by recording parts of the attack while laughing. Mr Kohli was found lying on the ground in Franklin Park in Braunstone Town, near Leicester, and died the next evening of a spinal cord injury. He had been following a familiar routine, walking his beloved dog Rocky to the local park, just yards away from his home. But when he arrived at the park, he was attacked. The jury heard the girl had pointed Mr Kohli out to the boy, who then subjected the victim to a violent assault.  'Cowardly attack' High Court judge Mr Justice Turner called it a \"cowardly and violent attack\" on an elderly man who did \"nothing to deserve\" what happened to him. He told the boy: \"What you did was not one single attack which you immediately regretted, but two separate violent outbursts.\" The judge accepted that, while the girl had encouraged the boy's behaviour, she did not know he would use \"anything like the level of violence he did\". After the sentencing, Mr Kohli's family said they had \"no sympathy\" for his killers. His daughter, Susan Kohli, who found her father lying on the ground following the attack, said it was hard to find forgiveness for the pair, regardless of their ages. \"Why should they be given grace for what they have done?\" asked Ms Kohli. \"They chose to attack a defenceless pensioner and for that I cannot give them any of my sympathy.\" Read more from Sky News:Man jailed after persuading victim to attempt suicide onlineElephant kills British woman and New Zealander on walking safari Ms Kohli said she was \"angry and disappointed\" that the teenagers' sentence did not, in her view, reflect the severity of the crime. \"The death of my dad has left a hole in our family, a hole that can never be filled because of the actions of two teenagers on that Sunday evening last September,\" she said. \"I believe on that day the two teenagers made a choice. The teenage boy chose to attack my dad and the girl chose to film him being attacked. They knew what they were doing.\" She added: \"When they are released, they still have their full lives ahead of them. They can rebuild their lives. We can't.\""
    },
    {
        "title": "Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music",
        "description": "Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait.",
        "url": "https://news.sky.com/story/gallagher-brothers-share-a-high-five-and-hug-as-oasis-reunite-on-stage-after-16-years-13392600",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff-gig-concert_6957384.jpg?20250704234946",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-04 22:23:00",
        "Headline": "Oasis sounded almost as good as they ever have when they performed on stage at Cardiff's Principality Stadium during the first night of their world tour.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait. After the split in 2009, for many years Noel said he would never go back - and for a long time, as the brothers exchanged insults through separate interviews (and on social media, for Liam), it seemed pretty unlikely to ever happen. But now, here they are. As they walked out on stage at Cardiff's Principality Stadium, all eyes were on the Gallaghers for a sense of their relationship - dare we say it, friendship? - now after all these years. As it happened: How Oasis's first gig together in 16 years unfolded There was no reference to their fall-out or making up, but the gestures were there - lifting hands together as they walked out for the first time. Headlines and tweets of speculation and then confirmation of the reunion filled the screens as the show started. \"This is happening,\" said one, repeatedly. In the end, it was all about the music. \n                  Oasis tour: What you need to know - and why Cardiff is the first stop\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 \n                  Liam Gallagher hits out at  Edinburgh council after Oasis fans branded 'rowdy'\n                 Liam has received criticism in the past for his voice not being what it once was, but back on stage with his brother tonight he delivered exactly what fans would have hoped for - a raw, steely-eyed performance, snarling vocals, and the swagger that makes him arguably the greatest frontman of his day. This was Oasis sounding almost as good as they ever have.  They opened with Hello, because of course, \"it's good to be back\". And then Acquiesce, and those lyrics: \"Because we need each other/ We believe in one another.\" The song is said to be about friendship in the wider sense, rather than their brotherly bond and sibling rivalry, but you can't help but feel like it means something here. Over two hours, they played favourite after favourite - including Morning Glory, Some Might Say, Cigarettes & Alcohol, Supersonic and Roll With It. In the mid-section, Liam takes his break for Noel to sing Talk Tonight, Half The World Away and Little By Little; the tempo slows but there is by no means a lull, with the fans singing all his words back to him. Liam returns for hits including Stand By Me, Slide Away, Whatever and Live Forever, before sending the crowd wild (or even wilder) with Rock And Roll Star. When the reunion announcement was made last summer, it quickly became overshadowed by the controversy of dynamic pricing causing prices to rocket. As he has done on X before, Liam addressed the issue on stage with a joke. \"Was it worth the £4,000 you paid for the ticket?\" he shouted at one point. \"Yeah,\" the crowd shouts back; seemingly all is forgiven. After Rock And Roll Star, the dream that very quickly became a reality for this band, Noel introduced the rest of the group, calling Bonehead a \"legend\". Then he acknowledges all their young fans, some who maybe weren't even born when they split. \"This one is for all the people in their 20s who've never seen us before, who've kept this shit going,\" he says before the encore starts with The Masterplan. Noel follows with Don't Look Back In Anger, and the screens fill with Manchester bees in reference to the arena bombing and how the song became the sound of hope and defiance for the city afterwards.  During Wonderwall, there's a nice touch as Liam sings to the crowd: \"There are many things I would like to say to you, but I don't speak Welsh.\" It is at the end of Champagne Supernova, which closes the set, that it happens; Noel puts down his guitar, and they come together for a high-five and a back-slap, a blink-and-you'd miss it hug.  Read more:What you need to know about the Oasis tourLiam Gallagher hits out at council after fans branded 'rowdy' \"Right then, beautiful people, this is it,\" Liam had told the crowd as he introduced the song just a few minutes earlier. \"Nice one for putting up with us over the years.\" From the roar of the audience, it's safe to say most people here would agree it's been worth it."
    },
    {
        "title": "Former Arsenal player Thomas Partey charged with rape",
        "description": "Former Arsenal midfielder Thomas Partey has been charged with five counts of rape.",
        "url": "https://news.sky.com/story/former-arsenal-player-thomas-partey-charged-with-rape-13392365",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-partey-arsenal_6957062.jpg?20250704144608",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-04 13:37:00",
        "Headline": "The incidents are alleged to have taken place between 2021 and 2022. ",
        "Content": "Former Arsenal midfielder Thomas Partey has been charged with five counts of rape. The 32-year-old has also been charged with one count of sexual assault. Two of the counts of rape relate to one woman, three counts relate to a second woman, and the one count of sexual assault relates to a third woman. The incidents are alleged to have taken place between 2021 and 2022. Metropolitan Police said he is due to appear at Westminster Magistrates' Court on Tuesday 5 August. \"The charges follow an investigation by detectives, which commenced in February 2022 after police first received a report of rape,\" the force said. Detective Superintendent Andy Furphy said: \"Our priority remains providing support to the women who have come forward.\" Defence lawyer said: \"Thomas Partey denies all the charges against him. He has fully cooperated with the police and CPS throughout their three-year investigation. \"He now welcomes the opportunity to finally clear his name. Given that there are now ongoing legal proceedings, my client is unable to comment further.\" Partey has just left Arsenal after his contract expired and was said to be attracting interest from clubs including Juventus, Barcelona and Fenerbahce. The Ghanaian player was at the Emirates for five years after signing from Atletico Madrid and has also played dozens of times for his country. His time with Arsenal was marked by recurring injuries but he played 130 times for the club in the Premier League, including 35 times last season when he scored four goals. Anyone who has information about the case, or has been impacted by it, is being asked to contact the Met Police. "
    },
    {
        "title": "Palestine Action to be banned as terrorist organisation at midnight – after losing late legal challenge ",
        "description": "Palestine Action will be banned as a terrorist group after losing a legal challenge less than two hours before the law comes into force. \n",
        "url": "https://news.sky.com/story/palestine-action-loses-bid-to-gain-temporary-block-on-government-ban-13392244",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-high-court-palestine-action_6956885.jpg?20250704111515",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-07-04 09:19:00",
        "Headline": "The protest group is set to be added to the list of proscribed terrorist groups from midnight.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Palestine Action will be banned as a terrorist group after losing a legal challenge less than two hours before the law comes into force. \n MPs overwhelmingly voted in favour of Home Secretary Yvette Cooper's decision to proscribe the protest group under the Terrorism Act 2000 and Lords have backed the move. The law change, which adds Palestine Action to the list of banned organisations along with the likes of al Qaeda, ISIS and Hezbollah, will come into force at midnight. It makes membership of, or support for, the direct action group a criminal offence punishable by up to 14 years in prison, while even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. Ms Cooper announced plans to proscribe Palestine Action after two Voyager aircraft were allegedly damaged at RAF Brize Norton in Oxfordshire on 20 June, which police said caused around £7m worth of damage. But the High Court heard the decision had been taken before the incident and as early as March this year. Huda Ammori, the co-founder of Palestine Action, is seeking to bring a legal challenge against the Home Office with a hearing for permission to bring a judicial review set to take place during the week of 21 July. \n                  Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music\n                 \n                  Former Arsenal player Thomas Partey charged with rape\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 Her lawyers applied for \"interim relief\" on Friday to temporarily block the legislation from coming into force until that hearing, arguing the Irish author Sally Rooney, who wrote Normal People, was among supporters who fear the \"ramifications\". But Mr Justice Chamberlain refused the application, saying: \"I have concluded that the harm which would ensue if interim relief is refused but the claim later succeeds is insufficient to outweigh the strong public interest in maintaining the order in force.\" He refused permission to appeal but lawyers representing Ms Ammori applied directly to the Court of Appeal for a rare urgent hearing to challenge the decision. Three judges, including the Lady Chief Justice Baroness Carr, refused permission to appeal in a ruling less than two hours before the ban was due to come into force. Around two hundred protestors earlier gathered outside court in support of the group, with some banging drums, waving Palestinian flags, wearing the keffiyeh scarf or holding placards and signs. Counter-protesters also arrived amid a heavy police presence. Raza Husain KC - one of 13 barristers inside a courtroom packed with journalists and members of the public - said his client Ms Ammori was inspired by the \"long tradition\" of direct action in the UK from suffragettes and activists protesting against apartheid and the Iraq war. \"This is the first time in our history a direct action, civil disobedience group which does not advocate violence has sought to be proscribed as terrorists,\" he said. \"We ask you to suspend, in the first instance until 21 July, what we say is an ill-considered, discriminatory, authoritarian abuse of statutory power that is alien to the basic tradition of common law and contrary to the Human Rights Act.\" Blinne Ni Ghralaigh KC, also representing Ms Ammori, said, along with the hundreds of T-shirts in circulation, the red boiler suits associated with the group and even kaffiyehs could \"arouse suspicion of membership\". She said the ban would have a \"chilling effect\" on protest and free speech, criminalising \"a huge range of behaviour\", and having \"severe and far reaching\" consequences capable of impacting \"vast numbers\" of people across the UK and further afield. But Ben Watson KC, representing the government, said former members would still be free to express their views, and would not be treated any differently even if their protests involved direct action which is criminal. He argued a temporary block would be a \"serious disfigurement of the statutory regime\" and Palestine Action could challenge the home secretary's decision at a specialist tribunal, rather than at the High Court. \"The serious issue to be tried is met in full by the adequate alternative remedy that parliament has provided,\" he said. \"Even if the court does conclude that there is some residual scope for judicial review… then we respectfully submit that the court needs to look at the bespoke regime that parliament has provided.\""
    },
    {
        "title": "Exclusive: Watchdog upholds nearly 100% of complaints about special educational needs in England",
        "description": "A watchdog is upholding 96% of the complaints it investigates about the provision of special educational needs in England, according to figures shared exclusively with Sky News.",
        "url": "https://news.sky.com/story/exclusive-watchdog-upholds-nearly-100-of-complaints-about-special-educational-needs-in-england-13391457",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/2372206090640195507_5799727.jpg?20250702181422",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-07-04 23:01:00",
        "Headline": "Complaints about providing support for children with Special Educational Needs and Disabilities (SEND) have risen almost 250% in the last five years.",
        "Content": "\n          North of England correspondent\n       A watchdog is upholding 96% of the complaints it investigates about the provision of special educational needs in England, according to figures shared exclusively with Sky News. The local government and social care ombudsman is the last port of call for families who have exhausted the complaints process at their local council when they cannot get the right support for their children. Amerdeep Somal, who heads the organisation, told Sky News the number of complaints they are receiving about Special Educational Needs and Disabilities (SEND) has also risen almost 250% in the last five years. She said: \"Some of those children will never reach their full potential. Often children lose years of their education and their development - sometimes at pivotal stages. \"We're seeing complaints about not doing assessments for Education Health and Care Plans, not doing reviews in good time, support specified in the plan not being put into place in schools - and also poor communication so parents don't know what is happening. \"There's been a huge surge in demand for plans. That means more complaints. That means more resources. More children need to be assessed, and that means more specialist input in schools. And that hasn't been keeping pace with the demands. \"The situation can't continue as it is at the moment - we need radical and urgent reform.\" \n                  London Welsh language school secures funding - but long-term future still in doubt\n                 \n                  Teachers given new guidance in dealing with AI-generated child sexual abuse material\n                 \n                  University of Dundee bosses quit after 'scathing' report into financial crisis\n                 In Sefton, 15-year-old Jacob is one of the children who has fallen through the cracks. He has needs, including autism and ADHD, and has not had a consistent school place for four years. His mum, Geraldine Pollock, says schools keep saying they cannot meet his needs, sometimes even after enrolling him. Currently, he has been out of school for over nine months, and Geraldine spends her days trying to teach him at home to the best of her ability. \"Absolutely horrific - that is the only word that I can use to describe it. I never, ever envisaged that, as a family, we would be put in this situation,\" she said. Geraldine says she almost lost her job because she had no option but to care for Jacob herself, and is still only able to work part-time. As soon as Jacob started at his latest school, she asked them to tell her upfront if they would not be able to meet his needs. \"I thought, we cannot go back to the dark place that we've been in,\" she said. \"They reassured me they had put everything in place - and they actually hadn't.\" \"When I think of it now, I think 'How I could I be so naive?' I never once thought you would literally be left on your own,\" she added. David Moorhead is another special needs parent in Sefton, Merseyside, who helps run a group called Voice of the Families, which has come together to push for more help for their children. What started as an informal group for local parents to support each other has now ballooned to more than 500 families. David says he was \"gobsmacked\" by the number of parents just in his area who all feel their children have been failed. \"Parents have left jobs, left careers just to be with their child. One mother had to cancel her own operation because there was no one to look after her child. \"Going out for a family meal, going on holiday - these aren't realities because your child needs a lot of attention, a lot support in order for them to flourish. \"They just push you off a cliff and you fall - and when you ask for help, it just doesn't come.\" Sefton Council said in a statement: \"We are working with the Voice of the Families group - we have listened to them and understand their concerns and will continue to feed their experiences into our improvements as a service so we can better support families on this journey. \"The demand for SEND support and the challenges in the system are seen across the country and we are working hard to meet the growing need for SEND support in Sefton. We have, and will continue to, pursue every avenue to expand our specialist SEND provision to meet the demand in our borough.\" Read more from Sky News:Report: All teachers need SEND trainingSchools hit by spiralling cost of special needsParents struggling to access special needs The Department for Education said it accepts the SEND system needs to be reformed, and is currently consulting on what shape that will take. The government plans to publish a White Paper in the autumn setting out the reforms, and says it recognises the 'immense need' in the sector."
    },
    {
        "title": "Emma Raducanu out of Wimbledon after losing to world number one Aryna Sabalenka",
        "description": "Emma Raducanu has been knocked out of Wimbledon after losing to top seed Aryna Sabalenka in the third round.",
        "url": "https://news.sky.com/story/emma-raducanu-out-of-wimbledon-after-losing-to-world-number-one-aryna-sabalenka-13392582",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-emma-raducanu-wimbledon_6957469.jpg?20250704223610",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-04 21:17:00",
        "Headline": "The 22-year-old British player lost to the Belarusian who won in straight sets 7-6 6-4 after two hours under the roof on Centre Court.",
        "Content": "Emma Raducanu has been knocked out of Wimbledon after losing to top seed Aryna Sabalenka in the third round. The British number one went toe-to-toe at times with Sabalenka and put in arguably her best performance in years, with the first set decided on a tie-break. But the 22-year-old eventually lost to the Belarusian player who won in straight sets 7-6 6-4 after two hours under the roof on Centre Court. The world number one has now set up a fourth-round clash with Belgium's Elise Mertens. Raducanu's defeat means there is only one Briton left in the women's singles - Sonay Kartal. Kartal, the British number three, plays Russian Anastasia Pavlyuchenkova in round four. In the men's singles, Cameron Norrie is the only Briton left in the draw and he will face Chilean qualifier Nicolas Jarry in the last 16. \n                  Which British tennis players are still in Wimbledon?\n                 \n                  How much do tennis players earn in prize money at Wimbledon - and why Alcaraz's next opponent may not be able to claim his full amount\n                 \n                  Meet the three British teenagers handed Wimbledon wildcards\n                 In the Raducanu match, the first set took 74 minutes, with the British star saving seven set points and creating one of her own, while she led 4-1 in the second. Raducanu was one point away from taking a 5-1 lead, and it seemed she might pull off one of the most improbable wins against an opponent who has contested the last three Grand Slam finals. But it was not meant to be as Sabalenka recovered to win the last five games and extinguish Raducanu's hopes of reaching the fourth round for a third time. Sabalenka, 27, said of her rival: \"She played such incredible tennis and she pushed me really hard to get this win. I fight for every point like crazy. \"I'm super happy to see her healthy and back on track. I'm pretty sure that she will be back in the top 10 soon. \"What an atmosphere, my ears are still hurting. I was telling myself, just pretend they're cheering for you, and I was having goosebumps.\""
    },
    {
        "title": "Man accused of assaulting police at Manchester Airport 'headbutted' a traveller, court hears",
        "description": "A man accused of assaulting police at Manchester Airport was \"aggressive\" and \"headbutted\" a traveller earlier, a witness has told a court.",
        "url": "https://news.sky.com/story/brothers-used-high-level-of-violence-in-assault-on-police-at-manchester-airport-trial-hears-13392325",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mohammed-fahir-amaaz_6957412.jpg?20250704214418",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-04 12:40:00",
        "Headline": "A jury has been told police were called to the airport after a defendant allegedly became \"aggressive\" to another traveller in Starbucks. ",
        "Content": "A man accused of assaulting police at Manchester Airport was \"aggressive\" and \"headbutted\" a traveller earlier, a witness has told a court. The first incident took place at a Starbucks at terminal two of the airport and led to police being called, Liverpool Crown Court heard. When officers arrived, they traced brothers Mohammed Fahir Amaaz, 20, and Muhammad Amaad, 26, who were leaving the airport after picking up their mother. Police arrived to arrest the pair as they went to pay for parking. But the brothers are alleged to have assaulted three officers after using a \"high level of violence\" to resist arrest. The jury has been shown CCTV of both incidents. The siblings, from Rochdale in Greater Manchester, deny the allegations on 23 July last year and claim self-defence. Traveller Abdulkareem Ismaeil and Amaaz's mother were on the same flight, on which \"something happened\" that upset her, the jury heard. \n                  Three teenagers arrested after boy, 14, stabbed to death in north Manchester\n                 \n                  Inside the cannabis farms being set up in rented homes\n                 \n                  Four Just Stop Oil activists jailed for plotting to disrupt Manchester Airport\n                 Later, while leaving the airport with his wife and three young children, he stopped at Starbucks, where the defendant's mother pointed him out to her sons. The manager of the Starbucks, Cameron Cartledge, told the court he heard \"raised voices\" and went to the door, where he saw a man - identified as Amaaz - \"quite close\" to Mr Ismaeil and \"shouting at him\". Mr Cartledge said the shouting was in a foreign language he did not understand. \"At the time of the arguing he was very close to him, like in his face,\" he said. \"Blue track-suit man seemed quite aggressive, obviously annoyed about something, I don't know what. Blue track-suit man was aggressively shouting. \"Because his body language, his tone of voice was quite aggressive.\" Mr Cartledge continued: \"There was arguing, I don't know what was being said, then blue track-suit man headbutted the man we see in the black. \"He got him in the face. It did not look like it hurt Mr Ismaeil much but it was forceful enough to make him stagger back into the counter.\" Amaaz then threw two punches, Mr Cartledge said, adding that he thought they landed on Mr Ismaeil's shoulder. The two men were then split up, he added. When asked why he called the police, the witness replied: \"Well, he had just assaulted him.\" Read more from Sky News:Elephant kills British woman and New Zealander on safariAncient Roman settlement uncovered near Cotswolds Amaaz denies one count of assault to Mr Ismaeil and three counts of assault occasioning actual bodily harm to three police officers: PC Zachary Marsden, PC Ellie Cook and PC Lydia Ward. His brother, Amaad, denies one count of assault occasioning actual bodily harm to PC Marsden. The trial continues."
    },
    {
        "title": "Clear crisis as Starmer marks first year - here's what I've observed from last 12 months",
        "description": "July 5 2024, 1pm: I remember the moment so clearly.",
        "url": "https://news.sky.com/story/starmer-marks-first-year-with-a-clear-crisis-and-blow-to-his-leadership-13392156",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-starmer-keir_6956741.jpg?20250704063254",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-07-04 00:19:00",
        "Headline": "Starmer won power with the largest majority in a quarter of a century but he marks his first anniversary with the humiliation of having to abandon his flagship welfare reforms in a clear blow to his authority.",
        "Content": "\n          Political editor\n              @BethRigby\n  July 5 2024, 1pm: I remember the moment so clearly. Keir Starmer stepped out of his sleek black car, grasped the hand of his wife Vic, dressed in Labour red, and walked towards a jubilant crowd of Labour staffers, activists and MPs waving union jacks and cheering a Labour prime minister into Downing Street for the first time in 14 years. Starmer and his wife took an age to get to the big black door, as they embraced those who had helped them win this election - their children hidden in the crowd to watch their dad walk into Number 10. Politics latest: Corbyn starts new party Keir Starmer, not the easiest public speaker, came to the podium and told the millions watching this moment the \"country has voted decisively for change, for national renewal\". He spoke about the \"weariness at the heart of the nation\" and \"the lack of trust\" in our politicians as a \"wound\" that \"can only be healed by actions not words\". He added: \"This will take a while but the work of change begins immediately.\" A loveless landslide That was a day in which this prime minister made history. His was a victory on a scale that comes around but one every few decades. He won the largest majority in a quarter of a century and with it a massive opportunity to become one of the most consequential prime ministers of modern Britain - alongside the likes of Margaret Thatcher or Tony Blair. But within the win was a real challenge too. Starmer's was a loveless landslide, won on a lower share of the vote than Blair in all of his three victories and 6 percentage points lower than the 40% Jeremy Corbyn secured in the 2017 general election. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 It was the lowest vote share than any party forming a post-war majority government. Support for Labour was as shallow as it was wide. In many ways then, it was a landslide built on shaky foundations: low public support, deep mistrust of politicians, unhappiness with the state of public services, squeezed living standards and public finances in a fragile state after the huge cost of the pandemic and persistent anaemic growth. Put another way, the fundamentals of this Labour government, whatever Keir Starmer did, or didn't do, were terrible. Blair came in on a new dawn. This Labour government, in many ways, inherited the scorched earth. The one flash of anger I've seen For the past year, I have followed Keir Starmer around wherever he goes. We have been to New York, Washington (twice), Germany (twice), Brazil, Samoa, Canada, Ukraine, the Netherlands and Brussels. I can't even reel off the places we've been to around the UK - but suffice to say we've gone to all the nations and regions.  What I have witnessed in the past year is a prime minister who works relentlessly hard. When we flew for 27 hours non-stop to Samoa last autumn to the Commonwealth Heads of Government Meeting (CHOGM) summit, every time I looked up at the plane, I saw a solitary PM, his headlight shining on his hair, working away as the rest of us slept or watched films. He also seems almost entirely unflappable. He rarely expresses emotion. The only time I have seen a flash of anger was when I questioned him about accepting freebies in a conversation that ended up involving his family, and when Elon Musk attacked Jess Phillips. I have also witnessed him being buffeted by events in a way that he would not have foreseen. The arrival of Donald Trump into the White House has sucked the prime minister into a whirlwind of foreign crises that has distracted him from domestic events. When he said over the weekend, as a way of explanation not an excuse, that he had been caught up in other matters and taken his eye off the ball when it came to the difficulties of welfare reform, much of Westminster scoffed, but I didn't. I had followed him around in the weeks leading up to that vote. We went from the G7 in Canada, to the Iran-Israel 12-day war, to the NATO summit in the Hague, as the prime minister dealt with, in turn, the grooming gangs inquiry decision, the US-UK trade deal, Donald Trump, de-escalation in the Middle East and a tricky G7 summit, the assisted dying vote, the Iran-Israel missile crisis.  He was taking so many phone calls on Sunday morning from Chequers, that he couldn't get back to London for COBRA [national emergency meeting] because he couldn't afford to not have a secure phone line for the hour-long drive back to Downing Street. He travelled to NATO, launched the National Security Review and agreed to the defence alliance's commitment to spend 5% of GDP on defence by 2035. So when he came back from the Hague into a full-blown welfare rebellion, I did have some sympathy for him - he simply hadn't had the bandwidth to deal with the rebellion as it began to really gather steam. Dealing with rebellion Where I have less sympathy with the prime minister and his wider team is how they let it get to that point in the first place. Keir Starmer wasn't able to manage the latter stages of the rebellion, but the decisions made months earlier set it up in all its glory, while Downing Street's refusal to heed the concerns of MPs gave it momentum to spiral into a full-blown crisis. The whips gave warning after 120 MPs signed a letter complaining about the measures, the Work and Pensions Secretary Liz Kendall had done the same, but Starmer and Reeves were, in the words of one minister, \"absolutist\". \"They assumed people complaining about stuff do it because they are weak, rather than because they are strong,\" said the minister, who added that following the climbdown, figures in Number 10 \"just seemed completely without knowledge of the gravity of it\". That he marks his first anniversary with the humiliation of having to abandon his flagship welfare reforms or face defeat in the Commons - something that should be unfathomable in the first year of power with a majority that size - is disappointing. To have got it that wrong, that quickly with your parliamentary party, is a clear blow to his authority and is potentially more chronic. I am not sure yet how he recovers.  Keir Starmer said he wanted to rule country first, party second, but finds himself pinned by a party refusing to accept his centrist approach. Now, ministers tell MPs that there will be a financial consequence of the government's decision to delay tightening the rules on claiming disability benefits beyond the end of 2026. A shattered Rachel Reeves now has to find the £5bn she'd hoped to save another way. She will defend her fiscal rules, which leaves her the invidious choice of tax rises or spending cuts. Sit back and watch for the growing chorus of MPs that will argue Starmer needs to raise more taxes and pivot to the left. That borrowing costs of UK debt spiked on Wednesday amid speculation that the chancellor might resign or be sacked, is a stark reminder that Rachel Reeves, who might be unpopular with MPs, is the markets' last line of defence against spending-hungry Labour MPs. The party might not like her fiscal rules, but the markets do. What's on the horizon for year two? The past week has set the tone now for the prime minister's second year in office. Those around him admit that the parliamentary party is going to be harder to govern. For all talk of hard choices, they have forced the PM to back down from what were cast as essential welfare cuts and will probably calculate that they can move him again if they apply enough pressure. There is also the financial fall-out, with recent days setting the scene for what is now shaping up to be another definitive budget for a chancellor who now has to fill a multi-billion black hole in the public finances. But I would argue that the prime minister has misjudged the tone as he marks that first year. Faced with a clear crisis and blow to his leadership, instead of tackling that head on the prime minister sought to ignore it and try to plough on, embarking on his long-planned launch of the 10-year NHS plan to mark his year in office, as if the chancellor's tears and massive Labour rebellions over the past 48 hours were mere trifles.  It was inevitable that this NHS launch would be overshadowed by the self-inflicted shambles over welfare and the chancellor's distress, given this was the first public appearance of both of them since it had all blown up. But when I asked the prime minister to explain how it had gone so wrong on welfare and how he intended to rebuild your trust and authority in your party, he completely ignored my question. Instead, he launched into a long list of Labour's achievements in his first year: 4 million extra NHS appointments; free school meals to half a million more children; more free childcare; the biggest upgrade in employment rights for a generation; and the US, EU and India free trade deals.  I can understand the point he was making and his frustration that his achievements are being lost in the maelstrom of the political drama. But equally, this is politics, and he is the prime minister. This is his story to tell, and blowing up your welfare reform on the anniversary week of your government is not the way to do it. Is Starmer failing to articulate his mission? For Starmer himself, he will do what I have seen him do before when he's been on the ropes, dig in, learn from the errors and try to come back stronger. I have heard him in recent days talk about how he has always been underestimated and then proved he can do it - he is approaching this first term with the same grit. If you ask his team, they will tell you that the prime minister and this government is still suffering from the unending pessimism that has pervaded our national consciousness; the sense politics doesn't work for working people and the government is not on their side. Read more from Sky News:Analysis: PM's authority damagedNumbers behind housing pledgeFiscal rules are silly but important Starmer knows what he needs to do: restore the social contract, so if you work hard you should get on in life. The spending review and its massive capital investment, the industrial strategy and strategic defence review - three pieces of work dedicated to investment and job creation - are all geared to trying to rebuild the country and give people a brighter future. But equally, government has been, admit insiders, harder than they thought as they grapple with multiple crises facing the country - be that public services, prisons, welfare. It has also lacked direction. Sir Keir would do well to focus on following his Northern Star. I think he has one - to give working people a better life and ordinary people the chance to fulfil their potential. But somehow, the prime minister is failing to articulate his mission, and he knows that. When I asked him at the G7 summit in Canada what his biggest mistake of the first year was, he told me: \"We haven't always told our story as well as we should.\"  I go back to the Keir Starmer of July 5 2024. He came in on a landslide, he promised to change the country, he spoke of the lack of trust and the need to prove to the public that the government could make their lives better through actions not words. In this second year, he is betting that the legislation he has passed and strategies he has launched will drive that process of change, and in doing so, build back belief. But it is equally true that his task has become harder these past few weeks. He has spilled so much blood over welfare for so little gain, his first task is to reset the operation to better manage the party and rebuild support. But bigger than that, he needs to find a way to not just tell his government's story but sell his government's story. He has four years left."
    },
    {
        "title": "Bhim Kohli death: Sentence for 15-year-old boy who killed elderly man to be reviewed",
        "description": "A 15-year-old boy who killed a man in a Leicestershire park will have his sentence reviewed because it may have been too lenient.",
        "url": "https://news.sky.com/story/bhim-kohli-death-sentence-for-15-year-old-boy-who-killed-elderly-man-to-be-reviewed-13392437",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bhim-kohli-leicester_6935298.jpg?20250605171618",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-04 15:49:00",
        "Headline": "The child was handed a term of seven years' detention in June for the manslaughter of 80-year-old Bhim Kohli. It will be reviewed by the Court of Appeal under the unduly lenient sentence scheme.",
        "Content": "A 15-year-old boy who killed a man in a Leicestershire park will have his sentence reviewed because it may have been too lenient. The child, who cannot be named because of his age, was handed a term of seven years' detention in June for the manslaughter of 80-year-old Bhim Kohli. The Court of Appeal will review it under the unduly lenient sentence scheme. A spokesperson for the Attorney General's Office said: \"The Solicitor General, Lucy Rigby KC MP, was appalled by this violent, cowardly attack on an innocent man. She wishes to express her deepest sympathies to Bhim Kohli's friends and family at this difficult time. \"After undertaking a detailed review of the case, the Solicitor General concluded the sentence of the 15-year-old boy could be referred to the Court of Appeal. The court will determine if the sentence is increased or not.\" A 13-year-old girl was spared a custodial sentence for the same offence. She was aged 12 at the time of the incident on 1 September last year and was given a three-year youth rehabilitation order. It is believed the girl's sentence will not be referred to the Court of Appeal as the threshold had not been met. \n                  Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music\n                 \n                  Former Arsenal player Thomas Partey charged with rape\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 Both children had denied their part in killing the elderly dog walker, who died in hospital the day after the attack. But they were convicted of manslaugher by a jury in April, while the boy, who was aged 14 at the time of the killing, was cleared of murder. Leicester Crown Court heard Mr Kohli was racially abused when the boy pushed, kicked and punched him, and the girl encouraged him by recording parts of the attack while laughing. Mr Kohli was found lying on the ground in Franklin Park in Braunstone Town, near Leicester, and died the next evening of a spinal cord injury. He had been following a familiar routine, walking his beloved dog Rocky to the local park, just yards away from his home. But when he arrived at the park, he was attacked. The jury heard the girl had pointed Mr Kohli out to the boy, who then subjected the victim to a violent assault.  'Cowardly attack' High Court judge Mr Justice Turner called it a \"cowardly and violent attack\" on an elderly man who did \"nothing to deserve\" what happened to him. He told the boy: \"What you did was not one single attack which you immediately regretted, but two separate violent outbursts.\" The judge accepted that, while the girl had encouraged the boy's behaviour, she did not know he would use \"anything like the level of violence he did\". After the sentencing, Mr Kohli's family said they had \"no sympathy\" for his killers. His daughter, Susan Kohli, who found her father lying on the ground following the attack, said it was hard to find forgiveness for the pair, regardless of their ages. \"Why should they be given grace for what they have done?\" asked Ms Kohli. \"They chose to attack a defenceless pensioner and for that I cannot give them any of my sympathy.\" Read more from Sky News:Man jailed after persuading victim to attempt suicide onlineElephant kills British woman and New Zealander on walking safari Ms Kohli said she was \"angry and disappointed\" that the teenagers' sentence did not, in her view, reflect the severity of the crime. \"The death of my dad has left a hole in our family, a hole that can never be filled because of the actions of two teenagers on that Sunday evening last September,\" she said. \"I believe on that day the two teenagers made a choice. The teenage boy chose to attack my dad and the girl chose to film him being attacked. They knew what they were doing.\" She added: \"When they are released, they still have their full lives ahead of them. They can rebuild their lives. We can't.\""
    },
    {
        "title": "Tyler Webb sentenced to nine years imprisonment after persuading victim to attempt suicide online",
        "description": "A 23-year-old man who convinced his victim to attempt suicide and seriously self-harm online has become the first person sentenced under new internet safety laws.",
        "url": "https://news.sky.com/story/tyler-webb-sentenced-to-nine-years-imprisonment-after-persuading-victim-to-attempt-suicide-online-13392198",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tyler-webb-online-harm_6957232.jpg?20250704191334",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-04 14:20:00",
        "Headline": "After meeting his victim - who cannot be named - in an online forum dedicated to mental health last year, Webb began talking to her on the Telegram messaging app, and successfully persuaded her to self-harm.",
        "Content": "\n          Science and technology reporter\n       A 23-year-old man who convinced his victim to attempt suicide and seriously self-harm online has become the first person sentenced under new internet safety laws. Warning: This story contains details of encouraging self-harm and suicide which some readers might find disturbing Tyler Webb, from Loughborough, Leicestershire, was sentenced to nine years and four months imprisonment, subject to a hospital order. He will be taken back to the secure mental health hospital where he is being treated in Chesterfield. Once his doctors decide he is well enough to be discharged, he will serve out whatever time he has left in prison and will then be assessed by a board as to whether he is fit to be released. Webb is the first person in the country to be charged with encouraging serious self-harm online under Section 184 of the Online Safety Act 2023. He was also charged with encouraging suicide and pleaded guilty to both charges in May. During the sentencing at Leicester Crown Court, Webb was flanked by six officers and spent most of the hearing on the floor, which the defence described as a coping mechanism for his mental health issues. Grooming his victim After meeting his victim - who cannot be named for legal reasons - in an online forum dedicated to mental health last year, Webb began grooming her over several weeks and persuaded her to self-harm. The resulting injury had to be treated in hospital with stitches. The victim sent Webb a photograph of her injury, which prosecutors said showed he knew he had power over her. He repeatedly instructed her to self-harm and got annoyed when she did it without being told to, meaning he couldn't watch. Webb then convinced his victim to kill herself over a live video call while he watched. The suicide attempt failed, but only by chance, and the woman passed out on the call. When she came to, Webb told her to try again. The judge on Friday described Webb's actions as \"sexually motivated\" and said he wanted to see his victim die. Webb repeatedly told her she had nothing to live for and gave her methods to end her life, according to the CPS, while his victim said in a statement: \"He told me that my only value was in dying for his entertainment.\" \"Tyler Webb is a person who is manipulative, he's dangerous, he takes gratification in seeing other people hurt themselves,\" said CPS prosecutor Alex Johnson. \"He's a very dangerous person.\" In one 44-minute phone call, Webb persistently tried to get the woman to end her own life. When it became apparent she would not do so, he said he would block contact with her and threatened to move on to another victim instead. The woman then reported the interactions to the police, and Webb was arrested at his home by the Leicestershire force. After sending a recording of a call with Webb to the police, his victim listened to it again, concerned she had blown the call out of proportion. \"She felt so guilty for getting him in trouble that she wanted to listen to the recording to see if she remembered it as being as bad as it was,\" said DC Lauren Hampton from Leicestershire Police. When she did that, the effect that he had had on her continued, and Webb's victim followed his instructions again. The Online Safety Bill came into law in October 2023 with the aim to help keep inappropriate and potentially dangerous content away from vulnerable eyes.\n\n It does this by imposing rules on search services and platforms that allow users to post content online or to interact with each other - think Meta, Apple and Wikipedia. A number of new offences have been introduced by the bill, including encouraging or assisting serious self-harm, cyberflashing, and epilepsy trolling - deliberately sending an image or video designed to trigger a seizure in people with epilepsy. As part of implementing the bill, independent regulator Ofcom has set out a series of child safety rules which will come into force for social media, search and gaming apps and websites on 25 July. The rules aim to prevent young people from encountering the most harmful content relating to suicide, self-harm, eating disorders and pornography.\n Companies found to be in breach of the bill can be fined up to £18m or 10% of their annual global turnover. This further suicide attempt resulted in her being in intensive care for several days, according to DC Hampton. \"This wasn't some sort of fantasy or role play,\" said Mr Johnson of the CPS. \"A search of Tyler Webb's digital devices showed that he had drawings and images depicting hangings and decapitations and sexual violence against women.\" Read more from Sky News:'Silent killer' heatwave thought to have left nine dead in EuropeUK content creators demand formal recognition from government A statement by Webb's victim that was read out in court said: \"My life is ruined. My mind and body have been severely damaged. I think about it every day. \"There will never be another second on this earth where I don't have to live with the pain of what happened.\" The police praised her bravery in coming forward and said she may well have saved the lives of other women. Why is the sentencing so significant? This sentencing isn't just an important moment for Webb's victim, who police say likely saved others from being targeted by the predator; it is also the first time the 2023 Online Safety Act has been tested in court. \"This conviction shows that we have an effective new tool to use against people who are determined to cause this sort of harm online,\" said Mr Johnson. Although encouraging suicide has been a criminal offence since 1961, encouraging self-harm online only became a specific offence two years ago. Since Webb's charge on 12 July 2024, others have been arrested and charged with the new offence. \"The internet proliferates offending, allowing access to extreme materials and instant communication with others that can both facilitate genuine predators, and lead sick and vulnerable individuals to commit terrible crimes,\" said criminal defence lawyer Marcus Johnstone of PCD Solicitors, who specialises in sexual crimes. \"Webb's conviction means he can now get the treatment he needs, but there are many others like him and there are neither the resources nor the facilities to stop them all.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Inside Iran's Evin Prison - as Tehran says damage shows Israel targeted civilians",
        "description": "It is one of the most notorious and secret places in Iran.",
        "url": "https://news.sky.com/story/inside-irans-notorious-evin-prison-as-tehran-says-damage-shows-israel-targeted-civilians-13392407",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-evin-prison-iran_6957141.jpg?20250704160749",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-04 14:45:00",
        "Headline": "The authorities say at least 71 people were killed in air strikes at the prison, some of them inmates, but also visiting family members. But our visit highlighted the prison's notoriety too.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  It is one of the most notorious and secret places in Iran. Somewhere foreign journalists are never allowed to visit or film. The prison where dissidents and critics of Iran's government disappear - some never to be seen again. But we went there today, invited by Iranian authorities eager to show the damage done there by Israel. Evin Prison was hit by Israeli airstrikes the day before a ceasefire ended a 12-day war with Iran. The damage is much greater than thought at the time. We walked through what's left of its gates, now a mass of rubble and twisted metal, among just a handful of foreign news media allowed in. A few hundred yards in, we were shown a building Iranians say was the prison's hospital. Behind iron bars, every one of the building's windows had been blown in. Medical equipment and hospital beds had been ripped apart and shredded. It felt eerie being somewhere normally shut off to the outside world. On the hill above us, untouched by the airstrikes, the buildings where inmates are incarcerated in reportedly horrific conditions, ominous watch towers silhouetted against the sky. Evin felt rundown and neglected. There was something ineffably sad and oppressive about the atmosphere as we wandered through the compound. The Iranians had their reasons to bring us here. The authorities say at least 71 people were killed in the air strikes, some of them inmates, but also visiting family members. Iran says this is evidence that Israel was not just targeting military or nuclear sites but civilian locations too. But the press visit highlighted the prison's notoriety too. Iran's critics and human rights groups say Evin is synonymous with the brutal oppression of political prisoners and opponents, and its practice of hostage diplomacy too. British dual nationals, including Nazanin Zaghari-Ratcliffe were held here for years before being released in 2022 in exchange for concessions from the UK. Read more:Iran: Still a chance for peace talks with USWhy Netanyahu wants a 60-day ceasefire - analysis Interviewed about the Israeli airstrikes at the time, Ms Zaghari-Ratcliffe showed only characteristic empathy with her former fellow inmates. Trapped in their cells, she said they must have been terrified. The Israelis have not fully explained why they put Evin on their target list, but on the same day, the Israeli military said it was \"attacking regime targets and government repression bodies in the heart of Tehran\". The locus of their strikes were the prison's two entrances. If they were trying to enable a jailbreak, they failed. No one is reported to have escaped, several inmates are thought to have died. The breaches the Israeli missiles made in the jail's perimeter are being closed again quickly. We filmed as a team of masons worked to shut off the outside world again, brick by brick."
    },
    {
        "title": "29 injured in Rome petrol station explosion and fire",
        "description": "At least 29 people have been injured after multiple explosions at a petrol station in Rome.",
        "url": "https://news.sky.com/story/20-injured-in-rome-petrol-station-explosion-and-fire-13392221",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rome-explosion_6956840.jpg?20250704094527",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-04 08:22:00",
        "Headline": "An underground station has been closed and buildings evacuated after the incident in the Prenestino neighbourhood this morning.",
        "Content": " At least 29 people have been injured after multiple explosions at a petrol station in Rome. A truck is believed to have hit a gas pipe, with police saying two consecutive blasts occurred while emergency services were at the scene. The sound of the explosions was reportedly heard across the Italian capital. It happened on Via dei Gordiani 32, in the east of the city, at 8.18am local time. A fire also broke out and several buildings nearby have been damaged, with others evacuated. One of those injured is said to be in a serious condition, having been pulled from a burning car by rescuers. The Teano subway station has been closed and Prime Minister Giorgia Meloni has contacted the mayor to offer assistance. Meanwhile, Pope Leo said in a statement: \"I pray for the people involved in the explosion of a gas station, which occurred this morning in the Prenestino Labicano neighbourhood in the heart of my diocese. \"I continue to follow the developments of this tragic incident with concern.\" Multiple police officers and at least one firefighter are among the injured, authorities said, but none are said to be in a critical condition. Read more from Sky NewsOrdeal of soldiers fleeing Putin's army'Silent killer' heatwave thought to have killed at least nine \"We are working on a tank explosion... the fire is still ongoing,\" the fire department said in a statement. A witness told Reuters news agency: \"I heard it as I was leaving the house, there was a very loud bang, the whole house shook and I was afraid the windows might shatter given how strong it was.\""
    },
    {
        "title": "Elephant kills British woman and New Zealander on walking safari in Zambia",
        "description": "A British woman and another from New Zealand have been killed by an elephant during a walking safari in Zambia.",
        "url": "https://news.sky.com/story/elephant-kills-british-woman-and-new-zealander-on-walking-safari-in-zambia-13392274",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elephant-ele_6956913.jpg?20250704120129",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-04 10:43:00",
        "Headline": "The incident follows two other fatal elephant attacks on women doing safaris in Zambia last year.",
        "Content": "A British woman and another from New Zealand have been killed by an elephant during a walking safari in Zambia. The animal was wounded by gunshots as guides tried to stop it charging but both victims died at the scene. Police said the animal was with its calf and ran at the women in South Luangwa National Park. They were reportedly attacked from behind. Local authorities named the Briton as Easton Janet Taylor, 68, and the other woman as Alison Jean Taylor, 67.  A Foreign Office spokesperson said: \"We are supporting the family of a British woman who has died in Zambia and are in contact with the local authorities.\" Female elephants can respond aggressively if they think there is a threat when they are with their young. Read more from Sky News:At least 29 injured in Rome petrol station explosionRoman settlement uncovered after rare swords found Two elderly American women also died last year in separate incidents in Zambia. Both attacks happened while they were on a safari vehicle."
    },
    {
        "title": "Crowds in Portugal gather for the saddest of homecomings for brothers Diogo Jota and Andre Silva",
        "description": "On a quiet side street by Capela da Ressurreicao, on the outskirts of Porto, the crowd had been building through the night.",
        "url": "https://news.sky.com/story/crowds-in-portugal-gather-for-the-saddest-of-homecomings-for-brothers-diogo-jota-and-andre-silva-13392160",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diogo-jota-gondomar_6956726.png?20250704044546",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-07-04 02:52:00",
        "Headline": "The tragic loss of the footballers in a car crash in Spain has resonated around the world. But their loss is felt most painfully in Gondomar.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  On a quiet side street by Capela da Ressurreicao, on the outskirts of Porto, the crowd had been building through the night. Waiting for the saddest of homecomings. And at 11.30pm last night, the tranquillity of the night was broken by dozens applauding as the hearse carrying the coffins of two footballing sons of Gondomar arrived. Latest: Tributes paid to Liverpool foward Jota It was exactly 23 hours since the car crash in northern Spain that killed Diogo Jota and Andre Silva. The tragedy has resonated around the world. But their loss is felt most painfully here in their hometowns.  A few minutes' drive away at Gondomar Sport Club, the collection of flowers, scarves, jerseys and candles was growing outside the academy named after Jota. \n                  Diogo Jota's joyous final weeks make his death even more devastating to comprehend\n                 \n                  Diogo Jota's tragic final Instagram post after marrying childhood sweetheart\n                 \n                  Diogo Jota's family and Liverpool staff attend wake ahead of funeral\n                 It's there I encountered a former teammate of the 28-year-old who went on to win every major English trophy with Liverpool. Miguel Rocha was wearing one of Jota's Number 20 Liverpool shirts and clutching a jersey from previous club, Wolves, gifted by his friend. They played together here for a decade, through the youth ranks. \"Back then, every child dreams of going professional,\" Rocha told Sky News. \"But at the same time, we know it's very difficult, but he got it. \"Me and my colleagues who played together back then, we were all very proud. \"This community of Gondomar, as well as Portugal, every time we saw Diogo Jota on the pitch, we felt very proud. Nothing but pride.\" Licínio Ribeiro Correia watched both brothers growing up at Gondomar and continued to spend time with them. \"We could see right away in Diogo that he was hungry for the ball,\" he recalled. \"When he played, the goals were a spectacle. \"Then he left here and went to Paços de Ferreira, he went to a bigger club and oh well, we lost Diogo.\" Read more from Sky News:Liverpool fans react to Jota's deathFIFA president pays tributeDiogo Jota: From joy to devastation But Jota never forgot his roots, sending a shirt back from England to Correia. The forward's last act in a Portugal shirt was helping his country to a second Nations League title. He left Liverpool after a Premier League trophy parade and so many at the vigil came in the club's red shirts. One of them was Afonso Gama who has just completed the season playing for Gondomar's under-19s. Through the sadness, Gama reflected on seeing a player rise from such a modest, low-level club to the heights of the sport. \"He made us believe that's possible,\" Gama told Sky News. \"We know it's not for everybody. We have to work hard. \"And he was an inspiration for everybody who played here.\""
    },
    {
        "title": "At least 13 people confirmed dead and more than 20 missing from girls camp in Texas flooding  ",
        "description": "At least 13 people have been killed in the US state of Texas after heavy rain caused flash flooding, according to local media reports.",
        "url": "https://news.sky.com/story/at-least-13-people-confirmed-dead-and-more-than-20-missing-from-girls-camp-in-texas-flooding-13392488",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-flood-texas_6957436.jpg?20250704221222",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-04 14:57:00",
        "Headline": "The missing children were among more than 700 who were at a summer camp when floodwaters swept through at around 4am local time.",
        "Content": " At least 13 people have been killed in the US state of Texas after heavy rain caused flash flooding, according to local media reports. Officials have also said 23 children are missing from a girls' camp in Texas. As much as 10 inches (25 centimetres) of heavy rain fell in just a few hours overnight in central Kerr County, causing flash flooding of the Guadalupe River. An official in the city of Kerville told reporters the flooding struck before dawn \"over a very short period of time that could not be predicted, even with the radar\". Judge Rob Kelly, the chief elected official in the county, confirmed fatalities from the flooding and dozens of water rescues so far. The judge told reporters at a news conference that \"most\" of the bodies are yet to be identified. \"We're trying to get the identity of these folks, but we don't have it yet,\" he said. \n                  King Of The Hill and Parks And Recreation actor Jonathan Joss shot dead in Texas\n                 \n                  Man charged after British student nurse stabbed to death in Texas 'following fight over cat'\n                 \n                  Texas: Second child with measles dies as US outbreak spreads\n                 More than 20 girls unaccounted for  Emergency services are continuing a frantic search to find those missing - including 23 girls. The children were among more than 700 who were at a summer camp when floodwaters swept through at around 4am local time. Most of the campers are safe but they could not be immediately evacuated because high waters have made local roads unusable, authorities said. \"Everybody is doing everything in their power to get these kids out,\" Judge Kelly said. Asked why more precautions were not taken amid forecasts for stormy weather, Judge Kelly insisted a disaster of such magnitude was unforeseen. \"We have floods all the time. This is the most dangerous river valley in the United States,\" he said, adding, \"We had no reason to believe this was going to be anything like what's happened here. None whatsoever.\" Search teams are flying 14 helicopters and a dozen drones over the area, while hundreds of emergency personnel are on the ground conducting rescues. People desperately searching for their loved ones have posted comments on a Facebook post from the Kerr County sheriff's office. One woman said she couldn't reach her daughter, who had rented a cabin with her husband and two children. She pleaded for officials to release the names of those who have been evacuated."
    },
    {
        "title": "Stars, stripes and soundbites: Trump celebrates his 'big, beautiful' win ",
        "description": "It couldn't have been more American.",
        "url": "https://news.sky.com/story/stars-stripes-and-soundbites-trump-celebrates-his-big-beautiful-win-13392172",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-in-des-moines-iowa_6956733.jpg?20250704051305",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-07-04 04:05:00",
        "Headline": "No subtitle found",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It couldn't have been more American. Stars, stripes and soundbites at the Iowa State Fairground on the eve of the fourth of July. The stars had aligned for President Trump, celebrating the passage of his signature tax and spending bill. \"There can be no better birthday for America than the phenomenal victory we achieved just hours ago when Congress passed the big, beautiful bill to make America great again,\" he told the crowd at Des Moines. In recent weeks, his administration has earned its stripes, chalking up unexpected successes: an Israel/Iran ceasefire, agreement at NATO and a legislative breakthrough. It was a small margin - 218 votes to 214 - but a huge win for Donald Trump because the wide-ranging legislation effectively bankrolls his second-term agenda. \"More gravitas, more power\" was how he described the victory before boarding Air Force One. \n                  Donald Trump's 'big beautiful' tax cuts bill passes final hurdle in US Congress \n                 \n                  Vladimir Putin tells Donald Trump he will not back down from goals in Ukraine, Kremlin says\n                 \n                  What's it actually like in Iran right now?\n                 He feels invincible right now, even joking when a bang interrupted his Iowa speech. \"Don't worry, it's only fireworks, I hope. Famous last words… You always have to think positive. I didn't like the sound of that either,\" he laughed. Read more from Sky News:Iran: Still a chance for peace talks with USMichael Madsen, who starred in Reservoir Dogs, dies Democrats have branded the bill \"the big, ugly betrayal\", claiming 11 million lower-income Americans will lose their healthcare to fund Trump's tax cuts and spending priorities. 👉 Follow Trump100 on your podcast app 👈 Their leader in the House, Hakeem Jeffries, vowed to \"press on for democracy\" in a record-breaking speech lasting eight hours and 11 minutes. But the Democrats will struggle to press on anywhere until they find a leader and a coherent opposition strategy to rally around. Republican representatives greeted the result with chants of \"USA, USA\", but their ownership of the bill makes them accountable for its impact. How Donald Trump handles this degree of power will define this presidency."
    },
    {
        "title": "Is this the most powerful Trump's been?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈 </a>",
        "url": "https://news.sky.com/story/is-this-the-most-powerful-trumps-been-13392155",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-04 00:06:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈  Donald Trump's 'big, beautiful bill' has passed and he's due to sign it into law on Independence Day. Mark Stone and David Blevins discuss how the bill will supercharge his presidency, despite its critics.They also chat Gaza and Ukraine, as Donald Trump meets with freed Israeli-American hostage Edan Alexander and talks to Vladimir Putin. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Ryanair urges EU chief to 'quit' over air traffic strike disruption",
        "description": "The boss of Ryanair has told Sky News the president of the European Commission should \"quit\" if she can't stop disruption caused by repeated French air traffic control strikes.",
        "url": "https://news.sky.com/story/ryanair-urges-eu-chief-to-quit-over-air-traffic-strike-disruption-13392231",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-ryanair-plane_6292411.jpg?20230921102917",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-04 08:51:00",
        "Headline": "Michael O'Leary uses an interview with Sky News to call for change at the top of the European Commission if it is unable to stop strikes in France closing the skies.",
        "Content": " The boss of Ryanair has told Sky News the president of the European Commission should \"quit\" if she can't stop disruption caused by repeated French air traffic control strikes. Michael O'Leary, the group chief executive of Europe's largest airline by passenger numbers, said in an interview with Business Live that Ursula von der Leyen had failed to get to grips, at an EU level, with interruption to overflights following several recent disputes in France. The latest action began on Thursday and is due to conclude later today, forcing thousands of flights to be delayed and cancelled through French airspace closures. Money latest: 'Lifeblood of mortgage market' enjoying lower rates Mr O'Leary told presenter Darren McCaffrey that French domestic flights were given priority during ATC strikes and other nations, including Italy and Greece, had solved the problem through minimum service legislation. He claimed that the vast majority of flights, cancelled over two days of action that began on Thursday, would have been able to operate under similar rules. Mr O'Leary said of the EU's role: \"We continue to call on Ursula von der Leyen - why are you not protecting these overflights, why is the single market for air travel being disrupted by a tiny number of French air traffic controllers? \n                  Leaseholders to get rights to more easily challenge extortionate service charges\n                 \n                  Money blog: Ryanair boss fumes after flights cancelled for 32,000 customers\n                 \n                  British fintech Zilch on hunt for overseas bid targets\n                 \"All we get is a shrug of their shoulders and 'there's nothing we can do'. We point out, there is.\" He added: \"We are calling on Ursula von der Leyen, who preaches about competitiveness and reforming Europe, if you're not willing to protect or fix overflights then quit and let somebody more effective do the job.\" The strike is estimated, by the Airlines for Europe lobby group to have led to at least 1,500 cancelled flights, leaving 300,000 travellers unable to make their journeys. Ryanair itself had axed more than 400 flights so far, Mr O'Leary said. Rival easyJet said on Thursday that it had cancelled 274 services over the two days. The beginning of July marks the start of the European summer holiday season. The French civil aviation agency DGAC had already told airlines to cancel 40% of flights covering the three main Paris airports on Friday ahead of the walkout - a dispute over staffing levels and equipment quality. Mr O'Leary described those safety issues as \"nonsense\" and said twhile the controllers had a right to strike, they did not have the right to close the sky. DGAC has warned of delays and further severe disruption heading into the weekend. Many planes and crews will be out of position. Mr O'Leary is not alone in expressing his frustration. The French transport minister Philippe Tabarot has denounced the action and the reasons for it. \"The idea is to disturb as many people as possible,\" he said in an interview with CNews. Passengers are being advised that if your flight is cancelled, the airline must either give you a refund or book you on an alternative flight. If you have booked a return flight and the outbound leg is cancelled, you can claim the full cost of the return ticket back from your airline."
    },
    {
        "title": "British fintech Zilch on hunt for overseas bid targets",
        "description": "Zilch, the consumer lender which has become one of Britain's fastest-growing fintech companies, has begun a search for international takeover targets as it accelerates its expansion ahead of a bumper stock market listing.",
        "url": "https://news.sky.com/story/british-fintech-zilch-on-hunt-for-overseas-bid-targets-13392371",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-zilch-fintech_5455211.jpg?20210722135123",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-04 13:43:00",
        "Headline": "The payments company is working with advisers to identify smaller international peers to acquire as part of efforts to expand ahead of a bumper stock market listing, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Zilch, the consumer lender which has become one of Britain's fastest-growing fintech companies, has begun a search for international takeover targets as it accelerates its expansion ahead of a bumper stock market listing. Sky News understands that Zilch, which is run by co-founder Philip Belamant, is working with advisers to identify peers outside the UK which it can acquire in the coming months. The company, which is regulated in the UK and counts eBay among its investors, has amassed a customer base of more than five million people. Money latest: Another airline faces baggage fees investigation It is now among the UK's most valuable fintechs, making its future public market debut a hotly contested prize for stock exchanges in London, New York and elsewhere. Mr Belamant has been an active participant in talks with regulators and policymakers about reforms to London's listings regime amid growing concerns about the relative attractiveness of UK public markets. Last year, he warned that Zilch could float outside the UK without meaningful efforts to incentivise \"retail investors to buy and hold British stocks\". \n                  Ryanair urges EU chief to 'quit' over air traffic strike disruption\n                 \n                  Leaseholders to get rights to more easily challenge extortionate service charges\n                 \n                  Money blog: Ryanair boss fumes after flights cancelled for 32,000 customers\n                 Sources close to the company said Zilch had generated more than £750m in savings on interest and fees for customers since its launch. Payments through its platform now have a gross merchandise value of more than £4bn, they added. Zilch has annual revenues of more than £150m, making it well-placed to snap up rivals which are too small to raise additional capital or list on the public markets, according to insiders. In recent months, the company has also been exploring its own private share sale to raise funding, having hired Citi to work on the mandate. Its last fundraising valued the company at about £1.5bn. Other Zilch investors include Goldman Sachs and Ventura Capital. Zilch secured authorisation from the City watchdog in 2020 and now offers customers a digital debit Visa card earning up to 5% of spending in rewards. In the same app, customers can switch to a credit card, allowing customers to spread repayments with zero interest over six weeks or three months, enabling them to build their credit record. The company differentiates itself from other Buy Now Pay Later companies because it is already regulated by the Financial Conduct Authority. In total, Zilch has raised £500m in equity and debt since it was founded. The company employs more than 250 people. Zilch declined to comment on Friday."
    },
    {
        "title": "Official Receiver and Glencore strike crucial Lindsey oil supply deal",
        "description": "The Official Receiver has reached a deal with the commodities trading giant, Glencore, that will ensure supplies of crude oil to the ailing Lindsey refinery following its owner's collapse this week.",
        "url": "https://news.sky.com/story/official-receiver-and-glencore-strike-crucial-lindsey-oil-supply-deal-13392219",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-prax-lindsey_6953513.jpg?20250630080643",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-04 08:19:00",
        "Headline": "The Official Receiver reached a deal with the commodities trading giant overnight to sell supply of crude oil to the stricken Lincolnshire refinery, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Official Receiver has reached a deal with the commodities trading giant, Glencore, that will ensure supplies of crude oil to the ailing Lindsey refinery following its owner's collapse this week. Sky News has learnt that the OR - which oversees the initial stages of bankruptcies ordered by a court - struck an agreement with Glencore in the early hours of Friday morning. Further details of the arrangement were unclear. Money latest: 'Lifeblood of mortgage market' enjoying lower rates The deal provides a temporary lifeline to the Lindsey refinery in Lincolnshire while the OR and special manager FTI Consulting race to secure the site's longer term future. The plant - one of only a handful of oil refineries still operating in the UK - was owned by Prax Group, whose main subsidiary, State Oil, and other entities collapsed into insolvency proceedings on Monday. Prax Group, which also spans oilfield exploration and fuel retailing, is owned by a husband-and-wife team whose conduct is now the subject of an Insolvency Service investigation. Ed Miliband, the energy security secretary, ordered the probe after the government was left blindsided by Prax's financial woes. Read more:Labour drops pledge to abolish leasehold within 100 daysPensioner, 90, hit with £17,000 ground rent bill Industry sources are sceptical that a buyer will be found for Lindsey, which could put hundreds of jobs at risk. Glencore has security over crude oil supplied to the site, although the distribution of finished product is now the responsibility of the OR. Glencore declined to comment, while the OR could not be reached"
    },
    {
        "title": "Clear crisis as Starmer marks first year - here's what I've observed from last 12 months",
        "description": "July 5 2024, 1pm: I remember the moment so clearly.",
        "url": "https://news.sky.com/story/starmer-marks-first-year-with-a-clear-crisis-and-blow-to-his-leadership-13392156",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-starmer-keir_6956741.jpg?20250704063254",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-07-04 00:19:00",
        "Headline": "Starmer won power with the largest majority in a quarter of a century but he marks his first anniversary with the humiliation of having to abandon his flagship welfare reforms in a clear blow to his authority.",
        "Content": "\n          Political editor\n              @BethRigby\n  July 5 2024, 1pm: I remember the moment so clearly. Keir Starmer stepped out of his sleek black car, grasped the hand of his wife Vic, dressed in Labour red, and walked towards a jubilant crowd of Labour staffers, activists and MPs waving union jacks and cheering a Labour prime minister into Downing Street for the first time in 14 years. Starmer and his wife took an age to get to the big black door, as they embraced those who had helped them win this election - their children hidden in the crowd to watch their dad walk into Number 10. Politics latest: Corbyn starts new party Keir Starmer, not the easiest public speaker, came to the podium and told the millions watching this moment the \"country has voted decisively for change, for national renewal\". He spoke about the \"weariness at the heart of the nation\" and \"the lack of trust\" in our politicians as a \"wound\" that \"can only be healed by actions not words\". He added: \"This will take a while but the work of change begins immediately.\" A loveless landslide That was a day in which this prime minister made history. His was a victory on a scale that comes around but one every few decades. He won the largest majority in a quarter of a century and with it a massive opportunity to become one of the most consequential prime ministers of modern Britain - alongside the likes of Margaret Thatcher or Tony Blair. But within the win was a real challenge too. Starmer's was a loveless landslide, won on a lower share of the vote than Blair in all of his three victories and 6 percentage points lower than the 40% Jeremy Corbyn secured in the 2017 general election. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 It was the lowest vote share than any party forming a post-war majority government. Support for Labour was as shallow as it was wide. In many ways then, it was a landslide built on shaky foundations: low public support, deep mistrust of politicians, unhappiness with the state of public services, squeezed living standards and public finances in a fragile state after the huge cost of the pandemic and persistent anaemic growth. Put another way, the fundamentals of this Labour government, whatever Keir Starmer did, or didn't do, were terrible. Blair came in on a new dawn. This Labour government, in many ways, inherited the scorched earth. The one flash of anger I've seen For the past year, I have followed Keir Starmer around wherever he goes. We have been to New York, Washington (twice), Germany (twice), Brazil, Samoa, Canada, Ukraine, the Netherlands and Brussels. I can't even reel off the places we've been to around the UK - but suffice to say we've gone to all the nations and regions.  What I have witnessed in the past year is a prime minister who works relentlessly hard. When we flew for 27 hours non-stop to Samoa last autumn to the Commonwealth Heads of Government Meeting (CHOGM) summit, every time I looked up at the plane, I saw a solitary PM, his headlight shining on his hair, working away as the rest of us slept or watched films. He also seems almost entirely unflappable. He rarely expresses emotion. The only time I have seen a flash of anger was when I questioned him about accepting freebies in a conversation that ended up involving his family, and when Elon Musk attacked Jess Phillips. I have also witnessed him being buffeted by events in a way that he would not have foreseen. The arrival of Donald Trump into the White House has sucked the prime minister into a whirlwind of foreign crises that has distracted him from domestic events. When he said over the weekend, as a way of explanation not an excuse, that he had been caught up in other matters and taken his eye off the ball when it came to the difficulties of welfare reform, much of Westminster scoffed, but I didn't. I had followed him around in the weeks leading up to that vote. We went from the G7 in Canada, to the Iran-Israel 12-day war, to the NATO summit in the Hague, as the prime minister dealt with, in turn, the grooming gangs inquiry decision, the US-UK trade deal, Donald Trump, de-escalation in the Middle East and a tricky G7 summit, the assisted dying vote, the Iran-Israel missile crisis.  He was taking so many phone calls on Sunday morning from Chequers, that he couldn't get back to London for COBRA [national emergency meeting] because he couldn't afford to not have a secure phone line for the hour-long drive back to Downing Street. He travelled to NATO, launched the National Security Review and agreed to the defence alliance's commitment to spend 5% of GDP on defence by 2035. So when he came back from the Hague into a full-blown welfare rebellion, I did have some sympathy for him - he simply hadn't had the bandwidth to deal with the rebellion as it began to really gather steam. Dealing with rebellion Where I have less sympathy with the prime minister and his wider team is how they let it get to that point in the first place. Keir Starmer wasn't able to manage the latter stages of the rebellion, but the decisions made months earlier set it up in all its glory, while Downing Street's refusal to heed the concerns of MPs gave it momentum to spiral into a full-blown crisis. The whips gave warning after 120 MPs signed a letter complaining about the measures, the Work and Pensions Secretary Liz Kendall had done the same, but Starmer and Reeves were, in the words of one minister, \"absolutist\". \"They assumed people complaining about stuff do it because they are weak, rather than because they are strong,\" said the minister, who added that following the climbdown, figures in Number 10 \"just seemed completely without knowledge of the gravity of it\". That he marks his first anniversary with the humiliation of having to abandon his flagship welfare reforms or face defeat in the Commons - something that should be unfathomable in the first year of power with a majority that size - is disappointing. To have got it that wrong, that quickly with your parliamentary party, is a clear blow to his authority and is potentially more chronic. I am not sure yet how he recovers.  Keir Starmer said he wanted to rule country first, party second, but finds himself pinned by a party refusing to accept his centrist approach. Now, ministers tell MPs that there will be a financial consequence of the government's decision to delay tightening the rules on claiming disability benefits beyond the end of 2026. A shattered Rachel Reeves now has to find the £5bn she'd hoped to save another way. She will defend her fiscal rules, which leaves her the invidious choice of tax rises or spending cuts. Sit back and watch for the growing chorus of MPs that will argue Starmer needs to raise more taxes and pivot to the left. That borrowing costs of UK debt spiked on Wednesday amid speculation that the chancellor might resign or be sacked, is a stark reminder that Rachel Reeves, who might be unpopular with MPs, is the markets' last line of defence against spending-hungry Labour MPs. The party might not like her fiscal rules, but the markets do. What's on the horizon for year two? The past week has set the tone now for the prime minister's second year in office. Those around him admit that the parliamentary party is going to be harder to govern. For all talk of hard choices, they have forced the PM to back down from what were cast as essential welfare cuts and will probably calculate that they can move him again if they apply enough pressure. There is also the financial fall-out, with recent days setting the scene for what is now shaping up to be another definitive budget for a chancellor who now has to fill a multi-billion black hole in the public finances. But I would argue that the prime minister has misjudged the tone as he marks that first year. Faced with a clear crisis and blow to his leadership, instead of tackling that head on the prime minister sought to ignore it and try to plough on, embarking on his long-planned launch of the 10-year NHS plan to mark his year in office, as if the chancellor's tears and massive Labour rebellions over the past 48 hours were mere trifles.  It was inevitable that this NHS launch would be overshadowed by the self-inflicted shambles over welfare and the chancellor's distress, given this was the first public appearance of both of them since it had all blown up. But when I asked the prime minister to explain how it had gone so wrong on welfare and how he intended to rebuild your trust and authority in your party, he completely ignored my question. Instead, he launched into a long list of Labour's achievements in his first year: 4 million extra NHS appointments; free school meals to half a million more children; more free childcare; the biggest upgrade in employment rights for a generation; and the US, EU and India free trade deals.  I can understand the point he was making and his frustration that his achievements are being lost in the maelstrom of the political drama. But equally, this is politics, and he is the prime minister. This is his story to tell, and blowing up your welfare reform on the anniversary week of your government is not the way to do it. Is Starmer failing to articulate his mission? For Starmer himself, he will do what I have seen him do before when he's been on the ropes, dig in, learn from the errors and try to come back stronger. I have heard him in recent days talk about how he has always been underestimated and then proved he can do it - he is approaching this first term with the same grit. If you ask his team, they will tell you that the prime minister and this government is still suffering from the unending pessimism that has pervaded our national consciousness; the sense politics doesn't work for working people and the government is not on their side. Read more from Sky News:Analysis: PM's authority damagedNumbers behind housing pledgeFiscal rules are silly but important Starmer knows what he needs to do: restore the social contract, so if you work hard you should get on in life. The spending review and its massive capital investment, the industrial strategy and strategic defence review - three pieces of work dedicated to investment and job creation - are all geared to trying to rebuild the country and give people a brighter future. But equally, government has been, admit insiders, harder than they thought as they grapple with multiple crises facing the country - be that public services, prisons, welfare. It has also lacked direction. Sir Keir would do well to focus on following his Northern Star. I think he has one - to give working people a better life and ordinary people the chance to fulfil their potential. But somehow, the prime minister is failing to articulate his mission, and he knows that. When I asked him at the G7 summit in Canada what his biggest mistake of the first year was, he told me: \"We haven't always told our story as well as we should.\"  I go back to the Keir Starmer of July 5 2024. He came in on a landslide, he promised to change the country, he spoke of the lack of trust and the need to prove to the public that the government could make their lives better through actions not words. In this second year, he is betting that the legislation he has passed and strategies he has launched will drive that process of change, and in doing so, build back belief. But it is equally true that his task has become harder these past few weeks. He has spilled so much blood over welfare for so little gain, his first task is to reset the operation to better manage the party and rebuild support. But bigger than that, he needs to find a way to not just tell his government's story but sell his government's story. He has four years left."
    },
    {
        "title": "Starmer would be foolish not to recognise the threat posed by a left-wing Corbyn party",
        "description": "Those of us who remember Jeremy Corbyn's leadership of the Labour Party with a fond nostalgia will never forget how chaotic it was.",
        "url": "https://news.sky.com/story/starmer-would-be-foolish-not-to-recognise-the-threat-posed-by-a-left-wing-corbyn-party-13392478",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeremy-corbyn-keir_6957272.jpg?20250704205645",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-04 16:51:00",
        "Headline": "\"His new party will be enough to lose Labour many, many seats in 2029,\" said Reform UK's Zia Yusuf.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Those of us who remember Jeremy Corbyn's leadership of the Labour Party with a fond nostalgia will never forget how chaotic it was. I recall a shadow cabinet reshuffle briefing that took place after midnight and, on another occasion, a phone call at 1.50am to inform me Mr Corbyn had sacked Hilary Benn from the shadow cabinet. And so we shouldn't be surprised that his attempt to launch a new left-wing party to challenge Sir Keir Starmer has already descended into chaos and farce. And it hasn't even been launched yet and doesn't have a name! As botched launches go, so far it's classic Corbyn. Though to be fair, the chaos isn't entirely his fault. The Financial Times quoted an ally of Mr Corbyn claiming he was frustrated that Zarah Sultana, the 31-year-old MP for Coventry South, announced he was launching a new party without consulting him first. \"Zarah has really overplayed her hand,\" according to the ally. \n                  How easy is it to set up a new political party?\n                 \n                  MP Zarah Sultana who was ousted from Labour announces new party with Jeremy Corbyn - but he says 'discussions ongoing'\n                 \n                  Labour MPs back Corbyn's calls for Chilcot-style inquiry into UK's role in Gaza war\n                 \"She jumped the gun to get the data and the donations.\" Then came an embarrassing rebuff from Mr Corbyn's two most senior allies during his leadership, his shadow chancellor John McDonnell and shadow home secretary Diane Abbott. Mr McDonell told me: \"Just to be absolutely clear, I am a Labour Party member. I have had the whip suspended, that's all, and I expect it back. \"Sad to see Zarah has gone, but I am remaining in the party and hope the whip will be restored soon.\" Labour's opponents, not surprisingly, are gloating, however. \"He has awful policies but is a vastly superior politician to Starmer,\" declared Reform UK's Zia Yusuf. \"His new party will be enough to lose Labour many, many seats in 2029. Likelihood of a Reform majority thus improve nicely.\" Politics latest: Follow live updates Sir Keir will no doubt claim Mr Corbyn's new party demonstrates how much his Labour Party has changed. It's a claim we've heard many times before. But the Labour leader and his top team would be foolish to dismiss the threat posed by Mr Corbyn, if and when he does indeed launch a new party. The other abiding memory of the Corbyn leadership is those mass rallies, with his adoring supporters singing \"Oh, Jeremy Corbyn!\" Let's not forget, either, how he rocked Glastonbury in 2017. Mr Corbyn may not get the backing of many Labour or independent pro-Gaza MPs. But left-wing Labour activists will flock to join a new Corbyn party in their thousands. Mr Corbyn is promising \"real change\", a \"new kind of political party\" and he says \"discussions are ongoing\". Watch this space, in other words. Some things never change, of course. Those things include the chaotic style of Mr Corbyn's leadership. But even with a botched launch, once his party is up and running it could potentially inflict real damage on Sir Keir's party. In elections next year and beyond, Labour could face the prospect of losing votes on the right to Reform UK and votes on the left to Mr Corbyn. With his massive cult following, Mr Corbyn has already demonstrated his ability to embarrass Sir Keir, when he won his Islington North seat as an independent in last year's general election. Now 76, opponents will claim Mr Corbyn is growing old disgracefully. But the old rebel loves nothing more than a protest, a march and a rally. He's not finished yet!"
    },
    {
        "title": "How easy is it to set up a new political party?",
        "description": "Zarah Sultana has announced she is quitting the Labour Party and starting a new political party alongside Jeremy Corbyn.",
        "url": "https://news.sky.com/story/how-easy-is-it-to-set-up-a-new-political-party-13392245",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeremy-corbyn-zarah-sultana_6957098.png?20250704153639",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-07-04 09:19:00",
        "Headline": "Zarah Sultana has announced that she is setting up a new political party with Jeremy Corbyn. How easy is the process, and what is required?",
        "Content": "\n          Political reporter\n              @realBenBloch\n Zarah Sultana has announced she is quitting the Labour Party and starting a new political party alongside Jeremy Corbyn. Announcing the move on social media, the independent MP argued that \"Westminster is broken\" and claimed the major parties are fighting for billionaires, declaring an alternative is needed. She included a link for people interested in joining her new endeavour to sign up for updates and to give donations as she looks to get her new movement off the ground. Politics latest: Corbyn to set up new party in challenge to Starmer But how easy is it to start a new political party? Let's explore the process. What is needed to set up a new political party? Political parties are governed by the Political Parties, Elections and Referendums Act 2000 (PPERA), which means any new entity must meet certain criteria. \n                  Electoral Commission reprimanded over cyber security failings after major hack\n                 \n                  Why some campaigners urge people to spoil their ballots - instead of not voting\n                 \n                  Labour enjoys best year ever for individual donations as total reaches £13m in 2023\n                 The body that regulates political parties is the Electoral Commission, and it ultimately decides if any new party can be registered in order to stand candidates for election. All new parties must have a constitution that sets out the structure and organisation of the party. The Electoral Commission says it should \"set out the arrangements for your party's governance and the rules for carrying out its business\", although there is no set format. Every party must have people registered in certain roles - party leader, party treasurer, and nominating officer. A minimum of two people is needed to fill the three roles, which are statutory roles with legal responsibilities. A copy of the party's financial scheme must also be provided, describing the party's processes for compliance with electoral finance laws, such as declarations around donations. All of that documentation, along with the new party's proposed name, emblem/logo, and a non-refundable £150 fee must be sent to the Electoral Commission, which will ensure the application complies with the law before granting approval. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 What are the restrictions around setting up a new political party? All new parties must meet the minimum requirements above, and they also must comply with rules governing party names and emblems/logos. The name of a new party cannot be too similar to that of an existing one to avoid confusing or misleading voters when they are looking at ballot papers in the voting booth. The design of a logo or emblem must include a design element, and also cannot be too similar to an existing party's. Multiple varieties can be submitted. Can anyone launch a new political party? Yes, is the short answer. Two people can join forces to start a party and stand candidates in parliamentary and local elections. The party treasurer cannot have been convicted of any election offences in the previous five years, and neither can the officer responsible for reporting donations and spending at general elections. How long does it take to set up a new political party? There is no public timeline for the Electoral Commission to confirm the registration of a new party. However, the party logo/emblem is subject to public comment and consultation, and the regulator needs to verify and approve the information submitted as part of the application."
    },
    {
        "title": "Tyler Webb sentenced to nine years imprisonment after persuading victim to attempt suicide online",
        "description": "A 23-year-old man who convinced his victim to attempt suicide and seriously self-harm online has become the first person sentenced under new internet safety laws.",
        "url": "https://news.sky.com/story/tyler-webb-sentenced-to-nine-years-imprisonment-after-persuading-victim-to-attempt-suicide-online-13392198",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tyler-webb-online-harm_6957232.jpg?20250704191334",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-04 14:20:00",
        "Headline": "After meeting his victim - who cannot be named - in an online forum dedicated to mental health last year, Webb began talking to her on the Telegram messaging app, and successfully persuaded her to self-harm.",
        "Content": "\n          Science and technology reporter\n       A 23-year-old man who convinced his victim to attempt suicide and seriously self-harm online has become the first person sentenced under new internet safety laws. Warning: This story contains details of encouraging self-harm and suicide which some readers might find disturbing Tyler Webb, from Loughborough, Leicestershire, was sentenced to nine years and four months imprisonment, subject to a hospital order. He will be taken back to the secure mental health hospital where he is being treated in Chesterfield. Once his doctors decide he is well enough to be discharged, he will serve out whatever time he has left in prison and will then be assessed by a board as to whether he is fit to be released. Webb is the first person in the country to be charged with encouraging serious self-harm online under Section 184 of the Online Safety Act 2023. He was also charged with encouraging suicide and pleaded guilty to both charges in May. During the sentencing at Leicester Crown Court, Webb was flanked by six officers and spent most of the hearing on the floor, which the defence described as a coping mechanism for his mental health issues. Grooming his victim After meeting his victim - who cannot be named for legal reasons - in an online forum dedicated to mental health last year, Webb began grooming her over several weeks and persuaded her to self-harm. The resulting injury had to be treated in hospital with stitches. The victim sent Webb a photograph of her injury, which prosecutors said showed he knew he had power over her. He repeatedly instructed her to self-harm and got annoyed when she did it without being told to, meaning he couldn't watch. Webb then convinced his victim to kill herself over a live video call while he watched. The suicide attempt failed, but only by chance, and the woman passed out on the call. When she came to, Webb told her to try again. The judge on Friday described Webb's actions as \"sexually motivated\" and said he wanted to see his victim die. Webb repeatedly told her she had nothing to live for and gave her methods to end her life, according to the CPS, while his victim said in a statement: \"He told me that my only value was in dying for his entertainment.\" \"Tyler Webb is a person who is manipulative, he's dangerous, he takes gratification in seeing other people hurt themselves,\" said CPS prosecutor Alex Johnson. \"He's a very dangerous person.\" In one 44-minute phone call, Webb persistently tried to get the woman to end her own life. When it became apparent she would not do so, he said he would block contact with her and threatened to move on to another victim instead. The woman then reported the interactions to the police, and Webb was arrested at his home by the Leicestershire force. After sending a recording of a call with Webb to the police, his victim listened to it again, concerned she had blown the call out of proportion. \"She felt so guilty for getting him in trouble that she wanted to listen to the recording to see if she remembered it as being as bad as it was,\" said DC Lauren Hampton from Leicestershire Police. When she did that, the effect that he had had on her continued, and Webb's victim followed his instructions again. The Online Safety Bill came into law in October 2023 with the aim to help keep inappropriate and potentially dangerous content away from vulnerable eyes.\n\n It does this by imposing rules on search services and platforms that allow users to post content online or to interact with each other - think Meta, Apple and Wikipedia. A number of new offences have been introduced by the bill, including encouraging or assisting serious self-harm, cyberflashing, and epilepsy trolling - deliberately sending an image or video designed to trigger a seizure in people with epilepsy. As part of implementing the bill, independent regulator Ofcom has set out a series of child safety rules which will come into force for social media, search and gaming apps and websites on 25 July. The rules aim to prevent young people from encountering the most harmful content relating to suicide, self-harm, eating disorders and pornography.\n Companies found to be in breach of the bill can be fined up to £18m or 10% of their annual global turnover. This further suicide attempt resulted in her being in intensive care for several days, according to DC Hampton. \"This wasn't some sort of fantasy or role play,\" said Mr Johnson of the CPS. \"A search of Tyler Webb's digital devices showed that he had drawings and images depicting hangings and decapitations and sexual violence against women.\" Read more from Sky News:'Silent killer' heatwave thought to have left nine dead in EuropeUK content creators demand formal recognition from government A statement by Webb's victim that was read out in court said: \"My life is ruined. My mind and body have been severely damaged. I think about it every day. \"There will never be another second on this earth where I don't have to live with the pain of what happened.\" The police praised her bravery in coming forward and said she may well have saved the lives of other women. Why is the sentencing so significant? This sentencing isn't just an important moment for Webb's victim, who police say likely saved others from being targeted by the predator; it is also the first time the 2023 Online Safety Act has been tested in court. \"This conviction shows that we have an effective new tool to use against people who are determined to cause this sort of harm online,\" said Mr Johnson. Although encouraging suicide has been a criminal offence since 1961, encouraging self-harm online only became a specific offence two years ago. Since Webb's charge on 12 July 2024, others have been arrested and charged with the new offence. \"The internet proliferates offending, allowing access to extreme materials and instant communication with others that can both facilitate genuine predators, and lead sick and vulnerable individuals to commit terrible crimes,\" said criminal defence lawyer Marcus Johnstone of PCD Solicitors, who specialises in sexual crimes. \"Webb's conviction means he can now get the treatment he needs, but there are many others like him and there are neither the resources nor the facilities to stop them all.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Oasis reunion: A high-five and a hug - the gestures were there, but ultimately it was all about the music",
        "description": "Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait.",
        "url": "https://news.sky.com/story/gallagher-brothers-share-a-high-five-and-hug-as-oasis-reunite-on-stage-after-16-years-13392600",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff-gig-concert_6957384.jpg?20250704234946",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-04 22:23:00",
        "Headline": "Oasis sounded almost as good as they ever have when they performed on stage at Cardiff's Principality Stadium during the first night of their world tour.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Oasis have reunited on stage for the first time in almost 16 years - with brothers Liam and Noel Gallagher sharing a high five and the briefest of hugs as they closed a performance that for fans was more than worth the wait. After the split in 2009, for many years Noel said he would never go back - and for a long time, as the brothers exchanged insults through separate interviews (and on social media, for Liam), it seemed pretty unlikely to ever happen. But now, here they are. As they walked out on stage at Cardiff's Principality Stadium, all eyes were on the Gallaghers for a sense of their relationship - dare we say it, friendship? - now after all these years. As it happened: How Oasis's first gig together in 16 years unfolded There was no reference to their fall-out or making up, but the gestures were there - lifting hands together as they walked out for the first time. Headlines and tweets of speculation and then confirmation of the reunion filled the screens as the show started. \"This is happening,\" said one, repeatedly. In the end, it was all about the music. \n                  Oasis tour: What you need to know - and why Cardiff is the first stop\n                 \n                  Oasis reunion: Gallagher brothers take to stage for first time in 16 years\n                 \n                  Liam Gallagher hits out at  Edinburgh council after Oasis fans branded 'rowdy'\n                 Liam has received criticism in the past for his voice not being what it once was, but back on stage with his brother tonight he delivered exactly what fans would have hoped for - a raw, steely-eyed performance, snarling vocals, and the swagger that makes him arguably the greatest frontman of his day. This was Oasis sounding almost as good as they ever have.  They opened with Hello, because of course, \"it's good to be back\". And then Acquiesce, and those lyrics: \"Because we need each other/ We believe in one another.\" The song is said to be about friendship in the wider sense, rather than their brotherly bond and sibling rivalry, but you can't help but feel like it means something here. Over two hours, they played favourite after favourite - including Morning Glory, Some Might Say, Cigarettes & Alcohol, Supersonic and Roll With It. In the mid-section, Liam takes his break for Noel to sing Talk Tonight, Half The World Away and Little By Little; the tempo slows but there is by no means a lull, with the fans singing all his words back to him. Liam returns for hits including Stand By Me, Slide Away, Whatever and Live Forever, before sending the crowd wild (or even wilder) with Rock And Roll Star. When the reunion announcement was made last summer, it quickly became overshadowed by the controversy of dynamic pricing causing prices to rocket. As he has done on X before, Liam addressed the issue on stage with a joke. \"Was it worth the £4,000 you paid for the ticket?\" he shouted at one point. \"Yeah,\" the crowd shouts back; seemingly all is forgiven. After Rock And Roll Star, the dream that very quickly became a reality for this band, Noel introduced the rest of the group, calling Bonehead a \"legend\". Then he acknowledges all their young fans, some who maybe weren't even born when they split. \"This one is for all the people in their 20s who've never seen us before, who've kept this shit going,\" he says before the encore starts with The Masterplan. Noel follows with Don't Look Back In Anger, and the screens fill with Manchester bees in reference to the arena bombing and how the song became the sound of hope and defiance for the city afterwards.  During Wonderwall, there's a nice touch as Liam sings to the crowd: \"There are many things I would like to say to you, but I don't speak Welsh.\" It is at the end of Champagne Supernova, which closes the set, that it happens; Noel puts down his guitar, and they come together for a high-five and a back-slap, a blink-and-you'd miss it hug.  Read more:What you need to know about the Oasis tourLiam Gallagher hits out at council after fans branded 'rowdy' \"Right then, beautiful people, this is it,\" Liam had told the crowd as he introduced the song just a few minutes earlier. \"Nice one for putting up with us over the years.\" From the roar of the audience, it's safe to say most people here would agree it's been worth it."
    }
]