[
    {
        "title": "One child dies after coach crashes in Somerset on way back from school trip",
        "description": "One child has died after a coach bringing children back from a school trip crashed and overturned near Minehead, Somerset, police have said. ",
        "url": "https://news.sky.com/story/one-child-dead-after-coach-crashes-in-somerset-on-way-back-from-school-trip-13398122",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-coach-crash_6967322.jpg?20250717201838",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 16:16:00",
        "Headline": "The coach, which had 60-70 people on board, \"overturned onto its roof and slid approximately 20ft down the embankment\", emergency services have said. ",
        "Content": " One child has died after a coach bringing children back from a school trip crashed and overturned near Minehead, Somerset, police have said.  A major incident was declared after the vehicle, which had 60-70 people on board, crashed on the A396 Cutcombe Hill, between Wheddon Cross and Timbercombe, shortly before 3pm on Thursday afternoon. The coach was heading to Minehead Middle School at the time. At a news conference on Thursday night, officials confirmed one child died at the scene. A further 21 patients were taken to hospital, including two children who were transported via air ambulance. \"Several\" other people were treated at the scene, they added. \"This has been an incredibly challenging scene for all emergency services,\" Chief Superintendent Mark Edgington said.  \"Today's events are truly tragic, we know the whole community and wider area will be utterly devastated to learn of this news.\" An investigation into what caused the crash will be carried out, he added.  Gavin Ellis, the chief fire officer for Devon and Somerset Fire & Rescue Service, said the coach \"overturned onto its roof and slid approximately 20ft down an embankment\". He praised an off-duty firefighter who was travelling behind the vehicle for helping at the scene, before crews then arrived to carry out rescues \"in extremely difficult circumstances\". \"I'm grateful for the tireless effort and actions of the crews in doing everything they could for those who were trapped and as quickly as safely as possible,\" he said. \"I'm extremely proud of the efforts that my firefighters took today at this tragic event.\" Eight fire engines were sent to the scene, with two specialist rescue appliances and around 60 fire personnel, Mr Ellis said. A total of 20 double-crewed ambulances, three air ambulances and two hazardous area response teams were also sent to the scene, a representative for the South Western Ambulance Service said. Ch Supt Mark Edgington said: \"Many passengers either sustained minor injuries or were physically unharmed and were transferred to a rest centre. \"Work to help them return to Minehead has been taking place throughout the evening. \"An investigation into the cause of this incident will be carried out.\" Minehead Middle School has pupils aged between nine and 14, and is five days away from the end of term. 'I don't have words,' says local MP   Rachel Gilmour, MP for Tiverton and Minehead, has said the road where the coach crashed is \"very difficult to manoeuvre\". Speaking to Sky News chief presenter Anna Botting, Ms Gilmour said she visited Minehead Middle School recently, where she \"met the children and they were full of joy, enthusiasm and were very positive\". \"I know many of their parents,\" she said. \"I don't have words.\" Describing the scene, Gilmour continued: \"You have a very difficult crossing at Wheddon Cross, and as you come out to dip down into Timbercombe, the road is really windy and there are very steep dips on either side. \"If the coach, as the police are saying, went 20ft off the road, you are literally on a really, really steep bank.\" The MP, whose constituency is partly in Devon and partly in Somerset, said there is a \"really, really close community\". \"We will pull together, but it would be crass of me to say to a parent who's just lost their child that I could make things better, I can't,\" she said. \"All I can say is that from one mother to another, I feel your pain.\" Sir Keir Starmer said in a post on X: \"There are no adequate words to acknowledge the death of a child. All my thoughts are with their parents, family and friends, and all those affected. \"Thank you to the emergency workers who are responding at pace - I'm being kept up to date on this situation.\" Education Secretary Bridget Phillipson wrote: \"It is heartbreaking to hear that a child has died and others are seriously injured following the incident in Minehead earlier today. \"My thoughts are with their friends and families, and all those affected by this tragic event.\""
    },
    {
        "title": "Protesters clash with police outside Essex hotel believed to house asylum seekers",
        "description": "Protesters have clashed with police outside an Essex hotel believed to be housing asylum seekers.",
        "url": "https://news.sky.com/story/protesters-clash-with-police-outside-essex-hotel-believed-to-house-asylum-seekers-13398262",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-epping-protest-essex_6967490.jpg?20250718004043",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "Demonstrators have repeatedly gathered outside the hotel since a 38-year-old man was last week accused of sexual assault.",
        "Content": "Protesters have clashed with police outside an Essex hotel believed to be housing asylum seekers. Footage appeared to show people approaching and throwing objects at a police van which was parked outside the Bell Hotel in Epping on Thursday evening. As the vehicle was driven away, one person climbed onto the front and held their hands in the air. Images showed an individual kicking the windscreen of the vehicle, completely smashing it in the process, while a crowd watched on. Eggs were thrown and fireworks were also let off outside the hotel, in the latest night of demonstrations, which have repeatedly happened since a 38-year-old man was accused of sexual assault last week. Hadush Gerberslasie Kebatu appeared at Chelmsford Magistrates' Court earlier in the day, where he denied trying to kiss a 14-year-old girl. One police officer was left with a neck injury after Thursday night's disruption, Essex Police said. The force said it has identified several suspects it believes are responsible for \"damaging police vehicles, the hotel and assaulting officers\". During the protest a section of High Road in Epping High was closed \"for the safety of the public,\" police said in a statement. The statement continued: \"We will not tolerate any criminality on our streets, whether linked to protesting or not.\" One man at Thursday's protest was arrested on suspicion of affray following reports of an assault near the hotel on Sunday. Chief Superintendent Simon Anslow said: \"Disruption and offending is never an appropriate response, no matter the strength of feeling in this case, and on this issue. \"People protesting peacefully, lawfully and responsibly cause us - and the wider public - no concern. \"However, we can never, and will never, tolerate criminal behaviour of any sort and anyone identified as committing crime will be dealt with robustly.\" The first planned protest near the Bell Hotel took place on Sunday night. While no offences were reported between two groups at the site, two male security staff members were assaulted by a group of men at a nearby bus stop, police said. The two victims made their way past the protest site at the hotel to get help. They have received hospital treatment for serious injuries and the incident is being investigated, the force said. \" At this stage, we're treating it as racially aggravated,\" they added. Another incident took place on Tuesday when a man allegedly shouted racial abuse at the hotel before later causing damage to the property, police said. He was arrested on suspicion of a racially aggravated public order offence and criminal damage. He has been released on bail while enquiries continue."
    },
    {
        "title": "England through to semi-finals of Women's Euros after beating Sweden on penalties",
        "description": "England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden.",
        "url": "https://news.sky.com/story/england-through-to-semi-finals-of-womens-euros-after-beating-sweden-on-penalties-13398213",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-women-hannah-hampton_6967472.jpg?20250717231526",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 20:09:00",
        "Headline": "After a dramatic game in Zurich, England have managed to keep the dream of defending their European Championship title alive, after beating Sweden 3-2 on penalties. ",
        "Content": " England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden. The Lionesses won 3-2 on penalties at Stadion Letzigrund in Zurich, Switzerland, after clawing their way back to take the game into extra-time. The defending champions had been 2-0 down at half-time after goals from Sweden's Kosovare Asllani and Stina Blackstenius in the quarter-final clash. England then levelled matters towards the end of normal time. Lucy Bronze delivered the first England goal on 79 minutes, assisted by substitute Chloe Kelly. Two minutes later, Michelle Agyemang followed suit, taking the score to 2-2. After a goalless extra-time, it was time for penalties. Alessia Russo kicked things off, finding the back of the net for England, before Lauren James, Alex Greenwood, Beth Mead and Grace Clinton had their attempts saved by Sweden's Jennifer Falk. The game was sent into sudden death after Falk went face-to-face with England's Hannah Hampton but sent the ball flying over the crossbar. It all came down to Sweden's seventh penalty after Bronze sensationally scored, with 18-year-old Smilla Holmberg missing the chance to send her team through. England will next face Italy in the semi-finals in Geneva on Tuesday. 'That was crazy' England boss Sarina Wiegman described the action as \"one of the hardest games I've ever watched\". \"We could have been out of the game three or four times, when you're 2-0 at half-time it's not good,\" she said after the match. \"Although we started really bad, at the end it got better, but we didn't create anything so we had to change shape, and we score two goals - that was crazy. \"We miss a lot [of penalties], and they miss even more. I need to decompress, I think.\" Goalkeeper Hampton added that it was \"stressful watching\" and \"stressful playing\". The 24-year-old, who was left with a bloodied nose in extra-time, said: \"Every time I saved one, I was just thinking 'please put it in, so we have a bit of a cushion!' \"To be honest, I think I was better in the game when I had one nostril than when I was completely fine!\" She said it was the support of the England fans that helped the team push on. She said: \"They were definitely behind me and I appreciate all the support.\" Pressure was on the Lionesses after they won the tournament in 2022. Their journey in the group stages started with a 2-1 defeat to France, but hopes were lifted after England sailed past the Netherlands and Wales to reach the knockout stages, finishing second in Group D. Read more from Sky News:Child dies after coach crashes in SomersetSixteen and 17-year-olds will be able to vote in next general election Sweden on the other hand went into Thursday's game unbeaten in the tournament so far, having already defeated Germany, Poland and Denmark in the group stages."
    },
    {
        "title": "Supply teachers costing schools £1.4bn - as students say they are 'falling behind'",
        "description": "Chronic teacher shortages and increased sickness absences have pushed schools to rely heavily on supply agencies, costing the education system nearly &#163;1.4bn in the last year alone.",
        "url": "https://news.sky.com/story/supply-teachers-costing-schools-16314bn-as-students-say-they-are-falling-behind-13397948",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-teacher-classroom_6960587.jpg?20250708234158",
        "type": "Home",
        "Author": "Anjum Peerbacos, education reporter, and Saywah Mahmood, data journalist",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "One headteacher told Sky News it can cost schools upwards of £200 a day for a \"decent supply teacher\", with schools \"being held over a barrel\" for some specialist subjects. ",
        "Content": "By Anjum Peerbacos, education reporter, and Saywah Mahmood, data journalist   Chronic teacher shortages and increased sickness absences have pushed schools to rely heavily on supply agencies, costing the education system nearly £1.4bn in the last year alone. The majority of the £1.4bn was made up by academy schools which spent £847m on agency supply staff in the 2023-24 academic year, new analysis by Sky News using Department for Education data shows. That's nearly double the amount (in real terms) compared to 2014-15.  One headteacher told Sky News it can cost schools upwards of £200 a day for a \"decent supply teacher\". \"In some subjects like physics, supply agencies can charge £300-£400 per day, and schools are being held over a barrel,\" said Gary Moore, the headteacher at Regent High School in north London. But it's students like Zainab Badran who are feeling the impact. \n                  Crisis in early years education as attainment gap widens, report warns\n                 \n                  Department for Education 'lacks coherent plan' to address teacher shortage\n                 \n                  Children with special needs will 'always' have 'legal right' to support, education secretary says\n                 \"Every lesson we would have a different supply teacher,\" the GCSE student said. \"I didn't feel like I was learning anything. We were falling behind.\" Mineche Kyezu-Mafuta, a Year 10 student, remembered her science class being taught by five different teachers in a week. \"We had subs, and we have science five times a week, so we had a sub for every single one of those lessons - the sub changed for every lesson,\" she said. \"Students (were) out of their seats, throwing stuff, talking, just anything you could really think of would be happening in that class. \"It was very loud, students weren't behaving, no one was really doing their work.\" The vacancy rate among classroom teachers is still three times higher than it was a decade ago. Last year, the number of classroom teachers leaving was twice the number of newly qualified teachers joining the workforce. At the same time, teacher pay has failed to keep up with the rising cost of living. Since 2015, the median teacher salary has increased by nearly 30%, while inflation has risen by about 50%. Agency commission rates Agency commission rates are another source of frustration for school leaders. A teacher earning £30,000 may cost a school approximately £36,900 through an agency, an effective 23% markup. This rate of fees continues to rise further with higher salaries. Andy De Angelis, headteacher of a secondary school in west London, said: \"UK agencies provide a CV and possibly help with references. I arrange the interviews.\" Sky News contacted several leading supply agencies for comment, but none responded. A Department for Education spokesperson said work is \"well under way to deliver on our pledge to recruit 6,500 new expert teachers so schools are less reliant on agency staff in the future\". Read more:Minister defends ending tax exemption on private schoolsNumber of 'severely absent' pupils rises \"We are already seeing early progress with over 2,300 more secondary and special school teachers in classrooms this year, and over a thousand more people than last year have accepted places on teacher training courses starting this September,\" they added. \"To support schools to get better value for money when hiring supply teachers and other temporary school staff, we have established the agency supply deal.\" 'Significant failings' But the teachers' union NASUWT has said recent government-commissioned research shows less than 0.5% of school leaders reported obtaining supply teachers through the Crown Commercial Service framework. \"Currently, the approach of government ignores the significant failings that exist in the provision of supply teachers,\" it said. \"This creates unnecessary cost and adversely affects supply teachers, schools and pupils. \"The best way forward for both schools and supply teachers would be for schools and local authorities to be supported by the government to maintain their own supply pools.\""
    },
    {
        "title": "Felix Baumgartner: Extreme athlete who jumped from edge of space dies after paragliding crash",
        "description": "Felix Baumgartner, the extreme athlete who once jumped from the edge of space, has died in a paragliding crash in Italy.",
        "url": "https://news.sky.com/story/felix-baumgartner-extreme-athlete-who-jumped-from-space-dies-after-paragliding-crash-13398204",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-felix-baumgartner-jumper_6967380.jpg?20250717213558",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 19:34:00",
        "Headline": "The 56-year-old lost control of his motorised paraglider while flying in Italy and he fell to the ground near a hotel swimming pool.",
        "Content": "Felix Baumgartner, the extreme athlete who once jumped from the edge of space, has died in a paragliding crash in Italy. The 56-year-old Austrian lost control of his motorised paraglider while flying over Porto Sant'Elpidio in the central Marche region. He then fell to the ground near the swimming pool of a hotel. The reasons for the accident were unclear. According to reports, he fell ill and lost control. During the fall, he is thought to have hit a hotel employee, who was taken to hospital with neck injuries, according to Sky Sports Austria. She was reportedly injured by a piece of debris that had been dislodged during the vehicle's impact. The mayor of Porto Sant'Elpidio, Massimiliano Ciarpella, offered the town's condolences for the death of \"a symbol of courage and passion for extreme flights\". \n                  Body found in search for British hiker Matthew Hall who went missing in Italy\n                 \n                  British hiker missing for a week in Italian Alps\n                 \n                  Meredith Kercher's killer faces new trial over sexual assault allegations\n                 Mr Baumgartner is best known for smashing the world record for the highest skydive after leaping from the edge of space in October 2012. He ascended to 128,097ft in a pressurised capsule suspended beneath a giant helium balloon. He then jumped out, freefalling for four minutes and 19 seconds before opening his parachute. He made the historic jump over Roswell, New Mexico, reaching a peak speed of over 833mph (1,343kph). Mr Baumgartner's altitude record stood until 2014 when American computer scientist Alan Eustace did a jump from a height of 135,890ft."
    },
    {
        "title": "Spies and special forces among more than 100 Britons whose details were included in Afghan data leak",
        "description": "Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK. ",
        "url": "https://news.sky.com/story/spies-and-special-forces-among-more-than-100-britons-whose-details-were-included-in-afghan-data-leak-13398068",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-afghanistan-armed-forces_6967165.jpg?20250717163448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 15:07:00",
        "Headline": "On Tuesday, it emerged that the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022.",
        "Content": " Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK.  Information about more than 100 Britons was contained in the breach. Defence sources have said that details of MI6 spies, SAS and special forces personnel were included in the spreadsheet, after they had backed Afghans who had applied to be brought to the UK. It comes after the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022 by a defence official. The Ministry of Defence (MoD) became aware of the breach in August 2023, when excerpts from a spreadsheet containing personal information were anonymously posted on a Facebook group. Read more:Afghan data breach timeline: The fallout behind the scenesWhy the Afghan data breach scandal has erupted now  After a super-injunction - imposed in September 2023 that blocked coverage of the leak - was lifted on Tuesday, Defence Secretary John Healey offered a \"sincere apology\" on behalf of the government. \n                  'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach\n                 \n                  Afghan data breach timeline: The fallout behind the scenes\n                 \n                  Starmer says former Tory ministers have 'serious questions to answer' over Afghan data breach\n                 \"This was a serious departmental error,\" he added. Shadow defence secretary James Cartlidge also apologised on behalf of the former Conservative government, which launched a secret scheme to relocate Afghan nationals impacted by the breach.  Some 6,900 Afghans - comprising 1,500 people named on the list as well as their dependents - are being relocated to the UK as part of this programme, atop the thousands moved under the Arap. The MoD said the relocation costs alone, directly linked to the data breach, will be around £850m. Between 80,000 and 100,000 people were affected. Judges said in June last year that they could be at risk of harassment, torture or death if the Taliban obtained their information. Read more from Sky News:The huge financial blow of Musk's row with TrumpThunderstorm warning issued - but temperatures to remain high  The super-injunction was lifted on Tuesday after an internal review concluded it \"appears unlikely that merely being on the dataset would be grounds for targeting\". However, an Afghan interpreter who worked with the British military told Sky News he feels \"betrayed by the British government\" and is afraid the Taliban will target him and his family.  The law firm Barings Law said on Tuesday it is working around 1,000 of those impacted \"to pursue potential legal action\". It comes as Parliament's Intelligence and Security Committee (ISC) requested that a number of documents used in the super-injunction proceedings be provided to it \"immediately\". A MoD spokesperson said: \"It's longstanding policy of successive governments to not comment on Special Forces. \"We take the security of our personnel very seriously and personnel, particularly those in sensitive positions, always have appropriate measures in place to protect their security.\""
    },
    {
        "title": "Accountants were paid to place clients into loan charge schemes targeted by HMRC",
        "description": "Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.&#160;",
        "url": "https://news.sky.com/story/accountants-were-paid-to-place-clients-into-loan-charge-schemes-targeted-by-hmrc-13398170",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-loan-charge-parliament_6461449.jpg?20240219171514",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "The loan charge scandal has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.  Sky News has seen evidence of chartered accountants advising their clients to enter loan arrangements, run by companies that were paying them a commission. These schemes were later targeted by HMRC, and workers were hit with giant tax bills, sometimes hundreds of thousands of pounds. Money blog: Value of a million homes rose 50% since COVID In some cases, the tax demands have been crippling. It's a campaign that has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides. MPs are now calling for a public investigation into the role of accountants and other professional bodies in the proliferation of these schemes. An independent review of the loan charge is currently under way, but it is limited in its scope. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Value of one million homes has risen by 50% since COVID - especially in two areas\n                 \n                  Jobless rate hits four-year high - but makes interest rate cut more likely\n                 What is the loan charge scandal? It is the latest revelation in a scandal that has caused untold misery for tens of thousands of people, who were enrolled into tax avoidance schemes, often against their knowledge. They included contractors who were urged to avoid setting up limited companies and to instead receive payment through the schemes, which were meant to handle their pay and taxes.  They worked by paying workers what were technically loans, instead of a salary. This allowed them to circumvent paying income tax. What many assumed were tax deductions on their payslips were, in fact, fees going towards the promoters of the schemes. Tax avoidance is not illegal, but HMRC has successfully challenged tax avoidance schemes in the courts, and workers have subsequently been asked to pay the missing tax. There is no suggestion that these accountants broke the law. Richard's story For Richard Clancey, HMRC's handling of the loan charge feels like \"state-sponsored bullying\". After being offered a contract role in 2010, Mr Clancey, now a retired computer services professional, contacted a chartered accountant in Kent to help him set up a limited company. The accountant encouraged him to enrol in a payment scheme instead. \"He gave us an hour's presentation on the benefits of the scheme and how it worked,\" Mr Clancey said. \"This included how they would handle all administration, pay all tax that was due, was IR35 and tax law compliant, had a lower risk than using a limited company, had been approved by a tax QC and was currently used by several people who were working for HMRC. \"The presentation was very elaborate and complicated and I cannot claim that I understood it all, but I wanted to ensure I was legal and compliant, so I trusted the advice of a chartered accountant that use of this scheme was the right thing to do.\" Read more:Rise in suicide attempts linked to HMRC crackdownHMRC accused of 'dangerous' new tactics in tax crackdown The accountant told him that he was receiving an introductory fee, but not that he would receive ongoing payment. In 2014, Mr Clancey received an email from his accountant outlining that the previous year he had received £257 in commission. However, he did not receive statements for the previous two years. \"Although you were notified of this commission before, we are also required to declare the amount of commission to you according to the guidance of the Institute of Chartered Accountants of England and Wales,\" the email read. \"This commission has not cost you anything,\" it added. The company's former website page clearly stated that it offered accountants commission, boasting that the rates had been raised. At this point, Mr Clancey was already on the radar of HMRC. In 2012, tax authorities wrote to him to explain that he had been in a tax avoidance scheme that \"HMRC believes does not work\". He was subsequently asked to pay more than £100,000. \"Over the next seven years, I received multiple penalties and threats from HMRC who said I had been a tax avoider who should settle their debts now or face worse consequences later,\" he said. \"There hasn't been a single day when I haven't been consumed by the frustration and anger of my situation and how it arose... Since my involvement with [the scheme] and the subsequent hounding from HMRC and government, a lot of that has changed. This state-sponsored bullying has caused me to suffer some mental health issues. \"My personal stress levels were through the roof. I dreaded the next brown envelope coming through the post box with outrageous, unsubstantiated demands. My poor wife would apologise and burst into tears as she brought these to me.\" HMRC said it takes the wellbeing of all taxpayers seriously. \"We are committed to identifying and supporting customers who need extra help with their tax affairs and have made significant improvements to this service over the last few years.\" Like others in his position, Mr Clancey is frustrated by the blunt approach of the tax authority and the lack of accountability from other parties. \"I have been increasingly concerned that my chartered accountant led me into the hands of a scam organisation,\" he said. \"HMRC continues to persecute victims.\" Government reaction The government has now launched an independent review into the loan charge, and HMRC is pausing its activity until that review is complete - but its focus is on helping people to reach a settlement. The review will not look at the historical role of accountants, promoters and recruitment agencies, even though they propped up the schemes. Politicians and campaigners have called for a broader investigation. Greg Smith, MP and co-chair of the Loan Charge and Taxpayer Fairness APPG, said: \"It's clear that many chartered accountants were directly involved in the promotion of loan schemes. \"People trusted accountants and had the right to rely on this advice, and yet, instead, are facing life-ruining bills. There needs to be a proper investigation into this as part of an independent inquiry into the loan charge scandal,\" he said. \"Either HMRC warned accountants not to recommend these schemes, in which case the accountants were giving reckless and potentially fraudulent advice; or HMRC didn't tell accountants not to do this, in which case HMRC themselves were seriously at fault. \"Either way, it is quite wrong that the current government continues to only pursue those who took and followed professional advice and not those who gave it, whilst profiting from doing so.\" The experience has damaged Mr Clancey's faith in the sector. \"I will never again trust professional financial advice,\" he said. \"If the advice of a chartered accountant can cause this much damage without culpability, then there is something very wrong. It is a failure on the part of the entire tax industry that accredited professionals can, through their advice, destroy the lives of the individuals that they advise.\" A spokesperson for the Institute of Chartered Accountants in England and Wales, an industry body, said: \"We expect chartered accountants to adhere to the highest standards in all of their work, including tax. \"Robust rules for members performing tax work are contained in standards which have been developed and strengthened to prevent the involvement of members in aggressive tax avoidance.\" The organisation strengthened its standards in 2017, after the loan charge legislation was announced, adding that \"members must not create, encourage or promote tax planning arrangements or structures that set out to achieve results that are contrary to the clear intention of parliament in enacting relevant legislation and/or are highly artificial or highly contrived and seek to exploit shortcomings within the relevant legislation\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK.  In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "UK weather: Thunderstorms ahead - but temperatures are set to remain high",
        "description": "Thunderstorms and heavy rain are set to hit the UK in the coming days &#8211; but temperatures will remain high. ",
        "url": "https://news.sky.com/story/uk-weather-thunderstorms-ahead-but-temperatures-are-set-to-remain-high-13398054",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6947685.jpg?20250621222452",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-17 14:47:00",
        "Headline": "Yellow weather warnings will come into effect for much of England on Friday, meaning there's a risk of sudden flooding and power cuts. ",
        "Content": "Thunderstorms and heavy rain are set to hit the UK in the coming days – but temperatures will remain high.  The Met Office has issued yellow warnings for much of England, stating there's a risk of sudden flooding, travel delays and power cuts on Friday and into Saturday. The first warning covers most of England and is in place for 9pm on Friday to 6pm on Saturday. The second - for parts of the East Midlands, North East England and Yorkshire and the Humber - is for 12pm to 8pm on Friday. Check the latest weather forecast here Spray and flooding could cause road closures and even cut some communities off, the Met Office has said, adding that lightning strikes could damage buildings. Sky weather producer Joanna Robinson said: \"Heavy, thundery rain will move in from France on Friday night, pushing northwards across much of England on Saturday, reaching Scotland later in the day. \"The rain will be torrential in places, bringing up to 30mm in less than an hour, with 60-90 mm in less than three hours for some isolated spots.\" Recent dry weather could increase the risk of flash flooding, as torrential rain falling on hard, baked ground will run off rather than being easily soaked in.  Despite the rain, it will still be hot - with temperatures expected to reach the high 20s for much of England. It will remain unsettled on Sunday and into next week, Robinson added. \"There'll be torrential rain for some, with further weather warnings likely when confidence in the detail improves,\" she said. \"The unsettled conditions will continue early next week, but exactly where the worst of the storms will be is currently very uncertain. \"There are signs that high pressure will help settle things down from the west on Wednesday.\" Read more:Buddhist monk sex scandal grips ThailandTeens aged 16 and 17 to vote in next general election The wet weather comes as England is struggling with its driest start to a year since 1976. Across the country, rainfall was 20% less than the long-term average in June, which also saw two heatwaves rive unusually high demand for water, the Environment Agency said.  With national reservoir levels at 75.6% and currently continuing to fall, droughts have been declared in multiple regions. Hosepipe bans are also hitting millions of homes, with Yorkshire Water announcing restrictions as its reservoir storage dropped to just 53.8%."
    },
    {
        "title": "Diane Abbott suspended from Labour Party",
        "description": "Diane Abbott has been suspended from the Labour Party pending an investigation.",
        "url": "https://news.sky.com/story/diane-abbott-suspended-from-labour-party-13398146",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diane-abbott_6967262.jpg?20250717182642",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-07-17 17:04:00",
        "Headline": "It comes after the veteran MP defended previous comments about racism which led to a year-long suspension.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Diane Abbott has been suspended from the Labour Party pending an investigation. A party spokesperson confirmed the decision to Sky News but did not give a reason why. Politics Live: The Starmtroopers are coming for the Corbynites It comes after the veteran MP defended previous comments about racism which sparked an antisemitism row and led to a year-long suspension. She apologised at the time and was readmitted back into the party before the 2024 general election. A Labour Party spokesperson said: \"Diane Abbott has been administratively suspended from the Labour Party, pending an investigation. We cannot comment further while this investigation is ongoing.\" Sky News understands that the suspension is not related to the four rebels who lost the whip on Wednesday for \"repeated breaches\" of party discipline, including voting against the government's welfare cuts. \n                  Spies and special forces among more than 100 Britons whose details were included in Afghan data leak\n                 \n                  Politics latest: Diane Abbott suspended from Labour\n                 \n                  Sixteen and 17-year-olds will be able to vote in next general election\n                 The action has been taken because of an interview in which she doubled down on her claim Jewish people experience racism differently to black people, which previously sparked a huge controversy. In a letter to The Observer in 2023, Ms Abbott argued that people of colour experienced racism \"all their lives\" and said that was different to the \"prejudice\" experienced by Jewish people, Irish people and Travellers. Shortly after it was published, she issued a statement in which she said she wished to \"wholly and unreservedly withdraw my remarks and disassociate myself from them\". However in a new interview with BBC Radio 4's Reflections programme this week, she said she did not look back on the incident with regret. Ms Abbott said: \"Clearly, there must be a difference between racism which is about colour and other types of racism because you can see a Traveller or a Jewish person walking down the street, you don't know. \"But if you see a black person walking down the street, you see straight away that they're black. They are different types of racism.\" She added: \"I just think that it's silly to try and claim that racism which is about skin colour is the same as other types of racism. \"I don't know why people would say that.\" Ms Abbott has not commented on the suspension directly but since the news broke she has posted a video of the interview on X. The clip was re-posted by Brian Leishman, one of the MPs suspended on Wednesday, who said: \"Diane Abbott has fought against racism her entire life.\" Bell Riberio-Addy, who lost her role as trade envoy in yesterday's purge, also came to Ms Abbott's defence, saying: \"Before condemning her based on headlines, I would listen to her clip and note she discussed the different forms that racism takes and condemned all forms of racism.\" Former shadow chancellor John McDonnell made similar comments, saying that in the interview his colleague \"forthrightly condemns antisemitism & discusses the different forms of racism\". In the interview, Ms Abbott said she \"of course\" condemns antisemitic behaviour in the same way she would condemn racist behaviour because of the colour of someone's skin, adding: \"I do get a bit weary of people trying to pin the antisemitic label on me because I spent a lifetime facing racism of all kinds.\" Ms Abbott made history when she was elected as Britain's first black female MP for Labour in 1987. She is the longest-serving female MP in the Commons, giving her the title \"Mother of the House\". As an MP on the left of the party she has often clashed with the leadership throughout her career - bar her time serving in Jeremy Corbyn's shadow cabinet. Read more from Sky News:Sixteen and 17-year-olds will be able to vote in next general electionFive reasons to be confused by Starmer's MP suspensions Many MPs rallied in support of Ms Abbott last year when it was not clear if she would be reinstated in time for the general election, or allowed to stand. She went on to retain her seat of Hackney North and Stoke Newington with a majority of over 15,000. Deputy Prime Minister Angela Rayner hinted action could be taken against Ms Abbott when she told The Guardian earlier on Thursday that she was \"disappointed\" in her colleague's remarks. \"There's no place for antisemitism in the Labour Party, and obviously the Labour Party has processes for that,\" she said. A source close to the decision to suspend her told Sky News there is a \"very slim chance\" she will be allowed back in, given she did antisemitism training and apologised last time. It raises questions about whether Ms Abbott could join the new party being formed by Mr Corbyn and former Labour MP Zarah Sultana. For the time being, Ms Abbott will sit in the Commons as an independent MP. Adnan Hussain, who was elected as the independent MP for Blackburn last year, said on X: \"We'd be honoured to have a giant like Diane join us, she [should] come to the side that would really appreciate her for the legend she is.\""
    },
    {
        "title": "One child dies after coach crashes in Somerset on way back from school trip",
        "description": "One child has died after a coach bringing children back from a school trip crashed and overturned near Minehead, Somerset, police have said. ",
        "url": "https://news.sky.com/story/one-child-dead-after-coach-crashes-in-somerset-on-way-back-from-school-trip-13398122",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-coach-crash_6967322.jpg?20250717201838",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 16:16:00",
        "Headline": "The coach, which had 60-70 people on board, \"overturned onto its roof and slid approximately 20ft down the embankment\", emergency services have said. ",
        "Content": " One child has died after a coach bringing children back from a school trip crashed and overturned near Minehead, Somerset, police have said.  A major incident was declared after the vehicle, which had 60-70 people on board, crashed on the A396 Cutcombe Hill, between Wheddon Cross and Timbercombe, shortly before 3pm on Thursday afternoon. The coach was heading to Minehead Middle School at the time. At a news conference on Thursday night, officials confirmed one child died at the scene. A further 21 patients were taken to hospital, including two children who were transported via air ambulance. \"Several\" other people were treated at the scene, they added. \"This has been an incredibly challenging scene for all emergency services,\" Chief Superintendent Mark Edgington said.  \"Today's events are truly tragic, we know the whole community and wider area will be utterly devastated to learn of this news.\" An investigation into what caused the crash will be carried out, he added.  Gavin Ellis, the chief fire officer for Devon and Somerset Fire & Rescue Service, said the coach \"overturned onto its roof and slid approximately 20ft down an embankment\". He praised an off-duty firefighter who was travelling behind the vehicle for helping at the scene, before crews then arrived to carry out rescues \"in extremely difficult circumstances\". \"I'm grateful for the tireless effort and actions of the crews in doing everything they could for those who were trapped and as quickly as safely as possible,\" he said. \"I'm extremely proud of the efforts that my firefighters took today at this tragic event.\" Eight fire engines were sent to the scene, with two specialist rescue appliances and around 60 fire personnel, Mr Ellis said. A total of 20 double-crewed ambulances, three air ambulances and two hazardous area response teams were also sent to the scene, a representative for the South Western Ambulance Service said. Ch Supt Mark Edgington said: \"Many passengers either sustained minor injuries or were physically unharmed and were transferred to a rest centre. \"Work to help them return to Minehead has been taking place throughout the evening. \"An investigation into the cause of this incident will be carried out.\" Minehead Middle School has pupils aged between nine and 14, and is five days away from the end of term. 'I don't have words,' says local MP   Rachel Gilmour, MP for Tiverton and Minehead, has said the road where the coach crashed is \"very difficult to manoeuvre\". Speaking to Sky News chief presenter Anna Botting, Ms Gilmour said she visited Minehead Middle School recently, where she \"met the children and they were full of joy, enthusiasm and were very positive\". \"I know many of their parents,\" she said. \"I don't have words.\" Describing the scene, Gilmour continued: \"You have a very difficult crossing at Wheddon Cross, and as you come out to dip down into Timbercombe, the road is really windy and there are very steep dips on either side. \"If the coach, as the police are saying, went 20ft off the road, you are literally on a really, really steep bank.\" The MP, whose constituency is partly in Devon and partly in Somerset, said there is a \"really, really close community\". \"We will pull together, but it would be crass of me to say to a parent who's just lost their child that I could make things better, I can't,\" she said. \"All I can say is that from one mother to another, I feel your pain.\" Sir Keir Starmer said in a post on X: \"There are no adequate words to acknowledge the death of a child. All my thoughts are with their parents, family and friends, and all those affected. \"Thank you to the emergency workers who are responding at pace - I'm being kept up to date on this situation.\" Education Secretary Bridget Phillipson wrote: \"It is heartbreaking to hear that a child has died and others are seriously injured following the incident in Minehead earlier today. \"My thoughts are with their friends and families, and all those affected by this tragic event.\""
    },
    {
        "title": "Protesters clash with police outside Essex hotel believed to house asylum seekers",
        "description": "Protesters have clashed with police outside an Essex hotel believed to be housing asylum seekers.",
        "url": "https://news.sky.com/story/protesters-clash-with-police-outside-essex-hotel-believed-to-house-asylum-seekers-13398262",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-epping-protest-essex_6967490.jpg?20250718004043",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "Demonstrators have repeatedly gathered outside the hotel since a 38-year-old man was last week accused of sexual assault.",
        "Content": "Protesters have clashed with police outside an Essex hotel believed to be housing asylum seekers. Footage appeared to show people approaching and throwing objects at a police van which was parked outside the Bell Hotel in Epping on Thursday evening. As the vehicle was driven away, one person climbed onto the front and held their hands in the air. Images showed an individual kicking the windscreen of the vehicle, completely smashing it in the process, while a crowd watched on. Eggs were thrown and fireworks were also let off outside the hotel, in the latest night of demonstrations, which have repeatedly happened since a 38-year-old man was accused of sexual assault last week. Hadush Gerberslasie Kebatu appeared at Chelmsford Magistrates' Court earlier in the day, where he denied trying to kiss a 14-year-old girl. One police officer was left with a neck injury after Thursday night's disruption, Essex Police said. The force said it has identified several suspects it believes are responsible for \"damaging police vehicles, the hotel and assaulting officers\". During the protest a section of High Road in Epping High was closed \"for the safety of the public,\" police said in a statement. The statement continued: \"We will not tolerate any criminality on our streets, whether linked to protesting or not.\" One man at Thursday's protest was arrested on suspicion of affray following reports of an assault near the hotel on Sunday. Chief Superintendent Simon Anslow said: \"Disruption and offending is never an appropriate response, no matter the strength of feeling in this case, and on this issue. \"People protesting peacefully, lawfully and responsibly cause us - and the wider public - no concern. \"However, we can never, and will never, tolerate criminal behaviour of any sort and anyone identified as committing crime will be dealt with robustly.\" The first planned protest near the Bell Hotel took place on Sunday night. While no offences were reported between two groups at the site, two male security staff members were assaulted by a group of men at a nearby bus stop, police said. The two victims made their way past the protest site at the hotel to get help. They have received hospital treatment for serious injuries and the incident is being investigated, the force said. \" At this stage, we're treating it as racially aggravated,\" they added. Another incident took place on Tuesday when a man allegedly shouted racial abuse at the hotel before later causing damage to the property, police said. He was arrested on suspicion of a racially aggravated public order offence and criminal damage. He has been released on bail while enquiries continue."
    },
    {
        "title": "Supply teachers costing schools £1.4bn - as students say they are 'falling behind'",
        "description": "Chronic teacher shortages and increased sickness absences have pushed schools to rely heavily on supply agencies, costing the education system nearly &#163;1.4bn in the last year alone.",
        "url": "https://news.sky.com/story/supply-teachers-costing-schools-16314bn-as-students-say-they-are-falling-behind-13397948",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-teacher-classroom_6960587.jpg?20250708234158",
        "type": "UK",
        "Author": "Anjum Peerbacos, education reporter, and Saywah Mahmood, data journalist",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "One headteacher told Sky News it can cost schools upwards of £200 a day for a \"decent supply teacher\", with schools \"being held over a barrel\" for some specialist subjects. ",
        "Content": "By Anjum Peerbacos, education reporter, and Saywah Mahmood, data journalist   Chronic teacher shortages and increased sickness absences have pushed schools to rely heavily on supply agencies, costing the education system nearly £1.4bn in the last year alone. The majority of the £1.4bn was made up by academy schools which spent £847m on agency supply staff in the 2023-24 academic year, new analysis by Sky News using Department for Education data shows. That's nearly double the amount (in real terms) compared to 2014-15.  One headteacher told Sky News it can cost schools upwards of £200 a day for a \"decent supply teacher\". \"In some subjects like physics, supply agencies can charge £300-£400 per day, and schools are being held over a barrel,\" said Gary Moore, the headteacher at Regent High School in north London. But it's students like Zainab Badran who are feeling the impact. \n                  Crisis in early years education as attainment gap widens, report warns\n                 \n                  Department for Education 'lacks coherent plan' to address teacher shortage\n                 \n                  Children with special needs will 'always' have 'legal right' to support, education secretary says\n                 \"Every lesson we would have a different supply teacher,\" the GCSE student said. \"I didn't feel like I was learning anything. We were falling behind.\" Mineche Kyezu-Mafuta, a Year 10 student, remembered her science class being taught by five different teachers in a week. \"We had subs, and we have science five times a week, so we had a sub for every single one of those lessons - the sub changed for every lesson,\" she said. \"Students (were) out of their seats, throwing stuff, talking, just anything you could really think of would be happening in that class. \"It was very loud, students weren't behaving, no one was really doing their work.\" The vacancy rate among classroom teachers is still three times higher than it was a decade ago. Last year, the number of classroom teachers leaving was twice the number of newly qualified teachers joining the workforce. At the same time, teacher pay has failed to keep up with the rising cost of living. Since 2015, the median teacher salary has increased by nearly 30%, while inflation has risen by about 50%. Agency commission rates Agency commission rates are another source of frustration for school leaders. A teacher earning £30,000 may cost a school approximately £36,900 through an agency, an effective 23% markup. This rate of fees continues to rise further with higher salaries. Andy De Angelis, headteacher of a secondary school in west London, said: \"UK agencies provide a CV and possibly help with references. I arrange the interviews.\" Sky News contacted several leading supply agencies for comment, but none responded. A Department for Education spokesperson said work is \"well under way to deliver on our pledge to recruit 6,500 new expert teachers so schools are less reliant on agency staff in the future\". Read more:Minister defends ending tax exemption on private schoolsNumber of 'severely absent' pupils rises \"We are already seeing early progress with over 2,300 more secondary and special school teachers in classrooms this year, and over a thousand more people than last year have accepted places on teacher training courses starting this September,\" they added. \"To support schools to get better value for money when hiring supply teachers and other temporary school staff, we have established the agency supply deal.\" 'Significant failings' But the teachers' union NASUWT has said recent government-commissioned research shows less than 0.5% of school leaders reported obtaining supply teachers through the Crown Commercial Service framework. \"Currently, the approach of government ignores the significant failings that exist in the provision of supply teachers,\" it said. \"This creates unnecessary cost and adversely affects supply teachers, schools and pupils. \"The best way forward for both schools and supply teachers would be for schools and local authorities to be supported by the government to maintain their own supply pools.\""
    },
    {
        "title": "Accountants were paid to place clients into loan charge schemes targeted by HMRC",
        "description": "Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.&#160;",
        "url": "https://news.sky.com/story/accountants-were-paid-to-place-clients-into-loan-charge-schemes-targeted-by-hmrc-13398170",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-loan-charge-parliament_6461449.jpg?20240219171514",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "The loan charge scandal has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.  Sky News has seen evidence of chartered accountants advising their clients to enter loan arrangements, run by companies that were paying them a commission. These schemes were later targeted by HMRC, and workers were hit with giant tax bills, sometimes hundreds of thousands of pounds. Money blog: Value of a million homes rose 50% since COVID In some cases, the tax demands have been crippling. It's a campaign that has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides. MPs are now calling for a public investigation into the role of accountants and other professional bodies in the proliferation of these schemes. An independent review of the loan charge is currently under way, but it is limited in its scope. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Value of one million homes has risen by 50% since COVID - especially in two areas\n                 \n                  Jobless rate hits four-year high - but makes interest rate cut more likely\n                 What is the loan charge scandal? It is the latest revelation in a scandal that has caused untold misery for tens of thousands of people, who were enrolled into tax avoidance schemes, often against their knowledge. They included contractors who were urged to avoid setting up limited companies and to instead receive payment through the schemes, which were meant to handle their pay and taxes.  They worked by paying workers what were technically loans, instead of a salary. This allowed them to circumvent paying income tax. What many assumed were tax deductions on their payslips were, in fact, fees going towards the promoters of the schemes. Tax avoidance is not illegal, but HMRC has successfully challenged tax avoidance schemes in the courts, and workers have subsequently been asked to pay the missing tax. There is no suggestion that these accountants broke the law. Richard's story For Richard Clancey, HMRC's handling of the loan charge feels like \"state-sponsored bullying\". After being offered a contract role in 2010, Mr Clancey, now a retired computer services professional, contacted a chartered accountant in Kent to help him set up a limited company. The accountant encouraged him to enrol in a payment scheme instead. \"He gave us an hour's presentation on the benefits of the scheme and how it worked,\" Mr Clancey said. \"This included how they would handle all administration, pay all tax that was due, was IR35 and tax law compliant, had a lower risk than using a limited company, had been approved by a tax QC and was currently used by several people who were working for HMRC. \"The presentation was very elaborate and complicated and I cannot claim that I understood it all, but I wanted to ensure I was legal and compliant, so I trusted the advice of a chartered accountant that use of this scheme was the right thing to do.\" Read more:Rise in suicide attempts linked to HMRC crackdownHMRC accused of 'dangerous' new tactics in tax crackdown The accountant told him that he was receiving an introductory fee, but not that he would receive ongoing payment. In 2014, Mr Clancey received an email from his accountant outlining that the previous year he had received £257 in commission. However, he did not receive statements for the previous two years. \"Although you were notified of this commission before, we are also required to declare the amount of commission to you according to the guidance of the Institute of Chartered Accountants of England and Wales,\" the email read. \"This commission has not cost you anything,\" it added. The company's former website page clearly stated that it offered accountants commission, boasting that the rates had been raised. At this point, Mr Clancey was already on the radar of HMRC. In 2012, tax authorities wrote to him to explain that he had been in a tax avoidance scheme that \"HMRC believes does not work\". He was subsequently asked to pay more than £100,000. \"Over the next seven years, I received multiple penalties and threats from HMRC who said I had been a tax avoider who should settle their debts now or face worse consequences later,\" he said. \"There hasn't been a single day when I haven't been consumed by the frustration and anger of my situation and how it arose... Since my involvement with [the scheme] and the subsequent hounding from HMRC and government, a lot of that has changed. This state-sponsored bullying has caused me to suffer some mental health issues. \"My personal stress levels were through the roof. I dreaded the next brown envelope coming through the post box with outrageous, unsubstantiated demands. My poor wife would apologise and burst into tears as she brought these to me.\" HMRC said it takes the wellbeing of all taxpayers seriously. \"We are committed to identifying and supporting customers who need extra help with their tax affairs and have made significant improvements to this service over the last few years.\" Like others in his position, Mr Clancey is frustrated by the blunt approach of the tax authority and the lack of accountability from other parties. \"I have been increasingly concerned that my chartered accountant led me into the hands of a scam organisation,\" he said. \"HMRC continues to persecute victims.\" Government reaction The government has now launched an independent review into the loan charge, and HMRC is pausing its activity until that review is complete - but its focus is on helping people to reach a settlement. The review will not look at the historical role of accountants, promoters and recruitment agencies, even though they propped up the schemes. Politicians and campaigners have called for a broader investigation. Greg Smith, MP and co-chair of the Loan Charge and Taxpayer Fairness APPG, said: \"It's clear that many chartered accountants were directly involved in the promotion of loan schemes. \"People trusted accountants and had the right to rely on this advice, and yet, instead, are facing life-ruining bills. There needs to be a proper investigation into this as part of an independent inquiry into the loan charge scandal,\" he said. \"Either HMRC warned accountants not to recommend these schemes, in which case the accountants were giving reckless and potentially fraudulent advice; or HMRC didn't tell accountants not to do this, in which case HMRC themselves were seriously at fault. \"Either way, it is quite wrong that the current government continues to only pursue those who took and followed professional advice and not those who gave it, whilst profiting from doing so.\" The experience has damaged Mr Clancey's faith in the sector. \"I will never again trust professional financial advice,\" he said. \"If the advice of a chartered accountant can cause this much damage without culpability, then there is something very wrong. It is a failure on the part of the entire tax industry that accredited professionals can, through their advice, destroy the lives of the individuals that they advise.\" A spokesperson for the Institute of Chartered Accountants in England and Wales, an industry body, said: \"We expect chartered accountants to adhere to the highest standards in all of their work, including tax. \"Robust rules for members performing tax work are contained in standards which have been developed and strengthened to prevent the involvement of members in aggressive tax avoidance.\" The organisation strengthened its standards in 2017, after the loan charge legislation was announced, adding that \"members must not create, encourage or promote tax planning arrangements or structures that set out to achieve results that are contrary to the clear intention of parliament in enacting relevant legislation and/or are highly artificial or highly contrived and seek to exploit shortcomings within the relevant legislation\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK.  In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "England through to semi-finals of Women's Euros after beating Sweden on penalties",
        "description": "England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden.",
        "url": "https://news.sky.com/story/england-through-to-semi-finals-of-womens-euros-after-beating-sweden-on-penalties-13398213",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-women-hannah-hampton_6967472.jpg?20250717231526",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 20:09:00",
        "Headline": "After a dramatic game in Zurich, England have managed to keep the dream of defending their European Championship title alive, after beating Sweden 3-2 on penalties. ",
        "Content": " England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden. The Lionesses won 3-2 on penalties at Stadion Letzigrund in Zurich, Switzerland, after clawing their way back to take the game into extra-time. The defending champions had been 2-0 down at half-time after goals from Sweden's Kosovare Asllani and Stina Blackstenius in the quarter-final clash. England then levelled matters towards the end of normal time. Lucy Bronze delivered the first England goal on 79 minutes, assisted by substitute Chloe Kelly. Two minutes later, Michelle Agyemang followed suit, taking the score to 2-2. After a goalless extra-time, it was time for penalties. Alessia Russo kicked things off, finding the back of the net for England, before Lauren James, Alex Greenwood, Beth Mead and Grace Clinton had their attempts saved by Sweden's Jennifer Falk. The game was sent into sudden death after Falk went face-to-face with England's Hannah Hampton but sent the ball flying over the crossbar. It all came down to Sweden's seventh penalty after Bronze sensationally scored, with 18-year-old Smilla Holmberg missing the chance to send her team through. England will next face Italy in the semi-finals in Geneva on Tuesday. 'That was crazy' England boss Sarina Wiegman described the action as \"one of the hardest games I've ever watched\". \"We could have been out of the game three or four times, when you're 2-0 at half-time it's not good,\" she said after the match. \"Although we started really bad, at the end it got better, but we didn't create anything so we had to change shape, and we score two goals - that was crazy. \"We miss a lot [of penalties], and they miss even more. I need to decompress, I think.\" Goalkeeper Hampton added that it was \"stressful watching\" and \"stressful playing\". The 24-year-old, who was left with a bloodied nose in extra-time, said: \"Every time I saved one, I was just thinking 'please put it in, so we have a bit of a cushion!' \"To be honest, I think I was better in the game when I had one nostril than when I was completely fine!\" She said it was the support of the England fans that helped the team push on. She said: \"They were definitely behind me and I appreciate all the support.\" Pressure was on the Lionesses after they won the tournament in 2022. Their journey in the group stages started with a 2-1 defeat to France, but hopes were lifted after England sailed past the Netherlands and Wales to reach the knockout stages, finishing second in Group D. Read more from Sky News:Child dies after coach crashes in SomersetSixteen and 17-year-olds will be able to vote in next general election Sweden on the other hand went into Thursday's game unbeaten in the tournament so far, having already defeated Germany, Poland and Denmark in the group stages."
    },
    {
        "title": "Spies and special forces among more than 100 Britons whose details were included in Afghan data leak",
        "description": "Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK. ",
        "url": "https://news.sky.com/story/spies-and-special-forces-among-more-than-100-britons-whose-details-were-included-in-afghan-data-leak-13398068",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-afghanistan-armed-forces_6967165.jpg?20250717163448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 15:07:00",
        "Headline": "On Tuesday, it emerged that the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022.",
        "Content": " Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK.  Information about more than 100 Britons was contained in the breach. Defence sources have said that details of MI6 spies, SAS and special forces personnel were included in the spreadsheet, after they had backed Afghans who had applied to be brought to the UK. It comes after the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022 by a defence official. The Ministry of Defence (MoD) became aware of the breach in August 2023, when excerpts from a spreadsheet containing personal information were anonymously posted on a Facebook group. Read more:Afghan data breach timeline: The fallout behind the scenesWhy the Afghan data breach scandal has erupted now  After a super-injunction - imposed in September 2023 that blocked coverage of the leak - was lifted on Tuesday, Defence Secretary John Healey offered a \"sincere apology\" on behalf of the government. \n                  'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach\n                 \n                  Afghan data breach timeline: The fallout behind the scenes\n                 \n                  Starmer says former Tory ministers have 'serious questions to answer' over Afghan data breach\n                 \"This was a serious departmental error,\" he added. Shadow defence secretary James Cartlidge also apologised on behalf of the former Conservative government, which launched a secret scheme to relocate Afghan nationals impacted by the breach.  Some 6,900 Afghans - comprising 1,500 people named on the list as well as their dependents - are being relocated to the UK as part of this programme, atop the thousands moved under the Arap. The MoD said the relocation costs alone, directly linked to the data breach, will be around £850m. Between 80,000 and 100,000 people were affected. Judges said in June last year that they could be at risk of harassment, torture or death if the Taliban obtained their information. Read more from Sky News:The huge financial blow of Musk's row with TrumpThunderstorm warning issued - but temperatures to remain high  The super-injunction was lifted on Tuesday after an internal review concluded it \"appears unlikely that merely being on the dataset would be grounds for targeting\". However, an Afghan interpreter who worked with the British military told Sky News he feels \"betrayed by the British government\" and is afraid the Taliban will target him and his family.  The law firm Barings Law said on Tuesday it is working around 1,000 of those impacted \"to pursue potential legal action\". It comes as Parliament's Intelligence and Security Committee (ISC) requested that a number of documents used in the super-injunction proceedings be provided to it \"immediately\". A MoD spokesperson said: \"It's longstanding policy of successive governments to not comment on Special Forces. \"We take the security of our personnel very seriously and personnel, particularly those in sensitive positions, always have appropriate measures in place to protect their security.\""
    },
    {
        "title": "Diane Abbott suspended from Labour Party",
        "description": "Diane Abbott has been suspended from the Labour Party pending an investigation.",
        "url": "https://news.sky.com/story/diane-abbott-suspended-from-labour-party-13398146",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diane-abbott_6967262.jpg?20250717182642",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-07-17 17:04:00",
        "Headline": "It comes after the veteran MP defended previous comments about racism which led to a year-long suspension.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Diane Abbott has been suspended from the Labour Party pending an investigation. A party spokesperson confirmed the decision to Sky News but did not give a reason why. Politics Live: The Starmtroopers are coming for the Corbynites It comes after the veteran MP defended previous comments about racism which sparked an antisemitism row and led to a year-long suspension. She apologised at the time and was readmitted back into the party before the 2024 general election. A Labour Party spokesperson said: \"Diane Abbott has been administratively suspended from the Labour Party, pending an investigation. We cannot comment further while this investigation is ongoing.\" Sky News understands that the suspension is not related to the four rebels who lost the whip on Wednesday for \"repeated breaches\" of party discipline, including voting against the government's welfare cuts. \n                  Spies and special forces among more than 100 Britons whose details were included in Afghan data leak\n                 \n                  Politics latest: Diane Abbott suspended from Labour\n                 \n                  Sixteen and 17-year-olds will be able to vote in next general election\n                 The action has been taken because of an interview in which she doubled down on her claim Jewish people experience racism differently to black people, which previously sparked a huge controversy. In a letter to The Observer in 2023, Ms Abbott argued that people of colour experienced racism \"all their lives\" and said that was different to the \"prejudice\" experienced by Jewish people, Irish people and Travellers. Shortly after it was published, she issued a statement in which she said she wished to \"wholly and unreservedly withdraw my remarks and disassociate myself from them\". However in a new interview with BBC Radio 4's Reflections programme this week, she said she did not look back on the incident with regret. Ms Abbott said: \"Clearly, there must be a difference between racism which is about colour and other types of racism because you can see a Traveller or a Jewish person walking down the street, you don't know. \"But if you see a black person walking down the street, you see straight away that they're black. They are different types of racism.\" She added: \"I just think that it's silly to try and claim that racism which is about skin colour is the same as other types of racism. \"I don't know why people would say that.\" Ms Abbott has not commented on the suspension directly but since the news broke she has posted a video of the interview on X. The clip was re-posted by Brian Leishman, one of the MPs suspended on Wednesday, who said: \"Diane Abbott has fought against racism her entire life.\" Bell Riberio-Addy, who lost her role as trade envoy in yesterday's purge, also came to Ms Abbott's defence, saying: \"Before condemning her based on headlines, I would listen to her clip and note she discussed the different forms that racism takes and condemned all forms of racism.\" Former shadow chancellor John McDonnell made similar comments, saying that in the interview his colleague \"forthrightly condemns antisemitism & discusses the different forms of racism\". In the interview, Ms Abbott said she \"of course\" condemns antisemitic behaviour in the same way she would condemn racist behaviour because of the colour of someone's skin, adding: \"I do get a bit weary of people trying to pin the antisemitic label on me because I spent a lifetime facing racism of all kinds.\" Ms Abbott made history when she was elected as Britain's first black female MP for Labour in 1987. She is the longest-serving female MP in the Commons, giving her the title \"Mother of the House\". As an MP on the left of the party she has often clashed with the leadership throughout her career - bar her time serving in Jeremy Corbyn's shadow cabinet. Read more from Sky News:Sixteen and 17-year-olds will be able to vote in next general electionFive reasons to be confused by Starmer's MP suspensions Many MPs rallied in support of Ms Abbott last year when it was not clear if she would be reinstated in time for the general election, or allowed to stand. She went on to retain her seat of Hackney North and Stoke Newington with a majority of over 15,000. Deputy Prime Minister Angela Rayner hinted action could be taken against Ms Abbott when she told The Guardian earlier on Thursday that she was \"disappointed\" in her colleague's remarks. \"There's no place for antisemitism in the Labour Party, and obviously the Labour Party has processes for that,\" she said. A source close to the decision to suspend her told Sky News there is a \"very slim chance\" she will be allowed back in, given she did antisemitism training and apologised last time. It raises questions about whether Ms Abbott could join the new party being formed by Mr Corbyn and former Labour MP Zarah Sultana. For the time being, Ms Abbott will sit in the Commons as an independent MP. Adnan Hussain, who was elected as the independent MP for Blackburn last year, said on X: \"We'd be honoured to have a giant like Diane join us, she [should] come to the side that would really appreciate her for the legend she is.\""
    },
    {
        "title": "UK weather: Thunderstorms ahead - but temperatures are set to remain high",
        "description": "Thunderstorms and heavy rain are set to hit the UK in the coming days &#8211; but temperatures will remain high. ",
        "url": "https://news.sky.com/story/uk-weather-thunderstorms-ahead-but-temperatures-are-set-to-remain-high-13398054",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6947685.jpg?20250621222452",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 14:47:00",
        "Headline": "Yellow weather warnings will come into effect for much of England on Friday, meaning there's a risk of sudden flooding and power cuts. ",
        "Content": "Thunderstorms and heavy rain are set to hit the UK in the coming days – but temperatures will remain high.  The Met Office has issued yellow warnings for much of England, stating there's a risk of sudden flooding, travel delays and power cuts on Friday and into Saturday. The first warning covers most of England and is in place for 9pm on Friday to 6pm on Saturday. The second - for parts of the East Midlands, North East England and Yorkshire and the Humber - is for 12pm to 8pm on Friday. Check the latest weather forecast here Spray and flooding could cause road closures and even cut some communities off, the Met Office has said, adding that lightning strikes could damage buildings. Sky weather producer Joanna Robinson said: \"Heavy, thundery rain will move in from France on Friday night, pushing northwards across much of England on Saturday, reaching Scotland later in the day. \"The rain will be torrential in places, bringing up to 30mm in less than an hour, with 60-90 mm in less than three hours for some isolated spots.\" Recent dry weather could increase the risk of flash flooding, as torrential rain falling on hard, baked ground will run off rather than being easily soaked in.  Despite the rain, it will still be hot - with temperatures expected to reach the high 20s for much of England. It will remain unsettled on Sunday and into next week, Robinson added. \"There'll be torrential rain for some, with further weather warnings likely when confidence in the detail improves,\" she said. \"The unsettled conditions will continue early next week, but exactly where the worst of the storms will be is currently very uncertain. \"There are signs that high pressure will help settle things down from the west on Wednesday.\" Read more:Buddhist monk sex scandal grips ThailandTeens aged 16 and 17 to vote in next general election The wet weather comes as England is struggling with its driest start to a year since 1976. Across the country, rainfall was 20% less than the long-term average in June, which also saw two heatwaves rive unusually high demand for water, the Environment Agency said.  With national reservoir levels at 75.6% and currently continuing to fall, droughts have been declared in multiple regions. Hosepipe bans are also hitting millions of homes, with Yorkshire Water announcing restrictions as its reservoir storage dropped to just 53.8%."
    },
    {
        "title": "Sixteen and 17-year-olds will be able to vote in next general election",
        "description": "Sixteen and 17 year olds will be able to vote in all UK elections in the biggest reform to the electoral system since 1969.",
        "url": "https://news.sky.com/story/16-and-17-year-olds-will-be-able-to-vote-in-next-general-election-13397859",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rickmansworth-polling_6902339.jpg?20250501081357",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-17 09:05:00",
        "Headline": "Up to 9.5 million more people will be able to vote by lowering the age.",
        "Content": " Sixteen and 17 year olds will be able to vote in all UK elections in the biggest reform to the electoral system since 1969. The government said it will give young people the right to vote in the next general election, something Labour promised in its manifesto last summer. They can already vote in Senedd elections in Wales and Holyrood elections in Scotland, but this will mean all 16 and 17 year olds across all four UK nations can vote in local, regional and general elections. Politics latest: Starmer facing criticism for suspending rebel MPs Up to 9.5 million more people will now be able to vote, the IPPR thinktank said. The latest figures show 48,208,507 people are registered to vote. The last time the voting age was changed was in 1969 when it was reduced from 21 to 18. The government has said the change will \"boost democratic engagement in a changing world, and help to restore trust in UK democracy\". \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  Voter ID won't be scrapped, minister says\n                 \n                  Five reasons to be confused by Starmer's MP suspensions\n                 Deputy Prime Minister Angela Rayner said: \"For too long public trust in our democracy has been damaged and faith in our institutions has been allowed to decline.        \"We are taking action to break down barriers to participation that will ensure more people have the opportunity to engage in UK democracy, supporting our Plan for Change, and delivering on our manifesto commitment to give 16 year olds the right to vote.    \"We cannot take our democracy for granted, and by protecting our elections from abuse and boosting participation we will strengthen the foundations of our society for the future.\" Majority of Britons do not want to give young people a vote A YouGov poll of 5,538 adults held in the hours after Thursday's announcement found 57% of Britons think 16 and 17 year olds should not be allowed to vote, while a third (32%) say they should. Anthony Wells, head of European political and social research at YouGov, said due to \"raw numbers\", 16 and 17 year olds \"probably won't have much impact\" as they only make up about 2.8% of the 16+ population. If their turnout rate is similar to other young people, they will also be a \"substantially lower proportion of the actual electorate\", he added. They tend to vote more heavily for Labour and the Greens - less for the Tories - however, he added this could change if Labour is unpopular by the next election. No consultation Conservative shadow communities minister Paul Holmes accused Labour of having \"rushed\" the announcement out \"in an attempt to avoid parliamentary scrutiny and without consultation\", calling it a \"confusing message to young people\". He said it is a \"brazen attempt\" by a party whose \"unpopularity is scaring them into making major constitutional changes without consultation\". The Tory added: \"16-year-olds will be able to vote in an election but not stand as candidates, and they will be able to vote but not permitted to buy a lottery ticket, consume alcohol, marry, or go to war. \"This is a hopelessly confusing policy from Labour, who appear uncertain themselves about what they want young people to be allowed to do.\" Read more:Voter ID won't be scrapped, minister saysNew rules may stop Elon Musk making unlimited donations to Reform Half of the public were opposed to giving 16 and 17 year olds the vote when Labour suggested it ahead of last year's election, polling by More in Common found in May 2024. A total of 47% of those polled of all ages were opposed, while 28% supported the change. The older people were, the more opposed they were, with just 10% of 75-year-olds and over strongly or 'somewhat' supportive. Gen Z (aged 18-26) were the most supportive, with 49% strongly or somewhat supportive. But the polling showed people were sceptical about Labour's motivations for lowering the voting age, with the majority of voters from all parties thinking Labour was doing it to benefit them in elections. The polling also found most people, including Gen Z, did not feel mature enough to be able to vote until they were 18. Bank cards allowed as voter ID As part of the strategy, voter ID will also be extended to include UK-issued bank cards. Mr Holmes raised concerns using bank cards for ID will \"undermine the security of the ballot box\". When other IDs that are already accepted, such as the veteran card and UK driving licences, become digitised, they will also be accepted in that form. A digital Voter Authority Certificate will also be created to ensure electoral registration officers, who maintain registers of electors and absent voters, will be able to accept digital forms of ID. Close loopholes for foreign donors In an effort to boost transparency and accountability in politics, the government said it will close loopholes allowing foreign donors via \"shell companies\" to influence UK political parties. New requirements will be introduced so unincorporated associations will have to carry out checks on donations over £500 to tackle foreign interference. The Electoral Commission will also be given new powers to enforce heavier fines of up to £500,000 on those who breach political finance rules, and enable tougher sentences for those who abuse election campaigners."
    },
    {
        "title": "Israel says it 'deeply regrets' deaths at Gaza's only Catholic church",
        "description": "Israel has said it \"deeply regrets\" three deaths at Gaza's only Catholic church, adding that a \"stray ammunition\" hit the building.",
        "url": "https://news.sky.com/story/pope-deeply-saddened-by-deaths-at-sole-catholic-church-in-gaza-after-israeli-strike-13397959",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-holy-family-church-i_6966934.jpg?20250717144732",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 11:42:00",
        "Headline": "Three people died and nine others were wounded when the Gaza's Holy Family Church was hit, the Latin Patriarchate of Jerusalem said in a statement. ",
        "Content": " Israel has said it \"deeply regrets\" three deaths at Gaza's only Catholic church, adding that a \"stray ammunition\" hit the building. A further nine people were injured in the incident at the Holy Family Church, the Latin Patriarchate of Jerusalem said earlier on Thursday. Parish priest Father Gabriele Romanelli, an Argentinian who used to regularly update the late Pope Francis about the conflict in Gaza, was lightly injured. A statement from Prime Minister Benjamin Netanyahu's office said: \"Every innocent life lost is a tragedy. We share the grief of the families and the faithful. \"Israel is investigating the incident and remains committed to protecting civilians and holy sites.\" The office also said it is \"grateful to Pope Leo for his words of comfort\" after the Catholic leader said he was \"deeply saddened\". The pope also called for an \"immediate ceasefire\" in a telegram for the victims. He expressed his \"profound hope for dialogue, reconciliation and enduring peace in the region,\" according to the telegram, which was signed by the Vatican Secretary of State Cardinal Pietro Parolin. \n                  Gaza: At least 20 killed near distribution site, says Israel-backed aid group\n                 \n                  Can BBC learn from Gaza documentary controversy?\n                 \n                  BBC breached editorial guidelines over Gaza documentary narrated by son of Hamas official\n                 Cardinal Pierbattista Pizzaballa, the Latin Patriarch of Jerusalem, told the Vatican News website that the church was shelled by a tank. \"What we know for sure is that a tank, the IDF says by mistake, but we are not sure about this, they hit the Church directly, the Church of the Holy Family, the Latin Church\", he said. The Latin Patriarchate of Jerusalem said: \"On behalf of the entire Church of the Holy Land, we extend our deepest condolences to the bereaved families, and from here, we offer our prayers for the swift and full recovery of the wounded. \"The Latin Patriarchate strongly condemns this tragedy and this targeting of innocent civilians and of a sacred place. \"However, this tragedy is not greater or more terrible than the many others that have befallen Gaza.\" The church was sheltering both Christians and Muslims, including a number of children with disabilities, according to Fadel Naem, acting director of Al-Ahli Hospital, which received the wounded. The Israel Defence Forces (IDF) said its \"initial inquiry into reports regarding injured individuals in the Holy Family Church in Gaza City suggests that fragments from a shell fired during operational activity in the area hit the church mistakenly\". \"The cause of the incident is under review,\" the statement added. \"The IDF makes every feasible effort to mitigate harm to civilians and civilian structures, including religious sites,and regrets any damage caused to them.\" Israel's foreign ministry said in a statement on X that the results of the investigation would be published. It also said the country did not target churches or religious sites and regretted harm to them or civilians. The previous pope, Francis, spoke almost daily with the Gaza church. In the last 18 months of his life, Francis would often call the church to see how people huddled inside were coping with a devastating war. Read more:Deadly crush at Gaza aid site after new system implementedGaza: At least 20 killed near distribution site, says Israel-backed aid group At least 20 more people were killed on Thursday by Israeli attacks across the besieged territory, medics said. Throughout the 21-month war, more than 58,000 Palestinians have been killed by Israel's military campaign, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. Israel launched a retaliatory campaign against Hamas following the militant group's 7 October 2023 attacks, during which 1,200 people were killed and about 250 taken hostage."
    },
    {
        "title": "Syria's president vows to protect Druze population after Israel airstrikes - as new ceasefire begins",
        "description": "Syria's president has said protecting the rights of the Druze population is \"our priority\" after Israel warned it would destroy forces attacking the minority.",
        "url": "https://news.sky.com/story/syrias-president-vows-to-protect-druze-population-after-israel-airstrikes-as-new-ceasefire-begins-13397853",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-syria-druze_6966814.jpg?20250717102839",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 08:56:00",
        "Headline": "Syria's interior ministry and a Druze religious leader announce a fresh ceasefire, which so far appears to be holding, while government troops withdraw from a key city.",
        "Content": " Syria's president has said protecting the rights of the Druze population is \"our priority\" after Israel warned it would destroy forces attacking the minority. In a televised statement early today, Ahmed al Sharaa told the Druze \"we reject any attempt to drag you into hands of an external party\". Several hundred people have reportedly been killed this week in the south of Syria in violence involving local fighters, government authorities and Bedouin tribes. Following the president's announcement and a ceasefire agreement, Syrian government forces on Thursday largely withdrew from the volatile southern province of Sweida. Under the terms of the agreement, Druze factions and clerics have been appointed to maintain internal security. As the violence escalated in Sweida, Israel launched airstrikes, including attacks on Wednesday on the defence ministry in Damascus and a target near the presidential palace. Benjamin Netanyahu's government has pledged to \"act resolutely against any terrorist threat on its borders\". \n                  Israel says it 'deeply regrets' deaths at Gaza's only Catholic church\n                 \n                  Why has Trump just called his own supporters 'stupid'?\n                 \n                  Why Israel is getting involved in Syria's internal fighting\n                 The Druze population follow an offshoot of Islam and are estimated to number about one million, spread between Syria, Lebanon and Israel. Sharaa - Syria's interim leader after President Assad fled last year - gave a televised statement on Wednesday telling the Druze \"we reject any attempt to drag you into hands of an external party\". \"We are not among those who fear the war,\" he added.  \"We have spent our lives facing challenges and defending our people, but we have put the interests of the Syrians before chaos and destruction,\" said the president. He also claimed Israel has \"consistently targeted our stability and created discord among us since the fall of the former regime\". Israel has accused the Syrian regime of being barely disguised jihadists - despite warming ties with Western countries such as the UK and US. Read more:Why Israel is getting involved in Syria's internal fighting?UK restores diplomatic ties with Syria  The UK-based Syrian Observatory for Human Rights said, as of Wednesday morning, more than 300 people had been killed in the flare-up of violence. Around 1,000 Druze people broke through a fence into southern Syria on Wednesday in a bid to help, according to The Times of Israel. Prime Minister Netanyahu urged people not to cross into Syria and Israeli military chief of staff Eyal Zamir warned they would not \"allow southern Syria to become a terror stronghold\". The UN Security Council will discuss the situation today, despite the US secretary of state saying yesterday that America had brokered an end to the violence. \"We have engaged all the parties involved in the clashes in Syria,\" Marco Rubio said on social media. \"We have agreed on specific steps that will bring this troubling and horrifying situation to an end tonight.\" The intervention appeared to have an immediate effect. The situation was calm on Thursday morning, according to Reuters sources in the area."
    },
    {
        "title": "England through to semi-finals of Women's Euros after beating Sweden on penalties",
        "description": "England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden.",
        "url": "https://news.sky.com/story/england-through-to-semi-finals-of-womens-euros-after-beating-sweden-on-penalties-13398213",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-women-hannah-hampton_6967472.jpg?20250717231526",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 20:09:00",
        "Headline": "After a dramatic game in Zurich, England have managed to keep the dream of defending their European Championship title alive, after beating Sweden 3-2 on penalties. ",
        "Content": " England have booked their place in the semi-finals of the Women's Euros after knocking out Sweden. The Lionesses won 3-2 on penalties at Stadion Letzigrund in Zurich, Switzerland, after clawing their way back to take the game into extra-time. The defending champions had been 2-0 down at half-time after goals from Sweden's Kosovare Asllani and Stina Blackstenius in the quarter-final clash. England then levelled matters towards the end of normal time. Lucy Bronze delivered the first England goal on 79 minutes, assisted by substitute Chloe Kelly. Two minutes later, Michelle Agyemang followed suit, taking the score to 2-2. After a goalless extra-time, it was time for penalties. Alessia Russo kicked things off, finding the back of the net for England, before Lauren James, Alex Greenwood, Beth Mead and Grace Clinton had their attempts saved by Sweden's Jennifer Falk. The game was sent into sudden death after Falk went face-to-face with England's Hannah Hampton but sent the ball flying over the crossbar. It all came down to Sweden's seventh penalty after Bronze sensationally scored, with 18-year-old Smilla Holmberg missing the chance to send her team through. England will next face Italy in the semi-finals in Geneva on Tuesday. 'That was crazy' England boss Sarina Wiegman described the action as \"one of the hardest games I've ever watched\". \"We could have been out of the game three or four times, when you're 2-0 at half-time it's not good,\" she said after the match. \"Although we started really bad, at the end it got better, but we didn't create anything so we had to change shape, and we score two goals - that was crazy. \"We miss a lot [of penalties], and they miss even more. I need to decompress, I think.\" Goalkeeper Hampton added that it was \"stressful watching\" and \"stressful playing\". The 24-year-old, who was left with a bloodied nose in extra-time, said: \"Every time I saved one, I was just thinking 'please put it in, so we have a bit of a cushion!' \"To be honest, I think I was better in the game when I had one nostril than when I was completely fine!\" She said it was the support of the England fans that helped the team push on. She said: \"They were definitely behind me and I appreciate all the support.\" Pressure was on the Lionesses after they won the tournament in 2022. Their journey in the group stages started with a 2-1 defeat to France, but hopes were lifted after England sailed past the Netherlands and Wales to reach the knockout stages, finishing second in Group D. Read more from Sky News:Child dies after coach crashes in SomersetSixteen and 17-year-olds will be able to vote in next general election Sweden on the other hand went into Thursday's game unbeaten in the tournament so far, having already defeated Germany, Poland and Denmark in the group stages."
    },
    {
        "title": "Felix Baumgartner: Extreme athlete who jumped from edge of space dies after paragliding crash",
        "description": "Felix Baumgartner, the extreme athlete who once jumped from the edge of space, has died in a paragliding crash in Italy.",
        "url": "https://news.sky.com/story/felix-baumgartner-extreme-athlete-who-jumped-from-space-dies-after-paragliding-crash-13398204",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-felix-baumgartner-jumper_6967380.jpg?20250717213558",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 19:34:00",
        "Headline": "The 56-year-old lost control of his motorised paraglider while flying in Italy and he fell to the ground near a hotel swimming pool.",
        "Content": "Felix Baumgartner, the extreme athlete who once jumped from the edge of space, has died in a paragliding crash in Italy. The 56-year-old Austrian lost control of his motorised paraglider while flying over Porto Sant'Elpidio in the central Marche region. He then fell to the ground near the swimming pool of a hotel. The reasons for the accident were unclear. According to reports, he fell ill and lost control. During the fall, he is thought to have hit a hotel employee, who was taken to hospital with neck injuries, according to Sky Sports Austria. She was reportedly injured by a piece of debris that had been dislodged during the vehicle's impact. The mayor of Porto Sant'Elpidio, Massimiliano Ciarpella, offered the town's condolences for the death of \"a symbol of courage and passion for extreme flights\". \n                  Body found in search for British hiker Matthew Hall who went missing in Italy\n                 \n                  British hiker missing for a week in Italian Alps\n                 \n                  Meredith Kercher's killer faces new trial over sexual assault allegations\n                 Mr Baumgartner is best known for smashing the world record for the highest skydive after leaping from the edge of space in October 2012. He ascended to 128,097ft in a pressurised capsule suspended beneath a giant helium balloon. He then jumped out, freefalling for four minutes and 19 seconds before opening his parachute. He made the historic jump over Roswell, New Mexico, reaching a peak speed of over 833mph (1,343kph). Mr Baumgartner's altitude record stood until 2014 when American computer scientist Alan Eustace did a jump from a height of 135,890ft."
    },
    {
        "title": "Buddhist monk sex scandal grips Thailand as woman arrested",
        "description": "A sex scandal has rocked Thailand's Buddhist clergy after a woman allegedly enticed a string of monks into having sex with her and then blackmailed them.",
        "url": "https://news.sky.com/story/buddhist-monk-sex-scandal-grips-thailand-as-woman-arrested-13397838",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wilawan-emsawat-monk_6966781.png?20250717092125",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 08:23:00",
        "Headline": "A woman has been arrested in Thailand for allegedly enticing senior monks into having sex with her and then pressuring them into making large payments to cover it up. ",
        "Content": " A sex scandal has rocked Thailand's Buddhist clergy after a woman allegedly enticed a string of monks into having sex with her and then blackmailed them. At least nine abbots and senior monks have been disrobed and cast out of the monkhood, the Royal Thai Police Central Investigation Bureau said. Wilawan Emsawat, in her mid-30s, is accused of enticing senior monks into having sex with her and then pressuring them into making large payments to cover it up. Thai monks are largely members of the Theravada sect, which requires them to be celibate and refrain from even touching a woman. Several monks transferred large amounts of money after Wilawan initiated romantic relationships with them, police said -her bank accounts received around 385 million baht (£8.8m) in the past three years, with most of that spent on gambling websites. Wilawan was arrested at her home in Nonthaburi province, north of the capital Bangkok, on charges including extortion, money laundering and receiving stolen goods. Thai media reported a search of her mobile phones revealed tens of thousands of photos and videos, as well as numerous chat logs indicating intimacy with several monks, many of which could be used for blackmail. An investigation was launched last month after an abbot of a famous temple in Bangkok abruptly left the monkhood. He had allegedly been blackmailed by Wilawan over their romantic relationship, investigators found. She told the monk she was pregnant and asked him to pay her 7.2 million baht (£165,000), Jaroonkiat Pankaew, a Central Investigation Bureau deputy commissioner, said at a news conference in Bangkok on Tuesday. Read more from Sky News:Children under seven should not drink slushies, watchdog warnsFive reasons to be confused by Starmer's MP suspensions Acting Prime Minister Phumtham Wechayachai ordered authorities to review and consider tightening existing laws related to monks and temples, especially the transparency of temple finances, to restore faith in Buddhism, government spokesperson Jirayu Houngsub said on Tuesday. The Central Investigation Bureau has set up a Facebook page for people to report monks who misbehave, Mr Jaroonkiat said. \"We will investigate monks across the country,\" he said. \"I believe that the ripple effects of this investigation will lead to a lot of changes.\""
    },
    {
        "title": "Sixty-one dead and others missing after shopping centre fire in eastern Iraq city of Kut",
        "description": "Sixty-one people have died in a fire at a shopping centre in the eastern Iraq city of Kut.",
        "url": "https://news.sky.com/story/sixty-one-dead-and-others-missing-after-shopping-centre-fire-in-eastern-iraq-city-of-kut-13397914",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kut-iraq-shopping-centre_6966885.jpg?20250717113313",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 10:26:00",
        "Headline": "The complex had only just opened and legal cases have been opened against its owners. The cause is so far unclear.",
        "Content": "Sixty-one people have died in a fire at a shopping centre in the eastern Iraq city of Kut. It broke out late on Wednesday at the five-storey Corniche Hypermarket Mall, which only opened a week ago. More than 45 people were rescued but others are still missing, according to the interior ministry and the Iraqi News Agency. The ministry said most victims died from smoke inhalation and that 14 burned bodies were still unidentified. Provincial governor Mohammed al Mayyeh declared three days of mourning and said legal cases had been opened against the owners of the centre. \"We assure the families of the innocent victims that we will not be lenient with those who were directly or indirectly responsible for this incident,\" he said. The result of a preliminary investigation will be released within 48 hours. Iraqi Prime Minister Mohammad Shia al Sudani has ordered the interior minister to go to Kut to investigate and take steps to prevent a similar incident. Read more from Sky News:Devastating' blaze destroys stage at major festivalAfghan interpreter says family 'waiting for death' Iraq has seen several previous cases of poor building standards contributing to deadly fires. Dozens were killed in a hospital fire in Nasiriyah in 2021 after highly combustible and illegal cladding was used. More than 100 also died at a wedding in Hamdaniya in 2023 after ceiling panels were set alight by a pyrotechnics machine."
    },
    {
        "title": "Ruth Chepngetich: Women's marathon world record-holder provisionally suspended after positive doping test",
        "description": "Women's marathon world record-holder Ruth Chepngetich has been provisionally suspended after a positive doping test.",
        "url": "https://news.sky.com/story/ruth-chepngetich-womens-marathon-world-record-holder-provisionally-suspended-after-positive-doping-test-13398165",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ruth-chepngetich_6967269.jpg?20250717183305",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 17:08:00",
        "Headline": "Ruth Chepngetich tested positive for hydrochlorothiazid (HCTZ), which can be used to disguise the use of performance-enhancing drugs.",
        "Content": "Women's marathon world record-holder Ruth Chepngetich has been provisionally suspended after a positive doping test. The move was announced by the Athletics Integrity Unit (AIU) on Thursday after the test result was reported to them on 3 April. The Kenyan runner had given a urine sample on 14 March which was found to contain a banned diuretic, the AIU said. The substance that Chepngetich tested positive for, hydrochlorothiazide (HCTZ), can be used to disguise the use of performance-enhancing drugs. HCTZ works by reducing the amount of water in the body by increasing the flow of urine Chepngetich opted for a \"voluntary provisional suspension\" on 19 April \"while the AIU's investigation was ongoing\", the unit said. She was interviewed in person in Kenya in April and \"complied with requests regarding our investigation\", AIU official Brett Clothier said in a statement. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Ukraine war latest: Ukraine appoints new government in biggest wartime overhaul\n                 \n                  Israel says it 'deeply regrets' deaths at Gaza's only Catholic church\n                 The AIU gave no timetable for a disciplinary case for the 30-year-old runner. Read more from Sky News:Financial impact of Musk's row with TrumpStarmer defends suspending rebel MPsBus crashes 'on way back from school trip' Chepngetich set the women's world marathon record by almost two minutes at the Chicago Marathon last October in 2 hours, 9 minutes, 56 seconds. It was her third win in Chicago. She also won the marathon at the 2019 world championships in Qatar, where the women's race started at midnight to avoid extreme daytime heat."
    },
    {
        "title": "Body found in search for British hiker Matthew Hall who went missing in Italy",
        "description": "The body of Matthew Hall, the British hiker who went missing in the Italian Alps, has been found according to local officials.",
        "url": "https://news.sky.com/story/body-found-in-search-for-british-hiker-matthew-hall-who-went-missing-in-italy-13398153",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-matthew-hall-missing-person_6965248.jpg?20250715110543",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-17 17:09:00",
        "Headline": "Matthew Hall, 33, from Hull, had not been seen since 8 July, after he left an Airbnb in Chiavenna, just north of Lake Como, in Lombardy, northern Italy, for a solo walk.",
        "Content": "The body of Matthew Hall, the British hiker who went missing in the Italian Alps, has been found according to local officials. Officials in the province of Sondrio confirmed to Sky News that search teams located the hiker between 100 and 150 metres down from a famous observation deck in Chiavenna valley. His body was found on Wednesday by local police and the fire department. Mr Hall, 33, from Hull, had not been seen since Tuesday 8 July, after he left an Airbnb in Chiavenna, just north of Lake Como, in Lombardy, northern Italy, for a solo walk. A missing persons appeal circulated by his friends and family on social media said he last contacted a friend at 1.20pm the day he went missing, sending a photo of himself on the walk. Mr Hall's mother Sara Foster, 62, flew out to Italy on Wednesday to help search for the 33-year-old. Speaking to Hull Live at the time, she said she had been overwhelmed by the support shown by Matthew's friends and colleagues. \n                  Felix Baumgartner: Extreme athlete who jumped from edge of space dies after paragliding crash\n                 \n                  British hiker missing for a week in Italian Alps\n                 \n                  Meredith Kercher's killer faces new trial over sexual assault allegations\n                 Read more from Sky News:Major incident declared after coach crashesStarmer defends suspending rebel MPs after criticism A spokesperson for the UK Foreign, Commonwealth and Development Office told Sky News earlier this week: \"We are supporting the family of a British man missing in Italy and are in contact with the local authorities.\""
    },
    {
        "title": "Trump hits out at 'weakling' supporters after criticism over Jeffrey Epstein files",
        "description": "Donald Trump has called his own supporters \"weaklings\" as he tries to subdue criticism of his administration's handling of records about the Jeffrey Epstein case.",
        "url": "https://news.sky.com/story/trump-hits-out-at-weakling-supporters-after-criticism-over-jeffrey-epstein-files-13397791",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-jeffrey-epstein_6176230.jpg?20230602155216",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-17 06:10:00",
        "Headline": "The president wrote on his social media site: \"Their new SCAM is what we will forever call the Jeffrey Epstein Hoax, and my PAST supporters have bought into this bull****, hook, line, and sinker.",
        "Content": " Donald Trump has called his own supporters \"weaklings\" as he tries to subdue criticism of his administration's handling of records about the Jeffrey Epstein case. The notorious financier was found dead in his cell in New York in August 2019, shortly after he was arrested on sex trafficking charges. Rumours have long circulated over who he may have supplied underage girls to, and who visited his private island. Mr Trump once fanned the flames of the conspiracy theorists, blaming the deep state for the cover-up of unreleased details, while FBI boss Kash Patel and his deputy also suggested the previous administration concealed information. The FBI and Justice Department last week said there was \"no incriminating client list\" or evidence he blackmailed influential people. They also confirmed prior findings that he killed himself and wasn't murdered, as some claim. They said no more files would be disclosed - despite previous promises by attorney general Pam Bondi that \"everything is going to come out to the public\". The U-turn by authorities has caused outrage among some Trump supporters, who have turned their ire on Ms Bondi in particular. Mr Trump hit out at the critics on Wednesday and claimed they were being duped by the Democrats. The president knew Jeffrey Epstein socially in the 1990s and 2000s, with one well-known video showing the pair talking at a party. In a post on Truth Social, Mr Trump wrote: \"Their new SCAM is what we will forever call the Jeffrey Epstein Hoax, and my PAST supporters have bought into this bull****, hook, line, and sinker. \"They haven't learned their lesson, and probably never will, even after being conned by the Lunatic Left for 8 long years.\" \"Let these weaklings continue forward and do the Democrats work,\" he added. \"Don't even think about talking of our incredible and unprecedented success, because I don't want their support anymore!\"  👉 Follow Trump100 on your podcast app 👈 He doubled down on his criticism later in the Oval Office, telling reporters it was a \"big hoax\" and that he had \"lost a lot of faith in certain people\". Mr Trump said Ms Bondi had already released all \"credible information\". \"If she finds anymore credible information she'll give that, too,\" he added. \"What more can she do than that?\" Read more from Sky News:Ghislaine Maxwell could challenge imprisonmentThe huge impact of Musk's row with Trump Far-right conspiracy theorist Alex Jones is among the influencers and podcasters who have criticised the president. Jones called the Epstein situation \"the biggest train wreck I've ever seen\". \"It's not in character for you to be acting like this,\" he said in a video this week. \"I support you, but we built the movement you rode in on. You're not the movement. You just surfed in on it.\" House Speaker Mike Johnson also told conservative podcaster Benny Johnson he wanted the Justice Department to \"put everything out there and let the people decide\". In a separate development, Maurene Comey, a prosecutor who worked on the Epstein case - as well as the Sean \"Diddy\" Combs trial - has reportedly been sacked. Associated Press said three people familiar with the matter had confirmed her dismissal. Ms Comey, daughter of former FBI chief James Comey, has not yet commented."
    },
    {
        "title": "Why is Trump fighting with MAGA over Epstein - and what has the president said about the paedophile?",
        "description": "Donald Trump is facing backlash from his own party and supporters over his attempts to move on from the Jeffrey Epstein case without releasing more information.",
        "url": "https://news.sky.com/story/why-is-trump-fighting-with-maga-over-epstein-and-what-has-the-president-said-about-the-paedophile-13397846",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-jeffrey-epstein_6967031.png?20250717140214",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-17 08:39:00",
        "Headline": "After years of promoting conspiracy theories around the death of Epstein and his crimes, the US president has done a U-turn on his administration's promises to release more information publicly - and not everyone in his MAGA movement is on board.",
        "Content": " Donald Trump is facing backlash from his own party and supporters over his attempts to move on from the Jeffrey Epstein case without releasing more information. The paedophile financier was found dead in his Manhattan cell in August 2019, shortly after he was arrested on sex trafficking charges. Rumours have long circulated over who he may have supplied underage girls to, and who visited his private island. Some of those rumours quickly spiralled into conspiracy theories, which Mr Trump fanned the flames of during his campaign for a second term. His Make America Great Again (MAGA) movement accused the Biden administration of suppressing the extent of Epstein's paedophilia, predatory behaviour and his so-called \"client list\" - thought to contain names of the rich and famous who conspired with him in a child sex trafficking operation. But the president has done a complete U-turn on his administration's promises to release more information publicly - and not everyone in his MAGA movement is on board.  Here's what you need to know about every aspect of the Trump-Epstein saga, from their past relations, to the president's dramatic shift on the case against him. \n                  Can Tesla survive without Trump?\n                 \n                  Police Scotland requests extra officers from across UK to support upcoming Donald Trump visit\n                 \n                  Trump hits out at 'weakling' supporters after criticism over Jeffrey Epstein files\n                 What was Trump and Epstein's relationship? Mr Trump was pictured with Epstein and his accomplice Ghislaine Maxwell on several occasions in the 1990s and early 2000s, but has played down his relationship with them in recent years, suggesting they simply moved in the same circles in Florida and New York. In 2019, after Epstein was arrested, Mr Trump told reporters he \"knew him like everybody in Palm Beach knew him\", but added: \"I had a falling out with him. I haven't spoken to him in 15 years. I was not a fan of his, that I can tell you.\" Asked why the pair fell out, Mr Trump said: \"The reason doesn't make any difference, frankly,\" and added that he had \"no idea\" Epstein had molested women. His comments about their relationship were in contrast to a 2002 interview with New York magazine, when Mr Trump was quoted saying: \"I've known Jeff for 15 years. Terrific guy. \"He's a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it - Jeffrey enjoys his social life.\"  👉 Follow Trump100 on your podcast app 👈 Flight logs released in the trial of Maxwell show Mr Trump flew on Epstein's private plane multiple times between 1993 and 1997. Mr Trump was named in previously released documents relating to Epstein and Maxwell. One Epstein accuser in 2016 said she spent several hours with the disgraced financier at a Trump casino but she did not say if she met Mr Trump and did not accuse him of any wrongdoing. Trump promotes conspiracy theory over Epstein's death On 10 August 2019, the day Epstein was found dead in his prison cell, Mr Trump retweeted an X post suggesting his death was linked to former President Bill Clinton. The former Democratic president flew on Epstein's jet 26 times between 2001 and 2003 and his name features in the released documents about his crimes, but he has denied any wrongdoing. In the summer of 2020, a month after Maxwell was charged with luring teenage girls to be sexually abused by Epstein, Mr Trump controversially wished her well in an interview. Asked why he did so in an interview with Axios, he responded: \"Well, her boyfriend died in jail and people are still trying to figure out how did it happen? Was it suicide? Was he killed? And I do wish her well. I'm not looking for anything bad for her. I'm not looking bad for anybody.\" Trump says he would declassify Epstein files if elected Some 60 of 250 previously sealed documents relating to Ghislaine Maxwell, her relationship with Jeffrey Epstein and alleged victims of sexual were released by a US court in January last year. They named the likes of Mr Trump, Mr Clinton, Prince Andrew and Stephen Hawking as associates, but none have been found of any wrongdoing.  Much of the MAGA movement demanded more files be released, including Epstein's alleged client list, as they believed the extent of his crimes and those he conspired with were being supressed by the Biden administration. In June 2024, Mr Trump was asked during a Fox interview whether he would declassify the files if elected in November. He replied: \"Yeah, yeah, I would. I guess I would. I think that less so, because you don't know - You don't want to effect people's lives if there's phony stuff in there, because there's a lot of phony stuff in that whole world.\" Read more:Ghislaine Maxwell could challenge imprisonmentThe huge impact of Musk's row with Trump Asked again during a podcast with Lex Fridman in September 2024, Trump said he would \"have no problem with it.\" The following month, JD Vance said on a podcast with Theo Von: \"Seriously, we need to release the Epstein list.\" Trump's allies take promises even further The president's controversial picks to lead the FBI - director Kash Patel and deputy director Dan Bongino - were commentators in his MAGA movement before joining federal law enforcement. During that time, they aggressively promoted theories that Epstein was killed to keep him quiet and that global elites were preventing the list of clients from being released.  Conspiracies on the right were further stoked after Mr Trump was elected, when his Attorney General Pam Bondi told Fox News that the alleged Epstein client list was \"sitting on my desk right now to review\" in February. She then released what she called the \"first phase\" of files relating to Epstein, which mainly contained flight logs that had already been leaked to the public but had not been officially released by the government. The justice department said it had around 200 documents relating to Epstein and that the FBI had thousands more. Ms Bondi later claimed the Biden administration \"sat on these documents\" and didn't do \"anything with them\" as they \"don't believe in transparency\". Even as late as June, Mr Patel promised in an interview that more evidence would be released to the public. Outrage among Conservatives as evidence kept sealed Many in the MAGA movement were enraged when the Justice Department released a memo on 8 July saying that there was no Epstein client list, and that no \"further disclosure would be appropriate or warranted\". It claimed much of the material was placed under seal by a court to protect victims and \"only a fraction\" of it \"would have been aired publicly had Epstein gone to trial\". It said it contained images of Epstein, \"images and videos of victims who are either minors or appear to be minors,\" and more than 10,000 \"downloaded videos and images of illegal child sex abuse material and other pornography\". Trump turns on those calling for Epstein files to be released Mr Trump has started lashing out at supporters who are continuing to call for the files to be released. Shortly after the Justice Department's memo, he shut down a reporter's question about Epstein, saying: \"Are you still talking about Jeffrey Epstein? This guy's been talked about for years. \"Are people still talking about this guy, this creep?\"  In a post on Truth Social on Wednesday, the president wrote: \"Their new SCAM is what we will forever call the Jeffrey Epstein Hoax, and my PAST supporters have bought into this bull****, hook, line, and sinker. \"They haven't learned their lesson, and probably never will, even after being conned by the Lunatic Left for 8 long years. \"Let these weaklings continue forward and do the Democrats work,\" he said, adding he didn't want their support anymore. In an interview later, he said he couldn't understand \"what the interest or what the fascination is\" with Epstein and called the case \"boring\". He doubled down on his criticism later in the Oval Office, telling reporters it was a \"big hoax\" and that he had \"lost a lot of faith in certain people\". He said Ms Bondi had already released all \"credible information\". \"If she finds anymore credible information she'll give that, too,\" he added. \"What more can she do than that?\""
    },
    {
        "title": "California: 21 children taken into custody - amid claims couple misled surrogate mothers across the US",
        "description": "Police have taken 21 children into custody, amid allegations that a couple in Los Angeles may have misled surrogate mothers across the US.",
        "url": "https://news.sky.com/story/california-21-children-taken-into-custody-amid-claims-couple-misled-surrogate-mothers-across-the-us-13397757",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-silvia-zhang-la-guojun-xuan_6966637.jpg?20250717041908",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-17 01:51:00",
        "Headline": "Police said they are investigating whether the children were part of a surrogacy scam, with CCTV footage appearing to show they had been abused.",
        "Content": "Police have taken 21 children into custody, amid allegations that a couple in Los Angeles may have misled surrogate mothers across the US. Silvia Zhang, 38, and Guojun Xuan, 65, are believed to be the legal parents of the children, who are aged between two months and 13 years old. \"We believe one or two were born biologically to the mother,\" Lieutenant Kollin Cieadlo said. \"There are some surrogates who have come forward and said they were surrogates for the children.\" \"The couple told police that they wanted a large family,\" he added. Fifteen children were removed from the couple's home in Arcadia, about 13 miles northeast of downtown Los Angeles, after an abuse allegation was made. Another six living in the care of family and friends were also located. The couple were arrested in May after a hospital reported that their two-month-old infant had a traumatic head injury - with a nanny accused of violently shaking the baby. The infant was not taken to hospital until two days later, after they began suffering seizures. \n                  Did Melania convince Trump to back Ukraine?\n                 \n                  Q&A: Should there be an age limit on the presidency?\n                 \n                  Why has Trump U-turned over Ukraine?\n                 CCTV footage recorded inside the home showed the children being emotionally and physically abused by at least six nannies. Lt Cieadlo said Zhang had produced what appeared to be legitimate birth certificates, including some from outside California, that list her as the mother of the children. Business records show a company called Mark Surrogacy Investment LLC was previously registered at the couple's address, although the most recent documents show the business licence ended in June. Read more from Sky News:The cost of Musk's fallout with TrumpBlaze destroys main stage at festivalBabies born with DNA from three people Police said they are investigating whether the children found at the home in the San Gabriel Valley were part of a surrogacy scam. Lt Cieadlo also confirmed officers were working with the FBI as part of their investigation. Kayla Elliott, one of the surrogate mothers who has come forward, told Sky's US partner NBC News: \"I was a bit hysterical. You just don't expect that you're going to go through a pregnancy and a delivery and then hand the baby over to their parents and then all of a sudden find out that there was abuse and neglect going on.\" Arrest warrants were issued for Zhang, Xuan and the 56-year-old nanny, who was not in custody on Wednesday. Zhang and Xuan were detained on suspicion of child endangerment/neglect. The Los Angeles County Department of Children and Family Services, which removed the couple's children, declined to comment on the case."
    },
    {
        "title": "Can Tesla survive without Trump?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉&#8239;Listen to Sky News&#8239;Daily&#8239;on your podcast app&#8239;👈</a>&#8239;&#8239;  ",
        "url": "https://news.sky.com/story/can-tesla-survive-without-trump-13398060",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-daily-170725-musk-trump_6967115.png?20250717155508",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-17 14:51:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈     Elon Musk's Tesla faces the loss of billions of dollars in government subsidies, following his fallout with Donald Trump. This is after the US president cut state support for green industries. Subsidies have been central to Tesla's success from upstart manufacturer to one of the world's largest electric vehicle makers in less than 20 years. But now the president's cuts could leave a significant gap in its future earnings. Sky's business correspondent Paul Kelso and Kate Schneider from our Data and Forensics unit have been looking into the Tesla business to figure out how it makes money. Producer: Soila Apparicio"
    },
    {
        "title": "Accountants were paid to place clients into loan charge schemes targeted by HMRC",
        "description": "Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.&#160;",
        "url": "https://news.sky.com/story/accountants-were-paid-to-place-clients-into-loan-charge-schemes-targeted-by-hmrc-13398170",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-loan-charge-parliament_6461449.jpg?20240219171514",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-17 23:01:00",
        "Headline": "The loan charge scandal has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Victims of the loan charge received advice from professional accountants who were being paid to place them into tax avoidance schemes.  Sky News has seen evidence of chartered accountants advising their clients to enter loan arrangements, run by companies that were paying them a commission. These schemes were later targeted by HMRC, and workers were hit with giant tax bills, sometimes hundreds of thousands of pounds. Money blog: Value of a million homes rose 50% since COVID In some cases, the tax demands have been crippling. It's a campaign that has driven people to the brink of bankruptcy, devastated families and has been linked to 10 suicides. MPs are now calling for a public investigation into the role of accountants and other professional bodies in the proliferation of these schemes. An independent review of the loan charge is currently under way, but it is limited in its scope. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Value of one million homes has risen by 50% since COVID - especially in two areas\n                 \n                  Jobless rate hits four-year high - but makes interest rate cut more likely\n                 What is the loan charge scandal? It is the latest revelation in a scandal that has caused untold misery for tens of thousands of people, who were enrolled into tax avoidance schemes, often against their knowledge. They included contractors who were urged to avoid setting up limited companies and to instead receive payment through the schemes, which were meant to handle their pay and taxes.  They worked by paying workers what were technically loans, instead of a salary. This allowed them to circumvent paying income tax. What many assumed were tax deductions on their payslips were, in fact, fees going towards the promoters of the schemes. Tax avoidance is not illegal, but HMRC has successfully challenged tax avoidance schemes in the courts, and workers have subsequently been asked to pay the missing tax. There is no suggestion that these accountants broke the law. Richard's story For Richard Clancey, HMRC's handling of the loan charge feels like \"state-sponsored bullying\". After being offered a contract role in 2010, Mr Clancey, now a retired computer services professional, contacted a chartered accountant in Kent to help him set up a limited company. The accountant encouraged him to enrol in a payment scheme instead. \"He gave us an hour's presentation on the benefits of the scheme and how it worked,\" Mr Clancey said. \"This included how they would handle all administration, pay all tax that was due, was IR35 and tax law compliant, had a lower risk than using a limited company, had been approved by a tax QC and was currently used by several people who were working for HMRC. \"The presentation was very elaborate and complicated and I cannot claim that I understood it all, but I wanted to ensure I was legal and compliant, so I trusted the advice of a chartered accountant that use of this scheme was the right thing to do.\" Read more:Rise in suicide attempts linked to HMRC crackdownHMRC accused of 'dangerous' new tactics in tax crackdown The accountant told him that he was receiving an introductory fee, but not that he would receive ongoing payment. In 2014, Mr Clancey received an email from his accountant outlining that the previous year he had received £257 in commission. However, he did not receive statements for the previous two years. \"Although you were notified of this commission before, we are also required to declare the amount of commission to you according to the guidance of the Institute of Chartered Accountants of England and Wales,\" the email read. \"This commission has not cost you anything,\" it added. The company's former website page clearly stated that it offered accountants commission, boasting that the rates had been raised. At this point, Mr Clancey was already on the radar of HMRC. In 2012, tax authorities wrote to him to explain that he had been in a tax avoidance scheme that \"HMRC believes does not work\". He was subsequently asked to pay more than £100,000. \"Over the next seven years, I received multiple penalties and threats from HMRC who said I had been a tax avoider who should settle their debts now or face worse consequences later,\" he said. \"There hasn't been a single day when I haven't been consumed by the frustration and anger of my situation and how it arose... Since my involvement with [the scheme] and the subsequent hounding from HMRC and government, a lot of that has changed. This state-sponsored bullying has caused me to suffer some mental health issues. \"My personal stress levels were through the roof. I dreaded the next brown envelope coming through the post box with outrageous, unsubstantiated demands. My poor wife would apologise and burst into tears as she brought these to me.\" HMRC said it takes the wellbeing of all taxpayers seriously. \"We are committed to identifying and supporting customers who need extra help with their tax affairs and have made significant improvements to this service over the last few years.\" Like others in his position, Mr Clancey is frustrated by the blunt approach of the tax authority and the lack of accountability from other parties. \"I have been increasingly concerned that my chartered accountant led me into the hands of a scam organisation,\" he said. \"HMRC continues to persecute victims.\" Government reaction The government has now launched an independent review into the loan charge, and HMRC is pausing its activity until that review is complete - but its focus is on helping people to reach a settlement. The review will not look at the historical role of accountants, promoters and recruitment agencies, even though they propped up the schemes. Politicians and campaigners have called for a broader investigation. Greg Smith, MP and co-chair of the Loan Charge and Taxpayer Fairness APPG, said: \"It's clear that many chartered accountants were directly involved in the promotion of loan schemes. \"People trusted accountants and had the right to rely on this advice, and yet, instead, are facing life-ruining bills. There needs to be a proper investigation into this as part of an independent inquiry into the loan charge scandal,\" he said. \"Either HMRC warned accountants not to recommend these schemes, in which case the accountants were giving reckless and potentially fraudulent advice; or HMRC didn't tell accountants not to do this, in which case HMRC themselves were seriously at fault. \"Either way, it is quite wrong that the current government continues to only pursue those who took and followed professional advice and not those who gave it, whilst profiting from doing so.\" The experience has damaged Mr Clancey's faith in the sector. \"I will never again trust professional financial advice,\" he said. \"If the advice of a chartered accountant can cause this much damage without culpability, then there is something very wrong. It is a failure on the part of the entire tax industry that accredited professionals can, through their advice, destroy the lives of the individuals that they advise.\" A spokesperson for the Institute of Chartered Accountants in England and Wales, an industry body, said: \"We expect chartered accountants to adhere to the highest standards in all of their work, including tax. \"Robust rules for members performing tax work are contained in standards which have been developed and strengthened to prevent the involvement of members in aggressive tax avoidance.\" The organisation strengthened its standards in 2017, after the loan charge legislation was announced, adding that \"members must not create, encourage or promote tax planning arrangements or structures that set out to achieve results that are contrary to the clear intention of parliament in enacting relevant legislation and/or are highly artificial or highly contrived and seek to exploit shortcomings within the relevant legislation\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK.  In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Jobless rate hits four-year high - but makes interest rate cut more likely",
        "description": "The UK's unemployment rate has risen to a four-year high, in a surprise deterioration that boosts the case for a Bank of England interest rate cut.",
        "url": "https://news.sky.com/story/weaker-jobs-market-makes-interest-rate-cut-more-likely-13397766",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-jobcentre-job-centre_6757997.jpg?20241125213751",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-17 04:29:00",
        "Headline": "While rate cut expectations for 7 August have risen due to the weakening labour market, the data intensifies the focus on the chancellor's stewardship of the economy.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's unemployment rate has risen to a four-year high, in a surprise deterioration that boosts the case for a Bank of England interest rate cut. The Office for National Statistics (ONS) reported a rise in the jobless rate from 4.6% to 4.7% in the three months to May. No change had been expected after the 0.1 percentage point rise seen just last month. The ONS data, which still comes with a health warning due to poor participation rates, also showed a reduction in the pace of wage rises, with average weekly earnings rising by 5%. That was down from the 5.2% level reported a month ago. Money latest: The rising cost of airport drop-off fees ONS director of economic statistics, Liz McKeown, said of its findings: \"The labour market continues to weaken, with the number of employees on payroll falling again, though revised tax data shows the decline in recent months is less pronounced than previously estimated. \"Pay growth fell again in both cash and real terms, but both measures remain relatively strong by historic standards. \n                  Accountants were paid to place clients into loan charge schemes targeted by HMRC\n                 \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Value of one million homes has risen by 50% since COVID - especially in two areas\n                 \"The number of job vacancies is still falling and has now been dropping continuously for three years.\" The data was released 24 hours after a surprise rise in the rate of inflation, to 3.6%, was revealed by the ONS. It was seen as muddying the waters as the Bank considers the timing of its next interest rate cut. But a quarter point reduction, to 4%, is widely expected at the next meeting of the rate-setting committee in early August, The Bank, experts say, will be looking past the headline inflation numbers and see scope to introduce the third cut of the year due to the softening labour market seen in 2025 - a factor the Bank's governor Andrew Bailey had suggested would come more into focus in a recent interview with The Times.  Weaker pay awards remain a compulsory element to bringing down borrowing costs as there are fears the UK's difficulties in bringing down inflation are partly linked to wage growth outpacing price hikes since August 2023. Add to that the slowdown in economic growth and you have a Bank seemingly grappling the effects of so-called stagflation - as scenario of weak growth with inflation persistently well above the Bank's 2% target. While there are conflicting forces at play for the Bank's interest rate deliberations, rising inflation, coupled with weakening growth and jobs data, are all unwelcome for a chancellor under growing pressure. Rachel Reeves was accused on Wednesday of contributing to inflation through taxes on employment deployed from April - with industry bodies in the grocery sector claiming an element of rising food price growth was down to businesses passing on those extra costs, alongside hikes to minimum pay requirements. At the same time, those budget measures have clearly held back hiring since the spring. Frasers Group, the retail firm best-known for its Sports Direct brand, said alongside its results today that it was grappling £50m in budget-linked costs and turning to AI in a bid for \"efficiencies\" to offset some of that bill. One crumb of comfort for Ms Reeves is that the prospect of a rate cut next month remains on - with any reduction helping bring down the cost of servicing government debt as the headroom she has within the public finances remains under severe pressure. Government U-turns on winter fuel payment curbs and welfare reforms have squeezed her fiscal rules, leaving her to cover likely at the autumn budget to cover shortfalls either through further tax hikes or spending cuts. Yael Selfin, chief economist at KPMG UK, said of the rate cut prospects: \"Slowing activity in the labour market, coupled with pay pressures easing, will likely prompt the Bank of England to lower interest rates next month. \"The impact of April's tax and administrative changes has led to a marked slowdown in hiring activity among firms. With domestic activity remaining sluggish, the MPC will likely want to provide support via looser policy to prevent a more significant deterioration in the labour market.\""
    },
    {
        "title": "Bridgepoint close to filling portfolio with £750m dentistry group",
        "description": "One of the London stock market's best-known private equity firms is close to snapping up MyDentist, the UK's biggest provider of NHS dental services.",
        "url": "https://news.sky.com/story/bridgepoint-close-to-filling-portfolio-with-163750m-dentistry-group-13397653",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-dentist-dentistry_6811120.jpg?20250126133438",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-17 20:00:00",
        "Headline": "A deal that would see the former owner of Oasis return to the industry buy acquiring MyDentist could be signed and announced as early as Friday morning, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the London stock market's best-known private equity firms is close to snapping up MyDentist, the UK's biggest provider of NHS dental services. Sky News has learnt that Bridgepoint, which owns companies such as Itsu, the Japanese fast-food chain, was on Thursday night close to signing a definitive deal to acquire the business for an enterprise value of between £750m and £800m. Money blog: Value of a million homes rose 50% since COVID If confirmed, it could be announced as soon as Friday morning, according to industry insiders. A subsidiary of Integrated Dental Holdings, MyDentist operates from about 600 practices across the UK, and has been owned by Palamon Capital Partners since 2021. One source said the deal with Bridgepoint was expected to generate a threefold return to Palamon. The company was previously owned by Carlyle, another major global private equity investor. \n                  Accountants were paid to place clients into loan charge schemes targeted by HMRC\n                 \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Value of one million homes has risen by 50% since COVID - especially in two areas\n                 The auction of MyDentist, which has been handled by bankers at Morgan Stanley, has taken place during a renewed period of scrutiny about the accessibility of NHS dental services across Britain. Bridgepoint is already an experienced investor in the sector, having bought Oasis, a dental care provider, for £185m before selling it for more than £800m in 2016. A number of smaller rivals to MyDentist are preparing to change hands in the coming months. Bridgepoint, which has previously explored a takeover of MyDentist, declined to comment, while Palamon could not be contacted for comment. "
    },
    {
        "title": "Black Tap's Stephen Parker says celebrity chefs are worst thing to happen to food industry and reveals key to great burgers",
        "description": "Every week, we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. This week, we speak to Stephen Parker, corporate executive chef at Black Tap Craft Burgers & Beers...",
        "url": "https://news.sky.com/story/black-taps-stephen-parker-says-celebrity-chefs-are-worst-thing-to-happen-to-food-industry-and-reveals-key-to-great-burgers-13397927",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cheap-eats-money-stephen-parker_6966787.jpg?20250717092622",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-17 10:43:00",
        "Headline": "The Sky News Money blog team interviews chefs every week for its regular Cheap Eats feature. Today, Stephen Parker shares his views on celebrity chefs and his favourite ketchup - while also sharing a cheap recipe for a healthier alternative to chips.",
        "Content": "Every week, we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. This week, we speak to Stephen Parker, corporate executive chef at Black Tap Craft Burgers & Beers... The worst thing ever to happen to the food industry is… the celebrity chef culture that has exploded over the past few decades, thanks to the likes of channels such as The Food Network. Cooking shows have shifted their focus from skilled cooking to personality, making many chefs entertainers rather than craftsmen. Real kitchens are much grittier and less glamorous than the ones seen on TV - creating a style-over-substance idea that really doesn't exist in the real world. One cheap place I love to eat in the UK is... in London's Borough Market. I had the most incredible risotto from the Wild Mushroom Risotto stand. The creamy risotto was topped with garlic and truffle oil, fried leeks, spring pesto and parmesan… I can't stop thinking about it! I loved how even though this was a simple dish, it packed in so much flavour and was made super-fast using fresh ingredients. Money blog: Get the latest consumer news The key to a great burger is… the fat content and quality of the meat, which plays into how great the burger is after cooking. The meat needs to have enough fat to achieve a great sear on the outside, while the cut of beef is important to ensure that the juicy burger is full of extra flavour. My favourite ketchup has to be... Heinz baby - all day. Are there even any other options? The one thing I hate that some customers do is… order their burgers well done. In my opinion it's overcooked and doesn't give you the same culinary experience as eating a burger cooked to medium. At Black Tap, we pride ourselves on serving fat, juicy burgers that aren't overcooked. Food influencers are... constantly changing the game when it comes to the hospitality industry. They are great for helping to inspire chefs and restaurants alike to be on top of our game. Not only do they push businesses to be even bigger and better, but encourage restaurants to continue pushing boundaries when it comes to flavour combinations and food and drink trends. The idea that Michelin food is the tastiest you can get is false... Night markets, street food and real family-owned restaurants are leading the way when it comes to flavours and innovation. Chefs at establishments like these pour their hearts and souls into the food they're creating as they have such a passion for it. In my opinion, the tastiest meals I've ever had are connected to the memories that go along with them and how I was feeling at that moment in time. The best city in the world to eat in is... Singapore. Not only is it a multicultural hub, but it's also where my wife is from. We take a lot of inspiration from Singaporean dishes when cooking at home. Some of my favourites include Hainanese chicken rice, fried carrot cake (super delicious) and chilli crab. Read more of this feature:Top chef's favourite restaurant chain'Sirloin? No. Buy this cheaper cut instead''Overrated trend is invading menus' Here's a cheap recipe for my teriyaki broccoli... Ditch the chips and switch for a tasty, tangy teriyaki broccoli side dish. It's perfect for those looking to be a little more health-conscious while still being able to enjoy their favourite dishes. Ingredients:  Method:"
    },
    {
        "title": "Jaguar Land Rover to cut hundreds of UK jobs",
        "description": "Jaguar Land Rover (JLR) has revealed plans to cut 500 jobs as it tries to save costs while battling a sharp decline in sales. ",
        "url": "https://news.sky.com/story/jaguar-land-rover-to-cut-hundreds-of-uk-jobs-13397818",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-jlr-range-rover_6581369.jpg?20240614132452",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-17 07:28:00",
        "Headline": "The company has been grappling the impact of trade tariff uncertainty and had said that the UK-US truce would help shield its workforce from the prospect of job losses.",
        "Content": "Jaguar Land Rover (JLR) has revealed plans to cut 500 jobs as it tries to save costs while battling a sharp decline in sales.  The UK-based firm said the reduction in management roles, which amounted to 1.5% of its workforce, would be completed through a voluntary redundancy programme. JLR has been struggling recently off the back of the US trade war. Money latest: The rising cost of airport drop-off fees It temporarily paused exports to the US, its biggest single foreign market, in April after Donald Trump's hike to duties covering cars to 25%. It was later trimmed to 10% under the US-UK trade truce agreement, but that rate only covers the cars it makes in the UK. The terms of the deal also cap total annual car exports to the US at 100,000 models, with the higher rate applying to any vehicles over the threshold. The tariff uncertainty, coupled with a planned wind-down of older Jaguar models, meant sales were 15% down over the three months to June to just over 94,000. JLR confirmed its job cut plans on the day the UK's jobless rate hit a four-year high. It also follows Sir Keir Starmer speaking to JLR staff and promising to protect their jobs back in April. The company had said, after the US-UK truce in May, that the deal would do just that. A spokesperson said: \"As part of normal business practice, we regularly offer eligible employees the opportunity to leave JLR through limited voluntary redundancy programmes.\""
    },
    {
        "title": "More than half of UK airports have hiked 'kiss and fly' drop-off fees - here's the full list",
        "description": "More than half of UK airports have introduced or increased their drop-off fees in the past year, RAC research has found.",
        "url": "https://news.sky.com/story/more-than-half-of-uk-airports-have-hiked-kiss-and-fly-drop-off-fees-heres-the-full-list-13397812",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-airport-drop-off-fees_6966755.jpg?20250717084227",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-17 07:03:00",
        "Headline": "Eleven major airports have increased their so-called \"kiss and fly\" charges - fees drivers pay when dropping off a passenger as close to the terminal as possible.",
        "Content": "More than half of UK airports have introduced or increased their drop-off fees in the past year, RAC research has found. Eleven out of 20 major airports analysed were found to have increased their so-called \"kiss and fly\" charges. These are fees drivers have to pay when dropping off a passenger as close to the terminal as possible. Nine airports - Belfast City, Birmingham, Bristol, Edinburgh, Gatwick, Heathrow, Liverpool John Lennon, Newcastle and Southampton - have raised their fees by £1. Money latest: 'Celebrity chefs are the worst thing to happen to the food industry'  Leeds Bradford and Glasgow both added 50p to their charges. Cardiff, which previously had no charge, introduced a £3 fee, while Luton now charges £5. \n                  Ranked: Britain's 10 worst airports for flight delays\n                 \n                  British passports have just got more expensive - here's who can get an Irish one\n                 \n                  Tolls on Blackwall Tunnel and new Silvertown Tunnel begin - what you need to know\n                 Here's a breakdown of what you have to pay to drop someone off at each airport: The RAC found there is no fee for dropping off at eight of the 10 busiest EU airports, such as Paris Charles de Gaulle, and airports in Frankfurt and Madrid. London City is now the only top 20 UK airport that still offers drivers a free drop-off close to the terminal. RAC senior policy officer Rod Dennis said this makes increases in fees at UK airports \"all the more depressing\". \"The sky really does seem to be the limit when it comes to the amount drivers get charged for making the briefest of stops to let friends or loved ones out to catch a flight,\" he said. \"The seemingly annual ritual of many airports hiking the cost of drop-offs is unfortunately continuing unabated. \"Airports understandably need to manage the often-limited on-site space they have. We also know some still offer short stay free parking, but the problem is it's often well away from the terminal. \"If a driver wants to help a passenger with mobility issues or a lot of bags get to the terminal, they'll often end up overstaying the 'free' period offered and getting charged. \"The main reason drivers drop off at airports, according to our research, is to help people with bulky and often heavy luggage. This is understandable when the alternative to the car is often either a conventional bus, which can be impractical with lots of cases, or a costly taxi - with fares for the latter subject to the same drop-off fees that drivers need to pay.\" Karen Dee, chief executive of Airports UK, the industry body representing British airports, said: \"All airports offer a free drop-off facility. They also have a wide variety of options to suit all passengers' needs, including premium drop-off in front of the terminal building for those who wish to use that. \"Where fees are charged, this helps airports manage and reduce congestion, noise, carbon emissions and air pollution for local communities, something that they are mandated to do by the government and local authorities. \"These charges are a part of the airport business model and help enable the provision of the widest variety of flights from the airport.\""
    },
    {
        "title": "Spies and special forces among more than 100 Britons whose details were included in Afghan data leak",
        "description": "Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK. ",
        "url": "https://news.sky.com/story/spies-and-special-forces-among-more-than-100-britons-whose-details-were-included-in-afghan-data-leak-13398068",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-afghanistan-armed-forces_6967165.jpg?20250717163448",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-17 15:07:00",
        "Headline": "On Tuesday, it emerged that the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022.",
        "Content": " Details of spies and special forces were included in a massive data leak that led to thousands of Afghans being secretly relocated to the UK.  Information about more than 100 Britons was contained in the breach. Defence sources have said that details of MI6 spies, SAS and special forces personnel were included in the spreadsheet, after they had backed Afghans who had applied to be brought to the UK. It comes after the personal information of nearly 19,000 people who applied for the Afghan Relocations and Assistance Policy (Arap), was released \"in error\" in February 2022 by a defence official. The Ministry of Defence (MoD) became aware of the breach in August 2023, when excerpts from a spreadsheet containing personal information were anonymously posted on a Facebook group. Read more:Afghan data breach timeline: The fallout behind the scenesWhy the Afghan data breach scandal has erupted now  After a super-injunction - imposed in September 2023 that blocked coverage of the leak - was lifted on Tuesday, Defence Secretary John Healey offered a \"sincere apology\" on behalf of the government. \n                  'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach\n                 \n                  Afghan data breach timeline: The fallout behind the scenes\n                 \n                  Starmer says former Tory ministers have 'serious questions to answer' over Afghan data breach\n                 \"This was a serious departmental error,\" he added. Shadow defence secretary James Cartlidge also apologised on behalf of the former Conservative government, which launched a secret scheme to relocate Afghan nationals impacted by the breach.  Some 6,900 Afghans - comprising 1,500 people named on the list as well as their dependents - are being relocated to the UK as part of this programme, atop the thousands moved under the Arap. The MoD said the relocation costs alone, directly linked to the data breach, will be around £850m. Between 80,000 and 100,000 people were affected. Judges said in June last year that they could be at risk of harassment, torture or death if the Taliban obtained their information. Read more from Sky News:The huge financial blow of Musk's row with TrumpThunderstorm warning issued - but temperatures to remain high  The super-injunction was lifted on Tuesday after an internal review concluded it \"appears unlikely that merely being on the dataset would be grounds for targeting\". However, an Afghan interpreter who worked with the British military told Sky News he feels \"betrayed by the British government\" and is afraid the Taliban will target him and his family.  The law firm Barings Law said on Tuesday it is working around 1,000 of those impacted \"to pursue potential legal action\". It comes as Parliament's Intelligence and Security Committee (ISC) requested that a number of documents used in the super-injunction proceedings be provided to it \"immediately\". A MoD spokesperson said: \"It's longstanding policy of successive governments to not comment on Special Forces. \"We take the security of our personnel very seriously and personnel, particularly those in sensitive positions, always have appropriate measures in place to protect their security.\""
    },
    {
        "title": "Sixteen and 17-year-olds will be able to vote in next general election",
        "description": "Sixteen and 17 year olds will be able to vote in all UK elections in the biggest reform to the electoral system since 1969.",
        "url": "https://news.sky.com/story/16-and-17-year-olds-will-be-able-to-vote-in-next-general-election-13397859",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rickmansworth-polling_6902339.jpg?20250501081357",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-17 09:05:00",
        "Headline": "Up to 9.5 million more people will be able to vote by lowering the age.",
        "Content": " Sixteen and 17 year olds will be able to vote in all UK elections in the biggest reform to the electoral system since 1969. The government said it will give young people the right to vote in the next general election, something Labour promised in its manifesto last summer. They can already vote in Senedd elections in Wales and Holyrood elections in Scotland, but this will mean all 16 and 17 year olds across all four UK nations can vote in local, regional and general elections. Politics latest: Starmer facing criticism for suspending rebel MPs Up to 9.5 million more people will now be able to vote, the IPPR thinktank said. The latest figures show 48,208,507 people are registered to vote. The last time the voting age was changed was in 1969 when it was reduced from 21 to 18. The government has said the change will \"boost democratic engagement in a changing world, and help to restore trust in UK democracy\". \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  Voter ID won't be scrapped, minister says\n                 \n                  Five reasons to be confused by Starmer's MP suspensions\n                 Deputy Prime Minister Angela Rayner said: \"For too long public trust in our democracy has been damaged and faith in our institutions has been allowed to decline.        \"We are taking action to break down barriers to participation that will ensure more people have the opportunity to engage in UK democracy, supporting our Plan for Change, and delivering on our manifesto commitment to give 16 year olds the right to vote.    \"We cannot take our democracy for granted, and by protecting our elections from abuse and boosting participation we will strengthen the foundations of our society for the future.\" Majority of Britons do not want to give young people a vote A YouGov poll of 5,538 adults held in the hours after Thursday's announcement found 57% of Britons think 16 and 17 year olds should not be allowed to vote, while a third (32%) say they should. Anthony Wells, head of European political and social research at YouGov, said due to \"raw numbers\", 16 and 17 year olds \"probably won't have much impact\" as they only make up about 2.8% of the 16+ population. If their turnout rate is similar to other young people, they will also be a \"substantially lower proportion of the actual electorate\", he added. They tend to vote more heavily for Labour and the Greens - less for the Tories - however, he added this could change if Labour is unpopular by the next election. No consultation Conservative shadow communities minister Paul Holmes accused Labour of having \"rushed\" the announcement out \"in an attempt to avoid parliamentary scrutiny and without consultation\", calling it a \"confusing message to young people\". He said it is a \"brazen attempt\" by a party whose \"unpopularity is scaring them into making major constitutional changes without consultation\". The Tory added: \"16-year-olds will be able to vote in an election but not stand as candidates, and they will be able to vote but not permitted to buy a lottery ticket, consume alcohol, marry, or go to war. \"This is a hopelessly confusing policy from Labour, who appear uncertain themselves about what they want young people to be allowed to do.\" Read more:Voter ID won't be scrapped, minister saysNew rules may stop Elon Musk making unlimited donations to Reform Half of the public were opposed to giving 16 and 17 year olds the vote when Labour suggested it ahead of last year's election, polling by More in Common found in May 2024. A total of 47% of those polled of all ages were opposed, while 28% supported the change. The older people were, the more opposed they were, with just 10% of 75-year-olds and over strongly or 'somewhat' supportive. Gen Z (aged 18-26) were the most supportive, with 49% strongly or somewhat supportive. But the polling showed people were sceptical about Labour's motivations for lowering the voting age, with the majority of voters from all parties thinking Labour was doing it to benefit them in elections. The polling also found most people, including Gen Z, did not feel mature enough to be able to vote until they were 18. Bank cards allowed as voter ID As part of the strategy, voter ID will also be extended to include UK-issued bank cards. Mr Holmes raised concerns using bank cards for ID will \"undermine the security of the ballot box\". When other IDs that are already accepted, such as the veteran card and UK driving licences, become digitised, they will also be accepted in that form. A digital Voter Authority Certificate will also be created to ensure electoral registration officers, who maintain registers of electors and absent voters, will be able to accept digital forms of ID. Close loopholes for foreign donors In an effort to boost transparency and accountability in politics, the government said it will close loopholes allowing foreign donors via \"shell companies\" to influence UK political parties. New requirements will be introduced so unincorporated associations will have to carry out checks on donations over £500 to tackle foreign interference. The Electoral Commission will also be given new powers to enforce heavier fines of up to £500,000 on those who breach political finance rules, and enable tougher sentences for those who abuse election campaigners."
    },
    {
        "title": "Will extending the vote to 16-year-olds benefit Labour at the next general election? ",
        "description": "Breaking down barriers to democratic participation, or electioneering that tilts the scales in the government's favour? ",
        "url": "https://news.sky.com/story/will-extending-the-vote-to-16-year-olds-benefit-labour-at-the-next-general-election-13398106",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-school_6935034.jpg?20250605125417",
        "type": "Politics",
        "Author": "Daniel Dunford",
        "Date Published": "2025-07-17 15:51:00",
        "Headline": "Labour have said they will extend the right to vote to 16-year-olds in time for the next general election. Sky's Data and Forensics unit assesses whether it will help them at the ballot box, and how much it might harm the ambitions of Nigel Farage.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n Breaking down barriers to democratic participation, or electioneering that tilts the scales in the government's favour?  Labour have announced plans to extend the vote to 16 and 17-year-olds in time for the next general election. The Greens, the Lib Dems and the SNP are in favour, but the Conservatives and Reform UK are not. If you look at the latest polling, and indeed historical polling, you might be able to work out why. A ballot of more than 22,000 under-18s, carried out prior to the 2024 general election, had the Greens in second place with the Conservatives in fifth. In the real election, the Conservatives ended up in second place, recording a vote share 15 points higher among the general population than they received among those not old enough to vote. The Greens, in contrast, ended up in fifth, with a vote share more than 20 points lower than that recorded in the youth poll. A year is a long time in politics, and Labour have slipped in popularity since that vote, while Reform have surged to a lead in recent polling. But not so among the youngest age group of currently eligible voters. Labour still lead with 18-24-year-olds, while Reform sit in fifth, according to the latest YouGov poll carried out for Sky News. Sky News election analyst Professor Will Jennings says there is no reason to expect that voting behaviour among 16 and 17-year-olds will be significantly different to those closest to them in age. Prof Will Jennings, Sky News election analyst Giving the vote to 16 and 17-year-olds has significant electoral implications, though the consequences may be overstated. \n As a group, young people tend to vote heavily for parties of the left - not just Labour, but also the Greens and the Liberal Democrats, and the SNP in Scotland. In the 2024 general election, according to the British Election Study online panel, Labour secured 41% of the vote among 18-25s, with the Liberal Democrats on 17% and the Greens on 16%. \n  The latest YouGov polling for Sky News puts Labour much more narrowly ahead of the Greens (by 28% to 26%) - a shift that highlights that the government cannot take the support of young people for granted.\n For both Reform UK and the Conservatives, young people are the group of voters where they have lowest support - compared to other age groups.  One of the defining characteristics of young people is that they tend to turn out to vote at lower rates than older age groups. In recent elections the percentage of over-65s who have turned out to vote has been approximately 15-20% greater than the share of those aged between 18 and 25.  Also, in terms of the UK's population 'pyramid' - generational differences in birth rates mean there are considerably fewer 16-year-olds than 50-year-olds (750,000 vs 900,000). Combined, this means that while the electorate at the next general election will now include a slightly more left-leaning demographic, this will not lead to a dramatic rebalancing of electoral power. Older voters continue to be a dominant part of the electorate and this change will only shift the dial a fraction in a leftward direction. How significant will their votes be at the general election? This is another question entirely. Were an election held at the time of the last census, adding 16 and 17-year-olds to the electorate would only have added an extra 2.9% of potential votes. There were fewer 16 and 17-year-olds in the UK than there are people aged 60 or 61, or people aged 86+. That might still be enough to make an impact in some constituencies, but it's not enough to bring about any huge nationwide swings. The fact that it's only \"potential\" votes is significant as well. Young people already turn out to vote at lower rates than older people. In 2024, people aged 65 or older were twice as likely to vote as someone aged between 18 and 24. And it doesn't look like 16 and 17-year-olds are about to buck that trend. A poll of 500 16 and 17-year-olds, carried out by Merlin Strategy this week on behalf of ITV News, found that only 18% said they would definitely vote if there was an election tomorrow, while 49% said they didn't think that they or their peers should be given the chance to vote at all. What’s happened in other countries? We don't need to look too far for evidence on this. In fact, we can stay within the UK - Scotland gave the vote to 16-year-olds at the 2014 independence referendum and extended that for the 2016 and 2021 Scottish parliament elections. Analysis suggests that it has been successful at boosting electoral engagement in both the immediate and longer-term. At the 2014 referendum, voters aged 16 and 17 turned out in higher numbers than other young voters, albeit still at lower rates than the population at-large. And voters who were first eligible to vote at 16 also continued to vote in higher numbers than their slightly older peers in subsequent elections - according to joint research from the Universities of Sheffield and Edinburgh, and political participation think tank d-part. The Welsh government also extended the vote to 16-year-olds for the 2021 Senedd elections, while the crown dependencies of Jersey, Guernsey and the Isle of Man have allowed 16-year-olds to vote in their assembly elections since before 2010. Globally, however, there are only seven sovereign nations that currently allow 16-year-olds to vote in national elections. Two are in Europe (Austria and Malta), while the remainder (Brazil, Argentina, Ecuador, Cuba, Nicaragua) are all in Latin America. The United Arab Emirates has the oldest voting age in the world, at 25, a full four years older than the next set of countries. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Voter ID won't be scrapped, minister says",
        "description": "When the Conservatives brought in the controversial change to the electoral system which forced people to bring photo ID to polling stations in order to vote, Labour opposed the measure.",
        "url": "https://news.sky.com/story/voter-id-wont-be-scrapped-minister-says-13398023",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-polling-polling-place_6934302.jpg?20250604095831",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-17 13:31:00",
        "Headline": "Plans are instead under way for UK-issued bank cards to be included as acceptable forms of ID. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  When the Conservatives brought in the controversial change to the electoral system which forced people to bring photo ID to polling stations in order to vote, Labour opposed the measure. Sir Keir Starmer said it could risk \"locking people out of democracy\". Today, the government has decided to continue with the policy, instead announcing it is expanding the forms of ID which will be accepted. Politics latest: Plan to lower voting age divides opinion Plans are under way for UK-issued bank cards to be included as acceptable forms of ID. This will be legislated for in a new Elections Bill. The democracy minister said the voter ID policy was still in place to prevent \"issues from previous elections\" including fraud and other forms of election interference. Rushanara Ali said she was aware that legitimate voters, including disabled voters, were excluded from voting at the last election. \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  Sixteen and 17-year-olds will be able to vote in next general election\n                 \n                  Five reasons to be confused by Starmer's MP suspensions\n                 She added that her plans for expanding which forms of ID will be accepted would be \"striking the right balance\" of fairness.  In August last year, the Electoral Commission said some 3% of people do not have photo ID eligible for voting. That includes 14% of people in council housing, 10% of unemployed people and 7% of disabled people. The Equality and Human Rights Commission has raised questions in previous elections over whether the voter ID policy is discriminatory towards ethnic minority voters and disabled voters. \"We are concerned about the impact voter ID had on people who share certain protected characteristics,\" a spokesperson said. \"This could affect the right to free and democratic elections, protected under the Human Rights Act.\" Read more:Sixteen and 17-year-olds will be able to vote in next general electionWho are the suspended Labour MPs? During the election campaign, both Angela Rayner and the prime minister said the disproportionality of the policy was concerning. Sir Keir told me he would \"look into it\". The disability charity Mencap welcomed the prospect of a review at the time, but today it seems the government have shelved these plans. The department for Levelling Up, Housing and Communities has been approached for comment."
    },
    {
        "title": "Starmer defends suspending rebel MPs after backbench criticism",
        "description": "Sir Keir Starmer has defended suspending four of his own MPs, saying those who \"repeatedly break the whip\" have to be dealt with.",
        "url": "https://news.sky.com/story/starmer-defends-suspending-rebel-mps-after-backbench-criticism-13398078",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/097a0f80fdc21a6465170d998222438784f4c07eb22eeabdb015c664e434191d_6967174.jpg?20250717164301",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-17 15:23:00",
        "Headline": "The PM has said repeated rule breakers need to be dealt with after purging four MPs.",
        "Content": " Sir Keir Starmer has defended suspending four of his own MPs, saying those who \"repeatedly break the whip\" have to be dealt with. In his first comments on the decision to purge a handful of backbenchers, the prime minister said all Labour MPs were elected on a \"manifesto for change\" and that needs to be delivered \"as a Labour government\". Politics Latest: Brexit 'deplorable', says Germany's chancellor Asked by Sky's political editor Beth Rigby if the suspensions make him look weak, Sir Keir said: \"I'm determined that we will change this country for the better for millions of working people. \"I'm not going to be deflected from that and therefore we have to deal with people who repeatedly break the whip, because everyone was elected as a Labour MP on the manifesto of change and everybody needs to deliver as a Labour government.\" The casualties of the crackdown were Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell, who are no longer part of Labour's parliamentary party and will sit as independent MPs pending a review. The move has been criticised by several of their colleagues who say the party leadership should listen to backbench concerns rather than punish them for speaking out. \n                  'We're a team': Jess Phillips defends PM's decision to suspend Labour rebels\n                 \n                  Controversial welfare bill passes final Commons stage - but only after another concession\n                 \n                  Another tantrum from the Labour backbenches is inevitable\n                 The four MPs had voted against the government's welfare cuts earlier this month. However, it is understood this isn't the only reason for their suspension with party sources citing \"repeated breaches of party discipline\". More than 100 Labour MPs had initially spoken out against the plan to cut personal independent payments (PIP), though only 47 voted against the bill's third reading after it was watered down significantly in the face of defeat. Former Labour Prime Minister Tony Blair faced a similar-sized revolt when he tried to push through welfare reforms in 1997, but he did not suspend those who voted against him. 👉Listen to Politics at Sam and Anne's on your podcast app👈   Sir Keir was speaking in a Q&A following a press conference alongside the German Chancellor Friedrich Merz. He said he is determined to carry out his reforms \"because we inherited a broken economy and broken public services\" and \"no government has inherited both of those\". Read More:Minister defends PM's decision to suspend Labour rebelsFive reasons to be confused by Starmer's MP suspensionsWhy suspended Labour MPs clearly hit a nerve with Starmer However, he is facing a fiscal blackhole as the original welfare plan had aimed to save £5bn before it was softened. It also remains unclear how the government will fund extending the winter fuel allowance, which was another concession to angry backbenchers following the controversial decision to scrap universal payments. On Wednesday night a chorus of MPs who have been critical of the government hit out at the decision to suspend four of their colleagues. Ian Byrne, the Labour MP for Liverpool West Derby who was temporarily suspended last year for revolting over the two-child benefit cap, said: \"These decisions don't show strength. They are damaging Labour's support and risk rolling out the red carpet for Reform.\" Richard Burgon, the Labour MP for Leeds East, said a key role of backbenchers is to challenge policies that \"make a Reform government much more likely\" and the prime minister should be \"listening to those voices, not punishing them\". Jon Trickett, Labour MP for Normanton and Hemsworth, said: \"It's not a sin to stand up for the poor and disabled\", adding: \"Solidarity with the suspended four.\""
    },
    {
        "title": "Five reasons to be confused by Starmer's MP suspensions",
        "description": "I'm going to level with you - I am very, very confused.",
        "url": "https://news.sky.com/story/five-reasons-to-be-confused-by-starmers-mp-suspensions-13397811",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-rachael-maskell_6966750.jpg?20250717083731",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-07-17 07:07:00",
        "Headline": "This is meant to be a show of strength, but most people have literally never heard of the four MPs who have lost the Labour whip. That's just the first reason deputy political editor Sam Coates is confused by the PM's move. ",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n I'm going to level with you - I am very, very confused. In fact, I've got five reasons why I'm very confused. The first reason I'm confused is because this is meant to be a show of strength, but most people have literally never heard of these four individuals. Rachael Maskell is a bit well-known, but if this is intended to impress the public, then I'm not sure the public will notice. Secondly, if it's about installing discipline in the parliamentary Labour Party, I'm confused about that. Surely Sir Keir Starmer's aim right now should be to unite the parliamentary Labour Party rather than divide it. After the welfare rebellion, the promise was to listen. Starmer gave interviews saying he was going to create policy more sympathetic to his party. This is the opposite approach. \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 \n                  Voter ID won't be scrapped, minister says\n                 \n                  Sixteen and 17-year-olds will be able to vote in next general election\n                 The third reason I'm confused is because they've been suspended in part for their role in the welfare rebellion that forced the government into its U-turn. It was only yesterday morning that Work and Pensions Secretary Liz Kendall said the government's welfare reforms were in the \"right place\" - yet the people who helped get them there are suspended. Suspended for agreeing with what is now government policy is an odd look.  Fourth, I'm confused at who the most prominent individual to be suspended is - Rachael Maskell. She was on Sky News within minutes of the suspension looking genuinely surprised and really rather upset. Now, there's absolutely no doubt she was a ringleader in this rebellion. Eight days ago, she authored an article in the New Statesman discussing how to organise a government rebellion - so I think that's pretty much case closed. But Rachael is of the soft left, not the hard left. And who else is on the soft left? It's Starmer. It does feel as if the prime minister is slightly coming for people who have dangerously similar views to him. I understand this is all about drawing hard lines and showing who's on your team and who isn't. But some of that line looks like it goes awfully close to people that you really wouldn't want to be on the wrong side of if you're prime minister. Read more:Who are the suspended Labour MPs?Why suspended MPs hit a nerve with Starmer  And finally, three other MPs - Rosena Allin-Khan, Bell Ribeiro-Addy and Mohammed Yasin - have been sacked from their trade envoy jobs. They do retain the party whip. But here's the thing that hurts your head: if you are a Lib Dem trade envoy, like Sarah Olney, or if you're a Tory trade envoy, as George Freeman was until a couple of weeks ago when he was suspended, you do not have to obey the whip - and you can continue to keep your trade envoy role. But if you're in the Labour Party and you're a trade envoy, you do have to obey the whip. And it's just one of those mad inconsistencies where if you're in another party, you can keep your trade envoy role, if you're in the governing party, you can't. That just doesn't make sense at all. So there are my five reasons why I'm completely confused."
    },
    {
        "title": "Diane Abbott suspended from Labour Party",
        "description": "Diane Abbott has been suspended from the Labour Party pending an investigation.",
        "url": "https://news.sky.com/story/diane-abbott-suspended-from-labour-party-13398146",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diane-abbott_6967262.jpg?20250717182642",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-07-17 17:04:00",
        "Headline": "It comes after the veteran MP defended previous comments about racism which led to a year-long suspension.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Diane Abbott has been suspended from the Labour Party pending an investigation. A party spokesperson confirmed the decision to Sky News but did not give a reason why. Politics Live: The Starmtroopers are coming for the Corbynites It comes after the veteran MP defended previous comments about racism which sparked an antisemitism row and led to a year-long suspension. She apologised at the time and was readmitted back into the party before the 2024 general election. A Labour Party spokesperson said: \"Diane Abbott has been administratively suspended from the Labour Party, pending an investigation. We cannot comment further while this investigation is ongoing.\" Sky News understands that the suspension is not related to the four rebels who lost the whip on Wednesday for \"repeated breaches\" of party discipline, including voting against the government's welfare cuts. \n                  Spies and special forces among more than 100 Britons whose details were included in Afghan data leak\n                 \n                  Politics latest: Diane Abbott suspended from Labour\n                 \n                  Sixteen and 17-year-olds will be able to vote in next general election\n                 The action has been taken because of an interview in which she doubled down on her claim Jewish people experience racism differently to black people, which previously sparked a huge controversy. In a letter to The Observer in 2023, Ms Abbott argued that people of colour experienced racism \"all their lives\" and said that was different to the \"prejudice\" experienced by Jewish people, Irish people and Travellers. Shortly after it was published, she issued a statement in which she said she wished to \"wholly and unreservedly withdraw my remarks and disassociate myself from them\". However in a new interview with BBC Radio 4's Reflections programme this week, she said she did not look back on the incident with regret. Ms Abbott said: \"Clearly, there must be a difference between racism which is about colour and other types of racism because you can see a Traveller or a Jewish person walking down the street, you don't know. \"But if you see a black person walking down the street, you see straight away that they're black. They are different types of racism.\" She added: \"I just think that it's silly to try and claim that racism which is about skin colour is the same as other types of racism. \"I don't know why people would say that.\" Ms Abbott has not commented on the suspension directly but since the news broke she has posted a video of the interview on X. The clip was re-posted by Brian Leishman, one of the MPs suspended on Wednesday, who said: \"Diane Abbott has fought against racism her entire life.\" Bell Riberio-Addy, who lost her role as trade envoy in yesterday's purge, also came to Ms Abbott's defence, saying: \"Before condemning her based on headlines, I would listen to her clip and note she discussed the different forms that racism takes and condemned all forms of racism.\" Former shadow chancellor John McDonnell made similar comments, saying that in the interview his colleague \"forthrightly condemns antisemitism & discusses the different forms of racism\". In the interview, Ms Abbott said she \"of course\" condemns antisemitic behaviour in the same way she would condemn racist behaviour because of the colour of someone's skin, adding: \"I do get a bit weary of people trying to pin the antisemitic label on me because I spent a lifetime facing racism of all kinds.\" Ms Abbott made history when she was elected as Britain's first black female MP for Labour in 1987. She is the longest-serving female MP in the Commons, giving her the title \"Mother of the House\". As an MP on the left of the party she has often clashed with the leadership throughout her career - bar her time serving in Jeremy Corbyn's shadow cabinet. Read more from Sky News:Sixteen and 17-year-olds will be able to vote in next general electionFive reasons to be confused by Starmer's MP suspensions Many MPs rallied in support of Ms Abbott last year when it was not clear if she would be reinstated in time for the general election, or allowed to stand. She went on to retain her seat of Hackney North and Stoke Newington with a majority of over 15,000. Deputy Prime Minister Angela Rayner hinted action could be taken against Ms Abbott when she told The Guardian earlier on Thursday that she was \"disappointed\" in her colleague's remarks. \"There's no place for antisemitism in the Labour Party, and obviously the Labour Party has processes for that,\" she said. A source close to the decision to suspend her told Sky News there is a \"very slim chance\" she will be allowed back in, given she did antisemitism training and apologised last time. It raises questions about whether Ms Abbott could join the new party being formed by Mr Corbyn and former Labour MP Zarah Sultana. For the time being, Ms Abbott will sit in the Commons as an independent MP. Adnan Hussain, who was elected as the independent MP for Blackburn last year, said on X: \"We'd be honoured to have a giant like Diane join us, she [should] come to the side that would really appreciate her for the legend she is.\""
    },
    {
        "title": "The King and AI: A humanoid robot has painted a picture of Charles. How did it do? ",
        "description": "Whether or not the UK will have a Royal Family in the future is something that often comes up in debate.",
        "url": "https://news.sky.com/story/the-king-and-ai-a-humanoid-robot-has-painted-a-picture-of-charles-how-did-it-do160-13397522",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-charles-national-gallery_6907867.jpg?20250506111738",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-17 02:25:00",
        "Headline": "The artistic humanoid used advanced artificial intelligence algorithms and a robot arm using on oil canvas to create the image.",
        "Content": "Whether or not the UK will have a Royal Family in the future is something that often comes up in debate. If we do, the latest evidence suggests there will be no lack of artists around to paint them. A new portrait titled \"Algorithm King\" has perhaps offered a glimpse of how members of the Royal Family may be painted in the decades or even centuries ahead - after it was created by a female \"robot artist\" named Ai-Da. The artistic humanoid used advanced artificial intelligence (AI) algorithms and a robot arm using on oil canvas to create the painting of King Charles. Ai-Da, the first robot to ever paint the monarch, also used the cameras in her eyes to help create her machine-made masterpiece. The robot previously painted a portrait of the late Queen Elizabeth II to celebrate the monarch's Platinum Jubilee in 2022. The two portraits, which the monarchs didn't sit for, were exhibited together at an unveiling of the portrait of King Charles as part of the AI For Good Summit hosted by the United Nations in Geneva. \n                  Woman handed criminal conviction despite 'unlawful' strip search by police in Greater Manchester\n                 \n                  One child dies after coach crashes in Somerset on way back from school trip\n                 \n                  Protesters clash with police outside Essex hotel believed to house asylum seekers\n                 Ai-Da, described as being the world's first \"ultra-realistic robot artist\", was created by UK art dealer Aidan Meller and built in Cornwall by Engineered Arts. She uses advanced AI language modelling to enable her to have a conversation with humans. Speaking at the UN, Ai-Da said: \"It's a privilege to be part of this remarkable event at the United Nations, surrounded by those shaping the future of technology and culture. Presenting my portrait of His Majesty King Charles III is not just a creative act, it's a statement about the evolving role of AI in our society, and to reflect on how artificial intelligence is shaping the cultural landscape.\" Read more from Sky News:Humanoid machine performs real-world taskPalace confirms date of Trump's state visit Simon Manley, ambassador and permanent representative to the World Trade Organisation and UN in Geneva, said at the unveiling of the portrait: \"Ai-Da is not just a technological marvel, she is a cultural conversation starter. We are proud to showcase British innovation at its most imaginative, and to reflect on how emerging technologies can shape global dialogues on art, ethics and identity.\" Ai-Da - named after the first computer programmer Ada Lovelace - has spoken at the House of Lords, Number 10 Downing Street and at the UN. Her artwork has been exhibited all over the world from the Tate Modern, V&A, Somerset House and the Design Museum in Britain to the Pyramids in Egypt and the Venice Biennale. She made history in 2024 when a painting by her sold at Sotheby's for $1m. Mr Meller said: \"The greatest artists in history grappled with their period of time, and both celebrated and questioned society's shifts. Ai-Da Robot as technology, is the perfect artist today to discuss the current developments with technology and its unfolding legacy.\""
    },
    {
        "title": "Routine eye scan 'could predict 10-year heart attack and stroke risk', University of Dundee study suggests",
        "description": "A scan which forms part of a routine eye test could help predict a person's risk of having a heart attack or stroke within the next 10 years, a study has suggested.",
        "url": "https://news.sky.com/story/routine-eye-scan-could-predict-10-year-heart-attack-and-stroke-risk-university-of-dundee-study-suggests-13397840",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-optometrist-eye-test_6966799.jpg?20250717100402",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-17 08:25:00",
        "Headline": "Researchers used artificial intelligence (AI) to analyse digital retinal photographs, with the technology able to produce personalised risk predictors in less than a second.",
        "Content": "A scan which forms part of a routine eye test could help predict a person's risk of having a heart attack or stroke within the next 10 years, a study has suggested. Researchers at the University of Dundee used artificial intelligence (AI) to analyse digital retinal photographs, which are taken to capture images from the back of the eye to look for certain conditions. The technology was able to produce personalised risk predictors in less than a second. It is hoped the simple test could one day be offered alongside blood pressure and cholesterol checks to allow doctors to treat patients earlier. For the study, published in the journal Cardiovascular Diabetology, researchers trialled the AI software on the eye scans of people with type 2 diabetes. Those with the condition undergo routine eye tests to check for diabetic retinopathy, a condition where high blood sugar levels damage the blood sugar in the retina. Dr Ify Mordi, British Heart Foundation (BHF) research fellow at the university and consultant cardiologist, said: \"It may be surprising, but the eyes are a window to the heart. \n                  Government to announce new scheme as it ramps up AI adoption with backing from Facebook owner Meta\n                 \n                  Musk's AI chatbot updated after posting antisemitic messages online\n                 \n                  Teachers given new guidance in dealing with AI-generated child sexual abuse material\n                 \"If there is damage or narrowing of the blood vessels at the back of the eye, there is a good chance that will also be seen in the blood vessels further inside the body, supplying the heart, which could lead to a heart attack or stroke.\" The AI tool was instructed to initially look for warning signs on the images, such as blood vessel narrowing or blockages. It was then permitted to look for any detail in the photographs, such as the size or arrangement of blood vessels, before being trained using 4,200 images. The technology was able to predict the people who would go on to have \"major cardiovascular events\", like heart attacks or strokes, within a decade with 70% accuracy. Dr Mordi said: \"This is a one-stop scan which is routinely performed and takes less than a minute. \"It could be an important part of the package, alongside blood pressure and cholesterol checks, in identifying people who could benefit from medication or lifestyle changes.\" Read more from Sky News:'My voice box was removed after NHS missed my throat cancer'World's biggest human imaging project reaches new milestone Professor Bryan Williams, chief scientific and medical officer at the BHF, said cutting-edge innovations like the AI tool could \"play a role in improving risk prediction\". He added: \"However, more research is needed to show this prediction accuracy is robust, and to determine the feasibility of incorporating retinal scans into clinical practice.\" Dr Clare Jonas, research lead at the Stroke Association, agreed that AI analyses of health data \"have exciting potential for better early detection\". She added: \"Advances like these could make it easier for people at risk of stroke to take the right steps to stop it from happening. \"Whilst there are still many practical questions to answer about whether, when and how AI could be used in clinical practice, we hope the government's 10 Year Health Plan will take such technological advances into account to stop more strokes from devastating people's lives.\""
    },
    {
        "title": "The King and AI: A humanoid robot has painted a picture of Charles. How did it do? ",
        "description": "Whether or not the UK will have a Royal Family in the future is something that often comes up in debate.",
        "url": "https://news.sky.com/story/the-king-and-ai-a-humanoid-robot-has-painted-a-picture-of-charles-how-did-it-do160-13397522",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-charles-national-gallery_6907867.jpg?20250506111738",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-07-17 02:25:00",
        "Headline": "The artistic humanoid used advanced artificial intelligence algorithms and a robot arm using on oil canvas to create the image.",
        "Content": "Whether or not the UK will have a Royal Family in the future is something that often comes up in debate. If we do, the latest evidence suggests there will be no lack of artists around to paint them. A new portrait titled \"Algorithm King\" has perhaps offered a glimpse of how members of the Royal Family may be painted in the decades or even centuries ahead - after it was created by a female \"robot artist\" named Ai-Da. The artistic humanoid used advanced artificial intelligence (AI) algorithms and a robot arm using on oil canvas to create the painting of King Charles. Ai-Da, the first robot to ever paint the monarch, also used the cameras in her eyes to help create her machine-made masterpiece. The robot previously painted a portrait of the late Queen Elizabeth II to celebrate the monarch's Platinum Jubilee in 2022. The two portraits, which the monarchs didn't sit for, were exhibited together at an unveiling of the portrait of King Charles as part of the AI For Good Summit hosted by the United Nations in Geneva. \n                  Woman handed criminal conviction despite 'unlawful' strip search by police in Greater Manchester\n                 \n                  One child dies after coach crashes in Somerset on way back from school trip\n                 \n                  Protesters clash with police outside Essex hotel believed to house asylum seekers\n                 Ai-Da, described as being the world's first \"ultra-realistic robot artist\", was created by UK art dealer Aidan Meller and built in Cornwall by Engineered Arts. She uses advanced AI language modelling to enable her to have a conversation with humans. Speaking at the UN, Ai-Da said: \"It's a privilege to be part of this remarkable event at the United Nations, surrounded by those shaping the future of technology and culture. Presenting my portrait of His Majesty King Charles III is not just a creative act, it's a statement about the evolving role of AI in our society, and to reflect on how artificial intelligence is shaping the cultural landscape.\" Read more from Sky News:Humanoid machine performs real-world taskPalace confirms date of Trump's state visit Simon Manley, ambassador and permanent representative to the World Trade Organisation and UN in Geneva, said at the unveiling of the portrait: \"Ai-Da is not just a technological marvel, she is a cultural conversation starter. We are proud to showcase British innovation at its most imaginative, and to reflect on how emerging technologies can shape global dialogues on art, ethics and identity.\" Ai-Da - named after the first computer programmer Ada Lovelace - has spoken at the House of Lords, Number 10 Downing Street and at the UN. Her artwork has been exhibited all over the world from the Tate Modern, V&A, Somerset House and the Design Museum in Britain to the Pyramids in Egypt and the Venice Biennale. She made history in 2024 when a painting by her sold at Sotheby's for $1m. Mr Meller said: \"The greatest artists in history grappled with their period of time, and both celebrated and questioned society's shifts. Ai-Da Robot as technology, is the perfect artist today to discuss the current developments with technology and its unfolding legacy.\""
    }
]