[
    {
        "title": "'Andrew Tate phenomena' surges in schools - with boys refusing to talk to female teacher",
        "description": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers.",
        "url": "https://news.sky.com/story/andrew-tate-phenomena-surges-in-schools-with-boys-refusing-to-talk-to-female-teacher-13351203",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-andrew-tate-romania_6887406.jpg?20250415145519",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 15:24:00",
        "Headline": "Online influencers such as Andrew Tate are fuelling an increase in sexism in the classroom, says a new survey from education union the NASUWT. It comes after the Netflix series Adolescence thrust concerns around incel culture into the spotlight. ",
        "Content": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers. More than 5,800 teachers were polled as part of the survey by the NASUWT teaching union, and nearly three in five (59%) of teachers said they believe social media use has contributed to a deterioration in pupils' behaviour. The findings have been published during the union's annual conference, which is taking place in Liverpool this weekend. One motion that is set to be debated at the conference calls on the union's executive to work with teachers \"to assess the risk that far-right and populist movements pose to young people\". Andrew Tate was referenced by a number of teachers who took part in the survey, who said he had negative influence on male pupils. One teacher said she'd had 10-year-old boys \"refuse to speak to [her]...because [she is] a woman\". Another teacher said \"the Andrew Tate phenomena had a huge impact on how [pupils at an all-boys school] interacted with females and males they did not see as 'masculine'\". While another respondent to the survey said their school had experienced some incidents of \"derogatory language towards female staff...as a direct result of Andrew Tate videos\". 'Even adults can get dangerously addicted' Last month, Prime Minister Sir Keir Starmer hosted a discussion in Downing Street on how to prevent young boys from being dragged into a \"whirlpool of hatred and misogyny\". The talks were with the creators of Netflix drama Adolescence, which explored so-called incel culture. It comes as Tory leader Kemi Badenoch revealed her young cousin killed themselves after falling down an \"internet rabbit hole\" - and she worries \"a lot about social media\". She told the Daily Mail: \"It's heartbreaking. My views about the dangers of social media are not just about children. I know even as adults we can get dangerously addicted.\" The Conservatives have been arguing for a ban on mobile phones in schools over concerns about the impact of social media on children. Read more from Sky News:Former Rochdale footballer dies aged 36Two Britons among four killed in cable car crash  'An urgent need for action' Patrick Roach, the teaching union's general secretary, said teachers \"cannot be left alone to deal with these problems\". \"There is an urgent need for concerted action involving schools, colleges and other agencies to safeguard all children and young people from the dangerous influence of far-right populists and extremists,\" he added. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for the Department for Education (DfE) said: \"Education can be the antidote to hate, and the classroom should be a safe environment for sensitive topics to be discussed and where critical thinking is encouraged. \"That's why we provide a range of resources to support teachers to navigate these challenging issues, and why our curriculum review will look at the skills children need to thrive in a fast-changing online world.\""
    },
    {
        "title": "Trump threatens to 'take a pass' on Ukraine peace talks",
        "description": "Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him.",
        "url": "https://news.sky.com/story/trump-threatens-to-take-a-pass-on-ukraine-peace-talks-13351475",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6890409.jpg?20250418224946",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 21:19:00",
        "Headline": "The US has suggested it could abandon its efforts to broker a permanent ceasefire within days, having seemingly grown frustrated by a lack of progress. Ukraine's Volodymyr Zelenskyy has said Vladimir Putin is not serious about ending the war.",
        "Content": " Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him. The US president's past confidence he could do a quick deal to end the conflict has proved to be misplaced, and now his administration has floated the prospect of abandoning its efforts to broker one. US threatens to abandon peace talks - latest updates Mr Trump's secretary of state, Marco Rubio, has said the White House is prepared to \"move on\", with little sign of fighting coming to an end some two months after talks began with Vladimir Putin. Negotiations have since taken place with both Kyiv and Moscow, the latter of which Mr Trump has been accused of being soft on, but the war has continued well beyond its three-year anniversary. Asked what it will take to secure a deal, Mr Trump told reporters at the White House he needed to see \"enthusiasm\" from both sides. \"I think I see it,\" he added. \"It's coming to a head right now.\" 'I know when people are playing us' Mr Trump dismissed the idea he was being played by Mr Putin, saying: \"Nobody is playing me. I'm trying to help.\" \"My whole life has been one big negotiation and I know when people are playing us and when they're not,\" he added. Nonetheless, Sky News' Moscow correspondent Ivor Bennett said the White House raising the spectre of walking away from peace talks showed Mr Trump was frustrated by the lack of progress. Before winning last November's presidential election, he infamously claimed he could end the war in a day. Echoing Mr Rubio, he's now said \"we're just going to take a pass\" if Russia or Ukraine \"makes it very difficult\". Kremlin spokesperson Dmitry Peskov insisted progress towards a deal had been made, but acknowledged the \"complicated\" situation was \"not an easy one\" to solve. A 30-day moratorium on striking energy infrastructure targets was previously agreed, but both sides have since accused one another of breaching it. Russia has also continued to launch deadly airstrikes on civilian infrastructure - the bloodiest of the more recent attacks saw at least 35 people killed in Sumy. Kyiv and its European allies have said the continued attacks show Russia is not serious about peace. Read more from Sky News:Godfather-style gang war grips ScotlandHow Israel's attack on aid workers unfolded  Looking ahead, Ukraine's Volodymyr Zelenskyy has indicated a \"memorandum of intent\" on a much vaunted US minerals deal could soon be signed. Mr Trump wants to profit from the country's natural resources in what he says is repayment for military aid. It's hoped America having a stake in the country could also help maintain any truce. The deal was due to be done weeks ago but was derailed by his falling out with Mr Trump at the White House. 👉 Follow Trump 100 on your podcast app 👈 More meetings are also expected among the so-called coalition of the willing, assembled by Sir Keir Starmer and Emmanuel Macron to help police any peace deal. Sir Keir spoke with Mr Trump on the phone on Saturday, with ending the Ukraine war a topic of conversation."
    },
    {
        "title": "Democrat senator Chris Van Hollen who met wrongly deported man Kilmar Abrego Garcia says photos of pair with margaritas are staged",
        "description": "The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president. ",
        "url": "https://news.sky.com/story/democrat-senator-chris-van-hollen-who-met-wrongly-deported-man-kilmar-abrego-garcia-says-photos-of-pair-with-margaritas-are-staged-13351466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-van-hollen-kilmar-abrego-garcia_6890420.png?20250418235517",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 20:49:00",
        "Headline": "Chris Van Hollen adds that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison to a detention centre with better conditions.",
        "Content": " The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president.  Chris Van Hollen added that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison in El Salvador to a detention centre with better conditions. The deportation of Mr Garcia has become a flashpoint in the US, with Democrats casting it as a cruel consequence of Donald Trump's disregard for the courts, while Republicans have criticised Democrats for defending him and argued his deportation is part of a larger effort to reduce crime. Mr Garcia, a Salvadoran citizen who was living in Maryland, is being detained in the Central American country despite the US Supreme Court calling on the White House to facilitate his return home. Trump officials have said Mr Garcia has ties to the violent MS-13 gang. However, Mr Garcia's attorneys say the government has provided no evidence, and he has never been charged with any crime related to such activity. Mr Van Hollen flew to El Salvador and met with Mr Garcia this week in an effort to help secure his return to America. Speaking to reporters at Washington Dulles International airport after returning to the US on Friday, Mr Van Hollen said: \"As the federal courts have said, we need to bring Mr Abrego Garcia home to protect his constitutional rights to due process. And it's also important that people understand this case is not just about one man. \"It's about protecting the constitutional rights of everybody who resides in the United States of America.\" Mr Van Hollen added the Trump administration is \"asserting a right to stash away residents of this country\" in foreign prisons \"without the semblance of due process that is the foundation of our constitutional order\". News correspondent What began as the plight of a Salvadoran man wrongly deported from the US to a notorious high-security prison in El Salvador has become a much broader debate. The case of Kilmar Abrego Garcia now ranges from the extremely serious – questions over the rule of law, due process and a potential constitutional crisis – to the more curious matter of tequila-based cocktails. There is a public relations battle going on over the images which emerged of Mr Abrego Garcia meeting Maryland Senator Chris van Hollen at a hotel in San Salvador. In the first photos which were made public, on the social media account of El Salvador's President Nayib Bukele, an ally of Donald Trump, the two men had cocktail glasses in front of them which he said were margaritas. But when Senator van Hollen posted his account of the meeting, those glasses had vanished. So what's this all about, and why does it matter? The senator has now given his version of events, saying the glasses were placed there by an El Salvador government official to mock concerns about the conditions in the country's prison – a photo op aimed at shifting the narrative around Mr Abrego Garcia's detention in El Salvador. Mr van Hollen also revealed El Salvador officials initially wanted the meeting to take place next to a swimming pool, to give an even more tropical backdrop to the encounter. But at the end of the day, it's not just about images, it's not about public relations, it's not even about margaritas. It's about a 29-year-old father of three, detained in El Salvador, despite having never gone through due process in the US. The senator also revealed Mr Garcia was brought from a detention centre to his hotel after initial requests to meet or speak with him were denied. Mr Van Hollen said Mr Garcia told him he was \"traumatised\" after being detained at El Salvador's notorious CECOT prison, but he had been moved to a \"different facility\" with better conditions nine days ago. The senator said Mr Garcia told him he was worried about his family and that thinking about them was giving him \"the strength to persevere\" and to \"keep going\" under awful circumstances. Mr Garcia's wife, Jennifer, was at the news conference and wiped away tears as Mr Van Hollen spoke of her husband's desire to speak to her. Earlier, Mr Van Hollen had posted photos of himself meeting with Mr Garcia. It came before El Salvador's President Nayib Bukele shared his own images of the meeting, which he claimed showed the pair \"sipping margaritas\" in the \"tropical paradise of El Salvador\". In an apparent sarcastic remark, Mr Bukele wrote that Mr Garcia had \"miraculously risen\" from the \"death camps\". Giving an account of what he says happened when the photos were taken, Mr Van Hollen said: \"We just had glasses of water on the table. I think maybe some coffee. \"And as we were talking, one of the government people came over and deposited two other glasses on the table with ice. And I don't know if it was salt or sugar round the top, but they looked like margaritas. \"If you look at the one they put in front of Kilmer, it actually had a little less liquid than the one in me in front of me to try to make it look, I assume like he drank out of it. \"Let me just be very clear. Neither of us touched the drinks that were in front of us.\" He added that people can tell he is telling the truth because if someone had sipped from one of the glass there would be a \"gap\" where the \"salt or sugar\" had disappeared. Mr Van Hollen said the image shows the \"lengths\" the El Salvadorian president will go to \"deceive people about what's going on\". \"It also shows the lengths that the Trump administration and [President Trump] will go to, because when he was asked by a reporter about this, he just went along for the ride.\""
    },
    {
        "title": "At least 148 people die after boat catches fire in Congo",
        "description": "The number of people found dead after a boat accident in Congo has risen to 148, officials have said.",
        "url": "https://news.sky.com/story/at-least-148-people-die-after-boat-catches-fire-in-congo-13351462",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-congo-river_6890406.jpg?20250418222338",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 20:36:00",
        "Headline": "The fire started as a woman was cooking on board the boat, officials said, adding that children were among those who died after jumping in the water.",
        "Content": "The number of people found dead after a boat accident in Congo has risen to 148, officials have said. They say hundreds are still missing after a motorised wooden boat caught fire and capsized on Tuesday in the Congo River. The number of dead had previously been estimated at 50. On Friday, senator Jean-Paul Boketsu Bofili of Equateur province said 500 people were on board, adding: \"As we speak, more than 150 survivors suffering from third-degree burns are without humanitarian assistance.\" The fire started as a woman was cooking on board the boat, said Competent Loyoko, the river commissioner. Several passengers, including women and children, died after jumping into the water without being able to swim, officials said. About 100 survivors were taken to an improvised shelter at the local town hall, while those with burn injuries were taken to local hospitals. \n                  Trump threatens to 'take a pass' on Ukraine peace talks\n                 \n                  Rubio's tough talk shows Trump's frustration - but there's only one loser if US walks away\n                 \n                  Two hours of terror: Sky News investigation reveals how Israel's deadly attack on aid workers unfolded\n                 Read more:Dozens reportedly killed in US airstrikes against Houthi rebelsBritish man, 27, dies after avalanche at French Alps ski resort The boat, called HB Kongolo, caught fire near the northwestern town of Mbandaka, having left the port of Matankumu for the Bolomba territory. Deadly boat accidents are common in the central African country, where late-night travels and overcrowded vessels are often blamed and authorities have struggled to enforce maritime regulations. Hundreds have been killed in boat accidents in recent years as more people abandon the few available roads for wooden vessels packed with passengers and their goods. The country's rivers are a major means of transport for its more than 100 million people, especially in remote areas where infrastructure is poor."
    },
    {
        "title": "The Lib Dems want to be the nice guys of politics - but is that what voters want?",
        "description": "Lib Dems don't tend to listen to right-wing podcasts.",
        "url": "https://news.sky.com/story/the-lib-dems-want-to-be-the-nice-guys-of-politics-but-is-that-what-voters-want-13351478",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bideford-ed-davey_6888861.jpg?20250417105443",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-04-18 22:19:00",
        "Headline": "The pitch is clear: Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Lib Dems don't tend to listen to right-wing podcasts. But if they did, they may be heartened by some of what they hear. Take the interview Kemi Badenoch gave to the TRIGGERnometry show in February. Ten minutes into the episode, one of the hosts recounts a conversation with a Tory MP who said the party lost the last election to the Lib Dems because they went too far to the right. Everyone laughs. Then in March, in a conversation with the Canadian psychologist Jordan Peterson, the Tory leader was asked to describe a Liberal Democrat. \"Somebody who is good at fixing their church roof,\" said Ms Badenoch. She meant it as a negative. Lib Dems now mention it every time you go near any of them with a TV camera.  The pitch is clear, the stunts are naff At times, party figures seem somewhat astonished the Tories don't view them as more of a threat, given they were beaten by them in swathes of their traditional heartlands last year. Going forward, the pitch is clear. Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts. To open this local election race, the Lib Dem leader straddled a hobbyhorse and galloped through a blue fence. More recently, he's brandished a sausage, hopped aboard a rollercoaster and planted wildflowers. Senior Lib Dems say they are \"constantly asking\" whether this is the correct strategy, especially given the hardship being faced by many in the country. They maintain it is helping get their message out though, according to the evidence they have. \"I think you can take the issues that matter to voters seriously while not taking yourself too seriously, and I also think it's a way of engaging people who are turned off by politics,\" said Sir Ed. 'What if people don't want grown-ups?' In that way, the Lib Dems are fishing in a similar pool of voters to Reform UK, albeit from the other side of the water's edge. Indeed, talk to Lib Dem MPs, and they say while some Reform supporters they meet would never vote for a party with the word \"liberal\" in its name, others are motivated more by generalised anger than any traditional political ideology. These people, the MPs say, can be persuaded. But this group also shows a broader risk to the Lib Dem approach. Put simply, are they simply too nice for the fractured times we live in? \"The Lib Dems want to be the grown-ups in the room,\" says Joe Twyman, director of Delta Poll. \"We like to think that the grown-ups in the room will be rewarded… but what if people don't want grown-ups in the room, what if people want kids shitting on the floor.\" A plan that looks different to the status quo The party's answer to this is that they are alive to the trap Lib Dems have walked into in the past of adopting a technocratic tone and blandly telling the public every issue is a \"bit more complicated\" than it seems. One senior figure says the Lib Dems are trying to do something quite unusual for a progressive centre-left party in making a broader emotional argument about why the public should pick them. This source says that approach runs through the stunts but also through the focus on care and the party leader's personal connection to the issue. Presenting a plan that looks different to the status quo is another way to try to stand apart. It's why there has been a focus on attacking Donald Trump and talking up the EU recently, two areas left unoccupied by the main parties.  The focus on local campaigning But beyond the national strategy, Lib Dems believe it's their local campaigning that really reaps rewards. In the run-up to the last election, several more regional press officers were recruited. Many stories pumped out by the media office now have a focus on data that can be broken down to a constituency level and given to local news outlets. Party sources say there has also been a concerted attempt to get away from the cliche of the Lib Dems constantly calling for parliament to be recalled. \"They beat us to it,\" said one staffer of the recent recall to debate British Steel.  'Gail's bakery rule' This focus on the local is helped by the fact many Lib Dem constituencies now look somewhat similar. That was evidenced by the apparent \"Gail's bakery rule\" last year, in which any constituency with a branch of the upmarket pastry purveyor had activists heaped on it. The similarities have helped the Lib Dems get away from another cliche - that of the somewhat opportunist targeting of different areas with very different messages. \"There is a certain consistency in where we won that helps explain that higher vote retention,\" said Lib Dem president Lord Pack. \"Look at leaflets in different constituencies [last year] and they were much more consistent than previous elections… the messages are fundamentally the same in a way that was not always the case in the past.\" A bottom-up campaign machine New MPs have also been tasked with demonstrating delivery and focusing doggedly on the issues that matter to their constituents. One Home Counties MP says he wants to be able to send out leaflets by 2027, saying \"everyone in this constituency knows someone who has been helped by their local Lib Dem\". In the run-up to last year's vote, strategists gave the example of the Lib Dem candidate who was invited to a local ribbon-cutting ceremony in place of the sitting Tory MP as proof of how the party can ingratiate itself into communities. With that in mind, the aim for these local elections is to pick up councillors in the places the party now has new MPs, allowing them to dig in further and keep building a bottom-up campaign machine. 'Anyone but Labour or Conservative' But what of the next general election? Senior Lib Dems are confident of holding their current 72 seats. They also point to the fact 20 of their 27 second-place finishes currently have a Conservative MP. Those will be the main focus, along with the 43 seats in which they finished third. There's also an acronym brewing to describe the approach - ABLOC or \"Anyone but Labour or Conservative\". 9% swing could make Sir Ed leader of the opposition The hope is for the political forces to align and Reform UK to continue splitting the Tory vote while unpopularity with the Labour government and Conservative opposition triggers some to jump ship. A recent pamphlet by Lord Pack showed if the Tories did not make progress against the other parties, just 25 gains from them by the Lib Dems - the equivalent of a 9% swing - would be enough to make Sir Ed leader of the opposition. What's more, a majority of these seats would be in the South East and South West, where the party has already picked up big wins. As for the overall aim of all this, Lord Pack is candid the Lib Dems shouldn't view a hung parliament as the best way to achieve the big prize of electoral reform because they almost always end badly for the smaller party. Instead, the Lib Dem president suggests the potential fragmentation of politics could bring electoral reform closer in a more natural way. \"What percentage share of the vote is the most popular party going to get at the next general election, it's quite plausible that that will be under 30%. Our political system can't cope with that sort of world,\" he said. Whether Ms Badenoch will still be laughing then remains to be seen. This is part of a series of local election previews with the five major parties. All five have been invited to take part."
    },
    {
        "title": "Pub hours extended for 80th VE Day celebrations in May",
        "description": "Pubs will be allowed to stay open for an extra two hours on VE Day next month to celebrate the 80th anniversary of the end of the Second World War in Europe.",
        "url": "https://news.sky.com/story/pub-hours-extended-for-80th-ve-day-celebrations-in-may-13351071",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-tea-party-ritz_6889785.jpg?20250418132234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 12:00:00",
        "Headline": "Parties are planned for 8 May to mark eight decades since the Allies formally accepted Germany's unconditional surrender in Europe in the Second World War.",
        "Content": "Pubs will be allowed to stay open for an extra two hours on VE Day next month to celebrate the 80th anniversary of the end of the Second World War in Europe. The government said pub licensing hours will be relaxed on 8 May to raise a glass and celebrate those who served in the war. Pubs and bars across the UK will be able to keep serving until 1am after the two hour extension, which will mark the end of four days of celebrations. Parties are being planned for the day, 80 years after the Allies' formal acceptance of Germany's unconditional surrender, marking the end of all German military operations in Europe on 8 May 1945.  Sir Keir Starmer said: \"As we mark the 80th anniversary of VE Day, the whole country should come together to remember the incredible sacrifices made by the wartime generation and to celebrate the peace and freedom they secured for us all. \"Keeping our pubs open for longer will give people the opportunity to join in celebrations and raise a glass to all of the men and women who served their country, both overseas and at home.\" \n                  VE Day 2025: What are the four-day celebrations to mark 80th anniversary?\n                 \n                  VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned\n                 \n                  Plea to 'stop and reflect' on cost of war ahead of VE Day 80th anniversary\n                 Pub licensing hours can be relaxed by the home secretary to mark occasions of \"exceptional national significance\", with extensions previously approved for major royal celebrations and significant sporting events, such as the Euro 2024 final. VE Day, or Victory in Europe Day, commemorations will begin on the 5 May bank holiday Monday, when there will be a military procession from Whitehall to Buckingham Palace and an RAF flypast over London. On 8 May, when the pub hour extension will come in, there are parties planned across the UK, culminating in 10,000 members of the public attending a televised celebration on London's Horse Guards Parade, where performances by stars of the stage and screen will take place. There will also be a VE Day tea party on 8 May at the National Memorial Arboretum in Staffordshire, bringing together the largest gathering of Second World War veterans. Read more: What celebrations are planned for VE Day? The hospitality industry has welcomed the hours' extension, with Michael Kill, chief executive of the Night Time Industries Association, saying it will give pubs and bars \"a much-needed boost while paying tribute to our shared history\". Kate Nicholls, chief executive of UK Hospitality, said many people will be gathering in their local pubs to mark the special occasion and she is \"pleased\" the government is extending licensing hours."
    },
    {
        "title": "Police appeal to find dancing woman who was carried on car bonnet for 30 yards in Wembley hit-and-run crash",
        "description": "Police are appealing for help to find a woman who is believed to be injured after she was carried on a car bonnet for 30 yards in a hit-and-run crash.",
        "url": "https://news.sky.com/story/police-appeal-to-find-dancing-woman-who-was-carried-on-car-bonnet-for-30-yards-in-wembley-hit-and-run-crash-13351411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wembley-london_6890335.jpg?20250418194558",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-18 18:17:00",
        "Headline": "A woman has been arrested on suspicion of dangerous driving and driving while over the prescribed alcohol limit following the crash in Wembley.",
        "Content": " Police are appealing for help to find a woman who is believed to be injured after she was carried on a car bonnet for 30 yards in a hit-and-run crash. Footage filmed by a member of the public shows the woman dancing in the road in Engineers Way, near Wembley Arena, at around 11.10pm on Thursday. The Met Police has said the video shows her narrowly avoiding passing vehicles before a car drives into her and carries her for 30 yards, or 27m (90ft), before she is thrown to the floor.   The force added the car did not stop at the scene. Members of the public called an ambulance but the woman was no longer there when officers and paramedics arrived. Read more from Sky News:The gang war gripping two major citiesBritish nationals killed in Italy cable car crashUB40 says striking bin workers 'shouldn't give up' A 33-year-old woman was arrested on suspicion of dangerous driving and driving while over the prescribed alcohol limit. She has since been released on bail to a date in early June. Police are keen to speak to the woman who was hit by the vehicle to speak to her about the crash, make sure she is well and that she receives any appropriate medical attention. The area of Wembley was busy at the time as people had just left a concert by Jamaican dancehall artist Alkaline."
    },
    {
        "title": "'Andrew Tate phenomena' surges in schools - with boys refusing to talk to female teacher",
        "description": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers.",
        "url": "https://news.sky.com/story/andrew-tate-phenomena-surges-in-schools-with-boys-refusing-to-talk-to-female-teacher-13351203",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-andrew-tate-romania_6887406.jpg?20250415145519",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 15:24:00",
        "Headline": "Online influencers such as Andrew Tate are fuelling an increase in sexism in the classroom, says a new survey from education union the NASUWT. It comes after the Netflix series Adolescence thrust concerns around incel culture into the spotlight. ",
        "Content": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers. More than 5,800 teachers were polled as part of the survey by the NASUWT teaching union, and nearly three in five (59%) of teachers said they believe social media use has contributed to a deterioration in pupils' behaviour. The findings have been published during the union's annual conference, which is taking place in Liverpool this weekend. One motion that is set to be debated at the conference calls on the union's executive to work with teachers \"to assess the risk that far-right and populist movements pose to young people\". Andrew Tate was referenced by a number of teachers who took part in the survey, who said he had negative influence on male pupils. One teacher said she'd had 10-year-old boys \"refuse to speak to [her]...because [she is] a woman\". Another teacher said \"the Andrew Tate phenomena had a huge impact on how [pupils at an all-boys school] interacted with females and males they did not see as 'masculine'\". While another respondent to the survey said their school had experienced some incidents of \"derogatory language towards female staff...as a direct result of Andrew Tate videos\". 'Even adults can get dangerously addicted' Last month, Prime Minister Sir Keir Starmer hosted a discussion in Downing Street on how to prevent young boys from being dragged into a \"whirlpool of hatred and misogyny\". The talks were with the creators of Netflix drama Adolescence, which explored so-called incel culture. It comes as Tory leader Kemi Badenoch revealed her young cousin killed themselves after falling down an \"internet rabbit hole\" - and she worries \"a lot about social media\". She told the Daily Mail: \"It's heartbreaking. My views about the dangers of social media are not just about children. I know even as adults we can get dangerously addicted.\" The Conservatives have been arguing for a ban on mobile phones in schools over concerns about the impact of social media on children. Read more from Sky News:Former Rochdale footballer dies aged 36Two Britons among four killed in cable car crash  'An urgent need for action' Patrick Roach, the teaching union's general secretary, said teachers \"cannot be left alone to deal with these problems\". \"There is an urgent need for concerted action involving schools, colleges and other agencies to safeguard all children and young people from the dangerous influence of far-right populists and extremists,\" he added. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for the Department for Education (DfE) said: \"Education can be the antidote to hate, and the classroom should be a safe environment for sensitive topics to be discussed and where critical thinking is encouraged. \"That's why we provide a range of resources to support teachers to navigate these challenging issues, and why our curriculum review will look at the skills children need to thrive in a fast-changing online world.\""
    },
    {
        "title": "The Lib Dems want to be the nice guys of politics - but is that what voters want?",
        "description": "Lib Dems don't tend to listen to right-wing podcasts.",
        "url": "https://news.sky.com/story/the-lib-dems-want-to-be-the-nice-guys-of-politics-but-is-that-what-voters-want-13351478",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bideford-ed-davey_6888861.jpg?20250417105443",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-04-18 22:19:00",
        "Headline": "The pitch is clear: Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Lib Dems don't tend to listen to right-wing podcasts. But if they did, they may be heartened by some of what they hear. Take the interview Kemi Badenoch gave to the TRIGGERnometry show in February. Ten minutes into the episode, one of the hosts recounts a conversation with a Tory MP who said the party lost the last election to the Lib Dems because they went too far to the right. Everyone laughs. Then in March, in a conversation with the Canadian psychologist Jordan Peterson, the Tory leader was asked to describe a Liberal Democrat. \"Somebody who is good at fixing their church roof,\" said Ms Badenoch. She meant it as a negative. Lib Dems now mention it every time you go near any of them with a TV camera.  The pitch is clear, the stunts are naff At times, party figures seem somewhat astonished the Tories don't view them as more of a threat, given they were beaten by them in swathes of their traditional heartlands last year. Going forward, the pitch is clear. Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts. To open this local election race, the Lib Dem leader straddled a hobbyhorse and galloped through a blue fence. More recently, he's brandished a sausage, hopped aboard a rollercoaster and planted wildflowers. Senior Lib Dems say they are \"constantly asking\" whether this is the correct strategy, especially given the hardship being faced by many in the country. They maintain it is helping get their message out though, according to the evidence they have. \"I think you can take the issues that matter to voters seriously while not taking yourself too seriously, and I also think it's a way of engaging people who are turned off by politics,\" said Sir Ed. 'What if people don't want grown-ups?' In that way, the Lib Dems are fishing in a similar pool of voters to Reform UK, albeit from the other side of the water's edge. Indeed, talk to Lib Dem MPs, and they say while some Reform supporters they meet would never vote for a party with the word \"liberal\" in its name, others are motivated more by generalised anger than any traditional political ideology. These people, the MPs say, can be persuaded. But this group also shows a broader risk to the Lib Dem approach. Put simply, are they simply too nice for the fractured times we live in? \"The Lib Dems want to be the grown-ups in the room,\" says Joe Twyman, director of Delta Poll. \"We like to think that the grown-ups in the room will be rewarded… but what if people don't want grown-ups in the room, what if people want kids shitting on the floor.\" A plan that looks different to the status quo The party's answer to this is that they are alive to the trap Lib Dems have walked into in the past of adopting a technocratic tone and blandly telling the public every issue is a \"bit more complicated\" than it seems. One senior figure says the Lib Dems are trying to do something quite unusual for a progressive centre-left party in making a broader emotional argument about why the public should pick them. This source says that approach runs through the stunts but also through the focus on care and the party leader's personal connection to the issue. Presenting a plan that looks different to the status quo is another way to try to stand apart. It's why there has been a focus on attacking Donald Trump and talking up the EU recently, two areas left unoccupied by the main parties.  The focus on local campaigning But beyond the national strategy, Lib Dems believe it's their local campaigning that really reaps rewards. In the run-up to the last election, several more regional press officers were recruited. Many stories pumped out by the media office now have a focus on data that can be broken down to a constituency level and given to local news outlets. Party sources say there has also been a concerted attempt to get away from the cliche of the Lib Dems constantly calling for parliament to be recalled. \"They beat us to it,\" said one staffer of the recent recall to debate British Steel.  'Gail's bakery rule' This focus on the local is helped by the fact many Lib Dem constituencies now look somewhat similar. That was evidenced by the apparent \"Gail's bakery rule\" last year, in which any constituency with a branch of the upmarket pastry purveyor had activists heaped on it. The similarities have helped the Lib Dems get away from another cliche - that of the somewhat opportunist targeting of different areas with very different messages. \"There is a certain consistency in where we won that helps explain that higher vote retention,\" said Lib Dem president Lord Pack. \"Look at leaflets in different constituencies [last year] and they were much more consistent than previous elections… the messages are fundamentally the same in a way that was not always the case in the past.\" A bottom-up campaign machine New MPs have also been tasked with demonstrating delivery and focusing doggedly on the issues that matter to their constituents. One Home Counties MP says he wants to be able to send out leaflets by 2027, saying \"everyone in this constituency knows someone who has been helped by their local Lib Dem\". In the run-up to last year's vote, strategists gave the example of the Lib Dem candidate who was invited to a local ribbon-cutting ceremony in place of the sitting Tory MP as proof of how the party can ingratiate itself into communities. With that in mind, the aim for these local elections is to pick up councillors in the places the party now has new MPs, allowing them to dig in further and keep building a bottom-up campaign machine. 'Anyone but Labour or Conservative' But what of the next general election? Senior Lib Dems are confident of holding their current 72 seats. They also point to the fact 20 of their 27 second-place finishes currently have a Conservative MP. Those will be the main focus, along with the 43 seats in which they finished third. There's also an acronym brewing to describe the approach - ABLOC or \"Anyone but Labour or Conservative\". 9% swing could make Sir Ed leader of the opposition The hope is for the political forces to align and Reform UK to continue splitting the Tory vote while unpopularity with the Labour government and Conservative opposition triggers some to jump ship. A recent pamphlet by Lord Pack showed if the Tories did not make progress against the other parties, just 25 gains from them by the Lib Dems - the equivalent of a 9% swing - would be enough to make Sir Ed leader of the opposition. What's more, a majority of these seats would be in the South East and South West, where the party has already picked up big wins. As for the overall aim of all this, Lord Pack is candid the Lib Dems shouldn't view a hung parliament as the best way to achieve the big prize of electoral reform because they almost always end badly for the smaller party. Instead, the Lib Dem president suggests the potential fragmentation of politics could bring electoral reform closer in a more natural way. \"What percentage share of the vote is the most popular party going to get at the next general election, it's quite plausible that that will be under 30%. Our political system can't cope with that sort of world,\" he said. Whether Ms Badenoch will still be laughing then remains to be seen. This is part of a series of local election previews with the five major parties. All five have been invited to take part."
    },
    {
        "title": "Joe Thompson: Former Rochdale footballer dies aged 36 after third cancer diagnosis",
        "description": "Former Rochdale player Joe Thompson has died aged 36.",
        "url": "https://news.sky.com/story/joe-thompson-former-rochdale-footballer-dies-aged-36-after-third-cancer-diagnosis-13351040",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-joe-thompson-rochdale_6889715.jpg?20250418113808",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 10:36:00",
        "Headline": "The former midfielder, who also had spells at Tranmere Rovers, Bury and Carlisle United, was diagnosed with cancer for a third time last year.",
        "Content": "Former Rochdale player Joe Thompson has died aged 36. His former club said it was \"devastated\" to learn of his death. Thompson, who retired in 2019, was diagnosed with cancer for a third time last year. In its statement, Rochdale FC said he died \"peacefully at home on Thursday, with his family by his side\". He made over 200 appearances for Rochdale, who he joined from Manchester United's academy in 2005. The club posted a tribute on X, describing the former midfielder as \"a warm personality who had a deep connection with our club from a young age\". In her tribute on Instagram, Thompson's wife Chantelle said he had \"made such an impact on so many people\" and he was \"the most incredible husband, son, brother, friend and father\". During his career, he played for Tranmere Rovers, Bury and Carlisle United, with spells on loan at Wrexham and Southport. He was first diagnosed with Hodgkin lymphoma in 2013, while playing for Tranmere. When Thompson rejoined Rochdale from Carlisle in 2016 the disease soon returned, but he confirmed he was cancer free in June 2017. Two years later, he announced his retirement at the age of 29, saying his body had been pushed \"to the limit\" having twice undergone treatment for cancer. Last year, he revealed he had been diagnosed with stage four lymphoma which had spread to his lungs. Read more from Sky News:Man hijacks plane and stabs passengersTwo Britons among four killed in cable car crash Hodgkin lymphoma is a relatively aggressive type of cancer that can spread quickly through the body, according to the NHS. Rochdale, who face Altrincham on Friday, have confirmed that players will wear black armbands during the National League match."
    },
    {
        "title": "Police appeal to find dancing woman who was carried on car bonnet for 30 yards in Wembley hit-and-run crash",
        "description": "Police are appealing for help to find a woman who is believed to be injured after she was carried on a car bonnet for 30 yards in a hit-and-run crash.",
        "url": "https://news.sky.com/story/police-appeal-to-find-dancing-woman-who-was-carried-on-car-bonnet-for-30-yards-in-wembley-hit-and-run-crash-13351411",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wembley-london_6890335.jpg?20250418194558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 18:17:00",
        "Headline": "A woman has been arrested on suspicion of dangerous driving and driving while over the prescribed alcohol limit following the crash in Wembley.",
        "Content": " Police are appealing for help to find a woman who is believed to be injured after she was carried on a car bonnet for 30 yards in a hit-and-run crash. Footage filmed by a member of the public shows the woman dancing in the road in Engineers Way, near Wembley Arena, at around 11.10pm on Thursday. The Met Police has said the video shows her narrowly avoiding passing vehicles before a car drives into her and carries her for 30 yards, or 27m (90ft), before she is thrown to the floor.   The force added the car did not stop at the scene. Members of the public called an ambulance but the woman was no longer there when officers and paramedics arrived. Read more from Sky News:The gang war gripping two major citiesBritish nationals killed in Italy cable car crashUB40 says striking bin workers 'shouldn't give up' A 33-year-old woman was arrested on suspicion of dangerous driving and driving while over the prescribed alcohol limit. She has since been released on bail to a date in early June. Police are keen to speak to the woman who was hit by the vehicle to speak to her about the crash, make sure she is well and that she receives any appropriate medical attention. The area of Wembley was busy at the time as people had just left a concert by Jamaican dancehall artist Alkaline."
    },
    {
        "title": "British man, 27, dies after avalanche at French Alps ski resort",
        "description": "A British man has died after an avalanche at a ski resort in the French Alps, local officials say.",
        "url": "https://news.sky.com/story/british-man-27-dies-after-avalanche-at-french-alps-ski-resort-13351390",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-val-thorens-ski-resort_6890261.jpg?20250418184743",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 17:35:00",
        "Headline": "The man was pulled from the snow after the avalanche hit and given first aid by police officers, having gone into cardiac arrest.",
        "Content": "A British man has died after an avalanche at a ski resort in the French Alps, local officials say. The 27-year-old man died after being buried in snow at a ski resort and carried about 15m (49ft) by the avalanche's force, according to local prosecutor Benoit Bachelet. The incident occurred at Val Thorens ski resort in the Savoie region of southwest France, shortly after 10am on Thursday.   Mr Bachelet said nearby police officers were alerted to the incident by a witness, and the British man was pulled out of the snow. He added officers gave first aid to the man, who had entered cardiac arrest. Read more:Two British nationals among four killed after cable car crashed in ItalyMigrant dies trying to cross Channel in small boat He was taken to hospital in Grenoble, in the Auvergne-Rhone-Alpes region, where he died that evening, Mr Bachelet said. An investigation into the incident has been opened by the regional prosecutor's office. The prosecutor said the victim's family were being supported by local services. A Foreign Commonwealth and Development Office spokesperson said: \"We are supporting the family of a British man who died in France and are in contact with the local authorities.\""
    },
    {
        "title": "Essex Police: Senior officer sacked for sexual contact with woman while on duty",
        "description": "A senior police officer has been sacked after he had sexual contact with a woman while on duty.",
        "url": "https://news.sky.com/story/essex-police-senior-officer-sacked-for-sexual-contact-with-woman-while-on-duty-13351175",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-essex-essex-police_6889968.jpg?20250418161413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 14:45:00",
        "Headline": "The Independent Office for Police Conduct (IOPC) says Tom Simons, a chief superintendent, continued with his behaviour despite warnings.",
        "Content": "A senior police officer has been sacked after he had sexual contact with a woman while on duty. The police watchdog found Tom Simons, a chief superintendent with Essex Police, abused his position for a sexual purpose with two women - including by touching a colleague inappropriately and failing to disclose a relationship with one of them. The Independent Office for Police Conduct (IOPC) said he continued with his behaviour despite being reminded of the importance of maintaining professional boundaries. The case was first referred to the IOPC in March 2022 after multiple allegations, Essex Police said.  Mr Simons was suspended from duty and interviewed under criminal caution by the IOPC, which executed a search warrant of his house and checked his phone and other devices as part of an investigation. The case was referred to the Crown Prosecution Service (CPS) in January 2024 to consider charges relating to alleged sexual offences, coercive control and misconduct in public office, but it was decided he would not be charged with any criminal offences, the IOPC said. A disciplinary panel chaired by Bedfordshire Police's assistant chief constable found Mr Simons had committed gross misconduct and breached the police professional standards of behaviour. Mr Simons denies all the allegations. He was dismissed without notice after the misconduct hearing concluded this week. He will also be placed on the College of Policing barred list. IOPC director Emily Barry said she \"would like to praise the courage of the women\" who came forward. \"They faced pressure from him as a senior officer, but it's thanks to them that our investigation was able to gather the strong evidence that was put before the panel at the misconduct hearing, resulting in his dismissal,\" she added. \"He has deservedly lost his job and it's behaviour like this that damages the public's trust and confidence in police officers.\" Read more from Sky News:Former Rochdale footballer dies aged 36Two Britons among four killed in cable car crash Ben-Julian Harrington, chief constable of Essex, said there was \"simply no place in policing for people who think, wrongly, that they can get away with sexual misconduct\". \"I will be completely frank. This case is particularly disappointing given the seniority of the former officer,\" he added."
    },
    {
        "title": "Yellow weather warning comes into force for parts of UK",
        "description": "A yellow weather warning for rain has come into effect in parts of England, Wales and Northern Ireland, marking a damp start to the Easter bank holiday weekend.",
        "url": "https://news.sky.com/story/yellow-weather-warning-comes-into-force-for-parts-of-uk-13351447",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rain-a38-devon-plymouth_6887267.jpg?20250415124742",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-18 19:43:00",
        "Headline": "The wet period, during which up to 75mm of rain could fall, could mean difficult driving conditions, with some disruption to travel likely.",
        "Content": "A yellow weather warning for rain has come into effect in parts of England, Wales and Northern Ireland, marking a damp start to the Easter bank holiday weekend. The Met Office alert for a \"prolonged spell of rain\" will be in place until 9am on Saturday in southwest England and southeastern Wales, after being introduced at 6pm on Friday. The wet period, during which up to 75mm of rain could fall, may mean difficult driving conditions, with some disruption to travel likely, the Met Office said. Check the weather forecast near you  The forecaster has told residents in those regions that flooding of some homes and businesses is possible and that downpours may also be accompanied by \"windy\" conditions. The warning covers Bournemouth Christchurch and Poole, Cornwall, Devon, Dorset, Plymouth, Somerset and Torbay, along with southeastern Wales. The warning in Northern Ireland is for County Antrim and County Down, and will last until 3pm on Saturday. The Met Office suggests people ensure they are checking road conditions near them before travelling, on what is expected to be a busy bank holiday weekend. Mark Garratt, flood duty manager at the Environment Agency, said: \"Heavy rain and showers mean that minor surface water flooding is probable across parts of southwest England on Friday and into Saturday. \"Environment Agency teams will be out on the ground and supporting local authorities in responding to surface water flooding. \"We urge people not to drive through floodwater - it is often deeper than it looks and just 30cm of flowing water is enough to float your car.\" He added people could stay up to date with flood alerts on the government website. Read more:British man, 27, dies after avalanche at ski resortTwo Britons among four killed in cable car crash Met Office meteorologist Honor Criswick said it will be \"quite a wet start for many\" on Saturday but that the rain is expected to fizzle out over the morning before a \"largely dry\" Easter Sunday. \"There should be plenty of sunny spells around,\" she added. \"Good news if you're heading out for an Easter egg hunt.\" Plenty of bank holiday weekend travel expected Roughly 10.6 million British adults are planning to take a holiday in the UK over the bank holiday period, according to Tourism authority VisitEngland, while the travel trade organisation Abta said about 2.2 million Britons were heading overseas. Meanwhile, train passengers have been warned about disruption as Network Rail prepares to begin engineering work. It said it would carry out work on more than 300 projects across the UK between Good Friday and Bank Holiday Monday, causing a number of lines to be closed. The most significant impact will be at London Euston, which will have no services to or from Milton Keynes on Saturday and Easter Sunday, and a reduced timetable on Monday. You can keep up with the latest rail travel advice by using TfL's journey planner."
    },
    {
        "title": "Trump threatens to 'take a pass' on Ukraine peace talks",
        "description": "Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him.",
        "url": "https://news.sky.com/story/trump-threatens-to-take-a-pass-on-ukraine-peace-talks-13351475",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6890409.jpg?20250418224946",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 21:19:00",
        "Headline": "The US has suggested it could abandon its efforts to broker a permanent ceasefire within days, having seemingly grown frustrated by a lack of progress. Ukraine's Volodymyr Zelenskyy has said Vladimir Putin is not serious about ending the war.",
        "Content": " Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him. The US president's past confidence he could do a quick deal to end the conflict has proved to be misplaced, and now his administration has floated the prospect of abandoning its efforts to broker one. US threatens to abandon peace talks - latest updates Mr Trump's secretary of state, Marco Rubio, has said the White House is prepared to \"move on\", with little sign of fighting coming to an end some two months after talks began with Vladimir Putin. Negotiations have since taken place with both Kyiv and Moscow, the latter of which Mr Trump has been accused of being soft on, but the war has continued well beyond its three-year anniversary. Asked what it will take to secure a deal, Mr Trump told reporters at the White House he needed to see \"enthusiasm\" from both sides. \"I think I see it,\" he added. \"It's coming to a head right now.\" 'I know when people are playing us' Mr Trump dismissed the idea he was being played by Mr Putin, saying: \"Nobody is playing me. I'm trying to help.\" \"My whole life has been one big negotiation and I know when people are playing us and when they're not,\" he added. Nonetheless, Sky News' Moscow correspondent Ivor Bennett said the White House raising the spectre of walking away from peace talks showed Mr Trump was frustrated by the lack of progress. Before winning last November's presidential election, he infamously claimed he could end the war in a day. Echoing Mr Rubio, he's now said \"we're just going to take a pass\" if Russia or Ukraine \"makes it very difficult\". Kremlin spokesperson Dmitry Peskov insisted progress towards a deal had been made, but acknowledged the \"complicated\" situation was \"not an easy one\" to solve. A 30-day moratorium on striking energy infrastructure targets was previously agreed, but both sides have since accused one another of breaching it. Russia has also continued to launch deadly airstrikes on civilian infrastructure - the bloodiest of the more recent attacks saw at least 35 people killed in Sumy. Kyiv and its European allies have said the continued attacks show Russia is not serious about peace. Read more from Sky News:Godfather-style gang war grips ScotlandHow Israel's attack on aid workers unfolded  Looking ahead, Ukraine's Volodymyr Zelenskyy has indicated a \"memorandum of intent\" on a much vaunted US minerals deal could soon be signed. Mr Trump wants to profit from the country's natural resources in what he says is repayment for military aid. It's hoped America having a stake in the country could also help maintain any truce. The deal was due to be done weeks ago but was derailed by his falling out with Mr Trump at the White House. 👉 Follow Trump 100 on your podcast app 👈 More meetings are also expected among the so-called coalition of the willing, assembled by Sir Keir Starmer and Emmanuel Macron to help police any peace deal. Sir Keir spoke with Mr Trump on the phone on Saturday, with ending the Ukraine war a topic of conversation."
    },
    {
        "title": "Rubio's tough talk shows Trump's frustration - but there's only one loser if US walks away",
        "description": "Marco Rubio's comments are the strongest indication yet of Washington's apparent growing frustration at the lack of progress in peace talks.&#160;",
        "url": "https://news.sky.com/story/rubios-tough-talk-shows-trumps-frustration-but-theres-only-one-loser-if-us-walks-away-13351018",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-united-states-donald-trump_6889696.jpg?20250418103526",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-04-18 10:09:00",
        "Headline": "Two months since Donald Trump commenced peace talks, and with the war between Russia and Ukraine ongoing, what does his team have to show for it?",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n Marco Rubio's comments are the strongest indication yet of Washington's apparent growing frustration at the lack of progress in peace talks.  It's been two months since Donald Trump initiated negotiations, with a call to Vladimir Putin, in the hope of bringing the conflict to a swift conclusion. Since then, his team has sat down with both sides on multiple occasions, at multiple levels, in multiple locations. But what have they actually got to show for it? There was a much-touted 30-day ceasefire covering strikes on energy infrastructure, but it never formally began. And with both sides continuing to accuse the other of violating it, 30 days have now passed and the agreement seems to have disappeared without a trace. Then there was supposed to be a maritime ceasefire in the Black Sea. \n                  PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China\n                 \n                  Trump threatens to 'take a pass' on Ukraine peace talks\n                 \n                  Democrat senator Chris Van Hollen who met wrongly deported man Kilmar Abrego Garcia says photos of pair with margaritas are staged\n                 But again, that still hasn't actually materialised, because Russia says it will only take part if certain sanctions are lifted first. 👉 Follow Trump 100 on your podcast app 👈  It's highly doubtful Donald Trump really believed he could end the war within 24 hours of taking office (as he promised several times), but I think he did seriously believe he could secure at least a cessation of hostilities relatively quickly, giving him an early win in his presidency. There had been suggestions of an April/May deadline, or even an Easter ceasefire, but that now looks like pie in the sky. So is the threat to \"move on\" from the talks genuine? Or another famous negotiating tactic from the so-called master of the deal? Trump's approach has been heavily criticised for not being tough enough on Vladimir Putin. It's been all carrot for Moscow but only stick for Kyiv - and this latest intervention feels like it's more of the same. Because, as things stand, Ukraine still has a lot more to lose than Russia, if the war drags on. Read more:Zelenskyy hits out at US envoy over 'Russian narratives'Hollywood action hero sends 'big kiss' to Putin So, for now, I don't think Russia will be too concerned about Rubio's threat. That would, of course, change if the White House was also threatening to walk away from attempts to rebuild diplomatic relations with the Kremlin, but it does not sound like that is the case. It appears that Moscow has successfully managed to compartmentalise its rapprochement with Washington, to make it a separate issue from the war. It's so that even if the wider peace talks fail, Russia's bilateral bridges with the Trump administration will continue to strengthen."
    },
    {
        "title": "Democrat senator Chris Van Hollen who met wrongly deported man Kilmar Abrego Garcia says photos of pair with margaritas are staged",
        "description": "The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president. ",
        "url": "https://news.sky.com/story/democrat-senator-chris-van-hollen-who-met-wrongly-deported-man-kilmar-abrego-garcia-says-photos-of-pair-with-margaritas-are-staged-13351466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-van-hollen-kilmar-abrego-garcia_6890420.png?20250418235517",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 20:49:00",
        "Headline": "Chris Van Hollen adds that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison to a detention centre with better conditions.",
        "Content": " The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president.  Chris Van Hollen added that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison in El Salvador to a detention centre with better conditions. The deportation of Mr Garcia has become a flashpoint in the US, with Democrats casting it as a cruel consequence of Donald Trump's disregard for the courts, while Republicans have criticised Democrats for defending him and argued his deportation is part of a larger effort to reduce crime. Mr Garcia, a Salvadoran citizen who was living in Maryland, is being detained in the Central American country despite the US Supreme Court calling on the White House to facilitate his return home. Trump officials have said Mr Garcia has ties to the violent MS-13 gang. However, Mr Garcia's attorneys say the government has provided no evidence, and he has never been charged with any crime related to such activity. Mr Van Hollen flew to El Salvador and met with Mr Garcia this week in an effort to help secure his return to America. Speaking to reporters at Washington Dulles International airport after returning to the US on Friday, Mr Van Hollen said: \"As the federal courts have said, we need to bring Mr Abrego Garcia home to protect his constitutional rights to due process. And it's also important that people understand this case is not just about one man. \"It's about protecting the constitutional rights of everybody who resides in the United States of America.\" Mr Van Hollen added the Trump administration is \"asserting a right to stash away residents of this country\" in foreign prisons \"without the semblance of due process that is the foundation of our constitutional order\". News correspondent What began as the plight of a Salvadoran man wrongly deported from the US to a notorious high-security prison in El Salvador has become a much broader debate. The case of Kilmar Abrego Garcia now ranges from the extremely serious – questions over the rule of law, due process and a potential constitutional crisis – to the more curious matter of tequila-based cocktails. There is a public relations battle going on over the images which emerged of Mr Abrego Garcia meeting Maryland Senator Chris van Hollen at a hotel in San Salvador. In the first photos which were made public, on the social media account of El Salvador's President Nayib Bukele, an ally of Donald Trump, the two men had cocktail glasses in front of them which he said were margaritas. But when Senator van Hollen posted his account of the meeting, those glasses had vanished. So what's this all about, and why does it matter? The senator has now given his version of events, saying the glasses were placed there by an El Salvador government official to mock concerns about the conditions in the country's prison – a photo op aimed at shifting the narrative around Mr Abrego Garcia's detention in El Salvador. Mr van Hollen also revealed El Salvador officials initially wanted the meeting to take place next to a swimming pool, to give an even more tropical backdrop to the encounter. But at the end of the day, it's not just about images, it's not about public relations, it's not even about margaritas. It's about a 29-year-old father of three, detained in El Salvador, despite having never gone through due process in the US. The senator also revealed Mr Garcia was brought from a detention centre to his hotel after initial requests to meet or speak with him were denied. Mr Van Hollen said Mr Garcia told him he was \"traumatised\" after being detained at El Salvador's notorious CECOT prison, but he had been moved to a \"different facility\" with better conditions nine days ago. The senator said Mr Garcia told him he was worried about his family and that thinking about them was giving him \"the strength to persevere\" and to \"keep going\" under awful circumstances. Mr Garcia's wife, Jennifer, was at the news conference and wiped away tears as Mr Van Hollen spoke of her husband's desire to speak to her. Earlier, Mr Van Hollen had posted photos of himself meeting with Mr Garcia. It came before El Salvador's President Nayib Bukele shared his own images of the meeting, which he claimed showed the pair \"sipping margaritas\" in the \"tropical paradise of El Salvador\". In an apparent sarcastic remark, Mr Bukele wrote that Mr Garcia had \"miraculously risen\" from the \"death camps\". Giving an account of what he says happened when the photos were taken, Mr Van Hollen said: \"We just had glasses of water on the table. I think maybe some coffee. \"And as we were talking, one of the government people came over and deposited two other glasses on the table with ice. And I don't know if it was salt or sugar round the top, but they looked like margaritas. \"If you look at the one they put in front of Kilmer, it actually had a little less liquid than the one in me in front of me to try to make it look, I assume like he drank out of it. \"Let me just be very clear. Neither of us touched the drinks that were in front of us.\" He added that people can tell he is telling the truth because if someone had sipped from one of the glass there would be a \"gap\" where the \"salt or sugar\" had disappeared. Mr Van Hollen said the image shows the \"lengths\" the El Salvadorian president will go to \"deceive people about what's going on\". \"It also shows the lengths that the Trump administration and [President Trump] will go to, because when he was asked by a reporter about this, he just went along for the ride.\""
    },
    {
        "title": "At least 148 people die after boat catches fire in Congo",
        "description": "The number of people found dead after a boat accident in Congo has risen to 148, officials have said.",
        "url": "https://news.sky.com/story/at-least-148-people-die-after-boat-catches-fire-in-congo-13351462",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-congo-river_6890406.jpg?20250418222338",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 20:36:00",
        "Headline": "The fire started as a woman was cooking on board the boat, officials said, adding that children were among those who died after jumping in the water.",
        "Content": "The number of people found dead after a boat accident in Congo has risen to 148, officials have said. They say hundreds are still missing after a motorised wooden boat caught fire and capsized on Tuesday in the Congo River. The number of dead had previously been estimated at 50. On Friday, senator Jean-Paul Boketsu Bofili of Equateur province said 500 people were on board, adding: \"As we speak, more than 150 survivors suffering from third-degree burns are without humanitarian assistance.\" The fire started as a woman was cooking on board the boat, said Competent Loyoko, the river commissioner. Several passengers, including women and children, died after jumping into the water without being able to swim, officials said. About 100 survivors were taken to an improvised shelter at the local town hall, while those with burn injuries were taken to local hospitals. \n                  Trump threatens to 'take a pass' on Ukraine peace talks\n                 \n                  Rubio's tough talk shows Trump's frustration - but there's only one loser if US walks away\n                 \n                  Two hours of terror: Sky News investigation reveals how Israel's deadly attack on aid workers unfolded\n                 Read more:Dozens reportedly killed in US airstrikes against Houthi rebelsBritish man, 27, dies after avalanche at French Alps ski resort The boat, called HB Kongolo, caught fire near the northwestern town of Mbandaka, having left the port of Matankumu for the Bolomba territory. Deadly boat accidents are common in the central African country, where late-night travels and overcrowded vessels are often blamed and authorities have struggled to enforce maritime regulations. Hundreds have been killed in boat accidents in recent years as more people abandon the few available roads for wooden vessels packed with passengers and their goods. The country's rivers are a major means of transport for its more than 100 million people, especially in remote areas where infrastructure is poor."
    },
    {
        "title": "British man, 27, dies after avalanche at French Alps ski resort",
        "description": "A British man has died after an avalanche at a ski resort in the French Alps, local officials say.",
        "url": "https://news.sky.com/story/british-man-27-dies-after-avalanche-at-french-alps-ski-resort-13351390",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-val-thorens-ski-resort_6890261.jpg?20250418184743",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 17:35:00",
        "Headline": "The man was pulled from the snow after the avalanche hit and given first aid by police officers, having gone into cardiac arrest.",
        "Content": "A British man has died after an avalanche at a ski resort in the French Alps, local officials say. The 27-year-old man died after being buried in snow at a ski resort and carried about 15m (49ft) by the avalanche's force, according to local prosecutor Benoit Bachelet. The incident occurred at Val Thorens ski resort in the Savoie region of southwest France, shortly after 10am on Thursday.   Mr Bachelet said nearby police officers were alerted to the incident by a witness, and the British man was pulled out of the snow. He added officers gave first aid to the man, who had entered cardiac arrest. Read more:Two British nationals among four killed after cable car crashed in ItalyMigrant dies trying to cross Channel in small boat He was taken to hospital in Grenoble, in the Auvergne-Rhone-Alpes region, where he died that evening, Mr Bachelet said. An investigation into the incident has been opened by the regional prosecutor's office. The prosecutor said the victim's family were being supported by local services. A Foreign Commonwealth and Development Office spokesperson said: \"We are supporting the family of a British man who died in France and are in contact with the local authorities.\""
    },
    {
        "title": "Two British nationals among four killed after cable car crashed near Naples, Italian police say",
        "description": "Two Britons have been killed in a cable car crash near Naples, Italian police have said.",
        "url": "https://news.sky.com/story/two-british-nationals-among-four-killed-after-cable-car-crashed-near-naples-italian-police-say-13350957",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cable-car-naples-crash_6889623.jpg?20250418081254",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 06:44:00",
        "Headline": "Rescuers say there was only one survivor who is in a critical condition - nine passengers were helped out of a separate cable car that was stuck mid-air near the foot of the mountain.",
        "Content": " Two Britons have been killed in a cable car crash near Naples, Italian police have said. They were among four people - including an Israeli woman and an Italian man, the cable car operator - who died in the incident on Thursday, which officials said happened after the cable snapped. The only survivor, a second Israeli tourist, was in a stable but critical condition, the Naples hospital treating him said on Friday. Nine passengers were helped out of a separate cable car that was stuck mid-air near the foot of the mountain following the incident. They were freed one by one in a difficult operation using harnesses, footage on RAI television and other media showed. Italy's alpine rescue, along with firefighters, police and civil protection services, responded to the incident. It occurred just a week after the cable car, popular for its views of Mount Vesuvius and the Bay of Naples, reopened for the season. It averages around 110,000 visitors each year. Umberto De Gregorio, chairman of the EAV public transport company that runs the Mount Faito cable car, described the incident as \"a tragedy\" and said the service would remain shut \"for a long time\" following the crash. He told Sky News the cause of the incident was being investigated, and that before its reopening, the cable car service had undergone three months of tests with checks carried out every morning. \"Everything we had to do was done,\" he said. \"Evidently something went wrong, we don't know what, whether an exceptional unforeseen event or human error. The investigators will discover all this.\" He added: \"Furthermore, I knew very well one of the four victims, our employee. He is the brother of my driver - who is also my friend, since we lived together practically every day. \"I knew him and yesterday I saw his heartbroken wife, we hugged each other. There is so much emotion.\" Read more from Sky News:US ready to 'move on' from Russia-Ukraine peace effortsSky News uncovers new evidence on aid workers attackThe Godfather-style gang war gripping two cities The UK Foreign Office said: \"We are dealing with an incident in Italy and are in contact with the local authorities. Our thoughts are with those affected.\" Italian Prime Minister Giorgia Meloni expressed her condolences for the victims and their families and said she was in touch with rescuers. She spoke from Washington, where she was meeting US President Donald Trump."
    },
    {
        "title": "Ten thousand pages of Robert F Kennedy assassination records released",
        "description": "About 10,000 pages of records related to the assassination of Robert F Kennedy (RFK) nearly 60 years ago have been released publicly for the first time.",
        "url": "https://news.sky.com/story/ten-thousand-pages-of-robert-f-kennedy-assassination-records-released-13351223",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-robert-f-kennedy-rfk_6890112.jpg?20250418171903",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 16:00:00",
        "Headline": "The California senator was shot in 1968, five years after his brother John F Kennedy. His killer is still serving a life sentence behind bars, but conspiracy theories have persisted. ",
        "Content": "About 10,000 pages of records related to the assassination of Robert F Kennedy (RFK) nearly 60 years ago have been released publicly for the first time. The senator, who was the brother of US president John F Kennedy (JFK), was shot dead at the Ambassador Hotel in Los Angeles on 6 June 1968, moments after giving his victory speech for winning California's Democratic presidential primary. His assassin, Sirhan Sirhan, was convicted of first-degree murder and is serving life in prison. RFK's assassination, much like his brother's in 1963, has been the subject of much speculation.  His son, Robert F Kennedy Jr, previously said he believed his father was killed by multiple gunmen, an assertion that contradicts official accounts. After the documents were released on Friday, director of national intelligence Tulsi Gabbard said they would \"shine a long-overdue light on the truth\". Many files related to the senator's assassination had already been released, but the ones posted to the US National Archives and Records Administration on Friday had not been digitised and sat for decades in storage facilities maintained by the federal government. The move is a continuation of the release of historic withheld files ordered by US President Donald Trump, in an apparent bid to prove the transparency of his administration.  It started when he signed an executive order back in January for the release of thousands of files about JFK's assassination, many of which were made public in March. The files gave readers more details about the US's covert operations during the Cold War-era, but did not lend legitimacy to any of the many conspiracy theories surrounding the former president's death. Read more:Robert F Kennedy Jr: Who is Donald Trump's health chief?Trump teases date for 'even more important' second UK state visit RFK Jr, who is also Mr Trump's health secretary, commended the president and Ms Gabbard for their \"courage\" and \"dogged efforts\" to release the files. \"Lifting the veil on the RFK papers is a necessary step toward restoring trust in American government,\" he said in a statement. In a statement, Ms Gabbard said: \"Nearly 60 years after the tragic assassination of senator Robert F Kennedy, the American people will, for the first time, have the opportunity to review the federal government's investigation thanks to the leadership of president Trump.\" Lawyers for RFK's killer have been pushing for his release for decades, saying he is unlikely to reoffend or pose a danger to society. A parole board deemed Sirhan suitable for release in 2022, but California governor Gavin Newsom rejected the decision in 2022, keeping him in state prison. A different panel denied him release in 2023, saying he still lacked insight into what caused him to shoot RFK."
    },
    {
        "title": "Sean 'Diddy' Combs loses bid to delay sex-trafficking trial",
        "description": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months.",
        "url": "https://news.sky.com/story/sean-diddy-combs-loses-bid-to-delay-sex-trafficking-trial-13351324",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-sean-combs-2022-p-diddy_6754650.jpg?20241122162548",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-18 16:25:00",
        "Headline": "The rapper's lawyer had asked for more time to prepare his defence to two new charges which were brought in the case on 4 April.",
        "Content": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months. US district judge Arun Subramanian said the 55-year-old rapper made his request too close to his trial, which is due to start next month. Jury selection is currently scheduled for 5 May with opening statements set to be heard seven days later. Combs has pleaded not guilty to five criminal counts including racketeering and sex trafficking.  Prosecutors with the Manhattan US attorney's office accuse Combs of using his business empire to sexually abuse women between 2004 and 2024. Combs's lawyers say the sexual activity described by prosecutors was consensual. In a court filing on Wednesday, Combs's lawyer Marc Agnifilo asked Mr Subramanian to delay the trial because he needed more time to prepare his defence to two new charges which were brought on 4 April. The charges were of sex trafficking and transportation to engage in prostitution. Mr Agnifilo also said his team needs extra time to review emails it wants an alleged victim to turn over. The new allegations brought the total number of criminal charges against the rap mogul to five - following the three original counts, which also included racketeering conspiracy, filed in September. Federal prosecutors were opposed to any delay, writing in a Thursday court filing that the additional charges broughtearlier this month did not amount to substantially new conduct. They also said Combs was not entitled to the alleged victim's communications. Read more: Everything you need to know about the Sean Combs trial Meanwhile, Mr Subramanian is weighing other evidentiary issues, such as whether to allow alleged victims to testify under pseudonyms. Also known during his career as Puff Daddy and P Diddy, Combs founded Bad Boy Records and is credited with helping turn rappers and R&B singers such as Notorious B.I.G, Mary J. Blige, Faith Evans and Usher into stars in the 1990s and 2000s. But prosecutors have said his success concealed a dark side. They say his alleged abuse included having women take part in recorded sexual performances called \"freak-offs\" with male sex workers, who were sometimes transported across state lines. Combs has been in jail in Brooklyn since September, having been denied bail. He also faces dozens of civil lawsuits by women and men who have accused him of sexual abuse. Combs has strenuously denied all allegations of wrongdoing."
    },
    {
        "title": "Trump threatens to 'take a pass' on Ukraine peace talks",
        "description": "Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him.",
        "url": "https://news.sky.com/story/trump-threatens-to-take-a-pass-on-ukraine-peace-talks-13351475",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6890409.jpg?20250418224946",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 21:19:00",
        "Headline": "The US has suggested it could abandon its efforts to broker a permanent ceasefire within days, having seemingly grown frustrated by a lack of progress. Ukraine's Volodymyr Zelenskyy has said Vladimir Putin is not serious about ending the war.",
        "Content": " Donald Trump has threatened to \"take a pass\" on attempts to secure a peace agreement between Ukraine and Russia, as he denied the Kremlin was playing him. The US president's past confidence he could do a quick deal to end the conflict has proved to be misplaced, and now his administration has floated the prospect of abandoning its efforts to broker one. US threatens to abandon peace talks - latest updates Mr Trump's secretary of state, Marco Rubio, has said the White House is prepared to \"move on\", with little sign of fighting coming to an end some two months after talks began with Vladimir Putin. Negotiations have since taken place with both Kyiv and Moscow, the latter of which Mr Trump has been accused of being soft on, but the war has continued well beyond its three-year anniversary. Asked what it will take to secure a deal, Mr Trump told reporters at the White House he needed to see \"enthusiasm\" from both sides. \"I think I see it,\" he added. \"It's coming to a head right now.\" 'I know when people are playing us' Mr Trump dismissed the idea he was being played by Mr Putin, saying: \"Nobody is playing me. I'm trying to help.\" \"My whole life has been one big negotiation and I know when people are playing us and when they're not,\" he added. Nonetheless, Sky News' Moscow correspondent Ivor Bennett said the White House raising the spectre of walking away from peace talks showed Mr Trump was frustrated by the lack of progress. Before winning last November's presidential election, he infamously claimed he could end the war in a day. Echoing Mr Rubio, he's now said \"we're just going to take a pass\" if Russia or Ukraine \"makes it very difficult\". Kremlin spokesperson Dmitry Peskov insisted progress towards a deal had been made, but acknowledged the \"complicated\" situation was \"not an easy one\" to solve. A 30-day moratorium on striking energy infrastructure targets was previously agreed, but both sides have since accused one another of breaching it. Russia has also continued to launch deadly airstrikes on civilian infrastructure - the bloodiest of the more recent attacks saw at least 35 people killed in Sumy. Kyiv and its European allies have said the continued attacks show Russia is not serious about peace. Read more from Sky News:Godfather-style gang war grips ScotlandHow Israel's attack on aid workers unfolded  Looking ahead, Ukraine's Volodymyr Zelenskyy has indicated a \"memorandum of intent\" on a much vaunted US minerals deal could soon be signed. Mr Trump wants to profit from the country's natural resources in what he says is repayment for military aid. It's hoped America having a stake in the country could also help maintain any truce. The deal was due to be done weeks ago but was derailed by his falling out with Mr Trump at the White House. 👉 Follow Trump 100 on your podcast app 👈 More meetings are also expected among the so-called coalition of the willing, assembled by Sir Keir Starmer and Emmanuel Macron to help police any peace deal. Sir Keir spoke with Mr Trump on the phone on Saturday, with ending the Ukraine war a topic of conversation."
    },
    {
        "title": "Democrat senator Chris Van Hollen who met wrongly deported man Kilmar Abrego Garcia says photos of pair with margaritas are staged",
        "description": "The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president. ",
        "url": "https://news.sky.com/story/democrat-senator-chris-van-hollen-who-met-wrongly-deported-man-kilmar-abrego-garcia-says-photos-of-pair-with-margaritas-are-staged-13351466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-van-hollen-kilmar-abrego-garcia_6890420.png?20250418235517",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 20:49:00",
        "Headline": "Chris Van Hollen adds that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison to a detention centre with better conditions.",
        "Content": " The Democrat senator who flew to meet the man wrongly deported to El Salvador has said photos of them with margaritas were staged by officials working for the country's president.  Chris Van Hollen added that Kilmar Abrego Garcia, who was deported from the US last month, told him he has been moved from a notorious high-security prison in El Salvador to a detention centre with better conditions. The deportation of Mr Garcia has become a flashpoint in the US, with Democrats casting it as a cruel consequence of Donald Trump's disregard for the courts, while Republicans have criticised Democrats for defending him and argued his deportation is part of a larger effort to reduce crime. Mr Garcia, a Salvadoran citizen who was living in Maryland, is being detained in the Central American country despite the US Supreme Court calling on the White House to facilitate his return home. Trump officials have said Mr Garcia has ties to the violent MS-13 gang. However, Mr Garcia's attorneys say the government has provided no evidence, and he has never been charged with any crime related to such activity. Mr Van Hollen flew to El Salvador and met with Mr Garcia this week in an effort to help secure his return to America. Speaking to reporters at Washington Dulles International airport after returning to the US on Friday, Mr Van Hollen said: \"As the federal courts have said, we need to bring Mr Abrego Garcia home to protect his constitutional rights to due process. And it's also important that people understand this case is not just about one man. \"It's about protecting the constitutional rights of everybody who resides in the United States of America.\" Mr Van Hollen added the Trump administration is \"asserting a right to stash away residents of this country\" in foreign prisons \"without the semblance of due process that is the foundation of our constitutional order\". News correspondent What began as the plight of a Salvadoran man wrongly deported from the US to a notorious high-security prison in El Salvador has become a much broader debate. The case of Kilmar Abrego Garcia now ranges from the extremely serious – questions over the rule of law, due process and a potential constitutional crisis – to the more curious matter of tequila-based cocktails. There is a public relations battle going on over the images which emerged of Mr Abrego Garcia meeting Maryland Senator Chris van Hollen at a hotel in San Salvador. In the first photos which were made public, on the social media account of El Salvador's President Nayib Bukele, an ally of Donald Trump, the two men had cocktail glasses in front of them which he said were margaritas. But when Senator van Hollen posted his account of the meeting, those glasses had vanished. So what's this all about, and why does it matter? The senator has now given his version of events, saying the glasses were placed there by an El Salvador government official to mock concerns about the conditions in the country's prison – a photo op aimed at shifting the narrative around Mr Abrego Garcia's detention in El Salvador. Mr van Hollen also revealed El Salvador officials initially wanted the meeting to take place next to a swimming pool, to give an even more tropical backdrop to the encounter. But at the end of the day, it's not just about images, it's not about public relations, it's not even about margaritas. It's about a 29-year-old father of three, detained in El Salvador, despite having never gone through due process in the US. The senator also revealed Mr Garcia was brought from a detention centre to his hotel after initial requests to meet or speak with him were denied. Mr Van Hollen said Mr Garcia told him he was \"traumatised\" after being detained at El Salvador's notorious CECOT prison, but he had been moved to a \"different facility\" with better conditions nine days ago. The senator said Mr Garcia told him he was worried about his family and that thinking about them was giving him \"the strength to persevere\" and to \"keep going\" under awful circumstances. Mr Garcia's wife, Jennifer, was at the news conference and wiped away tears as Mr Van Hollen spoke of her husband's desire to speak to her. Earlier, Mr Van Hollen had posted photos of himself meeting with Mr Garcia. It came before El Salvador's President Nayib Bukele shared his own images of the meeting, which he claimed showed the pair \"sipping margaritas\" in the \"tropical paradise of El Salvador\". In an apparent sarcastic remark, Mr Bukele wrote that Mr Garcia had \"miraculously risen\" from the \"death camps\". Giving an account of what he says happened when the photos were taken, Mr Van Hollen said: \"We just had glasses of water on the table. I think maybe some coffee. \"And as we were talking, one of the government people came over and deposited two other glasses on the table with ice. And I don't know if it was salt or sugar round the top, but they looked like margaritas. \"If you look at the one they put in front of Kilmer, it actually had a little less liquid than the one in me in front of me to try to make it look, I assume like he drank out of it. \"Let me just be very clear. Neither of us touched the drinks that were in front of us.\" He added that people can tell he is telling the truth because if someone had sipped from one of the glass there would be a \"gap\" where the \"salt or sugar\" had disappeared. Mr Van Hollen said the image shows the \"lengths\" the El Salvadorian president will go to \"deceive people about what's going on\". \"It also shows the lengths that the Trump administration and [President Trump] will go to, because when he was asked by a reporter about this, he just went along for the ride.\""
    },
    {
        "title": "Sean 'Diddy' Combs loses bid to delay sex-trafficking trial",
        "description": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months.",
        "url": "https://news.sky.com/story/sean-diddy-combs-loses-bid-to-delay-sex-trafficking-trial-13351324",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-sean-combs-2022-p-diddy_6754650.jpg?20241122162548",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 16:25:00",
        "Headline": "The rapper's lawyer had asked for more time to prepare his defence to two new charges which were brought in the case on 4 April.",
        "Content": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months. US district judge Arun Subramanian said the 55-year-old rapper made his request too close to his trial, which is due to start next month. Jury selection is currently scheduled for 5 May with opening statements set to be heard seven days later. Combs has pleaded not guilty to five criminal counts including racketeering and sex trafficking.  Prosecutors with the Manhattan US attorney's office accuse Combs of using his business empire to sexually abuse women between 2004 and 2024. Combs's lawyers say the sexual activity described by prosecutors was consensual. In a court filing on Wednesday, Combs's lawyer Marc Agnifilo asked Mr Subramanian to delay the trial because he needed more time to prepare his defence to two new charges which were brought on 4 April. The charges were of sex trafficking and transportation to engage in prostitution. Mr Agnifilo also said his team needs extra time to review emails it wants an alleged victim to turn over. The new allegations brought the total number of criminal charges against the rap mogul to five - following the three original counts, which also included racketeering conspiracy, filed in September. Federal prosecutors were opposed to any delay, writing in a Thursday court filing that the additional charges broughtearlier this month did not amount to substantially new conduct. They also said Combs was not entitled to the alleged victim's communications. Read more: Everything you need to know about the Sean Combs trial Meanwhile, Mr Subramanian is weighing other evidentiary issues, such as whether to allow alleged victims to testify under pseudonyms. Also known during his career as Puff Daddy and P Diddy, Combs founded Bad Boy Records and is credited with helping turn rappers and R&B singers such as Notorious B.I.G, Mary J. Blige, Faith Evans and Usher into stars in the 1990s and 2000s. But prosecutors have said his success concealed a dark side. They say his alleged abuse included having women take part in recorded sexual performances called \"freak-offs\" with male sex workers, who were sometimes transported across state lines. Combs has been in jail in Brooklyn since September, having been denied bail. He also faces dozens of civil lawsuits by women and men who have accused him of sexual abuse. Combs has strenuously denied all allegations of wrongdoing."
    },
    {
        "title": "Ten thousand pages of Robert F Kennedy assassination records released",
        "description": "About 10,000 pages of records related to the assassination of Robert F Kennedy (RFK) nearly 60 years ago have been released publicly for the first time.",
        "url": "https://news.sky.com/story/ten-thousand-pages-of-robert-f-kennedy-assassination-records-released-13351223",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-robert-f-kennedy-rfk_6890112.jpg?20250418171903",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 16:00:00",
        "Headline": "The California senator was shot in 1968, five years after his brother John F Kennedy. His killer is still serving a life sentence behind bars, but conspiracy theories have persisted. ",
        "Content": "About 10,000 pages of records related to the assassination of Robert F Kennedy (RFK) nearly 60 years ago have been released publicly for the first time. The senator, who was the brother of US president John F Kennedy (JFK), was shot dead at the Ambassador Hotel in Los Angeles on 6 June 1968, moments after giving his victory speech for winning California's Democratic presidential primary. His assassin, Sirhan Sirhan, was convicted of first-degree murder and is serving life in prison. RFK's assassination, much like his brother's in 1963, has been the subject of much speculation.  His son, Robert F Kennedy Jr, previously said he believed his father was killed by multiple gunmen, an assertion that contradicts official accounts. After the documents were released on Friday, director of national intelligence Tulsi Gabbard said they would \"shine a long-overdue light on the truth\". Many files related to the senator's assassination had already been released, but the ones posted to the US National Archives and Records Administration on Friday had not been digitised and sat for decades in storage facilities maintained by the federal government. The move is a continuation of the release of historic withheld files ordered by US President Donald Trump, in an apparent bid to prove the transparency of his administration.  It started when he signed an executive order back in January for the release of thousands of files about JFK's assassination, many of which were made public in March. The files gave readers more details about the US's covert operations during the Cold War-era, but did not lend legitimacy to any of the many conspiracy theories surrounding the former president's death. Read more:Robert F Kennedy Jr: Who is Donald Trump's health chief?Trump teases date for 'even more important' second UK state visit RFK Jr, who is also Mr Trump's health secretary, commended the president and Ms Gabbard for their \"courage\" and \"dogged efforts\" to release the files. \"Lifting the veil on the RFK papers is a necessary step toward restoring trust in American government,\" he said in a statement. In a statement, Ms Gabbard said: \"Nearly 60 years after the tragic assassination of senator Robert F Kennedy, the American people will, for the first time, have the opportunity to review the federal government's investigation thanks to the leadership of president Trump.\" Lawyers for RFK's killer have been pushing for his release for decades, saying he is unlikely to reoffend or pose a danger to society. A parole board deemed Sirhan suitable for release in 2022, but California governor Gavin Newsom rejected the decision in 2022, keeping him in state prison. A different panel denied him release in 2023, saying he still lacked insight into what caused him to shoot RFK."
    },
    {
        "title": "Why a 'Trump-fest' could be just the tonic for a special relationship under strain",
        "description": "It was perhaps not quite how officials, in London at least, had envisaged the announcement of the state visit would be made.",
        "url": "https://news.sky.com/story/why-a-trump-fest-could-be-just-the-tonic-for-a-special-relationship-under-strain-13350916",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-president-trump-oval-office_6889466.jpg?20250417215342",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-04-18 02:32:00",
        "Headline": "September is a little earlier than had been expected for the state visit. It may be an advantage for it to happen sooner rather than later, given the profoundly consequential and controversial nature of the first few months of his second term.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  It was perhaps not quite how officials, in London at least, had envisaged the announcement of the state visit would be made. In the Oval Office, Donald Trump revealed the news in his own way. \"I was invited by the King and the great country. They are going to do a second fest - that's what it is. It is beautiful,\" he said during an impromptu Oval Office moment. The question was, did this \"fest\" - which Mr Trump suggested could happen in September - amount to the much hyped second state visit for the American president? Or was this actually just the smaller visit that had been offered two months ago as an initial bilateral visit at which the state visit would be discussed? Back in February, Sir Keir Starmer presented the president with a letter from King Charles and the offer of a state visit. The letter proposed an initial meeting between the King and the president to discuss details of the state visit at either Dumfries House or Balmoral, both in Scotland, close to Mr Trump's golf clubs. The King wrote: \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second state visit to the United Kingdom… As you will know this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content.\" As he revealed the news of his \"fest\" with his \"friend Charles\", Mr Trump said: \"I think they are setting a date for September…\" Sources have since confirmed to Sky News that it will amount to the full state visit. Read more from Sky News:Man hijacks plane and stabs passengers before being shot deadEvidence contradicts Israel's account of attack on aid workersGang war gripping major cities 'Even more important' It's possible the initial less formal presidential trip may still happen between now and September. Mr Trump is in Europe for the NATO summit in June and is due in Scotland to open a new golf course soon too. \"It is the second time it has happened to one person. The reason is we have two separate terms, and it's an honour to be a friend of King Charles and the family, William,\" the president said. \"I don't know how it can be bigger than the last one. The last one was incredible, but they say the next one will be even more important.\" His last state visit in 2019, at the invitation of the late Queen, drew significant protests epitomised by the giant blow-up \"Baby Trump\" which floated over Parliament Square. Britain's trump card September is a little earlier than had been expected for the visit. It may be an advantage for it to happen sooner rather than later, given the profoundly consequential and controversial nature of the first few months of his second term. The decision by the British government to play its \"state visit trump card\" up front back in February drew some criticism. And since February, Mr Trump's position on numerous issues has been increasingly at odds with all of America's allies. On Ukraine, he has seemingly aligned himself closely with Vladimir Putin. His tariffs have caused a global economic shock. And on issues like Greenland and Canada, a member of the Commonwealth, he has generated significant diplomatic shock. A risk worth taking Mr Trump is as divisive among the British public as he is in America. Sir Keir is already walking a political tightrope by choosing the softly softly approach with the White House. 👉 Follow Trump 100 on your podcast app 👈 The UK government chose not to retaliate against Mr Trump's tariffs, unlike some allies. Sir Keir and his cabinet have been at pains not to be seen to criticise the president in any way as they seek to influence him on Ukraine and seek an elusive economic deal on tariffs. On that tariff deal, despite some positive language from the US side and offers on the table, there has yet to be a breakthrough. A continuing challenge is engaging with the president for decisions and agreements only he, not his cabinet, will make. British officials acknowledge the risk the state visit poses. In this presidency, anything could happen between now and September. But they argue British soft power and Mr Trump's fondness for the Royal Family and pomp - or a \"fest\" as he calls it - amount to vital diplomatic clout. For a special relationship under strain, a special state visit is the tonic."
    },
    {
        "title": "US senator meets man at centre of El Salvador deportation row",
        "description": "A US senator has met with a man Donald Trump's administration wrongly deported to El Salvador.",
        "url": "https://news.sky.com/story/us-senator-meets-man-at-centre-of-el-salvador-deportation-row-13350915",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-van-hollen-kilmar-abrego-garcia_6889567.jpg?20250418044442",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 01:51:00",
        "Headline": "Kilmar Abrego Garcia's deportation has been a flashpoint in the US, with Democrats casting it as a cruel consequence of Donald Trump's disregard for the courts.",
        "Content": "A US senator has met with a man Donald Trump's administration wrongly deported to El Salvador. The Democratic senator for Maryland, Chris Van Hollen, posted photos of his meeting with Kilmar Abrego Garcia, whose attorneys are fighting to force Mr Trump's administration to facilitate his return to the US. He said: \"I said my main goal of this trip was to meet with Kilmar. Tonight I had that chance. \"I have called his wife, Jennifer, to pass along his message of love. I look forward to providing a full update upon my return.\" El Salvador's President Nayib Bukele also posted images of the meeting, adding in an apparently sarcastic remark: \"Kilmar Abrego Garcia, miraculously risen from the 'death camps' & 'torture', now sipping margaritas with Sen. Van Hollen in the tropical paradise of El Salvador!\" The meeting came hours after Mr Van Hollen said he was denied entry into a high-security prison in El Salvador while he was trying to check on Mr Garcia's well-being and advocate for his release - something the White House has called \"appalling\".  Mr Garcia's wife, Jennifer Vasquez Sura, said: \"My children and my prayers have been answered. \"The efforts of my family and community in fighting for justice are being heard, because I now know that my husband is alive. God is listening, and the community is standing strong. \"We still have so many questions, hopes, and fears. I will continue praying and fighting for Kilmars' return home.\" Read more from Sky News:Man hijacks plane and stabs passengers before being shot deadEvidence contradicts Israel's account of attack on aid workersGang war gripping major cities Both Mr Trump and Mr Bukele said earlier this week they have no basis to send Abreo Garcia back to the US, even though the Trump administration called his deportation an \"administrative error\" and the US Supreme Court has called on it to facilitate his return. Mr Trump's officials have said Mr Garcia, a Salvadoran citizen who was living in Maryland, has ties to the MS-13 gang. His attorneys say the government has provided no evidence, and he has never been charged with any crime related to such activity. Along with Mr Garcia, the Trump administration has deported hundreds of people, mostly Venezuelans, who it claims are gang members without presenting evidence and without a trial. 👉 Follow Trump 100 on your podcast app 👈 Mr Garcia's deportation has become a flashpoint in the US, with Democrats casting it as a cruel consequence of Mr Trump's disregard for the courts, while Republicans have criticised Democrats for defending him and argued his deportation is part of a larger effort to reduce crime."
    },
    {
        "title": "Luigi Mangione indicted on federal charges over UnitedHealthcare CEO Brian Thompson's death",
        "description": "Luigi Mangione has been indicted on federal charges over the death of UnitedHealthcare's CEO.",
        "url": "https://news.sky.com/story/luigi-mangione-indicted-on-federal-charges-over-unitedhealthcare-ceo-brian-thompsons-death-13350991",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-luigi-mangione-brian-thompson-shooting_6889680.jpg?20250418095052",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 08:07:00",
        "Headline": "Mr Thompson died in Manhattan, New York City, on 4 December last year.  Prosecutors allege Mangione, 26, targeted him in the shooting.",
        "Content": "Luigi Mangione has been indicted on federal charges over the death of UnitedHealthcare's CEO. Brian Thompson died in Manhattan, New York City, after an alleged shooting on 4 December last year. The 26-year-old has been charged with two counts of stalking, one count of murder through use of a firearm and a firearm offence for allegedly using a silencer. Mangione is accused of shooting Mr Thompson in the back as he walked to a conference. Officials allege that Mangione targeted Mr Thompson, who was the chief executive of the United States' largest private health insurance company. An extensive manhunt followed, with Mangione arrested in Pennsylvania on 9 December. Attorney General Pam Bondi has indicated prosecutors will seek the death penalty in the federal case. \n                  Luigi Mangione: US prosecutors directed to seek death penalty for man accused of killing healthcare boss\n                 \n                  Villain or hero? Everyone has thoughts on alleged healthcare CEO assassin Luigi Mangione - and it's not all negative\n                 \n                  Luigi Mangione: Suspect in US healthcare boss killing 'posted about back condition on Reddit for several years'\n                 Federal offences carry harsher penalties than state offences and are prosecuted by a different level of government. In an announcement, she said: \"I have directed federal prosecutors to seek the death penalty in this case as we carry out President Trump's agenda to stop violent crime and Make America Safe Again.\" But lawyers representing Mangione argue the death penalty is being sought as \"a political stunt\". Read more from Sky News:Man charged over police pursuit crash that injured officersTwo Britons among four killed in Naples cable car crash Mangione has also been charged in New York on state counts of first-degree murder in furtherance of terrorism, as well as two counts of second-degree murder. He is also charged with weapons counts and a count of using a forged instrument. He has pleaded not guilty in the state case."
    },
    {
        "title": "Day 89: Is the UK ready for a 'Trump-fest'?    ",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/day-89-is-the-uk-ready-for-a-trump-fest-13350922",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-trump-100_6869518.jpg?20250328141734",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-18 03:14:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   As Italian Prime Minister Giorgia Meloni visits the White House, Sky's US correspondents Mark Stone, Martha Kelner and James Matthews ask if her performance is worthy of the title \"Trump whisperer\".  Robert F Kennedy Jnr has sparked controversy over comments about people with autism - and there's been an unexpected twist in the controversial deportation of Kilmar Abrego Garcia, as he is temporarily released to meet Democrat Senator Chris Van Hollen. Plus, Donald Trump has confirmed his state visit to the UK will be in September, but why is he calling it a \"fest\"? If you've got a question you'd like Mark, Martha, and James to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel. "
    },
    {
        "title": "CMC chief Lord Cruddas in £40m raid on broker Winterflood",
        "description": "Lord Cruddas, the former Conservative Party treasurer, is plotting a &#163;40m raid on Winterflood, one of the City's best-known broking franchises, as its parent reels from the crisis engulfing the motor finance sector.",
        "url": "https://news.sky.com/story/cmc-chief-lord-cruddas-in-16340m-raid-on-broker-winterflood-13350966",
        "image_url": "https://e3.365dm.com/21/06/1920x1080/skynews-house-of-lords-lord-cruddas_5404521.jpg?20211113102720",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-18 07:04:00",
        "Headline": "London-listed CMC Markets is among the bidders circling the subsidiary of Close Brothers, which has been hit by the unfolding scandal in car finance, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lord Cruddas, the former Conservative Party treasurer, is plotting a £40m raid on Winterflood, one of the City's best-known broking franchises, as its parent reels from the crisis engulfing the motor finance sector. Sky News has learnt that CMC Markets, the online financial trading and investment group founded and run by Lord Cruddas, is among a number of parties which have held recent talks with Close Brothers Group about a possible acquisition of Winterflood. Close Brothers, which has set aside £165m for compensating customers who were mis-sold car loans, is said to be working with bankers at UBS on a potential sale of the broker. Founded in 1988 by Brian Winterflood with a team of nearly 40 brokers from County NatWest, the business was acquired by Close Brothers in 1993. Mr Winterflood, who died in 2023 aged 86, was dubbed the \"founding father\" of London's junior AIM stock market, having established its forerunner, the Unlisted Securities Market. Despite its prominence, Winterflood has struggled recently amid a tough trading environment. Last month, Close Brothers reported in its annual results that \"market conditions have remained unfavourable\" at Winterflood, posting a £0.8m loss for the unit in the six months to 31 January. \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                 \n                  Money: Toblerone axes popular flavour - fans aren't happy\n                 \n                  Sainsbury's profits top £1bn after closing all cafes and cutting 3,000 jobs\n                 Winterflood's trading income fell by 6% to £24m, which it said was partly the result of \"subdued investor confidence\" in AIM-listed stocks. \"With inflation and interest rates moderating, we anticipate a gradual improvement in investor confidence and trading activity,\" it added. The wider Close Brothers swung to a loss during the same period as a result of the motor finance provision, with the company disproportionately exposed to the crisis - which has gone all the way to the Supreme Court - among British banks. An acquisition of Winterflood by CMC would be a logical bolt-on deal for Lord Cruddas, who has diversified CMC Markets into a broader investment empire in recent years. CMC has a market valuation of just over £650m, with Lord Cruddas holding a majority stake in the company. It recently signed a partnership with Revolut, one of the world's most valuable digital banks, to offer customers trading services using its CMC Markets Connect technology. At one point, the Tory peer explored a break-up of CMC, but is no longer actively doing so. It was unclear on Friday how advanced the talks were between CMC and Close Brothers. People close to Close Brothers said it was not certain that it would offload Winterflood, and would only do so if it could secure an attractive valuation. Close Brothers has already sold its wealth management subsidiary, striking a £167m deal with funds managed by Oaktree Capital Management. Lord Cruddas is not the only possible suitor for Winterflood, with Peel Hunt, the London-listed mid-cap investment bank, also said to be interested in the idea of a deal. Peel Hunt is not thought to have held serious talks about a bid, and it was unclear on Friday how it would finance any deal if it progressed. On Thursday, shares in Close Brothers closed at 295.4p, giving it a market capitalisation of £445m. The stock has slumped by a third over the last year. CMC Markets and Close Brothers declined to comment."
    },
    {
        "title": "The Lib Dems want to be the nice guys of politics - but is that what voters want?",
        "description": "Lib Dems don't tend to listen to right-wing podcasts.",
        "url": "https://news.sky.com/story/the-lib-dems-want-to-be-the-nice-guys-of-politics-but-is-that-what-voters-want-13351478",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bideford-ed-davey_6888861.jpg?20250417105443",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-04-18 22:19:00",
        "Headline": "The pitch is clear: Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Lib Dems don't tend to listen to right-wing podcasts. But if they did, they may be heartened by some of what they hear. Take the interview Kemi Badenoch gave to the TRIGGERnometry show in February. Ten minutes into the episode, one of the hosts recounts a conversation with a Tory MP who said the party lost the last election to the Lib Dems because they went too far to the right. Everyone laughs. Then in March, in a conversation with the Canadian psychologist Jordan Peterson, the Tory leader was asked to describe a Liberal Democrat. \"Somebody who is good at fixing their church roof,\" said Ms Badenoch. She meant it as a negative. Lib Dems now mention it every time you go near any of them with a TV camera.  The pitch is clear, the stunts are naff At times, party figures seem somewhat astonished the Tories don't view them as more of a threat, given they were beaten by them in swathes of their traditional heartlands last year. Going forward, the pitch is clear. Sir Ed Davey wants to replace the Tories as the party of middle England. One way he's trying to do that is through somewhat naff and very much twee campaign stunts. To open this local election race, the Lib Dem leader straddled a hobbyhorse and galloped through a blue fence. More recently, he's brandished a sausage, hopped aboard a rollercoaster and planted wildflowers. Senior Lib Dems say they are \"constantly asking\" whether this is the correct strategy, especially given the hardship being faced by many in the country. They maintain it is helping get their message out though, according to the evidence they have. \"I think you can take the issues that matter to voters seriously while not taking yourself too seriously, and I also think it's a way of engaging people who are turned off by politics,\" said Sir Ed. 'What if people don't want grown-ups?' In that way, the Lib Dems are fishing in a similar pool of voters to Reform UK, albeit from the other side of the water's edge. Indeed, talk to Lib Dem MPs, and they say while some Reform supporters they meet would never vote for a party with the word \"liberal\" in its name, others are motivated more by generalised anger than any traditional political ideology. These people, the MPs say, can be persuaded. But this group also shows a broader risk to the Lib Dem approach. Put simply, are they simply too nice for the fractured times we live in? \"The Lib Dems want to be the grown-ups in the room,\" says Joe Twyman, director of Delta Poll. \"We like to think that the grown-ups in the room will be rewarded… but what if people don't want grown-ups in the room, what if people want kids shitting on the floor.\" A plan that looks different to the status quo The party's answer to this is that they are alive to the trap Lib Dems have walked into in the past of adopting a technocratic tone and blandly telling the public every issue is a \"bit more complicated\" than it seems. One senior figure says the Lib Dems are trying to do something quite unusual for a progressive centre-left party in making a broader emotional argument about why the public should pick them. This source says that approach runs through the stunts but also through the focus on care and the party leader's personal connection to the issue. Presenting a plan that looks different to the status quo is another way to try to stand apart. It's why there has been a focus on attacking Donald Trump and talking up the EU recently, two areas left unoccupied by the main parties.  The focus on local campaigning But beyond the national strategy, Lib Dems believe it's their local campaigning that really reaps rewards. In the run-up to the last election, several more regional press officers were recruited. Many stories pumped out by the media office now have a focus on data that can be broken down to a constituency level and given to local news outlets. Party sources say there has also been a concerted attempt to get away from the cliche of the Lib Dems constantly calling for parliament to be recalled. \"They beat us to it,\" said one staffer of the recent recall to debate British Steel.  'Gail's bakery rule' This focus on the local is helped by the fact many Lib Dem constituencies now look somewhat similar. That was evidenced by the apparent \"Gail's bakery rule\" last year, in which any constituency with a branch of the upmarket pastry purveyor had activists heaped on it. The similarities have helped the Lib Dems get away from another cliche - that of the somewhat opportunist targeting of different areas with very different messages. \"There is a certain consistency in where we won that helps explain that higher vote retention,\" said Lib Dem president Lord Pack. \"Look at leaflets in different constituencies [last year] and they were much more consistent than previous elections… the messages are fundamentally the same in a way that was not always the case in the past.\" A bottom-up campaign machine New MPs have also been tasked with demonstrating delivery and focusing doggedly on the issues that matter to their constituents. One Home Counties MP says he wants to be able to send out leaflets by 2027, saying \"everyone in this constituency knows someone who has been helped by their local Lib Dem\". In the run-up to last year's vote, strategists gave the example of the Lib Dem candidate who was invited to a local ribbon-cutting ceremony in place of the sitting Tory MP as proof of how the party can ingratiate itself into communities. With that in mind, the aim for these local elections is to pick up councillors in the places the party now has new MPs, allowing them to dig in further and keep building a bottom-up campaign machine. 'Anyone but Labour or Conservative' But what of the next general election? Senior Lib Dems are confident of holding their current 72 seats. They also point to the fact 20 of their 27 second-place finishes currently have a Conservative MP. Those will be the main focus, along with the 43 seats in which they finished third. There's also an acronym brewing to describe the approach - ABLOC or \"Anyone but Labour or Conservative\". 9% swing could make Sir Ed leader of the opposition The hope is for the political forces to align and Reform UK to continue splitting the Tory vote while unpopularity with the Labour government and Conservative opposition triggers some to jump ship. A recent pamphlet by Lord Pack showed if the Tories did not make progress against the other parties, just 25 gains from them by the Lib Dems - the equivalent of a 9% swing - would be enough to make Sir Ed leader of the opposition. What's more, a majority of these seats would be in the South East and South West, where the party has already picked up big wins. As for the overall aim of all this, Lord Pack is candid the Lib Dems shouldn't view a hung parliament as the best way to achieve the big prize of electoral reform because they almost always end badly for the smaller party. Instead, the Lib Dem president suggests the potential fragmentation of politics could bring electoral reform closer in a more natural way. \"What percentage share of the vote is the most popular party going to get at the next general election, it's quite plausible that that will be under 30%. Our political system can't cope with that sort of world,\" he said. Whether Ms Badenoch will still be laughing then remains to be seen. This is part of a series of local election previews with the five major parties. All five have been invited to take part."
    },
    {
        "title": "Why a 'Trump-fest' could be just the tonic for a special relationship under strain",
        "description": "It was perhaps not quite how officials, in London at least, had envisaged the announcement of the state visit would be made.",
        "url": "https://news.sky.com/story/why-a-trump-fest-could-be-just-the-tonic-for-a-special-relationship-under-strain-13350916",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-president-trump-oval-office_6889466.jpg?20250417215342",
        "type": "Politics",
        "Author": "Mark Stone",
        "Date Published": "2025-04-18 02:32:00",
        "Headline": "September is a little earlier than had been expected for the state visit. It may be an advantage for it to happen sooner rather than later, given the profoundly consequential and controversial nature of the first few months of his second term.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  It was perhaps not quite how officials, in London at least, had envisaged the announcement of the state visit would be made. In the Oval Office, Donald Trump revealed the news in his own way. \"I was invited by the King and the great country. They are going to do a second fest - that's what it is. It is beautiful,\" he said during an impromptu Oval Office moment. The question was, did this \"fest\" - which Mr Trump suggested could happen in September - amount to the much hyped second state visit for the American president? Or was this actually just the smaller visit that had been offered two months ago as an initial bilateral visit at which the state visit would be discussed? Back in February, Sir Keir Starmer presented the president with a letter from King Charles and the offer of a state visit. The letter proposed an initial meeting between the King and the president to discuss details of the state visit at either Dumfries House or Balmoral, both in Scotland, close to Mr Trump's golf clubs. The King wrote: \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second state visit to the United Kingdom… As you will know this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content.\" As he revealed the news of his \"fest\" with his \"friend Charles\", Mr Trump said: \"I think they are setting a date for September…\" Sources have since confirmed to Sky News that it will amount to the full state visit. Read more from Sky News:Man hijacks plane and stabs passengers before being shot deadEvidence contradicts Israel's account of attack on aid workersGang war gripping major cities 'Even more important' It's possible the initial less formal presidential trip may still happen between now and September. Mr Trump is in Europe for the NATO summit in June and is due in Scotland to open a new golf course soon too. \"It is the second time it has happened to one person. The reason is we have two separate terms, and it's an honour to be a friend of King Charles and the family, William,\" the president said. \"I don't know how it can be bigger than the last one. The last one was incredible, but they say the next one will be even more important.\" His last state visit in 2019, at the invitation of the late Queen, drew significant protests epitomised by the giant blow-up \"Baby Trump\" which floated over Parliament Square. Britain's trump card September is a little earlier than had been expected for the visit. It may be an advantage for it to happen sooner rather than later, given the profoundly consequential and controversial nature of the first few months of his second term. The decision by the British government to play its \"state visit trump card\" up front back in February drew some criticism. And since February, Mr Trump's position on numerous issues has been increasingly at odds with all of America's allies. On Ukraine, he has seemingly aligned himself closely with Vladimir Putin. His tariffs have caused a global economic shock. And on issues like Greenland and Canada, a member of the Commonwealth, he has generated significant diplomatic shock. A risk worth taking Mr Trump is as divisive among the British public as he is in America. Sir Keir is already walking a political tightrope by choosing the softly softly approach with the White House. 👉 Follow Trump 100 on your podcast app 👈 The UK government chose not to retaliate against Mr Trump's tariffs, unlike some allies. Sir Keir and his cabinet have been at pains not to be seen to criticise the president in any way as they seek to influence him on Ukraine and seek an elusive economic deal on tariffs. On that tariff deal, despite some positive language from the US side and offers on the table, there has yet to be a breakthrough. A continuing challenge is engaging with the president for decisions and agreements only he, not his cabinet, will make. British officials acknowledge the risk the state visit poses. In this presidency, anything could happen between now and September. But they argue British soft power and Mr Trump's fondness for the Royal Family and pomp - or a \"fest\" as he calls it - amount to vital diplomatic clout. For a special relationship under strain, a special state visit is the tonic."
    },
    {
        "title": "Pub hours extended for 80th VE Day celebrations in May",
        "description": "Pubs will be allowed to stay open for an extra two hours on VE Day next month to celebrate the 80th anniversary of the end of the Second World War in Europe.",
        "url": "https://news.sky.com/story/pub-hours-extended-for-80th-ve-day-celebrations-in-may-13351071",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-tea-party-ritz_6889785.jpg?20250418132234",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-18 12:00:00",
        "Headline": "Parties are planned for 8 May to mark eight decades since the Allies formally accepted Germany's unconditional surrender in Europe in the Second World War.",
        "Content": "Pubs will be allowed to stay open for an extra two hours on VE Day next month to celebrate the 80th anniversary of the end of the Second World War in Europe. The government said pub licensing hours will be relaxed on 8 May to raise a glass and celebrate those who served in the war. Pubs and bars across the UK will be able to keep serving until 1am after the two hour extension, which will mark the end of four days of celebrations. Parties are being planned for the day, 80 years after the Allies' formal acceptance of Germany's unconditional surrender, marking the end of all German military operations in Europe on 8 May 1945.  Sir Keir Starmer said: \"As we mark the 80th anniversary of VE Day, the whole country should come together to remember the incredible sacrifices made by the wartime generation and to celebrate the peace and freedom they secured for us all. \"Keeping our pubs open for longer will give people the opportunity to join in celebrations and raise a glass to all of the men and women who served their country, both overseas and at home.\" \n                  VE Day 2025: What are the four-day celebrations to mark 80th anniversary?\n                 \n                  VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned\n                 \n                  Plea to 'stop and reflect' on cost of war ahead of VE Day 80th anniversary\n                 Pub licensing hours can be relaxed by the home secretary to mark occasions of \"exceptional national significance\", with extensions previously approved for major royal celebrations and significant sporting events, such as the Euro 2024 final. VE Day, or Victory in Europe Day, commemorations will begin on the 5 May bank holiday Monday, when there will be a military procession from Whitehall to Buckingham Palace and an RAF flypast over London. On 8 May, when the pub hour extension will come in, there are parties planned across the UK, culminating in 10,000 members of the public attending a televised celebration on London's Horse Guards Parade, where performances by stars of the stage and screen will take place. There will also be a VE Day tea party on 8 May at the National Memorial Arboretum in Staffordshire, bringing together the largest gathering of Second World War veterans. Read more: What celebrations are planned for VE Day? The hospitality industry has welcomed the hours' extension, with Michael Kill, chief executive of the Night Time Industries Association, saying it will give pubs and bars \"a much-needed boost while paying tribute to our shared history\". Kate Nicholls, chief executive of UK Hospitality, said many people will be gathering in their local pubs to mark the special occasion and she is \"pleased\" the government is extending licensing hours."
    },
    {
        "title": "'Andrew Tate phenomena' surges in schools - with boys refusing to talk to female teacher",
        "description": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers.",
        "url": "https://news.sky.com/story/andrew-tate-phenomena-surges-in-schools-with-boys-refusing-to-talk-to-female-teacher-13351203",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-andrew-tate-romania_6887406.jpg?20250415145519",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-18 15:24:00",
        "Headline": "Online influencers such as Andrew Tate are fuelling an increase in sexism in the classroom, says a new survey from education union the NASUWT. It comes after the Netflix series Adolescence thrust concerns around incel culture into the spotlight. ",
        "Content": "Social media influencers are fuelling a rise in misogyny and sexism in the UK's classrooms, according to teachers. More than 5,800 teachers were polled as part of the survey by the NASUWT teaching union, and nearly three in five (59%) of teachers said they believe social media use has contributed to a deterioration in pupils' behaviour. The findings have been published during the union's annual conference, which is taking place in Liverpool this weekend. One motion that is set to be debated at the conference calls on the union's executive to work with teachers \"to assess the risk that far-right and populist movements pose to young people\". Andrew Tate was referenced by a number of teachers who took part in the survey, who said he had negative influence on male pupils. One teacher said she'd had 10-year-old boys \"refuse to speak to [her]...because [she is] a woman\". Another teacher said \"the Andrew Tate phenomena had a huge impact on how [pupils at an all-boys school] interacted with females and males they did not see as 'masculine'\". While another respondent to the survey said their school had experienced some incidents of \"derogatory language towards female staff...as a direct result of Andrew Tate videos\". 'Even adults can get dangerously addicted' Last month, Prime Minister Sir Keir Starmer hosted a discussion in Downing Street on how to prevent young boys from being dragged into a \"whirlpool of hatred and misogyny\". The talks were with the creators of Netflix drama Adolescence, which explored so-called incel culture. It comes as Tory leader Kemi Badenoch revealed her young cousin killed themselves after falling down an \"internet rabbit hole\" - and she worries \"a lot about social media\". She told the Daily Mail: \"It's heartbreaking. My views about the dangers of social media are not just about children. I know even as adults we can get dangerously addicted.\" The Conservatives have been arguing for a ban on mobile phones in schools over concerns about the impact of social media on children. Read more from Sky News:Former Rochdale footballer dies aged 36Two Britons among four killed in cable car crash  'An urgent need for action' Patrick Roach, the teaching union's general secretary, said teachers \"cannot be left alone to deal with these problems\". \"There is an urgent need for concerted action involving schools, colleges and other agencies to safeguard all children and young people from the dangerous influence of far-right populists and extremists,\" he added. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for the Department for Education (DfE) said: \"Education can be the antidote to hate, and the classroom should be a safe environment for sensitive topics to be discussed and where critical thinking is encouraged. \"That's why we provide a range of resources to support teachers to navigate these challenging issues, and why our curriculum review will look at the skills children need to thrive in a fast-changing online world.\""
    },
    {
        "title": "Sean 'Diddy' Combs loses bid to delay sex-trafficking trial",
        "description": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months.",
        "url": "https://news.sky.com/story/sean-diddy-combs-loses-bid-to-delay-sex-trafficking-trial-13351324",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-sean-combs-2022-p-diddy_6754650.jpg?20241122162548",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-18 16:25:00",
        "Headline": "The rapper's lawyer had asked for more time to prepare his defence to two new charges which were brought in the case on 4 April.",
        "Content": "Hip hop mogul Sean \"Diddy\" Combs has lost a bid to delay his upcoming sex-trafficking trial by two months. US district judge Arun Subramanian said the 55-year-old rapper made his request too close to his trial, which is due to start next month. Jury selection is currently scheduled for 5 May with opening statements set to be heard seven days later. Combs has pleaded not guilty to five criminal counts including racketeering and sex trafficking.  Prosecutors with the Manhattan US attorney's office accuse Combs of using his business empire to sexually abuse women between 2004 and 2024. Combs's lawyers say the sexual activity described by prosecutors was consensual. In a court filing on Wednesday, Combs's lawyer Marc Agnifilo asked Mr Subramanian to delay the trial because he needed more time to prepare his defence to two new charges which were brought on 4 April. The charges were of sex trafficking and transportation to engage in prostitution. Mr Agnifilo also said his team needs extra time to review emails it wants an alleged victim to turn over. The new allegations brought the total number of criminal charges against the rap mogul to five - following the three original counts, which also included racketeering conspiracy, filed in September. Federal prosecutors were opposed to any delay, writing in a Thursday court filing that the additional charges broughtearlier this month did not amount to substantially new conduct. They also said Combs was not entitled to the alleged victim's communications. Read more: Everything you need to know about the Sean Combs trial Meanwhile, Mr Subramanian is weighing other evidentiary issues, such as whether to allow alleged victims to testify under pseudonyms. Also known during his career as Puff Daddy and P Diddy, Combs founded Bad Boy Records and is credited with helping turn rappers and R&B singers such as Notorious B.I.G, Mary J. Blige, Faith Evans and Usher into stars in the 1990s and 2000s. But prosecutors have said his success concealed a dark side. They say his alleged abuse included having women take part in recorded sexual performances called \"freak-offs\" with male sex workers, who were sometimes transported across state lines. Combs has been in jail in Brooklyn since September, having been denied bail. He also faces dozens of civil lawsuits by women and men who have accused him of sexual abuse. Combs has strenuously denied all allegations of wrongdoing."
    },
    {
        "title": "Four-foot-long caiman found and seized by police at property in Essex",
        "description": "A four-foot-long caiman has been seized by police during a search of a property in Essex.",
        "url": "https://news.sky.com/story/four-foot-long-caiman-found-and-seized-by-police-at-property-in-essex-13351005",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-caiman-grays-essex_6889676.jpg?20250418094448",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-04-18 09:18:00",
        "Headline": "The reptile was among several items seized by police as two people were arrested on suspicion of drugs and weapons offences.",
        "Content": "A four-foot-long caiman has been seized by police during a search of a property in Essex. The reptile, which has now been handed over to the RSPCA, was found by officers executing a warrant at an address in Aveley, near Grays, on Thursday. A significant cannabis haul and several weapons, including knives, were also discovered and seized. Two people were arrested on suspicion of drugs and weapons offences, Essex Police said. A 36-year-old man, from Purfleet, was arrested on suspicion of production of cannabis, contravention of the dangerous wildlife act and possession of an offensive weapon. A woman, 35, was arrested for the same offences as well as on suspicion of possession with intent to supply drugs, the force said. Both have since been released under investigation. Read more from Sky News:Two Britons among four killed in Italy cable car crashSky News uncovers new evidence on aid workers attackThe Godfather-style gang war gripping two cities Inspector Dan Selby said: \"Drugs cause misery in our communities and we work hard to tackle their production and sale. \"We know this matters to the public and we value our neighbourhoods so these issues matter to us. \"We are also ensuring the welfare of the caiman and have left it in the hands of the RSPCA.\" Caimans are native to Central and South America and inhabit marshes, swamps, lakes, and mangrove rivers."
    }
]