[
    {
        "title": "Trump has tipped the Middle East into a massive war that could last weeks",
        "description": "Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran.",
        "url": "https://news.sky.com/story/trump-has-tipped-the-middle-east-into-a-massive-war-that-could-last-weeks-13513261",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lebanon-al-qatrani_7177350.jpg?20260228074503",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-28 10:12:00",
        "Headline": "The conflict started by the US president is  likely to have major repercussions for the world's economy, but there will be suspicion it's been motivated by his domestic woes.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran. His decision to attack and try and topple Iran's regime with the backing of Israel, tips the Middle East into a massive war that could last weeks. By the end of last week, the stage had been set for more diplomacy. Talks in Geneva had been making some progress and more were planned for Monday. Follow live updates here That appears to have been a ruse, to lull the enemy into thinking an attack was not imminent. Mr Trump has unleashed American military force without either the approval of the UN or the US Congress. There has been no pretence at securing even a fig leaf of justification under international law. \n                  Trump launches war against Iran\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 \n                  Politics are laced through the Epstein affair - and why listening to the victims is so vital\n                 He had been urged by allies in the region, apart from Israel, to avoid war. If it leads to the end of the ayatollahs' regime, there will be jubilation among them, but that is a very big if. Iran had warned it would take the gloves off if attacked and will most likely do just that, its leadership seeing this as a fight for survival. There are already reports of attacks on countries and installations across the Persian Gulf. It is a seaway through which a fifth of the world's oil passes, so a sustained conflict is likely to have major repercussions on the global economy. The American-Israeli offensive poses a dilemma for Britain. Prime Minister Sir Keir Starmer, worried about the implications under international law, has ruled out British bases being used to support the assault on Iran. There will be severe misgivings at the highest level of government here about the wisdom and legality of this unprecedented move by Britain's closest ally but there will also be a determination that it does not damage transatlantic relations. Read more:'Biggest gamble since Iraq invasion'Why regime change is the aim And there will be the suspicion that this has been motivated more by Donald Trump's deepening domestic woes than by sound military thinking. He faces an affordability crisis back home and continuing pressure over the Epstein scandal. This is a massive gamble by an American president whose popularity is plummeting. He has set the objective high, hoping to sufficiently damage Iran's regime so that its people can rise up and take over. Anything short of that may be seen as an expensive failure, which could prove very costly for Mr Trump in the run-up to this year's vital US mid-term elections."
    },
    {
        "title": "Big blasts heard over Dubai as people run for cover from Iranian missiles",
        "description": "The US and Israel have begun a war with the apparent aim of toppling Iran's regime - and we are beginning to learn the consequences.",
        "url": "https://news.sky.com/story/big-blasts-heard-over-dubai-as-people-run-for-cover-from-iranian-missiles-13513313",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dubai-fairmont-the-palm-hotel_7177751.png?20260228155847",
        "type": "Home",
        "Author": "Sally Lockwood, Sky correspondent, in Dubai",
        "Date Published": "2026-02-28 13:58:00",
        "Headline": "Around 240,000 British citizens live in the UAE. They've been advised to remain indoors, or in a safe place, and to stay away from windows.",
        "Content": "By Sally Lockwood, Sky correspondent, in Dubai  The US and Israel have begun a war with the apparent aim of toppling Iran's regime - and we are beginning to learn the consequences. There were threats and grave warnings of retaliation and regional conflict. American military assets in the region were described as legitimate targets. Iran has now acted on those warnings. Iran latest: follow here for updates In scenes few imagined possible, people were filmed running for shelter in Dubai as air raid sirens sounded. At least three big blasts have been heard over the city, witnesses told Reuters. A fire broke out near the entrance of Fairmont The Palm hotel in Dubai, after debris reportedly fell from the sky during an Iranian missile attack. Photos on social media and videos verified by Sky News showed a large blaze and smoke rising from outside the building. Dubai's media office said emergency response teams responded to an \"incident\" in a building in the Palm Jumeirah area. \n                  Iran latest: Supreme leader Ayatollah Khamenei killed, Iranian state media confirms\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 It said four people had been injured and were taken to medical facilities. It also said the fire was under control, as it urged the public to remain calm. Fairmont The Palm is described as a luxury hotel with gourmet dining options, an award-winning spa, and pools with city views. A series of explosions were also heard in Abu Dhabi, with the defence ministry confirming one person was killed by falling debris in a residential area after the UAE \"successfully\" intercepted Iranian missiles. In a statement, the nation's defence ministry \"affirmed its full readiness and preparedness to deal with any threats, stressing that all necessary measures are being taken to firmly confront any attempts to undermine the country's security and stability\". \"The kids are terrified\", one Abu Dhabi resident messaged me after the sound of explosions. This was followed by a second wave of missiles seen flying over the residential area of Dubai, where I live. The UAE's airspace is currently closed as a precautionary measure, according to the General Civil Aviation Authority. Multiple airlines have cancelled flights serving Abu Dhabi and Dubai; the latter is the world's busiest travel hub, and handled nearly 100 million ​passengers last year. If you look at Flight Radar, the airspace is empty in neighbouring countries too. Qatar, Jordan, Kuwait and Bahrain have all reported deploying air defences to shoot down incoming Iranian missiles. Flights have been turned around mid-air, and packed airliners bound for Qatar were turned around on the tarmac at Heathrow and returned to the terminal. The British Embassy in the UAE posted travel advice to British nationals: \"We are aware of missiles flying over the United Arab Emirates... British nationals are advised to shelter in place.\" The advice is to remain indoors or in a safe place and to stay away from windows. Around 240,000 British citizens live in the UAE. The sense of safety, one of the great draws for people living here, has been shattered today. Read more:Where has been hit? Iran retaliates after US-Israel strikesAyatollah Ali Khamenei: How powerful is Iran's supreme leader? The country is also home to an estimated half a million Iranian citizens, many of whom are full of fear and emotion today. We have no idea what this moment means for Iran or for the region. But people here are desperately hoping America knows what it's doing."
    },
    {
        "title": "One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights",
        "description": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack.",
        "url": "https://news.sky.com/story/uk-middle-east-flights-disrupted-as-dubai-and-doha-airports-suspend-services-13513380",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dubai-emirates-dubai-airport_7178106.jpg?20260228185559",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-28 15:51:00",
        "Headline": "Flights to and from the UAE, Qatar, Israel and Bahrain are among those cancelled as Trump's war with Iran sparks tourist safety fears.",
        "Content": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack. It comes as many flights in and out of the Middle East have been cancelled due to US missile attacks on Iran and subsequent counter strikes targeting American bases in the region. A post on X by Abu Dhabi Airports said the incident \"resulted in one fatality involving an Asian national and 7 injuries\" - but did not give a cause and urged against \"circulating rumours\". Iran latest: Supreme leader Ayatollah Khamenei is dead, Trump confirms The Dubai incident left four staff with injuries and happened when a concourse sustained \"minor damage\", according to the city's media office. Aviation sources told ​Reuters news agency one of the terminals had been damaged during ​an overnight Iranian attack. Flights from both airports were grounded on Saturday as a precaution. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger\n                 \n                  Trump launches war against Iran\n                 There was also a minor fire on the facade of the city's iconic sail-shaped Burj al Arab hotel due to a drone interception. \"Civil Defence teams responded immediately and brought the incident under control. No injuries have been reported,\" Dubai's media office added on X. Another luxury hotel in the city was also damaged by fire earlier on Saturday - again believed to have been caused by remnants from a falling missile. The UK Foreign Office (FCDO) has warned Britons in several Middle East countries to \"immediately shelter in place\" and to avoid travel to Israel and Palestine. \"Remain indoors in a secure location, avoid all travel and follow instructions from the local authorities,\" advised the FCDO. It said it was \"working around the clock\" to support British nationals affected. UK citizens are being urged to sign up to Register Your Presence and travel advice emails so the Foreign Office can send them information. Thousands of Britons are potentially stuck due to the temporary closure of airspace and airports in countries such as the UAE and Qatar. British Airways cancelled Saturday's Dubai, Doha, Amman and Abu Dhabi services, as well as flights to Tel Aviv and Bahrain up to 3 March. A BA flight from London to Doha, Qatar's capital, was among dozens forced to turn around or divert mid-flight early on Saturday, according to flight tracking websites. London Heathrow said \"a small number of flights\" had been cancelled or delayed. Its departures board on Saturday afternoon showed cancellations including an Emirates flight to Dubai, a Qatar Airways flight to Doha, and an Etihad service to Abu Dhabi. A Gatwick spokesperson said it was also \"expecting disruption to our Qatar and Emirates flights\". Manchester Airport departures showed a Saturday night Emirates flight to Dubai had been scrapped as it shared a post advising people to check with their airline. Wizz Air also confirmed flights between London Luton to Tel Aviv were suspended in both directions until 7 March but that \"operational decisions will continue to be reviewed\". Virgin Atlantic said journeys from destinations including India and the Maldives could take longer as the routes were being altered for safety reasons. Many other large airlines have also paused flights to the Middle East, as well as some routes flying over the region, including Delta, Lufthansa, Cathay Pacific and Turkish Airlines. India's airlines are also suffering serious disruption. Its aviation ministry said more than 400 flights by domestic carriers had been cancelled on Saturday and a similar number were expected on Sunday. Dubai airports at standstill The worst disruption is likely to be caused by the grounding of flights at Dubai's main airport, the world's busiest for international traffic. People jetting out for a winter break - and the thousands who change aircraft there - are set to have their plans upended after the UAE closed its airspace. All flights at Dubai's International, Dubai World Central (Al Maktoum) and Abu Dhabi's Zayed International have been suspended. At least 90,000 people transfer every day in Dubai, Doha or Abu Dhabi on just three airlines, Emirates, Qatar Airways and Etihad Airways, according to analytics firm Cirium. People in Dubai were earlier filmed running for shelter as air raid sirens sounded and witnesses told Reuters at least three big blasts were heard over the city. A fire broke out near the entrance of the five-star Fairmont The Palm hotel after debris reportedly fell from an Iranian missile. Read more:Big blasts heard over Dubai as people run for coverWhere has been hit by strikes and counter-strikes? A Dubai airports statement called the closures an \"exceptional precautionary measure\", while Emirates said safety was its \"highest priority\" as it halted flights. \"You have crews, planes and passengers stranded all over the world. It's a massive logistical nightmare,\" a Gulf airline source told Reuters. Qatar's international airport also suspended all services after the country's airspace was locked down in case of more attacks from Iran. People were earlier forced to run for cover as a missile - which was likely intercepted - tumbled out the sky and exploded in a residential area of Doha. America's largest regional air base, al Udeid, is near the city and Iran has deemed all US bases in the region as fair game."
    },
    {
        "title": "Where has been hit? Iran retaliates across Middle East after US-Israel strikes",
        "description": "Multiple locations in Iran have been targeted by joint US-Israel strikes, and Tehran has launched retaliatory missiles across the region. ",
        "url": "https://news.sky.com/story/where-has-been-hit-iran-retaliates-across-middle-east-after-us-israel-strikes-13513268",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-tehran_7177503.jpg?20260228121737",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-28 11:00:00",
        "Headline": "Iranian cities hit include Tehran, Isfahan, Tabriz, Kermanshah, and Qom, while retaliatory missiles have hit Bahrain, Kuwait, Qatar, and the UAE.",
        "Content": "Multiple locations in Iran have been targeted by joint US-Israel strikes, and Tehran has launched retaliatory missiles across the region.  The Iranian cities hit include Tehran, Isfahan, Tabriz, Kermanshah, and Qom, according to Telegram posts from the country's Revolutionary Guard Corps. Also targeted was the residence of Supreme Leader Ayatollah Ali Khamenei, as well as the nation's intelligence ministry, its defence ministry, and its Atomic Energy Organization, Sky News understands. Satellite imagery of the leader's compound, taken today, shows black smoke and extensive damage, with at least four buildings struck. An Iranian official said Khamenei was not there at the time. According to the Iranian Health Ministry, more than 60 students were killed and 80 more injured in another strike at a girls' school in Minab, a city in Hormozgan province. Iran latest: follow here for updates Now Iran has hit back, simultaneously striking four US bases across the Middle East. \n                  Trump launches war against Iran\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 These were Al Udeid Air Base in Qatar, Al Salem base in Kuwait, Al Dhafra Air Base in the United Arab Emirates, and the US Fifth Fleet base in Bahrain. The attack on the US Navy's Fifth Fleet centre was also reported by Bahraini state news agency BNA. Sky correspondent Sally Lockwood further reports that a loud explosion had been heard in Dubai. Footage from different locations across the city showed where missiles had been intercepted in the skies overhead. More video from social media showed a fire near the entrance of Dubai's Fairmont The Palm hotel, reportedly after debris fell from the sky during an Iranian missile attack. At least one person has been killed in the UAE. Another four were killed in Syria, when a missile struck a building in the south of the country, the state-owned SANA news agency reported. While in Kuwait, several employees at the nation's only commercial airport were injured by a drone, which also damaged Terminal 1, according to the country's Directorate General of Civil Aviation. There have been no reported American casualties, two officials told our US partner NBC News. The Revolutionary Guard said it considers \"all US bases, resources, and interests in the region to be legitimate targets\" for retaliation. Sky News' Europe correspondent Alistair Bunkall has warned that the Tehran regime \"will not roll over and will die fighting if needs be\". It comes after Donald Trump confirmed \"major combat operations\" against Iran in an eight-minute video on Truth Social. The US president also urged the Iranian people to rise up against the ruling regime, saying: \"When we are finished, take over your government, it will be yours to take\"."
    },
    {
        "title": "Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger",
        "description": "Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel.",
        "url": "https://news.sky.com/story/starmer-is-cautious-on-iran-because-he-knows-the-chaos-trumps-strikes-could-trigger-13513689",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sir-keir-starmer-prime-minister_7177656.jpg?20260228144444",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-28 22:36:00",
        "Headline": "The PM is under pressure from the right and left over the American attacks and leads a Labour party still haunted by the Iraq war.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel. He's under pressure from those on the left of British politics to condemn US President Donald Trump's actions as \"illegal\" and unjustified - while those on the right want to see him offer his open support. Military intervention in the Middle East is clearly a sensitive issue for a Labour party haunted by the Iraq war. While British planes are now in the sky to defend UK interests in the region, Starmer made it explicitly clear that such defensive activity is \"in line with international law\" - and that the UK wasn't involved in the American/Israeli attacks. Follow live: Iran's supreme leader 'killed in US attacks' - Trump Indeed, the PM is thought to have previously blocked the US from using UK bases - reportedly over concerns about breaching international law - despite Mr Trump making it very clear that he wanted to do so. In his televised statement, the prime minister was vehement in his condemnation of the \"utterly abhorrent\" Iranian regime, which has \"murdered thousands of [its] own people, brutally crushed dissent and sought to destabilize the region\", as well as posing \"a direct threat\" in the UK. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights\n                 \n                  Trump launches war against Iran\n                 While he didn't express any direct backing for Donald Trump's decision to strike Iran, he made it plain that he agreed with the rationale. Keir Starmer concluded by urging the Iranians to \"give up their weapons programmes and cease the appalling violence and repression\", although he stopped short of echoing the President's desire for regime change. The overall impression was of a UK government applauding the ends, but not necessarily the means. Not for the first time, the prime minister is balancing on a diplomatic tightrope in order to maintain a close relationship with the White House. He's always put the so-called special relationship at the very heart of his foreign policy - and doesn't want to risk antagonising Donald Trump (any more than he already has done recently, in refusing the use of British military bases and signing the Chagos deal with Mauritius). Now, alongside Turkey and Kuwait, the PM has been rewarded with a Trump phone call. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The details are sketchy; we're told they \"discussed the situation in the Middle East\" and the \"defensive operations\" being carried out by UK forces in the region\". It sounds brief, with no indication of any particular cordiality, but Downing Street will be relieved the call has happened. The Conservatives are accusing Starmer of sitting on the fence. But as a former human rights lawyer, Starmer has a live understanding of the legal and moral questions raised by these unilateral attacks. As a Labour leader, he's all too conscious of the unforeseen consequences of military intervention across the world - and the chaotic uncertainty engendered by a violent transfer of power. For now, he's decided the fence is the safest option."
    },
    {
        "title": "Brits 2026: Olivia Dean dominates awards, winning album of the year",
        "description": "Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year.",
        "url": "https://news.sky.com/story/brits-2026-olivia-dean-dominates-awards-winning-album-of-the-year-13513671",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-olivia-dean-brits_7178378.jpg?20260228231946",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-28 21:19:00",
        "Headline": "Olivia Dean took four awards at this year's Manchester ceremony, while Sam Fender claimed two and Lola Young was named breakthrough artist.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year. Last year, the 26-year-old Brit school graduate became the first British solo female artist to simultaneously top the UK Official Singles and Albums Chart since fellow Brit alumni Adele. Despite not winning in the publicly voted song of the year category for her song Man I Need, Dean did feature in Sam Fender's winning track, Rein Me In - meaning she received recognition in all four categories she was nominated for. She also performed her hit Man I Need. Following his Mercury Prize win last year, Fender also won best alternative/rock act for the second year running. Meanwhile, fellow Brit school graduate Lola Young won her first Brit in the breakthrough artist category, praising music as a \"safe haven\" for many in what she called a \"horrifyingly bleak\" and \"quite frankly, pretty scary\" world. Presented by Jack Whitehall, the show was opened by Harry Styles, along with a gospel choir and stage full of backing dancers, making his live TV performance debut of music from his forthcoming album Kiss All The Time. Disco, Occasionally. Rock band Wolf Alice took group of the year - the second time they've won the award - using their acceptance speech to urge support for the UK's small music venues and highlight Britain's contribution to music. \n                  Brit Awards fashion 2026 - all the best looks from the red carpet\n                 \n                  The Brit Awards 2026 as it happened: Noel thanks Liam, Olivia Dean cleans up, and tributes to Ozzy\n                 \n                  Brit Awards 2026: The full list of winners\n                 With Culture Secretary Lisa Nandy in attendance, it was a message that couldn't fail to reach its desired audience. Dave took best hip-hop/grime/rap act, while Fred again.., Skepta & PlaqueBoyMax's took best dance act. A night filled with performances amid the awards, other artists to sing on the stage were Wolf Alice, Alex Warren, Mark Ronson (with a previously unannounced appearance from Dua Lipa), Rosalia (with a surprise appearance from Icelandic singer Bjork), Sombr, Raye and KPop Demon Hunters stars Ejae, Audrey Nuna and Rei Ami. One of the year's defining releases, APT by Rose and Bruno Mars, took international song of the year - the second category to be voted for by the public. Rose made history, as the Brits first ever K-pop winner. Best international group went to Brooklyn band Geese, their first Brit award, using their moment in the spotlight to express their anti-ICE sentiments (the US Immigration and Customs Enforcement agency) as well as saying \"free Palestine,\" and \"RIP Mani\" in tribute to late Stone Roses bassist Gary Mounfield, who died last year. International artist of the year went to Spanish singer-songwriter Rosalia - who urged the audience to keep celebrating \"different music, different cultures, different languages\". The late Ozzy Osbourne was honoured with a lifetime achievement award, accepted by his wife and daughter, Sharon and Kelly Osbourne, to a standing ovation from the audience. Sharon described Ozzy as a \"true artist\" and \"the most humble egomaniac you could ever meet\". A tribute performance of No More Tears, led by Robbie Williams and featuring Metallica bassist Robert Trujillo, closed the show. Songwriter of the year and producer of the year had been announced ahead of the show, going to Noel Gallagher and Pink Pantheress, respectively. With her win, Pink Pantheress became the youngest person to ever win producer of the year, as well as the first woman. Mark Ronson, received the outstanding contribution to music award, paying tribute to Amy Winehouse in his speech, and celebrating her in his performance with extracts of Back To Black and Valerie. Meanwhile, Scottish singer-songwriter Jacob Alon won this year's Brits critics' choice award, and while he wasn't given his award in the televised ceremony, former critics choice winner Myles Smith gave him a shout-out on stage. This year, the Brits were held in Manchester for the first time, in the UK's largest entertainment arena, the recently opened Co-op Live arena."
    },
    {
        "title": "One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights",
        "description": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack.",
        "url": "https://news.sky.com/story/uk-middle-east-flights-disrupted-as-dubai-and-doha-airports-suspend-services-13513380",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dubai-emirates-dubai-airport_7178106.jpg?20260228185559",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-28 15:51:00",
        "Headline": "Flights to and from the UAE, Qatar, Israel and Bahrain are among those cancelled as Trump's war with Iran sparks tourist safety fears.",
        "Content": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack. It comes as many flights in and out of the Middle East have been cancelled due to US missile attacks on Iran and subsequent counter strikes targeting American bases in the region. A post on X by Abu Dhabi Airports said the incident \"resulted in one fatality involving an Asian national and 7 injuries\" - but did not give a cause and urged against \"circulating rumours\". Iran latest: Supreme leader Ayatollah Khamenei is dead, Trump confirms The Dubai incident left four staff with injuries and happened when a concourse sustained \"minor damage\", according to the city's media office. Aviation sources told ​Reuters news agency one of the terminals had been damaged during ​an overnight Iranian attack. Flights from both airports were grounded on Saturday as a precaution. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger\n                 \n                  Trump launches war against Iran\n                 There was also a minor fire on the facade of the city's iconic sail-shaped Burj al Arab hotel due to a drone interception. \"Civil Defence teams responded immediately and brought the incident under control. No injuries have been reported,\" Dubai's media office added on X. Another luxury hotel in the city was also damaged by fire earlier on Saturday - again believed to have been caused by remnants from a falling missile. The UK Foreign Office (FCDO) has warned Britons in several Middle East countries to \"immediately shelter in place\" and to avoid travel to Israel and Palestine. \"Remain indoors in a secure location, avoid all travel and follow instructions from the local authorities,\" advised the FCDO. It said it was \"working around the clock\" to support British nationals affected. UK citizens are being urged to sign up to Register Your Presence and travel advice emails so the Foreign Office can send them information. Thousands of Britons are potentially stuck due to the temporary closure of airspace and airports in countries such as the UAE and Qatar. British Airways cancelled Saturday's Dubai, Doha, Amman and Abu Dhabi services, as well as flights to Tel Aviv and Bahrain up to 3 March. A BA flight from London to Doha, Qatar's capital, was among dozens forced to turn around or divert mid-flight early on Saturday, according to flight tracking websites. London Heathrow said \"a small number of flights\" had been cancelled or delayed. Its departures board on Saturday afternoon showed cancellations including an Emirates flight to Dubai, a Qatar Airways flight to Doha, and an Etihad service to Abu Dhabi. A Gatwick spokesperson said it was also \"expecting disruption to our Qatar and Emirates flights\". Manchester Airport departures showed a Saturday night Emirates flight to Dubai had been scrapped as it shared a post advising people to check with their airline. Wizz Air also confirmed flights between London Luton to Tel Aviv were suspended in both directions until 7 March but that \"operational decisions will continue to be reviewed\". Virgin Atlantic said journeys from destinations including India and the Maldives could take longer as the routes were being altered for safety reasons. Many other large airlines have also paused flights to the Middle East, as well as some routes flying over the region, including Delta, Lufthansa, Cathay Pacific and Turkish Airlines. India's airlines are also suffering serious disruption. Its aviation ministry said more than 400 flights by domestic carriers had been cancelled on Saturday and a similar number were expected on Sunday. Dubai airports at standstill The worst disruption is likely to be caused by the grounding of flights at Dubai's main airport, the world's busiest for international traffic. People jetting out for a winter break - and the thousands who change aircraft there - are set to have their plans upended after the UAE closed its airspace. All flights at Dubai's International, Dubai World Central (Al Maktoum) and Abu Dhabi's Zayed International have been suspended. At least 90,000 people transfer every day in Dubai, Doha or Abu Dhabi on just three airlines, Emirates, Qatar Airways and Etihad Airways, according to analytics firm Cirium. People in Dubai were earlier filmed running for shelter as air raid sirens sounded and witnesses told Reuters at least three big blasts were heard over the city. A fire broke out near the entrance of the five-star Fairmont The Palm hotel after debris reportedly fell from an Iranian missile. Read more:Big blasts heard over Dubai as people run for coverWhere has been hit by strikes and counter-strikes? A Dubai airports statement called the closures an \"exceptional precautionary measure\", while Emirates said safety was its \"highest priority\" as it halted flights. \"You have crews, planes and passengers stranded all over the world. It's a massive logistical nightmare,\" a Gulf airline source told Reuters. Qatar's international airport also suspended all services after the country's airspace was locked down in case of more attacks from Iran. People were earlier forced to run for cover as a missile - which was likely intercepted - tumbled out the sky and exploded in a residential area of Doha. America's largest regional air base, al Udeid, is near the city and Iran has deemed all US bases in the region as fair game."
    },
    {
        "title": "Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger",
        "description": "Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel.",
        "url": "https://news.sky.com/story/starmer-is-cautious-on-iran-because-he-knows-the-chaos-trumps-strikes-could-trigger-13513689",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sir-keir-starmer-prime-minister_7177656.jpg?20260228144444",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-28 22:36:00",
        "Headline": "The PM is under pressure from the right and left over the American attacks and leads a Labour party still haunted by the Iraq war.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel. He's under pressure from those on the left of British politics to condemn US President Donald Trump's actions as \"illegal\" and unjustified - while those on the right want to see him offer his open support. Military intervention in the Middle East is clearly a sensitive issue for a Labour party haunted by the Iraq war. While British planes are now in the sky to defend UK interests in the region, Starmer made it explicitly clear that such defensive activity is \"in line with international law\" - and that the UK wasn't involved in the American/Israeli attacks. Follow live: Iran's supreme leader 'killed in US attacks' - Trump Indeed, the PM is thought to have previously blocked the US from using UK bases - reportedly over concerns about breaching international law - despite Mr Trump making it very clear that he wanted to do so. In his televised statement, the prime minister was vehement in his condemnation of the \"utterly abhorrent\" Iranian regime, which has \"murdered thousands of [its] own people, brutally crushed dissent and sought to destabilize the region\", as well as posing \"a direct threat\" in the UK. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights\n                 \n                  Trump launches war against Iran\n                 While he didn't express any direct backing for Donald Trump's decision to strike Iran, he made it plain that he agreed with the rationale. Keir Starmer concluded by urging the Iranians to \"give up their weapons programmes and cease the appalling violence and repression\", although he stopped short of echoing the President's desire for regime change. The overall impression was of a UK government applauding the ends, but not necessarily the means. Not for the first time, the prime minister is balancing on a diplomatic tightrope in order to maintain a close relationship with the White House. He's always put the so-called special relationship at the very heart of his foreign policy - and doesn't want to risk antagonising Donald Trump (any more than he already has done recently, in refusing the use of British military bases and signing the Chagos deal with Mauritius). Now, alongside Turkey and Kuwait, the PM has been rewarded with a Trump phone call. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The details are sketchy; we're told they \"discussed the situation in the Middle East\" and the \"defensive operations\" being carried out by UK forces in the region\". It sounds brief, with no indication of any particular cordiality, but Downing Street will be relieved the call has happened. The Conservatives are accusing Starmer of sitting on the fence. But as a former human rights lawyer, Starmer has a live understanding of the legal and moral questions raised by these unilateral attacks. As a Labour leader, he's all too conscious of the unforeseen consequences of military intervention across the world - and the chaotic uncertainty engendered by a violent transfer of power. For now, he's decided the fence is the safest option."
    },
    {
        "title": "Brits 2026: Olivia Dean dominates awards, winning album of the year",
        "description": "Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year.",
        "url": "https://news.sky.com/story/brits-2026-olivia-dean-dominates-awards-winning-album-of-the-year-13513671",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-olivia-dean-brits_7178378.jpg?20260228231946",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-28 21:19:00",
        "Headline": "Olivia Dean took four awards at this year's Manchester ceremony, while Sam Fender claimed two and Lola Young was named breakthrough artist.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year. Last year, the 26-year-old Brit school graduate became the first British solo female artist to simultaneously top the UK Official Singles and Albums Chart since fellow Brit alumni Adele. Despite not winning in the publicly voted song of the year category for her song Man I Need, Dean did feature in Sam Fender's winning track, Rein Me In - meaning she received recognition in all four categories she was nominated for. She also performed her hit Man I Need. Following his Mercury Prize win last year, Fender also won best alternative/rock act for the second year running. Meanwhile, fellow Brit school graduate Lola Young won her first Brit in the breakthrough artist category, praising music as a \"safe haven\" for many in what she called a \"horrifyingly bleak\" and \"quite frankly, pretty scary\" world. Presented by Jack Whitehall, the show was opened by Harry Styles, along with a gospel choir and stage full of backing dancers, making his live TV performance debut of music from his forthcoming album Kiss All The Time. Disco, Occasionally. Rock band Wolf Alice took group of the year - the second time they've won the award - using their acceptance speech to urge support for the UK's small music venues and highlight Britain's contribution to music. \n                  Brit Awards fashion 2026 - all the best looks from the red carpet\n                 \n                  The Brit Awards 2026 as it happened: Noel thanks Liam, Olivia Dean cleans up, and tributes to Ozzy\n                 \n                  Brit Awards 2026: The full list of winners\n                 With Culture Secretary Lisa Nandy in attendance, it was a message that couldn't fail to reach its desired audience. Dave took best hip-hop/grime/rap act, while Fred again.., Skepta & PlaqueBoyMax's took best dance act. A night filled with performances amid the awards, other artists to sing on the stage were Wolf Alice, Alex Warren, Mark Ronson (with a previously unannounced appearance from Dua Lipa), Rosalia (with a surprise appearance from Icelandic singer Bjork), Sombr, Raye and KPop Demon Hunters stars Ejae, Audrey Nuna and Rei Ami. One of the year's defining releases, APT by Rose and Bruno Mars, took international song of the year - the second category to be voted for by the public. Rose made history, as the Brits first ever K-pop winner. Best international group went to Brooklyn band Geese, their first Brit award, using their moment in the spotlight to express their anti-ICE sentiments (the US Immigration and Customs Enforcement agency) as well as saying \"free Palestine,\" and \"RIP Mani\" in tribute to late Stone Roses bassist Gary Mounfield, who died last year. International artist of the year went to Spanish singer-songwriter Rosalia - who urged the audience to keep celebrating \"different music, different cultures, different languages\". The late Ozzy Osbourne was honoured with a lifetime achievement award, accepted by his wife and daughter, Sharon and Kelly Osbourne, to a standing ovation from the audience. Sharon described Ozzy as a \"true artist\" and \"the most humble egomaniac you could ever meet\". A tribute performance of No More Tears, led by Robbie Williams and featuring Metallica bassist Robert Trujillo, closed the show. Songwriter of the year and producer of the year had been announced ahead of the show, going to Noel Gallagher and Pink Pantheress, respectively. With her win, Pink Pantheress became the youngest person to ever win producer of the year, as well as the first woman. Mark Ronson, received the outstanding contribution to music award, paying tribute to Amy Winehouse in his speech, and celebrating her in his performance with extracts of Back To Black and Valerie. Meanwhile, Scottish singer-songwriter Jacob Alon won this year's Brits critics' choice award, and while he wasn't given his award in the televised ceremony, former critics choice winner Myles Smith gave him a shout-out on stage. This year, the Brits were held in Manchester for the first time, in the UK's largest entertainment arena, the recently opened Co-op Live arena."
    },
    {
        "title": "Back my asylum overhaul or risk Trump inspired ICE-style raids, warns Mahmood",
        "description": "Shabana Mahmood is set to introduce new legislation to overhaul the UK's asylum system as part a tougher approach to migration.",
        "url": "https://news.sky.com/story/back-my-asylum-overhaul-or-risk-trump-inspired-ice-style-raids-warns-mahmood-13513195",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-home-secretary_7145110.jpg?20260125105053",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-28 02:33:00",
        "Headline": "The home secretary invokes the spectre of a US inspired \"far-right\" immigration crackdown as she tries to win Labour support for tougher asylum laws.",
        "Content": "Shabana Mahmood is set to introduce new legislation to overhaul the UK's asylum system as part a tougher approach to migration. The home secretary will say the generosity of the British asylum system is attracting people from across the world, funding human traffickers and encouraging false asylum claims, according to a government source, She is also expected to say the government must cut migration, or risk opening the door to the right, which would divide communities with the kind of ICE-style anti-immigration raids seen in the US. It is hoped her plans could help to blunt the appeal of Reform UK. But they are also likely to bring criticism from within Labour, as fall-out from party losing a safe seat to the Greens, as it came third in this week's Gorton and Denton by-election. Ms Mahmood's name and immigration policy was being highlighted as the blame game began in the aftermath of Labour's defeat in the Manchester contest. The Times has reported up to 40 Labour MPs are expected to oppose her plans, believing they are punitive and morally wrong. But Ms Mahmood told The Telegraph that Labour could not ignore the issue. \"The levels of illegal migration are putting immense strain on our country, and our public services - creating division within communities across the country,\" the home secretary said. \"Illegal migration is undermining the contract between government and its citizens - eroding support for the asylum system entirely.\" Her new strategy comes after a visit to Denmark, which has one of the toughest asylum and immigration systems in Europe. The home secretary is a long-term admirer of the model. Read more on Sky NewsHow the UK and Denmark's immigration policies compareBritain's immigration system changes explained Denmark's tough stance on asylum seekers began in the mid-2010s, when prime minister Mette Frederiksen was in opposition. Her party, the Social Democrats, moved to make protection for asylum seekers temporary, also arguing that uncontrolled immigration was placing huge pressure on working-class communities. Since coming into office, Ms Frederiksen's government has reduced the number of asylum applications to its lowest number in 40 years and removed 95 percent of rejected asylum seekers. Denmark's system also looks to deter new arrivals by largely moving to a temporary stay model, where most asylum seekers are sent back to their home country once they are deemed safe. Ms Mahmood was taken to a reception centre on the outskirts of Copenhagen, where asylum seekers are taken by police to stay on a short-term basis, are given health checks, and have their biometrics taken. She was then taken to a returns centre, where migrants go before being sent back to their country of origin, which included communal canteens, outdoor exercise machines, and accommodation, which included plain rooms furnished with lockers and small single beds or bunkbeds. A Labour source told The Telegraph the party and its values will be in jeopardy without bold action on migration, but adds that Mahmood's vision sets a path that sits between both Reform UK and the Greens. \"It is a vision that is fair, but firm, compassionate, but controlled, and one that promotes and rewards those who want to contribute to our national life. \"The alternative is the far-right raising the drawbridge and bringing havoc and chaos to Britain's streets with ICE-style raids dividing our communities. \"The alternative under Zack Polanski is open borders, fuelling the trade in human trafficking and placing huge strain on communities and public services. Both seek to promote and profit from division within our communities.\""
    },
    {
        "title": "Man charged over graffiti on Sir Winston Churchill statue in Parliament Square",
        "description": "A man has been charged after a statue of Sir Winston Churchill was defaced with graffiti.",
        "url": "https://news.sky.com/story/man-charged-over-graffiti-on-sir-winston-churchill-statue-in-parliament-square-13513201",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winston-churchill-statue_7176507.jpg?20260227083435",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-28 06:43:00",
        "Headline": "Words including \"Zionist war criminal\", \"Stop the Genocide\" and \"Free Palestine\" were sprayed in red paint on the bronze statue in Westminster in the early hours of Friday.",
        "Content": "A man has been charged after a statue of Sir Winston Churchill was defaced with graffiti. Words including \"Zionist war criminal\", \"Stop the Genocide\" and \"Free Palestine\" were sprayed in red paint on the bronze statue in Parliament Square in Westminster in the early hours of Friday. Caspar San Giorgio, 38, of no fixed address, was arrested shortly after 4am on Friday, police said. He was taken into custody and charged at 3.50am on Saturday. He was remanded and is due to appear at Highbury Corner Magistrates' Court. San Giorgio was also arrested on suspicion of supporting Palestine Action, which is a proscribed organisation, under the Terrorism Act, the Metropolitan Police said on Friday. The statue was cordoned off and work to clean it began on Friday. Further graffiti read \"Never again is Now\" and \"Globalise the Intifada\"."
    },
    {
        "title": "Trump has tipped the Middle East into a massive war that could last weeks",
        "description": "Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran.",
        "url": "https://news.sky.com/story/trump-has-tipped-the-middle-east-into-a-massive-war-that-could-last-weeks-13513261",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lebanon-al-qatrani_7177350.jpg?20260228074503",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-28 10:12:00",
        "Headline": "The conflict started by the US president is  likely to have major repercussions for the world's economy, but there will be suspicion it's been motivated by his domestic woes.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran. His decision to attack and try and topple Iran's regime with the backing of Israel, tips the Middle East into a massive war that could last weeks. By the end of last week, the stage had been set for more diplomacy. Talks in Geneva had been making some progress and more were planned for Monday. Follow live updates here That appears to have been a ruse, to lull the enemy into thinking an attack was not imminent. Mr Trump has unleashed American military force without either the approval of the UN or the US Congress. There has been no pretence at securing even a fig leaf of justification under international law. \n                  Trump launches war against Iran\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 \n                  Politics are laced through the Epstein affair - and why listening to the victims is so vital\n                 He had been urged by allies in the region, apart from Israel, to avoid war. If it leads to the end of the ayatollahs' regime, there will be jubilation among them, but that is a very big if. Iran had warned it would take the gloves off if attacked and will most likely do just that, its leadership seeing this as a fight for survival. There are already reports of attacks on countries and installations across the Persian Gulf. It is a seaway through which a fifth of the world's oil passes, so a sustained conflict is likely to have major repercussions on the global economy. The American-Israeli offensive poses a dilemma for Britain. Prime Minister Sir Keir Starmer, worried about the implications under international law, has ruled out British bases being used to support the assault on Iran. There will be severe misgivings at the highest level of government here about the wisdom and legality of this unprecedented move by Britain's closest ally but there will also be a determination that it does not damage transatlantic relations. Read more:'Biggest gamble since Iraq invasion'Why regime change is the aim And there will be the suspicion that this has been motivated more by Donald Trump's deepening domestic woes than by sound military thinking. He faces an affordability crisis back home and continuing pressure over the Epstein scandal. This is a massive gamble by an American president whose popularity is plummeting. He has set the objective high, hoping to sufficiently damage Iran's regime so that its people can rise up and take over. Anything short of that may be seen as an expensive failure, which could prove very costly for Mr Trump in the run-up to this year's vital US mid-term elections."
    },
    {
        "title": "Big blasts heard over Dubai as people run for cover from Iranian missiles",
        "description": "The US and Israel have begun a war with the apparent aim of toppling Iran's regime - and we are beginning to learn the consequences.",
        "url": "https://news.sky.com/story/big-blasts-heard-over-dubai-as-people-run-for-cover-from-iranian-missiles-13513313",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dubai-fairmont-the-palm-hotel_7177751.png?20260228155847",
        "type": "World",
        "Author": "Sally Lockwood, Sky correspondent, in Dubai",
        "Date Published": "2026-02-28 13:58:00",
        "Headline": "Around 240,000 British citizens live in the UAE. They've been advised to remain indoors, or in a safe place, and to stay away from windows.",
        "Content": "By Sally Lockwood, Sky correspondent, in Dubai  The US and Israel have begun a war with the apparent aim of toppling Iran's regime - and we are beginning to learn the consequences. There were threats and grave warnings of retaliation and regional conflict. American military assets in the region were described as legitimate targets. Iran has now acted on those warnings. Iran latest: follow here for updates In scenes few imagined possible, people were filmed running for shelter in Dubai as air raid sirens sounded. At least three big blasts have been heard over the city, witnesses told Reuters. A fire broke out near the entrance of Fairmont The Palm hotel in Dubai, after debris reportedly fell from the sky during an Iranian missile attack. Photos on social media and videos verified by Sky News showed a large blaze and smoke rising from outside the building. Dubai's media office said emergency response teams responded to an \"incident\" in a building in the Palm Jumeirah area. \n                  Iran latest: Supreme leader Ayatollah Khamenei killed, Iranian state media confirms\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 It said four people had been injured and were taken to medical facilities. It also said the fire was under control, as it urged the public to remain calm. Fairmont The Palm is described as a luxury hotel with gourmet dining options, an award-winning spa, and pools with city views. A series of explosions were also heard in Abu Dhabi, with the defence ministry confirming one person was killed by falling debris in a residential area after the UAE \"successfully\" intercepted Iranian missiles. In a statement, the nation's defence ministry \"affirmed its full readiness and preparedness to deal with any threats, stressing that all necessary measures are being taken to firmly confront any attempts to undermine the country's security and stability\". \"The kids are terrified\", one Abu Dhabi resident messaged me after the sound of explosions. This was followed by a second wave of missiles seen flying over the residential area of Dubai, where I live. The UAE's airspace is currently closed as a precautionary measure, according to the General Civil Aviation Authority. Multiple airlines have cancelled flights serving Abu Dhabi and Dubai; the latter is the world's busiest travel hub, and handled nearly 100 million ​passengers last year. If you look at Flight Radar, the airspace is empty in neighbouring countries too. Qatar, Jordan, Kuwait and Bahrain have all reported deploying air defences to shoot down incoming Iranian missiles. Flights have been turned around mid-air, and packed airliners bound for Qatar were turned around on the tarmac at Heathrow and returned to the terminal. The British Embassy in the UAE posted travel advice to British nationals: \"We are aware of missiles flying over the United Arab Emirates... British nationals are advised to shelter in place.\" The advice is to remain indoors or in a safe place and to stay away from windows. Around 240,000 British citizens live in the UAE. The sense of safety, one of the great draws for people living here, has been shattered today. Read more:Where has been hit? Iran retaliates after US-Israel strikesAyatollah Ali Khamenei: How powerful is Iran's supreme leader? The country is also home to an estimated half a million Iranian citizens, many of whom are full of fear and emotion today. We have no idea what this moment means for Iran or for the region. But people here are desperately hoping America knows what it's doing."
    },
    {
        "title": "One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights",
        "description": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack.",
        "url": "https://news.sky.com/story/uk-middle-east-flights-disrupted-as-dubai-and-doha-airports-suspend-services-13513380",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dubai-emirates-dubai-airport_7178106.jpg?20260228185559",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-28 15:51:00",
        "Headline": "Flights to and from the UAE, Qatar, Israel and Bahrain are among those cancelled as Trump's war with Iran sparks tourist safety fears.",
        "Content": "One person has died and seven have been injured after an \"incident\" at Abu Dhabi's Zayed airport, while four were also hurt at Dubai International - reportedly due to an overnight Iranian attack. It comes as many flights in and out of the Middle East have been cancelled due to US missile attacks on Iran and subsequent counter strikes targeting American bases in the region. A post on X by Abu Dhabi Airports said the incident \"resulted in one fatality involving an Asian national and 7 injuries\" - but did not give a cause and urged against \"circulating rumours\". Iran latest: Supreme leader Ayatollah Khamenei is dead, Trump confirms The Dubai incident left four staff with injuries and happened when a concourse sustained \"minor damage\", according to the city's media office. Aviation sources told ​Reuters news agency one of the terminals had been damaged during ​an overnight Iranian attack. Flights from both airports were grounded on Saturday as a precaution. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger\n                 \n                  Trump launches war against Iran\n                 There was also a minor fire on the facade of the city's iconic sail-shaped Burj al Arab hotel due to a drone interception. \"Civil Defence teams responded immediately and brought the incident under control. No injuries have been reported,\" Dubai's media office added on X. Another luxury hotel in the city was also damaged by fire earlier on Saturday - again believed to have been caused by remnants from a falling missile. The UK Foreign Office (FCDO) has warned Britons in several Middle East countries to \"immediately shelter in place\" and to avoid travel to Israel and Palestine. \"Remain indoors in a secure location, avoid all travel and follow instructions from the local authorities,\" advised the FCDO. It said it was \"working around the clock\" to support British nationals affected. UK citizens are being urged to sign up to Register Your Presence and travel advice emails so the Foreign Office can send them information. Thousands of Britons are potentially stuck due to the temporary closure of airspace and airports in countries such as the UAE and Qatar. British Airways cancelled Saturday's Dubai, Doha, Amman and Abu Dhabi services, as well as flights to Tel Aviv and Bahrain up to 3 March. A BA flight from London to Doha, Qatar's capital, was among dozens forced to turn around or divert mid-flight early on Saturday, according to flight tracking websites. London Heathrow said \"a small number of flights\" had been cancelled or delayed. Its departures board on Saturday afternoon showed cancellations including an Emirates flight to Dubai, a Qatar Airways flight to Doha, and an Etihad service to Abu Dhabi. A Gatwick spokesperson said it was also \"expecting disruption to our Qatar and Emirates flights\". Manchester Airport departures showed a Saturday night Emirates flight to Dubai had been scrapped as it shared a post advising people to check with their airline. Wizz Air also confirmed flights between London Luton to Tel Aviv were suspended in both directions until 7 March but that \"operational decisions will continue to be reviewed\". Virgin Atlantic said journeys from destinations including India and the Maldives could take longer as the routes were being altered for safety reasons. Many other large airlines have also paused flights to the Middle East, as well as some routes flying over the region, including Delta, Lufthansa, Cathay Pacific and Turkish Airlines. India's airlines are also suffering serious disruption. Its aviation ministry said more than 400 flights by domestic carriers had been cancelled on Saturday and a similar number were expected on Sunday. Dubai airports at standstill The worst disruption is likely to be caused by the grounding of flights at Dubai's main airport, the world's busiest for international traffic. People jetting out for a winter break - and the thousands who change aircraft there - are set to have their plans upended after the UAE closed its airspace. All flights at Dubai's International, Dubai World Central (Al Maktoum) and Abu Dhabi's Zayed International have been suspended. At least 90,000 people transfer every day in Dubai, Doha or Abu Dhabi on just three airlines, Emirates, Qatar Airways and Etihad Airways, according to analytics firm Cirium. People in Dubai were earlier filmed running for shelter as air raid sirens sounded and witnesses told Reuters at least three big blasts were heard over the city. A fire broke out near the entrance of the five-star Fairmont The Palm hotel after debris reportedly fell from an Iranian missile. Read more:Big blasts heard over Dubai as people run for coverWhere has been hit by strikes and counter-strikes? A Dubai airports statement called the closures an \"exceptional precautionary measure\", while Emirates said safety was its \"highest priority\" as it halted flights. \"You have crews, planes and passengers stranded all over the world. It's a massive logistical nightmare,\" a Gulf airline source told Reuters. Qatar's international airport also suspended all services after the country's airspace was locked down in case of more attacks from Iran. People were earlier forced to run for cover as a missile - which was likely intercepted - tumbled out the sky and exploded in a residential area of Doha. America's largest regional air base, al Udeid, is near the city and Iran has deemed all US bases in the region as fair game."
    },
    {
        "title": "Where has been hit? Iran retaliates across Middle East after US-Israel strikes",
        "description": "Multiple locations in Iran have been targeted by joint US-Israel strikes, and Tehran has launched retaliatory missiles across the region. ",
        "url": "https://news.sky.com/story/where-has-been-hit-iran-retaliates-across-middle-east-after-us-israel-strikes-13513268",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-tehran_7177503.jpg?20260228121737",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-28 11:00:00",
        "Headline": "Iranian cities hit include Tehran, Isfahan, Tabriz, Kermanshah, and Qom, while retaliatory missiles have hit Bahrain, Kuwait, Qatar, and the UAE.",
        "Content": "Multiple locations in Iran have been targeted by joint US-Israel strikes, and Tehran has launched retaliatory missiles across the region.  The Iranian cities hit include Tehran, Isfahan, Tabriz, Kermanshah, and Qom, according to Telegram posts from the country's Revolutionary Guard Corps. Also targeted was the residence of Supreme Leader Ayatollah Ali Khamenei, as well as the nation's intelligence ministry, its defence ministry, and its Atomic Energy Organization, Sky News understands. Satellite imagery of the leader's compound, taken today, shows black smoke and extensive damage, with at least four buildings struck. An Iranian official said Khamenei was not there at the time. According to the Iranian Health Ministry, more than 60 students were killed and 80 more injured in another strike at a girls' school in Minab, a city in Hormozgan province. Iran latest: follow here for updates Now Iran has hit back, simultaneously striking four US bases across the Middle East. \n                  Trump launches war against Iran\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 These were Al Udeid Air Base in Qatar, Al Salem base in Kuwait, Al Dhafra Air Base in the United Arab Emirates, and the US Fifth Fleet base in Bahrain. The attack on the US Navy's Fifth Fleet centre was also reported by Bahraini state news agency BNA. Sky correspondent Sally Lockwood further reports that a loud explosion had been heard in Dubai. Footage from different locations across the city showed where missiles had been intercepted in the skies overhead. More video from social media showed a fire near the entrance of Dubai's Fairmont The Palm hotel, reportedly after debris fell from the sky during an Iranian missile attack. At least one person has been killed in the UAE. Another four were killed in Syria, when a missile struck a building in the south of the country, the state-owned SANA news agency reported. While in Kuwait, several employees at the nation's only commercial airport were injured by a drone, which also damaged Terminal 1, according to the country's Directorate General of Civil Aviation. There have been no reported American casualties, two officials told our US partner NBC News. The Revolutionary Guard said it considers \"all US bases, resources, and interests in the region to be legitimate targets\" for retaliation. Sky News' Europe correspondent Alistair Bunkall has warned that the Tehran regime \"will not roll over and will die fighting if needs be\". It comes after Donald Trump confirmed \"major combat operations\" against Iran in an eight-minute video on Truth Social. The US president also urged the Iranian people to rise up against the ruling regime, saying: \"When we are finished, take over your government, it will be yours to take\"."
    },
    {
        "title": "Trump's Iran attack is a gamble - and the outcome is unclear",
        "description": "Donald Trump's decision to launch \"major combat operations\" in Iran is the biggest gamble by any American president since George Bush invaded Iraq more than two decades ago.",
        "url": "https://news.sky.com/story/trumps-iran-attack-is-a-gamble-and-the-outcome-is-unclear-13513250",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-israel-usa_7177399.jpg?20260228084742",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-28 09:19:00",
        "Headline": "Donald Trump came to the White House as an arch opponent of the US's so-called \"forever wars\" but is risking a great deal with 'Operation Epic Fury'.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Donald Trump's decision to launch \"major combat operations\" in Iran is the biggest gamble by any American president since George Bush invaded Iraq more than two decades ago. The US commander in chief - who came to power as an arch opponent of the US's so-called \"forever wars\" - has set out ambitious and extensive goals for his attack against the Islamic Republic, saying he plans to prevent this \"wicked, radical dictatorship\" from threatening the United States. But he is not in complete control of events. Mr Trump is gambling that overwhelming US military firepower from the air - rather than boots on the ground - will be enough to destroy the Iranian regime. Tehran's military may have been degraded by previous US and Israeli strikes, but they are showing no sign of rolling over. Follow live updates here It retains the ability to inflict significant harm against Israel as well as US forces in the region - and is already fighting back. The scale of that retaliation and how much the US and Israel can withstand the counterattacks will be a fundamental indicator to track. \n                  Trump launches war against Iran\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Politics are laced through the Epstein affair - and why listening to the victims is so vital\n                 Mr Trump has prepared his country for the potential for American service men and women to be killed, saying in his video address \"we may have casualties. That happens in war\". He has calculated that any pain the US side suffers is worthwhile to end the threat posed by Iran. And he spelt out these objectives - a move that could come back to haunt him if they are not achieved. Chief among these war goals is a vow to prevent Iran from ever having nuclear weapons. But the US president has also pledged to destroy Iran's missile capabilities and to \"annihilate\" its navy. He issued an ultimatum to all members of the Iranian armed forces and security services from the Republican Guard to the police, telling them to lay down their weapons \"or face certain death\". There is no indication that the Iranian security forces are about to betray the regime. The fact that Iran is now retaliating by launching missiles against Israel is a clear sign that Tehran has not been cowed by Mr Trump's opening salvo and is ready to fight. Even if the regime is toppled, the next moment of peril is what comes next. The US president made clear that he wants the Iranian people to step up and \"take over your government\". But, again, he does not have the ability to control what that would look like and whether what comes next is better than what he seeks to destroy. The history of wars in the Middle East shows that no plan by either side survives first contact with the enemy."
    },
    {
        "title": "Trump launches war against Iran",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160;",
        "url": "https://news.sky.com/story/trump-launches-war-against-iran-13513310",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump100-trump-podcast_7177575.jpg?20260228135326",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-28 13:53:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    The chair of the Board of Peace starts war. The US strike military targets on Iranian soil, while Israelis, supporting the attack on the regime, go after Iran's leaders. The Iranians have already struck back - hitting US military bases across the Middle East - in Bahrain, Qatar, Abu Dhabi and Dubai. What next? And is this the start of the most consequential conflict in the Middle East in a generation? You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Trump is going for regime change despite positive talks with Iran",
        "description": "Only thirty-six hours ago, Trump's envoys were meeting with a high-level Iranian delegation in Geneva to discuss a diplomatic solution.",
        "url": "https://news.sky.com/story/trump-is-going-for-regime-change-despite-positive-talks-with-iran-13513259",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-tehran-iran-israel-attack_7177360.jpg?20260228080229",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-02-28 10:13:00",
        "Headline": "President Trump, with the help of Israel, is going for regime change. It's all or nothing, writes Sky's Alistair Bunkall.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Only thirty-six hours ago, Trump's envoys were meeting with a high-level Iranian delegation in Geneva to discuss a diplomatic solution. The initial noises were positive. Conversations that I had with figures involved in those negotiations were optimistic that the sides were drawing close to a provisional agreement, although some obvious and significant gaps remained. Notably, one issue that wasn't discussed was Iran's ballistic missile programme - which alarmed the Israelis because of the threat those missiles pose to them. US and Israel strike Iran - follow latestOn Friday morning, Oman's foreign minister Badr Albusaidi, who has mediated several rounds of talks, including those in Geneva, flew to Washington at short notice to brief US vice president JD Vance in person. Albusaidi then gave two extremely rare interviews on US television to explain what was on the table. It was a desperate and honest attempt to keep the sides talking. But there were already signs that things were unravelling. Mike Huckabee, the US ambassador to Israel, sent an email to embassy staff on Friday morning warning them that if they wanted to leave the country they \"must do so TODAY\". \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger\n                 \n                  One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights\n                 Read More:UK issues travel warning as Middle East crisis worsensTrump is going for regime change despite positive talks with Iran It had an air of unplanned urgency, rather than a controlled diplomatic evacuation. Perhaps they had just learnt something was imminent. Maybe Netanyahu, who has always been deeply sceptical of negotiations, had already decided to attack. British diplomats were relocated from Tel Aviv to Jerusalem, as they were during the 12-Day War last June. Western embassies and military outposts around the region were emptied of non-essential staff. Then late on Friday evening I started to hear word of a possible attack overnight. From my own experience of multiple Middle East wars, it's very hard to pick out the truth from a wall of noise, but the signs were clearly bleak. The cork is now out of the bottle. President Trump, with the help of Israel, is going for regime change. It's all or nothing. Iran's ability to respond might be limited, following the attack on its ballistic missile sites last summer, but already strikes have been reported across the Middle East, not just Israel. The Iranian regime won't roll over; they will die fighting and will drag the region into a wider conflict if needs be."
    },
    {
        "title": "Trump has tipped the Middle East into a massive war that could last weeks",
        "description": "Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran.",
        "url": "https://news.sky.com/story/trump-has-tipped-the-middle-east-into-a-massive-war-that-could-last-weeks-13513261",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lebanon-al-qatrani_7177350.jpg?20260228074503",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-28 10:12:00",
        "Headline": "The conflict started by the US president is  likely to have major repercussions for the world's economy, but there will be suspicion it's been motivated by his domestic woes.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump has rolled the dice again, stunning the world by choosing the most extreme option over Iran. His decision to attack and try and topple Iran's regime with the backing of Israel, tips the Middle East into a massive war that could last weeks. By the end of last week, the stage had been set for more diplomacy. Talks in Geneva had been making some progress and more were planned for Monday. Follow live updates here That appears to have been a ruse, to lull the enemy into thinking an attack was not imminent. Mr Trump has unleashed American military force without either the approval of the UN or the US Congress. There has been no pretence at securing even a fig leaf of justification under international law. \n                  Trump launches war against Iran\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 \n                  Politics are laced through the Epstein affair - and why listening to the victims is so vital\n                 He had been urged by allies in the region, apart from Israel, to avoid war. If it leads to the end of the ayatollahs' regime, there will be jubilation among them, but that is a very big if. Iran had warned it would take the gloves off if attacked and will most likely do just that, its leadership seeing this as a fight for survival. There are already reports of attacks on countries and installations across the Persian Gulf. It is a seaway through which a fifth of the world's oil passes, so a sustained conflict is likely to have major repercussions on the global economy. The American-Israeli offensive poses a dilemma for Britain. Prime Minister Sir Keir Starmer, worried about the implications under international law, has ruled out British bases being used to support the assault on Iran. There will be severe misgivings at the highest level of government here about the wisdom and legality of this unprecedented move by Britain's closest ally but there will also be a determination that it does not damage transatlantic relations. Read more:'Biggest gamble since Iraq invasion'Why regime change is the aim And there will be the suspicion that this has been motivated more by Donald Trump's deepening domestic woes than by sound military thinking. He faces an affordability crisis back home and continuing pressure over the Epstein scandal. This is a massive gamble by an American president whose popularity is plummeting. He has set the objective high, hoping to sufficiently damage Iran's regime so that its people can rise up and take over. Anything short of that may be seen as an expensive failure, which could prove very costly for Mr Trump in the run-up to this year's vital US mid-term elections."
    },
    {
        "title": "Trump launches war against Iran",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160;",
        "url": "https://news.sky.com/story/trump-launches-war-against-iran-13513310",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump100-trump-podcast_7177575.jpg?20260228135326",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-28 13:53:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    The chair of the Board of Peace starts war. The US strike military targets on Iranian soil, while Israelis, supporting the attack on the regime, go after Iran's leaders. The Iranians have already struck back - hitting US military bases across the Middle East - in Bahrain, Qatar, Abu Dhabi and Dubai. What next? And is this the start of the most consequential conflict in the Middle East in a generation? You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Trump's Iran attack is a gamble - and the outcome is unclear",
        "description": "Donald Trump's decision to launch \"major combat operations\" in Iran is the biggest gamble by any American president since George Bush invaded Iraq more than two decades ago.",
        "url": "https://news.sky.com/story/trumps-iran-attack-is-a-gamble-and-the-outcome-is-unclear-13513250",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-israel-usa_7177399.jpg?20260228084742",
        "type": "US",
        "Author": "Deborah Haynes",
        "Date Published": "2026-02-28 09:19:00",
        "Headline": "Donald Trump came to the White House as an arch opponent of the US's so-called \"forever wars\" but is risking a great deal with 'Operation Epic Fury'.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Donald Trump's decision to launch \"major combat operations\" in Iran is the biggest gamble by any American president since George Bush invaded Iraq more than two decades ago. The US commander in chief - who came to power as an arch opponent of the US's so-called \"forever wars\" - has set out ambitious and extensive goals for his attack against the Islamic Republic, saying he plans to prevent this \"wicked, radical dictatorship\" from threatening the United States. But he is not in complete control of events. Mr Trump is gambling that overwhelming US military firepower from the air - rather than boots on the ground - will be enough to destroy the Iranian regime. Tehran's military may have been degraded by previous US and Israeli strikes, but they are showing no sign of rolling over. Follow live updates here It retains the ability to inflict significant harm against Israel as well as US forces in the region - and is already fighting back. The scale of that retaliation and how much the US and Israel can withstand the counterattacks will be a fundamental indicator to track. \n                  Trump launches war against Iran\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Politics are laced through the Epstein affair - and why listening to the victims is so vital\n                 Mr Trump has prepared his country for the potential for American service men and women to be killed, saying in his video address \"we may have casualties. That happens in war\". He has calculated that any pain the US side suffers is worthwhile to end the threat posed by Iran. And he spelt out these objectives - a move that could come back to haunt him if they are not achieved. Chief among these war goals is a vow to prevent Iran from ever having nuclear weapons. But the US president has also pledged to destroy Iran's missile capabilities and to \"annihilate\" its navy. He issued an ultimatum to all members of the Iranian armed forces and security services from the Republican Guard to the police, telling them to lay down their weapons \"or face certain death\". There is no indication that the Iranian security forces are about to betray the regime. The fact that Iran is now retaliating by launching missiles against Israel is a clear sign that Tehran has not been cowed by Mr Trump's opening salvo and is ready to fight. Even if the regime is toppled, the next moment of peril is what comes next. The US president made clear that he wants the Iranian people to step up and \"take over your government\". But, again, he does not have the ability to control what that would look like and whether what comes next is better than what he seeks to destroy. The history of wars in the Middle East shows that no plan by either side survives first contact with the enemy."
    },
    {
        "title": "'I saw nothing, and I did nothing wrong': Bill Clinton releases video statement after Epstein testimony",
        "description": "Former US president Bill Clinton has released a video statement on his deposition over his relationship with Jeffrey Epstein.",
        "url": "https://news.sky.com/story/i-saw-nothing-and-i-did-nothing-wrong-bill-clinton-releases-video-statement-after-epstein-testimony-13513197",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bill-clinton-epstein-files_7177301.png?20260228051056",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-28 05:06:00",
        "Headline": "In a video posted to X, the former president said he had no idea of the crimes the paedophile financier was committing.",
        "Content": "Former US president Bill Clinton has released a video statement on his deposition over his relationship with Jeffrey Epstein. The 42nd president became the first sitting or former president to testify before members of Congress in more than 40 years, as he faced the House Oversight Committee in their investigation into the paedophile financier. In a video posted on X, Mr Clinton stated that he had ended his brief acquaintance with Epstein years before his crimes came to light. \"Though I never witnessed during our limited interactions any indication with what was truly going on, I offered the little I do know in the hopes that it would help prevent anything like this from ever happening again.\" Mr Clinton has denied wrongdoing and expressed regret for his association with Epstein. He targeted Republicans for making his wife Hillary testify the day before, even though Mrs Clinton repeatedly stated she didn't know Epstein, and never went to his island or his properties. Her husband said her subpoena was \"simply not right\". He continued: \"I had no idea of the crimes Epstein was committing. No matter how many photos they show of me, I have two things that, at the end of the day, matter far more than any interpretation of 20-year-old photos. \"I know what I saw, and more importantly, what I didn't see. And I know what I did, and more importantly, what I didn't do. I saw nothing, and I did nothing wrong.\" Mr Clinton said he never would have flown on his plane if he had any inkling of what was going on and would've turned him in personally if he knew. \"Even with 20/20 hindsight, I saw nothing that ever gave me real pause.\" Mr Clinton was questioned for more than six hours and was also asked about a picture of him in a jacuzzi released as part of the Epstein files. A person in the room for the deposition said Mr Clinton didn't know who he was pictured with and said he didn't have sex with them. Mr Clinton also repeatedly said during questioning that he never visited Epstein's private island. \"When the video of my testimony today is released, I hope it will motivate everyone to go in front of Congress to say what they know,\" he said. \"I hope it will motivate the justice department to finally release all the files and to ensure that this never happens again. The survivors deserve that.\" Read more:Politics are laced through the Epstein affair - and why listening to the victims is so vitalThe Epstein committee shouldn't be defined by politics - but it is hard to avoidWhat Sky News has uncovered about Clinton and Epstein's relationship His hearing took place behind closed doors in Chappaqua, New York state, but Democrats and Republicans on the House Oversight Committee offered some indication of proceedings throughout the day. Democratic representative Suhas Subramanyam told Sky News' US correspondent James Matthews that Mr Clinton generally \"answered all of our questions\" and had been thorough in his answers. Republican representative James Comer said Mr Clinton told the committee that incumbent president Donald Trump \"has never said anything to make me think he was involved\", but Democratic counterpart Robert Garcia said Mr Clinton brought up \"additional information about discussions with President Trump\". Democrats also say a \"new precedent\" has been set with Mr Clinton's testimony, as they continue to ramp up pressure for Mr Trump to testify. Mr Trump has consistently denied any wrongdoing in relation to Epstein, and says he used to be friends with the convicted sex offender but cut that off before he was accused of sexual abuse."
    },
    {
        "title": "Politics are laced through the Epstein affair - and why listening to the victims is so vital",
        "description": "Amid all the investigations into the Epstein affair, there is much talk - and no argument - about the importance of listening to the survivors.",
        "url": "https://news.sky.com/story/politics-are-laced-through-the-epstein-affair-and-why-listening-to-the-victims-is-so-vital-13513196",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rep-nancy-mace-president-bill-clinton_7177300.jpg?20260228045914",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2026-02-28 04:15:00",
        "Headline": "For two Republicans to suggest that Jeffrey Epstein's victims have exonerated Donald Trump is simply wrong and risks undermining the survivors' pursuit of justice. ",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Amid all the investigations into the Epstein affair, there is much talk - and no argument - about the importance of listening to the survivors. And yet, at a lectern outside the venue where she'd just been questioning a former president, Republican Nancy Mace told the media this: \"Epstein victims have exonerated President Trump. This is a trope, a rabbit hole that you guys have been going down, but he's been exonerated over and over again by Epstein victims.\" Which is news to many survivors. I asked Rep Mace when survivors had told her the president is exonerated because they had only ever told me they wanted to see him questioned by her committee. She replied: \"I've never heard that from a single victim.\" Anna Paulina Luna, her Republican colleague on the House Oversight Committee, has expressed similar views that Epstein survivors see the president as being in the clear. You have to wonder at the extent of their research. Dani Bensky, an Epstein survivor, told Sky News: \"Trump has certainly not been exonerated. There is evidence, and there are investigative leads that need to be looked into. Just because a survivor doesn't raise a hand in a group setting, doesn't mean that they didn't experience or witness harm. It means that safety and defamation are extremely real fears. \"To suggest Trump is exonerated is an insult to survivors and speaks to the continued failures of the DoJ [Department of Justice] to follow the investigative leads that are in front of them.\" \n                  Trump launches war against Iran\n                 \n                  Trump has tipped the Middle East into a massive war that could last weeks\n                 \n                  Trump's Iran attack is a gamble - and the outcome is unclear\n                 Jess Michaels, an Epstein survivor, posted on Threads: \"Rep Luna did not meet with all 1200+ victims from an over 30-year time span. WE, as a collective, have not cleared President Trump of wrongdoing. He IS a person of interest. He should testify. \"Signed ~ an Epstein survivor.\" They are two women among many who hold a similar view. It's clear that Epstein survivors want questions asked of Donald Trump, a former friend of Jeffrey Epstein, who is featured in the files. To state that they have exonerated him is simply wrong and risks undermining their pursuit of justice. It also feeds the theory - whether it's true or not - that Republicans are providing cover for their president at the expense of a proper and full investigation. 👉 Follow Trump100 on your podcast app 👈 Politics are laced through the Epstein affair. The transcripts of the Clinton interviews, when they are released, will reflect the truth of their testimony. It will also provide proper context for the closing statement of Republican chair James Comer, who said that former president Bill Clinton had \"exonerated\" President Trump as he \"has no information that President Trump did anything wrong, and that President Trump never said anything to Clinton to make him think that he was involved with Epstein\". Read more:Trump's furious response to AI developer AnthropicHillary Clinton attacks line of questioning over Epstein Notwithstanding that, Democrats dispute the Republicans' characterisation of Clinton's evidence, the notion that Trump is exonerated because he didn't confess to an old foe is simply absurd. The calls for the current president to appear before the House Oversight Committee didn't end when Clinton left the room. Donald Trump emphatically denies any knowledge of, or involvement in, Jeffrey Epstein's criminal behaviour. Inclusion in the Epstein files is no indication of guilt."
    },
    {
        "title": "Trump's furious response to Anthropic is as much about power as it is about AI safety",
        "description": "In the most clear and consequential policy move on AI safety yet, the Trump administration has announced it will blacklist a leading AI lab over its refusal to allow unfettered access to its technology for military purposes.",
        "url": "https://news.sky.com/story/trumps-furious-response-to-anthropic-is-as-much-about-power-as-it-is-about-ai-safety-13513194",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anthropic-ai-artificial-intelligence_7156695.jpg?20260205173942",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2026-02-28 00:01:00",
        "Headline": "The origin of the dispute between the White House and Anthropic is the tech company's insistence on \"red lines\" in relation to the use of AI for military purposes.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n In the most clear and consequential policy move on AI safety yet, the Trump administration has announced it will blacklist a leading AI lab over its refusal to allow unfettered access to its technology for military purposes. It is the president and his secretary of war, Pete Hegseth, going nuclear over Anthropic's refusal to allow the Pentagon to use its AI for \"any lawful purpose\". Describing Anthropic as a woke, radical left company, the US president said on his Truth Social platform that \"The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War\", adding that the company's actions were putting American lives and national security in jeopardy. Until now, however, Anthropic was doing more than any other AI lab to support the Pentagon. Anthropic's Claude AI is the only frontier model already being used extensively for sensitive military planning and operations. It's been widely reported that Claude AI was used as part of the Pentagon's \"Maven Smart System\" to plan and execute the military operation to capture Venezuelan President Nicolas Maduro in January. The origin of the dispute wasn't about Anthropic's commitment to the US military; instead, its insistence on \"red lines\" in relation to the use of AI technology. Anthropic's CEO Dario Amodei demanded assurances it wouldn't be used for mass surveillance of civilians or lethal automated attacks without human oversight. In a statement on Wednesday, Amodei said some uses of AI are \"simply outside the bounds of what today's technology can safely and reliably do\". In a post on X, equally as seething as the president's, secretary Hegseth announced that, as well as being blacklisted, Anthropic would also be designated a Supply-Chain Risk - a legal intervention previously reserved for foreign tech companies seen as a direct threat to US national security. Read more:AI developing so fast 'it is becoming hard to measure'AI bubble remains intact for now Given growing concerns about AI safety, it's a move that has shocked AI safety campaigners, but also raises serious questions about the future viability of the Pentagon's \"AI-First\" strategy. Secretary Hegseth has given Anthropic six months to remove its AI from the Pentagon's systems. But there are now questions about what he might replace it with. For the first time in the short history of superintelligent AI, the row appears to have united the AI industry. In a memo to staff on Thursday, Sam Altman, CEO of OpenAI, which has also been in talks with the Pentagon, announced he shares the same \"red lines\" as Anthropic. Separately, more than 400 employees at Google and OpenAI have signed an open letter calling for their industry to stand together in opposing the Department of War's position. In a copy of the OpenAI memo seen by Sky News, Altman tells staff: \"Regardless of how we got here, this is no longer just an issue between Anthropic and the DoW; this is an issue for the whole industry and it is important to clarify our stance.\" The move by the Trump administration appears, therefore, to be as much about power as it is about AI safety. The Pentagon has already said it wouldn't use AI for mass surveillance of the US population, nor unsupervised autonomous weapons. Its furious response to Anthropic seems more in response to a big tech attempting to dictate terms to the government, rather than what those terms actually are. In taking on Silicon Valley, which, though AI investment largely accounts for much of the current US economic growth, the administration has just declared war on a powerful opponent."
    },
    {
        "title": "Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger",
        "description": "Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel.",
        "url": "https://news.sky.com/story/starmer-is-cautious-on-iran-because-he-knows-the-chaos-trumps-strikes-could-trigger-13513689",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sir-keir-starmer-prime-minister_7177656.jpg?20260228144444",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-28 22:36:00",
        "Headline": "The PM is under pressure from the right and left over the American attacks and leads a Labour party still haunted by the Iraq war.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel. He's under pressure from those on the left of British politics to condemn US President Donald Trump's actions as \"illegal\" and unjustified - while those on the right want to see him offer his open support. Military intervention in the Middle East is clearly a sensitive issue for a Labour party haunted by the Iraq war. While British planes are now in the sky to defend UK interests in the region, Starmer made it explicitly clear that such defensive activity is \"in line with international law\" - and that the UK wasn't involved in the American/Israeli attacks. Follow live: Iran's supreme leader 'killed in US attacks' - Trump Indeed, the PM is thought to have previously blocked the US from using UK bases - reportedly over concerns about breaching international law - despite Mr Trump making it very clear that he wanted to do so. In his televised statement, the prime minister was vehement in his condemnation of the \"utterly abhorrent\" Iranian regime, which has \"murdered thousands of [its] own people, brutally crushed dissent and sought to destabilize the region\", as well as posing \"a direct threat\" in the UK. \n                  Paranoia and absolute power: Ali Khamenei led Iran with supreme self-confidence \n                 \n                  One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights\n                 \n                  Trump launches war against Iran\n                 While he didn't express any direct backing for Donald Trump's decision to strike Iran, he made it plain that he agreed with the rationale. Keir Starmer concluded by urging the Iranians to \"give up their weapons programmes and cease the appalling violence and repression\", although he stopped short of echoing the President's desire for regime change. The overall impression was of a UK government applauding the ends, but not necessarily the means. Not for the first time, the prime minister is balancing on a diplomatic tightrope in order to maintain a close relationship with the White House. He's always put the so-called special relationship at the very heart of his foreign policy - and doesn't want to risk antagonising Donald Trump (any more than he already has done recently, in refusing the use of British military bases and signing the Chagos deal with Mauritius). Now, alongside Turkey and Kuwait, the PM has been rewarded with a Trump phone call. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The details are sketchy; we're told they \"discussed the situation in the Middle East\" and the \"defensive operations\" being carried out by UK forces in the region\". It sounds brief, with no indication of any particular cordiality, but Downing Street will be relieved the call has happened. The Conservatives are accusing Starmer of sitting on the fence. But as a former human rights lawyer, Starmer has a live understanding of the legal and moral questions raised by these unilateral attacks. As a Labour leader, he's all too conscious of the unforeseen consequences of military intervention across the world - and the chaotic uncertainty engendered by a violent transfer of power. For now, he's decided the fence is the safest option."
    },
    {
        "title": "Back my asylum overhaul or risk Trump inspired ICE-style raids, warns Mahmood",
        "description": "Shabana Mahmood is set to introduce new legislation to overhaul the UK's asylum system as part a tougher approach to migration.",
        "url": "https://news.sky.com/story/back-my-asylum-overhaul-or-risk-trump-inspired-ice-style-raids-warns-mahmood-13513195",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-home-secretary_7145110.jpg?20260125105053",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-28 02:33:00",
        "Headline": "The home secretary invokes the spectre of a US inspired \"far-right\" immigration crackdown as she tries to win Labour support for tougher asylum laws.",
        "Content": "Shabana Mahmood is set to introduce new legislation to overhaul the UK's asylum system as part a tougher approach to migration. The home secretary will say the generosity of the British asylum system is attracting people from across the world, funding human traffickers and encouraging false asylum claims, according to a government source, She is also expected to say the government must cut migration, or risk opening the door to the right, which would divide communities with the kind of ICE-style anti-immigration raids seen in the US. It is hoped her plans could help to blunt the appeal of Reform UK. But they are also likely to bring criticism from within Labour, as fall-out from party losing a safe seat to the Greens, as it came third in this week's Gorton and Denton by-election. Ms Mahmood's name and immigration policy was being highlighted as the blame game began in the aftermath of Labour's defeat in the Manchester contest. The Times has reported up to 40 Labour MPs are expected to oppose her plans, believing they are punitive and morally wrong. But Ms Mahmood told The Telegraph that Labour could not ignore the issue. \"The levels of illegal migration are putting immense strain on our country, and our public services - creating division within communities across the country,\" the home secretary said. \"Illegal migration is undermining the contract between government and its citizens - eroding support for the asylum system entirely.\" Her new strategy comes after a visit to Denmark, which has one of the toughest asylum and immigration systems in Europe. The home secretary is a long-term admirer of the model. Read more on Sky NewsHow the UK and Denmark's immigration policies compareBritain's immigration system changes explained Denmark's tough stance on asylum seekers began in the mid-2010s, when prime minister Mette Frederiksen was in opposition. Her party, the Social Democrats, moved to make protection for asylum seekers temporary, also arguing that uncontrolled immigration was placing huge pressure on working-class communities. Since coming into office, Ms Frederiksen's government has reduced the number of asylum applications to its lowest number in 40 years and removed 95 percent of rejected asylum seekers. Denmark's system also looks to deter new arrivals by largely moving to a temporary stay model, where most asylum seekers are sent back to their home country once they are deemed safe. Ms Mahmood was taken to a reception centre on the outskirts of Copenhagen, where asylum seekers are taken by police to stay on a short-term basis, are given health checks, and have their biometrics taken. She was then taken to a returns centre, where migrants go before being sent back to their country of origin, which included communal canteens, outdoor exercise machines, and accommodation, which included plain rooms furnished with lockers and small single beds or bunkbeds. A Labour source told The Telegraph the party and its values will be in jeopardy without bold action on migration, but adds that Mahmood's vision sets a path that sits between both Reform UK and the Greens. \"It is a vision that is fair, but firm, compassionate, but controlled, and one that promotes and rewards those who want to contribute to our national life. \"The alternative is the far-right raising the drawbridge and bringing havoc and chaos to Britain's streets with ICE-style raids dividing our communities. \"The alternative under Zack Polanski is open borders, fuelling the trade in human trafficking and placing huge strain on communities and public services. Both seek to promote and profit from division within our communities.\""
    },
    {
        "title": "Plaid Cymru leader pledges to open route to independence for Wales",
        "description": "A Plaid Cymru Welsh government would aim to&#160;establish&#160;a national commission to explore Wales's constitutional future, including a potential path toward independence, within its first 100 days in office.",
        "url": "https://news.sky.com/story/plaid-cymru-leader-pledges-to-open-route-to-independence-for-wales-13513483",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-plaid-cymru-iorwerth_7177915.jpg?20260228173810",
        "type": "Politics",
        "Author": "Hannah Woodward, political news editor",
        "Date Published": "2026-02-28 17:22:00",
        "Headline": "Rhun ap Iorwerth tells Sky News he will look at the question of independence for Wales, as Hollywood actor Michael Sheen throws his support behind his campaign to win the May elections",
        "Content": "By Hannah Woodward, political news editor  A Plaid Cymru Welsh government would aim to establish a national commission to explore Wales's constitutional future, including a potential path toward independence, within its first 100 days in office. The party's leader, Rhun ap Iorwerth, confirmed a Plaid Cymru Welsh government would rule out a referendum should the it win power in May's election. But his party has pledged to \"spark a national conversation about the next steps on our constitution journey\". Just 26% of adults in Wales say they would vote for independence if a referendum were held, according to YouGov polling carried out in January this year. Although this is the highest level of support recorded, a majority (54%) would still vote against independence. When questioned by Sky News on whether the commission was a good use of public money given the lack of support for an independent Wales, Mr ap Iorwerth said it would be using \"taxpayers money to see if there a better way of governing Wales\". He added: \"We're using taxpayers here to get to grips with problems in health, to build a stronger economy, to raise standards in education, to offer a childcare offer that's the most generous in the UK.\" \n                  One dead and others injured at Abu Dhabi and Dubai airports - as missile threat grounds flights\n                 \n                  Skydiver dies after jump in Devon \n                 \n                  Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger\n                 He went on: \"This is about governing Wales better. We are on a journey. We have come a long way on a journey over the last 30 years where we do have a parliament and a government of our own now. \"People tell me they agree with me whether they believe in independence or not. That's by the by. But they agree with me that we should always be investigating and pushing the boundaries of whether there's a better way of running Wales.\" A Welsh Labour source told Sky News: \"This commission is a first step in the independence plan they claim to not be pursuing. \"This commission will not be without cost, meanwhile they're talking about efficiencies in the child poverty strategy funding. \"They need to sort out their priorities if they're going to say they're serious about leading.\" Plaid Cymru is currently leading the latest YouGov poll with 37% support. Reform UK follows in second place on 23%, with the Green Party in third on 13%. Labour and the Conservatives are tied in fourth position, each polling at 10%. Alongside the national commission, the party has also pledged to attempt to \"reset the relationship with Westminster\". They will push the UK Labour Government for the same devolution settlement as Scotland, including the devolution of justice, transport and the Crown Estate. When asked why Sir Keir Starmer would listen to his Welsh government over a Labour-run one, given the current First Minister Eluned Morgan has repeatedly been turned down when pushing for further devolved powers, he said he would not accept 'no' for an answer. Speaking at the party's spring conference in Newport he said: \"We know that when Labour try to ask for something, they get nothing. \"They are slapped down....when Labour say, well, a Labour UK government will only give something to a Welsh Labour government, how deeply undemocratic and patronising towards Wales that is.\" The final day of the conference on Saturday came as Hollywood actor Michael Sheen announced his support for Plaid Cymru - to the delight of Mr ap Iorwerth. When asked whether he hoped the star would join Plaid campaigners on the doorstep, he replied: \"It would be great for Michael to come out with us, he's always welcome.\" Wales will go to the polls on 7 May. Full results coverage will be broadcast live on Sky News."
    },
    {
        "title": "Trump's furious response to Anthropic is as much about power as it is about AI safety",
        "description": "In the most clear and consequential policy move on AI safety yet, the Trump administration has announced it will blacklist a leading AI lab over its refusal to allow unfettered access to its technology for military purposes.",
        "url": "https://news.sky.com/story/trumps-furious-response-to-anthropic-is-as-much-about-power-as-it-is-about-ai-safety-13513194",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anthropic-ai-artificial-intelligence_7156695.jpg?20260205173942",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2026-02-28 00:01:00",
        "Headline": "The origin of the dispute between the White House and Anthropic is the tech company's insistence on \"red lines\" in relation to the use of AI for military purposes.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n In the most clear and consequential policy move on AI safety yet, the Trump administration has announced it will blacklist a leading AI lab over its refusal to allow unfettered access to its technology for military purposes. It is the president and his secretary of war, Pete Hegseth, going nuclear over Anthropic's refusal to allow the Pentagon to use its AI for \"any lawful purpose\". Describing Anthropic as a woke, radical left company, the US president said on his Truth Social platform that \"The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War\", adding that the company's actions were putting American lives and national security in jeopardy. Until now, however, Anthropic was doing more than any other AI lab to support the Pentagon. Anthropic's Claude AI is the only frontier model already being used extensively for sensitive military planning and operations. It's been widely reported that Claude AI was used as part of the Pentagon's \"Maven Smart System\" to plan and execute the military operation to capture Venezuelan President Nicolas Maduro in January. The origin of the dispute wasn't about Anthropic's commitment to the US military; instead, its insistence on \"red lines\" in relation to the use of AI technology. Anthropic's CEO Dario Amodei demanded assurances it wouldn't be used for mass surveillance of civilians or lethal automated attacks without human oversight. In a statement on Wednesday, Amodei said some uses of AI are \"simply outside the bounds of what today's technology can safely and reliably do\". In a post on X, equally as seething as the president's, secretary Hegseth announced that, as well as being blacklisted, Anthropic would also be designated a Supply-Chain Risk - a legal intervention previously reserved for foreign tech companies seen as a direct threat to US national security. Read more:AI developing so fast 'it is becoming hard to measure'AI bubble remains intact for now Given growing concerns about AI safety, it's a move that has shocked AI safety campaigners, but also raises serious questions about the future viability of the Pentagon's \"AI-First\" strategy. Secretary Hegseth has given Anthropic six months to remove its AI from the Pentagon's systems. But there are now questions about what he might replace it with. For the first time in the short history of superintelligent AI, the row appears to have united the AI industry. In a memo to staff on Thursday, Sam Altman, CEO of OpenAI, which has also been in talks with the Pentagon, announced he shares the same \"red lines\" as Anthropic. Separately, more than 400 employees at Google and OpenAI have signed an open letter calling for their industry to stand together in opposing the Department of War's position. In a copy of the OpenAI memo seen by Sky News, Altman tells staff: \"Regardless of how we got here, this is no longer just an issue between Anthropic and the DoW; this is an issue for the whole industry and it is important to clarify our stance.\" The move by the Trump administration appears, therefore, to be as much about power as it is about AI safety. The Pentagon has already said it wouldn't use AI for mass surveillance of the US population, nor unsupervised autonomous weapons. Its furious response to Anthropic seems more in response to a big tech attempting to dictate terms to the government, rather than what those terms actually are. In taking on Silicon Valley, which, though AI investment largely accounts for much of the current US economic growth, the administration has just declared war on a powerful opponent."
    },
    {
        "title": "Brits 2026: Olivia Dean dominates awards, winning album of the year",
        "description": "Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year.",
        "url": "https://news.sky.com/story/brits-2026-olivia-dean-dominates-awards-winning-album-of-the-year-13513671",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-olivia-dean-brits_7178378.jpg?20260228231946",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-28 21:19:00",
        "Headline": "Olivia Dean took four awards at this year's Manchester ceremony, while Sam Fender claimed two and Lola Young was named breakthrough artist.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Olivia Dean has dominated this year's Brit Awards, winning album of the year, artist of the year, best pop act and song of the year. Last year, the 26-year-old Brit school graduate became the first British solo female artist to simultaneously top the UK Official Singles and Albums Chart since fellow Brit alumni Adele. Despite not winning in the publicly voted song of the year category for her song Man I Need, Dean did feature in Sam Fender's winning track, Rein Me In - meaning she received recognition in all four categories she was nominated for. She also performed her hit Man I Need. Following his Mercury Prize win last year, Fender also won best alternative/rock act for the second year running. Meanwhile, fellow Brit school graduate Lola Young won her first Brit in the breakthrough artist category, praising music as a \"safe haven\" for many in what she called a \"horrifyingly bleak\" and \"quite frankly, pretty scary\" world. Presented by Jack Whitehall, the show was opened by Harry Styles, along with a gospel choir and stage full of backing dancers, making his live TV performance debut of music from his forthcoming album Kiss All The Time. Disco, Occasionally. Rock band Wolf Alice took group of the year - the second time they've won the award - using their acceptance speech to urge support for the UK's small music venues and highlight Britain's contribution to music. \n                  Brit Awards fashion 2026 - all the best looks from the red carpet\n                 \n                  The Brit Awards 2026 as it happened: Noel thanks Liam, Olivia Dean cleans up, and tributes to Ozzy\n                 \n                  Brit Awards 2026: The full list of winners\n                 With Culture Secretary Lisa Nandy in attendance, it was a message that couldn't fail to reach its desired audience. Dave took best hip-hop/grime/rap act, while Fred again.., Skepta & PlaqueBoyMax's took best dance act. A night filled with performances amid the awards, other artists to sing on the stage were Wolf Alice, Alex Warren, Mark Ronson (with a previously unannounced appearance from Dua Lipa), Rosalia (with a surprise appearance from Icelandic singer Bjork), Sombr, Raye and KPop Demon Hunters stars Ejae, Audrey Nuna and Rei Ami. One of the year's defining releases, APT by Rose and Bruno Mars, took international song of the year - the second category to be voted for by the public. Rose made history, as the Brits first ever K-pop winner. Best international group went to Brooklyn band Geese, their first Brit award, using their moment in the spotlight to express their anti-ICE sentiments (the US Immigration and Customs Enforcement agency) as well as saying \"free Palestine,\" and \"RIP Mani\" in tribute to late Stone Roses bassist Gary Mounfield, who died last year. International artist of the year went to Spanish singer-songwriter Rosalia - who urged the audience to keep celebrating \"different music, different cultures, different languages\". The late Ozzy Osbourne was honoured with a lifetime achievement award, accepted by his wife and daughter, Sharon and Kelly Osbourne, to a standing ovation from the audience. Sharon described Ozzy as a \"true artist\" and \"the most humble egomaniac you could ever meet\". A tribute performance of No More Tears, led by Robbie Williams and featuring Metallica bassist Robert Trujillo, closed the show. Songwriter of the year and producer of the year had been announced ahead of the show, going to Noel Gallagher and Pink Pantheress, respectively. With her win, Pink Pantheress became the youngest person to ever win producer of the year, as well as the first woman. Mark Ronson, received the outstanding contribution to music award, paying tribute to Amy Winehouse in his speech, and celebrating her in his performance with extracts of Back To Black and Valerie. Meanwhile, Scottish singer-songwriter Jacob Alon won this year's Brits critics' choice award, and while he wasn't given his award in the televised ceremony, former critics choice winner Myles Smith gave him a shout-out on stage. This year, the Brits were held in Manchester for the first time, in the UK's largest entertainment arena, the recently opened Co-op Live arena."
    },
    {
        "title": "Brit Awards fashion 2026 - all the best looks from the red carpet",
        "description": "The Brit Awards exist to celebrate the stars behind the best music of the past year - but the red carpet is all about the fashion.",
        "url": "https://news.sky.com/story/brit-awards-fashion-2026-all-the-best-looks-from-the-red-carpet-13513405",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rosalia-brits_7177929.jpg?20260228174324",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-28 16:34:00",
        "Headline": "Harry Styles, Olivia Dean, Sam Fender, Lola Young, Lily Allen, Ed Sheeran, Raye and Robbie Williams are all expected at the Brit Awards tonight.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The Brit Awards exist to celebrate the stars behind the best music of the past year - but the red carpet is all about the fashion. This year's ceremony marks a move to a brand new home, escaping London and decamping to the Co-op Live arena in Manchester. With artists including Olivia Dean, Harry Styles, Lola Young, Sam Fender, Lily Allen, Ed Sheeran, Raye and Robbie Williams expected to attend, it's guaranteed to be a glamour-filled night. Here are all the outfits as the stars arrived ahead of the ceremony."
    }
]