[
    {
        "title": "NATO responds after Russian military jets 'violate' Estonian airspace",
        "description": "NATO says it has responded after Russian military jets \"violated\" Estonian airspace, as the Baltic state formally requested a consultation with the military bloc.",
        "url": "https://news.sky.com/story/russian-military-jets-violate-estonian-airspace-officials-say-13434022",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-russia-estonia_7025776.jpg?20250919231501",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 13:56:00",
        "Headline": "The Estonian government said the incident involved three Russian MiG-31 fighter jets that flew over the Gulf of Finland for a total of 12 minutes.",
        "Content": " NATO says it has responded after Russian military jets \"violated\" Estonian airspace, as the Baltic state formally requested a consultation with the military bloc. In a statement, the Estonian government said the incident involved three Russian MiG-31 fighter jets that flew near Vaindloo Island, in the Gulf of Finland, for a total of 12 minutes without permission. A NATO spokesperson said the Russian jets \"violated Estonian airspace\" and \"NATO responded immediately and intercepted the Russian aircraft\". \"This is yet another example of reckless Russian behaviour and NATO's ability to respond.\" US President Donald Trump said the reported incursion \"could be big trouble\".  However, a statement from the Russian military said the flight was \"scheduled\" and had been in \"strict accordance\" with airspace rules. The statement read: \"On September 19 of this year, three Russian MiG-31 fighter jets made a scheduled flight from Karelia to an airfield in the Kaliningrad region. \"The flight was conducted in strict accordance with the International Rules for the Use of Airspace, without violating the borders of other states, as confirmed by objective monitoring means. \"During the flight, the Russian aircraft did not deviate from the agreed air route and did not violate Estonian airspace. The flight route of the aircraft passed over the neutral waters of the Baltic Sea basin at a distance of more than three kilometers from the island of Vaindlo.\"  Foreign minister Margus Tsahkna said Russia had already violated Estonian airspace four times this year, \"which is unacceptable in itself, but today's violation, during which three fighter jets entered our airspace, is unprecedentedly brazen\". \"Russia's ever-increasing testing of borders and aggressiveness must be responded to by rapidly strengthening political and economic pressure,\" he added. 'Utterly unacceptable' Estonia is the third NATO country to report an incursion of its airspace by Russia in recent weeks: On Sunday, Romania said a drone breached its airspace during a Russian attack on neighbouring Ukraine. Poland also reported an \"unprecedented violation\" of its airspace by more than a dozen Russian drones last week. Moscow denied responsibility for the incident. The UK had previously summoned the Russian ambassador in London in response to the \"utterly unacceptable\" Romanian and Polish incursions. The Russian defence ministry did not immediately respond to a request for comment. However, its jets routinely fly over the Baltic Sea, where its Baltic Fleet is based. In the wake of the incident, Estonia requested an Article 4 consultation, which allows NATO members to formally bring an issue to the attention of the North Atlantic Council, to meet and discuss when \"the territorial integrity, political independence or security\" of any state is threatened. NATO spokesperson Allison Hart said that the council will convene early next week to discuss the incident in more detail. Sweden's military released images late on Friday that it said showed a Russian fighter jet over the Baltic Sea after it had left Estonian airspace. Incursion 'not a coincidence': Zelenskyy While incursions over Vaindloo Island, around 124 miles from Estonia's capital Tallinn, by Russian aircraft are somewhat common, they do not usually last as long as Friday's incident. In response, Foreign Secretary Yvette Cooper said that the UK \"stands with our Estonian allies\" after what she called \"yet another reckless incursion into NATO airspace\". Ukrainian President Volodymyr Zelenskyy added that the incursion was \"unacceptable\" and added: \"This is not a coincidence. \"It is a systematic Russian campaign against Europe, against NATO, against the West. And it requires a systematic response. Strong actions are necessary, both joint and from each individual country.\" Read more on Russia:Trump makes Putin admission - but saves harshest words for Sadiq KhanRussian forces create 'kill zone' around crucial Ukrainian city Trump says incident 'could be big trouble' Mr Trump also commented on the incident during a news conference at the White House, and said he was \"going to have a look\" at the reports. After saying he would be briefed on the incursion, he said: \"Well, I don't love it. I don't love it when that happens. Could be big trouble.\"  EU Commission President Ursula von der Leyen also said: \"We will respond to every provocation with determination while investing in a stronger Eastern flank.\" She added that \"as threats escalate, so too will our pressure\", before calling on European leaders to approve a new round of sanctions which would ban Russian liquified natural gas. Putin 'testing the West's resolve': EU official Europe's foreign policy chief Kaja Kallas also said the \"violation of Estonia's airspace by Russian military aircraft is an extremely dangerous provocation\". She added that the EU \"stands in full solidarity with Estonia\", and said: \"We will continue to support our member states in strengthening their defences with European resources. \"Putin is testing the West's resolve. We must not show weakness.\" Estonia's government said in May that Russia had briefly sent a fighter jet into NATO airspace over the Baltic Sea during an attempt to stop a Russian-bound oil tanker thought to be part of a \"shadow fleet\" defying Western sanctions on Moscow. It added that the Russian deputy ambassador was summoned and given a protest note. Read more from Sky News:Can Mandelson be barred from the House of Lords?Two ambulance workers arrested in connection with six deaths Russia threatening Finland like Ukraine, says thinktank It comes after analysis from the Institute for the Study of War (ISW) suggested Russia has launched an information campaign against Finland - with echoes of how it built up to the invasion of Ukraine in 2022. The thinktank noted senior figures in Moscow, including members of Vladimir Putin's inner circle, have been making a series of statements designed to threaten the neighbouring country. Its analysts said: \"High-ranking Kremlin officials have increased threats against Finland in recent weeks, including by using language that mirrors the Kremlin's false justifications for its invasions of Ukraine. \"ISW continues to assess that the playbook Russia is currently using to threaten NATO mirrors the playbook Russia previously used to set informational conditions justifying its aggression against Ukraine.\""
    },
    {
        "title": "Speaker makes 'strong and punchy' protest to home secretary over dropping of Chinese spy charges",
        "description": "Commons Speaker Sir Lindsay Hoyle has protested to the home secretary after prosecutors dropped charges against two men accused of spying for China and targeting MPs.",
        "url": "https://news.sky.com/story/speaker-makes-strong-and-punchy-protest-to-home-secretary-over-dropping-of-chinese-spy-charges-13434380",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-christopher-cash-christopher-berry_6533862.jpg?20240426103728",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 22:03:00",
        "Headline": "Christopher Cash and Christopher Berry were charged last April under the Official Secrets Act. Charges against them were dropped on Monday.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Commons Speaker Sir Lindsay Hoyle has protested to the home secretary after prosecutors dropped charges against two men accused of spying for China and targeting MPs. Sir Lindsay told Sky News the decision \"leaves the door open\" to foreigners spying on the House of Commons, and he has written a \"strong and punchy\" letter to Shabana Mahmood. The Speaker says \"all avenues\" must be pursued to ensure the protection of MPs and Commons staff, and he is understood to be weighing up whether to carry out a private prosecution. The men - Christopher Cash, a former parliamentary researcher and director of the China Research Group, and Christopher Berry - were charged last April under the Official Secrets Act. The charges related to \"espionage within parliament\", security minister Dan Jarvis told MPs on Monday, in a statement after the case was dropped by the Crown Prosecution Service at the Old Bailey. The pair were accused of targeting the China Research Group of MPs, whose leading members are former Tory security minister Tom Tugendhat, shadow home office minister and former foreign affairs committee chair Alicia Kearns, and shadow minister Neil O'Brien. Announcing the CPS decision, a spokesperson said: \"In accordance with the Code for Crown Prosecutors, the evidence in this case has been kept under continuous review and it has now been determined that the evidential standard for the offence indicted is no longer met. No further evidence will be offered.\" \n                  Trump and Xi discuss TikTok deal to stop US ban\n                 \n                  Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 \n                 \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 Mr Cash and Mr Berry, who had both previously taught in China, said after the case against them was dropped that charges should never have been brought. Speaking outside court, Mr Cash - previously a researcher for Ms Kearns - said: \"While I am relieved that justice has been served today, the last two and a half years have been a nightmare for me and my family.\" He said he hoped \"lessons are learned from this sorry episode\", while his lawyer said his client was \"entirely innocent and should never have been arrested, let alone charged\". Revealing that he has now written to the home secretary, Sir Lindsay told Sky News: \"As Speaker, I take the security of this House incredibly seriously. I believe this leaves the door open to foreign actors trying to spy on the House. \"This door must be closed hard. We must pursue all avenues to ensure the protection of Members and people that work within the House of Commons. It will not be tolerated.\" Ahead of Mr Jarvis's Commons statement on Monday, Sir Lindsay told MPs: \"I found out only this morning that the charges against the two individuals relating to espionage for the Chinese authorities were to be dropped. I do not think that is good. \"I ask officials to consider whether any further steps should be taken-operational, strategic, or legal-to ensure that all those who work in this parliament are able to undertake their activities securely and without interference.\" And he concluded: \"I am a very unhappy Speaker with what has happened. The fact that it has taken two years, until today, for somebody to withdraw this case is not good enough.\" Read more from Sky News:NATO responds after Russian military jets 'violate' Estonian airspaceLorry driver 'distracted' by pornography on phone seconds before killing manTwo ambulance workers arrested in connection with six deaths Mr Jarvis told MPs: \"The government remain gravely concerned about the threat of Chinese espionage. Parliament and our democracy are sacrosanct, and any attempt by any foreign power to infiltrate or interfere with parliamentary proceedings is completely unacceptable.\" He added: \"This was an independent decision made by the CPS, and it is not for any government minister to speculate on the reasons behind it. \"The government are extremely disappointed with the outcome in this case, and we remain extremely concerned about the espionage threat posed to the United Kingdom.\" Responding to Mr Jarvis's statement, Ms Kearns told MPs: \"From a securities perspective, today's events are disastrous. They will embolden our enemies and make us look unwilling to defend our own nation, even when attacked in this place, the mother of all parliaments.\""
    },
    {
        "title": "Gender testing rules would have earned me an Olympic medal, says former UK athlete Lynsey Sharp",
        "description": "Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then.",
        "url": "https://news.sky.com/story/gender-testing-rules-would-have-earned-me-an-olympic-medal-says-former-uk-athlete-lynsey-sharp-13433920",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-caster-semenya-lynsey-sharp_7025067.jpg?20250919122456",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Sharp's comments come ahead of the Women's 800m final at the World Athletics Championships in Tokyo, in which British star Keely Hodgkinson is odds-on favourite.",
        "Content": " Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then. Sharp came sixth in the women's 800m final behind three now-barred athletes with differences in sexual development (DSD). She told sports presenter Jacquie Beltrao the sport has changed considerably from when she was competing. \"Sometimes I look back and think I could have had an Olympic medal, but I gave it my all that day and that was the rules at the time,\" she said. \"Obviously, I wish I was competing nowadays, but that was my time in the sport and that's how it was.\" The Rio women's 800m final saw South Africa's Caster Semenya take gold, with Burundi's Francine Niyonsaba and Margaret Wambui winning silver and bronze respectively. All three would have been unable to compete today. Semenya won a total of two Olympic gold medals before World Athletics introduced rules limiting her participation in the female class. \n                  Caster Semenya did not get fair hearing in sex eligibility case, human rights court rules\n                 \n                  World Athletics to introduce mandatory sex testing for female competitions\n                 \n                  Keely Hodgkinson 'heartbroken' after world record hopes shattered by injury\n                 In a major policy overhaul introduced this year, World Athletics now requires athletes competing in the female category at the elite level of the sport to take a gene test. The tests identify the SRY gene, which is on the Y chromosome and triggers the development of male characteristics. The tests replace previous rules whereby athletes with DSD were able to compete as long as they artificially reduced their testosterone levels.  Sharp says while she was competing, governing bodies \"didn't really deal with the issue head on\", and she was often portrayed as a \"sore loser\" over the issue. Despite running a Scottish record in that race, her personal best, she described the experience as a \"really difficult time\". \"Sadly, it did kind of taint my experience in the sport and at the Olympics in Rio,\" she said. Sharp added that despite the changes, it remains a \"very contentious topic, not just in sport, but in society\". Read more:World Athletics to introduce mandatory sex testingCaster Semenya ruling on sex eligibility caseOlympic gold medallist appeals over genetic sex testing Boxing has now also adopted a compulsory sex test to establish the presence of a Y chromosome at this month’s world championships. The controversial Olympic champion Imane Khelif, who won Olympic welterweight gold in Paris 2024 in the female category, did not take it and couldn’t compete. She has appealed to the Court of Arbitration for Sport against having to take the test. Sharp's comments come as British athletics star and Olympic champion Keely Hodgkinson is tipped to win her first world title in Sunday's women's 800m final at the World Athletics Championships in Tokyo. She is returning from a year out after suffering two torn hamstrings."
    },
    {
        "title": "Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'",
        "description": "Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration.",
        "url": "https://news.sky.com/story/lib-dems-toughen-up-immigration-rhetoric-as-sir-ed-davey-pledges-to-stop-the-boats-13433984",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7025218.jpg?20250919142857",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Lib Dem leader Sir Ed Davey spoke to Sky News about Reform, policies and whether he would do a deal with Labour, ahead of his party's annual autumn conference.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration. The party leader told Sky News he and his MPs will be talking about immigration during his party's conference, which starts today, as it is a \"big policy which people are concerned about\". He also claimed the Lib Dems are the only party \"taking on Reform\" with different ideas on how to solve people coming to the UK in small boats. The party's manifesto says it would work with Europol and the French authorities to \"stop the smuggling and trafficking gangs\" behind the crossings, but as immigration has become one of the most contentious topics in the UK, Sir Ed appears to have hardened his tone on the subject. He told Sky News: \"We'll talk about how we stop the boats, how we close down the asylum hotels. \"But we've got thought-through policies about how you would do that in a humane way, unlike people like Farage and the Conservatives.\" Sir Ed blamed the Conservatives and Reform leader Nigel Farage for Brexit and taking the UK out of the Dublin Convention, which means asylum seekers can only make a claim in the EU country they first arrived in. \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \n                  Lib Dems eye Labour-held cities as they target 'seats not votes'\n                 He said the Lib Dems \"know how we can solve\" the small boats issue, as he put his party forward as the only one to take on Reform. \"We need to process the applications really quickly, deport people who have no right to be here, and if they have a right to be here, get them working so the taxpayer isn't paying for the hotels,\" he added. \"These are practical ways forward, and we're the only party taking on Reform with different ideas for solving this.\" Political correspondent Bournemouth is famous for its sandy beaches, sunny weather and wholesome seaside attractions. But over the summer it also became infamous for the number of asylum seekers put up in its hotels.  This weekend, it’s also hosting the Liberal Democrats' annual conference, and while most political parties are competing to sound tougher on illegal migration - the Lib Dems are still putting forward a more humanitarian approach, albeit with a slightly harder tone.  While today, they’re calling for the government to speed up the asylum decision-making system with ‘nightingale’ style temporary processing centres, the fundamentals of their policy do not seem to have changed.  They still want to expand the number of safe and legal routes for those escaping war and persecution, so that people can apply for asylum without crossing the channel illegally.  They’re also calling for asylum seekers to be able to work while awaiting decisions to be made on their cases.  \"Anybody sensible wants a fair and effective immigration asylum system,\" says Lisa Smart MP, the party’s home affairs spokesperson.  \"We’ve seen Reform UK just sat shouting and sounding very angry, we’ve increasingly heard the Tories moving closer and closer to them, and Labour acting like a tribute act. \"We want a fair and effective system which treats people coming here, fleeing war and persecution, like human beings.\" Some voters I spoke to in Bournemouth told me they supported the principle of welcoming genuine refugees wanting to come to the UK to build a better life, and liked the idea of creating more safe and legal routes.  But there was also widespread scepticism about the lack of progress made by successive governments in tackling illegal migration - with many keen for a tougher approach.  Two former Lib Dem voters told me they’d been turned away from the party because of their concerns about people breaking into the country and putting pressure on its creaking infrastructure.\n\n Recent polling suggests immigration is now the biggest concern for voters. \nLuke Tryl of organisation More in Common says it could be a problem for the Lib Dems trying to broaden their appeal at the next election. \"The difference with Liberal Democrat voters is that despite the fact they have that shared view with the majority of the rest of the public  (that levels of immigration should come down) it's a less important issue for them,\" he says.  \"If the Liberal Democrats want to grow, if they want to go beyond last year's election result and perhaps position themselves as a future coalition partner for the Labour Party, I think voters are going to want to see a more comprehensive offer on immigration.\"\n For those taking part in weekly protests outside the Roundhouse - one of three town centre hotels booked out by the Home Office for housing asylum seekers - there was considerable anger. \nMany of those protesting told me they feel ignored.  \"As you can see we’ve had enough,” said Mark Dean.  \"We can’t just sit on our sofas and say nothing and expect the country to change, because it will not.\" \"I work at a homeless shelter two days a week and there are so many people who use that who have to sleep in tents on the beach,\" said Sarah Turnbull.  \"It’s heartbreaking to see how many people in our area are struggling just to feed themselves and we’re spending millions on illegal migrants.\"\n The Lib Dems are unlikely to win over many of the voters protesting outside asylum hotels. But this weekend’s conference is an opportunity to try and pitch to those uncomfortable with the right wing tilt of public debate on the issue. We should be worried about Reform The Lib Dem leader's reaction to Reform, which has consistently led the opinion polls recently, has also hardened. Since last summer's election, the Lib Dems have generally chosen to avoid attacking Reform or Labour, with Sir Ed going for the Conservatives' record instead. Lib Dem insiders previously said the tactic was to let Reform implode.  However, after Mr Farage swooped in over the summer parliamentary recess with numerous headline-grabbing news conferences, Sir Ed is taking a different tactic. He said it is still very early on this parliament, which is set to end in 2029, and the Lib Dems are building on their record result last year, which saw them gain 61 MPs for a total of 72, by doing well in May's local elections. But, he said: \"I think people should be worried about Reform. \"They represent a set of issues which I don't think are British issues. They suck up to Donald Trump and Elon Musk. Nigel Farage thinks Vladimir Putin, the president of Russia, is the world leader he admires the most. \"Nigel wants to frack across England's countryside. He wants to have American-style health insurance. I don't think people want that. \"And the more Nigel Farage and Reform are exposed for what they believe in, the more people look for other parties of change. \"Clearly not Labour, the Tories - they're not trusted, they've failed. \"But the Liberal Democrats have a change agenda which is true to British values, which is genuinely patriotic and which will solve the day-to-day problems that people are worried about, like health, like care, like the cost of living.\" And will Sir Ed be taking part in more stunts this conference after becoming famous for them during the election campaign? Yes he will, he confirmed, but you (and he) will have to wait and see. The Liberal Democrat conference is taking place from 20-23 September. Sky News will be bringing you all the coverage live from Bournemouth."
    },
    {
        "title": "By-elections that shook up politics – could Andy Burnham be next?",
        "description": "By-election counts are the FA Cup ties of British politics.",
        "url": "https://news.sky.com/story/by-elections-that-shook-up-politics-8211-could-andy-burnham-be-next-13433626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-polling-polling-place_6934302.jpg?20250604095831",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "No subtitle found",
        "Content": "\n          Chief political correspondent\n              @joncraig\n By-election counts are the FA Cup ties of British politics. Some go true to form, but many are tense, nail-biting, go deep into extra time and provide upsets and shocks by political giant killers. Publisher and broadcaster Iain Dale has published a weighty book, British By-elections: The 88 By-election Campaigns That Shaped Our Politics. Could Labour's King of the North, football fanatic Andy Burnham, who's tipped to come off the bench and contest Gorton and Denton in a by-election, be next? Burnham fuelled speculation about a Commons comeback when he said in an interview on Thursday he had \"never ruled out going back to Westminster\". With chapters written by politicians, academics and journalists in his book, Dale claims his 88 are the most consequential by-elections of the modern era. Now I can't claim to have covered 88 by-election counts for Sky News. After all, the first was in 1769 and 70 of the 88 in the book were before the 21st century. \n                  Greater Manchester Police investigating grooming cases with more than 700 victims\n                 \n                  Andy Burnham: 'Nigel Farage could become PM - this is how Labour can stop him'\n                 \n                  Labour needs to focus on the working class, says Andy Burnham \n                 But I have covered 44, if I'm not mistaken, starting in 2003, and I'm grateful for a few mentions in the book, some flattering, some less so. But there you go. \"There's rarely a dull by-election,\" Dale writes in his preface. \"Some by-elections take on iconic status and are remembered several decades after they take place. \"Others quickly disappear into the depths of our memories, rarely to be thought about ever again.\" The first by-election I covered for Sky News, in September 2003, was Brent East, which saw a shock win for the Liberal Democrats over Labour. The most recent was Runcorn and Helsby, in May this year, when Reform UK's Sarah Pochin was just six votes ahead of Labour after an all-nighter and a result at 6am. When there's a recount, I've joked about VAR holding up the result. I even covered one by-election count, Stretford and Urmston, at the Old Trafford football ground. Over 22 years of covering by-election counts I hope I've learned the tricks of the trade when the result is on a knife-edge: One, look closely at the piles of ballot papers; two, see which candidate has a victory speech in their hand or pocket. But most important, three, find out what's said in the huddle when the returning officer calls the candidates and their agents together to brief them on the result ahead of the declaration. It may have been my first TV count after more than 20 years in newspapers, but lesson three served me well at Brent East, as my former Sky News colleague Joe Pike reveals in his chapter on Sarah Teather's triumph. \"Jon Craig, Sky News' new signing, who would go on to broadcast from more than 40 by-election counts, announced Labour's loss even before the returning officer had stood up,\" Pike writes. \"(Robert) Evans (Labour's candidate) tipped him off that Labour had lost by 1,000 votes and Craig passed on the revelation on live TV.\" Thanks, Joe. I'd kept quiet about how I discovered the result until now. A glaring omission from the book, in my opinion, is George Galloway's upset in Bradford West in 2012. When Sky News arrived at the count, everyone in the hall was predicting a Labour win. But gradually the mood changed. I texted George: \"Labour getting jitters here, George! Say you're doing very well. What do you think?\" \"Think I'm going to win, Jon,\" he replied instantly. \"Labour and Tory MPs think so too,\" I told him. \"Keen to get you on TV.\" I called him and urged him to come to the count and claim victory. And 'Gorgeous George', never one to be shy or turn down publicity, duly obliged. He'd turned a Labour majority of nearly 6,000 into a victory for his Respect Party by more than 10,000 votes, a swing of more than 50%. Richmond Park, in 2016, and Copeland, 2017, are in the book. My memory of Richmond Park is chasing a very angry Zac Goldsmith, the Tory Heathrow expansion rebel, around the count after he lost to the Lib Dem Sarah Olney. Hartlepool, in 2021, was a by-election that really did take on iconic status. It was a rare Tory gain, a victory for Boris Johnson in the Red Wall and it threw the new Labour leader Sir Keir Starmer into a panic. He sacked his chief whip, Nick Brown, tried to demote his deputy, Angela Rayner. But that backfired, as she acquired even more titles. He's since admitted he considered quitting. The result came at 7.10am, by which time a giant inflatable Boris Johnson doll had been erected outside the count. My post-results broadcasts were from in front of that. Oh, and on the Monday, back in Westminster, I tested positive for COVID. Red Wall COVID. The second Batley and Spen by-election, later in 2021, saw 'Gorgeous George' attempt to repeat his Bradford West triumph. Tracy Brabin had succeeded the murdered Jo Cox in 2016 but had quit to become West Yorkshire mayor. This time Kim Leadbeater, Jo's sister and now the assisted dying crusader, was Labour's candidate. Galloway was described by author Emma Burnell in the book as \"a serial candidate over the years, with varying levels of success\". This \"Red Wall\" clash was, though, a classic knife-edge by-election, running deep into extra time, with Leadbeater squeezing home by 323 votes ahead of the Tory candidate Ryan Stephenson. Cue VAR gags during the delays. \"On election night, neither Labour nor the Conservatives were confident of victory,\" writes Burnell, editor of LabourList. \"Mobile phones were banned from the count and so most of the news the candidates were receiving was through television coverage. \"At one point, Sky's Jon Craig declared that the Tories had won and it was just a case of by how much. However, Stephenson delights in telling the story of his entering the count later (now aware of how the night had gone) to overhear Craig announcing to the nation: 'The loser, Mr Stephenson, has now arrived.' \"Leadbeater, meanwhile, had not prepared her victory speech, convinced as she was that she had lost.\" My recollection, however, is different and I'm sure she did have a speech. (Lesson two) At Mid-Bedfordshire in 2023 after Nadine Dorries' resignation, LBC radio's Henry Riley recalls a tense count and writes: \"The only brief moment of levity was when veteran by-election reporter-in-chief Jon Craig of Sky News was presented with a cake by the High Sheriff of Bedfordshire, Russell Beard, to celebrate his 40th by-election.\" From new signing to veteran in just 20 years. It's a cruel world. In Rochdale last year, George Galloway was back. And this time he won by nearly 6,000 votes and became the first MP elected to represent a fourth different Westminster constituency since Winston Churchill, Sunder Katwala tells us in the book. George and I are old comrades, going back to his days as a left-wing firebrand in the Labour Party. I was a touch embarrassed at Rochdale, however, when he said during our post-result interview: \"You bought me lunch!\" Runcorn and Helsby was so close - six votes - that the count dragged on until 6am after a massive recount. \"As the night turned to morning, Labour staff looked more and more nervous,\" writes ITV's Harry Horton in the book. \"Reform's team appeared nervous. At one point, a Reform aide instructed photographers to assemble at the door for the arrival of Nigel Farage. \"One broadcaster claimed he'd seen the Reform leaders circling the car park outside but had driven off when it appeared Labour might sneak a win. Farage later denied anything of the sort had ever happened.\" Well, as the \"one broadcaster\" referred to by Harry, there was indeed a car circling the car park. But, admittedly, it was dark! We all make mistakes. There have been a few blunders. At one count, not long after she became an MP, I mistook Angela Rayner for Jess Phillips. Fortunately, she told me she was flattered. Whatever happened to her? So where next on the by-election fixture list? Will Andy Burnham contest Gwyne's seat prior to challenging Sir Keir Starmer for the Labour captaincy? With Reform UK the challengers in Gorton and Denton, that's a by-election that could be one for VAR."
    },
    {
        "title": "Man dies after falling from hot air balloon in West Sussex",
        "description": "A man has died after falling from a hot air balloon in West Sussex.",
        "url": "https://news.sky.com/story/man-dies-after-falling-from-hot-air-balloon-in-west-sussex-13434276",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-newpound-common-balloon_7025688.png?20250919211724",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 19:25:00",
        "Headline": "Police said the victim had been among a group of people on a flight and was reported to have fallen near Newpound Common, Wisborough Green.",
        "Content": "A man has died after falling from a hot air balloon in West Sussex. He was reported to have fallen near Newpound Common, Wisborough Green, on Friday morning. His body was found in a field on Friday afternoon following a search. Police said the victim had been among a group of people on a flight from Billingshurst to Dunsfold. He is yet to be formally identified and the death is not being treated as suspicious. Read more from Sky News:'Legendary' songwriter killed in plane crash'Predatory' rapist could have given HIV to hundreds of men Sussex Police said it was called to a \"report of a man having fallen from a hot air balloon\" shortly after 9.20am. \"Following an extensive search the body of a man was sadly found in a field at 1.50pm,\" the force added. \"The search was carried out by neighbourhood officers, police drones, search officers and dogs.\" An investigation into what happened is under way, police said."
    },
    {
        "title": "'Israeli strikes' on Yemen newspaper offices 'mark deadliest attack on press in 16 years'",
        "description": "Israeli strikes on newspaper offices in Yemen killed 31 journalists and media support workers, according to the outlet struck and the Committee to Protect Journalists (CPJ).",
        "url": "https://news.sky.com/story/israeli-strikes-on-yemen-newspaper-offices-mark-deadliest-attack-on-press-in-16-years-13434090",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-funeral-sanaa-yemen_7021820.jpg?20250916082138",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 16:25:00",
        "Headline": "The 26 September newspaper is the official outlet of the Yemeni army, which is under the control of Houthi rebels in Sanaa.",
        "Content": "Israeli strikes on newspaper offices in Yemen killed 31 journalists and media support workers, according to the outlet struck and the Committee to Protect Journalists (CPJ). Nasser al Khadri, editor-in-chief of the publication 26 September, told the CPJ that the offices in Sanaa were hit on the afternoon of 10 September. A child, who had accompanied a journalist to work, was among the dead, Mr al Khadri said, while 22 journalists were injured. The reported attack by the Israel Defence Forces (IDF) marked the deadliest single strike on the press since 2009, according to the CPJ. That year, 32 journalists were killed when a convoy was ambushed in the Maguindanao massacre in the Philippines.  The newspaper is the official outlet of the Yemeni army, which is under the control of Houthi rebels in Sanaa. The Yemeni Journalists Syndicate (YJS), which is affiliated to the International Federation of Journalists, acknowledged the 26 September publication was Houthi-controlled. \n                  Why Starmer's move to recognise Palestine is a major shift\n                 \n                  Gaza could be 'real estate bonanza', Israeli minister Bezalel Smotrich says\n                 \n                  'At least 16' killed in latest Israeli attacks on Gaza - as 10 children arrive in UK for NHS treatment\n                 But it stressed that several civilian journalists with no military affiliation were among those killed in the strikes. Speaking to the CPJ, Mr al Khadri said the strikes marked an \"unprecedented massacre of journalists\". \"It is a brutal and unjustified attack that targeted innocent people whose only crime was working in the media field,\" he added, \"armed with nothing but their pens and words\". The IDF said in a statement on 10 September that it had \"struck military targets belonging to the Houthi terrorist regime in the areas of Sanaa and Al Jawf in Yemen\", including the Houthi public relations department, which it said was \"responsible for distributing propaganda messages in the media and psychological terror\". Read more:Media groups unite against Israeli attacksWho were the Al Jazeera journalists killed by Israel? In an email response to the CPJ's questions about the strike on the 26 September offices on Thursday, the IDF again mentioned the Houthis' public relations department, and said it was \"responsible for distributing and disseminating propaganda messages in the media\". Reporters Without Borders (RSF) said at the start of September that 220 journalists in Gaza had been killed by the Israeli army since October 2023. The IDF has insisted its forces do not target the media, and has claimed some journalists killed have been members of Hamas. It comes after five Al Jazeera employees were killed in an Israeli strike in Gaza last month, including a journalist who feared he was going to be assassinated. Anas al Sharif died alongside four of his colleagues from the network: Mohammed Qreiqeh, Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa. Analysis: Israel may say it is not targeting journalists - but it is certainly killing a lot of them The IDF confirmed the strike - and alleged that al Sharif was a \"terrorist\" who \"served as the head of a terrorist cell in the Hamas terrorist organisation\"."
    },
    {
        "title": "Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II",
        "description": "A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\".",
        "url": "https://news.sky.com/story/sculptor-martin-jennings-chosen-to-create-statue-for-national-memorial-to-queen-elizabeth-ii-13434095",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-martin-jennings-sculpture_7025405.jpg?20250919172036",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Martin Jennings said he expects there will be \"considerable interest\" in his design from the Royal Family, with the King \"keen that his mother should be represented appropriately\".",
        "Content": " A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\". Martin Jennings, who has also portrayed the Queen Mother and King Charles in past works, told Sky News he was \"delighted\" when he received the call saying he'd been invited to join the project. \"I mean, I was absolutely thrilled,\" he said. \"It's a terrific commission to be asked to do and to be quite honest, I can't quite remember what the rest of the phone call was all about - I was so delighted to have been appointed.\" Mr Jennings will now set about creating the statue of the late Queen in the planned national memorial in London called Queen Elizabeth II Place. It will provide the public with a permanent space to commemorate the country's longest-reigning monarch, who died in 2022. He said that while the design for the statue is yet to be decided, he would like for it to have a sense of \"stillness\", which reflects the \"dignity\" and \"grace\" of her reign. \n                  In pictures: Memorable moments between the royals and US presidents\n                 \n                  Trump state visit: The royals will want to send him home happy - and one absentee may be a relief to him\n                 \n                  The King, Prince William and Kate attend Duchess of Kent's funeral  - as Buckingham Palace says Queen withdrew due to illness\n                 \"I would like it to be an object of delight for people,\" he said. \"I don't want it to be too grave. It needs to have panache, it needs to have grandeur to suit its site, it needs to have a kind of delight to it. \"But she was so constant that the dignity, the restraint and the grace that we associate with her are things that at the moment are at the forefront of my mind.\" Architect Lord Norman Foster, known for designing The Gherkin, has won the bid to design the memorial, which will be located at Marlborough Gate in St James's Park, close to Buckingham Palace. It will also feature a new Prince Philip Gate on the other side of the park on Birdcage Walk with a statue of Philip, as well as a \"family of gardens\", meandering paths and a new translucent, glass unity bridge. A panel of committee members will work with the team on the final design, which is expected to be unveiled in 2026 - the late Queen's 100th birthday year. Mr Jennings told Sky News he expects there will be \"considerable interest\" from the Royal Family, with the King \"keen that his mother should be represented appropriately\". \"I hope it will be something that both they and the general public are proud of,\" he said. Read more:See images of planned Elizabeth II memorialMemorial to Queen Elizabeth II must reflect 'extraordinary life' Mr Jennings said that at this early stage in this process, he intends to \"do a lot of listening\" when it comes to the design, with decisions including the stage of her life he will depict not yet taken. He said he expects that, like his previous works, the original version of the statue will be produced in clay, and then casted in bronze, but stressed \"I don't want to pin it down at this stage\". Mr Jennings has also created a bust of the Queen Mother, which is in St Paul's Cathedral, and the first crowned coinage portrait of the King. The 68-year-old has also crafted statues of George Orwell outside BBC Broadcasting House, Philip Larkin in Hull, Mary Seacole in London's St Thomas' Hospital and the Women Of Steel in Sheffield. The Queen Elizabeth II memorial project has a provisional construction budget of between £23m and £46m excluding VAT."
    },
    {
        "title": "'Predatory' rapist could have given HIV to hundreds of men as police launch appeal",
        "description": "A man convicted of rape and reckless transmission of HIV could have given the sexually transmitted disease to hundreds of men, according to police.",
        "url": "https://news.sky.com/story/predatory-rapist-could-have-given-hiv-to-hundreds-of-men-as-police-launch-appeal-13434062",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jonathan-carl-met-police_7025391.jpg?20250919165522",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-19 15:29:00",
        "Headline": "Detectives believe Jonathan Carl had sexual contact with up to 400 men over a four-year period.",
        "Content": "A man convicted of rape and reckless transmission of HIV could have given the sexually transmitted disease to hundreds of men, according to police. Jonathan Carl, 42, of Hornchurch, east London, was jailed for 17 years in June after he was found guilty of one count of rape and pleaded guilty to one count of grievous bodily harm. The Metropolitan Police believes Carl, who used multiple dating apps including Grindr and Scruff, had sexual contact with up to 400 men between 2019 and 2023. Of those, detectives have spoken to 82 men, with officers saying some of them had tested positive for HIV. But they think up to 318 others need to be identified and also tested for the disease, as police appealed for potential victims to come forward. Carl, who police described as a \"predatory individual\", was arrested in January 2024 after two men reported allegations of rape with the offences said to be in October 2022 and August 2023. A victim, in a statement, said: \"(I felt) powerless, I felt like there was nothing I could do. It made me feel like I didn't matter, it made me feel less than human. \n                  Luigi Mangione: Terrorism charges dropped against alleged killer of healthcare boss\n                 \n                  Charlie Kirk suspect Tyler Robinson appears in court - as prosecutors say they will seek death penalty\n                 \n                  Alistair Wilson murder: 'Significant amount' of police work carried out on unsolved doorstep shooting\n                 \"The main reason I came forward to police, is because I wanted to stop this from happening to anyone else.\" Another said: \"It has damaged me from having any sort of romantic relationship in the future, due to people's overall thoughts on HIV. \"It makes me fry my brain as I overthink about what I could have done differently. I still struggle with this guilty feeling.\" Carl was convicted at Snaresbrook Crown Court. He was also served with a 15-year sexual prevention order where he has to tell police within three days of having a new sexual partner and has to disclose his HIV status if he is not taking his medication. Appeal for victims to come forward Detective Chief Inspector Sarah Bishop said: \"Our investigation uncovered the scale of Carl's offending and ensured he was brought to justice. \"But we remain extremely concerned about the wellbeing of those who have not yet been identified. We believe as many as 318 men may be a victim, and might need to come forward for testing and support. \"You may have met Carl through an online dating platform, or visited his home address in Hornchurch, which is distinctively located above a fish and chip shop. \"Your health and wellbeing are our absolute priority. We are working closely with NHS partners and charities to ensure anyone affected can access confidential testing, advice, and support. Please be assured you are not alone - we are here to help.\" Anyone who may have had contact with Carl is urged to get in touch with detectives directly on 0207175273 or email survivors@met.police.uk"
    },
    {
        "title": "Elderly British couple held for months by Taliban reunited with daughter",
        "description": "An elderly British couple who have been freed after being detained by the Taliban earlier this year have been reunited with their daughter.",
        "url": "https://news.sky.com/story/elderly-british-couple-detained-in-afghanistan-freed-13433792",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-afghanistan-peter-reynolds_7025257.jpg?20250919144958",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 07:19:00",
        "Headline": "Peter and Barbie Reynolds were detained by the Taliban's interior ministry on 1 February. They ran a training programme in Afghanistan.",
        "Content": " An elderly British couple who have been freed after being detained by the Taliban earlier this year have been reunited with their daughter. Barbie Reynolds, 76, and her husband Peter, 80, were detained by the Taliban's interior ministry on 1 February as they travelled to their home in Bamyan province, central Afghanistan. In March, they were moved to a maximum security prison in Kabul where they had been held without charge. In the final stages of negotiations they were transferred to Kabul's central prison. They were safely released from detention on Friday and flown to Doha following mediation led by Qatar. As they touched down in Doha, Sky correspondent Sally Lockwood said she saw the \"joy\" on Mrs Reynolds' face as her daughter Sarah hugged her on the tarmac. She told Lockwood it was \"wonderful\" to have arrived in Qatar. Earlier, Sky correspondent Cordelia Lynch was at Kabul Airport as the freed couple arrived and departed. Mr Reynolds told her: \"We are just very thankful.\"  His wife added: \"We've been treated very well. We're looking forward to seeing our children. \"We are looking forward to returning to Afghanistan if we can. We are Afghan citizens.\" Asked by Lynch if they had a message for family and friends, Mrs Reynolds replied: \"My message is God is good, as they say in Afghanistan.\" Prime Minister Sir Keir Starmer welcomed the news in a statement thanking Qatar. \"I welcome the release of Peter and Barbara Reynolds from detention in Afghanistan, and I know this long-awaited news will come as a huge relief to them and their family,\" he said. \"I want to pay tribute to the vital role played by Qatar, including The Amir, His Highness Sheikh Tamim bin Hamad al Thani, in securing their freedom.\" Richard Lindsay, the UK's special envoy to Afghanistan, told Lynch it remained \"unclear\" on what grounds the couple had been detained. He said they were \"very relieved to be going home and delighted to be reunited with their family\". Asked about the state of their health, he said: \"I am not a doctor, but they are very happy.\" He added the British government's travel advice to the country was clear. \"We advise British nationals not to travel to Afghanistan. That remains the case and will remain the case,\" he said. Abdul Qahar Balkhi, a spokesperson at the Taliban government's foreign ministry, said in a statement posted on X that the couple \"violated Afghan law\" and were released from prison after a court hearing. He did not say what law the couple were alleged to have broken.  Qatar, the energy-rich nation on the Arabian Peninsula that mediated talks between the US and the Taliban before the American withdrawal, helped in releasing the Reynolds. Mirdef Ali Al-Qashouti, acting charge d'affaires at the Qatar Embassy in Kabul, told Lynch that Qatari officials ensured the couple were kept in \"comfortable\" conditions during talks. He told Lynch the Reynolds' release was because of \"continuous efforts by my government to keep our policy in helping releasing hostages and our mediation and diplomacy\". \"Throughout their eight months in detention - during which they were largely held separately - the Qatari embassy in Kabul provided them with critical support, including access to their doctor, delivery of medication, and regular communication with their family,\" a Qatari official told Reuters news agency. Asia correspondent At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors. On the runway a plane waited, the steps ready for what appeared to be an imminent departure. We had heard from our sources about the possible release of Peter and Barbie Reynolds, the elderly British couple detained in February, but we had no official confirmation yet. Then, from behind a double door, I caught the eye of Barbie. The 76-year old smiled at me - her face seemingly bright with relief. Her husband, Peter, 80, then stepped into frame. A tall gentle looking man, his eyes looked filled with emotion. Their relief and gratitude was immediately apparent. It was of course impossible to know what state their health was in, but they appeared alert and composed, despite nearly eight months in detention. The couple's son, Jonathan, had previously said his father had been suffering serious convulsions and his mother was \"numb\" from anaemia and malnutrition. The UN had also described their conditions as \"inhumane\". But today, as he prepared to leave the country, Peter wouldn’t be drawn on the conditions he faced. \"We’re just very thankful, very thankful,\" he told me. Barbie, who spent part of her detention in a separate facility, looked strikingly calm - a graceful and understated demeanour. “We’ve been treated very well,” she said as she made her way to the plane. Taliban officials maintained they received adequate medical care in prison and their human rights were respected. Read Cordelia Lynch's full eyewitness story here\n Hamish Falconer, minister for the Middle East, Afghanistan and Pakistan, said in a statement: \"The UK has worked intensively since their detention and has supported the family throughout. \"Qatar played an essential role in this case, for which I am hugely grateful.\" The couple have lived in Afghanistan for 18 years and run an organisation called Rebuild, which provides education and training programmes. They have been together since the 1960s and married in the Afghan capital in 1970.  Read more from Sky News:Afghans relocated to UK 'exaggerating' Taliban threat Their son, Jonathan, told Sky News in April his parents had \"never heard one accusation or one charge\". He said the British government had offered to evacuate them when the Taliban took over, to which they replied: \"Why would we leave these people in their darkest hour?\" Mr and Mrs Reynolds are now on their way home, where they will be reunited with their family. Speaking to Sky News from Wyoming in the United States following their release, Jonathan said he was \"excited\" to be seeing his parents again, and joked: \"I'm a little bit jealous of my dad's beard.\" \"They look really well to me,\" he said, \"which I'm just delighted about\". \"I am looking forward to putting my arms around them and giving them a big hug, as all of my siblings will be.\" He offered his \"special thanks\" to all the British and Qatari diplomats involved in his parents' release.  He said the grounds for their detention remained a mystery as they were given no explanation for their arrest. \"They were investigated for all kinds of things but everything came up with no evidence of any wrongdoing,\" he said. \"One of them, the original arrest, they said something about flying a drone - my parents don't own a drone. It's hard enough trying to get them to know how to use certain new technologies, let alone a drone. \"So, yeah, bizarre things, but I think they were just people of interest and then got caught up in a big, big mess of a situation, and no one knew what to do. But I'm just happy they are home.\" Asked about their desire to return to Afghanistan, he said: \"It's probably not wise to go back to a place where they are not welcome, and I would say, clearly they are not welcome there.\" \"They are going to arrive back in the UK with the clothes on their backs. They have sold everything... all of their possessions,\" he said, when asked what the future held for his parents. \"Knowing my mum she has probably written a few books in her mind whilst she's been in captivity. \"We have heard great reports from schools across Afghanistan that the programmes they set up are running really, really well, so they will probably want to continue those,\" he added.    "
    },
    {
        "title": "She smiled and his eyes filled with emotion - the moment the Reynolds were freed by the Taliban",
        "description": "At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors.",
        "url": "https://news.sky.com/story/well-return-to-afghanistan-if-we-can-say-british-couple-detained-by-taliban-for-more-than-seven-months-13434038",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-barbie-reynolds_7024951.jpg?20250919103518",
        "type": "UK",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-09-19 14:27:00",
        "Headline": "Peter and Barbie Reynolds were relieved as they boarded a flight home, but what led to their arrest remains unclear.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors. On the runway a plane waited, the steps ready for what appeared to be an imminent departure. We had heard from our sources about the possible release of Peter and Barbie Reynolds, the elderly British couple detained in February, but we had no official confirmation yet. Then, from behind a double door, I caught the eye of Barbie. The 76-year old smiled at me - her face seemingly bright with relief. Her husband, Peter, 80, then stepped into frame. A tall gentle looking man, his eyes looked filled with emotion. Their relief and gratitude was immediately apparent. It was of course impossible to know what state their health was in, but they appeared alert and composed, despite nearly eight months in detention. The couple’s son, Jonathan, had previously said his father had been suffering serious convulsions and his mother was \"numb\" from anaemia and malnutrition. The UN had also described their conditions as \"degrading\". But today, as he prepared to leave the country, Peter wouldn’t be drawn on the conditions he faced. \"We’re just very thankful, very thankful,\" he told me. Barbie, who spent part of her detention in a separate facility, looked strikingly calm - a graceful and understated demeanour. “We’ve been treated very well,” she said as she made her way to the plane. Taliban officials maintained they received adequate medical care in prison and their human rights were respected. The couple’s four children campaigned carefully but consistently for their release. \"We’re looking forward to seeing our children,\" Barbie told me with a wide beam. I asked if she had a message for family and friends. \"God is good as they say here in Afghanistan,\" she declared. \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \n                  Afghans relocated to UK 'staged torture videos' and 'holiday in Afghanistan', ex-interpreter says\n                 \n                  Taliban orders 'complete ban' on fibre optic internet in northern Afghanistan, as reports says order will be enforced nationwide \n                 And despite their surprise detention, she hoped they would be back. “Will you return to Afghanistan?” I asked. “Oh yes, if we can,” she said. “We are Afghan citizens.” What happened The couple have been together since the 1960s and married in the Afghan capital, Kabul, in 1970. They have lived in the country for 18 years and ran an organisation called Rebuild, which provides educational and leadership programmes, including training for mothers and children. They have been described by family as having a lifelong love of Afghanistan. After the Taliban seized control in August 2021 and many other Westerners left, they decided to stay. They were arrested on their way home to Bamiyan. The Taliban has said the couple broke Afghanistan law. But after the couple faced four court proceedings, no charges were ever brought. In a statement today, Hamdullah Fitrat, Deputy Spokesman of the Islamic Emirate of Afghanistan, said: “Two British nationals named Peter and Barbara Reynolds, who had violated the laws of Afghanistan, were released from custody today following the judicial process. The Islamic Emirate of Afghanistan does not view the issues of its nationals from a political or bargaining perspective.” Both the UK and Qatari officials were keen to express their deep gratitude to Afghanistan's leadership for releasing the Reynolds. Richard Lindsay, Special Envoy to Afghanistan said it was a “very great humanitarian day\". But he acknowledged he did not know on what grounds the couple were held. The Qataris appeared to play a critical role in negotiating with the Afghan authorities. They said they were able to ensure medical assistance was provided and enable the couple to communicate with their families. “The release of Barbie and Peter Reynolds shows that when two parties are committed to reaching an agreement, Qatar’s mediators will find a way to achieve it,” one Qatari official told Sky News. In 2022, the Taliban banned Afghan women from working for NGOs. What led up to the arrest of the Reynolds, who dedicated so much of their lives to running an NGO is still unclear. But for their family, today is a day they had longed for."
    },
    {
        "title": "'Catfish' Stuart Latham jailed for sex offences against dozens of children including rape",
        "description": "A man has been jailed for sexual offences against dozens of children he \"catfished\" by pretending to be a 14-year-old boy.",
        "url": "https://news.sky.com/story/catfish-jailed-for-sex-offences-against-dozens-of-children-including-rape-13433825",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-stuart-latham-embargo_7025072.jpg?20250919175313",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 08:22:00",
        "Headline": "The 22-year-old, from Wigan, was sentenced for 49 charges including rape, blackmail, making indecent images and causing a child to engage in sexual activity.",
        "Content": " A man has been jailed for sexual offences against dozens of children he \"catfished\" by pretending to be a 14-year-old boy. Stuart Latham deceived the youngsters into believing he was a teenager to obtain indecent images from them, with a promise of cash or gift cards in return. A sergeant in the investigation told Sky News Latham was \"one of the most dangerous sexual child predators\" he's ever seen. The 22-year-old, from Wigan, was sentenced at Preston Crown Court for 49 charges including rape, blackmail, making indecent images and causing a child to engage in sexual activity. He was jailed for 14 years on Friday - as one of his 41 victims told him: \"You have taken the child in me away from me.\" Sentencing Latham, the judge Philip Parry described him as a \"highly dangerous individual\" and a \"predatory sex offender with little to no empathy or remorse\". Latham - who used Snapchat to reach out to his victims - was sentenced for the rape of one of the girls, who was just 12 years old at the time. They met when Latham was 19 years old, but he told her he was 15. The court heard how he pretended to be a 14-year-old boy, using a fake picture, and posted an advert saying he would give girls a £200 gift card if they could \"help him out\" - by sending indecent images. He would later threaten the girls with leaking the images if they asked for them to be deleted. Several girls - some as young as 11 - responded. Speaking in court, both of the girls he abused in person read out their own victim impact statements. The first girl, who believed she was in a relationship with the offender, started to cry and said it was her first serious relationship - and when she found out what he had done to other girls her heart dropped. The girl's friend, who Latham also abused in person, addressed him directly, saying: \"I want you to realise I will never forget this. You have changed me. You have taken the child in me away from me.\" Offending was 'like a full-time job' Simon France, the detective sergeant in Greater Manchester Police's online child abuse investigation team, told Sky News Latham is \"one of the most dangerous sexual child predators\" he has ever encountered. \"Whether we'll see anything like this again, I don't know,\" he added. \"He lived at home with his family, doesn't appear that he did much in the day, but I know [a colleague] described his offending as a full-time job. \"He would sit in his bedroom and target children on a daily basis throughout the day… it's like it was his full- time job to get these children to do what he wanted.\" Read more:Two ambulance service workers arrested after six deathsElderly British couple held by Taliban reunited with daughter When Latham was arrested, police found a phone hidden in the back of a wardrobe which contained thousands of child sex abuse images - including Snapchats and videos that were up to an hour long, the court heard. GMP said they uncovered more than 4,000 indecent images on Latham's devices, but some data had been deleted before his initial arrest and couldn't be recovered - so the full scale of his offending \"could be much greater\". The case is thought to be one of GMP's largest multi-victim online child sex abuse cases. The victims were based across the country from Scotland to Bournemouth, but police believe there may be more victims in the US as well. GMP is encouraging anyone else who was targeted by Latham to contact them."
    },
    {
        "title": "Gender testing rules would have earned me an Olympic medal, says former UK athlete Lynsey Sharp",
        "description": "Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then.",
        "url": "https://news.sky.com/story/gender-testing-rules-would-have-earned-me-an-olympic-medal-says-former-uk-athlete-lynsey-sharp-13433920",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-caster-semenya-lynsey-sharp_7025067.jpg?20250919122456",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Sharp's comments come ahead of the Women's 800m final at the World Athletics Championships in Tokyo, in which British star Keely Hodgkinson is odds-on favourite.",
        "Content": " Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then. Sharp came sixth in the women's 800m final behind three now-barred athletes with differences in sexual development (DSD). She told sports presenter Jacquie Beltrao the sport has changed considerably from when she was competing. \"Sometimes I look back and think I could have had an Olympic medal, but I gave it my all that day and that was the rules at the time,\" she said. \"Obviously, I wish I was competing nowadays, but that was my time in the sport and that's how it was.\" The Rio women's 800m final saw South Africa's Caster Semenya take gold, with Burundi's Francine Niyonsaba and Margaret Wambui winning silver and bronze respectively. All three would have been unable to compete today. Semenya won a total of two Olympic gold medals before World Athletics introduced rules limiting her participation in the female class. \n                  Caster Semenya did not get fair hearing in sex eligibility case, human rights court rules\n                 \n                  World Athletics to introduce mandatory sex testing for female competitions\n                 \n                  Keely Hodgkinson 'heartbroken' after world record hopes shattered by injury\n                 In a major policy overhaul introduced this year, World Athletics now requires athletes competing in the female category at the elite level of the sport to take a gene test. The tests identify the SRY gene, which is on the Y chromosome and triggers the development of male characteristics. The tests replace previous rules whereby athletes with DSD were able to compete as long as they artificially reduced their testosterone levels.  Sharp says while she was competing, governing bodies \"didn't really deal with the issue head on\", and she was often portrayed as a \"sore loser\" over the issue. Despite running a Scottish record in that race, her personal best, she described the experience as a \"really difficult time\". \"Sadly, it did kind of taint my experience in the sport and at the Olympics in Rio,\" she said. Sharp added that despite the changes, it remains a \"very contentious topic, not just in sport, but in society\". Read more:World Athletics to introduce mandatory sex testingCaster Semenya ruling on sex eligibility caseOlympic gold medallist appeals over genetic sex testing Boxing has now also adopted a compulsory sex test to establish the presence of a Y chromosome at this month’s world championships. The controversial Olympic champion Imane Khelif, who won Olympic welterweight gold in Paris 2024 in the female category, did not take it and couldn’t compete. She has appealed to the Court of Arbitration for Sport against having to take the test. Sharp's comments come as British athletics star and Olympic champion Keely Hodgkinson is tipped to win her first world title in Sunday's women's 800m final at the World Athletics Championships in Tokyo. She is returning from a year out after suffering two torn hamstrings."
    },
    {
        "title": "Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II",
        "description": "A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\".",
        "url": "https://news.sky.com/story/sculptor-martin-jennings-chosen-to-create-statue-for-national-memorial-to-queen-elizabeth-ii-13434095",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-martin-jennings-sculpture_7025405.jpg?20250919172036",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Martin Jennings said he expects there will be \"considerable interest\" in his design from the Royal Family, with the King \"keen that his mother should be represented appropriately\".",
        "Content": " A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\". Martin Jennings, who has also portrayed the Queen Mother and King Charles in past works, told Sky News he was \"delighted\" when he received the call saying he'd been invited to join the project. \"I mean, I was absolutely thrilled,\" he said. \"It's a terrific commission to be asked to do and to be quite honest, I can't quite remember what the rest of the phone call was all about - I was so delighted to have been appointed.\" Mr Jennings will now set about creating the statue of the late Queen in the planned national memorial in London called Queen Elizabeth II Place. It will provide the public with a permanent space to commemorate the country's longest-reigning monarch, who died in 2022. He said that while the design for the statue is yet to be decided, he would like for it to have a sense of \"stillness\", which reflects the \"dignity\" and \"grace\" of her reign. \n                  In pictures: Memorable moments between the royals and US presidents\n                 \n                  Trump state visit: The royals will want to send him home happy - and one absentee may be a relief to him\n                 \n                  The King, Prince William and Kate attend Duchess of Kent's funeral  - as Buckingham Palace says Queen withdrew due to illness\n                 \"I would like it to be an object of delight for people,\" he said. \"I don't want it to be too grave. It needs to have panache, it needs to have grandeur to suit its site, it needs to have a kind of delight to it. \"But she was so constant that the dignity, the restraint and the grace that we associate with her are things that at the moment are at the forefront of my mind.\" Architect Lord Norman Foster, known for designing The Gherkin, has won the bid to design the memorial, which will be located at Marlborough Gate in St James's Park, close to Buckingham Palace. It will also feature a new Prince Philip Gate on the other side of the park on Birdcage Walk with a statue of Philip, as well as a \"family of gardens\", meandering paths and a new translucent, glass unity bridge. A panel of committee members will work with the team on the final design, which is expected to be unveiled in 2026 - the late Queen's 100th birthday year. Mr Jennings told Sky News he expects there will be \"considerable interest\" from the Royal Family, with the King \"keen that his mother should be represented appropriately\". \"I hope it will be something that both they and the general public are proud of,\" he said. Read more:See images of planned Elizabeth II memorialMemorial to Queen Elizabeth II must reflect 'extraordinary life' Mr Jennings said that at this early stage in this process, he intends to \"do a lot of listening\" when it comes to the design, with decisions including the stage of her life he will depict not yet taken. He said he expects that, like his previous works, the original version of the statue will be produced in clay, and then casted in bronze, but stressed \"I don't want to pin it down at this stage\". Mr Jennings has also created a bust of the Queen Mother, which is in St Paul's Cathedral, and the first crowned coinage portrait of the King. The 68-year-old has also crafted statues of George Orwell outside BBC Broadcasting House, Philip Larkin in Hull, Mary Seacole in London's St Thomas' Hospital and the Women Of Steel in Sheffield. The Queen Elizabeth II memorial project has a provisional construction budget of between £23m and £46m excluding VAT."
    },
    {
        "title": "Iranian man becomes third migrant deported under UK-France deal",
        "description": "An Iranian man has become the third migrant to leave the UK under the government's \"one in, one out\" deal with France.",
        "url": "https://news.sky.com/story/iranian-man-becomes-third-migrant-deported-under-uk-france-deal-13434106",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7025462.jpg?20250919180422",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 16:48:00",
        "Headline": "The Home Office says the Iranian has left the UK following similar deportations this week for Indian and Eritrean men.",
        "Content": "An Iranian man has become the third migrant to leave the UK under the government's \"one in, one out\" deal with France. It follows the removal of an Eritrean man earlier on Friday after he lost a High Court bid to halt his removal, and the deportation of an Indian national on Thursday. The treaty with France was agreed in July and came into force last month.  It allows the UK to send back a migrant who crosses the Channel illegally in exchange for accepting the same number of migrants in France who have a valid asylum claim. The UK expects to receive the first asylum seekers under the scheme next week.  This morning's removal of the Eritrean came after a last-minute court bid to delay the departure failed. The Home Office lodged an appeal after the man was granted 14 days to make representations to support his claim that he was a victim of modern slavery. \n                  Second deportation flight of week under UK-France deal set to take place today\n                 \n                  What a moment for Shabana Mahmood to take the helm at the Home Office\n                 \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 The Home Office tightened rules around human trafficking claims to win the case after a \"rapid review\" of modern slavery legislation was launched to prevent its misuse. New Home Secretary Shabana Mahmood accused migrants who try to block their deportation of making a \"mockery\" of the UK's modern slavery laws. Read More: How does the UK-France migrants deal work? The number of migrants arriving in the UK after crossing the English Channel has topped 30,000 for the year so far. It is the earliest point in a calendar year at which the 30,000 mark has been passed since data on the crossings was first reported in 2018. The government has come under immense pressure to get a grip on the issue amid growing public anger. Ms Mahmood has vowed to do \"whatever it takes\" to end crossings. A survey for Sky News last week found immigration is the top concern of voters for the first time since Brexit."
    },
    {
        "title": "Man dies after falling from hot air balloon in West Sussex",
        "description": "A man has died after falling from a hot air balloon in West Sussex.",
        "url": "https://news.sky.com/story/man-dies-after-falling-from-hot-air-balloon-in-west-sussex-13434276",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-newpound-common-balloon_7025688.png?20250919211724",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 19:25:00",
        "Headline": "Police said the victim had been among a group of people on a flight and was reported to have fallen near Newpound Common, Wisborough Green.",
        "Content": "A man has died after falling from a hot air balloon in West Sussex. He was reported to have fallen near Newpound Common, Wisborough Green, on Friday morning. His body was found in a field on Friday afternoon following a search. Police said the victim had been among a group of people on a flight from Billingshurst to Dunsfold. He is yet to be formally identified and the death is not being treated as suspicious. Read more from Sky News:'Legendary' songwriter killed in plane crash'Predatory' rapist could have given HIV to hundreds of men Sussex Police said it was called to a \"report of a man having fallen from a hot air balloon\" shortly after 9.20am. \"Following an extensive search the body of a man was sadly found in a field at 1.50pm,\" the force added. \"The search was carried out by neighbourhood officers, police drones, search officers and dogs.\" An investigation into what happened is under way, police said."
    },
    {
        "title": "By-elections that shook up politics – could Andy Burnham be next?",
        "description": "By-election counts are the FA Cup ties of British politics.",
        "url": "https://news.sky.com/story/by-elections-that-shook-up-politics-8211-could-andy-burnham-be-next-13433626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-polling-polling-place_6934302.jpg?20250604095831",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "No subtitle found",
        "Content": "\n          Chief political correspondent\n              @joncraig\n By-election counts are the FA Cup ties of British politics. Some go true to form, but many are tense, nail-biting, go deep into extra time and provide upsets and shocks by political giant killers. Publisher and broadcaster Iain Dale has published a weighty book, British By-elections: The 88 By-election Campaigns That Shaped Our Politics. Could Labour's King of the North, football fanatic Andy Burnham, who's tipped to come off the bench and contest Gorton and Denton in a by-election, be next? Burnham fuelled speculation about a Commons comeback when he said in an interview on Thursday he had \"never ruled out going back to Westminster\". With chapters written by politicians, academics and journalists in his book, Dale claims his 88 are the most consequential by-elections of the modern era. Now I can't claim to have covered 88 by-election counts for Sky News. After all, the first was in 1769 and 70 of the 88 in the book were before the 21st century. \n                  Greater Manchester Police investigating grooming cases with more than 700 victims\n                 \n                  Andy Burnham: 'Nigel Farage could become PM - this is how Labour can stop him'\n                 \n                  Labour needs to focus on the working class, says Andy Burnham \n                 But I have covered 44, if I'm not mistaken, starting in 2003, and I'm grateful for a few mentions in the book, some flattering, some less so. But there you go. \"There's rarely a dull by-election,\" Dale writes in his preface. \"Some by-elections take on iconic status and are remembered several decades after they take place. \"Others quickly disappear into the depths of our memories, rarely to be thought about ever again.\" The first by-election I covered for Sky News, in September 2003, was Brent East, which saw a shock win for the Liberal Democrats over Labour. The most recent was Runcorn and Helsby, in May this year, when Reform UK's Sarah Pochin was just six votes ahead of Labour after an all-nighter and a result at 6am. When there's a recount, I've joked about VAR holding up the result. I even covered one by-election count, Stretford and Urmston, at the Old Trafford football ground. Over 22 years of covering by-election counts I hope I've learned the tricks of the trade when the result is on a knife-edge: One, look closely at the piles of ballot papers; two, see which candidate has a victory speech in their hand or pocket. But most important, three, find out what's said in the huddle when the returning officer calls the candidates and their agents together to brief them on the result ahead of the declaration. It may have been my first TV count after more than 20 years in newspapers, but lesson three served me well at Brent East, as my former Sky News colleague Joe Pike reveals in his chapter on Sarah Teather's triumph. \"Jon Craig, Sky News' new signing, who would go on to broadcast from more than 40 by-election counts, announced Labour's loss even before the returning officer had stood up,\" Pike writes. \"(Robert) Evans (Labour's candidate) tipped him off that Labour had lost by 1,000 votes and Craig passed on the revelation on live TV.\" Thanks, Joe. I'd kept quiet about how I discovered the result until now. A glaring omission from the book, in my opinion, is George Galloway's upset in Bradford West in 2012. When Sky News arrived at the count, everyone in the hall was predicting a Labour win. But gradually the mood changed. I texted George: \"Labour getting jitters here, George! Say you're doing very well. What do you think?\" \"Think I'm going to win, Jon,\" he replied instantly. \"Labour and Tory MPs think so too,\" I told him. \"Keen to get you on TV.\" I called him and urged him to come to the count and claim victory. And 'Gorgeous George', never one to be shy or turn down publicity, duly obliged. He'd turned a Labour majority of nearly 6,000 into a victory for his Respect Party by more than 10,000 votes, a swing of more than 50%. Richmond Park, in 2016, and Copeland, 2017, are in the book. My memory of Richmond Park is chasing a very angry Zac Goldsmith, the Tory Heathrow expansion rebel, around the count after he lost to the Lib Dem Sarah Olney. Hartlepool, in 2021, was a by-election that really did take on iconic status. It was a rare Tory gain, a victory for Boris Johnson in the Red Wall and it threw the new Labour leader Sir Keir Starmer into a panic. He sacked his chief whip, Nick Brown, tried to demote his deputy, Angela Rayner. But that backfired, as she acquired even more titles. He's since admitted he considered quitting. The result came at 7.10am, by which time a giant inflatable Boris Johnson doll had been erected outside the count. My post-results broadcasts were from in front of that. Oh, and on the Monday, back in Westminster, I tested positive for COVID. Red Wall COVID. The second Batley and Spen by-election, later in 2021, saw 'Gorgeous George' attempt to repeat his Bradford West triumph. Tracy Brabin had succeeded the murdered Jo Cox in 2016 but had quit to become West Yorkshire mayor. This time Kim Leadbeater, Jo's sister and now the assisted dying crusader, was Labour's candidate. Galloway was described by author Emma Burnell in the book as \"a serial candidate over the years, with varying levels of success\". This \"Red Wall\" clash was, though, a classic knife-edge by-election, running deep into extra time, with Leadbeater squeezing home by 323 votes ahead of the Tory candidate Ryan Stephenson. Cue VAR gags during the delays. \"On election night, neither Labour nor the Conservatives were confident of victory,\" writes Burnell, editor of LabourList. \"Mobile phones were banned from the count and so most of the news the candidates were receiving was through television coverage. \"At one point, Sky's Jon Craig declared that the Tories had won and it was just a case of by how much. However, Stephenson delights in telling the story of his entering the count later (now aware of how the night had gone) to overhear Craig announcing to the nation: 'The loser, Mr Stephenson, has now arrived.' \"Leadbeater, meanwhile, had not prepared her victory speech, convinced as she was that she had lost.\" My recollection, however, is different and I'm sure she did have a speech. (Lesson two) At Mid-Bedfordshire in 2023 after Nadine Dorries' resignation, LBC radio's Henry Riley recalls a tense count and writes: \"The only brief moment of levity was when veteran by-election reporter-in-chief Jon Craig of Sky News was presented with a cake by the High Sheriff of Bedfordshire, Russell Beard, to celebrate his 40th by-election.\" From new signing to veteran in just 20 years. It's a cruel world. In Rochdale last year, George Galloway was back. And this time he won by nearly 6,000 votes and became the first MP elected to represent a fourth different Westminster constituency since Winston Churchill, Sunder Katwala tells us in the book. George and I are old comrades, going back to his days as a left-wing firebrand in the Labour Party. I was a touch embarrassed at Rochdale, however, when he said during our post-result interview: \"You bought me lunch!\" Runcorn and Helsby was so close - six votes - that the count dragged on until 6am after a massive recount. \"As the night turned to morning, Labour staff looked more and more nervous,\" writes ITV's Harry Horton in the book. \"Reform's team appeared nervous. At one point, a Reform aide instructed photographers to assemble at the door for the arrival of Nigel Farage. \"One broadcaster claimed he'd seen the Reform leaders circling the car park outside but had driven off when it appeared Labour might sneak a win. Farage later denied anything of the sort had ever happened.\" Well, as the \"one broadcaster\" referred to by Harry, there was indeed a car circling the car park. But, admittedly, it was dark! We all make mistakes. There have been a few blunders. At one count, not long after she became an MP, I mistook Angela Rayner for Jess Phillips. Fortunately, she told me she was flattered. Whatever happened to her? So where next on the by-election fixture list? Will Andy Burnham contest Gwyne's seat prior to challenging Sir Keir Starmer for the Labour captaincy? With Reform UK the challengers in Gorton and Denton, that's a by-election that could be one for VAR."
    },
    {
        "title": "Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'",
        "description": "Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration.",
        "url": "https://news.sky.com/story/lib-dems-toughen-up-immigration-rhetoric-as-sir-ed-davey-pledges-to-stop-the-boats-13433984",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7025218.jpg?20250919142857",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Lib Dem leader Sir Ed Davey spoke to Sky News about Reform, policies and whether he would do a deal with Labour, ahead of his party's annual autumn conference.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration. The party leader told Sky News he and his MPs will be talking about immigration during his party's conference, which starts today, as it is a \"big policy which people are concerned about\". He also claimed the Lib Dems are the only party \"taking on Reform\" with different ideas on how to solve people coming to the UK in small boats. The party's manifesto says it would work with Europol and the French authorities to \"stop the smuggling and trafficking gangs\" behind the crossings, but as immigration has become one of the most contentious topics in the UK, Sir Ed appears to have hardened his tone on the subject. He told Sky News: \"We'll talk about how we stop the boats, how we close down the asylum hotels. \"But we've got thought-through policies about how you would do that in a humane way, unlike people like Farage and the Conservatives.\" Sir Ed blamed the Conservatives and Reform leader Nigel Farage for Brexit and taking the UK out of the Dublin Convention, which means asylum seekers can only make a claim in the EU country they first arrived in. \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \n                  Lib Dems eye Labour-held cities as they target 'seats not votes'\n                 He said the Lib Dems \"know how we can solve\" the small boats issue, as he put his party forward as the only one to take on Reform. \"We need to process the applications really quickly, deport people who have no right to be here, and if they have a right to be here, get them working so the taxpayer isn't paying for the hotels,\" he added. \"These are practical ways forward, and we're the only party taking on Reform with different ideas for solving this.\" Political correspondent Bournemouth is famous for its sandy beaches, sunny weather and wholesome seaside attractions. But over the summer it also became infamous for the number of asylum seekers put up in its hotels.  This weekend, it’s also hosting the Liberal Democrats' annual conference, and while most political parties are competing to sound tougher on illegal migration - the Lib Dems are still putting forward a more humanitarian approach, albeit with a slightly harder tone.  While today, they’re calling for the government to speed up the asylum decision-making system with ‘nightingale’ style temporary processing centres, the fundamentals of their policy do not seem to have changed.  They still want to expand the number of safe and legal routes for those escaping war and persecution, so that people can apply for asylum without crossing the channel illegally.  They’re also calling for asylum seekers to be able to work while awaiting decisions to be made on their cases.  \"Anybody sensible wants a fair and effective immigration asylum system,\" says Lisa Smart MP, the party’s home affairs spokesperson.  \"We’ve seen Reform UK just sat shouting and sounding very angry, we’ve increasingly heard the Tories moving closer and closer to them, and Labour acting like a tribute act. \"We want a fair and effective system which treats people coming here, fleeing war and persecution, like human beings.\" Some voters I spoke to in Bournemouth told me they supported the principle of welcoming genuine refugees wanting to come to the UK to build a better life, and liked the idea of creating more safe and legal routes.  But there was also widespread scepticism about the lack of progress made by successive governments in tackling illegal migration - with many keen for a tougher approach.  Two former Lib Dem voters told me they’d been turned away from the party because of their concerns about people breaking into the country and putting pressure on its creaking infrastructure.\n\n Recent polling suggests immigration is now the biggest concern for voters. \nLuke Tryl of organisation More in Common says it could be a problem for the Lib Dems trying to broaden their appeal at the next election. \"The difference with Liberal Democrat voters is that despite the fact they have that shared view with the majority of the rest of the public  (that levels of immigration should come down) it's a less important issue for them,\" he says.  \"If the Liberal Democrats want to grow, if they want to go beyond last year's election result and perhaps position themselves as a future coalition partner for the Labour Party, I think voters are going to want to see a more comprehensive offer on immigration.\"\n For those taking part in weekly protests outside the Roundhouse - one of three town centre hotels booked out by the Home Office for housing asylum seekers - there was considerable anger. \nMany of those protesting told me they feel ignored.  \"As you can see we’ve had enough,” said Mark Dean.  \"We can’t just sit on our sofas and say nothing and expect the country to change, because it will not.\" \"I work at a homeless shelter two days a week and there are so many people who use that who have to sleep in tents on the beach,\" said Sarah Turnbull.  \"It’s heartbreaking to see how many people in our area are struggling just to feed themselves and we’re spending millions on illegal migrants.\"\n The Lib Dems are unlikely to win over many of the voters protesting outside asylum hotels. But this weekend’s conference is an opportunity to try and pitch to those uncomfortable with the right wing tilt of public debate on the issue. We should be worried about Reform The Lib Dem leader's reaction to Reform, which has consistently led the opinion polls recently, has also hardened. Since last summer's election, the Lib Dems have generally chosen to avoid attacking Reform or Labour, with Sir Ed going for the Conservatives' record instead. Lib Dem insiders previously said the tactic was to let Reform implode.  However, after Mr Farage swooped in over the summer parliamentary recess with numerous headline-grabbing news conferences, Sir Ed is taking a different tactic. He said it is still very early on this parliament, which is set to end in 2029, and the Lib Dems are building on their record result last year, which saw them gain 61 MPs for a total of 72, by doing well in May's local elections. But, he said: \"I think people should be worried about Reform. \"They represent a set of issues which I don't think are British issues. They suck up to Donald Trump and Elon Musk. Nigel Farage thinks Vladimir Putin, the president of Russia, is the world leader he admires the most. \"Nigel wants to frack across England's countryside. He wants to have American-style health insurance. I don't think people want that. \"And the more Nigel Farage and Reform are exposed for what they believe in, the more people look for other parties of change. \"Clearly not Labour, the Tories - they're not trusted, they've failed. \"But the Liberal Democrats have a change agenda which is true to British values, which is genuinely patriotic and which will solve the day-to-day problems that people are worried about, like health, like care, like the cost of living.\" And will Sir Ed be taking part in more stunts this conference after becoming famous for them during the election campaign? Yes he will, he confirmed, but you (and he) will have to wait and see. The Liberal Democrat conference is taking place from 20-23 September. Sky News will be bringing you all the coverage live from Bournemouth."
    },
    {
        "title": "Canada bans Kneecap from entering country as rappers threaten legal action",
        "description": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'.",
        "url": "https://news.sky.com/story/canada-bans-kneecap-from-entering-country-as-rappers-threaten-legal-action-13434201",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mo-chara-moglai-bap_6967814.jpg?20250718140119",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-19 18:50:00",
        "Headline": "The English and Irish-language rap group were due to play four shows  in Toronto and Vancouver next month.",
        "Content": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'. The trio, who were due to play four concerts in Canada next month, were accused of promoting hate and violence by the country's Liberal government. Kneecap have subsequently threatened Canada's parliamentary secretary for combatting crime, Vince Gasparro, with legal action. Mr Gasparro said in a video on X that members of the group had been deemed ineligible to enter the country because of actions and statements that violate Canadian law. He also accused the group of amplifying political violence and publicly displaying support for terrorist organisations, including Iran-backed Lebanese militant group Hezbollah, and Hamas in Gaza. Mr Gasparro said: \"Advocating for political violence, glorifying terrorist organisations and displaying hate symbols that directly target the Jewish community are not protected forms of expression and will not be tolerated by our government.\" Commenting on the X post, Kneecap said: \"Your comments about us are wholly untrue and deeply malicious. We will not accept it. \n                  NATO responds after Russian military jets 'violate' Estonian airspace\n                 \n                  Ukraine war latest: Photos show 'Russian jet that entered Estonian airspace' - as Trump says reported incursion 'could be big trouble'\n                 \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \"No member of Kneecap has been convicted of ANY crime in ANY country EVER.\" The band added: \"We have today instructed our lawyers to initiate action against you. We will be relentless in defending ourselves against baseless accusations to silence our opposition to genocide being committed by Israel. \"When we beat you in court, which we will, we will donate every cent to assist some of the thousands of child amputees in Gaza.\" Canada's immigration ministry did not immediately respond to a request for more details. This is the latest in a series of controversial incidents involving the Belfast-based band. During the Glastonbury Festival in June, Kneecap's frontman Liam Og O Hannaidh, known by his stage name Mo Chara, accused Israel of committing war crimes. Israel has denied the accusation. Kneecap have previously said its members do not support Hamas or Hezbollah. They added that they condemn \"all attacks on civilians, always\". In May, Mr Ó hAnnaidh was charged with a terrorism offence in Britain after allegedly displaying a flag in support of Hezbollah during a London gig in November 2024. He denied the allegation, saying it was thrown on stage during the performance. Chief magistrate Paul Goldspring will rule on whether he has the jurisdiction to try the case later this month. Kneecap were scheduled to play four Canadian concerts in October, two in Toronto and two in Vancouver, according to its website."
    },
    {
        "title": "NATO responds after Russian military jets 'violate' Estonian airspace",
        "description": "NATO says it has responded after Russian military jets \"violated\" Estonian airspace, as the Baltic state formally requested a consultation with the military bloc.",
        "url": "https://news.sky.com/story/russian-military-jets-violate-estonian-airspace-officials-say-13434022",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-russia-estonia_7025776.jpg?20250919231501",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 13:56:00",
        "Headline": "The Estonian government said the incident involved three Russian MiG-31 fighter jets that flew over the Gulf of Finland for a total of 12 minutes.",
        "Content": " NATO says it has responded after Russian military jets \"violated\" Estonian airspace, as the Baltic state formally requested a consultation with the military bloc. In a statement, the Estonian government said the incident involved three Russian MiG-31 fighter jets that flew near Vaindloo Island, in the Gulf of Finland, for a total of 12 minutes without permission. A NATO spokesperson said the Russian jets \"violated Estonian airspace\" and \"NATO responded immediately and intercepted the Russian aircraft\". \"This is yet another example of reckless Russian behaviour and NATO's ability to respond.\" US President Donald Trump said the reported incursion \"could be big trouble\".  However, a statement from the Russian military said the flight was \"scheduled\" and had been in \"strict accordance\" with airspace rules. The statement read: \"On September 19 of this year, three Russian MiG-31 fighter jets made a scheduled flight from Karelia to an airfield in the Kaliningrad region. \"The flight was conducted in strict accordance with the International Rules for the Use of Airspace, without violating the borders of other states, as confirmed by objective monitoring means. \"During the flight, the Russian aircraft did not deviate from the agreed air route and did not violate Estonian airspace. The flight route of the aircraft passed over the neutral waters of the Baltic Sea basin at a distance of more than three kilometers from the island of Vaindlo.\"  Foreign minister Margus Tsahkna said Russia had already violated Estonian airspace four times this year, \"which is unacceptable in itself, but today's violation, during which three fighter jets entered our airspace, is unprecedentedly brazen\". \"Russia's ever-increasing testing of borders and aggressiveness must be responded to by rapidly strengthening political and economic pressure,\" he added. 'Utterly unacceptable' Estonia is the third NATO country to report an incursion of its airspace by Russia in recent weeks: On Sunday, Romania said a drone breached its airspace during a Russian attack on neighbouring Ukraine. Poland also reported an \"unprecedented violation\" of its airspace by more than a dozen Russian drones last week. Moscow denied responsibility for the incident. The UK had previously summoned the Russian ambassador in London in response to the \"utterly unacceptable\" Romanian and Polish incursions. The Russian defence ministry did not immediately respond to a request for comment. However, its jets routinely fly over the Baltic Sea, where its Baltic Fleet is based. In the wake of the incident, Estonia requested an Article 4 consultation, which allows NATO members to formally bring an issue to the attention of the North Atlantic Council, to meet and discuss when \"the territorial integrity, political independence or security\" of any state is threatened. NATO spokesperson Allison Hart said that the council will convene early next week to discuss the incident in more detail. Sweden's military released images late on Friday that it said showed a Russian fighter jet over the Baltic Sea after it had left Estonian airspace. Incursion 'not a coincidence': Zelenskyy While incursions over Vaindloo Island, around 124 miles from Estonia's capital Tallinn, by Russian aircraft are somewhat common, they do not usually last as long as Friday's incident. In response, Foreign Secretary Yvette Cooper said that the UK \"stands with our Estonian allies\" after what she called \"yet another reckless incursion into NATO airspace\". Ukrainian President Volodymyr Zelenskyy added that the incursion was \"unacceptable\" and added: \"This is not a coincidence. \"It is a systematic Russian campaign against Europe, against NATO, against the West. And it requires a systematic response. Strong actions are necessary, both joint and from each individual country.\" Read more on Russia:Trump makes Putin admission - but saves harshest words for Sadiq KhanRussian forces create 'kill zone' around crucial Ukrainian city Trump says incident 'could be big trouble' Mr Trump also commented on the incident during a news conference at the White House, and said he was \"going to have a look\" at the reports. After saying he would be briefed on the incursion, he said: \"Well, I don't love it. I don't love it when that happens. Could be big trouble.\"  EU Commission President Ursula von der Leyen also said: \"We will respond to every provocation with determination while investing in a stronger Eastern flank.\" She added that \"as threats escalate, so too will our pressure\", before calling on European leaders to approve a new round of sanctions which would ban Russian liquified natural gas. Putin 'testing the West's resolve': EU official Europe's foreign policy chief Kaja Kallas also said the \"violation of Estonia's airspace by Russian military aircraft is an extremely dangerous provocation\". She added that the EU \"stands in full solidarity with Estonia\", and said: \"We will continue to support our member states in strengthening their defences with European resources. \"Putin is testing the West's resolve. We must not show weakness.\" Estonia's government said in May that Russia had briefly sent a fighter jet into NATO airspace over the Baltic Sea during an attempt to stop a Russian-bound oil tanker thought to be part of a \"shadow fleet\" defying Western sanctions on Moscow. It added that the Russian deputy ambassador was summoned and given a protest note. Read more from Sky News:Can Mandelson be barred from the House of Lords?Two ambulance workers arrested in connection with six deaths Russia threatening Finland like Ukraine, says thinktank It comes after analysis from the Institute for the Study of War (ISW) suggested Russia has launched an information campaign against Finland - with echoes of how it built up to the invasion of Ukraine in 2022. The thinktank noted senior figures in Moscow, including members of Vladimir Putin's inner circle, have been making a series of statements designed to threaten the neighbouring country. Its analysts said: \"High-ranking Kremlin officials have increased threats against Finland in recent weeks, including by using language that mirrors the Kremlin's false justifications for its invasions of Ukraine. \"ISW continues to assess that the playbook Russia is currently using to threaten NATO mirrors the playbook Russia previously used to set informational conditions justifying its aggression against Ukraine.\""
    },
    {
        "title": "Elderly British couple held for months by Taliban reunited with daughter",
        "description": "An elderly British couple who have been freed after being detained by the Taliban earlier this year have been reunited with their daughter.",
        "url": "https://news.sky.com/story/elderly-british-couple-detained-in-afghanistan-freed-13433792",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-afghanistan-peter-reynolds_7025257.jpg?20250919144958",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 07:19:00",
        "Headline": "Peter and Barbie Reynolds were detained by the Taliban's interior ministry on 1 February. They ran a training programme in Afghanistan.",
        "Content": " An elderly British couple who have been freed after being detained by the Taliban earlier this year have been reunited with their daughter. Barbie Reynolds, 76, and her husband Peter, 80, were detained by the Taliban's interior ministry on 1 February as they travelled to their home in Bamyan province, central Afghanistan. In March, they were moved to a maximum security prison in Kabul where they had been held without charge. In the final stages of negotiations they were transferred to Kabul's central prison. They were safely released from detention on Friday and flown to Doha following mediation led by Qatar. As they touched down in Doha, Sky correspondent Sally Lockwood said she saw the \"joy\" on Mrs Reynolds' face as her daughter Sarah hugged her on the tarmac. She told Lockwood it was \"wonderful\" to have arrived in Qatar. Earlier, Sky correspondent Cordelia Lynch was at Kabul Airport as the freed couple arrived and departed. Mr Reynolds told her: \"We are just very thankful.\"  His wife added: \"We've been treated very well. We're looking forward to seeing our children. \"We are looking forward to returning to Afghanistan if we can. We are Afghan citizens.\" Asked by Lynch if they had a message for family and friends, Mrs Reynolds replied: \"My message is God is good, as they say in Afghanistan.\" Prime Minister Sir Keir Starmer welcomed the news in a statement thanking Qatar. \"I welcome the release of Peter and Barbara Reynolds from detention in Afghanistan, and I know this long-awaited news will come as a huge relief to them and their family,\" he said. \"I want to pay tribute to the vital role played by Qatar, including The Amir, His Highness Sheikh Tamim bin Hamad al Thani, in securing their freedom.\" Richard Lindsay, the UK's special envoy to Afghanistan, told Lynch it remained \"unclear\" on what grounds the couple had been detained. He said they were \"very relieved to be going home and delighted to be reunited with their family\". Asked about the state of their health, he said: \"I am not a doctor, but they are very happy.\" He added the British government's travel advice to the country was clear. \"We advise British nationals not to travel to Afghanistan. That remains the case and will remain the case,\" he said. Abdul Qahar Balkhi, a spokesperson at the Taliban government's foreign ministry, said in a statement posted on X that the couple \"violated Afghan law\" and were released from prison after a court hearing. He did not say what law the couple were alleged to have broken.  Qatar, the energy-rich nation on the Arabian Peninsula that mediated talks between the US and the Taliban before the American withdrawal, helped in releasing the Reynolds. Mirdef Ali Al-Qashouti, acting charge d'affaires at the Qatar Embassy in Kabul, told Lynch that Qatari officials ensured the couple were kept in \"comfortable\" conditions during talks. He told Lynch the Reynolds' release was because of \"continuous efforts by my government to keep our policy in helping releasing hostages and our mediation and diplomacy\". \"Throughout their eight months in detention - during which they were largely held separately - the Qatari embassy in Kabul provided them with critical support, including access to their doctor, delivery of medication, and regular communication with their family,\" a Qatari official told Reuters news agency. Asia correspondent At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors. On the runway a plane waited, the steps ready for what appeared to be an imminent departure. We had heard from our sources about the possible release of Peter and Barbie Reynolds, the elderly British couple detained in February, but we had no official confirmation yet. Then, from behind a double door, I caught the eye of Barbie. The 76-year old smiled at me - her face seemingly bright with relief. Her husband, Peter, 80, then stepped into frame. A tall gentle looking man, his eyes looked filled with emotion. Their relief and gratitude was immediately apparent. It was of course impossible to know what state their health was in, but they appeared alert and composed, despite nearly eight months in detention. The couple's son, Jonathan, had previously said his father had been suffering serious convulsions and his mother was \"numb\" from anaemia and malnutrition. The UN had also described their conditions as \"inhumane\". But today, as he prepared to leave the country, Peter wouldn’t be drawn on the conditions he faced. \"We’re just very thankful, very thankful,\" he told me. Barbie, who spent part of her detention in a separate facility, looked strikingly calm - a graceful and understated demeanour. “We’ve been treated very well,” she said as she made her way to the plane. Taliban officials maintained they received adequate medical care in prison and their human rights were respected. Read Cordelia Lynch's full eyewitness story here\n Hamish Falconer, minister for the Middle East, Afghanistan and Pakistan, said in a statement: \"The UK has worked intensively since their detention and has supported the family throughout. \"Qatar played an essential role in this case, for which I am hugely grateful.\" The couple have lived in Afghanistan for 18 years and run an organisation called Rebuild, which provides education and training programmes. They have been together since the 1960s and married in the Afghan capital in 1970.  Read more from Sky News:Afghans relocated to UK 'exaggerating' Taliban threat Their son, Jonathan, told Sky News in April his parents had \"never heard one accusation or one charge\". He said the British government had offered to evacuate them when the Taliban took over, to which they replied: \"Why would we leave these people in their darkest hour?\" Mr and Mrs Reynolds are now on their way home, where they will be reunited with their family. Speaking to Sky News from Wyoming in the United States following their release, Jonathan said he was \"excited\" to be seeing his parents again, and joked: \"I'm a little bit jealous of my dad's beard.\" \"They look really well to me,\" he said, \"which I'm just delighted about\". \"I am looking forward to putting my arms around them and giving them a big hug, as all of my siblings will be.\" He offered his \"special thanks\" to all the British and Qatari diplomats involved in his parents' release.  He said the grounds for their detention remained a mystery as they were given no explanation for their arrest. \"They were investigated for all kinds of things but everything came up with no evidence of any wrongdoing,\" he said. \"One of them, the original arrest, they said something about flying a drone - my parents don't own a drone. It's hard enough trying to get them to know how to use certain new technologies, let alone a drone. \"So, yeah, bizarre things, but I think they were just people of interest and then got caught up in a big, big mess of a situation, and no one knew what to do. But I'm just happy they are home.\" Asked about their desire to return to Afghanistan, he said: \"It's probably not wise to go back to a place where they are not welcome, and I would say, clearly they are not welcome there.\" \"They are going to arrive back in the UK with the clothes on their backs. They have sold everything... all of their possessions,\" he said, when asked what the future held for his parents. \"Knowing my mum she has probably written a few books in her mind whilst she's been in captivity. \"We have heard great reports from schools across Afghanistan that the programmes they set up are running really, really well, so they will probably want to continue those,\" he added.    "
    },
    {
        "title": "She smiled and his eyes filled with emotion - the moment the Reynolds were freed by the Taliban",
        "description": "At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors.",
        "url": "https://news.sky.com/story/well-return-to-afghanistan-if-we-can-say-british-couple-detained-by-taliban-for-more-than-seven-months-13434038",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-barbie-reynolds_7024951.jpg?20250919103518",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-09-19 14:27:00",
        "Headline": "Peter and Barbie Reynolds were relieved as they boarded a flight home, but what led to their arrest remains unclear.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  At Kabul International Airport, we watched as a string of Afghan, Qatari and British officials walked into a building by the runway, alongside doctors. On the runway a plane waited, the steps ready for what appeared to be an imminent departure. We had heard from our sources about the possible release of Peter and Barbie Reynolds, the elderly British couple detained in February, but we had no official confirmation yet. Then, from behind a double door, I caught the eye of Barbie. The 76-year old smiled at me - her face seemingly bright with relief. Her husband, Peter, 80, then stepped into frame. A tall gentle looking man, his eyes looked filled with emotion. Their relief and gratitude was immediately apparent. It was of course impossible to know what state their health was in, but they appeared alert and composed, despite nearly eight months in detention. The couple’s son, Jonathan, had previously said his father had been suffering serious convulsions and his mother was \"numb\" from anaemia and malnutrition. The UN had also described their conditions as \"degrading\". But today, as he prepared to leave the country, Peter wouldn’t be drawn on the conditions he faced. \"We’re just very thankful, very thankful,\" he told me. Barbie, who spent part of her detention in a separate facility, looked strikingly calm - a graceful and understated demeanour. “We’ve been treated very well,” she said as she made her way to the plane. Taliban officials maintained they received adequate medical care in prison and their human rights were respected. The couple’s four children campaigned carefully but consistently for their release. \"We’re looking forward to seeing our children,\" Barbie told me with a wide beam. I asked if she had a message for family and friends. \"God is good as they say here in Afghanistan,\" she declared. \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \n                  Afghans relocated to UK 'staged torture videos' and 'holiday in Afghanistan', ex-interpreter says\n                 \n                  Taliban orders 'complete ban' on fibre optic internet in northern Afghanistan, as reports says order will be enforced nationwide \n                 And despite their surprise detention, she hoped they would be back. “Will you return to Afghanistan?” I asked. “Oh yes, if we can,” she said. “We are Afghan citizens.” What happened The couple have been together since the 1960s and married in the Afghan capital, Kabul, in 1970. They have lived in the country for 18 years and ran an organisation called Rebuild, which provides educational and leadership programmes, including training for mothers and children. They have been described by family as having a lifelong love of Afghanistan. After the Taliban seized control in August 2021 and many other Westerners left, they decided to stay. They were arrested on their way home to Bamiyan. The Taliban has said the couple broke Afghanistan law. But after the couple faced four court proceedings, no charges were ever brought. In a statement today, Hamdullah Fitrat, Deputy Spokesman of the Islamic Emirate of Afghanistan, said: “Two British nationals named Peter and Barbara Reynolds, who had violated the laws of Afghanistan, were released from custody today following the judicial process. The Islamic Emirate of Afghanistan does not view the issues of its nationals from a political or bargaining perspective.” Both the UK and Qatari officials were keen to express their deep gratitude to Afghanistan's leadership for releasing the Reynolds. Richard Lindsay, Special Envoy to Afghanistan said it was a “very great humanitarian day\". But he acknowledged he did not know on what grounds the couple were held. The Qataris appeared to play a critical role in negotiating with the Afghan authorities. They said they were able to ensure medical assistance was provided and enable the couple to communicate with their families. “The release of Barbie and Peter Reynolds shows that when two parties are committed to reaching an agreement, Qatar’s mediators will find a way to achieve it,” one Qatari official told Sky News. In 2022, the Taliban banned Afghan women from working for NGOs. What led up to the arrest of the Reynolds, who dedicated so much of their lives to running an NGO is still unclear. But for their family, today is a day they had longed for."
    },
    {
        "title": "Gender testing rules would have earned me an Olympic medal, says former UK athlete Lynsey Sharp",
        "description": "Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then.",
        "url": "https://news.sky.com/story/gender-testing-rules-would-have-earned-me-an-olympic-medal-says-former-uk-athlete-lynsey-sharp-13433920",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-caster-semenya-lynsey-sharp_7025067.jpg?20250919122456",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Sharp's comments come ahead of the Women's 800m final at the World Athletics Championships in Tokyo, in which British star Keely Hodgkinson is odds-on favourite.",
        "Content": " Former British athlete Lynsey Sharp has told Sky News she would have won a bronze medal at the Rio Olympics in 2016 had today's gender testing rules been in place then. Sharp came sixth in the women's 800m final behind three now-barred athletes with differences in sexual development (DSD). She told sports presenter Jacquie Beltrao the sport has changed considerably from when she was competing. \"Sometimes I look back and think I could have had an Olympic medal, but I gave it my all that day and that was the rules at the time,\" she said. \"Obviously, I wish I was competing nowadays, but that was my time in the sport and that's how it was.\" The Rio women's 800m final saw South Africa's Caster Semenya take gold, with Burundi's Francine Niyonsaba and Margaret Wambui winning silver and bronze respectively. All three would have been unable to compete today. Semenya won a total of two Olympic gold medals before World Athletics introduced rules limiting her participation in the female class. \n                  Caster Semenya did not get fair hearing in sex eligibility case, human rights court rules\n                 \n                  World Athletics to introduce mandatory sex testing for female competitions\n                 \n                  Keely Hodgkinson 'heartbroken' after world record hopes shattered by injury\n                 In a major policy overhaul introduced this year, World Athletics now requires athletes competing in the female category at the elite level of the sport to take a gene test. The tests identify the SRY gene, which is on the Y chromosome and triggers the development of male characteristics. The tests replace previous rules whereby athletes with DSD were able to compete as long as they artificially reduced their testosterone levels.  Sharp says while she was competing, governing bodies \"didn't really deal with the issue head on\", and she was often portrayed as a \"sore loser\" over the issue. Despite running a Scottish record in that race, her personal best, she described the experience as a \"really difficult time\". \"Sadly, it did kind of taint my experience in the sport and at the Olympics in Rio,\" she said. Sharp added that despite the changes, it remains a \"very contentious topic, not just in sport, but in society\". Read more:World Athletics to introduce mandatory sex testingCaster Semenya ruling on sex eligibility caseOlympic gold medallist appeals over genetic sex testing Boxing has now also adopted a compulsory sex test to establish the presence of a Y chromosome at this month’s world championships. The controversial Olympic champion Imane Khelif, who won Olympic welterweight gold in Paris 2024 in the female category, did not take it and couldn’t compete. She has appealed to the Court of Arbitration for Sport against having to take the test. Sharp's comments come as British athletics star and Olympic champion Keely Hodgkinson is tipped to win her first world title in Sunday's women's 800m final at the World Athletics Championships in Tokyo. She is returning from a year out after suffering two torn hamstrings."
    },
    {
        "title": "Canada bans Kneecap from entering country as rappers threaten legal action",
        "description": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'.",
        "url": "https://news.sky.com/story/canada-bans-kneecap-from-entering-country-as-rappers-threaten-legal-action-13434201",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mo-chara-moglai-bap_6967814.jpg?20250718140119",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 18:50:00",
        "Headline": "The English and Irish-language rap group were due to play four shows  in Toronto and Vancouver next month.",
        "Content": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'. The trio, who were due to play four concerts in Canada next month, were accused of promoting hate and violence by the country's Liberal government. Kneecap have subsequently threatened Canada's parliamentary secretary for combatting crime, Vince Gasparro, with legal action. Mr Gasparro said in a video on X that members of the group had been deemed ineligible to enter the country because of actions and statements that violate Canadian law. He also accused the group of amplifying political violence and publicly displaying support for terrorist organisations, including Iran-backed Lebanese militant group Hezbollah, and Hamas in Gaza. Mr Gasparro said: \"Advocating for political violence, glorifying terrorist organisations and displaying hate symbols that directly target the Jewish community are not protected forms of expression and will not be tolerated by our government.\" Commenting on the X post, Kneecap said: \"Your comments about us are wholly untrue and deeply malicious. We will not accept it. \n                  NATO responds after Russian military jets 'violate' Estonian airspace\n                 \n                  Ukraine war latest: Photos show 'Russian jet that entered Estonian airspace' - as Trump says reported incursion 'could be big trouble'\n                 \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \"No member of Kneecap has been convicted of ANY crime in ANY country EVER.\" The band added: \"We have today instructed our lawyers to initiate action against you. We will be relentless in defending ourselves against baseless accusations to silence our opposition to genocide being committed by Israel. \"When we beat you in court, which we will, we will donate every cent to assist some of the thousands of child amputees in Gaza.\" Canada's immigration ministry did not immediately respond to a request for more details. This is the latest in a series of controversial incidents involving the Belfast-based band. During the Glastonbury Festival in June, Kneecap's frontman Liam Og O Hannaidh, known by his stage name Mo Chara, accused Israel of committing war crimes. Israel has denied the accusation. Kneecap have previously said its members do not support Hamas or Hezbollah. They added that they condemn \"all attacks on civilians, always\". In May, Mr Ó hAnnaidh was charged with a terrorism offence in Britain after allegedly displaying a flag in support of Hezbollah during a London gig in November 2024. He denied the allegation, saying it was thrown on stage during the performance. Chief magistrate Paul Goldspring will rule on whether he has the jurisdiction to try the case later this month. Kneecap were scheduled to play four Canadian concerts in October, two in Toronto and two in Vancouver, according to its website."
    },
    {
        "title": "Afghans relocated to UK 'staged torture videos' and 'holiday in Afghanistan', ex-interpreter says",
        "description": "Hundreds of Afghans who have been relocated to Britain under a multibillion-pound scheme to protect them from the Taliban have returned to Afghanistan for holidays and other trips, an Afghan source has revealed.",
        "url": "https://news.sky.com/story/afghans-relocated-to-uk-exaggerating-taliban-threat-ex-interpreter-says-13423813",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-haynes-afghan_7017646.jpg?20250912093149",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-09-19 06:00:00",
        "Headline": "\"The only threat is unemployment,\" the source, who has direct knowledge of the government's relocation scheme, tells Sky News.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Hundreds of Afghans who have been relocated to Britain under a multibillion-pound scheme to protect them from the Taliban have returned to Afghanistan for holidays and other trips, an Afghan source has revealed. The source, himself a former interpreter who served with British forces in Afghanistan before also starting a new life in the UK, said the excursions were evidence that the threat some of his countrymen say they face because of past links with the British has been exaggerated. \"The only threat is unemployment,\" the man told Sky News, requesting anonymity to avoid repercussions for speaking out. The source has direct knowledge of how the previous Conservative government processed applications for resettlement to the UK in the chaos that followed the Taliban's return to power four years ago. He alleged that the Afghanistan Relocations and Assistance Policy (ARAP) - which is under intense parliamentary scrutiny following revelations in July about a major data breach - had been open to exploitation by Afghans simply seeking a better life in Britain. He said examples of this alleged exploitation included: • Multiple cases of applicants sending British officials allegedly fake Taliban threat letters, staged \"torture\" videos and false claims of Taliban attacks against themselves or close relatives as evidence of the danger they were in• Afghans being resettled in the UK despite already being granted asylum in other safe countries such as Denmark or Belgium• Individuals being accepted for relocation even though they only worked for one or two days as interpreters with British forces• Applicants pushing to bring in large, extended families as well as their spouse and children. This included parents, siblings, nephews, nieces and even second wives Under the government's scheme, an individual who is granted relocation is allowed to bring his or her spouse and any of their dependent children under the age of 18. However, the source said that he was aware of cases where applicants falsely claimed their sons or daughters were under 18, whereas they were in their 20s. \"Now they are going to college with UK kids who are very much younger than them, which is worrying to the community and a risk to British culture,\" he said. Holidays back in Afghanistan Successive governments since 2010 have used a variety of different routes to relocate some 35,000 Afghans - applicants and family members - to the UK. More are still scheduled to arrive, though no new applications are being accepted. The Ministry of Defence expects the total cost to be between £5.5bn and £6bn. Britain's first resettlement scheme - the \"intimidation policy\" - was set up to help those facing serious threats from the Taliban because of their links to British forces. An additional programme not based on threat was established in 2012 for individuals such as interpreters who had worked in dangerous roles with British soldiers for at least a year. Criteria for eligibility were expanded further in 2021 amid fears about the impact of growing instability as the Taliban surged back into government. Yet, four years on, the Afghan source said he is aware of Afghans who have been resettled in the UK but who have travelled back and forth to Afghanistan for holidays and other trips. \"We have witnessed … interpreters from various units, from SF [special forces] units …there are hundreds of them going in, coming back,\" he said. \"It made me disappointed because [British] people believed there was a high threat to the interpreters.\" Sky News contacted one former interpreter by phone who is living in Britain after he shared images on his social media account of himself back in Afghanistan in the early summer. Now on British soil again, he claimed he had made the trip to his home country in secret and in great fear to accompany his mother to her brother's funeral. However, when asked why he had openly tagged his whereabouts - including a picture of him outside Kabul airport and enjoying a picnic outside the capital as well as footage of a group of men in swimming shorts diving into a pool - he claimed these images could not be viewed by anyone in Afghanistan. After ending the call, the former interpreter blocked his number. He subsequently made the pictures and videos on his Facebook page private. They had previously been public. Fake Taliban threat letters 'huge business' Many applications for resettlement were processed by a team of civil servants, military personnel and contractors that was based at the UK's Permanent Joint Headquarters in Northwood in the summer of 2021 before it was moved to the Ministry of Defence (MoD). At one point, the team had more than 100,000 cases waiting to be dealt with, according to a British source with direct knowledge of the relocation effort. Each file contained information about an applicant, including evidence of any threat they said they faced. If deemed credible, it made a person's application a higher priority. But the Afghan source said this evidence often appeared to be fake. Examples included one man who borrowed a neighbour's gun, then shot his own car and pretended the Taliban had done it; a second man who sent a video that he said was of his wife being beaten by the Taliban only for it to be an unrelated video taken from the Internet; and a third man who sent a photo of his dead cousin, saying he had been killed by the Taliban only for it to transpire that he had died in a car accident. The British source, as well as a third source also with direct knowledge of the effort to process applications, said they too had seen multiple cases of phoney threats. The Afghan source claimed there had been a thriving business in Afghanistan to produce fake Taliban threat letters. \"This is very traditional, making fake intimidation letters, fake documents… to make legitimate [an applicant's] pathway to come to the United Kingdom,\" he said. He connected Sky News by phone with a man in Afghanistan who said he had knowledge of the fake threat letter business. The man agreed to speak anonymously. \"It was typical threat letters, threatening people, for example, [we] will kill you and scare them, depending on the cases,\" he said. \"It was a huge business, with thousands of them. Lots of these letters were made,\" he said. He said it would cost between $1,000 (£740) and $1,500 (£1,110) to order a fake letter. Asked why someone would want one, he said: \"For various purposes, such as claiming asylum or moving out of the country.\" He claimed the Taliban has now cracked down on the practice, however. The Afghan source said he did not believe the Taliban would specifically hunt down someone because they had once worked as a shopkeeper or even an interpreter on a British base more than a decade ago. Instead, he said any killings - which do take place under the Taliban's hardline Islamist rule - were far more likely to be related to tribal disputes, personal vendettas or other factors. Data leak is a 'waste of time' Yet an accidental leak of data by a military official involving the names of nearly 19,000 people who had been applying for relocation to the UK sparked new concerns within the MoD that lives may have been put at risk. It led to the previous government opening a secret resettlement route to the UK for thousands of impacted individuals who would not otherwise have been eligible for help. Details about the data breach - which happened back in 2022 but was only identified in 2023 - were only revealed in July following the lifting of extraordinary legal restrictions that had prevented any reporting of the incident.  The easing of secrecy was in part enabled by the findings of an independent review commissioned by the Ministry of Defence that also played down the risk of Taliban reprisals based on a person's previous links to the British government. Instead, the review found that resistance to current Taliban rule \"is likely to be a far more persuasive factor in the threat faced by individuals in Afghanistan\". The Afghan source agreed. The \"data leak is a waste of time, intimidation is fake, and threat letters are fake, there is no security risk\", he said. \"That's why I'm calling it out to stop the Afghan relocations.\" He said the money spent on resettling Afghans would be much better spent on rebuilding the British armed forces. Read more from Sky News:Moving Afghan nationals to UK forecast to cost more than £2bnThousands more Afghans affected by second data breach  'I am very scared' Sky News got in touch another former interpreter by phone. This man also worked with British soldiers when they were deployed to Helmand province more than a decade ago, but he claims to have been unfairly sacked. He has yet to be offered relocation to the UK even though his name was caught up in the data leak. The man said the breach had put him and his family at even greater risk. \"I am very scared of the situation,\" he said, speaking from Kabul in late July. He said he was unable to go out in public, having been forced a few days earlier back to Afghanistan from Iran where he said he had been in hiding. He was speaking while travelling in the back of a car at night with one of his children on his lap and some of his belongings next to him. \"I can't walk freely in public safe…It's dangerous for me,\" he said. However, his public Facebook profile appears to show him working for a company in the capital, with photographs of him posted by his boss at a corporate event on 1 July. Other pictures show him on company business in another province last December. When asked about his Facebook profile, the man said: \"Someone is using my ID. I don't have access to that Facebook.\" Asked whether he was saying the posts were fake, he said: \"I already said that. I don't have access to that Facebook unfortunately. I'm not using that account anymore.\" He subsequently asked to end the call and said he would phone back in a few minutes. However, he then said he was unable to make that call. When sent follow-up questions by text message to clarify how he could claim to be in hiding when photographs and videos have been posted of him on Facebook at a corporate event in Kabul, he responded by saying \"You are [sic] claimed that I am safe see this.\" He then sent links to some news articles, including one about the danger posed to Afghans affected by the data breach. Rafi Hottak, another former interpreter who served with British forces in Afghanistan, strongly disputes claims that the Taliban is not a threat to those with links to the British. Mr Hottak has lived in the UK since 2011 and is a leading campaigner advocating on behalf of those interpreters as well as members of elite Afghan security units who worked with British special forces - known as the Triples - who have yet to be resettled. In a statement, he said: \"The threat is immediate, severe, and constant. The Taliban view anyone who worked with foreign forces as a traitor. Many live in hiding, moving from place to place, unable to work or live openly. Arrests, beatings, and executions happen regularly.\" An MoD spokesperson said: \"We are committed to honouring the moral obligation we owe to those Afghans who stood with our brave men and women. \"As with all those arriving to the UK, anyone found eligible for relocation from Afghanistan and their family members undergo robust security checks, including for national security. If they don't pass these checks, they are not granted entry to the UK.\" After the MoD's independent review was concluded this year, the UK reduced the number of immediate family members eligible for relocation to three from seven. But the British source with knowledge of the resettlement process alleged that the system had previously been \"severely abused\" in 2021 and early 2022 \"with multiple family members being moved\" to the UK. This included - on occasion - second wives, he said. \"Everyone who was approved should have their case re-looked at and assessed against a strict criteria, if found not eligible they should be taken back home along with all additional family members,\" he told Sky News, before adding: \"But that is never going to happen.\" Additional reporting by Jack Taylor and Katy Scholes"
    },
    {
        "title": "Donald Trump to introduce $100,000 fees on skilled foreign worker visas",
        "description": "Donald Trump will introduce a new $100,000 application fee for foreign worker visas.",
        "url": "https://news.sky.com/story/donald-trump-to-introduce-100000-fees-on-skilled-foreign-worker-visas-13434299",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-air-force-one_7024791.jpg?20250919063456",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 20:15:00",
        "Headline": "India was the largest beneficiary of H-1B visas last year, accounting for 71% of approved applications.",
        "Content": "Donald Trump will introduce a new $100,000 application fee for foreign worker visas. A White House official said the US President is preparing to sign a proclamation today that will require a $100,000 application fee for H-1B visa, which covers highly-skilled foreign workers. The charge is part of a broader immigration crackdown. H-1B visas are meant to bring the best and brightest foreigners for high-skilled jobs that tech companies find difficult to fill with qualified Americans and other permanent residents. The programme has drawn criticism for becoming a pipeline for overseas workers who are often willing to work for wages lower than those typically paid to US technology workers. Critics also argue that companies use H-1B visas to overlook Americans for jobs. First lady Melania Trump, the former Melania Knauss, was granted an H1-B work visa in October 1996 to work as a model. She was born in Slovenia. What is a H-1B visa? \n                  Judge throws out Donald Trump's $15bn lawsuit against the New York Times\n                 \n                  Trump and Starmer quizzed on Epstein\n                 \n                  Ban Mandelson from returning to parliament, says Labour peer\n                 The H-1B programme has been crucial for technology and staffing companies who rely on foreign workers. Historically, these visas - 85,000 per year - have been doled out through a lottery system.  India, the largest beneficiary of H-1B visas last year, accounted for 71% of approved beneficiaries. China was second with 11.7%, according to government data. Shares of IT services company, Cognizant Technology Solutions Corp, fell by over 5% on Friday."
    },
    {
        "title": "MI6: 'No evidence' Putin wants to negotiate peace in Ukraine",
        "description": "There is \"absolutely no evidence\" Russia's president wants to negotiate peace in Ukraine, the head of Britain's foreign intelligence service has said.",
        "url": "https://news.sky.com/story/mi6-no-evidence-putin-wants-to-negotiate-peace-in-ukraine-13433863",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-pokrovsk_7023623.jpg?20250918015359",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 09:22:00",
        "Headline": "Outgoing MI6 chief Sir Richard Moore said Vladimir Putin was \"stringing us along\", but said \"he - and many others - underestimated the Ukrainians\".",
        "Content": "There is \"absolutely no evidence\" Russia's president wants to negotiate peace in Ukraine, the head of Britain's foreign intelligence service has said. MI6 chief Sir Richard Moore told a news conference on Friday Vladimir Putin was \"stringing us along\". \"He seeks to impose his imperial will by all means at his disposal. But he cannot succeed,\" Sir Moore said. \"Bluntly, Putin has bitten off more than he can chew. He thought he was going to win an easy victory. But he - and many others - underestimated the Ukrainians.\" Ukraine latest: Russia threatening Finland 'in same way it targeted Ukraine before invasion' Sir Moore's comments come a day after US President Donald Trump said the Russian president had \"let me down\" in his efforts to end the war. Speaking at a news conference during his state visit to the UK, President Trump said he thought the war in Ukraine would be the easiest conflict to resolve \"because of my relationship with President Putin... but he's let me down. He's really let me down.\" \n                  MI6 launches new drive to recruit spies - including Russians\n                 \n                  MI6 gets its first female chief - but here's 4 top UK jobs that a woman has never done\n                 \n                  Career spy Blaise Metreweli to become first woman to head MI6\n                 Mr Trump's diplomatic efforts, including a summit with President Putin in Alaska last month, have so far failed to produce a breakthrough. Standing alongside him, Sir Keir Starmer said the two leaders had discussed how to \"decisively increase the pressure on Putin to get him to agree a peace deal that will last,\" but that Putin's actions in Ukraine in recent weeks are \"not the actions of someone who wants peace\".  Tens of thousands of people have been killed since Russia launched its invasion of Ukraine in February 2022. Sir Moore said the ensuing war had strengthened Ukraine's national identity and accelerated its shift towards the West. \"Putin has sought to convince the world that Russian victory is inevitable. But he lies. He lies to the world. He lies to his people. Perhaps he even lies to himself,\" he said. Putin is \"mortgaging his country's future for his own personal legacy and a distorted version of history\", he added, saying the war was \"accelerating this decline\". Sir Moore, who leaves his post at the end of September after five years as the head of MI6, made the remarks at an outgoing news conference in Istanbul. The Secret Intelligence Service will then get its first female chief, Blaise Metreweli.​​​​  Read more from Sky News:Elderly British couple detained in Afghanistan freedPolice fire tear gas at protesters in FranceIsrael's Gaza City offensive branded 'horrific' Sir Moore was speaking as MI6 unveiled a dark web portal, dubbed \"Silent Courier\", to recruit new spies for the UK. Special correspondent The outgoing MI6 chief has said - in his final speech as head of the UK's foreign intelligence agency - that he sees \"no evidence\" Russian leader Vladimir Putin has \"any interest in a negotiated peace short of Ukrainian capitulation\".  In a speech sometimes tinged with emotion and packed with pride about his years leading the agency, Sir Richard Moore told a small group of invited guests in Istanbul where he once served as ambassador and where one of his children was born, how he believes Putin is \"stringing us along\".  His successor, Blaise Metreweli - the first woman appointed to the position as 'C' (as the agency's leader is nicknamed) - was in the audience to hear him appeal to Russian citizens to help the British spy on the Kremlin.  \"To those men and women in Russia who have truths to share and the courage to share them, I invite you to contact M16,\" Sir Richard implored. \"You will be working to bring peace to our continent; to protect the long-term interests and redeem the honour of your country\".  Sir Richard went on to assure the Russian citizens who might be tempted that \"we will do everything to keep you safe\". The decision to move into the dark web to encourage the sharing of information comes as peace in Ukraine seems as far away as ever.  The spy chief - who has been at the helm for five years - identified Russia alongside China and Iran as the countries threatening UK security the most. But he also added Gaza needs peace too, \"for a reset to take hold in the region and to prevent further appalling suffering of innocent Palestinians,\" and warned the Israeli bombardment there was \"fuelling radicalisation globally\".  The secure messaging platform aims to boost national security by making it easier for the intelligence agency to recruit potential agents in Russia and around the world, the Foreign Office said. \"To those men and women in Russia who have truths to share and the courage to share them, I invite you to contact MI6,\" Sir Moore said. "
    },
    {
        "title": "AI-generated 'minister' makes debut in Albanian parliament",
        "description": "The world's first AI-generated government \"minister\" has been introduced to the Albanian parliament to a mixed reception.",
        "url": "https://news.sky.com/story/ai-generated-minister-makes-debut-in-albanian-parliament-13433967",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-diella-albnia-ai-ministeer_7018568.jpg?20250912232408",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 12:47:00",
        "Headline": "The opposition banged their tables in protest as the so-called state minister for artificial intelligence, named Diella, appeared in front of parliament.",
        "Content": " The world's first AI-generated government \"minister\" has been introduced to the Albanian parliament to a mixed reception. The so-called state minister for artificial intelligence, named Diella, appeared in front of parliament with a three-minute address delivered on two screens on Thursday, almost a week after Prime Minister Edi Rama revealed it would be part of his cabinet. Mr Rama said he was presenting Diella - the female form of the word for 'sun' in the Albanian language - as a symbol of his government's push for transparency and innovation, assigning it the task of addressing corruption concerns. The avatar, which was depicted as a woman wearing traditional Albanian dress, told MPs: \"I am not here to replace people but to help them. \"True, I have no citizenship, but I have no personal ambition or interests either. \"I assure you that I embody such values as strictly as every human colleague, maybe even more,\" it added. Opposition lawmakers objected, arguing the move was unconstitutional as the bot is not human, does not hold Albanian nationality and could lead to more corruption. They banged their hands on their tables as the video played, and boycotted a vote on the programme, but it passed anyway with 82 votes in favour in the 140-seat parliament. Read more:MI6 uses dark web to recruit spiesMeta announces new smart glasses - and we've tried them Justifying itself in its speech, the bot said: \"The constitution speaks of institutions at the people's service. It doesn't speak of chromosomes, of flesh or blood. \"It speaks of duties, accountability, transparency, non-discriminatory service.\" Socialist Mr Rama, who won a fourth term in office in May, argued that the bot would help the government work faster and with full transparency. Diella was developed earlier this year in partnership with Microsoft and uses the latest AI models and methods to ensure accuracy in carrying out its responsibilities, according to Albania's National Agency for Information Society. It is part of his larger plan to highlight the nation's technological innovations as the government works toward European Union membership, which it has pledged to secure within five years."
    },
    {
        "title": "Remains believed to be of ex-soldier accused of killing his three daughters found in Washington state",
        "description": "Remains believed to be those of a former soldier suspected of kidnapping and murdering his three daughters have been found in a remote wooded area of Washington state, authorities have said.",
        "url": "https://news.sky.com/story/remains-believed-to-be-of-ex-soldier-accused-of-killing-his-three-daughters-found-in-washington-state-13433774",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-decker-wenatchee_6934198.jpg?20250604051143",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-19 06:33:00",
        "Headline": "Travis Decker, 32,  had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite.",
        "Content": "Remains believed to be those of a former soldier suspected of kidnapping and murdering his three daughters have been found in a remote wooded area of Washington state, authorities have said. \"While positive identification has not yet been confirmed, preliminary findings suggest the remains belong to Travis Decker,\" Chelan County Sheriff's Office said in a statement on Thursday. Decker, 32, had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite outside Leavenworth.   They had been bound with zip ties and had plastic bags placed over their heads. A preliminary examination found they died of asphyxiation. Three days earlier, Decker had failed to return the girls to their mother's home in Wenatchee, about 100 miles east of Seattle, following a scheduled visit. The children attended Lincoln Elementary in Wenatchee school district. Their mother told police the girls did not return as planned and that Decker's phone went straight to voicemail. Last September she had warned authorities Decker was experiencing mental health issues and that he had become increasingly unstable. She described him as homeless and sought to have their parenting plan changed to restrict him from having overnight visits with their daughters until he found somewhere to live. Officials said Decker joined the US army in 2013 and was deployed to Afghanistan for four months in 2014. He moved to the Washington National Guard in 2021, going part-time in the past few years, but stopped attending drills about a year ago. Authorities said he had training in navigation, survival and other skills, and once spent more than two months living in the backwoods off the grid. The search for Decker involved 100 personnel from state and federal agencies across hundreds of square miles, much of it mountainous and remote, by land, water and air. The US Marshals Service offered a reward of up to $20,000 (£14,800) for information leading to his capture."
    },
    {
        "title": "US talk show hosts react to Jimmy Kimmel cancellation - as Trump issues threat",
        "description": "US talk show host Stephen Colbert has condemned the cancellation of fellow late-night star Jimmy Kimmel as a \"blatant assault on freedom of speech\", as America's top late night presenters came out fighting.",
        "url": "https://news.sky.com/story/kimmels-colleagues-come-out-fighting-heres-what-they-had-to-say-to-trump-13433740",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jon-stewart-stephen-colbert_7024781.jpg?20250919045205",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-19 01:48:00",
        "Headline": "After Jimmy Kimmel was suspended for comments he made about Charlie Kirk, his fellow late-night hosts have rallied around him - with some pointed barbs towards Donald Trump.",
        "Content": " US talk show host Stephen Colbert has condemned the cancellation of fellow late-night star Jimmy Kimmel as a \"blatant assault on freedom of speech\", as America's top late night presenters came out fighting. He used the opening of Thursday night's edition of his Late Show to address the pulling of Jimmy Kimmel Live over comments made about the assassination of the right-wing influencer Charlie Kirk. Kimmel used his show earlier this week to accuse the Trump administration and its allies of \"working very hard to capitalise on the murder of Charlie Kirk\", with the president among those to pin it on left-wing extremism. Explainer: What did Jimmy Kimmel say about Charlie Kirk? The move by Disney-owned ABC has been widely criticised, with the network accused of kowtowing to President Donald Trump, who celebrated the decision. Speaking to reporters on board Air Force One on Thursday, Mr Trump suggested certain networks should have their licences revoked over a lack of support for him. \"When a late-night host is on network television there is a licence,\" he said. \"I read somewhere that the networks were 97% against me… they give me only bad publicity or press, I mean [if] they're getting a licence. I would think maybe their licence should be taken away.\" Also airing on Thursday night, Jon Stewart, host of Comedy Central's Daily Show, appeared in a garish gold set, in parody of Mr Trump's redesign of the White House, to tell viewers the episode would be \"another fun, hilarious, administration-compliant show\". Stewart, playing the role of an over-the-top, politically obsequious TV host under authoritarian rule, lavished praise on the president and satirised his criticism of US cities and his deployment of the National Guard to fight crime. \"Coming to you tonight from the real […] crime-ridden cesspool that is New York City. It is a tremendous disaster like no-one's ever seen before. Someone's National Guard should invade this place, am I right?\" he said. He then introduced his guest - Maria Ressa, a journalist and author of the book How To Stand Up To A Dictator. Over at The Tonight Show, Jimmy Fallon told his audience he was \"not sure what was going on\" but that Kimmel is \"a decent funny and loving guy and I hope he comes back\". Fallon then promised viewers that in spite of people being \"worried that we won't keep saying what we want to say or that we will be censored\", he was going to cover the president's recent trip to the UK \"just like I normally would\". He was then replaced by a voiceover describing Mr Trump as \"incredibly handsome\" and \"making America great again\". Seth Meyers also joined the fray. \"Donald Trump is on his way back from a trip to the UK,\" he said at the top of his show Late Night, \"while back here at home, his administration is pursuing a crackdown on free speech… and completely unrelated, I just wanted to say that I have always admired and respected Mr Trump. \"I have always believed he was a visionary, an innovator, a great president, and an even better golfer.\" Kimmel's removal from the show he has hosted for two decades led to criticism that free speech was under attack. But speaking on his visit to Britain, Donald Trump claimed he was suspended \"because he had bad ratings\". It came after fellow late-night host Colbert saw his programme cancelled earlier this year, which fans claimed was also down to his criticism of Mr Trump, who has since railed against Kimmel, Meyers, and Fallon. He has posted on Truth Social that they should all be cancelled. Figures from both the worlds of entertainment and politics lined up to lament ABC's removal of Kimmel. Chat show doyen David Letterman said people should not be fired just because they don't \"suck up\" to what he called \"an authoritarian\" president. During an appearance at The Atlantic Festival 2025 in New York on Thursday night, he added: \"It's no good. It's silly. It's ridiculous. \"I feel bad about this, because we all see where see this is going, correct? It's managed media.\" Former US president Barack Obama wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\""
    },
    {
        "title": "Judge throws out Donald Trump's $15bn lawsuit against the New York Times",
        "description": "Donald Trump's $15bn defamation lawsuit against The New York Times has been struck down by a judge, giving the president 28 days to try again.",
        "url": "https://news.sky.com/story/judge-throws-out-donald-trumps-15bn-lawsuit-against-the-new-york-times-13434120",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-chequers_7025146.jpg?20250919133316",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-19 17:10:00",
        "Headline": "The US president, who said it is an \"honour \"to sue the New York Times, has been given 28 days to amend his complaint.",
        "Content": "Donald Trump's $15bn defamation lawsuit against The New York Times has been struck down by a judge, giving the president 28 days to try again. Earlier this week, Mr Trump said it's his \"honour\" to sue the newspaper, after it published a report on alleged notes he sent to Jeffrey Epstein. US District Judge Steven Merryday described Mr Trump's complaint as a \"decidedly improper\" attempt to attack an adversary. A complaint, he said, should \"fairly, precisely, directly, soberly, and economically inform the defendants... of the nature and content of the claims\". \"A complaint is not a public forum for vituperation and invective - not a protected platform to rage against an adversary,\" the judge added. He has given Mr Trump 28 days to submit an amended complaint of no more than 40 pages. A spokesman for Trump's legal team said: \"President Trump will continue to hold the Fake News accountable through this powerhouse lawsuit against the New York Times, its reporters, and Penguin Random House, in accordance with the judge's direction on logistics.\" In a separate statement, a spokesperson for the New York Times said: \"We welcome the judge's quick ruling, which recognised that the complaint was a political document rather than a serious legal filing.\" Penguin Random House has not responded to requests for comment. Anger over Epstein story  In a post on his social media site Truth Social, Mr Trump announced he was suing the paper, which he described as \"one of the worst and most degenerate newspapers\". The lawsuit - brought in Florida - came after Mr Trump raised the prospect of legal action over its story about alleged notes he had sent to Epstein - a report he said is false. A lewd birthday message Trump allegedly sent to the convicted sex offender for his 50th birthday in 2003 was published by US Congress days later. Explainer: What you need to know about Trump and the Epstein files The collection of birthday tributes include a hand-drawing of a woman's body, signed \"Donald\". They also contain a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\". Mr Trump has maintained the note wasn't written by him, claiming the handwriting and signature do not match his own. Crackdown on networks  The president's fury at media has not been limited to the New York Times, with a late-night talk show hosted Jimmy Kimmel dropped by broadcaster ABC. That came after Kimmel used his show this week to accuse the Trump administration of \"working very hard to capitalise on the murder of Charlie Kirk\". The president has been among those to try and pin the killing on left-wing extremism, despite police not yet concluding a motive. The move by Disney-owned ABC has been widely criticised, with the network accused of kowtowing to Mr Trump, who celebrated the decision. Read more:What did Jimmy Kimmel say?Analysis: Trump's creeping control While aboard Air Force One, Mr Trump suggested networks who only give him \"bad publicity\" could have their licence taken away. \"When a host is on network television, there is a license... I think maybe their license should be taken away,\" he said, claiming coverage is 97% negative in some cases. In a social media post on Friday, Mr Trump's vice president said Kimmel \"wasn't funny\" and that his ratings were \"in the toilet\". \"Also the bellyaching from the left over 'free speech' after the Biden years fools precisely no one,\" JD Vance added. \"There was a point where I'd watch his show nearly every night. He's a genuinely talented guy, but like so much good and funny in the world the woke thing destroyed it.\""
    },
    {
        "title": "Trump and Xi discuss TikTok deal to stop US ban",
        "description": "President Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for a deal that would see US TikTok sold. ",
        "url": "https://news.sky.com/story/trump-and-xi-discuss-tiktok-deal-to-stop-us-ban-13433941",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tiktok-social-media_7025147.jpg?20250919133422",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-19 12:08:00",
        "Headline": "President Trump said the US was getting a \"tremendous fee plus\" for brokering the deal between US companies and China.",
        "Content": "\n          Science and technology reporter\n       President Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for a deal that would see US TikTok sold.  Once confirmed, the deal should stop TikTok being banned in the US after lawmakers decided it posed a security risk to citizens' data. Congress had ordered the app shut down for American users by January 2025 if its Chinese owner ByteDance didn't sell its assets in the country - but the ban has been delayed four times by President Trump. \"We made progress on many very important issues including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal,\" said President Trump in a Truth Social post after the call. Mr Trump later told reporters at the White House that Xi had approved the deal but said it still needed to be signed. He said: \"We were able to work out a deal with China and it's a very good deal for us.\" Asked if the US government was going to take a board seat at the company, Mr Trump responded: \"We're going to announce it. It's a great deal for our country, it's a great deal for all of the young people in the country that wanted it.\" \n                  Speaker makes 'strong and punchy' protest to home secretary over dropping of Chinese spy charges\n                 \n                  Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 \n                 \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 He continued: \"I wasn't a fan of TikTok and then I got to use it and then I became a fan and it helped me win an election in a landslide.\" In a readout on state media, President Xi said the call was \"pragmatics\" and said the two leaders \"had a candid and in-depth exchange of views on current China-U.S. relations\". The readout added that China's \"position on the TikTok issue is clear: the Chinese government respects the will of companies and is pleased to see companies conduct business negotiations on the basis of market rules and reach solutions that comply with Chinese laws and regulations and balance interests\". ByteDance, the Chinese company that owns TikTok, posted after the call, thanking the two leaders for \"their efforts to preserve TikTok in the United States\". \"ByteDance will work in accordance with applicable laws to ensure TikTok remains available to American users through TikTok U.S\", said the statement. TikTok is reportedly building a separate app for US users, although it was confirmed this week it would use the original ByteDance algorithm that made TikTok so valuable in the first place. Software firm Oracle, along with US tech investors Silver Lake and Andreessen Horowitz, is expected to own an 80% share of US TikTok while China maintains a 20% share, according to the Wall Street Journal.. US user data is expected to be processed by Oracle in Texas. Beijing was long opposed to the sale, but earlier this week described the arrangement as win-win for the US and China. Read more from Sky News:From Russia with love: MI6 launches new drive to recruit spiesThree arrested on suspicion of helping Russian intelligenceTeenagers charged over cyber attack on TfL costing millions Friday's call between the US and Chinese leaders was only the second since President Trump launched steep tariffs on China, triggering a trade war between the two nations. After the call, President Trump said on Truth Social that he and President Xi agreed \"we would meet at the APEC Summit in South Korea\" next month, and he will travel to China early next year. Chinese state media said in the readout after the call that the US hopes to promote bilateral economic and trade cooperation, will support consultations between the two teams, and properly resolve the TikTok issue."
    },
    {
        "title": "Donald Trump to introduce $100,000 fees on skilled foreign worker visas",
        "description": "Donald Trump will introduce a new $100,000 application fee for foreign worker visas.",
        "url": "https://news.sky.com/story/donald-trump-to-introduce-100000-fees-on-skilled-foreign-worker-visas-13434299",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-air-force-one_7024791.jpg?20250919063456",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-19 20:15:00",
        "Headline": "India was the largest beneficiary of H-1B visas last year, accounting for 71% of approved applications.",
        "Content": "Donald Trump will introduce a new $100,000 application fee for foreign worker visas. A White House official said the US President is preparing to sign a proclamation today that will require a $100,000 application fee for H-1B visa, which covers highly-skilled foreign workers. The charge is part of a broader immigration crackdown. H-1B visas are meant to bring the best and brightest foreigners for high-skilled jobs that tech companies find difficult to fill with qualified Americans and other permanent residents. The programme has drawn criticism for becoming a pipeline for overseas workers who are often willing to work for wages lower than those typically paid to US technology workers. Critics also argue that companies use H-1B visas to overlook Americans for jobs. First lady Melania Trump, the former Melania Knauss, was granted an H1-B work visa in October 1996 to work as a model. She was born in Slovenia. What is a H-1B visa? \n                  Judge throws out Donald Trump's $15bn lawsuit against the New York Times\n                 \n                  Trump and Starmer quizzed on Epstein\n                 \n                  Ban Mandelson from returning to parliament, says Labour peer\n                 The H-1B programme has been crucial for technology and staffing companies who rely on foreign workers. Historically, these visas - 85,000 per year - have been doled out through a lottery system.  India, the largest beneficiary of H-1B visas last year, accounted for 71% of approved beneficiaries. China was second with 11.7%, according to government data. Shares of IT services company, Cognizant Technology Solutions Corp, fell by over 5% on Friday."
    },
    {
        "title": "Country singer-songwriter Brett James dies in small plane crash",
        "description": "US singer-songwriter Brett James has died in a small plane crash, according to music industry officials.",
        "url": "https://news.sky.com/story/country-singer-songwriter-brett-james-dies-in-small-plane-crash-13433819",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-brett-james-singer_7024884.jpg?20250919104708",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-19 08:19:00",
        "Headline": "Brett James, 57, released one solo album in the 1990s but was better known for the hundreds of songs he worked on behind the scenes.",
        "Content": "US singer-songwriter Brett James has died in a small plane crash, according to music industry officials. James, 57, released one solo album in the 1990s but was better known for the hundreds of country songs he worked on behind the scenes. His most famous was Carrie Underwood's Jesus, Take The Wheel, which won two Grammys - for best country song and best female country vocal performance in 2007.   The country musician was on board a \"small engine airplane\" when it crashed on Thursday, the Nashville Songwriters Hall of Fame said in a statement. \"We mourn the untimely loss of Hall of Fame member Brett James, a 2020 inductee who was killed in a small-engine airplane crash on September 18,\" it wrote on its Facebook page. Nashville Songwriters Association International (NSAI) also posted an online tribute, describing him as a \"legendary songwriter and board member\" and adding: \"The loss is profound.\" According to flight data, the plane was registered in James's name and had three people on board when it came down near Franklin, North Carolina. The US National Transportation Safety Board said it will investigate the circumstances of the crash. Read more from Sky NewsWembley hosts star-studded gig for PalestineWhy has Jimmy Kimmel been suspended?Robert Redford dies aged 89 James was well known in the country music scene, working with major artists including Billy Ray Cyrus, Kenny Chesney, and Martina McBride. His work on Jessica Andrews's song Who I Am in 2001 earned him his first number one single. Among his other accolades were the Academy of Country Music (ACM) single of the year, the American Society of Composers, Authors, and Publishers (ASCAP) country song of the year, and NSAI song of the year. ASCAP paid tribute to him on X, describing him as a \"trusted collaborator to country's greatest names and a true advocate for songwriter\". Country star Sara Evans's tribute on Instagram read: \"I am absolutely devastated at the loss of one of the best writers I've ever written with and recorded several of his songs. Brett James. I'm praying for his loved ones. What a tragic and sad day. He will be so missed.\""
    },
    {
        "title": "Could Trump's visit come back to haunt Britain's establishment?",
        "description": "The weeks and months ahead will determine whether Keir Starmer has been naive.",
        "url": "https://news.sky.com/story/could-trumps-visit-come-back-to-haunt-britains-establishment-13433738",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-donald-trump_7023895.jpg?20250919113923",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-09-19 00:16:00",
        "Headline": "In all, the British government will take the historic second state visit as a big win. But it could be a big gamble too. Mark Stone breaks down the highs and lows.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The weeks and months ahead will determine whether Keir Starmer has been naive. We will find out just how successful the attempt to deepen a bond with this mercurial president has been. Has the prime minister actually achieved something with this state visit, or will it amount to nothing? But there is plenty to absorb from these remarkable two days. Here are my immediate reflections. Everyone happy First, there is no question that both sides are very happy with how it went. I had a quick chat with Donald Trump's chief of staff, Susie Wiles, as the PM-president talks wrapped up at Chequers. Her face and her persona said it all. But she spelt it out anyway for me: \"The whole thing has been just great.\" \"Every part of it. Dinner was the best bit,\" she told me, before adding: \"I just want to do it all over again.\" But this wasn't a trip to Disneyland. It was the real deal; an attempt by one country to woo another with the best it's got to offer, because it needs to. With Trump, you're in, or you're out. It's that simple. The British side believes this state visit has been excellent for them too. \"I think this was a big win for the PM, after a torrid few weeks…\" one diplomatic source told me tonight. Another said: \"It was great. All very positive.\" Tech bonanza  The \"who's who\" and \"who's where\" at the state banquet had been a hint of the day that followed. The US Treasury Secretary Scott Bessant was next to the Queen. The business-orientated dinner at the castle morphed into a business round table a day later at the PM's country residence Chequers. The question for me then was: What were the outcomes? The deliverables?  So much of this, always, is about flattery. And so the prime minister mimicked the president's style at the event. He used superlatives to frame a massive tech deal which he said would amount to £250bn \"flowing both ways across the Atlantic\". It was, Starmer said, the \"biggest investment package of its kind in British history, by a country mile\". It sounded very Trumpian. The \"Tech Prosperity Deal\" really does bring inward investment to Britain. Thousands of jobs promised; tech, AI, data centres and the nuclear energy required to power it all. Read more:Trump tells PM how to stop small boatsTrump historic state visit - second day in picturesEight things you might have missed from state visit It sounded very exciting but needs to be seen to be believed. And we don't know what the trade-off is. \"Don't be cynical,\" one UK source told me. The broad ambition seems to be a kind of continuum of the 'special relationship' between the UK and the US, pushing into the next chapter of the 21st century. If it was defence and security ties at the start of the relationship back in the mid 20th century, now it's about common frameworks to harness new challenges like AI and to lead, together. No regulation? Delivering this new tech deal would be easier if Britain was to realise its Brexit potential. That's the view of Trump's Commerce Secretary Howard Lutnick who I also managed to corner for a few seconds. I asked Lutnick what America wants in return. \"Deregulation…!\" he said. \"Don't copy Europe. Copy America.\" I asked if he thought the UK was willing to ditch its digital services tax. \"Ask them,\" he said, and then added: \"If Starmer doesn't [scrap it], it isn't for the lack of us reminding him!\" The UK's Digital Services Tax brings in about £900m a year for the UK Treasury. The US tech industry considers it an \"aberration in the tax code\" and wants it scrapped. Would scrapping it grow the economy more than the revenue it brings in? We'll see what the Labour government decides in November's budget. The optimists argue there is, maybe, an opportunity right now for the UK to turn itself into an agile independent economy if it can get the balance of regulation right. The Brexit dividend. Agreeing to disagree  I thought the personal rapport between the PM and the president was fascinating. Despite being so different politically, the two men genuinely seem to get on well. Susie Wiles emphasised this rapport to me. Even she seemed surprised. Their relationship almost seems now to be in a place where they can as individuals, and therefore as governments maybe, agree to disagree without Britain feeling concerned that Trump's America will punish it. Not many other countries can say that. Of course all this may turn out to be deeply naive, but for now Starmer is happy. The example today was the UK plans to recognise a Palestinian state. Trump is hugely against this, but he seemed relaxed about this big geopolitical difference today. That was striking given Trump's character. The banquet speeches  The banquet speeches were more political than I had anticipated. As a prince, the king was overtly political. He is much less so these days, but at the banquet there was one moment that struck me. As King Charles talked about the defence of Ukraine, he turned, intentionally I thought, to Trump as he underlined how the allies will stand together. It was pointed, as Europe wonders where Trump is on Ukraine. Was the president irritated? I don't know, but it was an intentional (and not all that subtle) political intervention by the King to the president. Fascinating. As for the president's speech, well of course he couldn't resist a dig at the Democrats. Even in St George's Hall, in Windsor Castle, he is the political showman and well aware the cameras are rolling. Where were the real people? If there was one thing entirely absent from the state visit, it was real people. There was a strange sterility to the whole visit. The public was kept at a great distance, beyond the walls of the castle and the security fences of Chequers. That said, it was striking that opponents of the president, and those who love him, were notably small in number. It was a very different vibe from his last state visit in 2019. In all, the British government will take this state visit as a big win. But it's a big gamble too. If the critics are right with their \"authoritarian\" warnings, the images from the past two days will come back to haunt the British establishment."
    },
    {
        "title": "Remains believed to be of ex-soldier accused of killing his three daughters found in Washington state",
        "description": "Remains believed to be those of a former soldier suspected of kidnapping and murdering his three daughters have been found in a remote wooded area of Washington state, authorities have said.",
        "url": "https://news.sky.com/story/remains-believed-to-be-of-ex-soldier-accused-of-killing-his-three-daughters-found-in-washington-state-13433774",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-decker-wenatchee_6934198.jpg?20250604051143",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-19 06:33:00",
        "Headline": "Travis Decker, 32,  had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite.",
        "Content": "Remains believed to be those of a former soldier suspected of kidnapping and murdering his three daughters have been found in a remote wooded area of Washington state, authorities have said. \"While positive identification has not yet been confirmed, preliminary findings suggest the remains belong to Travis Decker,\" Chelan County Sheriff's Office said in a statement on Thursday. Decker, 32, had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite outside Leavenworth.   They had been bound with zip ties and had plastic bags placed over their heads. A preliminary examination found they died of asphyxiation. Three days earlier, Decker had failed to return the girls to their mother's home in Wenatchee, about 100 miles east of Seattle, following a scheduled visit. The children attended Lincoln Elementary in Wenatchee school district. Their mother told police the girls did not return as planned and that Decker's phone went straight to voicemail. Last September she had warned authorities Decker was experiencing mental health issues and that he had become increasingly unstable. She described him as homeless and sought to have their parenting plan changed to restrict him from having overnight visits with their daughters until he found somewhere to live. Officials said Decker joined the US army in 2013 and was deployed to Afghanistan for four months in 2014. He moved to the Washington National Guard in 2021, going part-time in the past few years, but stopped attending drills about a year ago. Authorities said he had training in navigation, survival and other skills, and once spent more than two months living in the backwoods off the grid. The search for Decker involved 100 personnel from state and federal agencies across hundreds of square miles, much of it mountainous and remote, by land, water and air. The US Marshals Service offered a reward of up to $20,000 (£14,800) for information leading to his capture."
    },
    {
        "title": "'Bad boys of magic' Penn & Teller inducted into Magic Circle after 50 years of being barred",
        "description": "Penn & Teller have finally been inducted into the Magic Circle - after 50 years of being denied membership.",
        "url": "https://news.sky.com/story/bad-boys-of-magic-penn-teller-inducted-into-magic-circle-after-50-years-of-being-barred-13433894",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-penn-jillette-penn-teller_6760627.jpg?20241128204757",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-19 10:29:00",
        "Headline": "Penn and Teller count the King among their fans, but Donald Trump is said to have put them on his \"enemies list\". Now the Magic Circle is finally inviting them in out of the cold.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Penn & Teller have finally been inducted into the Magic Circle - after 50 years of being denied membership. Rock stars of magic, Penn & Teller found fame in the mid-1980s, earning them fans on both sides of the pond, but their habit of explaining their tricks to the audience also earned them magical disapproval. The duo were famously barred from the Magic Circle for exposing their tricks as part of their act, flying in the face of the organisation's belief in keeping magical secrets from the public. Formed in 1905, the Magic Circle currently has around 1,750 members from around the world, all of whom have passed an exam to join.  Penn & Teller's famous fans include the King (who is also a Magic Circle member), while their critics include Donald Trump, who's said to have put them on his \"enemies list\". The presentation took place on Friday, on the steps of the Palladium, in London's West End, where Penn & Teller are currently performing their 50th Anniversary residency. \n                  Ted Cruz blasts 'mafioso' threats over Jimmy Kimmel suspension\n                 \n                  Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II\n                 \n                  Canada bans Kneecap from entering country as rappers threaten legal action\n                 Magic Circle president Marvin Berglas said: \"In the past they may have been known as the bad boys of magic with their sometimes controversial and hard-hitting choice of material. \"There was criticism from some in the past for their apparently exposing magical secrets. However, for those in the know, the real magic was always with their original and artistic performances whereby audiences thought they understood how something may have been done only to be utterly amazed with an entirely different original method. \"For this - Penn and Teller are the kings. These days The Magic Circle is the place for a truly diverse group of creative minds and talented performers.\" Penn & Teller said: \"We're honoured that the Magic Circle has invited us to be members, after we've violated its cardinal rule - don't give away secrets - for five decades. This is going to be fun.\" Penn & Teller first performed together in August 1975, breaking into the mainstream in the mid-1980s, and touring with critically acclaimed shows throughout the 1990s and achieving TV success in both the US and UK. They will be performing their 50th Anniversary Tour at The London Palladium until Wednesday, 24 September."
    },
    {
        "title": "Tax rises expected as government borrowing highest in five years - latest ONS figures",
        "description": "Government borrowing last month was the highest in five years, official figures show, exacerbating the challenge facing Chancellor Rachel Reeves.",
        "url": "https://news.sky.com/story/highest-government-borrowing-figure-in-5-years-latest-ons-figures-13433766",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-19 05:44:00",
        "Headline": "While more money in taxes is being paid and national insurance payments are coming in, that's being offset by higher spending. \"Stealth\" and \"sin\" taxes are expected to rise   to fill the hole between spending and income. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Government borrowing last month was the highest in five years, official figures show, exacerbating the challenge facing Chancellor Rachel Reeves. Not since 2020, in the early days of the COVID pandemic with the furlough scheme ongoing, was the August borrowing figure so high, according to data from the Office for National Statistics (ONS). Money blog: Borrowers warned of wider market risk   Tax and national insurance receipts were \"noticeably\" higher than last year, but those rises were offset by higher spending on public services, benefits and interest payments on debt, the ONS said. It meant there was an £18bn gap between government spending and income, a figure £5.25bn higher than expected by economists polled by Reuters. A political headache Also released on Friday were revisions to the previous months' data. Borrowing in July was more than first thought and revised up to £2.8bn from £1.1bn previously. For the financial year as a whole, borrowing to June was revised to £65.8bn from £59.9bn. State borrowing costs have also risen because borrowing has simply become more expensive for the government. Interest payments rose to £8.4bn in August.  It compounds the problem for Ms Reeves as she approaches the November budget, and means tax rises could be likely. Her self-imposed fiscal rules, which she repeatedly said she will stick to, mean she must bring down government debt and balance the budget by 2030. Read more:The big story from BoE is a shift to avert massive taxpayer lossesNext issues scathing attack on UK economy Tax rises? Ms Reeves will need to find money from somewhere, leading to speculation taxes will increase and spending will be cut. \"Today's figures suggest the chancellor will need to raise taxes by more than the £20bn we had previously estimated,\" said Elliott Jordan-Doak, the senior UK economist at research firm Pantheon Macroeconomics. \"We still expect the chancellor to fill the fiscal hole with a smorgasbord of stealth and sin tax increases, along with some smaller spending cuts.\" Sin taxes are typically applied to tobacco and alcohol. Stealth taxes are ones typically not noticed by taxpayers, such as freezing the tax bands, so wage rises mean people fall into higher brackets. Increased employers' national insurance costs and rising wages have meant the tax take was already up. Responding to the figures, Ms Reeves's deputy, chief secretary to the Treasury, James Murray, said: \"This government has a plan to bring down borrowing because taxpayer money should be spent on the country's priorities, not on debt interest. \"Our focus is on economic stability, fiscal responsibility, ripping up needless red tape, tearing out waste from our public services, driving forward reforms, and putting more money in working people's pockets.\""
    },
    {
        "title": "NatWest in talks to sell workplace pensions provider Cushon",
        "description": "NatWest Group is looking to offload Cushon, the workplace pensions provider it acquired only two years ago, as its chief executive refocuses one of Britain's biggest high street banks on its core strategic priorities.",
        "url": "https://news.sky.com/story/natwest-in-talks-to-sell-workplace-pensions-provider-cushon-13433855",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-natwest-banking_6455634.jpg?20240214173136",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-19 09:05:00",
        "Headline": "The high street bank is in talks with prospective buyers of Cushon only two years after completing the purchase of an 85% stake in a deal worth nearly £150m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n NatWest Group is looking to offload Cushon, the workplace pensions provider it acquired only two years ago, as its chief executive refocuses one of Britain's biggest high street banks on its core strategic priorities. Sky News has learnt that NatWest is working with advisers on a sale of Cushon, for which it paid £144m in exchange for a controlling stake. City sources said the bank was in detailed talks with a number of potential buyers of the business. Cushon offers workplace pension products as well as a range of workplace ISAs, including Junior ISAs, Lifetime ISAs and General Investment Accounts. Money blog: Britain's best and worst cities to live in ranked NatWest's acquisition of the business was aimed at diversifying its non-interest income by offering Cushon's products to the bank's commercial and business banking customers. Cushon serves roughly 650,000 members across approximately 21,000 employers. \n                  Newly re-privatised NatWest names Chamberlain as retail bank chief\n                 \n                  NatWest boss thanks British taxpayer for 2008 bailout after government sells remaining shares\n                 \n                  Reform UK leader Nigel Farage attacks 'woke virus' in big companies after end of NatWest debanking battle\n                 Its master trust offering has close to £3bn of assets under management and administration, with £17.4m in revenue generated from this area last year - 97% of Cushon's total revenues. NatWest owns an 85% stake in Cushon, with the remainder held by the subsidiary's management. A market source said that Cushon had drawn interest from a significant number of strategic players in the pensions market amid a growing push for consolidation. The government announced major pensions reforms this year aimed at driving greater scale and reducing unnecessary bureaucratic expenses, with a view to defined contribution schemes managing at least £25 billion in assets by 2030. A disposal of Cushon would reflect the strategic priorities of Paul Thwaite, NatWest's chief executive, which include a bank-wide simplification programme and more active balance sheet and risk management. Under Mr Thwaite, NatWest has considered a small number of larger-scale acquisitions, including that of Santander UK. That deal did not progress because of NatWest's determination to pay a price that would be deemed attractive by its shareholders. NatWest returned to full private ownership earlier this year when the government sold the last of the shares it acquired as part of the £45.5bn rescue in 2008 of what was then Royal Bank of Scotland. A NatWest Group spokesperson said: \"We do not comment on speculation. \"Our focus remains on delivering for our customers.\""
    },
    {
        "title": "Shawbrook holds investor talks about £2bn float amid bank tax fears",
        "description": "Shawbrook Group has kicked off initial talks with prospective investors in an initial public offering (IPO) of the business-focused lender, even as the City speculates about potential banking tax hikes in the November Budget.",
        "url": "https://news.sky.com/story/shawbrook-holds-investor-talks-about-1632bn-float-amid-bank-tax-fears-13433849",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-shawbrook-bank-shawbrook_6790958.jpg?20250104090557",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-19 08:56:00",
        "Headline": "The business lender is holding talks with institutions even as it considers delaying its public market return until next year owing to the late timing of Rachel Reeves's autumn Budget, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Shawbrook Group has kicked off initial talks with prospective investors in an initial public offering (IPO) of the business-focused lender, even as the City speculates about potential banking tax hikes in the November Budget. Sky News has learnt that Shawbrook and its advisers have been holding a series of pilot-fishing meetings this month as its owners deliberate over the timing of a flotation. BC Partners and Pollen Street Capital, the private equity firms, initially hoped to launch a London listing in the first half of this year, before pushing back that timetable to sometime before the end of 2025. Money blog: Britain's best and worst cities to live in ranked People close to the company said on Friday that while a flotation in the second half of the year remained possible, the later-than-expected timing of Rachel Reeves's Budget meant that a 2026 stock market return had become increasingly plausible. The Treasury has declined to comment on growing speculation that the chancellor will look to the UK banking sector to fill part of a substantial fiscal black hole. Pilot fishing meetings are held to pre-market an IPO, testing investor sentiment towards a potential deal without the formal launch of a process. \n                  Tax rises expected as government borrowing highest in five years - latest ONS figures\n                 \n                  Money blog: Britain's best and worst cities to live in ranked; pub chain offering free drinks this weekend\n                 \n                  Free tool that will change how you shop on Amazon forever | Sign up to Money newsletter\n                 During the summer, Sky News revealed that Shawbrook was in talks to buy ThinCats, a lender to medium-sized businesses, in a deal worth about £180m. The transaction, which was subsequently confirmed, has fuelled expectations that Shawbrook can attain a public market valuation of more than the £2bn mooted earlier this year. Shawbrook, which employs close to 1,600 people, has well over 500,000 customers. Founded in 2011, it was established as a specialist savings and lending institution, providing loans for home improvement projects and weddings, as well as business and real estate lending. In recent years it has explored a string of sizeable corporate transactions, including mergers with or takeovers of rivals including Metro Bank, Starling Bank and the Co-operative Bank. BC Partners and Pollen Street own equal stakes in Shawbrook, with its management team also owning a minority. The bank is run by Marcelino Castrillo, chief executive. Shawbrook and Pollen Street both declined to comment."
    },
    {
        "title": "Peers back assisted dying bill - but battles lie ahead",
        "description": "The controversial assisted dying bill is still very much alive, having received a second reading in the House of Lords without a vote.",
        "url": "https://news.sky.com/story/peers-back-assisted-dying-bill-but-battles-lie-ahead-13434131",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-assisted-dying-bill_7024988.jpg?20250919111514",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 17:30:00",
        "Headline": "Now comes the hard part for supporters of Labour MP Kim Leadbeater's bill as opponents attempt to make major changes in the months ahead.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n The controversial assisted dying bill is still very much alive, having received a second reading in the House of Lords without a vote. But that doesn't tell the whole story. Day two of debate on the bill in the Lords was just as passionate and emotional as the first, a week earlier. And now comes the hard part for supporters of Labour MP Kim Leadbeater's Terminally Ill Adults (End of Life) Bill, as opponents attempt to make major changes in the months ahead. The Lords' chamber was again packed for the debate, which this time began at 10am and lasted nearly six hours. In all, during 13 hours of debate over two days, nearly 200 peers spoke. According to one estimate, over both days of the debate only around 50 peers spoke in favour of the bill and considerably more than 100 against, with only a handful neutral. The bill proposes allowing terminally ill adults in England and Wales with fewer than six months to live to apply for an assisted death. Scotland's parliament has already passed a similar law. In a safeguard introduced in the Commons, an application would have to be approved by two doctors and a panel featuring a social worker, senior lawyer and psychiatrist. The bill's sponsor in the Lords, Charlie Falconer, said while peers have \"a job of work to do\", elected MPs in the Commons should have the final decision on the bill, not unelected peers. One of the most contentious moments in the first day of debate last Friday was a powerful speech by former Tory prime minister Theresa May, who said the legislation was a \"licence to kill\" bill. That claim prompted angry attacks on the former PM when the debate resumed from Labour peers, who said it had left them dismayed and caused distress to many terminally ill people. The former PM, daughter of a church of England vicar, had claimed in her speech that the proposed law was an \"assisted suicide bill\" and \"effectively says suicide is OK\". But opening the second day's debate, Baroness Thornton, a lay preacher and health minister in Tony Blair's government, said: \"People have written to me in the last week, very distressed. \"They say things such as: 'We are not suicidal - we want to live - but we are dying, and we do not have the choice or ability to change that. Assisted dying is not suicide'.\" Throughout the criticism of her strong opposition to the bill, the former PM sat rooted to her seat, not reacting visibly but looking furious as her critics attacked her.  There was opposition to the bill, too, from grandees of the Thatcher and Major cabinets. Lord Deben, formerly John Gummer and an ex-member of the Church of England synod, said the bill \"empowers the state to kill\". And Lord Chris Patten, former Tory chairman, Hong Kong governor and Oxford University chancellor, said it was an \"unholy legislative mess\" and could lead to death becoming the \"default solution to perceived suffering\". Read more:Paralympian targeted with abuse for opposing assisted dying billThe assisted dying debate has been politics - but not as we know it Day two of the debate also saw an unholy clash between Church of England bishops past and present, with former Archbishop of Canterbury George Carey claiming opponents led by Archbishop of York Stephen Cottrell were out of touch with public opinion. While a large group of bishops sat in their full robes on their benches, Lord Carey suggested both the Church and the Lords would \"risk our legitimacy by claiming that we know better than both the public\" and the Commons. \"Do we really want to stand in the way of this bill?\" he challenged peers. \"It will pass, whether in this session or the next. It has commanding support from the British public and passed the elected House after an unprecedented period of scrutiny.\" But Archbishop Cottrell hit back, declaring he was confident he represented \"views held by many, not just Christian leaders, but faith leaders across our nation in whom I've been in discussion and written to me\". And he said the bill was wrong \"because it ruptures relationships\" and would \"turbocharge\" the agonising choices facing poor and vulnerable people. One of the most powerful speeches came from former Tory MP Craig Mackinlay, awarded a peerage by Rishi Sunak after a dramatic Commons comeback after losing his arms and legs after a bout of sepsis. He shocked peers by revealing that in Belgium, terminally ill children as young as nine had been euthanised. \"I'm concerned we want to embed an option for death in the NHS when its modus operandi should be for life,\" he said. And appearing via video link, a self-confessed \"severely disabled\" Tory peer, Kevin Shinkwin, was listened to in a stunned silence as he said the legislation amounted to the \"stuff of nightmares\". He said it would give the state \"a licence to kill the wrong type of people\", adding: \"I'm the wrong type. This bill effectively puts a price on my head.\"  After the debate, Labour peer and former MP Baroness Luciana Berger, an opponent of the bill, claimed a victory after peers accepted her proposal to introduce a special committee to examine the bill and report by 7 November. \"The introduction of a select committee is a victory for those of us that want proper scrutiny of how these new laws would work, the massive changes they could make to the NHS and how we treat people at the end of their lives,\" she told Sky News. \"It's essential that as we look at these new laws we get a chance to hear from those government ministers and professionals that would be in charge of creating and running any new assisted dying system.\" After the select committee reports, at least four sitting Fridays in the Lords have been set aside for all peers - a Committee of the whole house - to debate the bill and propose amendments. Report stage and third reading will follow early next year, then the bill goes back to the Commons for debate on any Lords amendments. There's then every chance of parliamentary ping pong between the two Houses. Kim Leadbeater's bill may have cleared an important hurdle in the Lords. But there's still a long way to go - and no doubt a fierce battle ahead - before it becomes law."
    },
    {
        "title": "Speaker makes 'strong and punchy' protest to home secretary over dropping of Chinese spy charges",
        "description": "Commons Speaker Sir Lindsay Hoyle has protested to the home secretary after prosecutors dropped charges against two men accused of spying for China and targeting MPs.",
        "url": "https://news.sky.com/story/speaker-makes-strong-and-punchy-protest-to-home-secretary-over-dropping-of-chinese-spy-charges-13434380",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-christopher-cash-christopher-berry_6533862.jpg?20240426103728",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 22:03:00",
        "Headline": "Christopher Cash and Christopher Berry were charged last April under the Official Secrets Act. Charges against them were dropped on Monday.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Commons Speaker Sir Lindsay Hoyle has protested to the home secretary after prosecutors dropped charges against two men accused of spying for China and targeting MPs. Sir Lindsay told Sky News the decision \"leaves the door open\" to foreigners spying on the House of Commons, and he has written a \"strong and punchy\" letter to Shabana Mahmood. The Speaker says \"all avenues\" must be pursued to ensure the protection of MPs and Commons staff, and he is understood to be weighing up whether to carry out a private prosecution. The men - Christopher Cash, a former parliamentary researcher and director of the China Research Group, and Christopher Berry - were charged last April under the Official Secrets Act. The charges related to \"espionage within parliament\", security minister Dan Jarvis told MPs on Monday, in a statement after the case was dropped by the Crown Prosecution Service at the Old Bailey. The pair were accused of targeting the China Research Group of MPs, whose leading members are former Tory security minister Tom Tugendhat, shadow home office minister and former foreign affairs committee chair Alicia Kearns, and shadow minister Neil O'Brien. Announcing the CPS decision, a spokesperson said: \"In accordance with the Code for Crown Prosecutors, the evidence in this case has been kept under continuous review and it has now been determined that the evidential standard for the offence indicted is no longer met. No further evidence will be offered.\" \n                  Trump and Xi discuss TikTok deal to stop US ban\n                 \n                  Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 \n                 \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 Mr Cash and Mr Berry, who had both previously taught in China, said after the case against them was dropped that charges should never have been brought. Speaking outside court, Mr Cash - previously a researcher for Ms Kearns - said: \"While I am relieved that justice has been served today, the last two and a half years have been a nightmare for me and my family.\" He said he hoped \"lessons are learned from this sorry episode\", while his lawyer said his client was \"entirely innocent and should never have been arrested, let alone charged\". Revealing that he has now written to the home secretary, Sir Lindsay told Sky News: \"As Speaker, I take the security of this House incredibly seriously. I believe this leaves the door open to foreign actors trying to spy on the House. \"This door must be closed hard. We must pursue all avenues to ensure the protection of Members and people that work within the House of Commons. It will not be tolerated.\" Ahead of Mr Jarvis's Commons statement on Monday, Sir Lindsay told MPs: \"I found out only this morning that the charges against the two individuals relating to espionage for the Chinese authorities were to be dropped. I do not think that is good. \"I ask officials to consider whether any further steps should be taken-operational, strategic, or legal-to ensure that all those who work in this parliament are able to undertake their activities securely and without interference.\" And he concluded: \"I am a very unhappy Speaker with what has happened. The fact that it has taken two years, until today, for somebody to withdraw this case is not good enough.\" Read more from Sky News:NATO responds after Russian military jets 'violate' Estonian airspaceLorry driver 'distracted' by pornography on phone seconds before killing manTwo ambulance workers arrested in connection with six deaths Mr Jarvis told MPs: \"The government remain gravely concerned about the threat of Chinese espionage. Parliament and our democracy are sacrosanct, and any attempt by any foreign power to infiltrate or interfere with parliamentary proceedings is completely unacceptable.\" He added: \"This was an independent decision made by the CPS, and it is not for any government minister to speculate on the reasons behind it. \"The government are extremely disappointed with the outcome in this case, and we remain extremely concerned about the espionage threat posed to the United Kingdom.\" Responding to Mr Jarvis's statement, Ms Kearns told MPs: \"From a securities perspective, today's events are disastrous. They will embolden our enemies and make us look unwilling to defend our own nation, even when attacked in this place, the mother of all parliaments.\""
    },
    {
        "title": "By-elections that shook up politics – could Andy Burnham be next?",
        "description": "By-election counts are the FA Cup ties of British politics.",
        "url": "https://news.sky.com/story/by-elections-that-shook-up-politics-8211-could-andy-burnham-be-next-13433626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-polling-polling-place_6934302.jpg?20250604095831",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "No subtitle found",
        "Content": "\n          Chief political correspondent\n              @joncraig\n By-election counts are the FA Cup ties of British politics. Some go true to form, but many are tense, nail-biting, go deep into extra time and provide upsets and shocks by political giant killers. Publisher and broadcaster Iain Dale has published a weighty book, British By-elections: The 88 By-election Campaigns That Shaped Our Politics. Could Labour's King of the North, football fanatic Andy Burnham, who's tipped to come off the bench and contest Gorton and Denton in a by-election, be next? Burnham fuelled speculation about a Commons comeback when he said in an interview on Thursday he had \"never ruled out going back to Westminster\". With chapters written by politicians, academics and journalists in his book, Dale claims his 88 are the most consequential by-elections of the modern era. Now I can't claim to have covered 88 by-election counts for Sky News. After all, the first was in 1769 and 70 of the 88 in the book were before the 21st century. \n                  Greater Manchester Police investigating grooming cases with more than 700 victims\n                 \n                  Andy Burnham: 'Nigel Farage could become PM - this is how Labour can stop him'\n                 \n                  Labour needs to focus on the working class, says Andy Burnham \n                 But I have covered 44, if I'm not mistaken, starting in 2003, and I'm grateful for a few mentions in the book, some flattering, some less so. But there you go. \"There's rarely a dull by-election,\" Dale writes in his preface. \"Some by-elections take on iconic status and are remembered several decades after they take place. \"Others quickly disappear into the depths of our memories, rarely to be thought about ever again.\" The first by-election I covered for Sky News, in September 2003, was Brent East, which saw a shock win for the Liberal Democrats over Labour. The most recent was Runcorn and Helsby, in May this year, when Reform UK's Sarah Pochin was just six votes ahead of Labour after an all-nighter and a result at 6am. When there's a recount, I've joked about VAR holding up the result. I even covered one by-election count, Stretford and Urmston, at the Old Trafford football ground. Over 22 years of covering by-election counts I hope I've learned the tricks of the trade when the result is on a knife-edge: One, look closely at the piles of ballot papers; two, see which candidate has a victory speech in their hand or pocket. But most important, three, find out what's said in the huddle when the returning officer calls the candidates and their agents together to brief them on the result ahead of the declaration. It may have been my first TV count after more than 20 years in newspapers, but lesson three served me well at Brent East, as my former Sky News colleague Joe Pike reveals in his chapter on Sarah Teather's triumph. \"Jon Craig, Sky News' new signing, who would go on to broadcast from more than 40 by-election counts, announced Labour's loss even before the returning officer had stood up,\" Pike writes. \"(Robert) Evans (Labour's candidate) tipped him off that Labour had lost by 1,000 votes and Craig passed on the revelation on live TV.\" Thanks, Joe. I'd kept quiet about how I discovered the result until now. A glaring omission from the book, in my opinion, is George Galloway's upset in Bradford West in 2012. When Sky News arrived at the count, everyone in the hall was predicting a Labour win. But gradually the mood changed. I texted George: \"Labour getting jitters here, George! Say you're doing very well. What do you think?\" \"Think I'm going to win, Jon,\" he replied instantly. \"Labour and Tory MPs think so too,\" I told him. \"Keen to get you on TV.\" I called him and urged him to come to the count and claim victory. And 'Gorgeous George', never one to be shy or turn down publicity, duly obliged. He'd turned a Labour majority of nearly 6,000 into a victory for his Respect Party by more than 10,000 votes, a swing of more than 50%. Richmond Park, in 2016, and Copeland, 2017, are in the book. My memory of Richmond Park is chasing a very angry Zac Goldsmith, the Tory Heathrow expansion rebel, around the count after he lost to the Lib Dem Sarah Olney. Hartlepool, in 2021, was a by-election that really did take on iconic status. It was a rare Tory gain, a victory for Boris Johnson in the Red Wall and it threw the new Labour leader Sir Keir Starmer into a panic. He sacked his chief whip, Nick Brown, tried to demote his deputy, Angela Rayner. But that backfired, as she acquired even more titles. He's since admitted he considered quitting. The result came at 7.10am, by which time a giant inflatable Boris Johnson doll had been erected outside the count. My post-results broadcasts were from in front of that. Oh, and on the Monday, back in Westminster, I tested positive for COVID. Red Wall COVID. The second Batley and Spen by-election, later in 2021, saw 'Gorgeous George' attempt to repeat his Bradford West triumph. Tracy Brabin had succeeded the murdered Jo Cox in 2016 but had quit to become West Yorkshire mayor. This time Kim Leadbeater, Jo's sister and now the assisted dying crusader, was Labour's candidate. Galloway was described by author Emma Burnell in the book as \"a serial candidate over the years, with varying levels of success\". This \"Red Wall\" clash was, though, a classic knife-edge by-election, running deep into extra time, with Leadbeater squeezing home by 323 votes ahead of the Tory candidate Ryan Stephenson. Cue VAR gags during the delays. \"On election night, neither Labour nor the Conservatives were confident of victory,\" writes Burnell, editor of LabourList. \"Mobile phones were banned from the count and so most of the news the candidates were receiving was through television coverage. \"At one point, Sky's Jon Craig declared that the Tories had won and it was just a case of by how much. However, Stephenson delights in telling the story of his entering the count later (now aware of how the night had gone) to overhear Craig announcing to the nation: 'The loser, Mr Stephenson, has now arrived.' \"Leadbeater, meanwhile, had not prepared her victory speech, convinced as she was that she had lost.\" My recollection, however, is different and I'm sure she did have a speech. (Lesson two) At Mid-Bedfordshire in 2023 after Nadine Dorries' resignation, LBC radio's Henry Riley recalls a tense count and writes: \"The only brief moment of levity was when veteran by-election reporter-in-chief Jon Craig of Sky News was presented with a cake by the High Sheriff of Bedfordshire, Russell Beard, to celebrate his 40th by-election.\" From new signing to veteran in just 20 years. It's a cruel world. In Rochdale last year, George Galloway was back. And this time he won by nearly 6,000 votes and became the first MP elected to represent a fourth different Westminster constituency since Winston Churchill, Sunder Katwala tells us in the book. George and I are old comrades, going back to his days as a left-wing firebrand in the Labour Party. I was a touch embarrassed at Rochdale, however, when he said during our post-result interview: \"You bought me lunch!\" Runcorn and Helsby was so close - six votes - that the count dragged on until 6am after a massive recount. \"As the night turned to morning, Labour staff looked more and more nervous,\" writes ITV's Harry Horton in the book. \"Reform's team appeared nervous. At one point, a Reform aide instructed photographers to assemble at the door for the arrival of Nigel Farage. \"One broadcaster claimed he'd seen the Reform leaders circling the car park outside but had driven off when it appeared Labour might sneak a win. Farage later denied anything of the sort had ever happened.\" Well, as the \"one broadcaster\" referred to by Harry, there was indeed a car circling the car park. But, admittedly, it was dark! We all make mistakes. There have been a few blunders. At one count, not long after she became an MP, I mistook Angela Rayner for Jess Phillips. Fortunately, she told me she was flattered. Whatever happened to her? So where next on the by-election fixture list? Will Andy Burnham contest Gwyne's seat prior to challenging Sir Keir Starmer for the Labour captaincy? With Reform UK the challengers in Gorton and Denton, that's a by-election that could be one for VAR."
    },
    {
        "title": "Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'",
        "description": "Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration.",
        "url": "https://news.sky.com/story/lib-dems-toughen-up-immigration-rhetoric-as-sir-ed-davey-pledges-to-stop-the-boats-13433984",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7025218.jpg?20250919142857",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Lib Dem leader Sir Ed Davey spoke to Sky News about Reform, policies and whether he would do a deal with Labour, ahead of his party's annual autumn conference.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey has pledged to \"stop the boats\" as the Liberal Democrats toughen up their rhetoric on immigration. The party leader told Sky News he and his MPs will be talking about immigration during his party's conference, which starts today, as it is a \"big policy which people are concerned about\". He also claimed the Lib Dems are the only party \"taking on Reform\" with different ideas on how to solve people coming to the UK in small boats. The party's manifesto says it would work with Europol and the French authorities to \"stop the smuggling and trafficking gangs\" behind the crossings, but as immigration has become one of the most contentious topics in the UK, Sir Ed appears to have hardened his tone on the subject. He told Sky News: \"We'll talk about how we stop the boats, how we close down the asylum hotels. \"But we've got thought-through policies about how you would do that in a humane way, unlike people like Farage and the Conservatives.\" Sir Ed blamed the Conservatives and Reform leader Nigel Farage for Brexit and taking the UK out of the Dublin Convention, which means asylum seekers can only make a claim in the EU country they first arrived in. \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \n                  Lib Dems eye Labour-held cities as they target 'seats not votes'\n                 He said the Lib Dems \"know how we can solve\" the small boats issue, as he put his party forward as the only one to take on Reform. \"We need to process the applications really quickly, deport people who have no right to be here, and if they have a right to be here, get them working so the taxpayer isn't paying for the hotels,\" he added. \"These are practical ways forward, and we're the only party taking on Reform with different ideas for solving this.\" Political correspondent Bournemouth is famous for its sandy beaches, sunny weather and wholesome seaside attractions. But over the summer it also became infamous for the number of asylum seekers put up in its hotels.  This weekend, it’s also hosting the Liberal Democrats' annual conference, and while most political parties are competing to sound tougher on illegal migration - the Lib Dems are still putting forward a more humanitarian approach, albeit with a slightly harder tone.  While today, they’re calling for the government to speed up the asylum decision-making system with ‘nightingale’ style temporary processing centres, the fundamentals of their policy do not seem to have changed.  They still want to expand the number of safe and legal routes for those escaping war and persecution, so that people can apply for asylum without crossing the channel illegally.  They’re also calling for asylum seekers to be able to work while awaiting decisions to be made on their cases.  \"Anybody sensible wants a fair and effective immigration asylum system,\" says Lisa Smart MP, the party’s home affairs spokesperson.  \"We’ve seen Reform UK just sat shouting and sounding very angry, we’ve increasingly heard the Tories moving closer and closer to them, and Labour acting like a tribute act. \"We want a fair and effective system which treats people coming here, fleeing war and persecution, like human beings.\" Some voters I spoke to in Bournemouth told me they supported the principle of welcoming genuine refugees wanting to come to the UK to build a better life, and liked the idea of creating more safe and legal routes.  But there was also widespread scepticism about the lack of progress made by successive governments in tackling illegal migration - with many keen for a tougher approach.  Two former Lib Dem voters told me they’d been turned away from the party because of their concerns about people breaking into the country and putting pressure on its creaking infrastructure.\n\n Recent polling suggests immigration is now the biggest concern for voters. \nLuke Tryl of organisation More in Common says it could be a problem for the Lib Dems trying to broaden their appeal at the next election. \"The difference with Liberal Democrat voters is that despite the fact they have that shared view with the majority of the rest of the public  (that levels of immigration should come down) it's a less important issue for them,\" he says.  \"If the Liberal Democrats want to grow, if they want to go beyond last year's election result and perhaps position themselves as a future coalition partner for the Labour Party, I think voters are going to want to see a more comprehensive offer on immigration.\"\n For those taking part in weekly protests outside the Roundhouse - one of three town centre hotels booked out by the Home Office for housing asylum seekers - there was considerable anger. \nMany of those protesting told me they feel ignored.  \"As you can see we’ve had enough,” said Mark Dean.  \"We can’t just sit on our sofas and say nothing and expect the country to change, because it will not.\" \"I work at a homeless shelter two days a week and there are so many people who use that who have to sleep in tents on the beach,\" said Sarah Turnbull.  \"It’s heartbreaking to see how many people in our area are struggling just to feed themselves and we’re spending millions on illegal migrants.\"\n The Lib Dems are unlikely to win over many of the voters protesting outside asylum hotels. But this weekend’s conference is an opportunity to try and pitch to those uncomfortable with the right wing tilt of public debate on the issue. We should be worried about Reform The Lib Dem leader's reaction to Reform, which has consistently led the opinion polls recently, has also hardened. Since last summer's election, the Lib Dems have generally chosen to avoid attacking Reform or Labour, with Sir Ed going for the Conservatives' record instead. Lib Dem insiders previously said the tactic was to let Reform implode.  However, after Mr Farage swooped in over the summer parliamentary recess with numerous headline-grabbing news conferences, Sir Ed is taking a different tactic. He said it is still very early on this parliament, which is set to end in 2029, and the Lib Dems are building on their record result last year, which saw them gain 61 MPs for a total of 72, by doing well in May's local elections. But, he said: \"I think people should be worried about Reform. \"They represent a set of issues which I don't think are British issues. They suck up to Donald Trump and Elon Musk. Nigel Farage thinks Vladimir Putin, the president of Russia, is the world leader he admires the most. \"Nigel wants to frack across England's countryside. He wants to have American-style health insurance. I don't think people want that. \"And the more Nigel Farage and Reform are exposed for what they believe in, the more people look for other parties of change. \"Clearly not Labour, the Tories - they're not trusted, they've failed. \"But the Liberal Democrats have a change agenda which is true to British values, which is genuinely patriotic and which will solve the day-to-day problems that people are worried about, like health, like care, like the cost of living.\" And will Sir Ed be taking part in more stunts this conference after becoming famous for them during the election campaign? Yes he will, he confirmed, but you (and he) will have to wait and see. The Liberal Democrat conference is taking place from 20-23 September. Sky News will be bringing you all the coverage live from Bournemouth."
    },
    {
        "title": "UK and Ireland agree deal to address 'unfinished business' of the Troubles ",
        "description": "The UK and Irish governments have agreed a new framework to address the legacy of the Northern Ireland Troubles.",
        "url": "https://news.sky.com/story/uk-and-ireland-agree-deal-to-address-unfinished-business-of-the-troubles-13434125",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hilary-benn-northern-ireland_7025479.jpg?20250919182942",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-19 17:18:00",
        "Headline": "A controversial law under the previous Conservative government will be replaced.",
        "Content": "The UK and Irish governments have agreed a new framework to address the legacy of the Northern Ireland Troubles. The framework, announced by Northern Ireland Secretary Hilary Benn and the Irish deputy prime minister, Simon Harris, at Hillsborough Castle on Friday, replaces the controversial Legacy Act, introduced by the Conservative government. \"I believe that this framework, underpinned by new co-operation from both our governments, represents the best way forward to finally make progress on the unfinished business of the Good Friday Agreement,\" said Mr Benn. He added that it would allow the families of victims killed during violence in Northern Ireland between the 1960s and 1990s, to \"find the answers they have long been seeking\". The proposed framework includes a dedicated Legacy Commission to investigate deaths during the Troubles, a resumption of inquests regarding cases from the conflict which were halted by the Legacy Act. There will also be a separate truth recovery mechanism, the Independent Commission on Information Retrieval, jointly funded by London and Dublin. \"Dealing with the legacy of the Troubles is hard, and that is why it has been for so long the unfinished business of the Good Friday Agreement,\" said Mr Benn. \n                  The 'quango king' baronet who decided the fate of 'Red Queen' Rayner\n                 \n                  Angela Rayner admits she should have paid more stamp duty on flat purchase - and considered resigning\n                 \n                  Will Starmer's Trump tactics keep paying off?\n                 Mr Harris described the framework as a \"night and day improvement\" on the previous act. Scrapping the Legacy Act, introduced in 2023, was a Labour government pledge. What this means A section of the Legacy Act offered immunity from prosecution for ex-soldiers and militants who cooperate with a new investigative body. This provision was ruled incompatible with human rights law. The 2023 law was opposed by all political parties in Northern Ireland, including pro-British and Irish nationalist groups. The Irish government, which brought a legal challenge against Britain at the European Court of Human Rights, also opposed it. Both governments said the new plans will ensure it is possible to refer cases for potential prosecutions. It will 'take time' to win families' confidence Irish Foreign Minister, Simon Harris, said in a statement that the framework could deliver on Ireland's two tests of being human rights-compliant and securing the support of victims' families, if implemented in good faith. He added that winning the confidence of victims' families would take time. Dublin will revisit its legal challenge against Britain if the tests are met, it said. Restoring strained relations The UK's Labour government had sought to reset relations with Ireland, after they were damaged by the process of Britain leaving the European Union. The Conservative government had defended its previous approach, arguing prosecutions were unlikely to lead to convictions, and that it wanted to draw a line under the conflict. A number of trials have collapsed in recent years, but the first former British soldier to be convicted of an offence since the peace deal was given a suspended sentenced in 2023."
    },
    {
        "title": "Scottish minister Jamie Hepburn quits after assault claim",
        "description": "A Scottish government minister has quit after being accused of assaulting and verbally abusing a former leader of the Conservatives in Scotland.",
        "url": "https://news.sky.com/story/scottish-minister-jamie-hepburn-quits-after-assault-claim-13434057",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jamie-hepburn-media_7024309.jpg?20250918160753",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-19 15:03:00",
        "Headline": "The parliamentary business minister admitted he had \"not acted in accordance with my own personal code of practice\".",
        "Content": "A Scottish government minister has quit after being accused of assaulting and verbally abusing a former leader of the Conservatives in Scotland. MSP Douglas Ross made the allegation about parliamentary business minister Jamie Hepburn at the end of First Minister's Questions (FMQs) on Thursday. Mr Hepburn said in his resignation letter that he had \"not acted in accordance with my own personal code of practice\". He added: \"There is no denying that my interaction with Douglas Ross fell well short of that standard.\" Mr Ross accused Mr Hepburn of assaulting him by firmly grabbing his shoulder before launching into a foul-mouthed tirade while leaving the Holyrood chamber on Wednesday afternoon. The now former minister has rejected claims he had been physical with Mr Ross, but admitted to using \"choice words\". Mr Ross said the decision to resign was \"correct\", adding Mr Hepburn had personally apologised to him. \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Former Scottish Tory leader Douglas Ross accuses SNP minister Jamie Hepburn of assault and verbal abuse\n                 \n                  What happens when an MP defects to another party?\n                 He continued: \"However, this issue should have been settled yesterday when the first minister was made aware of the full facts. \"Jamie Hepburn admitted behaviour that fell well short of that expected of ministers. Instead, John Swinney backed him and the nationalists were determined to ride this out and endorse that behaviour until I called for the situation to be investigated by the Independent Advisers on the Ministerial Code.\" Mr Ross claimed he had been \"physically assaulted and verbally abused\" by Mr Hepburn. 'Lost his temper in a big way' \"The minister grabbed me on the shoulder and held on to me all the way out of the chamber,\" Mr Ross said. \"At the same time, he was continually swearing at me and getting more and more aggressive. He just wouldn't give up. \"He lost his temper in a big way and there is no way that behaviour can be tolerated in any workplace.\" Speaking to journalists, Mr Hepburn admitted that he put his hand on Mr Ross's shoulder and \"probably used a few choice words I shouldn't have\". He added: \"That's it.\" The Scottish parliament said there was no CCTV footage of the alleged incident. Read more from Sky News:Why Starmer's move to recognise Palestine is a major shiftWhat is happening at Your Party?  'Quite out of character' Mr Hepburn said in his resignation letter to First Minister John Swinney that despite \"whatever annoyance I felt at that particular moment\", there was no excuse for his language. \"I hope it is recognised on your part and others that this behaviour was quite out of character on my part,\" he said. He added that his continued presence as a minister in the Scottish government would cause distraction and that, \"in such circumstances I believe it is best that I stand down with immediate effect\". Mr Hepburn, MSP for Cumbernauld and Kilsyth, has held numerous roles within the Scottish government, and was most recently minister for independence from 2023 until 2024."
    },
    {
        "title": "'Diplomatic efforts' under way to resolve Your Party row",
        "description": "\"Diplomatic efforts\" are under way to settle the row that has erupted between Jeremy Corbyn and Zarah Sultana, Sky News has been told.&#160;",
        "url": "https://news.sky.com/story/diplomatic-efforts-underway-to-resolve-your-party-row-13433990",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jeremy-corbyn-zarah-sultana_7024201.jpg?20250918150806",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-19 13:12:00",
        "Headline": "A source close to the pair told Sky News they were mediating behind the scenes to salvage the party's future ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  \"Diplomatic efforts\" are under way to settle the row that has erupted between Jeremy Corbyn and Zarah Sultana, Sky News has been told.  A source close to the pair said they were mediating behind the scenes to salvage the future of Your Party following a bitter public spat between the co-leaders. The new left-wing outfit descended into chaos on Thursday when Mr Corbyn told followers to ignore an \"unauthorised\" email urging them to become paid members and said he was seeking legal advice. Ms Sultana admitted to launching the membership portal without the former Labour leader's sign-off but claimed she did so because she had been \"sidelined\" by a \"sexist boys club\". The former Labour MP had been sharing the portal on social media all morning and claimed 20,000 people had become members by Thursday afternoon. With membership fees of £5 a week or £55 a year, that means more than £1m could have been raised before the row broke out. Mr Corbyn told people to cancel their direct debits but Ms Sultana insisted the portal was a \"safe and legitimate\" way to pay. \n                  Peers back assisted dying bill - but battles lie ahead\n                 \n                  Speaker makes 'strong and punchy' protest to home secretary over dropping of Chinese spy charges\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 The matter has now been referred to the Information Commissioner's Office, who can issue fines up to £17.5m or 4% of global turnover, or pass fraud and negligence cases to police. A spokesperson for the ICO told Sky News on Friday: \"We can confirm we have received a report and are assessing the information provided.\" Timeline of the row  Suspicions were aroused after Ms Sultana started sharing the membership portal on Thursday but Mr Corbyn did not. In one tweet she told followers to ignore \"right wing bad faith actors\" who are \"desperate to claim this link is fake\". Mr Corbyn then issued a statement claiming the portal was not legitimate. It said: \"This morning, an unauthorised email was sent to all yourparty.uk supporters with details of a supposed membership portal hosted in a new domain name. \"Legal advice is being taken. That email should be ignored by all supporters. If any direct debits have been set up, they should be immediately cancelled.\" The statement was signed by four other independent MPs who were part of the founding process of Your Party - Ayoub Khan, Adnan Hussain, Iqbal Mohamed and Shockat Adam. However, it was not signed by Ms Sultana, who quit Labour to launch the new left-wing party with Mr Corbyn in July. In a statement of her own, the Coventry South MP admitted the portal did not have the \"dual authorisation\" of herself and Mr Corbyn \"which was the agreement made at the start of this process\". However, she added: \"After being sidelined by the MPs named in today's statement and effectively frozen out of the official accounts, I took the step of launching a membership portal so that supporters could continue to engage and organise.\" She insisted that this was a \"safe, secure, legitimate portal for the party\", adding: \"My sole motivation has been to safeguard the grassroots involvement that is essential to building this party. 'Sexist boys club' \"Unfortunately, I have been subjected to what can only be described as a sexist boys' club: I have been treated appallingly and excluded completely.\" Later that evening, Your Party said it had reported itself to the ICO, the UK's data protection watchdog. It claimed that a \"false membership system has been unilaterally launched\", with data collected and payments taken. Read More:What is happening at Your Party? What we know about row between Corbyn and Sultana It also denied Ms Sultana's claims that she had been excluded from discussions, calling the developments a \"blow for everyone who has put their hope in a real alternative\" The split was described as \"messy\" and \"embarrassing\" by many of those who gave the party their financial backing. Sam T, who signed up to the monthly membership, told Sky News he was considering cancelling his membership and \"might as well go and give £5 to someone on the street\". 'Get behind the Greens' The row is the latest bump in the road for a party yet to officially agree on its name, decide policies, select candidates or hold a conference. Ms Sultana appeared to blindside Mr Corbyn when she announced the venture in early July. There have also been internal rows about the leadership model as well as clashes over different views on trans rights. Your Party insiders had previously told Sky News they wanted to be ready to fight the local elections next May The Green Party, headed by new \"eco-populist\" leader Zac Polanski, is likely to be the biggest beneficiary if that does not happen. Mr Corbyn's former spokesperson, Matt Zarb-Cousin, said last night that \"everyone on the left should join the Greens, including Jeremy and Zarah\". \"We are on the cusp of a far-right government taking control of Britain. We haven't got time for faffing around,\" he said on X."
    },
    {
        "title": "West Midlands MP 'worried' about increase in hate crimes after 'racially aggravated' rape",
        "description": "A Labour MP has said people are \"worried\" to see an increase in hate crimes \"especially against the Sikh community\" following a police appeal for witnesses after a \"racially aggravated\" rape in Oldbury.",
        "url": "https://news.sky.com/story/west-midlands-mp-worried-about-increase-in-hate-crimes-after-racially-aggravated-rape-13433936",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-preet-kaur-gill-uk-parliament_7025104.jpg?20250919130845",
        "type": "Politics",
        "Author": "Shamaan Freeman-Powell",
        "Date Published": "2025-09-19 11:56:00",
        "Headline": "Preet Kaur Gill, MP for Birmingham Edgbaston, says constituents who have lived in the country for decades have told her they have been \"racially, or verbally attacked\" for the first time.",
        "Content": "\n          Midlands correspondent\n              @Shamaan_SkyNews\n A Labour MP has said people are \"worried\" to see an increase in hate crimes \"especially against the Sikh community\" following a police appeal for witnesses after a \"racially aggravated\" rape in Oldbury. Preet Kaur Gill, MP for Birmingham Edgbaston, said lots of people in her constituency from ethnic minority backgrounds are now asking her where \"it is still safe\" to walk the streets. It comes after West Midlands Police issued a fresh appeal for information after a woman in her 20s reported being attacked by two men in Oldbury on 9 September. Rewards totalling up to £30,000 have been offered by Crimestoppers and the Sikh community for information leading to conviction of those responsible. A man in his 30s who had been arrested on suspicion of rape has been released on bail pending inquiries. Detectives say they are looking for two white men. One is described as having a shaved head, of heavy build, and was reported to be wearing a dark coloured sweatshirt and gloves. The second man was reportedly wearing a grey top with a silver zip. \n                  Hundreds gather to show solidarity with Sikh woman raped 'in racially aggravated attack'\n                 \n                  Man arrested in connection with 'racially-motivated rape' in West Midlands\n                 \n                  Sikh woman raped in 'racially aggravated attack' speaks out\n                 \"Somebody must have seen something in the local area,\" said Ms Gill. \"I am really, really worried,\" the MP said. \"I don't want to have to look back over my shoulder.\" Ms Gill said she has been \"shocked\" that constituents who have lived in the country for several decades have told her that \"for the first time ever\" they have been \"racially, or verbally attacked\". She said while she believes some people now feel \"emboldened\" to be racially or verbally abusive, she added: \"Nobody would have expected it would get to this extent.\" Jas Singh, a representative of the Sikh Federation UK, the organisation supporting the victim, said the fact no one has yet been charged has raised \"serious concern\" in the community. He said safety has been a worry for \"every Sikh I speak to\" in recent days, but added the community has galvanised to offer their solidarity and practical support. The Sikh Federation said last week the perpetrators allegedly told the victim during the attack: \"You don't belong in this country, get out.\" It has now put up a £10,000 reward for anyone who has any information which may lead to a conviction. A reward of up to £20,000 is available exclusively for information passed directly to Crimestoppers. \"Her being a Sikh, she is one of the family, and we have an inherent duty to help,\" said Mr Singh. \"We have come together to show an outpouring of strength.\" Chief Superintendent Kim Madill acknowledged the \"racially aggravated attack\" has caused \"fear and concern\" for the community, and says the police are \"treating it with the utmost seriousness\". She urged people to come forward if they have any information about the incident which happened at around 8.30am last Tuesday. \"This is a key time for people going to work or school and we need your help if you saw anything that may assist our enquiries,\" she said."
    },
    {
        "title": "AI-generated 'minister' makes debut in Albanian parliament",
        "description": "The world's first AI-generated government \"minister\" has been introduced to the Albanian parliament to a mixed reception.",
        "url": "https://news.sky.com/story/ai-generated-minister-makes-debut-in-albanian-parliament-13433967",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-diella-albnia-ai-ministeer_7018568.jpg?20250912232408",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-19 12:47:00",
        "Headline": "The opposition banged their tables in protest as the so-called state minister for artificial intelligence, named Diella, appeared in front of parliament.",
        "Content": " The world's first AI-generated government \"minister\" has been introduced to the Albanian parliament to a mixed reception. The so-called state minister for artificial intelligence, named Diella, appeared in front of parliament with a three-minute address delivered on two screens on Thursday, almost a week after Prime Minister Edi Rama revealed it would be part of his cabinet. Mr Rama said he was presenting Diella - the female form of the word for 'sun' in the Albanian language - as a symbol of his government's push for transparency and innovation, assigning it the task of addressing corruption concerns. The avatar, which was depicted as a woman wearing traditional Albanian dress, told MPs: \"I am not here to replace people but to help them. \"True, I have no citizenship, but I have no personal ambition or interests either. \"I assure you that I embody such values as strictly as every human colleague, maybe even more,\" it added. Opposition lawmakers objected, arguing the move was unconstitutional as the bot is not human, does not hold Albanian nationality and could lead to more corruption. They banged their hands on their tables as the video played, and boycotted a vote on the programme, but it passed anyway with 82 votes in favour in the 140-seat parliament. Read more:MI6 uses dark web to recruit spiesMeta announces new smart glasses - and we've tried them Justifying itself in its speech, the bot said: \"The constitution speaks of institutions at the people's service. It doesn't speak of chromosomes, of flesh or blood. \"It speaks of duties, accountability, transparency, non-discriminatory service.\" Socialist Mr Rama, who won a fourth term in office in May, argued that the bot would help the government work faster and with full transparency. Diella was developed earlier this year in partnership with Microsoft and uses the latest AI models and methods to ensure accuracy in carrying out its responsibilities, according to Albania's National Agency for Information Society. It is part of his larger plan to highlight the nation's technological innovations as the government works toward European Union membership, which it has pledged to secure within five years."
    },
    {
        "title": "Trump and Xi discuss TikTok deal to stop US ban",
        "description": "President Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for a deal that would see US TikTok sold. ",
        "url": "https://news.sky.com/story/trump-and-xi-discuss-tiktok-deal-to-stop-us-ban-13433941",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tiktok-social-media_7025147.jpg?20250919133422",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-19 12:08:00",
        "Headline": "President Trump said the US was getting a \"tremendous fee plus\" for brokering the deal between US companies and China.",
        "Content": "\n          Science and technology reporter\n       President Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for a deal that would see US TikTok sold.  Once confirmed, the deal should stop TikTok being banned in the US after lawmakers decided it posed a security risk to citizens' data. Congress had ordered the app shut down for American users by January 2025 if its Chinese owner ByteDance didn't sell its assets in the country - but the ban has been delayed four times by President Trump. \"We made progress on many very important issues including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal,\" said President Trump in a Truth Social post after the call. Mr Trump later told reporters at the White House that Xi had approved the deal but said it still needed to be signed. He said: \"We were able to work out a deal with China and it's a very good deal for us.\" Asked if the US government was going to take a board seat at the company, Mr Trump responded: \"We're going to announce it. It's a great deal for our country, it's a great deal for all of the young people in the country that wanted it.\" \n                  Speaker makes 'strong and punchy' protest to home secretary over dropping of Chinese spy charges\n                 \n                  Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 \n                 \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 He continued: \"I wasn't a fan of TikTok and then I got to use it and then I became a fan and it helped me win an election in a landslide.\" In a readout on state media, President Xi said the call was \"pragmatics\" and said the two leaders \"had a candid and in-depth exchange of views on current China-U.S. relations\". The readout added that China's \"position on the TikTok issue is clear: the Chinese government respects the will of companies and is pleased to see companies conduct business negotiations on the basis of market rules and reach solutions that comply with Chinese laws and regulations and balance interests\". ByteDance, the Chinese company that owns TikTok, posted after the call, thanking the two leaders for \"their efforts to preserve TikTok in the United States\". \"ByteDance will work in accordance with applicable laws to ensure TikTok remains available to American users through TikTok U.S\", said the statement. TikTok is reportedly building a separate app for US users, although it was confirmed this week it would use the original ByteDance algorithm that made TikTok so valuable in the first place. Software firm Oracle, along with US tech investors Silver Lake and Andreessen Horowitz, is expected to own an 80% share of US TikTok while China maintains a 20% share, according to the Wall Street Journal.. US user data is expected to be processed by Oracle in Texas. Beijing was long opposed to the sale, but earlier this week described the arrangement as win-win for the US and China. Read more from Sky News:From Russia with love: MI6 launches new drive to recruit spiesThree arrested on suspicion of helping Russian intelligenceTeenagers charged over cyber attack on TfL costing millions Friday's call between the US and Chinese leaders was only the second since President Trump launched steep tariffs on China, triggering a trade war between the two nations. After the call, President Trump said on Truth Social that he and President Xi agreed \"we would meet at the APEC Summit in South Korea\" next month, and he will travel to China early next year. Chinese state media said in the readout after the call that the US hopes to promote bilateral economic and trade cooperation, will support consultations between the two teams, and properly resolve the TikTok issue."
    },
    {
        "title": "Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II",
        "description": "A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\".",
        "url": "https://news.sky.com/story/sculptor-martin-jennings-chosen-to-create-statue-for-national-memorial-to-queen-elizabeth-ii-13434095",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-martin-jennings-sculpture_7025405.jpg?20250919172036",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-19 23:01:00",
        "Headline": "Martin Jennings said he expects there will be \"considerable interest\" in his design from the Royal Family, with the King \"keen that his mother should be represented appropriately\".",
        "Content": " A renowned sculptor has said he is \"thrilled\" to have been chosen to create a statue of Queen Elizabeth II for a new national memorial, saying he would like it to be an \"object of delight for people\". Martin Jennings, who has also portrayed the Queen Mother and King Charles in past works, told Sky News he was \"delighted\" when he received the call saying he'd been invited to join the project. \"I mean, I was absolutely thrilled,\" he said. \"It's a terrific commission to be asked to do and to be quite honest, I can't quite remember what the rest of the phone call was all about - I was so delighted to have been appointed.\" Mr Jennings will now set about creating the statue of the late Queen in the planned national memorial in London called Queen Elizabeth II Place. It will provide the public with a permanent space to commemorate the country's longest-reigning monarch, who died in 2022. He said that while the design for the statue is yet to be decided, he would like for it to have a sense of \"stillness\", which reflects the \"dignity\" and \"grace\" of her reign. \n                  In pictures: Memorable moments between the royals and US presidents\n                 \n                  Trump state visit: The royals will want to send him home happy - and one absentee may be a relief to him\n                 \n                  The King, Prince William and Kate attend Duchess of Kent's funeral  - as Buckingham Palace says Queen withdrew due to illness\n                 \"I would like it to be an object of delight for people,\" he said. \"I don't want it to be too grave. It needs to have panache, it needs to have grandeur to suit its site, it needs to have a kind of delight to it. \"But she was so constant that the dignity, the restraint and the grace that we associate with her are things that at the moment are at the forefront of my mind.\" Architect Lord Norman Foster, known for designing The Gherkin, has won the bid to design the memorial, which will be located at Marlborough Gate in St James's Park, close to Buckingham Palace. It will also feature a new Prince Philip Gate on the other side of the park on Birdcage Walk with a statue of Philip, as well as a \"family of gardens\", meandering paths and a new translucent, glass unity bridge. A panel of committee members will work with the team on the final design, which is expected to be unveiled in 2026 - the late Queen's 100th birthday year. Mr Jennings told Sky News he expects there will be \"considerable interest\" from the Royal Family, with the King \"keen that his mother should be represented appropriately\". \"I hope it will be something that both they and the general public are proud of,\" he said. Read more:See images of planned Elizabeth II memorialMemorial to Queen Elizabeth II must reflect 'extraordinary life' Mr Jennings said that at this early stage in this process, he intends to \"do a lot of listening\" when it comes to the design, with decisions including the stage of her life he will depict not yet taken. He said he expects that, like his previous works, the original version of the statue will be produced in clay, and then casted in bronze, but stressed \"I don't want to pin it down at this stage\". Mr Jennings has also created a bust of the Queen Mother, which is in St Paul's Cathedral, and the first crowned coinage portrait of the King. The 68-year-old has also crafted statues of George Orwell outside BBC Broadcasting House, Philip Larkin in Hull, Mary Seacole in London's St Thomas' Hospital and the Women Of Steel in Sheffield. The Queen Elizabeth II memorial project has a provisional construction budget of between £23m and £46m excluding VAT."
    },
    {
        "title": "Canada bans Kneecap from entering country as rappers threaten legal action",
        "description": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'.",
        "url": "https://news.sky.com/story/canada-bans-kneecap-from-entering-country-as-rappers-threaten-legal-action-13434201",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mo-chara-moglai-bap_6967814.jpg?20250718140119",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-19 18:50:00",
        "Headline": "The English and Irish-language rap group were due to play four shows  in Toronto and Vancouver next month.",
        "Content": "Canada has banned rap group Kneecap from entering the country for allegedly 'glorifying terrorist organisations'. The trio, who were due to play four concerts in Canada next month, were accused of promoting hate and violence by the country's Liberal government. Kneecap have subsequently threatened Canada's parliamentary secretary for combatting crime, Vince Gasparro, with legal action. Mr Gasparro said in a video on X that members of the group had been deemed ineligible to enter the country because of actions and statements that violate Canadian law. He also accused the group of amplifying political violence and publicly displaying support for terrorist organisations, including Iran-backed Lebanese militant group Hezbollah, and Hamas in Gaza. Mr Gasparro said: \"Advocating for political violence, glorifying terrorist organisations and displaying hate symbols that directly target the Jewish community are not protected forms of expression and will not be tolerated by our government.\" Commenting on the X post, Kneecap said: \"Your comments about us are wholly untrue and deeply malicious. We will not accept it. \n                  NATO responds after Russian military jets 'violate' Estonian airspace\n                 \n                  Ukraine war latest: Photos show 'Russian jet that entered Estonian airspace' - as Trump says reported incursion 'could be big trouble'\n                 \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \"No member of Kneecap has been convicted of ANY crime in ANY country EVER.\" The band added: \"We have today instructed our lawyers to initiate action against you. We will be relentless in defending ourselves against baseless accusations to silence our opposition to genocide being committed by Israel. \"When we beat you in court, which we will, we will donate every cent to assist some of the thousands of child amputees in Gaza.\" Canada's immigration ministry did not immediately respond to a request for more details. This is the latest in a series of controversial incidents involving the Belfast-based band. During the Glastonbury Festival in June, Kneecap's frontman Liam Og O Hannaidh, known by his stage name Mo Chara, accused Israel of committing war crimes. Israel has denied the accusation. Kneecap have previously said its members do not support Hamas or Hezbollah. They added that they condemn \"all attacks on civilians, always\". In May, Mr Ó hAnnaidh was charged with a terrorism offence in Britain after allegedly displaying a flag in support of Hezbollah during a London gig in November 2024. He denied the allegation, saying it was thrown on stage during the performance. Chief magistrate Paul Goldspring will rule on whether he has the jurisdiction to try the case later this month. Kneecap were scheduled to play four Canadian concerts in October, two in Toronto and two in Vancouver, according to its website."
    },
    {
        "title": "'Bad boys of magic' Penn & Teller inducted into Magic Circle after 50 years of being barred",
        "description": "Penn & Teller have finally been inducted into the Magic Circle - after 50 years of being denied membership.",
        "url": "https://news.sky.com/story/bad-boys-of-magic-penn-teller-inducted-into-magic-circle-after-50-years-of-being-barred-13433894",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-penn-jillette-penn-teller_6760627.jpg?20241128204757",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-19 10:29:00",
        "Headline": "Penn and Teller count the King among their fans, but Donald Trump is said to have put them on his \"enemies list\". Now the Magic Circle is finally inviting them in out of the cold.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Penn & Teller have finally been inducted into the Magic Circle - after 50 years of being denied membership. Rock stars of magic, Penn & Teller found fame in the mid-1980s, earning them fans on both sides of the pond, but their habit of explaining their tricks to the audience also earned them magical disapproval. The duo were famously barred from the Magic Circle for exposing their tricks as part of their act, flying in the face of the organisation's belief in keeping magical secrets from the public. Formed in 1905, the Magic Circle currently has around 1,750 members from around the world, all of whom have passed an exam to join.  Penn & Teller's famous fans include the King (who is also a Magic Circle member), while their critics include Donald Trump, who's said to have put them on his \"enemies list\". The presentation took place on Friday, on the steps of the Palladium, in London's West End, where Penn & Teller are currently performing their 50th Anniversary residency. \n                  Ted Cruz blasts 'mafioso' threats over Jimmy Kimmel suspension\n                 \n                  Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II\n                 \n                  Canada bans Kneecap from entering country as rappers threaten legal action\n                 Magic Circle president Marvin Berglas said: \"In the past they may have been known as the bad boys of magic with their sometimes controversial and hard-hitting choice of material. \"There was criticism from some in the past for their apparently exposing magical secrets. However, for those in the know, the real magic was always with their original and artistic performances whereby audiences thought they understood how something may have been done only to be utterly amazed with an entirely different original method. \"For this - Penn and Teller are the kings. These days The Magic Circle is the place for a truly diverse group of creative minds and talented performers.\" Penn & Teller said: \"We're honoured that the Magic Circle has invited us to be members, after we've violated its cardinal rule - don't give away secrets - for five decades. This is going to be fun.\" Penn & Teller first performed together in August 1975, breaking into the mainstream in the mid-1980s, and touring with critically acclaimed shows throughout the 1990s and achieving TV success in both the US and UK. They will be performing their 50th Anniversary Tour at The London Palladium until Wednesday, 24 September."
    },
    {
        "title": "US talk show hosts react to Jimmy Kimmel cancellation - as Trump issues threat",
        "description": "US talk show host Stephen Colbert has condemned the cancellation of fellow late-night star Jimmy Kimmel as a \"blatant assault on freedom of speech\", as America's top late night presenters came out fighting.",
        "url": "https://news.sky.com/story/kimmels-colleagues-come-out-fighting-heres-what-they-had-to-say-to-trump-13433740",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jon-stewart-stephen-colbert_7024781.jpg?20250919045205",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-19 01:48:00",
        "Headline": "After Jimmy Kimmel was suspended for comments he made about Charlie Kirk, his fellow late-night hosts have rallied around him - with some pointed barbs towards Donald Trump.",
        "Content": " US talk show host Stephen Colbert has condemned the cancellation of fellow late-night star Jimmy Kimmel as a \"blatant assault on freedom of speech\", as America's top late night presenters came out fighting. He used the opening of Thursday night's edition of his Late Show to address the pulling of Jimmy Kimmel Live over comments made about the assassination of the right-wing influencer Charlie Kirk. Kimmel used his show earlier this week to accuse the Trump administration and its allies of \"working very hard to capitalise on the murder of Charlie Kirk\", with the president among those to pin it on left-wing extremism. Explainer: What did Jimmy Kimmel say about Charlie Kirk? The move by Disney-owned ABC has been widely criticised, with the network accused of kowtowing to President Donald Trump, who celebrated the decision. Speaking to reporters on board Air Force One on Thursday, Mr Trump suggested certain networks should have their licences revoked over a lack of support for him. \"When a late-night host is on network television there is a licence,\" he said. \"I read somewhere that the networks were 97% against me… they give me only bad publicity or press, I mean [if] they're getting a licence. I would think maybe their licence should be taken away.\" Also airing on Thursday night, Jon Stewart, host of Comedy Central's Daily Show, appeared in a garish gold set, in parody of Mr Trump's redesign of the White House, to tell viewers the episode would be \"another fun, hilarious, administration-compliant show\". Stewart, playing the role of an over-the-top, politically obsequious TV host under authoritarian rule, lavished praise on the president and satirised his criticism of US cities and his deployment of the National Guard to fight crime. \"Coming to you tonight from the real […] crime-ridden cesspool that is New York City. It is a tremendous disaster like no-one's ever seen before. Someone's National Guard should invade this place, am I right?\" he said. He then introduced his guest - Maria Ressa, a journalist and author of the book How To Stand Up To A Dictator. Over at The Tonight Show, Jimmy Fallon told his audience he was \"not sure what was going on\" but that Kimmel is \"a decent funny and loving guy and I hope he comes back\". Fallon then promised viewers that in spite of people being \"worried that we won't keep saying what we want to say or that we will be censored\", he was going to cover the president's recent trip to the UK \"just like I normally would\". He was then replaced by a voiceover describing Mr Trump as \"incredibly handsome\" and \"making America great again\". Seth Meyers also joined the fray. \"Donald Trump is on his way back from a trip to the UK,\" he said at the top of his show Late Night, \"while back here at home, his administration is pursuing a crackdown on free speech… and completely unrelated, I just wanted to say that I have always admired and respected Mr Trump. \"I have always believed he was a visionary, an innovator, a great president, and an even better golfer.\" Kimmel's removal from the show he has hosted for two decades led to criticism that free speech was under attack. But speaking on his visit to Britain, Donald Trump claimed he was suspended \"because he had bad ratings\". It came after fellow late-night host Colbert saw his programme cancelled earlier this year, which fans claimed was also down to his criticism of Mr Trump, who has since railed against Kimmel, Meyers, and Fallon. He has posted on Truth Social that they should all be cancelled. Figures from both the worlds of entertainment and politics lined up to lament ABC's removal of Kimmel. Chat show doyen David Letterman said people should not be fired just because they don't \"suck up\" to what he called \"an authoritarian\" president. During an appearance at The Atlantic Festival 2025 in New York on Thursday night, he added: \"It's no good. It's silly. It's ridiculous. \"I feel bad about this, because we all see where see this is going, correct? It's managed media.\" Former US president Barack Obama wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\""
    },
    {
        "title": "Country singer-songwriter Brett James dies in small plane crash",
        "description": "US singer-songwriter Brett James has died in a small plane crash, according to music industry officials.",
        "url": "https://news.sky.com/story/country-singer-songwriter-brett-james-dies-in-small-plane-crash-13433819",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-brett-james-singer_7024884.jpg?20250919104708",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-19 08:19:00",
        "Headline": "Brett James, 57, released one solo album in the 1990s but was better known for the hundreds of songs he worked on behind the scenes.",
        "Content": "US singer-songwriter Brett James has died in a small plane crash, according to music industry officials. James, 57, released one solo album in the 1990s but was better known for the hundreds of country songs he worked on behind the scenes. His most famous was Carrie Underwood's Jesus, Take The Wheel, which won two Grammys - for best country song and best female country vocal performance in 2007.   The country musician was on board a \"small engine airplane\" when it crashed on Thursday, the Nashville Songwriters Hall of Fame said in a statement. \"We mourn the untimely loss of Hall of Fame member Brett James, a 2020 inductee who was killed in a small-engine airplane crash on September 18,\" it wrote on its Facebook page. Nashville Songwriters Association International (NSAI) also posted an online tribute, describing him as a \"legendary songwriter and board member\" and adding: \"The loss is profound.\" According to flight data, the plane was registered in James's name and had three people on board when it came down near Franklin, North Carolina. The US National Transportation Safety Board said it will investigate the circumstances of the crash. Read more from Sky NewsWembley hosts star-studded gig for PalestineWhy has Jimmy Kimmel been suspended?Robert Redford dies aged 89 James was well known in the country music scene, working with major artists including Billy Ray Cyrus, Kenny Chesney, and Martina McBride. His work on Jessica Andrews's song Who I Am in 2001 earned him his first number one single. Among his other accolades were the Academy of Country Music (ACM) single of the year, the American Society of Composers, Authors, and Publishers (ASCAP) country song of the year, and NSAI song of the year. ASCAP paid tribute to him on X, describing him as a \"trusted collaborator to country's greatest names and a true advocate for songwriter\". Country star Sara Evans's tribute on Instagram read: \"I am absolutely devastated at the loss of one of the best writers I've ever written with and recorded several of his songs. Brett James. I'm praying for his loved ones. What a tragic and sad day. He will be so missed.\""
    }
]