[
    {
        "title": "Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs",
        "description": "Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession.",
        "url": "https://news.sky.com/story/stock-markets-suffer-sharp-drops-after-donald-trump-announces-sweeping-tariffs-13341308",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6873959.jpg?20250402152646",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-03 15:35:00",
        "Headline": "All three of the US's major markets opened to sharp losses on Thursday morning. By the end of trading, both the Nasdaq and Dow Jones had experienced their worst one-day loss since the COVID-19 pandemic.",
        "Content": " Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession. The US president announced tariffs for almost every country - including 10% rates on imports from the UK - on Wednesday evening, sending financial markets reeling. While the UK's FTSE 100 closed down 1.55% and the continent's STOXX Europe 600 index was down 2.67% as of 5.30pm, it was American traders who were hit the most. Trump tariffs latest: US stock markets tumble All three of the US's major markets opened to sharp losses on Thursday morning. By 8.30pm UK time (3.30pm EST), The Dow Jones Industrial Average was down 3.7%, the S&P 500 opened with a drop of 4.4%, and the Nasdaq composite was down 5.6%. Compared to their values when Donald Trump was inaugurated, the three markets were down around 5.6%, 8.7% and 14.4%, respectively, according to LSEG. \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 \n                  Ex-DUP leader Sir Jeffrey Donaldson to face trial over 18 sex offence allegations\n                 \n                  Ex-DUP leader Jeffrey Donaldson in court charged with rape - his wife charged with aiding him\n                 Worst one-day losses since COVID As Wall Street trading ended at 9pm in the UK, two indexes had suffered their worst one-day losses since the COVID-19 pandemic. The S&P 500 fell 4.85%, the Nasdaq dropped 6%, and the Dow Jones fell 4%. It marks Nasdaq's biggest daily percentage drop since March 2020 at the start of COVID, and the largest drop for the Dow Jones since June 2020.  'Trust in President Trump' White House press secretary Karoline Leavitt told CNN earlier in the day that Mr Trump was \"doubling down on his proven economic formula from his first term\". \"To anyone on Wall Street this morning, I would say trust in President Trump,\" she told the broadcaster, adding: \"This is indeed a national emergency... and it's about time we have a president who actually does something about it.\" Later, the US president told reporters as he left the White House that \"I think it's going very well,\" adding: \"The markets are going to boom, the stock is going to boom, the country is going to boom.\" He later said on Air Force One that the UK is \"happy\" with its tariff - the lowest possible levy of 10% - and added he would be open to negotiations if other countries \"offer something phenomenal\".  Economist warns of 'spiral of doom' The turbulence in the markets from Mr Trump's tariffs \"just left everybody in shock\", Garrett Melson, portfolio strategist at Natixis Investment Managers Solutions in Boston, told Reuters. He added that the economy could go into recession as a result, saying that \"a lot of the pain, will probably most acutely be felt in the US and that certainly would weigh on broader global growth as well\". Meanwhile, chief investment officer at St James's Place Justin Onuekwusi said that international retaliation is likely, even as \"it's clear countries will think about how to retaliate in a politically astute way\". He warned: \"Significant retaliation could lead to a tariff 'spiral of doom' that could be the growth shock that drags us into recession.\" Read more:Do Trump's 'Liberation Day' tariff numbers add up?Tariffs about something more than economics: power It comes as the UK government published a long list of US products that could be subject to reciprocal tariffs - including golf clubs and golf balls. Running to more than 400 pages, the list is part of a four-week-long consultation with British businesses and suggests whiskey, jeans, livestock, and chemical components. Meanwhile, Prime Minister Sir Keir Starmer said on Thursday that the US president had launched a \"new era\" for global trade and that the UK will respond with \"cool and calm heads\". It also comes as Canadian Prime Minister Mark Carney announced a 25% tariff on all American-imported vehicles that are not compliant with the US-Mexico-Canada trade deal. He added: \"The 80-year period when the United States embraced the mantle of global economic leadership, when it forged alliances rooted in trust and mutual respect and championed the free and open exchange of goods and services, is over. This is a tragedy.\""
    },
    {
        "title": "Prince Andrew's Pitch@Palace branded 'crude attempt to enrich himself' as Chinese spy documents set to be released",
        "description": "Prince Andrew's efforts to make money from his Pitch@Palace project have been branded as a \"crude attempt to enrich himself\" at the expense of \"unsuspecting tech founders\", as new documents may shed more light on what he and his team have been attempting to sell.",
        "url": "https://news.sky.com/story/prince-andrews-pitchpalace-branded-crude-attempt-to-enrich-himself-as-chinese-spy-documents-set-to-be-released-13341270",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-prince-andrew-yang-tengbo_6778033.jpg?20241216171451",
        "type": "Home",
        "Author": "Rhiannon Mills, royal correspondent, and Jordan Milne, royal producer",
        "Date Published": "2025-04-03 13:49:00",
        "Headline": "Today marks the deadline for documents to be released relating to Prince Andrew's former senior adviser Dominic Hampshire, and his interactions with the alleged Chinese spy Yang Tengbo.",
        "Content": "By Rhiannon Mills, royal correspondent, and Jordan Milne, royal producer  Prince Andrew's efforts to make money from his Pitch@Palace project have been branded as a \"crude attempt to enrich himself\" at the expense of \"unsuspecting tech founders\", as new documents may shed more light on what he and his team have been attempting to sell. Today is the deadline for documents to be released relating to Prince Andrew's former senior adviser Dominic Hampshire and his interactions with the alleged Chinese spy Yang Tengbo. In February, an immigration tribunal heard how the intelligence services had contacted Mr Hampshire about Mr Yang back in 2022. Mr Yang helped set up Pitch@Palace China, a branch of the duke's scheme to help young entrepreneurs. Judges banned Mr Yang from the UK, saying his association with a senior royal had made Prince Andrew \"vulnerable\" and posed a threat to national security. Mr Yang challenged that decision at the Special Immigration Appeals Commission (SIAC). Since that hearing, media organisations have applied for certain documents relating to the case and Mr Hampshire's support for Mr Yang to be made public. SIAC agreed to release some information of public interest. It is hoped they may include more details on deals that he was trying to do on behalf of Prince Andrew. So what do we know about potential deals for Pitch@Palace so far? In February, Sky News confirmed that palace officials had a meeting last summer with tech funding company StartupBootcamp to discuss a potential tie-up between them and Prince Andrew relating to his Pitch@Palace project. \n                  Virginia Giuffre 'overwhelmed' with support after saying she had days to live\n                 \n                  Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash\n                 \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 The palace wasn't involved in the fine details of a deal but wanted guarantees to make sure it wouldn't impact the Royal Family in the future. Sky News understands from one source that the price being discussed for Pitch was around £750,000 - there are, however, reports that a deal may have stalled. Photos we found on the Chinese Chamber of Commerce website show an event held in Asia between StartupBootcamp and Innovate Global, believed to be an offshoot of Pitch.  Documents, released in relation to the investigations into Mr Tengbo, have also shown how much the duke has always seen Pitch as a way of potentially making money. One document from 21 August 2021 clearly states \"the duke needed money at the time, and saw the relationships with China through Pitch as one possible source of funding\". But Prince Andrew's apparent intention to use Pitch to make money has led to concerns about whether he is unfairly using the contacts and information he gained when he was a working royal. Norman Baker, former MP and author of books on royal finances, believes it is \"a crude attempt to enrich himself\" and goes against what the tech entrepreneurs thought they were signing up for. Read more: Who is Yang Tenbo?Virginia Giuffre says she has days to liveEmails between Andrew and Epstein revealed He told Sky News: \"The data given by these business people was given on the basis it was an official operation and not something for Prince Andrew, and so in my view, Prince Andrew had no right legally or morally to take the data which has been collected, a huge amount of data, and sell it... \"And quite clearly if you're going to sell it off to StartupBootcamp, that is not what people had in mind. The entrepreneurs who joined Pitch@Palace did not do so to enrich Prince Andrew,\" he said. Rich Wilson was one tech entrepreneur who was approached at the start of Pitch@Palace to sign up, but he stepped away when he spotted a clause in the contract saying they'd be entitled to 2% equity in any funding he secured. He feels Prince Andrew is continuing to use those he made a show of supporting. He said: \"It makes me feel sick. I think it's terrible - that he is continuing to exploit unsuspecting tech founders in this way. A lot of them, I'm quite grey and old in the tooth now, I saw it coming, but clearly most didn't. And a lot of them were quite young. \"It'll be their first venture and you're learning on the trot, so to speak. So to take advantage of people in such a major way - that's an awful, sickening thing to do.\" We approached StartupBootcamp who said they had no comment to make, and the Duke of York's office did not respond. With reports that a deal may have stalled, it could be a big setback for the duke - especially with questions still about how he'll continue to pay for his home on the Windsor estate now that the King no longer gives him financial support."
    },
    {
        "title": "UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships",
        "description": "The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed.",
        "url": "https://news.sky.com/story/uk-in-talks-with-brazil-over-potential-sale-of-two-royal-navy-amphibious-assault-ships-13341476",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-hms-bulwark-navy-military_6752891.jpg?20241120142942",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-04-03 21:52:00",
        "Headline": "Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget, even though Sir Keir Starmer keeps talking up his promises to boost expenditure.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed. Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget even though Sir Keir Starmer keeps talking up his promises to boost expenditure. The two warships can be used to deploy Royal Marines to shore - a vital capability at a time of growing global threats. News of the possible sale was first revealed in Latin American media. One report said the Royal Navy and Brazilian Navy had signed an agreement that would see the UK giving information to the Brazilians on the state of the two ships prior to any purchase. Asked about the claim that the UK would sell the assault ships to Brazil, a Ministry of Defence spokesperson said: \"We can confirm we have entered discussions with the Brazilian Navy over the potential sale of HMS Bulwark and HMS Albion. \"As announced in November, both ships are being decommissioned from the Royal Navy. Neither were planned to go back to sea before their out of service dates in the 2030s.\" \n                  Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot\n                 \n                  Football fans join with pensioners to clash with police in protest at austerity in Argentina\n                 \n                  Charlotte Peet: Brazilian authorities 'visiting locations' in search for missing British journalist\n                 James Cartlidge, the shadow defence secretary, appeared to question the wisdom of the move. \"At Defence orals [House of Commons questions] on January 6th Defence Secretary John Healey said: 'HMS Bulwark and HMS Albion were not genuine capabilities',\" Mr Cartlidge wrote in a post on social media. \"They've just been sold to Brazil.\" Matthew Savill, the director of military science at the Royal United Services Institute, said the plan to sell the vessels demonstrates there \"is still life in both these ships\". He said: \"The fact that the UK is prepared to sell off useful amphibious capability - which could be used in evacuation operations or other cases where air transport is difficult - shows just how tight finances are even with the promised budget increase. \"The replacements for these ships are still several years away and won't be available until the 2030s.\" Read more from Sky News:Prince Harry's charity row explainedUS seems content to cosy up to Russia instead of imposing tariffs Mr Savill added: \"As an aside, Brazil will probably have greater amphibious capacity than the UK, having previously bought HMS Ocean, the UK's helicopter assault ship.\" HMS Albion and HMS Bulwark entered service two decades ago. Both are currently held at lower readiness having not been to sea since 2023 and 2017 respectively. HMS Ocean, a helicopter-landing vessel and once the largest warship in the Royal Navy, was sold to the Brazilian Navy in 2018 after 20 years in service."
    },
    {
        "title": "Highs and lows of Five-Year Keir: The PM's journey from Doughty Street to Downing Street",
        "description": "From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants.",
        "url": "https://news.sky.com/story/highs-and-lows-of-five-year-keir-the-pms-journey-from-doughty-street-to-downing-street-13341342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-labour_6875142.jpg?20250403183034",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-04-03 17:09:00",
        "Headline": "Sir Keir Starmer's first five years as Labour Party leader have seen dramatic highs and lows - but the next five will perhaps be even more challenging.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants. Five years after becoming Labour leader, Sir Keir Starmer has been on a remarkable journey. He turned left to win the party leadership and turned right to win a general election. It has been five years of dramatic highs and lows: the elation of winning a landslide general election victory after the gloom of contemplating quitting following a by-election humiliation. As opposition leader, Sir Keir purged the Labour left, including banishing his predecessor Jeremy Corbyn to the political wilderness, and flushed out the scourge of antisemitism. As prime minister, within weeks of entering Number 10 he was confronted with riots on Britain's streets. And throughout his premiership he has had to play a leading role internationally in a volatile and war-torn world. At home, his government's economic policies have been condemned by political opponents and some of his own MPs as a return to austerity. Labour's opinion poll ratings have nose-dived. Abroad, as well as the challenge of defending Ukraine against the brutality of Russia's Vladimir Putin, the so-called \"special relationship\" with the United States has been tested to the limit by the erratic Donald Trump. \n                  Trump has acted for his country, I will act in Britain's interests, says Starmer\n                 \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 \n                  Woman whose son Martyn Hett died in Manchester Arena terror attack welcomes new law in his name\n                 Five-year Keir was elected Labour leader on 4 April 2020, just weeks after prime minister Boris Johnson ordered a COVID lockdown that was ultimately to bring about his demise. Sir Keir won 56% of the vote, defeating the Corbyn-backed left-wing candidate Rebecca Long-Bailey and Lisa Nandy from Labour's soft left. To win the backing of left-wing Labour activists, he backed a wealth tax on the top 5% of earners, abolishing university tuition fees, nationalising water and energy and restoring freedom of movement between the UK and EU countries. Whatever happened to those promises? There was also a showbiz connection. When he was running for the leadership, a rumour persisted that he was the inspiration for Mark Darcy, the dashing human rights lawyer played by Colin Firth in the Bridget Jones movies. But, alas for Sir Keir and his spin doctors, who did nothing to dispel the myth, several months after he became leader the Bridget Jones author Helen Fielding laid the rumour to rest - though she conceded they were very similar. Sir Keir had much bigger battles to fight, however. From day one as leader, he condemned antisemitism as \"a stain on our party\". Within weeks he sacked his rival Ms Long-Bailey from his shadow cabinet in a dispute over antisemitism. But in his ruthless determination to show the party had changed under his leadership, he had a bigger target: his predecessor Mr Corbyn, still the darling of left-wing Labour activists. After the former leader claimed the scale of antisemitism in the Labour party had been \"dramatically overstated for political reasons\", Sir Keir struck, suspending him for refusing to retract his comments and then finally expelling him a month before last year's general election. But while he was winning that battle, Sir Keir's first year did not go well at the ballot box. In 2021, in the first by-election after Boris Johnson's 80-seat victory in the 2019 general election, Labour lost the previously safe seat of Hartlepool to the Conservatives. The swing against Labour was a huge 16%. It was his lowest low point of the last five years. Stunned by the Hartlepool defeat, Sir Keir panicked, sacking his chief whip Nick Brown and attempting to demote his deputy, Angela Rayner, stripping her of her posts as party chair and campaign coordinator. But it backfired as she fought back and emerged stronger than ever. She gained the titles of shadow chancellor of the Duchy of Lancaster and shadow secretary of state for work. Four years later, her Employment Rights Bill is in the House of Lords and on course to become law. Last year, in a Sky News interview with political editor Beth Rigby, Sir Keir admitted he had considered quitting. \"I did, because I didn't feel that I should be bigger than the party and that if I couldn't bring about the change, perhaps there should be a change,\" he said. But it wasn't just the result in Hartlepool that was damaging. In 2022, in a scandal the Conservatives called \"beergate\", he and Ms Rayner were accused of breaching lockdown rules by eating curry and drinking beer in Durham while campaigning in the by-election. He was cleared, but at the height of the Tory onslaught he said he would resign if he was issued with a fixed penalty notice. It was another low point. But in 2022 it was Mr Johnson who was forced to quit over breaking COVID rules, not Sir Keir. A top civil servant, Sue Gray, produced a damning and ultimately fatal \"partygate\" report, accusing Mr Johnson of lying to parliament, Liz Truss came and went - her brief 49-day tenure likened to the life of a lettuce - and Rishi Sunak became the Tories' fifth prime minister in six years. Sir Keir was on his way. But it was his turn to stun his opponents in 2023 when he announced that Sue Gray was to become his chief of staff, in a move the Tories claimed was treachery and proof that she had been biased against Mr Johnson. But though she lasted longer than \"lettuce\" Liz Truss, Sue Gray didn't survive for long. Within months of Labour's 2024 election victory she was out, the victim of a vicious power struggle with a Number 10 \"boys' club\" led by Starmer's campaign chief Morgan McSweeney, who helped himself to her job as chief of staff. On the back of several by-election successes and sweeping local government gains, when Mr Sunak shocked his own party on 22 May by announcing a 4 July general election, Labour entered the campaign as overwhelming favourites to win a big majority. A turning point in the campaign came on 2 June when Nigel Farage announced a comeback as Reform UK leader and declared that he would, after months of keeping his opponents guessing, be a candidate after all. As a result, Reform UK won 4.1m votes, piling up votes in the tens of thousands in hundreds of seats, mostly at the expense of the Conservatives, and handing a landslide to Sir Keir: 411 Labour MPs and a majority of 172. His triumph came close to rivalling Tony Blair's landslides of 1997 and 2001 with one crucial difference: Labour polled just 34% of the vote, the lowest share for a party winning a majority. During the campaign, Sir Keir faced tough scrutiny not just about his pledges not to increase income tax, VAT or national insurance, but also about his character and personality. In \"The Battle for Number 10\" on Sky News, a 90-minute event in Grimsby featuring Sir Keir and Mr Sunak, the Labour leader froze when a member of the audience told him he seemed like a \"political robot\". He also squirmed when another audience member challenged him on why he now condemned Mr Corbyn when five years earlier he told voters he would make a great prime minister. Yet despite those difficult moments, the event was more bruising for Mr Sunak than Sir Keir and a YouGov poll declared a decisive victory for the Labour leader, by 64% to 36% But there was to be no honeymoon period for Sir Keir after Labour's landslide. Within days of his election victory, riots following the killing of three young girls at a dance class in Southport presented the new prime minister with a law and order crisis. His background as Director of Public Prosecutions served him well, however, and he showed a steely determination in ensuring rioters were dealt with swiftly and severely by the courts, though critics hit out at inconsistencies in sentencing and branded him \"Two-tier Keir\". Another crisis was self-inflicted. Many in his own party were shocked by the staggering amount of freebies, gifts and hospitality he and his wife accepted since he became Labour leader, many paid for by a millionaire Labour donor Lord Alli. According to a Sky News investigation, their total worth was more than £100,000. They included expensive clothes for the PM and his wife, luxury designer spectacles for Sir Keir, hospitality at his beloved Arsenal FC, free accommodation in a flat owned by Lord Alli and - perhaps the most contentious - freebie tickets to a Taylor Swift concert at Wembley Stadium, all worth eye-watering amounts. To make matters worse, the \"freebie-gate\" scandal engulfed the PM at a time when his chancellor, Rachel Reeves, was cutting winter fuel payments for pensioners, the first of a series of controversial moves by the woman derided as \"Rachel from Accounts\" by political opponents that have badly damaged Sir Keir's government in its first nine months. The two-child benefit cap, national insurance rises in her October budget, benefit cuts last month and no compensation for the so-called Waspi women have all infuriated many Labour MPs and put Sir Keir's loyalty to his chancellor under strain. He's standing by her for now. \"I have full confidence in the chancellor,\" he declared, tetchily, when challenged by a Tory MP at PMQs just minutes before her spring statement last week. But for how long? Most prime ministers eventually fall out with their chancellor: Margaret Thatcher with Sir Geoffrey Howe and then Nigel Lawson in the 1980s and later Tony Blair and Gordon Brown. Be warned, Rachel! On foreign policy, the PM's record is better. His baptism on the world stage, at a NATO summit in Washington in his first week as PM, helped him swiftly establish a reputation as a safe pair of hands and reliable ally on foreign policy. Though the UK is no longer in the EU, Sir Keir has forged strong alliances with European leaders - particularly France's President Macron - as he attempts to build a \"coalition of the willing\" to defend Ukraine. And he has won the trust of Ukraine's President Zelenskyy. And on his biggest foreign policy challenge, establishing good relations with the maverick President Trump, the verdict - even after the president's tariffs bombshell - is so far, so good. His Trump Tower dinner last September went well, his White House stunt with an envelope containing King Charles' state visit invitation was a diplomatic masterstroke and the 10% tariffs slapped on the UK could have been a lot worse. Now comes the really hard part for Five-Year Keir: securing a trade deal with the US, bringing peace to Ukraine without a sell-out or concessions to Vladimir Putin, smashing the gangs smuggling illegal migrants, tackling welfare reform and - the biggest challenge - finding that elusive economic growth at home while the Trump tariffs make autumn tax rises look almost inevitable. No pressure, then prime minister. If the lows of Sir Keir's first five years as Labour leader took the shine off the highs, the next five years - to the next election and perhaps beyond - look even more challenging. And the journey from Doughty Street to Downing Street is now just a distant memory."
    },
    {
        "title": "Tom Cruise leads moment of silence in tribute to 'dear friend' Val Kilmer",
        "description": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\".",
        "url": "https://news.sky.com/story/tom-cruise-leads-moment-of-silence-in-tribute-to-dear-friend-val-kilmer-13341470",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tom-cruise-las-vegas_6875358.jpg?20250403224056",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-03 21:28:00",
        "Headline": "The Mission Impossible star called for a moment of silence at a film event in Las Vegas. He said his Top Gun co-star \"gave a lot to all of us\" and asked the audience to \"think about all the wonderful times that we had with him\".",
        "Content": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\". Cruise, speaking at the CinemaCon film event in Las Vegas on Thursday, asked for a moment's silence to reflect on the \"wonderful\" times shared with the star, whom he called a \"dear friend\". Kilmer, who died of pneumonia on Tuesday aged 65, rocketed to fame starring alongside Cruise in the 1986 blockbuster Top Gun, playing Tom 'Iceman' Kazansky, a rival fighter pilot to Cruise's character Maverick. His last part was a cameo role in the 2022 blockbuster sequel Top Gun: Maverick. Cruise, on stage at Caesars Palace on Thursday, said: \"I'd like to honour a dear friend of mine, Val Kilmer. I can't tell you how much I admire his work, how grateful and honoured I was when he joined Top Gun and came back later for Top Gun: Maverick. \"I think it would be really nice if we could have a moment together because he loved movies and he gave a lot to all of us. Just kind of think about all the wonderful times that we had with him. \"I wish you well on the next journey.\" The moment of silence followed a string of tributes from Hollywood figures including Cher, Francis Ford Coppola, Antonio Banderas and Michelle Monaghan. Kilmer's daughter Mercedes told the New York Times on Wednesday that the actor had died from pneumonia. Diagnosed with throat cancer in 2014, Kilmer discussed his illness and recovery in his 2020 memoir Your Huckleberry and Amazon Prime documentary Val. He underwent radiation and chemotherapy treatments for the disease and also had a tracheostomy which damaged his vocal cords and permanently gave him a raspy speaking voice. Kilmer played Batman in the 1995 film Batman Forever and received critical acclaim for his portrayal of rock singer Jim Morrison in the 1991 movie The Doors. Read more from Sky News:Tributes to 'genius' KilmerRichest billionaires namedSpringsteen's seven new albums He also starred in True Romance and Kiss Kiss Bang Bang, as well as playing criminal Chris Shiherlis in Michael Mann's 1995 movie Heat and Doc Holliday in the 1993 film Tombstone. In 1988 he married British actress Joanne Whalley, whom he met while working on fantasy adventure Willow. The couple had two children before divorcing in 1996."
    },
    {
        "title": "Scheme to boost access to NHS dentists 'comprehensively failed', MPs say",
        "description": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said",
        "url": "https://news.sky.com/story/scheme-to-boost-access-to-nhs-dentists-comprehensively-failed-mps-say-13341487",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-dentist-nhs-teeth_6494653.jpg?20240319003434",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-03 22:13:00",
        "Headline": "Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments. The PAC's report said it appears to have \"resulted in worsening the picture\".",
        "Content": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments for patients and offered dentists a \"bonus\" to take NHS patients. According to the Public Accounts Committee (PAC), the scheme appears to have \"resulted in worsening the picture\" more than a year later. Under the Dental Recovery Plan, practices were offered a new patient premium (NPP) - which the PAC found cost at least £88m since it was introduced and resulted in 3% fewer new patients seeing an NHS dentist.  The plan's \"golden hello\" recruitment scheme had also been found to have appointed fewer than 20% of the expected 240 dentists by February this year. Their report, published today, also said vulnerable patients \"continue to suffer the most\" and that the dental contract \"remains unfit for purpose\". Current arrangements are only sufficient for about half of England's population to see an NHS dentist over two years, it added. \n                  Kemi Badenoch thinks she's started a journey - a ruthless party may soon have other ideas\n                 \n                  A Labour Party in Tory clothing? Why Starmer's backbenchers are deeply uncomfortable\n                 \n                  Ex-Tory MP Crispin Blunt still at centre of rape investigation 16 months after arrest\n                 The PAC report also said \"it does not appear\" that NHS England or the Department of Health and Social Care \"have a sense of what level of funding would provide a realistic incentive for dentists to prioritise NHS work\". Read more:Morning-after pill set to be made free from pharmaciesGPs agree deal to 'end 8am scramble' for appointments 'NHS dentistry is broken' PAC chairman Sir Geoffrey Clifton-Brown said: \"It is utterly disgraceful that, in the 21st century, some Britons have been forced to remove their own teeth. \"Last year's Dental Recovery Plan was supposed to address these problems, something our report has found it has signally failed to do. \"Almost unbelievably, the government's initiatives appear to have actually resulted in worsening the picture, with fewer new patients seen since the plan's introduction.\" He added: \"NHS dentistry is broken. The government could hardly fail to agree on this point, and indeed I am glad that it is not in denial that the time for tinkering at the edges is over. \"It is time for big decisions.\" A Department of Health and Social Care spokesperson said the Labour government \"inherited a broken NHS dental sector\" and was fixing it through its Plan for Change. It said that in February, it had delivered on its manifesto pledge by rolling out 700,000 extra urgent appointments and pledged to introduce a new supervised toothbrushing scheme for three to five-year-olds."
    },
    {
        "title": "Girl, 13, dies in house fire in Merseyside ",
        "description": "A 13-year-old girl has died after a house fire in Merseyside.",
        "url": "https://news.sky.com/story/girl-13-dies-in-house-fire-13341393",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kingsway-preston-house-fire_6875265.jpg?20250403205900",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-03 19:16:00",
        "Headline": "Police said the teenager died following a blaze on Wednesday night. A man, woman and five children managed to escape the property unharmed, officers said.",
        "Content": "A 13-year-old girl has died after a house fire in Merseyside. Merseyside Fire and Rescue Service (MFRS) said it was called to the scene in Prescot, in the borough of Knowsley, at 11.42pm on Wednesday. Crews arrived to find a blaze in the rear bedroom of a mid-terraced house. In a statement, police said: \"A man, woman and five children were able to escape from the property unharmed. \"Sadly, a 13-year-old girl was pronounced dead at the scene. Her family are aware and are being supported by specially trained officers.\" Police said four firefighters entered the property with breathing apparatus to tackle the fire, which was on the first floor, and search for people. The blaze was extinguished at 12.29am on Thursday. A joint investigation involving MFRS's Incident Investigation Team and Merseyside Police has been launched. Detective Inspector Steven O'Neill said: \"Our thoughts are with the family of the young girl at this very sad time... \"A joint investigation into the cause of the fire is ongoing and the girl's family is being supported by specially trained officers.\""
    },
    {
        "title": "Man with knife who 'moved at speed' towards police officers before he was shot dead in Milton Keynes named",
        "description": "A man who was shot dead by police after he \"moved at speed\" towards officers has been named as David Joyce.",
        "url": "https://news.sky.com/story/man-with-knife-who-moved-at-speed-towards-police-officers-before-he-was-shot-dead-named-13341323",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milton-keynes-thames-valley-police_6875101.jpg?20250403172819",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-03 15:55:00",
        "Headline": "The police watchdog said it is investigating the actions and decisions taken by officers who fatally shot a man in the stomach on Tuesday, and has asked witnesses to come forward. ",
        "Content": "A man who was shot dead by police after he \"moved at speed\" towards officers has been named as David Joyce. The 38-year-old, who lived in Milton Keynes, was given first aid by officers but died at the scene after the incident on Tuesday. The Independent Office for Police Conduct (IOPC) has appealed for witnesses and confirmed its investigators collected a knife and other evidence from outside Milton Keynes railway station. The police watchdog said: \"No other weapons were recovered from the scene. The police cordon at the scene was lifted last night (2 April). \"We were advised by [Thames Valley Police] that firearms officers were sent to the station shortly before 1pm following a 999 call reporting that there was a man with a gun at the scene. \"We have viewed police officers' body-worn video footage and a substantial amount of CCTV footage and established that at around 1.04pm the man was just outside the railway station main entrance with a knife in his hand, and ran towards the officers. \"Shortly afterwards the man was shot at close range. We have established that a single shot was fired by one officer.\" \n                  Mantas Vanagas: 'Dangerous' predator jailed for abusing four men - including raping sleeping victim\n                 \n                  Man shot dead by armed police at Milton Keynes railway station\n                 \n                  Police appeal after man jailed for firearms offence absconds from prison\n                 Mr Joyce's next of kin has been informed and he was formally identified at a post-mortem examination on Thursday morning (3 April). Provisional cause of death is said to be a single gunshot wound to the abdomen. Read more from Sky News:Luton Airport expansion plans approvedMan admits killing boy after drugs lab blastHarry responds to Sentebale charity row IOPC: Community will want answers IOPC director Derrick Campbell said: \"Our role is to independently investigate all of the circumstances surrounding this incident including the actions and decisions taken by the police. \"We appreciate that this incident outside a busy train station will understandably cause concern. We know the community will want answers quickly and our investigators are working hard to establish the facts as we piece together what happened and how. \"We have obtained details of some members of the public who witnessed the incident who we will be contacting, however we know there were many people near the station around the time of the shooting and we want to hear from anyone who may have seen the incident or has footage of it.\" 'Officers should be praised' Matthew Barber, police and crime commissioner for Thames Valley, said he was \"confident that the officers should be praised for their actions\". On Tuesday, local residents told the PA news agency they saw a large number of police at the scene and one person \"lying on the floor and they were trying to resuscitate him\". Another woman added that they heard a \"bang\" and \"quite a lot of commotion outside\" but did not realise what had happened until she saw a man being given CPR."
    },
    {
        "title": "Sentebale chair's decision to spend almost half a million pounds on consultancy fees 'will form part of Charity Commission investigation'",
        "description": "The decision by the chair of Prince Harry's Sentebale charity to spend almost half a million pounds on consultancy fees, and who she decided to pay, will form part of a Charity Commission investigation, according to an expert in charity governance.",
        "url": "https://news.sky.com/story/sentebale-chairs-decision-to-spend-almost-half-a-million-pounds-on-consultancy-fees-will-form-part-of-charity-commission-investigation-13341259",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-prince-harry-sentebale-chair_6871151.jpg?20250330105858",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-03 13:29:00",
        "Headline": "Sources close to the former trustees of the charity have told Sky News of their huge concerns about the thousands of pounds spent on consultancy work.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The decision by the chair of Prince Harry's Sentebale charity to spend almost half a million pounds on consultancy fees, and who she decided to pay, will form part of a Charity Commission investigation, according to an expert in charity governance. Sky News has seen a document from a source close to the trustees which shows a breakdown of the £427,497 spent on consultants between June 2023 and January 2025 on work related to media, website and fundraising advice. It comes as the Charity Commission said it had opened a \"regulatory compliance case\" to assess concerns raised about Sentebale. The expenses were said to have been authorised by the charity's chair, Dr Sophie Chandauka. A spokesperson for Sentebale, who confirmed the figure spent on consultants was \"roughly accurate\", told Sky News: \"Board members for many non-profits are intended to be individuals with skills relevant to the work, in addition to being well-connected persons with the ability to create opportunities, attract contacts and further resources for the benefit of the charity. \"To this effect, Dr Chandauka was specifically brought in because of her deep and broad networks in Africa, the UK and US, and commercial experience and resources that could benefit Sentebale. \"Not all introductions that were made were taken up, and those that were, were all vetted appropriately via the CEO at the time, and COO, and their terms of engagement and scope of work was also defined by the CEO and COO in consultations with country directors and the chair as necessary. \n                  Prince Andrew's Pitch@Palace branded 'crude attempt to enrich himself' as Chinese spy documents set to be released\n                 \n                  UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships\n                 \n                  Girl, 13, dies in house fire in Merseyside \n                 \"The board met frequently where resource requirements and budgets were discussed. Indeed, in the case of the senior advisers, the board participated in focus groups and other activities early on in the transformation journey and appeared to be hugely appreciative of their expertise and contributions. It is therefore rather surprising to hear the opposite. \"Dr Chandauka volunteers in excess of 20 hours per week for Sentebale, pro bono, and her family was the third largest donor to the organisation in the last year.\" LEBEC, a strategy and financial innovation firm, was paid the most with a bill of £185,000. Also on the list of payments is Iain Rawlinson, who was appointed as a new trustee last week and appeared on Sky News alongside Dr Chandauka. Mr Rawlinson, who has been involved in philanthropic and charity work since the 1980s and has extensive experience in southern Africa, was paid £24,000 and is said to be owed £66,000, but Sky News understands no invoice has been submitted for that amount in the current circumstances.  Global Philanthropic, the company of which Mr Rawlinson was director and chair, received £21,000. Sources close to the former trustees have told Sky News of their huge concerns about the thousands of pounds spent on consultancy work. Sky News has been told that through the consultation work a financial pledge was made that should have covered the cost of all of the fees, some of that has been paid. On the latest published figures to August 2023, Sentebale's income was only £3.4m.  Experts say that spending between 10% and 15% on a single item would undoubtedly require express trustee approval. When asked by Trevor Phillips on Sky News on Sunday about whether she had hired expensive consultants without board approval, Dr Chandauka replied: \"Well, that's just not true. Iain is a witness.\" She said she had reported the trustees to the Charity Commission and that a UK court had issued an injunction to stop them from removing her. Geoff Hand, a charity governance and dispute resolution expert, told Sky News: \"I doubt the Charity Commission would major on the amount paid to consultants as such; they would be on the lookout for any conflicts of interest - for example, any personal connections between Sophia Chandauka and any of her chosen consultants. \"They would want to know that decisions to engage consultants were properly made by the right people [the trustees] and that the trustees took all relevant factors into consideration in making that decision.\" Last week, it emerged that the founders of Sentebale, Prince Harry and Prince Seeiso of Lesotho, had taken what they called the \"heartbreaking\" decision to step down in solidarity with the trustees, who had found the situation between them and Dr Chandauka \"untenable\". During her interview on Sunday, she accused Prince Harry of \"harassment and bullying at scale\", but a source close to the charity's trustees described her allegations as \"categorically false\" and \"completely baseless\". Sky News approached Sentebale about the work of consultants. Specifically addressing its work with LEBEC, it told us: \"In November 2023, Sentebale engaged LEBEC and its team of six consultants to provide tools and strategic guidance on how to better prepare for entry into the US marketplace and build credibility. \"Over the course of a 12-month engagement, LEBEC successfully delivered against every deliverable, including facilitating 65 key connections with potential strategic partners, connectors, advisory board members, and funders. \"This audience included high-net-worth individuals, family offices, corporations, foundations, and partner non-profits\". Read more from Sky News:Luton Airport expansion plans approvedNew photos show moment of North Sea crash Sky News understands that Global Philanthropic was hired to do a \"strategy envisioning\" project in Autumn 2023 which Iain Rawlinson led given his knowledge of southern Africa. Iain was then hired from April 2024 onwards to advise Sentebale on transformation strategy and governance, his main consulting practices. The scope of work and contract was agreed with the then CEO Richard Miller. Also on the list of payments are £41,451 for Sarah Essien, who has worked with Dr Chandauka at Morgan Stanley and biotechnology company Nandi Life Sciences. Dawn Whyte, who worked at the Black British Business Awards - founded by Dr Chandauka - was said to be paid £26,110. MM Media Consultant received £46,124, and an anonymous website consultant was paid £12,114. Ms Whyte told us she did not want to comment. Ms Essien did not respond to emails, messages left or phone calls made. There have also been allegations from both sides about who was responsible for the end of the relationship with a significant sponsor, ISPS Handa. When we approached ISPS for clarity, they said they had \"no comment\"."
    },
    {
        "title": "Prince Andrew's Pitch@Palace branded 'crude attempt to enrich himself' as Chinese spy documents set to be released",
        "description": "Prince Andrew's efforts to make money from his Pitch@Palace project have been branded as a \"crude attempt to enrich himself\" at the expense of \"unsuspecting tech founders\", as new documents may shed more light on what he and his team have been attempting to sell.",
        "url": "https://news.sky.com/story/prince-andrews-pitchpalace-branded-crude-attempt-to-enrich-himself-as-chinese-spy-documents-set-to-be-released-13341270",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-prince-andrew-yang-tengbo_6778033.jpg?20241216171451",
        "type": "UK",
        "Author": "Rhiannon Mills, royal correspondent, and Jordan Milne, royal producer",
        "Date Published": "2025-04-03 13:49:00",
        "Headline": "Today marks the deadline for documents to be released relating to Prince Andrew's former senior adviser Dominic Hampshire, and his interactions with the alleged Chinese spy Yang Tengbo.",
        "Content": "By Rhiannon Mills, royal correspondent, and Jordan Milne, royal producer  Prince Andrew's efforts to make money from his Pitch@Palace project have been branded as a \"crude attempt to enrich himself\" at the expense of \"unsuspecting tech founders\", as new documents may shed more light on what he and his team have been attempting to sell. Today is the deadline for documents to be released relating to Prince Andrew's former senior adviser Dominic Hampshire and his interactions with the alleged Chinese spy Yang Tengbo. In February, an immigration tribunal heard how the intelligence services had contacted Mr Hampshire about Mr Yang back in 2022. Mr Yang helped set up Pitch@Palace China, a branch of the duke's scheme to help young entrepreneurs. Judges banned Mr Yang from the UK, saying his association with a senior royal had made Prince Andrew \"vulnerable\" and posed a threat to national security. Mr Yang challenged that decision at the Special Immigration Appeals Commission (SIAC). Since that hearing, media organisations have applied for certain documents relating to the case and Mr Hampshire's support for Mr Yang to be made public. SIAC agreed to release some information of public interest. It is hoped they may include more details on deals that he was trying to do on behalf of Prince Andrew. So what do we know about potential deals for Pitch@Palace so far? In February, Sky News confirmed that palace officials had a meeting last summer with tech funding company StartupBootcamp to discuss a potential tie-up between them and Prince Andrew relating to his Pitch@Palace project. \n                  Virginia Giuffre 'overwhelmed' with support after saying she had days to live\n                 \n                  Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash\n                 \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 The palace wasn't involved in the fine details of a deal but wanted guarantees to make sure it wouldn't impact the Royal Family in the future. Sky News understands from one source that the price being discussed for Pitch was around £750,000 - there are, however, reports that a deal may have stalled. Photos we found on the Chinese Chamber of Commerce website show an event held in Asia between StartupBootcamp and Innovate Global, believed to be an offshoot of Pitch.  Documents, released in relation to the investigations into Mr Tengbo, have also shown how much the duke has always seen Pitch as a way of potentially making money. One document from 21 August 2021 clearly states \"the duke needed money at the time, and saw the relationships with China through Pitch as one possible source of funding\". But Prince Andrew's apparent intention to use Pitch to make money has led to concerns about whether he is unfairly using the contacts and information he gained when he was a working royal. Norman Baker, former MP and author of books on royal finances, believes it is \"a crude attempt to enrich himself\" and goes against what the tech entrepreneurs thought they were signing up for. Read more: Who is Yang Tenbo?Virginia Giuffre says she has days to liveEmails between Andrew and Epstein revealed He told Sky News: \"The data given by these business people was given on the basis it was an official operation and not something for Prince Andrew, and so in my view, Prince Andrew had no right legally or morally to take the data which has been collected, a huge amount of data, and sell it... \"And quite clearly if you're going to sell it off to StartupBootcamp, that is not what people had in mind. The entrepreneurs who joined Pitch@Palace did not do so to enrich Prince Andrew,\" he said. Rich Wilson was one tech entrepreneur who was approached at the start of Pitch@Palace to sign up, but he stepped away when he spotted a clause in the contract saying they'd be entitled to 2% equity in any funding he secured. He feels Prince Andrew is continuing to use those he made a show of supporting. He said: \"It makes me feel sick. I think it's terrible - that he is continuing to exploit unsuspecting tech founders in this way. A lot of them, I'm quite grey and old in the tooth now, I saw it coming, but clearly most didn't. And a lot of them were quite young. \"It'll be their first venture and you're learning on the trot, so to speak. So to take advantage of people in such a major way - that's an awful, sickening thing to do.\" We approached StartupBootcamp who said they had no comment to make, and the Duke of York's office did not respond. With reports that a deal may have stalled, it could be a big setback for the duke - especially with questions still about how he'll continue to pay for his home on the Windsor estate now that the King no longer gives him financial support."
    },
    {
        "title": "UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships",
        "description": "The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed.",
        "url": "https://news.sky.com/story/uk-in-talks-with-brazil-over-potential-sale-of-two-royal-navy-amphibious-assault-ships-13341476",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-hms-bulwark-navy-military_6752891.jpg?20241120142942",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-04-03 21:52:00",
        "Headline": "Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget, even though Sir Keir Starmer keeps talking up his promises to boost expenditure.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed. Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget even though Sir Keir Starmer keeps talking up his promises to boost expenditure. The two warships can be used to deploy Royal Marines to shore - a vital capability at a time of growing global threats. News of the possible sale was first revealed in Latin American media. One report said the Royal Navy and Brazilian Navy had signed an agreement that would see the UK giving information to the Brazilians on the state of the two ships prior to any purchase. Asked about the claim that the UK would sell the assault ships to Brazil, a Ministry of Defence spokesperson said: \"We can confirm we have entered discussions with the Brazilian Navy over the potential sale of HMS Bulwark and HMS Albion. \"As announced in November, both ships are being decommissioned from the Royal Navy. Neither were planned to go back to sea before their out of service dates in the 2030s.\" \n                  Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot\n                 \n                  Football fans join with pensioners to clash with police in protest at austerity in Argentina\n                 \n                  Charlotte Peet: Brazilian authorities 'visiting locations' in search for missing British journalist\n                 James Cartlidge, the shadow defence secretary, appeared to question the wisdom of the move. \"At Defence orals [House of Commons questions] on January 6th Defence Secretary John Healey said: 'HMS Bulwark and HMS Albion were not genuine capabilities',\" Mr Cartlidge wrote in a post on social media. \"They've just been sold to Brazil.\" Matthew Savill, the director of military science at the Royal United Services Institute, said the plan to sell the vessels demonstrates there \"is still life in both these ships\". He said: \"The fact that the UK is prepared to sell off useful amphibious capability - which could be used in evacuation operations or other cases where air transport is difficult - shows just how tight finances are even with the promised budget increase. \"The replacements for these ships are still several years away and won't be available until the 2030s.\" Read more from Sky News:Prince Harry's charity row explainedUS seems content to cosy up to Russia instead of imposing tariffs Mr Savill added: \"As an aside, Brazil will probably have greater amphibious capacity than the UK, having previously bought HMS Ocean, the UK's helicopter assault ship.\" HMS Albion and HMS Bulwark entered service two decades ago. Both are currently held at lower readiness having not been to sea since 2023 and 2017 respectively. HMS Ocean, a helicopter-landing vessel and once the largest warship in the Royal Navy, was sold to the Brazilian Navy in 2018 after 20 years in service."
    },
    {
        "title": "Girl, 13, dies in house fire in Merseyside ",
        "description": "A 13-year-old girl has died after a house fire in Merseyside.",
        "url": "https://news.sky.com/story/girl-13-dies-in-house-fire-13341393",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kingsway-preston-house-fire_6875265.jpg?20250403205900",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-03 19:16:00",
        "Headline": "Police said the teenager died following a blaze on Wednesday night. A man, woman and five children managed to escape the property unharmed, officers said.",
        "Content": "A 13-year-old girl has died after a house fire in Merseyside. Merseyside Fire and Rescue Service (MFRS) said it was called to the scene in Prescot, in the borough of Knowsley, at 11.42pm on Wednesday. Crews arrived to find a blaze in the rear bedroom of a mid-terraced house. In a statement, police said: \"A man, woman and five children were able to escape from the property unharmed. \"Sadly, a 13-year-old girl was pronounced dead at the scene. Her family are aware and are being supported by specially trained officers.\" Police said four firefighters entered the property with breathing apparatus to tackle the fire, which was on the first floor, and search for people. The blaze was extinguished at 12.29am on Thursday. A joint investigation involving MFRS's Incident Investigation Team and Merseyside Police has been launched. Detective Inspector Steven O'Neill said: \"Our thoughts are with the family of the young girl at this very sad time... \"A joint investigation into the cause of the fire is ongoing and the girl's family is being supported by specially trained officers.\""
    },
    {
        "title": "Boy saved from burning car after M6 crash caused by suicidal ex-RAF pilot, inquest hears",
        "description": "A workman saved a seven-year-old boy from a burning car in the aftermath of a deadly crash caused by a suicidal ex-pilot, an inquest has heard.",
        "url": "https://news.sky.com/story/boy-saved-from-burning-car-after-m6-crash-caused-by-suicidal-ex-raf-pilot-inquest-hears-13341293",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-m6-crash_6717286.jpg?20250403160122",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-03 14:53:00",
        "Headline": "A passing workman rescued the seven-year-old from the fiery wreckage of the collision, which claimed the life of his mother and three other innocent people in October last year.",
        "Content": "A workman saved a seven-year-old boy from a burning car in the aftermath of a deadly crash caused by a suicidal ex-pilot, an inquest has heard. The schoolboy's rescue came following the collision on the M6, which killed former RAF man Richard Woods and four others, in October last year. Last week a coroner ruled that Woods, 40, took his own life by deliberately driving his Skoda the wrong way down the motorway while drunk and hitting a Toyota Yaris head-on. The driver of the Toyota, Jaroslaw Rossa, 42, was also killed, along with his two sons, Filip, 15, and Dominic, seven, and his partner Jade McEnroe, 33. Cockermouth Coroner's Court heard on Thursday that Ms McEnroe's son was also in the car but survived after workman Gavin Walsh came to his rescue at the scene, which was near Tebay services in Cumbria. In a statement to the inquest, Mr Walsh said he was a passenger in a transit van travelling to Scotland when he witnessed the crash. He jumped out of the vehicle and used a jack to smash the rear windscreen of the Toyota and pulled the boy out of the burning vehicle. Mr Walsh said: \"We really did try, I can assure everyone we did our best. We only had minimal time. \"I saved a life that day and I hope never to witness anything like that again.\" He added that he has never stopped thinking about the boy, and said: \"I hope we will meet again one day and I will give you a massive hug.\" At the time, the family were returning to Glasgow from a trip to Legoland in Windsor, Berkshire. The inquest heard that Wood, who was travelling at a speed of at least 65mph, would have been charged with manslaughter had he survived. Recording conclusions of unlawful killing, Cumbria assistant coroner Margaret Taylor said: \"I found that Jaroslaw, Jade, Filip and Dominic died as a consequence of the unlawful acts of another driver.\" The inquest heard how Mr Woods, from Cambridgeshire, had served a distinguished 14-year career in the RAF and was a flight instructor for BAE Systems at the time of his death. In Ms Taylor's record of inquest, Mr Woods was said to have been experiencing \"a number of stressors in his life\" and had a \"history of harmful use of alcohol\". Following the crash, he was found to be nearly four times over the legal drink-drive limit and a two-thirds empty bottle of gin was found in his car. On the day of his death, concerns had been raised over his behaviour at a work conference near Preston in Lancashire. Mr Woods failed to return to his seat after lunch and was later spotted driving erratically and swerving across three northbound carriageway lanes on the M6. After pulling onto the hard shoulder, he then proceeded to U-turn and drove southward on lane three. Detective Sergeant Deborah Story, from Cumbria Police, told the inquest that Mr Woods would have been prosecuted on four counts of manslaughter had he lived. She said hypothetical charges of murder were considered by detectives but not thought appropriate because of a lack of information that Mr Woods knew the family or anything that provided a link between them. Ms McEnroe's parents, Marie McEnroe and George McNellis, told the coroner they thought it was \"murder\". Read more from Sky News:Luton Airport expansion approvedPrince Harry responds to charity rowAppeal launched to help earthquake victims A statement from the mother of Filip and Dominic, and the ex-wife of Mr Rossa, Kamila, was read out at the inquest. She said Mr Rossa, known as Jarek, was born in Poland where they became a couple and went on to have three boys. He loved playing computer games and had \"lots of friends\", she said, and worked at the Wagamama restaurant in Silverburn, Glasgow. She said she was \"devastated\" over the deaths, adding: \"Our lives will never be the same. \"I am heartbroken at the passing of my beloved angels Filip and Dominic.\" Marie McEnroe said her daughter, a spa therapist, had been in a relationship with Mr Rossa for about two-and-a-half years. She said Jade had been a \"brilliant mother\" to her only child, was \"really happy\" with Mr Rossa and it was \"lovely chaos\" when all the boys were playing together. Ms McEnroe added: \"Life changed forever that day\". Ms Taylor praised the \"selfless acts of bravery\" from those in the aftermath of the collision, including Mr Walsh, who she said went towards the burning car \"without hesitation for his own safety\". The coroner added: \"Without his swift response, Jade's child would also have perished.\" Addressing the bereaved family members, she said: \"Your loss is unimaginable but you have conducted yourself with dignity and I thank you for that. I wish you strength for the future.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Thomas Kettleborough: 'Vile' former police inspector caught in child sex sting",
        "description": "A 'vile' former police officer who was caught in a sting operation after travelling to meet what he thought was a 14-year-old boy has been jailed. ",
        "url": "https://news.sky.com/story/thomas-kettleborough-vile-former-police-inspector-caught-in-child-sex-sting-13341347",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-thomas-kettleborough_6875129.jpg?20250403203018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-03 17:18:00",
        "Headline": "The 35-year-old has been jailed after trying to meet up with what he thought was a 14-year-old boy. Officers later discovered dozens of indecent images on his phone and computer.",
        "Content": "A 'vile' former police officer who was caught in a sting operation after travelling to meet what he thought was a 14-year-old boy has been jailed.  Thomas Kettleborough, 35, then an inspector with Avon and Somerset Police, was arrested in July 2023 while attempting to meet up with 'the teenager' after communicating with him on Grindr and Snapchat. However, he was actually speaking to undercover officers. After being detained at a car park in Bristol, officers found a bag in the boot of his car containing \"an assortment of sex toys, condoms and bondage equipment, including a pair of limb restraints,\" Exeter Crown Court heard. More than 150 indecent images of children were also discovered on his phone and computer. Kettleborough used the apps to have sexually explicit chats with the teenager, using the name Liam, while claiming to be 28, prosecutors said. In February, he pleaded guilty to several child sex offences, including attempting to engage in sexual communication with a child and attempting to cause or incite a child to engage in sexual activity. Last month he was sacked by Avon and Somerset Police and barred from policing for gross misconduct. He was sentenced to two years and eight months in prison on Thursday. Assistant Chief Constable Joanne Hall, from Avon and Somerset Police, said the public would be \"appalled by the vile and manipulative actions of this former officer\". She added: \"He was caught following a policing operation designed to keep children safe which has resulted in his wider offending being identified.\" Detective Inspector Dave Wells, who led the investigation, said Kettleborough's crimes took place over four years, The former officer held positions of trust in the police, the Sea Cadets and the Royal Lifesaving Society, but \"concealed his true identity through an online persona as 'Liam', 'L S' and 'Liamss5506',\" Mr Wells said. Mr Wells added: \"Specialist investigators are ready to listen and investigate any reports relating to Thomas Kettleborough or any other matters of concern. I want people to know that they will be believed. \"Thomas Kettleborough is now behind bars. I hope if there are others that have been affected by this case, they now feel empowered to tell someone, if they are ready to do so.\" Read more from Sky News:Luton Airport expansion approvedPrince Harry responds to charity rowAppeal launched to help earthquake victims Lee Bremridge, defending, said Kettleborough had shown genuine remorse for his crimes. He added that the former officer had \"done everything that he can attempt to do to try and understand why it is he committed the offences that he did.\" Kettleborough was also handed an indefinite Sexual Harm Prevention Order and will be on the Sex Offenders' Register for life."
    },
    {
        "title": "Highs and lows of Five-Year Keir: The PM's journey from Doughty Street to Downing Street",
        "description": "From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants.",
        "url": "https://news.sky.com/story/highs-and-lows-of-five-year-keir-the-pms-journey-from-doughty-street-to-downing-street-13341342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-labour_6875142.jpg?20250403183034",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-04-03 17:09:00",
        "Headline": "Sir Keir Starmer's first five years as Labour Party leader have seen dramatic highs and lows - but the next five will perhaps be even more challenging.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants. Five years after becoming Labour leader, Sir Keir Starmer has been on a remarkable journey. He turned left to win the party leadership and turned right to win a general election. It has been five years of dramatic highs and lows: the elation of winning a landslide general election victory after the gloom of contemplating quitting following a by-election humiliation. As opposition leader, Sir Keir purged the Labour left, including banishing his predecessor Jeremy Corbyn to the political wilderness, and flushed out the scourge of antisemitism. As prime minister, within weeks of entering Number 10 he was confronted with riots on Britain's streets. And throughout his premiership he has had to play a leading role internationally in a volatile and war-torn world. At home, his government's economic policies have been condemned by political opponents and some of his own MPs as a return to austerity. Labour's opinion poll ratings have nose-dived. Abroad, as well as the challenge of defending Ukraine against the brutality of Russia's Vladimir Putin, the so-called \"special relationship\" with the United States has been tested to the limit by the erratic Donald Trump. \n                  Trump has acted for his country, I will act in Britain's interests, says Starmer\n                 \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 \n                  Woman whose son Martyn Hett died in Manchester Arena terror attack welcomes new law in his name\n                 Five-year Keir was elected Labour leader on 4 April 2020, just weeks after prime minister Boris Johnson ordered a COVID lockdown that was ultimately to bring about his demise. Sir Keir won 56% of the vote, defeating the Corbyn-backed left-wing candidate Rebecca Long-Bailey and Lisa Nandy from Labour's soft left. To win the backing of left-wing Labour activists, he backed a wealth tax on the top 5% of earners, abolishing university tuition fees, nationalising water and energy and restoring freedom of movement between the UK and EU countries. Whatever happened to those promises? There was also a showbiz connection. When he was running for the leadership, a rumour persisted that he was the inspiration for Mark Darcy, the dashing human rights lawyer played by Colin Firth in the Bridget Jones movies. But, alas for Sir Keir and his spin doctors, who did nothing to dispel the myth, several months after he became leader the Bridget Jones author Helen Fielding laid the rumour to rest - though she conceded they were very similar. Sir Keir had much bigger battles to fight, however. From day one as leader, he condemned antisemitism as \"a stain on our party\". Within weeks he sacked his rival Ms Long-Bailey from his shadow cabinet in a dispute over antisemitism. But in his ruthless determination to show the party had changed under his leadership, he had a bigger target: his predecessor Mr Corbyn, still the darling of left-wing Labour activists. After the former leader claimed the scale of antisemitism in the Labour party had been \"dramatically overstated for political reasons\", Sir Keir struck, suspending him for refusing to retract his comments and then finally expelling him a month before last year's general election. But while he was winning that battle, Sir Keir's first year did not go well at the ballot box. In 2021, in the first by-election after Boris Johnson's 80-seat victory in the 2019 general election, Labour lost the previously safe seat of Hartlepool to the Conservatives. The swing against Labour was a huge 16%. It was his lowest low point of the last five years. Stunned by the Hartlepool defeat, Sir Keir panicked, sacking his chief whip Nick Brown and attempting to demote his deputy, Angela Rayner, stripping her of her posts as party chair and campaign coordinator. But it backfired as she fought back and emerged stronger than ever. She gained the titles of shadow chancellor of the Duchy of Lancaster and shadow secretary of state for work. Four years later, her Employment Rights Bill is in the House of Lords and on course to become law. Last year, in a Sky News interview with political editor Beth Rigby, Sir Keir admitted he had considered quitting. \"I did, because I didn't feel that I should be bigger than the party and that if I couldn't bring about the change, perhaps there should be a change,\" he said. But it wasn't just the result in Hartlepool that was damaging. In 2022, in a scandal the Conservatives called \"beergate\", he and Ms Rayner were accused of breaching lockdown rules by eating curry and drinking beer in Durham while campaigning in the by-election. He was cleared, but at the height of the Tory onslaught he said he would resign if he was issued with a fixed penalty notice. It was another low point. But in 2022 it was Mr Johnson who was forced to quit over breaking COVID rules, not Sir Keir. A top civil servant, Sue Gray, produced a damning and ultimately fatal \"partygate\" report, accusing Mr Johnson of lying to parliament, Liz Truss came and went - her brief 49-day tenure likened to the life of a lettuce - and Rishi Sunak became the Tories' fifth prime minister in six years. Sir Keir was on his way. But it was his turn to stun his opponents in 2023 when he announced that Sue Gray was to become his chief of staff, in a move the Tories claimed was treachery and proof that she had been biased against Mr Johnson. But though she lasted longer than \"lettuce\" Liz Truss, Sue Gray didn't survive for long. Within months of Labour's 2024 election victory she was out, the victim of a vicious power struggle with a Number 10 \"boys' club\" led by Starmer's campaign chief Morgan McSweeney, who helped himself to her job as chief of staff. On the back of several by-election successes and sweeping local government gains, when Mr Sunak shocked his own party on 22 May by announcing a 4 July general election, Labour entered the campaign as overwhelming favourites to win a big majority. A turning point in the campaign came on 2 June when Nigel Farage announced a comeback as Reform UK leader and declared that he would, after months of keeping his opponents guessing, be a candidate after all. As a result, Reform UK won 4.1m votes, piling up votes in the tens of thousands in hundreds of seats, mostly at the expense of the Conservatives, and handing a landslide to Sir Keir: 411 Labour MPs and a majority of 172. His triumph came close to rivalling Tony Blair's landslides of 1997 and 2001 with one crucial difference: Labour polled just 34% of the vote, the lowest share for a party winning a majority. During the campaign, Sir Keir faced tough scrutiny not just about his pledges not to increase income tax, VAT or national insurance, but also about his character and personality. In \"The Battle for Number 10\" on Sky News, a 90-minute event in Grimsby featuring Sir Keir and Mr Sunak, the Labour leader froze when a member of the audience told him he seemed like a \"political robot\". He also squirmed when another audience member challenged him on why he now condemned Mr Corbyn when five years earlier he told voters he would make a great prime minister. Yet despite those difficult moments, the event was more bruising for Mr Sunak than Sir Keir and a YouGov poll declared a decisive victory for the Labour leader, by 64% to 36% But there was to be no honeymoon period for Sir Keir after Labour's landslide. Within days of his election victory, riots following the killing of three young girls at a dance class in Southport presented the new prime minister with a law and order crisis. His background as Director of Public Prosecutions served him well, however, and he showed a steely determination in ensuring rioters were dealt with swiftly and severely by the courts, though critics hit out at inconsistencies in sentencing and branded him \"Two-tier Keir\". Another crisis was self-inflicted. Many in his own party were shocked by the staggering amount of freebies, gifts and hospitality he and his wife accepted since he became Labour leader, many paid for by a millionaire Labour donor Lord Alli. According to a Sky News investigation, their total worth was more than £100,000. They included expensive clothes for the PM and his wife, luxury designer spectacles for Sir Keir, hospitality at his beloved Arsenal FC, free accommodation in a flat owned by Lord Alli and - perhaps the most contentious - freebie tickets to a Taylor Swift concert at Wembley Stadium, all worth eye-watering amounts. To make matters worse, the \"freebie-gate\" scandal engulfed the PM at a time when his chancellor, Rachel Reeves, was cutting winter fuel payments for pensioners, the first of a series of controversial moves by the woman derided as \"Rachel from Accounts\" by political opponents that have badly damaged Sir Keir's government in its first nine months. The two-child benefit cap, national insurance rises in her October budget, benefit cuts last month and no compensation for the so-called Waspi women have all infuriated many Labour MPs and put Sir Keir's loyalty to his chancellor under strain. He's standing by her for now. \"I have full confidence in the chancellor,\" he declared, tetchily, when challenged by a Tory MP at PMQs just minutes before her spring statement last week. But for how long? Most prime ministers eventually fall out with their chancellor: Margaret Thatcher with Sir Geoffrey Howe and then Nigel Lawson in the 1980s and later Tony Blair and Gordon Brown. Be warned, Rachel! On foreign policy, the PM's record is better. His baptism on the world stage, at a NATO summit in Washington in his first week as PM, helped him swiftly establish a reputation as a safe pair of hands and reliable ally on foreign policy. Though the UK is no longer in the EU, Sir Keir has forged strong alliances with European leaders - particularly France's President Macron - as he attempts to build a \"coalition of the willing\" to defend Ukraine. And he has won the trust of Ukraine's President Zelenskyy. And on his biggest foreign policy challenge, establishing good relations with the maverick President Trump, the verdict - even after the president's tariffs bombshell - is so far, so good. His Trump Tower dinner last September went well, his White House stunt with an envelope containing King Charles' state visit invitation was a diplomatic masterstroke and the 10% tariffs slapped on the UK could have been a lot worse. Now comes the really hard part for Five-Year Keir: securing a trade deal with the US, bringing peace to Ukraine without a sell-out or concessions to Vladimir Putin, smashing the gangs smuggling illegal migrants, tackling welfare reform and - the biggest challenge - finding that elusive economic growth at home while the Trump tariffs make autumn tax rises look almost inevitable. No pressure, then prime minister. If the lows of Sir Keir's first five years as Labour leader took the shine off the highs, the next five years - to the next election and perhaps beyond - look even more challenging. And the journey from Doughty Street to Downing Street is now just a distant memory."
    },
    {
        "title": "Scheme to boost access to NHS dentists 'comprehensively failed', MPs say",
        "description": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said",
        "url": "https://news.sky.com/story/scheme-to-boost-access-to-nhs-dentists-comprehensively-failed-mps-say-13341487",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-dentist-nhs-teeth_6494653.jpg?20240319003434",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-03 22:13:00",
        "Headline": "Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments. The PAC's report said it appears to have \"resulted in worsening the picture\".",
        "Content": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments for patients and offered dentists a \"bonus\" to take NHS patients. According to the Public Accounts Committee (PAC), the scheme appears to have \"resulted in worsening the picture\" more than a year later. Under the Dental Recovery Plan, practices were offered a new patient premium (NPP) - which the PAC found cost at least £88m since it was introduced and resulted in 3% fewer new patients seeing an NHS dentist.  The plan's \"golden hello\" recruitment scheme had also been found to have appointed fewer than 20% of the expected 240 dentists by February this year. Their report, published today, also said vulnerable patients \"continue to suffer the most\" and that the dental contract \"remains unfit for purpose\". Current arrangements are only sufficient for about half of England's population to see an NHS dentist over two years, it added. \n                  Kemi Badenoch thinks she's started a journey - a ruthless party may soon have other ideas\n                 \n                  A Labour Party in Tory clothing? Why Starmer's backbenchers are deeply uncomfortable\n                 \n                  Ex-Tory MP Crispin Blunt still at centre of rape investigation 16 months after arrest\n                 The PAC report also said \"it does not appear\" that NHS England or the Department of Health and Social Care \"have a sense of what level of funding would provide a realistic incentive for dentists to prioritise NHS work\". Read more:Morning-after pill set to be made free from pharmaciesGPs agree deal to 'end 8am scramble' for appointments 'NHS dentistry is broken' PAC chairman Sir Geoffrey Clifton-Brown said: \"It is utterly disgraceful that, in the 21st century, some Britons have been forced to remove their own teeth. \"Last year's Dental Recovery Plan was supposed to address these problems, something our report has found it has signally failed to do. \"Almost unbelievably, the government's initiatives appear to have actually resulted in worsening the picture, with fewer new patients seen since the plan's introduction.\" He added: \"NHS dentistry is broken. The government could hardly fail to agree on this point, and indeed I am glad that it is not in denial that the time for tinkering at the edges is over. \"It is time for big decisions.\" A Department of Health and Social Care spokesperson said the Labour government \"inherited a broken NHS dental sector\" and was fixing it through its Plan for Change. It said that in February, it had delivered on its manifesto pledge by rolling out 700,000 extra urgent appointments and pledged to introduce a new supervised toothbrushing scheme for three to five-year-olds."
    },
    {
        "title": "Woman whose son Martyn Hett died in Manchester Arena terror attack welcomes new law in his name",
        "description": "There is a certain steel about a mother who has lost a child.",
        "url": "https://news.sky.com/story/woman-whose-son-martyn-hett-died-in-manchester-arena-terror-attack-welcomes-new-law-in-his-name-13341329",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-martyn-hett-manchester-arena_6875115.jpg?20250403173913",
        "type": "UK",
        "Author": "Sophy Ridge",
        "Date Published": "2025-04-03 16:22:00",
        "Headline": "Figen Murray has campaigned for six years for a new law that makes venues protect people in the event of terror attacks.",
        "Content": "\n          Lead politics presenter\n              @SophyRidgeSky\n  There is a certain steel about a mother who has lost a child. It's hard to put your finger on, but perhaps after going through hell you re-emerge made of a different material to the rest of us. Figen Murray has been utterly relentless after her son Martyn Hett was killed in the Manchester Arena terror attack at an Ariana Grande concert in May 2017. When she worried that politicians' support was wavering last year, she walked 200 miles from the place Martyn died to Downing Street - and needed a hip replacement after. And on Thursday, Martyn's Law - rules to better train staff and safeguard venues against terrorists - was passed by royal assent, finally becoming law. I sat down with Figen just before she went into Number 10 Downing Street to meet the prime minister, and she told me after six years of campaigning, the moment \"feels surreal\". She continued: \"The Manchester attack was a wake up call. But it also made question, who are these people who do these things? Why are they doing it? What are governments doing about it? And I realised the only way I could get the answers was to educate myself - so I did a masters in counter-terrorism. \n                  More than 400 Sikh groups call on Starmer to launch 'promised' inquiry on Golden Temple massacre\n                 \n                  Starmer holds fire on Trump's Liberation Day\n                 \n                  Has Starmer played Trump right?\n                 \"I've recognised that people were radicalised. When you were a newborn baby, you were innocent but somebody poisoned your mind. \"There are people who try to groom young people into their ideology, and I want them to recognise where these people operate, the tricks they use, the things they say and how they can recognise themselves or others in the process of being radicalised and how to get out.\" She also supports the initiative to show the Netflix drama Adolescence in schools: \"I think it's absolutely important that young people see that programme and they learn more about it. It's a good thing and I'm hoping they're taking it further.\" There will be a debate - certainly - about the financial impact the legislation will have on venues, but the legislation has been welcomed by safety campaigners. Emma Kay, co-founder of personal safety app WalkSafe which geo-fences events and stadiums, said: \"The passing of Martyn's Law is hugely progressive move that will keep young people safe on nights out. \"Our research has shown that 63% of women prefer to visit venues with safety initiatives in place. People want safer experiences and to know their friends and loved ones arrive home safely.\" Read more:Martyn's Law: Terrorism response bill named after Manchester Arena bombing victim becomes law When I sat down with Figen, I asked her how Martyn would feel today. \"Knowing Martyn, the party animal he was, he'd throw the biggest party ever,\" she said. \"He was full of life and lived life not just at 100 miles an hour, but 200 miles an hour. \"You would definitely know when he came through the door, and he had an incredible ability to make everyone feel that they are the most important person in that moment in his life. And I really miss that.\" You can watch Sophy Ridge's full interview with Figen Murray on the Politics Hub at 1900 on Sky News."
    },
    {
        "title": "Boost for London nightlife as mayor Sir Sadiq Khan given new powers to overturn council licensing decisions",
        "description": "London councils that block bars and restaurants from opening later could see their decisions overturned by the mayor, who is being given new powers by the government.",
        "url": "https://news.sky.com/story/boost-for-london-nightlife-as-mayor-sir-sadiq-khan-given-new-powers-to-overturn-council-licensing-decisions-13341449",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-london-nightlife-soho_6875338.jpg?20250403222133",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-03 20:58:00",
        "Headline": "Chancellor Rachel Reeves says the new powers will mean hospitality businesses have \"the conditions to grow\" and are not \"tied down by unnecessarily burdensome red tape\".",
        "Content": "London councils that block bars and restaurants from opening later could see their decisions overturned by the mayor, who is being given new powers by the government. As part of ministers' plans to boost the hospitality industry, Sir Sadiq Khan is set to be granted the power to \"call in\" licensing decisions for nightlife hotspots in the capital. It could mean later opening hours and more alfresco dining in London, and the pilot scheme could eventually be expanded to other parts of the country, such as the West Midlands or Greater Manchester. Politics latest: How will the UK react to Trump's tariffs? Chancellor Rachel Reeves said the move will mean hospitality businesses have \"the conditions to grow\" and are not \"tied down by unnecessarily burdensome red tape\". \"We've heard industry concerns, and we're partnering with businesses to understand what changes need to be made, because a thriving nighttime economy is good for local economies, good for growth, and good for getting more money in people's pockets,\" she added. Deputy prime minister Angela Rayner said: \"Too often, we have seen the complaints of a vocal minority of objectors promoted over the need for our country to grow - we are determined to change this.\" \n                  Consultations for building set to be scrapped under proposed changes\n                 \n                  Angela Rayner 'won't speculate' over possible changes to two-child benefit cap\n                 \n                  Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes\n                 Councils want more powers, not fewer The decision comes at a time when the UK's hospitality industry is under severe pressure amid rising wage costs, national insurance contributions, and business rates. Industry trade body UKHospitality has said the combination of rising costs would mean a £3.4bn hit for the sector, and is calling on the government to do more. Sir Sadiq argued that allowing him to be able to overrule local councils will \"allow us to do more to support the capital's pubs, clubs and music venues\". He added: \"This is more evidence that we now have a government that wants to work with the capital and recognises the role that we can play in delivering economic prosperity and support Londoners as we build a better London for everyone.\" But this decision to grant more powers to the mayor also comes at a time when London's 32 boroughs are calling for a greater say in how the capital is run, and called on Thursday for a new power-sharing arrangement with the mayor, giving them a formal say over the capital's strategic direction. Read more: 'They can't even run themselves': Starmer attacks Reform UKTrump has acted for his country, I will act in Britain's interests, says PMTariffs will have an impact before too long - but how will the UK respond? A spokesperson for Westminster City Council said: \"Westminster has the most pubs and clubs of any local authority so we already have extensive expertise in supporting business to thrive while balancing the views of local people and the police. \"We grant the vast majority of licensing applications, which are only refused where safety concerns are raised by the police or significant disruption is likely. \"We need to see the proposals in more detail before commenting further. \"Local authorities and licensing professionals should be represented on any working group.\""
    },
    {
        "title": "Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs",
        "description": "Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession.",
        "url": "https://news.sky.com/story/stock-markets-suffer-sharp-drops-after-donald-trump-announces-sweeping-tariffs-13341308",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6873959.jpg?20250402152646",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-03 15:35:00",
        "Headline": "All three of the US's major markets opened to sharp losses on Thursday morning. By the end of trading, both the Nasdaq and Dow Jones had experienced their worst one-day loss since the COVID-19 pandemic.",
        "Content": " Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession. The US president announced tariffs for almost every country - including 10% rates on imports from the UK - on Wednesday evening, sending financial markets reeling. While the UK's FTSE 100 closed down 1.55% and the continent's STOXX Europe 600 index was down 2.67% as of 5.30pm, it was American traders who were hit the most. Trump tariffs latest: US stock markets tumble All three of the US's major markets opened to sharp losses on Thursday morning. By 8.30pm UK time (3.30pm EST), The Dow Jones Industrial Average was down 3.7%, the S&P 500 opened with a drop of 4.4%, and the Nasdaq composite was down 5.6%. Compared to their values when Donald Trump was inaugurated, the three markets were down around 5.6%, 8.7% and 14.4%, respectively, according to LSEG. \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 \n                  Ex-DUP leader Sir Jeffrey Donaldson to face trial over 18 sex offence allegations\n                 \n                  Ex-DUP leader Jeffrey Donaldson in court charged with rape - his wife charged with aiding him\n                 Worst one-day losses since COVID As Wall Street trading ended at 9pm in the UK, two indexes had suffered their worst one-day losses since the COVID-19 pandemic. The S&P 500 fell 4.85%, the Nasdaq dropped 6%, and the Dow Jones fell 4%. It marks Nasdaq's biggest daily percentage drop since March 2020 at the start of COVID, and the largest drop for the Dow Jones since June 2020.  'Trust in President Trump' White House press secretary Karoline Leavitt told CNN earlier in the day that Mr Trump was \"doubling down on his proven economic formula from his first term\". \"To anyone on Wall Street this morning, I would say trust in President Trump,\" she told the broadcaster, adding: \"This is indeed a national emergency... and it's about time we have a president who actually does something about it.\" Later, the US president told reporters as he left the White House that \"I think it's going very well,\" adding: \"The markets are going to boom, the stock is going to boom, the country is going to boom.\" He later said on Air Force One that the UK is \"happy\" with its tariff - the lowest possible levy of 10% - and added he would be open to negotiations if other countries \"offer something phenomenal\".  Economist warns of 'spiral of doom' The turbulence in the markets from Mr Trump's tariffs \"just left everybody in shock\", Garrett Melson, portfolio strategist at Natixis Investment Managers Solutions in Boston, told Reuters. He added that the economy could go into recession as a result, saying that \"a lot of the pain, will probably most acutely be felt in the US and that certainly would weigh on broader global growth as well\". Meanwhile, chief investment officer at St James's Place Justin Onuekwusi said that international retaliation is likely, even as \"it's clear countries will think about how to retaliate in a politically astute way\". He warned: \"Significant retaliation could lead to a tariff 'spiral of doom' that could be the growth shock that drags us into recession.\" Read more:Do Trump's 'Liberation Day' tariff numbers add up?Tariffs about something more than economics: power It comes as the UK government published a long list of US products that could be subject to reciprocal tariffs - including golf clubs and golf balls. Running to more than 400 pages, the list is part of a four-week-long consultation with British businesses and suggests whiskey, jeans, livestock, and chemical components. Meanwhile, Prime Minister Sir Keir Starmer said on Thursday that the US president had launched a \"new era\" for global trade and that the UK will respond with \"cool and calm heads\". It also comes as Canadian Prime Minister Mark Carney announced a 25% tariff on all American-imported vehicles that are not compliant with the US-Mexico-Canada trade deal. He added: \"The 80-year period when the United States embraced the mantle of global economic leadership, when it forged alliances rooted in trust and mutual respect and championed the free and open exchange of goods and services, is over. This is a tragedy.\""
    },
    {
        "title": "Trump's tariffs are about something more than economics: power",
        "description": "Tanking stock markets, collapsing world orders, devastating trade wars; economists with their hair ablaze are scrambling to keep up.",
        "url": "https://news.sky.com/story/trumps-tariffs-are-about-something-more-than-economics-power-13341209",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-washington-donald-trump_6874616.jpg?20250403074844",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-03 12:33:00",
        "Headline": "Above all, tariffs give Donald Trump power. They strike fear into allies and enemies, from governments to corporations. This is a president who runs his presidency like a medieval emperor or mafia don.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Tanking stock markets, collapsing world orders, devastating trade wars; economists with their hair ablaze are scrambling to keep up. But as we try to make sense of Donald Trumps's tariff tsunami, economic theory only goes so far. In the end this surely is about something more primal. Power. Understanding that may be crucial to how the world responds. Yes, economics helps explain the impact. The world's economy has after all shifted on its axis, the way it's been run for decades turned on its head. Instead of driving world trade, America is creating a trade war. We will all feel the impact.  Donald Trump says he is settling scores, righting wrongs. America has been raped, looted and pillaged by the world trading system. \n                  Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs\n                 \n                  Pentagon's acting inspector general will review Pete Hegseth's use of Signal for Houthi airstrike plans\n                 \n                  'A genius actor', 'firecracker', and 'my friend': Tributes paid to Top Gun star Val Kilmer\n                 But don't be distracted by the hyperbole - and if you think this is about economics alone, you may be missing the point. Above all, tariffs give Donald Trump power. They strike fear into allies and enemies, from governments to corporations. This is a president who runs his presidency like a medieval emperor or mafia don. It is one reason why since his election we have seen what one statesman called a conga line of sycophants make their way to the White House, from world leaders to titans of industry. The conga line will grow longer as they now redouble their efforts hoping to special treatment from Trump's tariffs. Sir Keir Starmer among them. President Trump's using similar tactics at home, deploying presidential power to extract concessions and deter dissent in corporate America, academia and the US media. Those who offer favours are spared punishment. His critics say he seeks a form power for the executive or presidential branch of government that the founding fathers deliberately sought to prevent. Whether or not that is true, the same playbook of divide and rule through intimidation can now be applied internationally. Thanks to tariffs Each country will seek exceptions but on Trump's terms. Those who retaliate may meet escalation. This is the unforgiving calculus for governments including our own plotting their next moves. The temptation will be to give Trump whatever he wants to spare their economies, but there is a jeopardy that compounds the longer this goes on. Read more:Do Trump's numbers on tariffs really add up?Trump hits island home only to penguins with 10% tariffs Malcolm Turnbull, the former Australian prime minister who coined the conga line comparison, put it this way: \"Pretty much all the international leaders I have seen that have sucked up to Trump have been run over. The reality is if you suck up to bullies, whether it's global affairs or in the playground, you just get more bullying.\" Trading partners may be able to mitigate the impact of these tariffs through negotiation, but that may only encourage this unorthodox president to demand ever more? Ultimately the world will need a more reliable superpower than that. In the hands of such a president, America cannot be counted on. When it comes to security, stability and prosperity, allies will need to fend for themselves. And they will need new friends. If Washington can't be relied on, Beijing beckons. America First will, more and more, mean America on its own."
    },
    {
        "title": "Israeli airstrike kills at least 27 sheltering at Gaza school, says Hamas-run health ministry",
        "description": "More than 100 Palestinians have been killed in Israeli airstrikes targeting Gaza, including 27 sheltering at a school, according to the Hamas-run health ministry.",
        "url": "https://news.sky.com/story/israeli-airstrike-kills-at-least-27-sheltering-at-gaza-school-says-hamas-run-health-ministry-13341432",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-city-airstrike_6875381.jpg?20250403230210",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-03 20:43:00",
        "Headline": "On Thursday, the Israeli military ordered more residents in parts of northern Gaza to move to shelters in the western side of Gaza City, as it intensified attacks on what it claimed were Hamas targets. ",
        "Content": "More than 100 Palestinians have been killed in Israeli airstrikes targeting Gaza, including 27 sheltering at a school, according to the Hamas-run health ministry. The bodies of 14 children and five women were recovered from the school in the Tuffah neighbourhood of Gaza City. Hamas condemned the strike on the school, calling it a \"heinous massacre\" of innocent civilians. The Israel Defence Forces (IDF) said it struck a \"Hamas command and control centre\" and took steps to lessen harm to civilians. Some of the 70 people wounded in the attack suffered critical injuries, said health ministry spokesman Zaher al Wahidi. He added that, according to hospital records, more than 30 other Gaza residents were killed in strikes on homes in a nearby neighbourhood of Shijaiyah. Overnight strikes by Israel also killed at least 55 people in the Gaza Strip, hospital officials said. The IDF has been stepping up its offensive in the region in an attempt to put new pressure on Hamas and eventually expel the militant group. \n                  'Deliberate policy of withholding aid' in Gaza to ultimately put pressure on Hamas, says UN aid chief\n                 \n                  Netanyahu says Israel establishing new security corridor in Gaza to 'pressure Hamas' - and plans to seize 'large areas'\n                 \n                  Father demands protection after Gaza aid workers' deaths\n                  On Thursday, the Israeli military ordered more residents in parts of northern Gaza to move to shelters in the western side of Gaza City, warning that it planned to \"work with extreme force in your area\". The evacuation orders follow warnings from senior government officials that Israel would seize large parts of the Palestinian territory and establish a new security corridor across it. Israel has imposed a month-long blockade on food, fuel and humanitarian aid in the hope Hamas will release the remaining 59 hostages, 24 of whom are believed to be alive.  But it has left civilians facing acute shortages as supplies dwindle. UN human rights chief Volker Turksay warned the blockade meant there was \"a high and increasing risk\" that Israel is committing war crimes in Gaza. Meanwhile, Tom Fletcher, UN under-secretary-general for Humanitarian Affairs told Sky's The World With Yalda Hakim that there was \"a deliberate policy of withholding aid in order to put pressure on the people of Gaza\". Hamas is demanding the release of more Palestinian prisoners, a lasting ceasefire and an Israeli pullout from Gaza. The group has rejected demands that it lay down its arms or leave the territory.  Read more from Sky News:Analysis: Gaza aid workers' deathsWhat happened to the ceasefire?Gaza protests explained In recent days, the IDF has been under international scrutiny after opening fire on ambulances, which it claimed were operating suspiciously. UN officials say 15 Palestinian medics and emergency responders were killed in the attack in southern Gaza in March, then buried by Israeli troops in a mass grave. On Wednesday, Israel struck what it said were Hamas militants in a \"command and control centre\". At least 17 people died at a former UN clinic in the Jabalia refugee camp, which was being used as a shelter. Israel's war in Gaza began when Hamas-led militants attacked southern Israel on 7 October 2023, killing around 1,200 people, mostly civilians, and taking 251 hostages. Israel has killed more than 50,000 Palestinians, according to Gaza's health ministry, while Israel says it has killed around 20,000 militants."
    },
    {
        "title": "UK in talks with Brazil over 'potential sale' of two Royal Navy amphibious assault ships",
        "description": "The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed.",
        "url": "https://news.sky.com/story/uk-in-talks-with-brazil-over-potential-sale-of-two-royal-navy-amphibious-assault-ships-13341476",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-hms-bulwark-navy-military_6752891.jpg?20241120142942",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-04-03 21:52:00",
        "Headline": "Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget, even though Sir Keir Starmer keeps talking up his promises to boost expenditure.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK is in talks with Brazil over the \"potential sale\" of the Royal Navy's two amphibious assault ships that are being ditched to cut costs, the Ministry of Defence has confirmed. Defence experts said the fact HMS Bulwark - which has only just received an expensive refit - and HMS Albion are being flogged off underlines the pressure on the defence budget even though Sir Keir Starmer keeps talking up his promises to boost expenditure. The two warships can be used to deploy Royal Marines to shore - a vital capability at a time of growing global threats. News of the possible sale was first revealed in Latin American media. One report said the Royal Navy and Brazilian Navy had signed an agreement that would see the UK giving information to the Brazilians on the state of the two ships prior to any purchase. Asked about the claim that the UK would sell the assault ships to Brazil, a Ministry of Defence spokesperson said: \"We can confirm we have entered discussions with the Brazilian Navy over the potential sale of HMS Bulwark and HMS Albion. \"As announced in November, both ships are being decommissioned from the Royal Navy. Neither were planned to go back to sea before their out of service dates in the 2030s.\" \n                  Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot\n                 \n                  Football fans join with pensioners to clash with police in protest at austerity in Argentina\n                 \n                  Charlotte Peet: Brazilian authorities 'visiting locations' in search for missing British journalist\n                 James Cartlidge, the shadow defence secretary, appeared to question the wisdom of the move. \"At Defence orals [House of Commons questions] on January 6th Defence Secretary John Healey said: 'HMS Bulwark and HMS Albion were not genuine capabilities',\" Mr Cartlidge wrote in a post on social media. \"They've just been sold to Brazil.\" Matthew Savill, the director of military science at the Royal United Services Institute, said the plan to sell the vessels demonstrates there \"is still life in both these ships\". He said: \"The fact that the UK is prepared to sell off useful amphibious capability - which could be used in evacuation operations or other cases where air transport is difficult - shows just how tight finances are even with the promised budget increase. \"The replacements for these ships are still several years away and won't be available until the 2030s.\" Read more from Sky News:Prince Harry's charity row explainedUS seems content to cosy up to Russia instead of imposing tariffs Mr Savill added: \"As an aside, Brazil will probably have greater amphibious capacity than the UK, having previously bought HMS Ocean, the UK's helicopter assault ship.\" HMS Albion and HMS Bulwark entered service two decades ago. Both are currently held at lower readiness having not been to sea since 2023 and 2017 respectively. HMS Ocean, a helicopter-landing vessel and once the largest warship in the Royal Navy, was sold to the Brazilian Navy in 2018 after 20 years in service."
    },
    {
        "title": "Island home only to penguins hit by tariffs - and other things you may have missed on 'Liberation Day'",
        "description": "No one expected penguins to bear the brunt of Liberation Day.&#160;",
        "url": "https://news.sky.com/story/island-home-only-to-penguins-hit-by-tariffs-and-other-things-you-may-have-missed-on-liberation-day-13340958",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-penguin_6874944.jpg?20250403134259",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-03 07:57:00",
        "Headline": "The EU hates \"beautiful\" American beef, Donald Trump won't stand for plastic eggs and penguins face higher costs to sell goods to the US. Some of the things you might have missed on Liberation Day...",
        "Content": "No one expected penguins to bear the brunt of Liberation Day.  But among the barrage of tariffs set out by Donald Trump, the US also took aim at uninhabited islands, talked up American beef and turned its nose up at plastic eggs. Here is what you might have missed in the US leader's expansive announcement. Trump latest: Follow live updates  Tiny territories hit with big tariffs At first glance, newly imposed tariffs on countries such as China, the European Union, India and the UK stand out - ranging from 34% to 10% respectively. But the president also imposed tariffs on dozens of tiny territories - some of which don't even have human inhabitants. One of those was the Heard and McDonald Islands, an external territory of Australia in the Antarctic that is inhabited only by penguins and seals. Despite having no human residents - or imports and exports - the island now faces a 10% tariff for any goods bound for the US. According to export data from the World Bank, the US imported $1.4m (£1m) of mainly \"machinery and electrical\" products from Heard Island and McDonald Islands in 2022. Australian territory Norfolk Island, a volcanic island 600 miles east of Queensland, was also hit with a hefty 29% tariff on exports to the US. That's much higher than mainland Australia, which had a 10% tariff imposed. The news was met with confusion by some of Norfolk Island's 2,188 residents. \"Norfolk Island is a little dot in the world,\" Richard Cottle, owner of a concrete-mixing business on the island, said on Thursday. \"We don't export anything. It was just a mistake\".  Although the island does ship a modest amount of Kentia palm seeds abroad, this is typically worth less than $1m (£760,000) a year, with the products mostly going to Europe. According to US government data, America has recorded trade deficits with Norfolk Island for the past three years. Other tiny nations and territories were also hit with 10% tariffs, including Tokelau, a dependent territory of New Zealand, with a population of around 1,600 people, and the Cocos Islands, another territory of Australia, home to around 600 people. Australian Prime Minister Anthony Albanese told reporters he had no explanation for the tariffs, calling them \"unexpected\" and \"a bit strange\". 'Our beef is beautiful, theirs is weak' After announcing a 20% tariff against the European Union, Mr Trump's secretary of commerce Howard Lutnick spoke to Fox News to try to explain what was behind the decision. In a brief but bizarre rant, Mr Lutnick spoke about the bloc's ban on imported chicken from the US. \"I mean European Union won't take chicken from America,\" he said. \"They will take lobsters from America... they hate our beef because our beef is beautiful and theirs is weak.\" The EU has a ban on chicken washed in chlorine - a practice that is approved by the United States Department of Agriculture. Although US beef is not completely prohibited in Europe, any beef that has been treated with artificial growth hormones - which is legal in the US and common among producers - is banned by the EU. Why was Russia exempt? Russia was not on Mr Trump's tariff list, despite his threat to introduce some on Russian oil imports last week. The US president made the threat after telling NBC's Kirsten Welker he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's president Volodymyr Zelenskyy, as fragile peace negotiations are ongoing. Read more:World leaders react to Trump's tariff announcementDo Trump's 'Liberation Day' tariff numbers add up? Mr Trump said that if Russia was unable to make a deal on \"stopping bloodshed in Ukraine\" - and Mr Trump felt that Moscow was to blame - then he would put secondary tariffs on \"all oil coming out of Russia\". \"That would be that if you buy oil from Russia, you can't do business in the United States. There will be a 25% tariff on all oil, a 25 to 50-point tariff on all oil,\" he said. Axios reported that White House press secretary Karoline Leavitt told the publication on Wednesday that Russia was left off the tariffs list because US sanctions already \"preclude any meaningful trade\". Russia ran a $2.5bn goods trade surplus with the US in 2024, according to the US Trade Representative's office, falling from $35bn in 2021 as a result of sanctions put in place due to the war in Ukraine. World's poorest nations face highest tariffs Many of Mr Trump's tariffs have targeted the world's poorest countries. Lesotho in southern Africa, listed as the 22nd poorest country in the world, has been slapped with the highest duty of 50%. It primarily exports diamonds and garments, with the US as one of the top five exporting destinations, Sky News' US partner network NBC News reported. The second-highest tariff went to Cambodia at 49%, even though the US is Cambodia's largest single-country export destination. Madagascar in east Africa, the world's ninth poorest country, will face 47% reciprocal tariffs. It primarily exports vanilla, cloves, and garments, with the US among the top five countries it exports to, according to NBC. 'Huge complexities' for Northern Ireland and the Republic Under the 10% tariff imposed on the UK, Northern Irish goods will also be covered at the same rate. Whereas the Republic of Ireland will subject to a 20% tariffs - which Mr Trump imposed on the entirety of the EU. Reacting to the announcement, Ireland deputy premier Simon Harris said the tariff difference would create \"huge complexities\" for products that need to be carried across the border during production. He said the issues were similar to those at play during the Brexit debate around maintaining a frictionless land border on the island of Ireland. Mr Harris said it was on the US to \"outline their understanding\" on how the 10% differential between Northern Ireland and Ireland will play out. Trump defines groceries  As has become common when delivering major addresses, the US president repeatedly deviated from his script. At one point, he took time to define the word groceries: \"It's a bag with a lot of different things in it.\" He went on to describe the word as \"old-fashioned\" but \"beautiful\". 'Could you use plastic eggs?' In another part of his wide-ranging speech, Mr Trump got onto the topic of eggs - the price of which reached an all-time high earlier this year in the US due to the outbreak of bird flu. On Wednesday, Mr Trump confirmed that the annual White House tradition of rolling around 30,000 Easter eggs across the South Lawn is expected to proceed, and will use real eggs, despite pleas for plastic ones to be used instead. \"They were saying that for Easter 'Please don't use eggs. Could you use plastic eggs?' I say, we don't want to do that,\" Mr Trump said. He did not clarify who was telling him not to use real eggs."
    },
    {
        "title": "Japanese politician receives over 8,000 death threats after proposing free sanitary products in toilets",
        "description": "A Japanese politician says she received more than 8,000 death threats after proposing free sanitary pads in public toilets.",
        "url": "https://news.sky.com/story/japanese-politician-receives-over-8000-death-threats-after-proposing-free-sanitary-products-in-toilets-13341044",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ayaka-yoshida_6874774.jpg?20250403103845",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-03 09:16:00",
        "Headline": "Ayaka Yoshida, a 27-year-old member of the Japanese Communist Party, says she was \"scared\" after being bombarded by the thousands of messages  within a four-day period. ",
        "Content": "A Japanese politician says she received more than 8,000 death threats after proposing free sanitary pads in public toilets. Ayaka Yoshida, a 27-year-old member of the Japanese Communist Party, posted on X on 25 March that she had \"suddenly got my period today and it was a problem\". She added: \"Unfortunately, there were no napkins in the bathroom at Tsu City Hall when I stopped by. \"I couldn't deal with it properly until I got home. Even at 27 years old, this happens. \"I want sanitary napkins to be available everywhere, like toilet paper.\" Ms Yoshida, who is a member of the prefectural assembly in Mie in central Japan, added in a separate post the same day: \"I recall that when a question was asked at the city council about installing them at city hall as well, the city authorities were reluctant\". The Mie prefectural assembly later received more than 8,000 death threat emails directed at Ms Yoshida from Friday 28 March, the South China Morning Post reports. \n                  Court confirms sacking of South Korean president who declared martial law\n                 \n                  Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs\n                 \n                  Trump's tariffs are about something more than economics: power\n                 All the emails came from one address and carried an identical message, according to the Mainichi newspaper in Japan. It reportedly read: \"I will kill assembly member Ayaka Yoshida, who does not bring emergency napkins with her while being old enough to know better!\" Ms Yoshida shared a post on X on 31 March saying she had received more than 8,000 deaths and added: \"I felt scared\". Read more from Sky News:Do Trump's tariff numbers add up?Gaza ambulance 'crushed' by IDFEmma Raducanu pulls out of GB squad The politician reportedly told a news conference that the threats had \"the effect of intimidating me and suppressing my activities as a prefectural assembly member\". Ms Yoshida is also said to have confirmed that she had filed a complaint with police and an investigation is under way. Chisato Kitanaka, an associate professor of sociology at Hiroshima University and an adviser in the university's harassment consultation office, has told This Week in Asia that abusive messages targeting women who speak out are becoming more common in Japan. She said: \"We are seeing similar things happening time and time again. \"Any time that a statement is made or a proposal is written by a female politician, they are almost always attacked.\" Ms Kitanaka added that topics that have sparked a backlash online include support for working mothers, women's health, shortages of places at nurseries, sexual violence in Japanese society and domestic violence."
    },
    {
        "title": "Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs",
        "description": "Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession.",
        "url": "https://news.sky.com/story/stock-markets-suffer-sharp-drops-after-donald-trump-announces-sweeping-tariffs-13341308",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6873959.jpg?20250402152646",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-03 15:35:00",
        "Headline": "All three of the US's major markets opened to sharp losses on Thursday morning. By the end of trading, both the Nasdaq and Dow Jones had experienced their worst one-day loss since the COVID-19 pandemic.",
        "Content": " Stock markets around the world fell on Thursday after Donald Trump announced sweeping tariffs - with some economists now fearing a recession. The US president announced tariffs for almost every country - including 10% rates on imports from the UK - on Wednesday evening, sending financial markets reeling. While the UK's FTSE 100 closed down 1.55% and the continent's STOXX Europe 600 index was down 2.67% as of 5.30pm, it was American traders who were hit the most. Trump tariffs latest: US stock markets tumble All three of the US's major markets opened to sharp losses on Thursday morning. By 8.30pm UK time (3.30pm EST), The Dow Jones Industrial Average was down 3.7%, the S&P 500 opened with a drop of 4.4%, and the Nasdaq composite was down 5.6%. Compared to their values when Donald Trump was inaugurated, the three markets were down around 5.6%, 8.7% and 14.4%, respectively, according to LSEG. \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 \n                  Ex-DUP leader Sir Jeffrey Donaldson to face trial over 18 sex offence allegations\n                 \n                  Ex-DUP leader Jeffrey Donaldson in court charged with rape - his wife charged with aiding him\n                 Worst one-day losses since COVID As Wall Street trading ended at 9pm in the UK, two indexes had suffered their worst one-day losses since the COVID-19 pandemic. The S&P 500 fell 4.85%, the Nasdaq dropped 6%, and the Dow Jones fell 4%. It marks Nasdaq's biggest daily percentage drop since March 2020 at the start of COVID, and the largest drop for the Dow Jones since June 2020.  'Trust in President Trump' White House press secretary Karoline Leavitt told CNN earlier in the day that Mr Trump was \"doubling down on his proven economic formula from his first term\". \"To anyone on Wall Street this morning, I would say trust in President Trump,\" she told the broadcaster, adding: \"This is indeed a national emergency... and it's about time we have a president who actually does something about it.\" Later, the US president told reporters as he left the White House that \"I think it's going very well,\" adding: \"The markets are going to boom, the stock is going to boom, the country is going to boom.\" He later said on Air Force One that the UK is \"happy\" with its tariff - the lowest possible levy of 10% - and added he would be open to negotiations if other countries \"offer something phenomenal\".  Economist warns of 'spiral of doom' The turbulence in the markets from Mr Trump's tariffs \"just left everybody in shock\", Garrett Melson, portfolio strategist at Natixis Investment Managers Solutions in Boston, told Reuters. He added that the economy could go into recession as a result, saying that \"a lot of the pain, will probably most acutely be felt in the US and that certainly would weigh on broader global growth as well\". Meanwhile, chief investment officer at St James's Place Justin Onuekwusi said that international retaliation is likely, even as \"it's clear countries will think about how to retaliate in a politically astute way\". He warned: \"Significant retaliation could lead to a tariff 'spiral of doom' that could be the growth shock that drags us into recession.\" Read more:Do Trump's 'Liberation Day' tariff numbers add up?Tariffs about something more than economics: power It comes as the UK government published a long list of US products that could be subject to reciprocal tariffs - including golf clubs and golf balls. Running to more than 400 pages, the list is part of a four-week-long consultation with British businesses and suggests whiskey, jeans, livestock, and chemical components. Meanwhile, Prime Minister Sir Keir Starmer said on Thursday that the US president had launched a \"new era\" for global trade and that the UK will respond with \"cool and calm heads\". It also comes as Canadian Prime Minister Mark Carney announced a 25% tariff on all American-imported vehicles that are not compliant with the US-Mexico-Canada trade deal. He added: \"The 80-year period when the United States embraced the mantle of global economic leadership, when it forged alliances rooted in trust and mutual respect and championed the free and open exchange of goods and services, is over. This is a tragedy.\""
    },
    {
        "title": "Trump's tariffs are about something more than economics: power",
        "description": "Tanking stock markets, collapsing world orders, devastating trade wars; economists with their hair ablaze are scrambling to keep up.",
        "url": "https://news.sky.com/story/trumps-tariffs-are-about-something-more-than-economics-power-13341209",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-washington-donald-trump_6874616.jpg?20250403074844",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-03 12:33:00",
        "Headline": "Above all, tariffs give Donald Trump power. They strike fear into allies and enemies, from governments to corporations. This is a president who runs his presidency like a medieval emperor or mafia don.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Tanking stock markets, collapsing world orders, devastating trade wars; economists with their hair ablaze are scrambling to keep up. But as we try to make sense of Donald Trumps's tariff tsunami, economic theory only goes so far. In the end this surely is about something more primal. Power. Understanding that may be crucial to how the world responds. Yes, economics helps explain the impact. The world's economy has after all shifted on its axis, the way it's been run for decades turned on its head. Instead of driving world trade, America is creating a trade war. We will all feel the impact.  Donald Trump says he is settling scores, righting wrongs. America has been raped, looted and pillaged by the world trading system. \n                  Stock markets suffer sharp drops after Donald Trump announces sweeping tariffs\n                 \n                  Pentagon's acting inspector general will review Pete Hegseth's use of Signal for Houthi airstrike plans\n                 \n                  'A genius actor', 'firecracker', and 'my friend': Tributes paid to Top Gun star Val Kilmer\n                 But don't be distracted by the hyperbole - and if you think this is about economics alone, you may be missing the point. Above all, tariffs give Donald Trump power. They strike fear into allies and enemies, from governments to corporations. This is a president who runs his presidency like a medieval emperor or mafia don. It is one reason why since his election we have seen what one statesman called a conga line of sycophants make their way to the White House, from world leaders to titans of industry. The conga line will grow longer as they now redouble their efforts hoping to special treatment from Trump's tariffs. Sir Keir Starmer among them. President Trump's using similar tactics at home, deploying presidential power to extract concessions and deter dissent in corporate America, academia and the US media. Those who offer favours are spared punishment. His critics say he seeks a form power for the executive or presidential branch of government that the founding fathers deliberately sought to prevent. Whether or not that is true, the same playbook of divide and rule through intimidation can now be applied internationally. Thanks to tariffs Each country will seek exceptions but on Trump's terms. Those who retaliate may meet escalation. This is the unforgiving calculus for governments including our own plotting their next moves. The temptation will be to give Trump whatever he wants to spare their economies, but there is a jeopardy that compounds the longer this goes on. Read more:Do Trump's numbers on tariffs really add up?Trump hits island home only to penguins with 10% tariffs Malcolm Turnbull, the former Australian prime minister who coined the conga line comparison, put it this way: \"Pretty much all the international leaders I have seen that have sucked up to Trump have been run over. The reality is if you suck up to bullies, whether it's global affairs or in the playground, you just get more bullying.\" Trading partners may be able to mitigate the impact of these tariffs through negotiation, but that may only encourage this unorthodox president to demand ever more? Ultimately the world will need a more reliable superpower than that. In the hands of such a president, America cannot be counted on. When it comes to security, stability and prosperity, allies will need to fend for themselves. And they will need new friends. If Washington can't be relied on, Beijing beckons. America First will, more and more, mean America on its own."
    },
    {
        "title": "Pentagon's acting inspector general will review Pete Hegseth's use of Signal for Houthi airstrike plans",
        "description": "The Pentagon's acting inspector general said he will review Pete Hegseth's use of the Signal messaging app after the US defence secretary used it to discuss airstrike plans.",
        "url": "https://news.sky.com/story/pentagons-acting-inspector-general-will-review-pete-hegseths-use-of-signal-for-houthi-airstrike-plans-13341385",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pete-hegseth-us-defense-secretary_6826619.jpg?20250212144334",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-03 19:09:00",
        "Headline": "The Atlantic's editor-in-chief Jeffery Goldberg reported last month that US defence secretary Pete Hegseth posted operational details of a planned airstrike on Houthi militants in Yemen, including weapon packages, targets and timing.",
        "Content": " The Pentagon's acting inspector general said he will review Pete Hegseth's use of the Signal messaging app after the US defence secretary used it to discuss airstrike plans. The review will also look at other defence officials' use of the publicly available encrypted app - which is not able to handle classified material and is not part of the US government's secure network. Last month, The Atlantic's editor-in-chief Jeffery Goldberg said he was added to a group chat on the platform by national security adviser Mike Waltz called \"Houthi PC small group\", where plans to launch a strike on the Yemen militants were discussed. Read more: What was said in Trump officials' group chat The journalist wrote that Mr Hegseth posted operational details of the plan, including weapon packages, targets and timing, into the group chat - which included vice president JD Vance and other officials. The defence secretary initially told reporters no one had texted war plans, and US President Donald Trump said the texting of sensitive plans was \"the only glitch in two months\" and a non-issue.  On Thursday, acting inspector general Steven Stebbins told Mr Hegseth in a notification letter that he will be reviewing the defence secretary and other defence officials' use of Signal. \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 \n                  US seems content to cosy up to Russia instead of imposing tariffs\n                 \n                  There were no winners from Trump's tariff gameshow\n                 \"The objective of this evaluation is to determine the extent to which the Secretary of Defense and other DoD [Department of Defense] personnel complied with DoD policies and procedures for the use of a commercial messaging application for official business,\" he wrote. \"Additionally, we will review compliance with classification and records retention requirements.\" Read more from Sky News:US seems content to cosy up to Russia instead of imposing tariffsThere were no winners from Trump's tariff gameshow The review was launched at the request of Republican Senator Roger Wicker and Democratic Senator Jack Reed, chairman and member of the Senate Armed Services Committee, respectively. Mr Trump was urged to fire Mr Hegseth following The Atlantic's reports. On Monday, Sky's US partner network NBC News reported that White House press secretary Karoline Leavitt said the \"case has been closed here\"."
    },
    {
        "title": "Seven killed as thunderstorms and tornadoes rip through US states",
        "description": "At least seven people have been killed after thunderstorms and tornadoes swept through several US states &#8211; with forecasters warning record rainfall could soon follow in some regions.",
        "url": "https://news.sky.com/story/seven-killed-as-thunderstorms-and-tornadoes-rip-through-us-states-13341376",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tornado-tennessee-us_6875196.jpg?20250403193805",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-03 18:40:00",
        "Headline": "More than 90 million people are at risk of severe weather, forecasters say, while 1.3 million people living near a stretch of the Mississippi River have been warned they could face \"once in a lifetime\" rainfall.",
        "Content": " At least seven people have been killed after thunderstorms and tornadoes swept through several US states – with forecasters warning record rainfall could soon follow in some regions. A man and his teenage daughter, whose home was destroyed in western Tennessee, were among the dead, along with a man whose pickup truck struck downed powerlines in Indiana. Fatalities were also reported in Missouri as the first in a series of forecast storms ripped across the country on Wednesday and early Thursday. Thousands of properties have been left without power, with some homes also destroyed. Trump tariffs latest - Percy Pig for the chop? Some debris was launched nearly five miles (8km) above the ground in Arkansas. In Lake City, Arkansas, a tornado took the roofs off homes, demolished brick walls and tossed cars into trees. Worse may be to come for parts of Arkansas, Tennessee, and Kentucky, the Weather Prediction Centre in Maryland said. A stretch of the Mississippi River around Memphis, where more than 1.3 million people live, is set to bear the brunt. In total, more than 90 million people have been at risk of severe weather – from Texas to Minnesota and Maine, according to the Oklahoma-based Storm Prediction Centre. Prolonged heavy rains are forecast for the central US, and will bring \"significant, life-threatening flash flooding\" each day, the National Weather Service warned. The sustained downpour could bring more than a foot (30cm) of rain over the next four days, described by the weather service as a \"once in a generation to once in a lifetime\" event. It warned that \"historic rainfall totals and impacts are possible.\" The Federal Emergency Management Agency said it was ready to distribute food, water, cots, generators, and meals. So many tornado warnings were issued in the Tennessee capital, Nashville, overnight that the batteries of some sirens in the city were drained, fire officials said. People were rescued from floodwater on Thursday in flooded parts of the city, which is braced for days of rain. Historic amounts of rain and flooding are also expected in western Kentucky in places that do not normally get overwhelmed by water, state governor Andy Beshear said. Read more:Trump's real objective? PowerThe Boss releases seven new albumsRichest billionaires named The forecasts have been especially worrying for people in rural areas of the state, where floodwaters can quickly rush off the mountains into the hollows. Less than four years ago, dozens died in flooding across eastern Kentucky. Warm temperatures, an unstable atmosphere, strong wind shear and abundant moisture streaming in from the Gulf are responsible for the conditions, forecasters said."
    },
    {
        "title": "Tom Cruise leads moment of silence in tribute to 'dear friend' Val Kilmer",
        "description": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\".",
        "url": "https://news.sky.com/story/tom-cruise-leads-moment-of-silence-in-tribute-to-dear-friend-val-kilmer-13341470",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tom-cruise-las-vegas_6875358.jpg?20250403224056",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-03 21:28:00",
        "Headline": "The Mission Impossible star called for a moment of silence at a film event in Las Vegas. He said his Top Gun co-star \"gave a lot to all of us\" and asked the audience to \"think about all the wonderful times that we had with him\".",
        "Content": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\". Cruise, speaking at the CinemaCon film event in Las Vegas on Thursday, asked for a moment's silence to reflect on the \"wonderful\" times shared with the star, whom he called a \"dear friend\". Kilmer, who died of pneumonia on Tuesday aged 65, rocketed to fame starring alongside Cruise in the 1986 blockbuster Top Gun, playing Tom 'Iceman' Kazansky, a rival fighter pilot to Cruise's character Maverick. His last part was a cameo role in the 2022 blockbuster sequel Top Gun: Maverick. Cruise, on stage at Caesars Palace on Thursday, said: \"I'd like to honour a dear friend of mine, Val Kilmer. I can't tell you how much I admire his work, how grateful and honoured I was when he joined Top Gun and came back later for Top Gun: Maverick. \"I think it would be really nice if we could have a moment together because he loved movies and he gave a lot to all of us. Just kind of think about all the wonderful times that we had with him. \"I wish you well on the next journey.\" The moment of silence followed a string of tributes from Hollywood figures including Cher, Francis Ford Coppola, Antonio Banderas and Michelle Monaghan. Kilmer's daughter Mercedes told the New York Times on Wednesday that the actor had died from pneumonia. Diagnosed with throat cancer in 2014, Kilmer discussed his illness and recovery in his 2020 memoir Your Huckleberry and Amazon Prime documentary Val. He underwent radiation and chemotherapy treatments for the disease and also had a tracheostomy which damaged his vocal cords and permanently gave him a raspy speaking voice. Kilmer played Batman in the 1995 film Batman Forever and received critical acclaim for his portrayal of rock singer Jim Morrison in the 1991 movie The Doors. Read more from Sky News:Tributes to 'genius' KilmerRichest billionaires namedSpringsteen's seven new albums He also starred in True Romance and Kiss Kiss Bang Bang, as well as playing criminal Chris Shiherlis in Michael Mann's 1995 movie Heat and Doc Holliday in the 1993 film Tombstone. In 1988 he married British actress Joanne Whalley, whom he met while working on fantasy adventure Willow. The couple had two children before divorcing in 1996."
    },
    {
        "title": "Do Trump's 'Liberation Day' tariff numbers add up?",
        "description": "Donald Trump's Rose Garden \"Liberation Day\" moment was a set piece event for the ages - an historic day he believes will kickstart a gradual American revival.",
        "url": "https://news.sky.com/story/do-trumps-tariff-numbers-add-up-after-liberation-day-announcement-13340903",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-us_6874318.jpg?20250402220839",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-04-03 06:13:00",
        "Headline": "On what US President Donald Trump branded \"Liberation Day\", he unleashed a barrage of tariffs on trade allies and enemies alike. Standing in the White House Rose Garden, he held up a board, proudly showing off the tariffs to the world.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Donald Trump's Rose Garden \"Liberation Day\" moment was a set piece event for the ages - an historic day he believes will kickstart a gradual American revival. But at what immediate cost for the American people and countries globally? And was it all a deceptive con? Trump latest: Tariffs a 'major blow to world economy' It was, for sure, an expert-defying exercise in Trumponomics. For decades, the president said, the US \"has been looted, pillaged, raped and plundered by nations near and far, both friend and foe alike\". He relished in the big reveal - giant charts in which the global interdependent economic ecosystem, built over decades, was simplified into two columns and a set of percentages. In the first column, the tariffs Trump says are charged to America, calculated by very questionable White House arithmetic. And in the next column, what Trump's America will now levy. He relished in what he saw in front of him. It felt like he was seeing some of the numbers for the first time. \"China, first row…\" he said. \"European Union, they're very tough… Vietnam… Taiwan… Japan… India, very very tough… Indonesia, Malaysia, Cambodia - ooh look at Cambodia, look, at 97%!\" he said. His commerce secretary, next to him, smiled with delight. Some of the world's poorest countries - with their own barriers in place surely only to protect their fledgling economies - will be hit so hard having already been crippled by the USAID cuts. Beyond the Trumponomics though, there was also a distinct air of deception about it all. Precisely how had his team calculated their numbers? Take South Korea, with which the US has a trade agreement. It is not charging a 50% tariff on US exports as Trump's charts claim. Is the EU really charging America a 39% tariff? No. Team Trump's maths adds undisclosed \"currency manipulation\" calculations and non-tariff barriers (of which the EU has many, to be fair) to the calculations. But the numbers and the arithmetic are still hard to explain. Read more:Trump tariff saga far from over'Liberation Day' explainedWhat Sky correspondents make of Trump's tariffs A diamond industry in Pennsylvania Take the tiny African nation of Lesotho (the place Trump recently said he'd never heard of). It's been hit with the top rate of 50% tariffs based on a wild claim that it levies the US at 99%. In fact, it's part of a southern African trade pact with other nations which have been levied at lower levels. Lesotho's textile industry is heavily reliant on US exports. It's a country where 56.2% of the population lives on less than $3.65 a day, according to the World Bank. You don't need to 'do the maths' to see the impact. Nearly half of Lesotho's exports are diamonds. Trump's driver for all this is to bring manufacturing back home. Is his sledgehammer on Lesotho going to conjure up a diamond industry in Pennsylvania? The same principle could be applied elsewhere, like Indonesia and coffee. How's the coffee growing trade in America? You get the idea. The White House arithmetic seems to be based simply on trade deficit calculations which themselves are the consequence of supply and demand.  👉 Follow Trump 100 on your podcast app 👈 \"China, first row ...\" China is another focus. The Trump announcement will mean a 34% levy added to the 20% already in place. So Chinese goods will cost Americans more than 50% more, assuming the price is passed onto the customer. The impact within China will be huge too. A 'special relationship' On a day which was, for the world beyond Trump's America, bad all round, it was for the UK - in the end - as good as it could be. The baseline 10% tariff for Britain is being seen as encouraging by Downing Street. The British government believes it's ahead of most of the world in its negotiations for a deal to eliminate tariffs. Over the past few weeks, it's already offered proposals to placate Donald Trump. The hope was that it would yield results before today. Now they will negotiate hard and fast to chip away at the 10%.  The 'special relationship' will do some heavy lifting."
    },
    {
        "title": "There were no winners from Trump's tariff gameshow",
        "description": "Donald Trump flourished his list of tariffs like a gameshow host in the White House Rose Garden on Wednesday &#8211; but there were no winners from the president's made-for-TV show of economic strength.",
        "url": "https://news.sky.com/story/there-were-no-winners-from-trumps-tariff-gameshow-13341299",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-rose-garden_6875092.jpg?20250403171144",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-04-03 15:08:00",
        "Headline": "The president's made-for-TV spectacle in the White House Rose Garden has led to jeopardy for all – the US included. The question now is how the rest of the world should respond.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Donald Trump flourished his list of tariffs like a gameshow host in the White House Rose Garden on Wednesday – but there were no winners from the president's made-for-TV show of economic strength. The price was wrong for everyone and there is jeopardy for all, the US included. From Asian nations in the engine room of global consumer manufacturing, facing tariffs above 40%, to the UK, handed the base rate of 10% alongside a host of nations including a group of uninhabited Antarctic islands, the terms of trade have fundamentally changed. Trump tariffs latest: US stock markets tumble The question now is what impact the tariffs will have locally, regionally and globally; and what nations should do in response. The penguins of the Heard and McDonald Islands may be able to move on with a shrug, but not so Britain, where months of diplomatic effort concentrated on the Trump regime has delivered only the knowledge that it could have been worse. The impact is hard to assess definitively, not least because nothing quite like this has ever happened in the era of trade liberation. Mr Trump has stuck a spoke in the wheel of the global consensus, that ever-freer trade is good for everyone.  The Office for Budget Responsibility has hazarded a guess that a trade war could wipe 1% off UK GDP, worth around £33bn. What is clear is that the impact will be diverse and multi-level. The direct impact will be felt hardest by the largest goods exporters. Car manufacturers face a huge blow, with 25% tariffs on the luxury vehicles Britain still does well adding a cost to US consumers, who account for 18% of the sector's exports, worth around £8bn. The pharmaceutical industry has much to lose too, though exports worth almost £9bn in 2023 appeared to have a stay of execution thanks to a clause in Trump's executive order. For the manufacturing industry, the tariffs will be \"devastating\", according to the trade body Make UK, with second-round effects almost as damaging as the 10% notionally paid by US consumers. Read more:World leaders react to Trump's announcementDo Trump's 'Liberation Day' numbers add up? The UK may have left the EU but British industry still does a huge amount of business feeding supply chains for European products now subject to a 20% levy. Anyone toasting a \"Brexit benefit\" from the EU's misfortune still fails to understand the interconnectedness of our commercial relations. Add the general cooling of the global economy caused by the richest nation on Earth's demand to be made wealthier still, and it is a grim outlook. What is to be done? All of which begs the second question, what to do? The UK's mantra has been to remain pragmatic and calm in response, while continuing to seek an \"economic agreement\" with the US that includes an easing of tariffs. Business Secretary Jonathan Reynolds showed a little mettle in Parliament, and a slight hardening of the UK line, by announcing a consultation with businesses over potential retaliatory tariffs.  Some sectors would like to see a muscular response, with the steel industry anxious that, in the event of a global trade war, a neutral UK would become a target for the \"dumping\" of cheap steel from exporters priced out of the US and EU. Sectoral specifics aside, the truth is that the UK has limited ammunition in a trade war with the US. We buy around £60bn of goods, with machinery, fuels and chemicals, alongside Harley Davidson motorbikes and bottles of Jack Daniel's, but the bulk of our trade is in services, professional skills flowing west and big tech coming the other way. The digital services tax, currently extracting around £800m a year from US tech companies, is one chip Britain has to play in negotiations. Some might call that a small price to pay to support the car industry, while others would see capitulation to social media giants and their billionaire backers. As a senior cabinet minister put it shortly before Mr Trump's election: \"As a small nation outside a major trading bloc, getting involved in a trade war does not make a lot of sense.\" It was sound logic then and now. Unless the host of Trump Tariffs changes his tune, damage limitation may be the only prize on offer."
    },
    {
        "title": "Trump trade war escalation sparks global market sell-off ",
        "description": "Donald Trump's trade war escalation has sparked a global sell-off, with US stock markets seeing the biggest declines in a hit to values estimated above $2trn.",
        "url": "https://news.sky.com/story/trump-trade-war-escalation-sparks-global-market-sell-off-13341274",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wall-street_6875013.jpg?20250403150624",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-03 13:35:00",
        "Headline": "Investors around the world see only pain ahead as the big expansion of tariffs by the US president threatens a tit-for-tat trade war that could choke the global economy.",
        "Content": "Donald Trump's trade war escalation has sparked a global sell-off, with US stock markets seeing the biggest declines in a hit to values estimated above $2trn. Tech and retail shares were among those worst hit when Wall Street opened for business, following on from a flight from risk across both Asia and Europe earlier in the day. Analysis of FTSE All World data by the investment platform AJ Bell on Thursday evening put the value of the peak losses among indices at $2.2trn (£1.7trn). The tech-focused Nasdaq Composite was down 5.8%, the S&P 500 by 4.3% and the Dow Jones Industrial Average by just under 4% at the height of the declines. It left all three on course for their worst one-day losses since September 2022 though the sell-off later eased back slightly. Trump latest: UK considers tariff retaliation Analysts said the focus in the US was largely on the impact that the expanded tariff regime will have on the domestic economy. But there was also concern related to the effects on global sales given widespread anger abroad among the more than 180 nations and territories hit by reciprocal tariffs on Mr Trump's self-styled \"liberation day\". They are set to take effect next week, with tariffs on all car, steel and aluminium imports already in effect. Price rises are a certainty in the world's largest economy as the president's additional tariffs kick in, with those charges expected to be passed on down supply chains to the end user. The White House believes its tariffs regime will force employers to build factories and hire workers in the US to escape the charges.  But economists warn the additional costs will add upwards pressure to US inflation and potentially choke demand and hiring, risking a slide towards recession. Apple was among the biggest losers in cash terms in Thursday's trading as its shares fell 9%, leaving it on track for its worst daily performance since the start of the COVID pandemic. Concerns among shareholders were said to include the prospects for sales, especially in the US where price hikes were likely when its products were shipped to the US from manufacturers in Asia and subjected to the tariffs. Other notable losers included Tesla, down by almost 6% and Nvidia down by more than 6%.  Many retail stocks including those for Target and Footlocker lost more than 10% of their respective market values. The European Union is expected to retaliate in a bid to put pressure on the US to back down. The prospect of a tit-for-tat trade war saw the CAC 40 in France and German DAX fall by more than 3.4% and 3% respectively. The FTSE 100, which is internationally focused, was 1.6% lower by the close - a three-month low. Financial stocks were worst hit with Asia-focused Standard Chartered bank enduring the worst fall in percentage terms of 13%, followed closely by its larger rival HSBC. Among the stocks seeing big declines were those for big energy as oil Brent crude costs fell back by 6% to $70 due to expectations a trade war will hurt demand. The more domestically relevant FTSE 250 was 2.2% lower as the effects of the trade war were weighed, with some projections seeing hits to UK growth of more than 0.5% despite the country escaping the worst of the US tariff penalties and remaining on the fence in terms of retaliation. A weakening dollar saw the pound briefly hit a six-month high against the US currency at $1.32. There was a rush for safe haven gold earlier in the day as a new record high was struck though it was later trading down. Sean Sun, portfolio manager at Thornburg Investment Management, said of the state of play: \"Markets may actually be underreacting, especially if these rates turn out to be final, given the potential knock-on effects to global consumption and trade.\" He warned there was a big risk of escalation ahead through countermeasures against the US. Read more:Trump tariff saga far from over'Liberation Day' explainedWhat Sky correspondents make of Trump's tariffs But Sandra Ebner, senior economist at Union Investment, said: \"We assume that the tariffs will not remain in place in theannounced range, but will instead be a starting point for further negotiations. \"Trump has set a maximum demand from which the level of tariffs should decrease\". She added: \"Since the measures would not affect all regions and sectors equally, there will be winners and losers as in 2018 - although the losers are more likely to be in the EU than in North America. \"To protect companies in Europe from the effects of tariffs, the EU should not respond with high counter-tariffs. In any case, their impact in the US is not likely to be significant. It would be more efficient to provide targeted support to EU companies in the form of investment and stimulus.\""
    },
    {
        "title": "UK businesses issue warning over 'deeply troubling' Trump tariffs",
        "description": "British companies and business groups have expressed alarm over President Donald Trump's 10% tariff on UK goods entering the US &#8211; but cautioned against retaliatory measures. ",
        "url": "https://news.sky.com/story/british-businesses-issue-warning-over-deeply-troubling-trump-tariffs-13341226",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dollar-pound-bill-note_6828377.jpg?20250214082225",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-03 12:47:00",
        "Headline": "A group representing small firms has called for emergency government aid to help weather the fallout of the US president's new levies.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n British companies and business groups have expressed alarm over President Donald Trump's 10% tariff on UK goods entering the US – but cautioned against retaliatory measures.  It comes as Business Secretary Jonathan Reynolds launched a consultation with firms on taxes the UK could implement in response to the new levies. Money blog: Pension top-up deadline days away A 400-page list of 8,000 US goods that could be targeted by UK tariffs has been published, including items like whiskey and jeans. On so-called \"Liberation Day\", Mr Trump announced UK goods entering the US will be subject to a 10% tax while cars will be slapped with a 25% levy. The government's handling of tariff negotiations with the US to date has been praised by representative and industry bodies as being \"cool\" and \"calm\" – and they urged ministers to continue that approach by not retaliating.  Business lobby group the CBI (Confederation of British Industry) said: \"Retaliation will only add to supply chain disruption, slow down investment, and stoke volatility in prices\". Industry body the British Retail Consortium (BRC) also cautioned: \"Retaliatory tariffs should only be a last resort\". 'Deeply troubling' While a major category of exports, in the form of services – like finance and information technology (IT) – has been exempted from the tariffs, the impact on UK business is expected to be significant. Mr Trump's announcement was described as \"deeply troubling for businesses\" by the CBI's chief executive Rain Newton-Smith. Read more:US tariffs spark global market sell-offDo Trump's numbers add up?Island home only to penguins hit by tariffs The Federation of Small Businesses (FSB) also said the tariffs were \"a major blow\" to small and medium companies (SMEs), as 59% of small UK exporters sell to the US. It called for emergency government aid to help those affected. \"Tariffs will cause untold damage to small businesses trying to trade their way into profit while the domestic economy remains flat,\" the FSB's policy chair Tina McKenzie said. \"The fallout will stifle growth\" and \"hurt opportunities\", she added. Companies will need to adapt and overcome, the British Export Association said, but added: \"Unfortunately adaptation will come at a cost that not all businesses will be able to bear.\" Watch dealer and component seller Darren Townend told Sky News the 10% hit would be \"painful\" as \"people will buy less\". \"I am a fan of Trump, but this is nuts,\" he said. \"I expect some bad months ahead.\" Industry body Make UK said the 25% tariffs on cars, steel and aluminium would in particular be devastating for UK manufacturing. Cars hard hit Carmakers are among the biggest losers from the world trade order reshuffle. Auto industry body the Society of Motor Manufacturers and Traders (SMMT) said the taxes were \"deeply disappointing and potentially damaging measure\". \"These tariff costs cannot be absorbed by manufacturers\", SMMT chief executive Mike Hawes said. \"UK producers may have to review output in the face of constrained demand\". The new taxes on cars took effect on Thursday morning, while the measures impacting car parts are due to come in on 3 May."
    },
    {
        "title": "Accountancy firm MHA struggles to hit £125m IPO target",
        "description": "The accountancy firm MHA is struggling to hit a &#163;125m fundraising target as part of plans that would see its shares listed on the London Stock Exchange.",
        "url": "https://news.sky.com/story/accountancy-firm-mha-struggles-to-hit-163125m-ipo-target-13341340",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-city-city-of-london_6584350.jpg?20240618062124",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-03 17:04:00",
        "Headline": "The UK arm of the international Baker Tilly network faces a battle to hit the fundraising target signalled in its intention to float announcement, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The accountancy firm MHA is struggling to hit a £125m fundraising target as part of plans that would see its shares listed on the London Stock Exchange. Sky News has learnt that MHA had succeeded in securing commitments for roughly £100m of stock from investors at a post-money valuation of about £275m by the middle of this week. City sources said the deal was expected to be put to the firm's partnership ahead of an announcement in the coming days. Money latest: Pension top-up deadline just days away The firm, which is part of the international network called Baker Tilly, is attempting to take the rare step in the accountancy sector of listing its shares publicly. Most major firms are owned by their partners, although the UK arm of Grant Thornton recently sold a majority stake to Cinven, the private equity firm. A flotation of MHA's UK firm is also being undertaken against a backdrop of global market volatility triggered by Donald Trump's tariffs blitz. \n                  There were no winners from Trump's tariff gameshow\n                 \n                  Trump trade war escalation sparks global market sell-off \n                 \n                  UK businesses issue warning over 'deeply troubling' Trump tariffs\n                 If it does proceed, shares in MHA are expected to commence trading this month, one insider at the firm said on Thursday. One insider said the firm remained \"bullish\" about getting the IPO away. If it goes ahead, the listing will come as regulators probe MHA's audit of the failed construction firm ISG. A spokesman for MHA declined to comment."
    },
    {
        "title": "Trump trade war: The blunt calculation that should have spared UK from reciprocal tariffs",
        "description": "Economists immediately started scratching their heads when Donald Trump raised his tariffs placard in the Rose Garden on Wednesday.&#160;",
        "url": "https://news.sky.com/story/trump-trade-war-the-blunt-calculation-that-should-have-spared-uk-from-reciprocal-tariffs-13341195",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-us_6874248.jpg?20250402211924",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-03 12:13:00",
        "Headline": "Sky's Gurpreet Narwan says the methodology used by the White House to calculate its duties against trading partners should have meant the UK escaped unscathed.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Economists immediately started scratching their heads when Donald Trump raised his tariffs placard in the Rose Garden on Wednesday.  On that list he detailed the rate the US believes it is being charged by each country, along with its response: A reciprocal tariff at half that rate. So, take China for example. Donald Trump said his team had run the numbers and the world's second-largest economy was implementing an effective tariff of 67% on US imports. The US is responding with 34%. Trump latest: UK considers tariff retaliation How did he come up with that 67%? This is where things get a bit murky. The US claims it studied its trading relationship with individual countries, examining non-tariff barriers as well as tariff barriers. That includes, for example, regulations that make it difficult for US exporters. However, the actual methodology appears to be far cruder. Instead of responding to individual countries' trade barriers, Trump is attacking those enjoying large trade surpluses with the US. A formula released by the US trade representative laid this bare. It took the US's trade deficit in goods with each country and divided that by imports from that country. That figure was then divided by two. \n                  Pentagon's acting inspector general will review Pete Hegseth's use of Signal for Houthi airstrike plans\n                 \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 \n                  US seems content to cosy up to Russia instead of imposing tariffs\n                 So, in the case of China, which has a trade surplus of $295bn on total US exports of $438bn, that gives a ratio of 68%. The US divided that by two, giving a reciprocal tariff of 34%.  This is a blunt measure which targets big importers to the US, irrespective of the trade barriers they have erected. This is all part of Donald Trump's efforts to shrink the country's deficit - although it's US consumers who will end up paying the price. But what about the small number of countries where the US has a trade surplus? Shouldn't they actually be benefiting from all of this? Read more:Trump tariff saga far from over'Liberation Day' explainedWhat Sky correspondents make of Trump's tariffs That includes the UK, with whom the US has a surplus (by its own calculations) of $12bn. By its own reciprocal tariff formula, the UK should be benefitting from a \"negative tariff\" of 9%. Instead, it has been hit by a 10% baseline tariff. Number 10 may be breathing a sigh of relief - the US could, after all, have gone after us for our 20% VAT rate on imports, which it takes issue with - but, by Trump's own measure, we haven't got off as lightly as we should have."
    },
    {
        "title": "US seems content to cosy up to Russia instead of imposing tariffs",
        "description": "Russia is the glaring omission from Donald Trump's tariffs list. Along with Cuba, Belarus and North Korea, it has been spared the sweeping measures, with America's foes apparently treated better than many of its friends.",
        "url": "https://news.sky.com/story/us-seems-content-to-cosy-up-to-russia-instead-of-coerce-it-with-tariffs-13341300",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-moscow-russia-vladimir-putin_6866778.jpg?20250403170351",
        "type": "Business",
        "Author": "Ivor Bennett",
        "Date Published": "2025-04-03 15:11:00",
        "Headline": "Moscow has made it abundantly clear to Washington that there are lucrative deals to be done should relations between the two nations continue to thaw. It's not hard to see how new levies could derail that.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n Russia is the glaring omission from Donald Trump's tariffs list. Along with Cuba, Belarus and North Korea, it has been spared the sweeping measures, with America's foes apparently treated better than many of its friends. The explanation given by White House press secretary Karoline Leavitt to the US outlet Axios was that existing sanctions \"preclude any meaningful trade\" with Russia. But the numbers don't quite back that up. It's certainly true that US-Russia trade isn't what it was. The war in Ukraine has seen it plummet from $35bn (£26.6bn) in 2021 to $3.5bn (£2.6bn) in 2024.  Latest: Stock markets tumble after Trump's tariffs But last year's figure was still higher than Washington's trade volume with Kyiv ($2.9bn, £2.2bn), and that didn't stop Ukraine from being slapped with 10% levies. It's also considerably more than what the US traded with the likes of Brunei ($366m, £278m) and Mauritius ($282.5m, £214.9m) - another two nations which didn't escape the punitive measures. What's more, from Donald Trump's point of view, the vast majority of US-Russia trade is flowing in the wrong direction, i.e. into America. Of that, $3.5bn (£2.6bn) in 2024, $3bn (£2.2bn) were Russian imports, like fertiliser and aluminium, giving a deficit that's much worse (proportionally speaking) than several of those on the naughty list. So what's behind Russia's exemption? 👉 Listen to Sky News Daily on your podcast app 👈 Many say it smacks of further favouritism towards the Kremlin. \"I hope the American people get an explanation for this. I find it outrageous,\" Michael McFaul, a former US ambassador to Russia, wrote on X. Donald Trump has been lambasted by critics for not being tough enough on Vladimir Putin as he pushes for a peace deal in Ukraine.  He did recently threaten to impose secondary sanctions on Russian oil if Moscow blocked a ceasefire, but this latest softball makes those threats sound increasingly hollow. His tariff announcement also coincided with a visit to Washington by Kremlin envoy Kirill Dmitriev, who is the highest-ranking Russian official to travel to the US on state business since Moscow's invasion.  👉Listen to Politics at Sam and Anne's on your podcast app👈 The former Goldman Sachs banker, who is head of Russia's sovereign wealth fund, is meeting US officials, including Steve Witkoff. Was the timing of his trip a coincidence? Or a reminder to Team Trump of what's at stake? Moscow has made it abundantly clear to Washington that there are lucrative deals to be done should relations continue to thaw. It's not hard to see how new levies could derail that. Read more from Sky News:How will Trump's tariffs affect the UK?Analysis: Tariffs are more than economicsDo the tariffs add up? There is an alternative view - that it's all part of Donald Trump's famous negotiating strategy. Hold something back to use with greater effect down the line. \"One of the reasons why Russia is not on Trump's tariff list yesterday is that tariffs should be left as a tool for forcing Russia to peace,\" Alexander Baunov, a senior fellow at the Carnegie Russia Eurasia Center, wrote on Telegram. \"If they are introduced now, what will they threaten in a week?\" Well, there's an answer to that - more sanctions. For now, though, it seems the US is content to cosy up to the Kremlin rather than coerce it. The question is, who is calling the shots?"
    },
    {
        "title": "Ross injects £5m as missing piece of fashion chain Jigsaw",
        "description": "The Carphone Warehouse co-founder David Ross is ploughing millions of pounds into Jigsaw, the fashion retailer, in a deal that will result in him becoming its majority shareholder.",
        "url": "https://news.sky.com/story/ross-injects-1635m-as-missing-piece-of-fashion-chain-jigsaw-13341222",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-carphone-warehouse_5362263.jpg?20210501075700",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-03 12:33:00",
        "Headline": "The Carphone Warehouse co-founder David Ross is injecting a multimillion pound sum into the retailer, resulting in him becoming its majority shareholder, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Carphone Warehouse co-founder David Ross is ploughing millions of pounds into Jigsaw, the fashion retailer, in a deal that will result in him becoming its majority shareholder. Sky News understands that an investment vehicle controlled by Mr Ross, who also chairs the National Portrait Gallery, is committing roughly £5m more to the chain, seven years after his initial investment. Sources said the additional financial injection from Mr Ross would see him replacing Jigsaw founder John Robinson - who established the business in 1970 - as the controlling shareholder. It comes weeks after it emerged that Hash Ladha, Jigsaw's chief executive for just 15 months, would be leaving the company in the summer. A new boss is understood to be in the process of being recruited. Like most high street chains, the loss-making retailer was forced to seek rent reductions from landlords and close unprofitable stores during the pandemic. A source close to Jigsaw said the new funding would establish a more resilient long-term financial foundation for the company. \n                  There were no winners from Trump's tariff gameshow\n                 \n                  Trump trade war escalation sparks global market sell-off \n                 \n                  UK businesses issue warning over 'deeply troubling' Trump tariffs\n                 It will entail what the source described as \"a significant balance sheet reorganisation and debt reduction\". Part of the capital will be used to invest in infrastructure, including a new online proposition for the brand and an improved fulfilment capability. High street retailers which survived the COVID pandemic are now facing the severe headwinds of the government's increases to employers' national insurance contributions, which come into effect this month. Jigsaw declined to comment."
    },
    {
        "title": "Debt collector Lowell Group explores £600m Nordic sale",
        "description": "Europe's biggest debt collection group is hoisting a for sale sign above part of its international operations after approaches from bidders.",
        "url": "https://news.sky.com/story/debt-collector-lowell-group-explores-163600m-nordic-sale-13341131",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-istock-cost-of-living_5876381.jpg?20220826073333",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-03 10:19:00",
        "Headline": "Lowell, which is owned by Permira and the Ontario Teachers Pension Plan, is working with Barclays on the sale of its operations in countries such as Denmark and Norway, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Europe's biggest debt collection group is hoisting a for sale sign above part of its international operations after approaches from bidders. Sky News has learnt that Lowell Group, which is owned by the private equity firm Permira and Canada's OTPP pension fund, has appointed bankers to field interest in its business in Denmark, Finland, Norway and Sweden. People close to the process said a sale could value the business at up to €730m (£610m), although the price could be significantly lower than that sum. Barclays is overseeing the auction on behalf of Lowell, they added. The group's Nordic operations were purchased as a carveout from Intrum, another player in the sector, in 2018. Its balance sheet portfolios are valued at €475m, with a substantial third-party debt-servicing business in addition. More widely, Lowell Group has 15 million customers across Europe. \n                  There were no winners from Trump's tariff gameshow\n                 \n                  Trump trade war escalation sparks global market sell-off \n                 \n                  UK businesses issue warning over 'deeply troubling' Trump tariffs\n                 In the UK, it competes with the likes of Arrow Global, which is also private equity-backed. In its last financial year for which results are available, it reported cash earnings before interest, tax, depreciation and amortisation of £774m. A spokesman for Lowell declined to comment."
    },
    {
        "title": "Highs and lows of Five-Year Keir: The PM's journey from Doughty Street to Downing Street",
        "description": "From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants.",
        "url": "https://news.sky.com/story/highs-and-lows-of-five-year-keir-the-pms-journey-from-doughty-street-to-downing-street-13341342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-labour_6875142.jpg?20250403183034",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-04-03 17:09:00",
        "Headline": "Sir Keir Starmer's first five years as Labour Party leader have seen dramatic highs and lows - but the next five will perhaps be even more challenging.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n From Doughty Street to Downing Street: from human rights barrister in a left-wing chambers to a prime minister tough on rioters and illegal migrants. Five years after becoming Labour leader, Sir Keir Starmer has been on a remarkable journey. He turned left to win the party leadership and turned right to win a general election. It has been five years of dramatic highs and lows: the elation of winning a landslide general election victory after the gloom of contemplating quitting following a by-election humiliation. As opposition leader, Sir Keir purged the Labour left, including banishing his predecessor Jeremy Corbyn to the political wilderness, and flushed out the scourge of antisemitism. As prime minister, within weeks of entering Number 10 he was confronted with riots on Britain's streets. And throughout his premiership he has had to play a leading role internationally in a volatile and war-torn world. At home, his government's economic policies have been condemned by political opponents and some of his own MPs as a return to austerity. Labour's opinion poll ratings have nose-dived. Abroad, as well as the challenge of defending Ukraine against the brutality of Russia's Vladimir Putin, the so-called \"special relationship\" with the United States has been tested to the limit by the erratic Donald Trump. \n                  Trump has acted for his country, I will act in Britain's interests, says Starmer\n                 \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 \n                  Woman whose son Martyn Hett died in Manchester Arena terror attack welcomes new law in his name\n                 Five-year Keir was elected Labour leader on 4 April 2020, just weeks after prime minister Boris Johnson ordered a COVID lockdown that was ultimately to bring about his demise. Sir Keir won 56% of the vote, defeating the Corbyn-backed left-wing candidate Rebecca Long-Bailey and Lisa Nandy from Labour's soft left. To win the backing of left-wing Labour activists, he backed a wealth tax on the top 5% of earners, abolishing university tuition fees, nationalising water and energy and restoring freedom of movement between the UK and EU countries. Whatever happened to those promises? There was also a showbiz connection. When he was running for the leadership, a rumour persisted that he was the inspiration for Mark Darcy, the dashing human rights lawyer played by Colin Firth in the Bridget Jones movies. But, alas for Sir Keir and his spin doctors, who did nothing to dispel the myth, several months after he became leader the Bridget Jones author Helen Fielding laid the rumour to rest - though she conceded they were very similar. Sir Keir had much bigger battles to fight, however. From day one as leader, he condemned antisemitism as \"a stain on our party\". Within weeks he sacked his rival Ms Long-Bailey from his shadow cabinet in a dispute over antisemitism. But in his ruthless determination to show the party had changed under his leadership, he had a bigger target: his predecessor Mr Corbyn, still the darling of left-wing Labour activists. After the former leader claimed the scale of antisemitism in the Labour party had been \"dramatically overstated for political reasons\", Sir Keir struck, suspending him for refusing to retract his comments and then finally expelling him a month before last year's general election. But while he was winning that battle, Sir Keir's first year did not go well at the ballot box. In 2021, in the first by-election after Boris Johnson's 80-seat victory in the 2019 general election, Labour lost the previously safe seat of Hartlepool to the Conservatives. The swing against Labour was a huge 16%. It was his lowest low point of the last five years. Stunned by the Hartlepool defeat, Sir Keir panicked, sacking his chief whip Nick Brown and attempting to demote his deputy, Angela Rayner, stripping her of her posts as party chair and campaign coordinator. But it backfired as she fought back and emerged stronger than ever. She gained the titles of shadow chancellor of the Duchy of Lancaster and shadow secretary of state for work. Four years later, her Employment Rights Bill is in the House of Lords and on course to become law. Last year, in a Sky News interview with political editor Beth Rigby, Sir Keir admitted he had considered quitting. \"I did, because I didn't feel that I should be bigger than the party and that if I couldn't bring about the change, perhaps there should be a change,\" he said. But it wasn't just the result in Hartlepool that was damaging. In 2022, in a scandal the Conservatives called \"beergate\", he and Ms Rayner were accused of breaching lockdown rules by eating curry and drinking beer in Durham while campaigning in the by-election. He was cleared, but at the height of the Tory onslaught he said he would resign if he was issued with a fixed penalty notice. It was another low point. But in 2022 it was Mr Johnson who was forced to quit over breaking COVID rules, not Sir Keir. A top civil servant, Sue Gray, produced a damning and ultimately fatal \"partygate\" report, accusing Mr Johnson of lying to parliament, Liz Truss came and went - her brief 49-day tenure likened to the life of a lettuce - and Rishi Sunak became the Tories' fifth prime minister in six years. Sir Keir was on his way. But it was his turn to stun his opponents in 2023 when he announced that Sue Gray was to become his chief of staff, in a move the Tories claimed was treachery and proof that she had been biased against Mr Johnson. But though she lasted longer than \"lettuce\" Liz Truss, Sue Gray didn't survive for long. Within months of Labour's 2024 election victory she was out, the victim of a vicious power struggle with a Number 10 \"boys' club\" led by Starmer's campaign chief Morgan McSweeney, who helped himself to her job as chief of staff. On the back of several by-election successes and sweeping local government gains, when Mr Sunak shocked his own party on 22 May by announcing a 4 July general election, Labour entered the campaign as overwhelming favourites to win a big majority. A turning point in the campaign came on 2 June when Nigel Farage announced a comeback as Reform UK leader and declared that he would, after months of keeping his opponents guessing, be a candidate after all. As a result, Reform UK won 4.1m votes, piling up votes in the tens of thousands in hundreds of seats, mostly at the expense of the Conservatives, and handing a landslide to Sir Keir: 411 Labour MPs and a majority of 172. His triumph came close to rivalling Tony Blair's landslides of 1997 and 2001 with one crucial difference: Labour polled just 34% of the vote, the lowest share for a party winning a majority. During the campaign, Sir Keir faced tough scrutiny not just about his pledges not to increase income tax, VAT or national insurance, but also about his character and personality. In \"The Battle for Number 10\" on Sky News, a 90-minute event in Grimsby featuring Sir Keir and Mr Sunak, the Labour leader froze when a member of the audience told him he seemed like a \"political robot\". He also squirmed when another audience member challenged him on why he now condemned Mr Corbyn when five years earlier he told voters he would make a great prime minister. Yet despite those difficult moments, the event was more bruising for Mr Sunak than Sir Keir and a YouGov poll declared a decisive victory for the Labour leader, by 64% to 36% But there was to be no honeymoon period for Sir Keir after Labour's landslide. Within days of his election victory, riots following the killing of three young girls at a dance class in Southport presented the new prime minister with a law and order crisis. His background as Director of Public Prosecutions served him well, however, and he showed a steely determination in ensuring rioters were dealt with swiftly and severely by the courts, though critics hit out at inconsistencies in sentencing and branded him \"Two-tier Keir\". Another crisis was self-inflicted. Many in his own party were shocked by the staggering amount of freebies, gifts and hospitality he and his wife accepted since he became Labour leader, many paid for by a millionaire Labour donor Lord Alli. According to a Sky News investigation, their total worth was more than £100,000. They included expensive clothes for the PM and his wife, luxury designer spectacles for Sir Keir, hospitality at his beloved Arsenal FC, free accommodation in a flat owned by Lord Alli and - perhaps the most contentious - freebie tickets to a Taylor Swift concert at Wembley Stadium, all worth eye-watering amounts. To make matters worse, the \"freebie-gate\" scandal engulfed the PM at a time when his chancellor, Rachel Reeves, was cutting winter fuel payments for pensioners, the first of a series of controversial moves by the woman derided as \"Rachel from Accounts\" by political opponents that have badly damaged Sir Keir's government in its first nine months. The two-child benefit cap, national insurance rises in her October budget, benefit cuts last month and no compensation for the so-called Waspi women have all infuriated many Labour MPs and put Sir Keir's loyalty to his chancellor under strain. He's standing by her for now. \"I have full confidence in the chancellor,\" he declared, tetchily, when challenged by a Tory MP at PMQs just minutes before her spring statement last week. But for how long? Most prime ministers eventually fall out with their chancellor: Margaret Thatcher with Sir Geoffrey Howe and then Nigel Lawson in the 1980s and later Tony Blair and Gordon Brown. Be warned, Rachel! On foreign policy, the PM's record is better. His baptism on the world stage, at a NATO summit in Washington in his first week as PM, helped him swiftly establish a reputation as a safe pair of hands and reliable ally on foreign policy. Though the UK is no longer in the EU, Sir Keir has forged strong alliances with European leaders - particularly France's President Macron - as he attempts to build a \"coalition of the willing\" to defend Ukraine. And he has won the trust of Ukraine's President Zelenskyy. And on his biggest foreign policy challenge, establishing good relations with the maverick President Trump, the verdict - even after the president's tariffs bombshell - is so far, so good. His Trump Tower dinner last September went well, his White House stunt with an envelope containing King Charles' state visit invitation was a diplomatic masterstroke and the 10% tariffs slapped on the UK could have been a lot worse. Now comes the really hard part for Five-Year Keir: securing a trade deal with the US, bringing peace to Ukraine without a sell-out or concessions to Vladimir Putin, smashing the gangs smuggling illegal migrants, tackling welfare reform and - the biggest challenge - finding that elusive economic growth at home while the Trump tariffs make autumn tax rises look almost inevitable. No pressure, then prime minister. If the lows of Sir Keir's first five years as Labour leader took the shine off the highs, the next five years - to the next election and perhaps beyond - look even more challenging. And the journey from Doughty Street to Downing Street is now just a distant memory."
    },
    {
        "title": "Trump's tariffs will have an impact before too long – but how will the UK respond?",
        "description": "The list has landed.",
        "url": "https://news.sky.com/story/trumps-tariffs-will-have-an-impact-before-too-long-8211-but-how-will-the-uk-respond-13341332",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-starmer-trump-ali-fortescue_6875105.jpg?20250403172938",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-04-03 16:46:00",
        "Headline": "The government is considering imposing reciprocal tariffs on thousands of US goods - but wants to avoid retaliation if it can.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n The list has landed. More than 400 pages of thousands of goods that could be affected by reciprocal tariffs against the US. Everything from fresh domestic ducks to sea-going dredgers makes the cut; most symbolic, however, are iconic American items like jeans, motorcycles and whiskey. Would Donald Trump stand for a levy on Levi's? It's not the first time this battle has played out. When the US president announced tariffs on steel and aluminium in his first term, the EU responded with its own - including a symbolic 25% tax on American whiskey. At the time, the UK, then an EU member, followed suit. But as the UK tries to carve its own path outside the bloc, vindicated by the baseline 10% tariffs imposed instead of the EU's rate of 20%, the aim is to avoid retaliation. The government want us to know \"all options are on the table\" - but that is not how they want this to play out. \"This is not a short-term tactical exercise,\" the prime minister said this morning. Despite the business secretary's best efforts during his recent trip to Washington to try to secure a UK tariffs carveout, no deal was reached in time.  Mr Trump wanted his big bang, board brandishing moment; carveouts for certain countries would have softened the impact of his speech. But with 90-plus countries on the tariff billboard, how far along the queue is any UK deal? And how much are we willing to give? Will the sensitive subject of chlorinated chicken be on the table? What of the agreement to cut taxes on big tech companies that Mr Trump wants? Lots of questions. The day after the surreal night before is too soon to know all the answers, but this is about politics as much as it is about economics. Read more:There were no winners from Trump's tariff gameshowDo Trump's numbers on tariffs really add up? As the prime minister launched Labour's local election campaign in Derbyshire today, he talked about potholes, high streets and school meals. Every question I heard was about tariffs. Decisions made across the Atlantic are looming large. Tariffs may not directly sway many votes in the local elections, but the consequences for Rachel Reeves's fiscal headroom and the amount of money she has to spend, or save, will have an impact before too long."
    },
    {
        "title": "Woman whose son Martyn Hett died in Manchester Arena terror attack welcomes new law in his name",
        "description": "There is a certain steel about a mother who has lost a child.",
        "url": "https://news.sky.com/story/woman-whose-son-martyn-hett-died-in-manchester-arena-terror-attack-welcomes-new-law-in-his-name-13341329",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-martyn-hett-manchester-arena_6875115.jpg?20250403173913",
        "type": "Politics",
        "Author": "Sophy Ridge",
        "Date Published": "2025-04-03 16:22:00",
        "Headline": "Figen Murray has campaigned for six years for a new law that makes venues protect people in the event of terror attacks.",
        "Content": "\n          Lead politics presenter\n              @SophyRidgeSky\n  There is a certain steel about a mother who has lost a child. It's hard to put your finger on, but perhaps after going through hell you re-emerge made of a different material to the rest of us. Figen Murray has been utterly relentless after her son Martyn Hett was killed in the Manchester Arena terror attack at an Ariana Grande concert in May 2017. When she worried that politicians' support was wavering last year, she walked 200 miles from the place Martyn died to Downing Street - and needed a hip replacement after. And on Thursday, Martyn's Law - rules to better train staff and safeguard venues against terrorists - was passed by royal assent, finally becoming law. I sat down with Figen just before she went into Number 10 Downing Street to meet the prime minister, and she told me after six years of campaigning, the moment \"feels surreal\". She continued: \"The Manchester attack was a wake up call. But it also made question, who are these people who do these things? Why are they doing it? What are governments doing about it? And I realised the only way I could get the answers was to educate myself - so I did a masters in counter-terrorism. \n                  More than 400 Sikh groups call on Starmer to launch 'promised' inquiry on Golden Temple massacre\n                 \n                  Starmer holds fire on Trump's Liberation Day\n                 \n                  Has Starmer played Trump right?\n                 \"I've recognised that people were radicalised. When you were a newborn baby, you were innocent but somebody poisoned your mind. \"There are people who try to groom young people into their ideology, and I want them to recognise where these people operate, the tricks they use, the things they say and how they can recognise themselves or others in the process of being radicalised and how to get out.\" She also supports the initiative to show the Netflix drama Adolescence in schools: \"I think it's absolutely important that young people see that programme and they learn more about it. It's a good thing and I'm hoping they're taking it further.\" There will be a debate - certainly - about the financial impact the legislation will have on venues, but the legislation has been welcomed by safety campaigners. Emma Kay, co-founder of personal safety app WalkSafe which geo-fences events and stadiums, said: \"The passing of Martyn's Law is hugely progressive move that will keep young people safe on nights out. \"Our research has shown that 63% of women prefer to visit venues with safety initiatives in place. People want safer experiences and to know their friends and loved ones arrive home safely.\" Read more:Martyn's Law: Terrorism response bill named after Manchester Arena bombing victim becomes law When I sat down with Figen, I asked her how Martyn would feel today. \"Knowing Martyn, the party animal he was, he'd throw the biggest party ever,\" she said. \"He was full of life and lived life not just at 100 miles an hour, but 200 miles an hour. \"You would definitely know when he came through the door, and he had an incredible ability to make everyone feel that they are the most important person in that moment in his life. And I really miss that.\" You can watch Sophy Ridge's full interview with Figen Murray on the Politics Hub at 1900 on Sky News."
    },
    {
        "title": "Scheme to boost access to NHS dentists 'comprehensively failed', MPs say",
        "description": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said",
        "url": "https://news.sky.com/story/scheme-to-boost-access-to-nhs-dentists-comprehensively-failed-mps-say-13341487",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-dentist-nhs-teeth_6494653.jpg?20240319003434",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-03 22:13:00",
        "Headline": "Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments. The PAC's report said it appears to have \"resulted in worsening the picture\".",
        "Content": "A scheme meant to boost access to NHS dentists under the last government appears to have \"comprehensively failed\", MPs have said Introduced in February last year by Conservative health ministers, the Dental Recovery Plan promised to introduce 1.5 million new treatments for patients and offered dentists a \"bonus\" to take NHS patients. According to the Public Accounts Committee (PAC), the scheme appears to have \"resulted in worsening the picture\" more than a year later. Under the Dental Recovery Plan, practices were offered a new patient premium (NPP) - which the PAC found cost at least £88m since it was introduced and resulted in 3% fewer new patients seeing an NHS dentist.  The plan's \"golden hello\" recruitment scheme had also been found to have appointed fewer than 20% of the expected 240 dentists by February this year. Their report, published today, also said vulnerable patients \"continue to suffer the most\" and that the dental contract \"remains unfit for purpose\". Current arrangements are only sufficient for about half of England's population to see an NHS dentist over two years, it added. \n                  Kemi Badenoch thinks she's started a journey - a ruthless party may soon have other ideas\n                 \n                  A Labour Party in Tory clothing? Why Starmer's backbenchers are deeply uncomfortable\n                 \n                  Ex-Tory MP Crispin Blunt still at centre of rape investigation 16 months after arrest\n                 The PAC report also said \"it does not appear\" that NHS England or the Department of Health and Social Care \"have a sense of what level of funding would provide a realistic incentive for dentists to prioritise NHS work\". Read more:Morning-after pill set to be made free from pharmaciesGPs agree deal to 'end 8am scramble' for appointments 'NHS dentistry is broken' PAC chairman Sir Geoffrey Clifton-Brown said: \"It is utterly disgraceful that, in the 21st century, some Britons have been forced to remove their own teeth. \"Last year's Dental Recovery Plan was supposed to address these problems, something our report has found it has signally failed to do. \"Almost unbelievably, the government's initiatives appear to have actually resulted in worsening the picture, with fewer new patients seen since the plan's introduction.\" He added: \"NHS dentistry is broken. The government could hardly fail to agree on this point, and indeed I am glad that it is not in denial that the time for tinkering at the edges is over. \"It is time for big decisions.\" A Department of Health and Social Care spokesperson said the Labour government \"inherited a broken NHS dental sector\" and was fixing it through its Plan for Change. It said that in February, it had delivered on its manifesto pledge by rolling out 700,000 extra urgent appointments and pledged to introduce a new supervised toothbrushing scheme for three to five-year-olds."
    },
    {
        "title": "Boost for London nightlife as mayor Sir Sadiq Khan given new powers to overturn council licensing decisions",
        "description": "London councils that block bars and restaurants from opening later could see their decisions overturned by the mayor, who is being given new powers by the government.",
        "url": "https://news.sky.com/story/boost-for-london-nightlife-as-mayor-sir-sadiq-khan-given-new-powers-to-overturn-council-licensing-decisions-13341449",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-london-nightlife-soho_6875338.jpg?20250403222133",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-03 20:58:00",
        "Headline": "Chancellor Rachel Reeves says the new powers will mean hospitality businesses have \"the conditions to grow\" and are not \"tied down by unnecessarily burdensome red tape\".",
        "Content": "London councils that block bars and restaurants from opening later could see their decisions overturned by the mayor, who is being given new powers by the government. As part of ministers' plans to boost the hospitality industry, Sir Sadiq Khan is set to be granted the power to \"call in\" licensing decisions for nightlife hotspots in the capital. It could mean later opening hours and more alfresco dining in London, and the pilot scheme could eventually be expanded to other parts of the country, such as the West Midlands or Greater Manchester. Politics latest: How will the UK react to Trump's tariffs? Chancellor Rachel Reeves said the move will mean hospitality businesses have \"the conditions to grow\" and are not \"tied down by unnecessarily burdensome red tape\". \"We've heard industry concerns, and we're partnering with businesses to understand what changes need to be made, because a thriving nighttime economy is good for local economies, good for growth, and good for getting more money in people's pockets,\" she added. Deputy prime minister Angela Rayner said: \"Too often, we have seen the complaints of a vocal minority of objectors promoted over the need for our country to grow - we are determined to change this.\" \n                  Consultations for building set to be scrapped under proposed changes\n                 \n                  Angela Rayner 'won't speculate' over possible changes to two-child benefit cap\n                 \n                  Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes\n                 Councils want more powers, not fewer The decision comes at a time when the UK's hospitality industry is under severe pressure amid rising wage costs, national insurance contributions, and business rates. Industry trade body UKHospitality has said the combination of rising costs would mean a £3.4bn hit for the sector, and is calling on the government to do more. Sir Sadiq argued that allowing him to be able to overrule local councils will \"allow us to do more to support the capital's pubs, clubs and music venues\". He added: \"This is more evidence that we now have a government that wants to work with the capital and recognises the role that we can play in delivering economic prosperity and support Londoners as we build a better London for everyone.\" But this decision to grant more powers to the mayor also comes at a time when London's 32 boroughs are calling for a greater say in how the capital is run, and called on Thursday for a new power-sharing arrangement with the mayor, giving them a formal say over the capital's strategic direction. Read more: 'They can't even run themselves': Starmer attacks Reform UKTrump has acted for his country, I will act in Britain's interests, says PMTariffs will have an impact before too long - but how will the UK respond? A spokesperson for Westminster City Council said: \"Westminster has the most pubs and clubs of any local authority so we already have extensive expertise in supporting business to thrive while balancing the views of local people and the police. \"We grant the vast majority of licensing applications, which are only refused where safety concerns are raised by the police or significant disruption is likely. \"We need to see the proposals in more detail before commenting further. \"Local authorities and licensing professionals should be represented on any working group.\""
    },
    {
        "title": "Martyn's Law: Terrorism response bill named after Manchester Arena bombing victim becomes law",
        "description": "New legislation to make venues protect the public in the event of a terror attack, named in memory of a victim of the 2017 Manchester Arena bombing, has become law in the UK today.",
        "url": "https://news.sky.com/story/martyns-law-bill-named-after-manchester-arena-bombing-victim-becomes-law-13341142",
        "image_url": "https://e3.365dm.com/17/05/1920x1080/366a6d84b998a902ce51aefb515372cc58734d6f127fc3fc1a2e55ae55ebc6df_3961459.jpg?20250403115409",
        "type": "Politics",
        "Author": "Greg Milam",
        "Date Published": "2025-04-03 10:45:00",
        "Headline": "Martyn's Law, officially known as the Terrorism (Protection of Premises) Bill, requires public venues to be better prepared for any attack and help keep people safe.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n New legislation to make venues protect the public in the event of a terror attack, named in memory of a victim of the 2017 Manchester Arena bombing, has become law in the UK today. Martyn's Law is named after Martyn Hett, who was killed alongside 21 others in the attack at an Ariana Grande concert in May 2017. The law received Royal Assent today after a six-year campaign led by Martyn's mother, Figen Murray. She said: \"Whilst nothing can bring Martyn back, this much-needed law will secure his legacy and help to prevent more families enduring the pain and loss that mine alongside 21 others have experienced since the Manchester Arena terror attack.\" The public inquiry into the bombing found \"serious shortcomings\" in the security provision from the venue, contractors and the British Transport Police on the night of the attack. Inquiry chair John Saunders blamed \"failings and mistakes\" for \"missed opportunities\" to lessen the death toll caused by bomber Salman Abedi. Martyn's Law, officially known as the Terrorism (Protection of Premises) Bill, requires public venues to be better prepared for any attack and help keep people safe. Under the law, venues with a capacity of between 200 and 799 will have to take measures such as training staff to lock doors or close shutters and identify a route to safety. Venues with a capacity of 800 or more will be required to make changes such as installing CCTV systems or hiring security staff. The campaign for Martyn's Law was started by Ms Murray in 2019 and saw her complete a 200-mile walk to Downing Street last year in a final push for the legislation. She was back at Downing Street today to meet Sir Kier Starmer, who had personally vowed to quickly put Martyn's Law on the statute books. She said: \"I'm grateful to the Prime Minister for keeping his promise.\" Read more from Sky News:UK almost certain to host 2035 Women's World CupTwo men arrested over alleged Hezbollah linksNew photos show moment of North Sea crash The campaign was also supported by Brendon Cox, the husband of the murdered MP Jo Cox and the co-founder of Survivors Against Terror. He said: \"You should never doubt what the courage, bravery and passion of a mother can achieve. This was never a quest for sympathy, it was a desire for change to make us all safer. Today Figen has achieved that, and we all owe her a debt of thanks.\" The inquiry into the attack found that, despite the UK terror alert being \"severe\" at the time, those involved in securing the venue had failed to take the risk seriously. Ultimate responsibility lay with Abedi and his brother Hashem, who was jailed for life for his role in the attack.  The government says businesses will be given time and support to implement the new requirements and allow for a new regulator to be established."
    },
    {
        "title": "Luton Airport expansion plans approved by transport secretary",
        "description": "The expansion of Luton Airport has been approved by the transport secretary.",
        "url": "https://news.sky.com/story/luton-airport-expansion-approved-by-transport-secretary-13341219",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-luton-airport-aerial_5838515.jpg?20220718162702",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-04-03 12:40:00",
        "Headline": "Heidi Alexander's decision comes despite the Planning Inspectorate recommending that the proposals be rejected due to environmental concerns.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n The expansion of Luton Airport has been approved by the transport secretary. The decision by Heidi Alexander to rubber-stamp the plans, which are for a new terminal rather than a runway, comes despite the Planning Inspectorate recommending she reject the move over environmental concerns. The government had been considering whether to expand the airport as a means to boost UK growth, following a similar decision to give the green light to a third runway at Heathrow at the beginning of the year. Politics latest: PM warns Trump has launched 'a new era' Luton Airport, the UK's fifth busiest airport last year, wants to increase its annual cap on passenger numbers from 18 million to 32 million by the mid-2040s, allowing its runway to be used for 77,000 more flights per year compared with last year. In 2024, 16.9 million passengers travelled through the airport on 132,000 flights. The Planning Inspectorate, the arms-length government body that deals with planning appeals and national infrastructure planning applications, was concerned that the airport expansion would have a \"moderate adverse significant effect on the aesthetic or perceptual characteristics\" of the Chilterns national landscape during construction. Ms Alexander approved the airport's development consent order – used to obtain permission for nationally significant infrastructure projects – after being told the expansion would help the UK's economy. It is understood the cabinet unanimously supported the plans in light of claims that the expansion would also benefit Luton, where Stellantis closed its 120-year-old Vauxhall van-making factory less than a week ago. A government source said: \"The transport secretary has approved the expansion of Luton airport for its benefits to Luton and the wider UK economy. \"The decision overturns the Planning Inspectorate's recommendation for refusal. \"Expansion will deliver huge growth benefits for Luton with thousands of good, new jobs and a cash boost for the local council which owns the airport. \"This is the 14th development consent order approved by this Labour government, demonstrating we will stop at nothing to deliver economic growth and new infrastructure as part of our plan for change.\"  'Clear benefits' Luton Rising, the economic development company that owns the airport, claimed the project would support around 12,000 new jobs in the area and provide an additional economic benefit of £1.6bn per year. Chair Paul Kehoe said the transport secretary's decision \"enables us to continue detailed planning\". He added: \"The benefits are clear. At a new capacity of 32 million passengers per year, our scheme will deliver up to 11,000 new jobs, additional annual economic activity of up to £1.5bn, and up to an additional £13m every year for communities and good causes. \"By introducing maximum limits for the airport's noise, operational greenhouse gas emissions, air quality and surface access impacts, we also believe that our green controlled growth framework represents the most far-reaching commitment to the sustainable operation of an airport ever put forward in the UK.\" Last month Ms Alexander also announced that she would support Gatwick Airport's second runway plan if the project was adjusted. The transport secretary previously said the UK \"can and must\" boost aviation at the same time as protecting the environment, denying that the two are fundamentally incompatible. 'Bad case of déjà vu' Environmental groups immediately criticised the decision as \"misguided\". Johann Beckford, senior policy adviser at Green Alliance, said it was \"a bad case of déjà vu\". He added: \"Doubling passenger and flight numbers will increase emissions, air pollution and noise. \"This latest misguided project does more to undermine UK climate credibility than it does to expand the economy as, once again, the growth impact of the expansion is likely to be overstated. \"With almost 90% of Luton flights taken for leisure, this decision gives priority boarding to British tourists taking their money out of the country to spend abroad.\" Read more from Sky News:MP targeted online by Tate brothersPrince Harry responds to charity rowAppeal launched to help earthquake victims Colin Walker, head of transport at the Energy and Climate Intelligence Unit, said the move would \"encourage frequent flyers to fly even more frequently\" and to spend their money abroad. \"70% of the UK's flights are taken by just 15% of its population,\" he said. \"The UK already runs a £41bn tourism deficit; an expanded Luton will make this worse by encouraging even more people to take their disposal income out of the UK and spend it abroad. \"Approving the expansion of Gatwick and Luton airports will see emissions increase to such an extent that all the CO2 savings that the government hopes to achieve from its clean power plan would be wiped out by 2050.\""
    },
    {
        "title": "Ban children from social media if Online Safety Act watered down, children's commissioner says",
        "description": "Young people should be removed from social media altogether if the Online Safety Act is watered down as part of US trade negotiations, the children's commissioner for England has said. ",
        "url": "https://news.sky.com/story/ban-children-from-social-media-if-online-safety-act-watered-down-childrens-commissioner-says-13340980",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-social-media-uk_6839040.jpg?20250225091042",
        "type": "Technology",
        "Author": "Faye Brown",
        "Date Published": "2025-04-03 08:27:00",
        "Headline": "Dame Rachel de Souza also says parents should set an example for children and not scroll on their phones during dinner or in bed. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Young people should be removed from social media altogether if the Online Safety Act is watered down as part of US trade negotiations, the children's commissioner for England has said.  Dame Rachel de Souza told Sky News' breakfast with Wilfred Frost that she fought for the flagship bill because children as young as eight are being exposed to \"gore, pornography, terrible degrading violence towards women\" on the internet. Politics Live: Starmer says UK will face Trump tariffs with 'calm head' The act requires social media firms to block children accessing illegal and harmful material, with fines if they fail to do so. Dame Rachel said: \"If regulation is pulled back on children, if the online safety bill is pulled back on children, then we need children off social media.\" She said that would be a \"shame\" because \"we want the internet to be a joyous place where you can learn things\". However, \"children need to be kept safe\" and parents would be \"astounded by what their youngsters are seeing\", she added, citing the case of an eight-year-old boy who told her he had seen pornography. \n                  Trump has acted for his country, I will act in Britain's interests, says Starmer\n                 \n                  Highs and lows of Five-Year Keir: The PM's journey from Doughty Street to Downing Street\n                 \n                  Trump's tariffs will have an impact before too long – but how will the UK respond?\n                 There have been reports Labour could rework the Online Safety Act (OSA), passed by the Tories in 2023, in order to avoid Trump tariffs. The US President imposed a 10% levy on UK imports as part of global measures announced last night, which is relatively light compared to other countries but comes on top of a 25% tariff on British car imports. Ministers are still pushing for a trade deal in which they hope could see the tariffs eased, with tech expected to be at the centre of this.  A government spokesperson declined to comment to Sky News when asked if the OSA could be part of the negotiations. The act has been criticised by tech bosses while US officials have reportedly complained about it to Ofcom, the Guardian reported. However, any move to water it down would likely anger Labour MPs given the party's manifesto pledged to strengthen online safety.  'Very obvious' US impacting online safety stance Sky News recently revealed that dozens of backbenchers who wanted tougher action on online safety had formed a group to discuss next steps, with the first meeting held last week. There is \"lots of determination to do something\", a source close to the group said today. They added: \"It is very obvious the US negotiations are having a big impact on the government's direction on online safety regulation, not necessarily to the act itself but certainly in their resistance to do anything new despite significant public and political pressure.\" There is mounting concern about violent and sexist social media content being served up to children, which has had renewed attention following the release of the Netflix drama Adolescence. Sir Keir this week held a round table in Downing Street with the show's creators, charities and young people about how to prevent young boys being dragged into a \"whirlpool of hatred and misogyny\". Many MPs support strong action, including a social media ban on under 16s and smartphone ban in classrooms. 'Parents need to set an example'  Most schools already ban phones following guidance issued by the Conservatives last year, but it is not required by law and now the Tories say it should be. Asked if she'd like to see a ban, Dame Rachel, a former head teacher of 20 years, said there is \"no reason for having internet connected phones in school during the day\". Read More;Teenagers exposed to 'horrific' content online - and this survey reveals the scale of the problem She said she will be releasing research next week which shows most schools ban phones \"and what we need to be doing is backing our heads up\" rather than \"missives from Westminster\". She said parents also \"need to back their heads on this\", while setting an example to children over their own screen time use. \"If we're scrolling as adults at dinner time, if we're looking at the phone in bed, if we're more interested in that than we are in actually talking and engaging... young kids will learn that from us. \"So of course I don't want phones in schools, I banned them for many years, but it needs to go further than that.\""
    },
    {
        "title": "Luton Airport expansion plans approved by transport secretary",
        "description": "The expansion of Luton Airport has been approved by the transport secretary.",
        "url": "https://news.sky.com/story/luton-airport-expansion-approved-by-transport-secretary-13341219",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-luton-airport-aerial_5838515.jpg?20220718162702",
        "type": "Technology",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-04-03 12:40:00",
        "Headline": "Heidi Alexander's decision comes despite the Planning Inspectorate recommending that the proposals be rejected due to environmental concerns.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n The expansion of Luton Airport has been approved by the transport secretary. The decision by Heidi Alexander to rubber-stamp the plans, which are for a new terminal rather than a runway, comes despite the Planning Inspectorate recommending she reject the move over environmental concerns. The government had been considering whether to expand the airport as a means to boost UK growth, following a similar decision to give the green light to a third runway at Heathrow at the beginning of the year. Politics latest: PM warns Trump has launched 'a new era' Luton Airport, the UK's fifth busiest airport last year, wants to increase its annual cap on passenger numbers from 18 million to 32 million by the mid-2040s, allowing its runway to be used for 77,000 more flights per year compared with last year. In 2024, 16.9 million passengers travelled through the airport on 132,000 flights. The Planning Inspectorate, the arms-length government body that deals with planning appeals and national infrastructure planning applications, was concerned that the airport expansion would have a \"moderate adverse significant effect on the aesthetic or perceptual characteristics\" of the Chilterns national landscape during construction. Ms Alexander approved the airport's development consent order – used to obtain permission for nationally significant infrastructure projects – after being told the expansion would help the UK's economy. It is understood the cabinet unanimously supported the plans in light of claims that the expansion would also benefit Luton, where Stellantis closed its 120-year-old Vauxhall van-making factory less than a week ago. A government source said: \"The transport secretary has approved the expansion of Luton airport for its benefits to Luton and the wider UK economy. \"The decision overturns the Planning Inspectorate's recommendation for refusal. \"Expansion will deliver huge growth benefits for Luton with thousands of good, new jobs and a cash boost for the local council which owns the airport. \"This is the 14th development consent order approved by this Labour government, demonstrating we will stop at nothing to deliver economic growth and new infrastructure as part of our plan for change.\"  'Clear benefits' Luton Rising, the economic development company that owns the airport, claimed the project would support around 12,000 new jobs in the area and provide an additional economic benefit of £1.6bn per year. Chair Paul Kehoe said the transport secretary's decision \"enables us to continue detailed planning\". He added: \"The benefits are clear. At a new capacity of 32 million passengers per year, our scheme will deliver up to 11,000 new jobs, additional annual economic activity of up to £1.5bn, and up to an additional £13m every year for communities and good causes. \"By introducing maximum limits for the airport's noise, operational greenhouse gas emissions, air quality and surface access impacts, we also believe that our green controlled growth framework represents the most far-reaching commitment to the sustainable operation of an airport ever put forward in the UK.\" Last month Ms Alexander also announced that she would support Gatwick Airport's second runway plan if the project was adjusted. The transport secretary previously said the UK \"can and must\" boost aviation at the same time as protecting the environment, denying that the two are fundamentally incompatible. 'Bad case of déjà vu' Environmental groups immediately criticised the decision as \"misguided\". Johann Beckford, senior policy adviser at Green Alliance, said it was \"a bad case of déjà vu\". He added: \"Doubling passenger and flight numbers will increase emissions, air pollution and noise. \"This latest misguided project does more to undermine UK climate credibility than it does to expand the economy as, once again, the growth impact of the expansion is likely to be overstated. \"With almost 90% of Luton flights taken for leisure, this decision gives priority boarding to British tourists taking their money out of the country to spend abroad.\" Read more from Sky News:MP targeted online by Tate brothersPrince Harry responds to charity rowAppeal launched to help earthquake victims Colin Walker, head of transport at the Energy and Climate Intelligence Unit, said the move would \"encourage frequent flyers to fly even more frequently\" and to spend their money abroad. \"70% of the UK's flights are taken by just 15% of its population,\" he said. \"The UK already runs a £41bn tourism deficit; an expanded Luton will make this worse by encouraging even more people to take their disposal income out of the UK and spend it abroad. \"Approving the expansion of Gatwick and Luton airports will see emissions increase to such an extent that all the CO2 savings that the government hopes to achieve from its clean power plan would be wiped out by 2050.\""
    },
    {
        "title": "Tom Cruise leads moment of silence in tribute to 'dear friend' Val Kilmer",
        "description": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\".",
        "url": "https://news.sky.com/story/tom-cruise-leads-moment-of-silence-in-tribute-to-dear-friend-val-kilmer-13341470",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tom-cruise-las-vegas_6875358.jpg?20250403224056",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-03 21:28:00",
        "Headline": "The Mission Impossible star called for a moment of silence at a film event in Las Vegas. He said his Top Gun co-star \"gave a lot to all of us\" and asked the audience to \"think about all the wonderful times that we had with him\".",
        "Content": "Tom Cruise has paid tribute to Val Kilmer, wishing his Top Gun co-star \"well on the next journey\". Cruise, speaking at the CinemaCon film event in Las Vegas on Thursday, asked for a moment's silence to reflect on the \"wonderful\" times shared with the star, whom he called a \"dear friend\". Kilmer, who died of pneumonia on Tuesday aged 65, rocketed to fame starring alongside Cruise in the 1986 blockbuster Top Gun, playing Tom 'Iceman' Kazansky, a rival fighter pilot to Cruise's character Maverick. His last part was a cameo role in the 2022 blockbuster sequel Top Gun: Maverick. Cruise, on stage at Caesars Palace on Thursday, said: \"I'd like to honour a dear friend of mine, Val Kilmer. I can't tell you how much I admire his work, how grateful and honoured I was when he joined Top Gun and came back later for Top Gun: Maverick. \"I think it would be really nice if we could have a moment together because he loved movies and he gave a lot to all of us. Just kind of think about all the wonderful times that we had with him. \"I wish you well on the next journey.\" The moment of silence followed a string of tributes from Hollywood figures including Cher, Francis Ford Coppola, Antonio Banderas and Michelle Monaghan. Kilmer's daughter Mercedes told the New York Times on Wednesday that the actor had died from pneumonia. Diagnosed with throat cancer in 2014, Kilmer discussed his illness and recovery in his 2020 memoir Your Huckleberry and Amazon Prime documentary Val. He underwent radiation and chemotherapy treatments for the disease and also had a tracheostomy which damaged his vocal cords and permanently gave him a raspy speaking voice. Kilmer played Batman in the 1995 film Batman Forever and received critical acclaim for his portrayal of rock singer Jim Morrison in the 1991 movie The Doors. Read more from Sky News:Tributes to 'genius' KilmerRichest billionaires namedSpringsteen's seven new albums He also starred in True Romance and Kiss Kiss Bang Bang, as well as playing criminal Chris Shiherlis in Michael Mann's 1995 movie Heat and Doc Holliday in the 1993 film Tombstone. In 1988 he married British actress Joanne Whalley, whom he met while working on fantasy adventure Willow. The couple had two children before divorcing in 1996."
    },
    {
        "title": "Bruce Springsteen: The Boss to release seven 'lost' albums",
        "description": "Bruce Springsteen is to release seven albums of mostly unheard material this summer.",
        "url": "https://news.sky.com/story/bruce-springsteen-the-boss-to-release-seven-lost-albums-13341313",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bruce-springsteen-new-york_6875050.jpg?20250403155344",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-03 15:37:00",
        "Headline": "Most of the 83 songs, which were written and re-recorded between 1983 and 2018, have never been heard before.",
        "Content": "Bruce Springsteen is to release seven albums of mostly unheard material this summer. The US singer said the songs, written and re-recorded between 1983 and 2018, were being made public after he began completing \"everything I had in my vault\" during the COVID-19 pandemic. In a short video posted on Instagram, Springsteen said the albums were \"records that were full records, some of them even to the point of being mixed and not released\". The 83-song collection is being released in a box set called Tracks II: The Lost Albums and goes on sale on 27 June. Some 74 of the tracks have never been heard before. The 75-year-old first teased the release on Wednesday morning with a short social media video accompanied by text which said: \"What was lost has been found\". Tracks II is the follow-up to the star's first Tracks volume, a four-CD collection of 66 unreleased songs, released in 1998. The New Jersey-born rocker, nicknamed The Boss, last released a studio album in 2022. Only the Strong Survive was a collection of covers, including songs by Motown and soul artists, such as the Four Tops, The Temptations, The Supremes, Frankie Wilson and Jimmy Ruffin. The late soul legend Sam Moore, who died in January and was a frequent Springsteen collaborator, sang on two of the tracks. Read more from Sky News:Tributes to 'genius' KilmerPenguin island facing tariffsRichest billionaires named Springsteen is coming to the UK in May to launch a two-month tour of Europe with his E Street Band. The shows will include performances at the Co-op Live in Manchester and Liverpool's Anfield stadium. The singer-songwriter has sold more than 140 million records since his debut on the music scene in 1973, according to his website."
    }
]