[
    {
        "title": "Donald Trump says he will impose 25% tariffs on steel and aluminium imports",
        "description": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico.",
        "url": "https://news.sky.com/story/trump-reiterates-desire-to-make-canada-51st-state-and-says-he-will-impose-tariffs-on-steel-and-aluminium-imports-13306144",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump_6824303.jpg?20250209222937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 15:10:00",
        "Headline": "The US president also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation.",
        "Content": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico. The president said he would make the announcement on Monday, signalling yet another major escalation in his trade policy overhaul. Speaking on Air Force One as he flew from Florida to New Orleans for the Super Bowl, he said the new levies would be on top of existing metals duties. \"Any steel coming into the United States is going to have a 25% tariff,\" Mr Trump told reporters on Sunday. When asked about aluminium, he responded, \"aluminium, too\" will be subject to the trade penalties. The share prices of Japanese steel makers fell around 1% on the news. Mr Trump also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation. \n                  Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump\n                 \n                  Day 21: Trump's popularity, Musk's influence and America's soft power  \n                 \n                  Judge pauses Donald Trump's plan to put thousands of USAID workers on leave\n                 \"And very simply, it's, if they charge us, we charge them,\" Mr Trump said of the reciprocal tariff plan. Mr Trump previously threatened 25% import taxes on all goods from Canada and Mexico, though he paused them for 30 days last week. At the same time, he proceeded to add 10% duties on imports from China. Also last week, Mr Trump said tariffs on the European Union would be implemented \"pretty soon\". When questioned about the UK, the president said Britain was \"out of line\" when it came to trade but he thought the situation could be \"worked out\" without the use of tariffs. 👉 Follow Trump 100 on your podcast app 👈 His latest comments on the presidential plane came just after German Chancellor Olaf Scholz said the EU was ready to respond \"within an hour\" if the US levied tariffs on European goods, highlighting the risks of an escalating trade war. China's retaliatory tariffs on some US exports are due to take effect on Monday, with no sign yet of progress between Beijing and Washington. 'Gulf of America' day Also on board Air Force One, Mr Trump signed a proclamation declaring 9 February 2025 as the first ever \"Gulf of America\" day. One of the first executive orders the president signed was renaming the Gulf of Mexico. While signing the latest proclamation, he posed in front of a map with the newly changed name. Trump reiterates desire to make Canada 51st state In a separate interview earlier on Fox News, Mr Trump repeated calls to make Canada \"the 51st state\" as he reiterated his support for tech billionaire Elon Musk.  When asked if he was serious about Canada being a 51st state, Mr Trump said: \"I think Canada would be much better off. \"We lose $200bn a year with Canada. And I'm not going to let that happen. It's too much. \"Why are we paying $200bn a year essentially in subsidy to Canada? Now, if they are a 51st state, I don't mind doing it.\" He also continued to voice support for Mr Musk. The X owner is spearheading the US president's efforts to cut costs and bureaucracy in government, which has already seen the US Aid Agency for International Development targeted. Named the Department of Government Efficiency (DOGE), its aim is to find ways to sack federal workers, cut programmes and cut federal regulations. Read more from Sky News:Mexico asks Google not to follow Trump name changeAll major pieces of plane and helicopter collision have been recovered However, there have been suggestions the Tesla chief's access to government systems could pose a threat to national security. But Mr Trump has said he trusts Mr Musk and is going to ask him to investigate billions of dollars of \"fraud and abuse\" within the US military. \"I've had great help with Elon Musk. He's been terrific,\" he said."
    },
    {
        "title": "Labour MP 'deeply regrets' comments he made on WhatsApp group - after minister sacked for remarks on same chat",
        "description": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat.",
        "url": "https://news.sky.com/story/labour-mp-deeply-regrets-comments-made-on-whatsapp-group-after-health-minister-sacked-for-remarks-on-same-chat-13306335",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-oliver-ryan-parliament_6824321.jpg?20250209234022",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 18:19:00",
        "Headline": "In a statement on X, Oliver Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the Labour investigation.",
        "Content": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat. Burnley MP Oliver Ryan is being investigated by the Labour Party over comments which a government source said were \"unacceptable and deeply disappointing\". The source told the Press Association: \"While a Labour Party investigation is already under way, the chief whip will also be speaking to him and no action is off the table.\" Politics latest: Minister says Andrew Gwynne's comments 'unacceptable' In a statement on X, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" \n                  Casual nature of sacked Labour minister's outrageous comments will worry Starmer after his battle to change party\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  Baroness Harman issues warning to Labour MPs who set up group over Reform UK threat\n                 He also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". \"I did not see every message, but I accept responsibility for not being more proactive in challenging what was said,\" he added. Mr Gwynne, the MP for Gorton and Denton, was sacked as health minister by Sir Keir Starmer on Saturday over remarks he posted on the chat. He reportedly made antisemitic comments and \"joked\" about a pensioner constituent, saying he hoped she died before the next election, according to the Mail on Sunday. Meanwhile, a senior official earlier said Labour will punish any other MP or minister caught up in the scandal. Speaking to Sunday Morning With Trevor Phillips, housing minister Matthew Pennycook described Mr Gwynne's remarks as \"unacceptable\". \"I don't know, personally, what other people on that WhatsApp conversation have said... I've being very clear, there's an investigation taking place into the whole incident. \"What the public can take from the way the prime minister has acted decisively in this case to dismiss Andrew Gwynne is that if any other Labour MP or minister falls short he will act to uphold the highest standards in public office.\" Read more from Sky News:Much-disputed spirit of Thatcher marches through UK politicsFarage claims Reform UK has 200,000 members On Saturday, a Labour spokesperson confirmed Mr Gwynne had been suspended as a member of the Labour Party. Following the decision by Labour, Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. \"I've served the Labour Party all my life and it was a huge honour to be appointed a minister by Keir Starmer. \"I entirely understand the decisions the PM and the party have taken and, while very sad to have been suspended, will support them in any way I can.\" Mr Gwynne is the latest minister to go, with ex-treasury minister Tulip Siddiq quitting last month and Louise Haigh stepping aside as transport minister in November."
    },
    {
        "title": "Super Bowl 2025 - latest updates",
        "description": null,
        "url": "https://news.sky.com/story/super-bowl-2025-latest-updates-13306447",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-travis-kelce-super-bowl_6824314.jpg?20250209230804",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 23:04:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Liverpool suffer shock defeat in FA Cup to struggling Championship side Plymouth Argyle",
        "description": "Premier League leaders Liverpool have been knocked out of the FA Cup by struggling Championship side Plymouth Argyle. \n",
        "url": "https://news.sky.com/story/liverpool-suffer-shock-defeat-in-fa-cup-to-struggling-championship-side-plymouth-argyle-13306068",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-fa-cup-plymouth-liverpool_6824066.jpg?20250209171517",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 14:10:00",
        "Headline": "Plymouth Argyle, who also beat top-flight club Brentford in the previous round, progressed to the last 16 of the FA Cup courtesy of Ryan Hardie's second-half penalty.",
        "Content": "Premier League leaders Liverpool have been knocked out of the FA Cup by struggling Championship side Plymouth Argyle. \n Arne Slot's team were beaten 1-0 by the Devon club, who currently sit at the bottom of the Championship table four points adrift of safety. Argyle, who also beat top-flight club Brentford in the previous round, progressed to the last 16 of the competition courtesy of Ryan Hardie's second-half penalty. Read more:Plymouth stun Liverpool in FA Cup - reaction Plymouth have only recorded one win in the Championship since early November, beating West Brom 2-1 on 1 February. Bosnian manager Miron Muslic, who replaced Wayne Rooney in January, said he was \"speechless\" after the upset. \"Another chapter in Argyle's history,\" he told ITV. \"Showing this performance, desire and joy to defend against Liverpool, who will be on you. The lads did it fantastic today. \n                  More than 600 immigration arrests in January - as government expects rise in deportations\n                 \n                  Labour fights Farage with Trump tactics and a publicity blitz on immigration\n                 \n                  Labour MP 'deeply regrets' comments he made on WhatsApp group - after minister sacked for remarks on same chat\n                 \"A big moment and I think I will realise that when I go back to my apartment and have a moment. It's the game we love, and those moments sometimes as coach we miss. I also want to enjoy it.\" Liverpool's dreams of winning the Quadruple are now over after the defeat. They will next play Merseyside rivals Everton on Wednesday when they can extend their lead at the top of the Premier League to nine points with a victory. Speaking to ITV, Slot praised Plymouth and said \"they deserve all the credit,\" and added: \"We were not having a very good day. A result like this is the outcome. \"I can't say the boys didn't fight, both teams barely created a chance and then it was a penalty. In a game like this, it is up to one moment. That moment was for them and they deserve it.\" The Liverpool manager then said: \"Not easy to create especially if a team has not played together all the time. \"It hurts everyone. We were all wanting to be in this competition for as long as possible.\""
    },
    {
        "title": "Essex Police sergeant Tyler Coppin sacked and barred over tragedy chanting at Liverpool game",
        "description": "A police officer who took part in tragedy chanting against Liverpool fans has been sacked.",
        "url": "https://news.sky.com/story/essex-police-sergeant-tyler-coppin-sacked-and-barred-over-tragedy-chanting-at-liverpool-game-13306425",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-anfield-liverpool_6824311.jpg?20250209223847",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 21:36:00",
        "Headline": "Sergeant Tyler Coppin, of Essex Police, pleaded guilty to the public order offence and was handed a three-year football banning order in December.",
        "Content": "A police officer who took part in tragedy chanting against Liverpool fans has been sacked. Sergeant Tyler Coppin, of Essex Police, pleaded guilty to the public order offence while at a Premier League match between Liverpool and Chelsea at Anfield on 20 October. Merseyside Police said that the officer was seen by club stewards chanting toward Liverpool supporters, before being ejected from the stadium and arrested by local police. Coppin was handed a three-year football banning order, along with £645 in fines and costs in December. On Friday, a misconduct panel - chaired by Essex Police's Chief Constable Ben-Julian Harrington - found Coppin had breached standards of professional behaviour concerning honesty and integrity, authority, respect and courtesy and discreditable conduct. He was dismissed from the force without notice and will be placed on the College of Policing barred list. The chief constable noted Coppin's remorse for the incident and his previously unblemished policing record, but added that while the dismissal was over \"a moment's serious stupidity... this is the only appropriate outcome\". He added: \"His actions will seriously undermine public trust and confidence and I must send a clear message to officers, staff and the wider public that behaviour such as this cannot and will not be tolerated in policing. \"If officers are responsible for upholding the law, it cannot be right that they break it.\" The Crown Prosecution Service describes tragedy chanting as when fans sing, chant or gesture offensive messages about disasters or accidents involving players or fans. Read more from Sky News:Former Tory MP speaks from UkraineTwo children in hospital after car collision It comes after Leeds United accused a section of Millwall fans of singing \"vile chants\" during Saturday's FA Cup tie at Elland Road. The club said in a statement alleging chants relating to the murders of Whites fans Kevin Speight and Christopher Loftus before a UEFA Cup semi-final at Galatasaray in 2000 were made during the game."
    },
    {
        "title": "Israeli forces withdraw from key Netzarim corridor in Gaza",
        "description": "Israeli forces have begun pulling back from a key corridor through Gaza as part of its ceasefire deal with Hamas.",
        "url": "https://news.sky.com/story/israeli-forces-withdraw-from-key-netzarim-corridor-in-gaza-13306010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-netzarim-corridor-gaza_6823912.jpg?20250209141745",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-02-09 15:33:00",
        "Headline": "As part of the deal, Israel agreed to withdraw its military from the four-mile-long Netzarim corridor, which separates northern Gaza from the south.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Israeli forces have begun pulling back from a key corridor through Gaza as part of its ceasefire deal with Hamas. As part of the deal, Israel agreed to withdraw its military from the four-mile-long Netzarim corridor, which separates northern Gaza from the south. When the ceasefire began last month Israel began allowing Palestinians to cross the corridor and return to their homes, many of which are little more than rubble after 15 months of war. Hamas has celebrated the withdrawal as a victory and said the Hamas-run police force had deployed to the area to supervise the flow of Palestinians passing through. Separately on Sunday, the Palestinian health ministry said two women in their 20s - including one who was pregnant - were fatally shot by Israeli gunfire in the northern occupied West Bank, where troops have been carrying out a broad operation. And five Thai workers who were held hostage for more than a year have arrived back in Bangkok. They were embraced by family members, some of whom cried, in the arrivals hall at the city's airport. They were the second group of Thai hostages released since the war broke out. During an earlier ceasefire, in November 2023, 23 Thai nationals were released in exchange for assistance from Qatar and Iran. Little progress in negotiating second phase of deal Little progress has emerged in negotiating the second phase of the deal, which is supposed to see all Israeli hostages released in return for a complete Israeli withdrawal from Gaza. A delegation from Israel has arrived in Doha for further talks, amid concern the deal might collapse before all 76 remaining hostages are freed. Israel has previously said it will not agree to a complete withdrawal until Hamas's military and political capabilities are eliminated - while Hamas has countered that it will not hand over the final hostages until Israel removes all its troops from Gaza. During the first 42-day phase of the deal, which began on 19 January, Hamas has been gradually releasing 33 Israeli hostages captured during its rampage into Israel on 7 October 2023 in exchange for the return of hundreds of Palestinian prisoners. Read more:What you need to know about Trump's Gaza planThe Israel-Hamas war in numbers  Trump to meet leaders of Saudi Arabia and Egypt The issue has been further complicated in recent weeks by Donald Trump's proposal to relocate Palestinians so the US can take over Gaza. The US president said his country would then develop the land and turn it into the \"Riviera of the Middle East,\" while the enclave's population of two million are resettled in nearby countries such as Egypt and Jordan. Speaking on Air Force One on his way to the Super Bowl on Sunday, Mr Trump reiterated this idea, saying he would make Gaza into a \"good site\" for future development. He said he was committed to buying and owning in Gaza, adding that he may give sections to other states in the Middle East to rebuild. Israel welcomed the idea, with Prime Minister Benjamin Netanyahu saying a Palestinian state should be created in Saudi Arabia because \"they have a lot of land over there\". But the Arab world has rejected Mr Trump's idea, with Saudi Arabia saying Mr Netanyau's remarks \"aim to divert attention from the successive crimes committed by the Israeli occupation against our Palestinian brothers in Gaza, including the ethnic cleansing they are being subjected to\". Now Mr Trump is set to meet Egyptian President Abdel Fattah el-Sisi and possibly Saudi Arabian Crown Prince Mohammed bin Salman, the Israeli president Isaac Herzog has said, although he gave no exact dates for the talks. Israel's war with Hamas, which has left much of Gaza devastated, was sparked when Hamas crossed into Israel on 7 October 2023, killing around 1,200 Israelis and taking around 250 hostages. The war has killed more than 47,000 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants."
    },
    {
        "title": "Nigel Farage claims Reform UK has 200,000 members and has warning for Labour",
        "description": "Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000.",
        "url": "https://news.sky.com/story/nigel-farage-claims-reform-uk-has-200000-members-and-has-warning-for-labour-13306272",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-reform-uk_6824054.jpg?20250209170359",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-09 17:40:00",
        "Headline": "The party's growth since its founding in 2021 has been \"truly extraordinary\", Mr Farage said, promising that Reform UK is on course to become \"the biggest political party in this country\".",
        "Content": " Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000. Speaking to delegates at a regional conference in Wiltshire, the Clacton MP called his party's growth \"truly extraordinary\" since its founding in 2021 as the re-launch of the Brexit Party. With the party's live membership ticker displayed on a screen behind him, he said it was on course to become \"the biggest political party in this country\". \"That's our goal. That's our aim. That's our target,\" he said. Reform UK is already ahead of the Conservatives, who revealed in November that almost 132,000 members were eligible to vote during the party's leadership election to replace Rishi Sunak. Referring to last year's row with new Conservative leader Kemi Badenoch, when she doubted Reform's total membership, he said the party \"got people to come in and check and look at the back end, and it's all absolutely legit\". Reflecting on Reform UK's rapid growth, he said: \"In the modern world to have got here this quickly, isn't it truly extraordinary? \"Doesn't it show you something is happening in this country? People want real political leadership. They want real change. That's what that tells you.\" The party polled more than four million votes in last year's election, winning five seats, including Mr Farage's Essex constituency. Mr Farage, the former head of UKIP, had ruled himself out of standing but made a U-turn after saying he had a \"terrible sense of guilt\" for not offering to run. In another sign of its growing threat to the main parties, last week, Reform UK came top in a poll of people who voted Conservative at the last election. Switching his focus to their political opponents, he declared that \"when we overtake [the Labour Party], we will be the biggest political party in this country\". The Tories had \"betrayed the country with open door immigration, increased taxes, with not delivering Brexit\", he said. \"A 10 million increase in the population of this country over the course of the last 20 years has devalued the living standards of everybody in this country,\" Mr Farage added. \"It's truly incredible. The wave of people that came under Boris Johnson from 2021, of the millions that came, only 20% are working or contributing. The rest are costing us, the taxpayer. It's an outrage.\" Read more:More ministers 'could be caught up' in scandalWarning to MPs behind Reform threat chat groupGreen or growth? Only one winner for PM Spelling out Reform UK's key platform, he said: \"Anyone that comes here illegally will be deported. Simple as that. \"We're the only party that says 'no more population increase through immigration for many years to come'.\" Calling it \"the one net zero I approve of\", he said the UK \"hasn't got enough houses, we can't get GP appointments, our roads are completely overloaded, our infrastructure is crumbling\"."
    },
    {
        "title": "Labour MP 'deeply regrets' comments he made on WhatsApp group - after minister sacked for remarks on same chat",
        "description": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat.",
        "url": "https://news.sky.com/story/labour-mp-deeply-regrets-comments-made-on-whatsapp-group-after-health-minister-sacked-for-remarks-on-same-chat-13306335",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-oliver-ryan-parliament_6824321.jpg?20250209234022",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-09 18:19:00",
        "Headline": "In a statement on X, Oliver Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the Labour investigation.",
        "Content": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat. Burnley MP Oliver Ryan is being investigated by the Labour Party over comments which a government source said were \"unacceptable and deeply disappointing\". The source told the Press Association: \"While a Labour Party investigation is already under way, the chief whip will also be speaking to him and no action is off the table.\" Politics latest: Minister says Andrew Gwynne's comments 'unacceptable' In a statement on X, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" \n                  Casual nature of sacked Labour minister's outrageous comments will worry Starmer after his battle to change party\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  Baroness Harman issues warning to Labour MPs who set up group over Reform UK threat\n                 He also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". \"I did not see every message, but I accept responsibility for not being more proactive in challenging what was said,\" he added. Mr Gwynne, the MP for Gorton and Denton, was sacked as health minister by Sir Keir Starmer on Saturday over remarks he posted on the chat. He reportedly made antisemitic comments and \"joked\" about a pensioner constituent, saying he hoped she died before the next election, according to the Mail on Sunday. Meanwhile, a senior official earlier said Labour will punish any other MP or minister caught up in the scandal. Speaking to Sunday Morning With Trevor Phillips, housing minister Matthew Pennycook described Mr Gwynne's remarks as \"unacceptable\". \"I don't know, personally, what other people on that WhatsApp conversation have said... I've being very clear, there's an investigation taking place into the whole incident. \"What the public can take from the way the prime minister has acted decisively in this case to dismiss Andrew Gwynne is that if any other Labour MP or minister falls short he will act to uphold the highest standards in public office.\" Read more from Sky News:Much-disputed spirit of Thatcher marches through UK politicsFarage claims Reform UK has 200,000 members On Saturday, a Labour spokesperson confirmed Mr Gwynne had been suspended as a member of the Labour Party. Following the decision by Labour, Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. \"I've served the Labour Party all my life and it was a huge honour to be appointed a minister by Keir Starmer. \"I entirely understand the decisions the PM and the party have taken and, while very sad to have been suspended, will support them in any way I can.\" Mr Gwynne is the latest minister to go, with ex-treasury minister Tulip Siddiq quitting last month and Louise Haigh stepping aside as transport minister in November."
    },
    {
        "title": "Essex Police sergeant Tyler Coppin sacked and barred over tragedy chanting at Liverpool game",
        "description": "A police officer who took part in tragedy chanting against Liverpool fans has been sacked.",
        "url": "https://news.sky.com/story/essex-police-sergeant-tyler-coppin-sacked-and-barred-over-tragedy-chanting-at-liverpool-game-13306425",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-anfield-liverpool_6824311.jpg?20250209223847",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-09 21:36:00",
        "Headline": "Sergeant Tyler Coppin, of Essex Police, pleaded guilty to the public order offence and was handed a three-year football banning order in December.",
        "Content": "A police officer who took part in tragedy chanting against Liverpool fans has been sacked. Sergeant Tyler Coppin, of Essex Police, pleaded guilty to the public order offence while at a Premier League match between Liverpool and Chelsea at Anfield on 20 October. Merseyside Police said that the officer was seen by club stewards chanting toward Liverpool supporters, before being ejected from the stadium and arrested by local police. Coppin was handed a three-year football banning order, along with £645 in fines and costs in December. On Friday, a misconduct panel - chaired by Essex Police's Chief Constable Ben-Julian Harrington - found Coppin had breached standards of professional behaviour concerning honesty and integrity, authority, respect and courtesy and discreditable conduct. He was dismissed from the force without notice and will be placed on the College of Policing barred list. The chief constable noted Coppin's remorse for the incident and his previously unblemished policing record, but added that while the dismissal was over \"a moment's serious stupidity... this is the only appropriate outcome\". He added: \"His actions will seriously undermine public trust and confidence and I must send a clear message to officers, staff and the wider public that behaviour such as this cannot and will not be tolerated in policing. \"If officers are responsible for upholding the law, it cannot be right that they break it.\" The Crown Prosecution Service describes tragedy chanting as when fans sing, chant or gesture offensive messages about disasters or accidents involving players or fans. Read more from Sky News:Former Tory MP speaks from UkraineTwo children in hospital after car collision It comes after Leeds United accused a section of Millwall fans of singing \"vile chants\" during Saturday's FA Cup tie at Elland Road. The club said in a statement alleging chants relating to the murders of Whites fans Kevin Speight and Christopher Loftus before a UEFA Cup semi-final at Galatasaray in 2000 were made during the game."
    },
    {
        "title": "UK weather: Chilly start to the week expected with temperatures as low as -6C tonight",
        "description": "It will be a chilly start to the week, as temperatures may plunge as low as -6C (21.2F) tonight, with a light dusting of snow possible in some hilly regions.",
        "url": "https://news.sky.com/story/uk-weather-chilly-start-to-the-week-expected-with-temperatures-as-low-as-6c-tonight-13306163",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-weather-february_6824046.jpg?20250209165556",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-09 15:37:00",
        "Headline": "There will also be icy patches and overnight frost in places, although the weather is not expected to be disruptive.",
        "Content": "It will be a chilly start to the week, as temperatures may plunge as low as -6C (21.2F) tonight, with a light dusting of snow possible in some hilly regions. Temperatures will possibly turn milder over the weekend, with daytime highs generally a few degrees below the February average and often a rather raw east to south-easterly wind. Fairly cloudy skies and the wind will tend to keep most places frost-free, although it will feel freezing, but lighter winds and clearer conditions over western parts in particular will allow temperatures to drop below zero on occasion. Get the weather forecast where you are Some parts of north-western Scotland may see temperatures as low as -6C tonight. It will be cloudy for many with rain and showers at times. A covering of snow is likely over some hills, and over some central parts. There will also be icy patches and overnight frost in places, although the weather is not expected to be disruptive. A yellow cold health alert has been issued by the UK Health Security Agency (UKHSA) for the south-east of England and parts of northern England and remains in place until 9am on 11 February. It may get brighter by the middle of the week but that forecast is still uncertain. Thousands without power after Eowyn Thousands of people remain cut off from electricity more than two weeks after Storm Eowyn's record-breaking winds hit Ireland. Power has been restored to 764,500 homes, farms, schools and businesses but some 3,500 remain without supply. Amid the reconnection efforts, scam text messages are purporting to come from ESB Networks. The National Cyber Security Centre warned members of the public to exercise caution when receiving messages from unknown numbers, and said government departments, agencies and banks will never text asking unexpectedly for bank details."
    },
    {
        "title": "Nigel Farage claims Reform UK has 200,000 members and has warning for Labour",
        "description": "Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000.",
        "url": "https://news.sky.com/story/nigel-farage-claims-reform-uk-has-200000-members-and-has-warning-for-labour-13306272",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-reform-uk_6824054.jpg?20250209170359",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-09 17:40:00",
        "Headline": "The party's growth since its founding in 2021 has been \"truly extraordinary\", Mr Farage said, promising that Reform UK is on course to become \"the biggest political party in this country\".",
        "Content": " Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000. Speaking to delegates at a regional conference in Wiltshire, the Clacton MP called his party's growth \"truly extraordinary\" since its founding in 2021 as the re-launch of the Brexit Party. With the party's live membership ticker displayed on a screen behind him, he said it was on course to become \"the biggest political party in this country\". \"That's our goal. That's our aim. That's our target,\" he said. Reform UK is already ahead of the Conservatives, who revealed in November that almost 132,000 members were eligible to vote during the party's leadership election to replace Rishi Sunak. Referring to last year's row with new Conservative leader Kemi Badenoch, when she doubted Reform's total membership, he said the party \"got people to come in and check and look at the back end, and it's all absolutely legit\". Reflecting on Reform UK's rapid growth, he said: \"In the modern world to have got here this quickly, isn't it truly extraordinary? \"Doesn't it show you something is happening in this country? People want real political leadership. They want real change. That's what that tells you.\" The party polled more than four million votes in last year's election, winning five seats, including Mr Farage's Essex constituency. Mr Farage, the former head of UKIP, had ruled himself out of standing but made a U-turn after saying he had a \"terrible sense of guilt\" for not offering to run. In another sign of its growing threat to the main parties, last week, Reform UK came top in a poll of people who voted Conservative at the last election. Switching his focus to their political opponents, he declared that \"when we overtake [the Labour Party], we will be the biggest political party in this country\". The Tories had \"betrayed the country with open door immigration, increased taxes, with not delivering Brexit\", he said. \"A 10 million increase in the population of this country over the course of the last 20 years has devalued the living standards of everybody in this country,\" Mr Farage added. \"It's truly incredible. The wave of people that came under Boris Johnson from 2021, of the millions that came, only 20% are working or contributing. The rest are costing us, the taxpayer. It's an outrage.\" Read more:More ministers 'could be caught up' in scandalWarning to MPs behind Reform threat chat groupGreen or growth? Only one winner for PM Spelling out Reform UK's key platform, he said: \"Anyone that comes here illegally will be deported. Simple as that. \"We're the only party that says 'no more population increase through immigration for many years to come'.\" Calling it \"the one net zero I approve of\", he said the UK \"hasn't got enough houses, we can't get GP appointments, our roads are completely overloaded, our infrastructure is crumbling\"."
    },
    {
        "title": "Two children in hospital after collision with car in Bradford",
        "description": "Two children have been taken to hospital - one with life-threatening injuries - after a collision in Bradford.",
        "url": "https://news.sky.com/story/two-children-in-hospital-after-collision-with-car-in-bradford-13306405",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bradford-west-yorkshire_6824254.jpg?20250209204842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-09 20:40:00",
        "Headline": "A man, understood by West Yorkshire Police to be the driver involved in the collision, was arrested at the scene.",
        "Content": "Two children have been taken to hospital - one with life-threatening injuries - after a collision in Bradford. West Yorkshire Police said they received a report of a serious collision involving a silver Toyota Yaris and the two children at 6.32pm on Sunday. The incident took place on Ransdale Road near the junction with Ramsey Street in Bradford. Both of the pedestrians have been taken to hospital by ambulance, one with life-threatening injuries. A man, understood to be the driver of the Yaris, was arrested at the scene. An investigation is ongoing and there are police at the scene. Officers have appealed for witnesses or video footage of the incident."
    },
    {
        "title": "Freed Thai hostages 'feel grateful' to be back home after being held captive for more than a year",
        "description": "Five Thai men held hostage for 15 months in Gaza have arrived back in their home country where they were reunited with their families.",
        "url": "https://news.sky.com/story/freed-thai-hostages-feel-grateful-to-be-back-home-after-being-held-captive-for-more-than-a-year-13305873",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pongsak-thaenna-thai_6823719.jpg?20250209111923",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-09 04:35:00",
        "Headline": "The farm workers had been taken during Hamas's cross-border attack in southern Israel on 7 October 2023.",
        "Content": " Five Thai men held hostage for 15 months in Gaza have arrived back in their home country where they were reunited with their families. Pongsak Thaenna, 36, Sarusak Rumnao, 32, Watchara Sriaoun, 33, Sathian Suwannakham, 35, and Bannawat Saethao, 27, were released by militants on 30 January as part of a ceasefire deal between Israel and Hamas. Mr Pongsak said all of the group \"feel grateful and are so delighted to return to our motherland once again\". In emotional scenes at Suvarnabhumi Airport in the Thai capital Bangkok on Sunday, they were met with embraces from their loved ones, some of whom cried. The farm workers were assessed at a hospital outside Tel Aviv before their return. Earlier this week, four of them were joined by one relative each. The five had been taken during Hamas's cross-border attack in southern Israel on 7 October 2023, when 1,200 people were killed and about 250 others kidnapped. During the assault, gunmen killed 41 Thais and seized 31 others, making them the largest group of foreigners held captive in Gaza. \n                  Israeli forces withdraw from key Netzarim corridor in Gaza\n                 \n                  Israel reacts with anger to hostage treatment - where does this leave the ceasefire?\n                 \n                  Hamas names three Israeli hostages it says it will release today after accusing Israel of breaching Gaza ceasefire\n                 Praise for officials Speaking during a news conference, Mr Pongsak praised officials for helping to get the group freed. He said: \"I would like to thank the prime minister, Ministry of Foreign Affairs, Ministry of Labour and relevant officers who helped us to be released. \"For today I get to be standing right here. It wouldn't have happened if it wasn't because of each one of you who provided assistance. \"All of us here feel grateful and are so delighted to return to our motherland once again. We all thank you very much. I don't know what to say. Thank you very much.\" Speaking to Sky News, Mr Pongsak's father, Wilas Thaenna, 64, from Buriram province, said he was feeling \"very very glad. I'm so touched\". \"I was so overwhelmed. I was speechless.\" The group then left to return to their hometowns in Thailand's northern and northeastern regions. 'We never gave up' Thai foreign minister Maris Sangiampongsa, who escorted the hostages back from Israel, expressed relief at their return. \"This is emotional... to come back to the embrace of their families,\" he said. \"We never gave up and this was the fruit of that.\" It comes a day after Hamas handed over three Israeli hostages whose gaunt appearance shocked Israelis, and Israel freed dozens of Palestinian prisoners in the latest stage of a fragile ceasefire aimed at ending the Gaza war.  Read more from Sky News:Harry and Meghan cheer during Invictus Games opening ceremonyFriends star urges Elon Musk to remove Kanye West from X  Many of the Thai agricultural workers lived in compounds on the outskirts of southern Israeli kibbutzim and towns, and Hamas militants overran those places first. The five now back home were the second batch of Thai hostages freed since the war broke out in October 2023. During a ceasefire-hostage deal in November 2023, some 23 Thais were released in an agreement negotiated between Thailand and Hamas, with assistance from Qatar and Iran. A Thai national is still believed to be held captive by Hamas, according to Thailand's foreign ministry. \"We still have hope and continue to work to bring them back,\" Mr Maris said, adding that this includes the bodies of two Thais. More than 47,000 Palestinians in Gaza have been killed in Israel's offensive, said the Hamas-run health ministry. The ministry does not distinguish between civilians and combatants in its count but has said that more than half of the fatalities are women and children."
    },
    {
        "title": "Man arrested and three in hospital after reports of stabbing incident in Dublin",
        "description": "A man has been arrested in Dublin after a \"serious incident\" that left three people in hospital.",
        "url": "https://news.sky.com/story/man-arrested-after-reports-of-stabbing-incident-in-dublin-13306206",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dublin-stoneybatter_6824199.png?20250209192937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-09 16:17:00",
        "Headline": "The incident is understood to have taken place in the Stoneybatter area, near central Dublin. Three men have been taken to hospital. ",
        "Content": "A man has been arrested in Dublin after a \"serious incident\" that left three people in hospital. Suspected knife attacks took place across several streets in the Arbour Hill of the Stoneybatter area in the Irish capital at around 3pm on Sunday. An Garda Siochana, the Irish police force, said the man - in his late 20s - is currently detained at a station in the north of the city. A spokesperson added: \"Three males, whose ages range from mid-20s to mid-40s, who were assaulted in the course of the incident have been taken to hospital for treatment, two males for serious but not life-threatening injuries, one male with less serious injuries. \"All three males remain in hospital receiving medical treatment at this time.\" The force added traffic restrictions had been lifted by around 5pm, and that they \"believe the suspect acted alone and are increasing their visibility in the area to reassure the community\". Police have also appealed for witnesses and video footage of the incident. Local Fine Gael councillor Ray McAdam said residents were told to lock their doors and stay inside, and added officers reacted very quickly and \"swarmed the place\". He added: \"There's a level of shock, a level of concern - but the overriding sense here in Stoneybatter is one of hope that those who have been impacted and injured will make a swift recovery.\" Read more from Sky News:Ireland's first visually impaired politician resigns after arrestReeves calls in bank chiefs for growth talks Irish premier Micheal Martin later said on social media that \"our thoughts are with the victims of the shocking attacks\". \"I want to pay tribute to the Gardai and emergency services for their prompt response,\" he added. \"I wish all those injured a full recovery and urge anyone with any information to contact Gardai.\" Jim O'Callaghan, justice minister, added he was receiving updates from An Garda Siochana about \"this awful random attack\". Sinn Fein leader Mary Lou McDonald said it was \"terrible news\" and added: \"My thoughts are with those injured and their families. The community is in a state of shock.\""
    },
    {
        "title": "Super Bowl 2025 - latest updates",
        "description": null,
        "url": "https://news.sky.com/story/super-bowl-2025-latest-updates-13306447",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-travis-kelce-super-bowl_6824314.jpg?20250209230804",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-09 23:04:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Israeli forces withdraw from key Netzarim corridor in Gaza",
        "description": "Israeli forces have begun pulling back from a key corridor through Gaza as part of its ceasefire deal with Hamas.",
        "url": "https://news.sky.com/story/israeli-forces-withdraw-from-key-netzarim-corridor-in-gaza-13306010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-netzarim-corridor-gaza_6823912.jpg?20250209141745",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-02-09 15:33:00",
        "Headline": "As part of the deal, Israel agreed to withdraw its military from the four-mile-long Netzarim corridor, which separates northern Gaza from the south.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Israeli forces have begun pulling back from a key corridor through Gaza as part of its ceasefire deal with Hamas. As part of the deal, Israel agreed to withdraw its military from the four-mile-long Netzarim corridor, which separates northern Gaza from the south. When the ceasefire began last month Israel began allowing Palestinians to cross the corridor and return to their homes, many of which are little more than rubble after 15 months of war. Hamas has celebrated the withdrawal as a victory and said the Hamas-run police force had deployed to the area to supervise the flow of Palestinians passing through. Separately on Sunday, the Palestinian health ministry said two women in their 20s - including one who was pregnant - were fatally shot by Israeli gunfire in the northern occupied West Bank, where troops have been carrying out a broad operation. And five Thai workers who were held hostage for more than a year have arrived back in Bangkok. They were embraced by family members, some of whom cried, in the arrivals hall at the city's airport. They were the second group of Thai hostages released since the war broke out. During an earlier ceasefire, in November 2023, 23 Thai nationals were released in exchange for assistance from Qatar and Iran. Little progress in negotiating second phase of deal Little progress has emerged in negotiating the second phase of the deal, which is supposed to see all Israeli hostages released in return for a complete Israeli withdrawal from Gaza. A delegation from Israel has arrived in Doha for further talks, amid concern the deal might collapse before all 76 remaining hostages are freed. Israel has previously said it will not agree to a complete withdrawal until Hamas's military and political capabilities are eliminated - while Hamas has countered that it will not hand over the final hostages until Israel removes all its troops from Gaza. During the first 42-day phase of the deal, which began on 19 January, Hamas has been gradually releasing 33 Israeli hostages captured during its rampage into Israel on 7 October 2023 in exchange for the return of hundreds of Palestinian prisoners. Read more:What you need to know about Trump's Gaza planThe Israel-Hamas war in numbers  Trump to meet leaders of Saudi Arabia and Egypt The issue has been further complicated in recent weeks by Donald Trump's proposal to relocate Palestinians so the US can take over Gaza. The US president said his country would then develop the land and turn it into the \"Riviera of the Middle East,\" while the enclave's population of two million are resettled in nearby countries such as Egypt and Jordan. Speaking on Air Force One on his way to the Super Bowl on Sunday, Mr Trump reiterated this idea, saying he would make Gaza into a \"good site\" for future development. He said he was committed to buying and owning in Gaza, adding that he may give sections to other states in the Middle East to rebuild. Israel welcomed the idea, with Prime Minister Benjamin Netanyahu saying a Palestinian state should be created in Saudi Arabia because \"they have a lot of land over there\". But the Arab world has rejected Mr Trump's idea, with Saudi Arabia saying Mr Netanyau's remarks \"aim to divert attention from the successive crimes committed by the Israeli occupation against our Palestinian brothers in Gaza, including the ethnic cleansing they are being subjected to\". Now Mr Trump is set to meet Egyptian President Abdel Fattah el-Sisi and possibly Saudi Arabian Crown Prince Mohammed bin Salman, the Israeli president Isaac Herzog has said, although he gave no exact dates for the talks. Israel's war with Hamas, which has left much of Gaza devastated, was sparked when Hamas crossed into Israel on 7 October 2023, killing around 1,200 Israelis and taking around 250 hostages. The war has killed more than 47,000 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants."
    },
    {
        "title": "Donald Trump says he will impose 25% tariffs on steel and aluminium imports",
        "description": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico.",
        "url": "https://news.sky.com/story/trump-reiterates-desire-to-make-canada-51st-state-and-says-he-will-impose-tariffs-on-steel-and-aluminium-imports-13306144",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump_6824303.jpg?20250209222937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-09 15:10:00",
        "Headline": "The US president also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation.",
        "Content": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico. The president said he would make the announcement on Monday, signalling yet another major escalation in his trade policy overhaul. Speaking on Air Force One as he flew from Florida to New Orleans for the Super Bowl, he said the new levies would be on top of existing metals duties. \"Any steel coming into the United States is going to have a 25% tariff,\" Mr Trump told reporters on Sunday. When asked about aluminium, he responded, \"aluminium, too\" will be subject to the trade penalties. The share prices of Japanese steel makers fell around 1% on the news. Mr Trump also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation. \n                  Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump\n                 \n                  Day 21: Trump's popularity, Musk's influence and America's soft power  \n                 \n                  Judge pauses Donald Trump's plan to put thousands of USAID workers on leave\n                 \"And very simply, it's, if they charge us, we charge them,\" Mr Trump said of the reciprocal tariff plan. Mr Trump previously threatened 25% import taxes on all goods from Canada and Mexico, though he paused them for 30 days last week. At the same time, he proceeded to add 10% duties on imports from China. Also last week, Mr Trump said tariffs on the European Union would be implemented \"pretty soon\". When questioned about the UK, the president said Britain was \"out of line\" when it came to trade but he thought the situation could be \"worked out\" without the use of tariffs. 👉 Follow Trump 100 on your podcast app 👈 His latest comments on the presidential plane came just after German Chancellor Olaf Scholz said the EU was ready to respond \"within an hour\" if the US levied tariffs on European goods, highlighting the risks of an escalating trade war. China's retaliatory tariffs on some US exports are due to take effect on Monday, with no sign yet of progress between Beijing and Washington. 'Gulf of America' day Also on board Air Force One, Mr Trump signed a proclamation declaring 9 February 2025 as the first ever \"Gulf of America\" day. One of the first executive orders the president signed was renaming the Gulf of Mexico. While signing the latest proclamation, he posed in front of a map with the newly changed name. Trump reiterates desire to make Canada 51st state In a separate interview earlier on Fox News, Mr Trump repeated calls to make Canada \"the 51st state\" as he reiterated his support for tech billionaire Elon Musk.  When asked if he was serious about Canada being a 51st state, Mr Trump said: \"I think Canada would be much better off. \"We lose $200bn a year with Canada. And I'm not going to let that happen. It's too much. \"Why are we paying $200bn a year essentially in subsidy to Canada? Now, if they are a 51st state, I don't mind doing it.\" He also continued to voice support for Mr Musk. The X owner is spearheading the US president's efforts to cut costs and bureaucracy in government, which has already seen the US Aid Agency for International Development targeted. Named the Department of Government Efficiency (DOGE), its aim is to find ways to sack federal workers, cut programmes and cut federal regulations. Read more from Sky News:Mexico asks Google not to follow Trump name changeAll major pieces of plane and helicopter collision have been recovered However, there have been suggestions the Tesla chief's access to government systems could pose a threat to national security. But Mr Trump has said he trusts Mr Musk and is going to ask him to investigate billions of dollars of \"fraud and abuse\" within the US military. \"I've had great help with Elon Musk. He's been terrific,\" he said."
    },
    {
        "title": "Ireland's first visually impaired politician resigns after drunk arrest",
        "description": "The first visually impaired politician to serve in Ireland's parliament has resigned from his party after being arrested while drunk on a Dublin street.",
        "url": "https://news.sky.com/story/irelands-first-visually-impaired-politician-resigns-after-drunk-arrest-13306015",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-martin-conway-ireland_6823861.jpg?20250209125804",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2025-02-09 13:17:00",
        "Headline": "Fifty-year-old Martin Conway has admitted he did not inform his party of the arrest.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n The first visually impaired politician to serve in Ireland's parliament has resigned from his party after being arrested while drunk on a Dublin street. Just days after being re-elected to the Seanad (Senate), Martin Conway admitted that he was arrested in the early hours of 22 January \"for being in an intoxicated state due to consumption of sleeping tablets and alcohol\". He said: \"I was detained at Store Street Garda Station and subsequently released without charge a number of hours later.\" The 50-year-old member of the Seanad (the upper house) admitted that he did not inform his party of the arrest. Senator Conway was a member of Fine Gael, led by the current deputy prime minister Simon Harris. In a statement, the senator said he \"would like to apologise unreservedly for this to my family, colleagues, supporters and my nominating body, Vision Ireland\". Read more from Sky News:Harry and Meghan cheer during Invictus Games opening ceremonyFriends star urges Elon Musk to remove Kanye West from X \n                  Man arrested and three in hospital after reports of stabbing incident in Dublin\n                 \n                  Marks & Spencer recalls two chicken products after salmonella detected\n                 \n                  First signs of relief from Storm Eowyn, but Ireland still counting the cost\n                 He added: \"I let myself down. I would also like to apologise to the members of An Garda Síochána [Irish police] for having to deal with this matter. \"I have resigned from the Fine Gael Parliamentary Party. I understand that a disciplinary process will now commence.\" Fine Gael said it \"notes\" the senator's \"statement, apologies and his resignation of the party whip\", and confirmed the matter is now subject to a party disciplinary process. Senator Conway, from Co Clare, was born with congenital cataracts. He has been a board member of the charity Vision Ireland since 2013. The organisation has been approached for comment. His arrest took place just hours before the Dail (lower house of the parliament) met to confirm Micheal Martin as the new taoiseach, or prime minister. Chaotic scenes in the chamber over speaking rights led to that process being postponed until the following day. New senators were elected or nominated in an election in January. Just six days ago, Senator Conway said he was \"absolutely delighted\" to be re-elected and thanked his supporters. The Seanad consists of 60 members, who are elected to five vocational panels, from two university constituencies or nominated by the taoiseach. New senators include former Sky News broadcaster Alison Comyn."
    },
    {
        "title": "All major pieces of plane and helicopter in mid-air collision in Washington DC have been recovered, say crash investigators",
        "description": "All major pieces have now been recovered of the passenger plane and US army helicopter which collided in mid-air in Washington DC last week, say safety officials.",
        "url": "https://news.sky.com/story/all-major-pieces-of-plane-and-helicopter-in-mid-air-collision-in-washington-dc-have-been-recovered-say-crash-investigators-13305865",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-helicopter_6823704.jpg?20250209011825",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-09 00:55:00",
        "Headline": "Salvage crews have been working to recover the wreckage of the American Airlines jet and the Black Hawk helicopter.",
        "Content": " All major pieces have now been recovered of the passenger plane and US army helicopter which collided in mid-air in Washington DC last week, say safety officials. Sixty-seven people were killed in the 29 January disaster which left both aircraft in the Potomac River after they plunged into the water. The remains of all the victims have been recovered. There were no survivors. Salvage crews have been working to recover the wreckage of the American Airlines jet and the Black Hawk helicopter. Their black boxes have been found and crash debris is now in a hangar in Arlington, Virginia, as the probe continues. The National Transportation Safety Board (NTSB) said: \"Investigators will be looking for witness marks on the aircraft that could provide clues to the angle of collision.\" On Saturday, a plane equipped with lasers flew low over the crash scene as it scanned the bottom of the river. Crews will spend the coming days looking for smaller debris before finishing the work in around a week. At the time of the disaster, American Airlines Flight 5342, carrying 60 passengers and four crew, was preparing to land at nearby Ronald Reagan Washington National Airport in Arlington, while the Sikorsky helicopter, with three pilots on board, was on a training exercise. \n                  Remains of all 67 victims of Washington DC plane crash recovered\n                 \n                  Captain Rebecca Lobach: Third helicopter pilot who died in Washington crash was former White House aide\n                 \n                  Black Hawk helicopter was on emergency evacuation trial run before Washington DC crash, officials say\n                 Read more:What we know about the victimsHelicopter pilot was former White House aide Helicopter was 'above limit' The jet's flight recorder showed its altitude as 325ft (99m), plus or minus 25ft (7.6m). The helicopter was flying at 300ft (91m), which was 100ft (30.5m) over the maximum allowed for that route, the NTSB has said. Key safety system turned off Earlier this week, it emerged that a key safety system was turned off on the helicopter. Senate commerce committee chairperson Ted Cruz, who has been briefed by investigators, said the Black Hawk had switched off its automatic dependent surveillance-broadcast (ADS-B), which is allowed for military aircraft. ADS-B is an advanced surveillance technology to track aircraft location. Mr Cruz said the helicopter had a transponder so it would appear on radar but ADS-B is much more accurate. \"This was a training mission, so there was no compelling national security reason for ADS-B to be turned off,\" Mr Cruz said. Read more from Sky News:Judge pauses Trump plan to put thousands of workers on leave41 killed and bus burned out after collision with truck in Mexico Also, the Federal Aviation Administration (FAA) has started reviewing airports with high numbers of mixed helicopter and plane traffic nearby after Mr Cruz said he had wanted a safety review. President Donald Trump on Thursday blamed the collision on what he called an \"obsolete\" computer system used by US air traffic controllers and vowed to replace it. 👉 Follow Trump 100 on your podcast app 👈 He has also linked a diversity drive at the FAA under previous governments to the crash. It has since been said there is no evidence to support the president's claim. Last week's crash was the deadliest US air disaster since 12 November 2001, when a jet hit a New York City neighbourhood soon after take-off, killing all 260 people on board and five on the ground."
    },
    {
        "title": "Donald Trump says he will impose 25% tariffs on steel and aluminium imports",
        "description": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico.",
        "url": "https://news.sky.com/story/trump-reiterates-desire-to-make-canada-51st-state-and-says-he-will-impose-tariffs-on-steel-and-aluminium-imports-13306144",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump_6824303.jpg?20250209222937",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-09 15:10:00",
        "Headline": "The US president also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation.",
        "Content": "Donald Trump says he will impose 25% tariffs on all steel and aluminium imports into the US, including from Canada and Mexico. The president said he would make the announcement on Monday, signalling yet another major escalation in his trade policy overhaul. Speaking on Air Force One as he flew from Florida to New Orleans for the Super Bowl, he said the new levies would be on top of existing metals duties. \"Any steel coming into the United States is going to have a 25% tariff,\" Mr Trump told reporters on Sunday. When asked about aluminium, he responded, \"aluminium, too\" will be subject to the trade penalties. The share prices of Japanese steel makers fell around 1% on the news. Mr Trump also said he will announce reciprocal tariffs on Tuesday or Wednesday, to take effect almost immediately, applying them to all countries and matching the tariff rates levied by each nation. \n                  Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump\n                 \n                  Day 21: Trump's popularity, Musk's influence and America's soft power  \n                 \n                  Judge pauses Donald Trump's plan to put thousands of USAID workers on leave\n                 \"And very simply, it's, if they charge us, we charge them,\" Mr Trump said of the reciprocal tariff plan. Mr Trump previously threatened 25% import taxes on all goods from Canada and Mexico, though he paused them for 30 days last week. At the same time, he proceeded to add 10% duties on imports from China. Also last week, Mr Trump said tariffs on the European Union would be implemented \"pretty soon\". When questioned about the UK, the president said Britain was \"out of line\" when it came to trade but he thought the situation could be \"worked out\" without the use of tariffs. 👉 Follow Trump 100 on your podcast app 👈 His latest comments on the presidential plane came just after German Chancellor Olaf Scholz said the EU was ready to respond \"within an hour\" if the US levied tariffs on European goods, highlighting the risks of an escalating trade war. China's retaliatory tariffs on some US exports are due to take effect on Monday, with no sign yet of progress between Beijing and Washington. 'Gulf of America' day Also on board Air Force One, Mr Trump signed a proclamation declaring 9 February 2025 as the first ever \"Gulf of America\" day. One of the first executive orders the president signed was renaming the Gulf of Mexico. While signing the latest proclamation, he posed in front of a map with the newly changed name. Trump reiterates desire to make Canada 51st state In a separate interview earlier on Fox News, Mr Trump repeated calls to make Canada \"the 51st state\" as he reiterated his support for tech billionaire Elon Musk.  When asked if he was serious about Canada being a 51st state, Mr Trump said: \"I think Canada would be much better off. \"We lose $200bn a year with Canada. And I'm not going to let that happen. It's too much. \"Why are we paying $200bn a year essentially in subsidy to Canada? Now, if they are a 51st state, I don't mind doing it.\" He also continued to voice support for Mr Musk. The X owner is spearheading the US president's efforts to cut costs and bureaucracy in government, which has already seen the US Aid Agency for International Development targeted. Named the Department of Government Efficiency (DOGE), its aim is to find ways to sack federal workers, cut programmes and cut federal regulations. Read more from Sky News:Mexico asks Google not to follow Trump name changeAll major pieces of plane and helicopter collision have been recovered However, there have been suggestions the Tesla chief's access to government systems could pose a threat to national security. But Mr Trump has said he trusts Mr Musk and is going to ask him to investigate billions of dollars of \"fraud and abuse\" within the US military. \"I've had great help with Elon Musk. He's been terrific,\" he said."
    },
    {
        "title": "Super Bowl 2025 - latest updates",
        "description": null,
        "url": "https://news.sky.com/story/super-bowl-2025-latest-updates-13306447",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-travis-kelce-super-bowl_6824314.jpg?20250209230804",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-09 23:04:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "All major pieces of plane and helicopter in mid-air collision in Washington DC have been recovered, say crash investigators",
        "description": "All major pieces have now been recovered of the passenger plane and US army helicopter which collided in mid-air in Washington DC last week, say safety officials.",
        "url": "https://news.sky.com/story/all-major-pieces-of-plane-and-helicopter-in-mid-air-collision-in-washington-dc-have-been-recovered-say-crash-investigators-13305865",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-helicopter_6823704.jpg?20250209011825",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-09 00:55:00",
        "Headline": "Salvage crews have been working to recover the wreckage of the American Airlines jet and the Black Hawk helicopter.",
        "Content": " All major pieces have now been recovered of the passenger plane and US army helicopter which collided in mid-air in Washington DC last week, say safety officials. Sixty-seven people were killed in the 29 January disaster which left both aircraft in the Potomac River after they plunged into the water. The remains of all the victims have been recovered. There were no survivors. Salvage crews have been working to recover the wreckage of the American Airlines jet and the Black Hawk helicopter. Their black boxes have been found and crash debris is now in a hangar in Arlington, Virginia, as the probe continues. The National Transportation Safety Board (NTSB) said: \"Investigators will be looking for witness marks on the aircraft that could provide clues to the angle of collision.\" On Saturday, a plane equipped with lasers flew low over the crash scene as it scanned the bottom of the river. Crews will spend the coming days looking for smaller debris before finishing the work in around a week. At the time of the disaster, American Airlines Flight 5342, carrying 60 passengers and four crew, was preparing to land at nearby Ronald Reagan Washington National Airport in Arlington, while the Sikorsky helicopter, with three pilots on board, was on a training exercise. \n                  Remains of all 67 victims of Washington DC plane crash recovered\n                 \n                  Captain Rebecca Lobach: Third helicopter pilot who died in Washington crash was former White House aide\n                 \n                  Black Hawk helicopter was on emergency evacuation trial run before Washington DC crash, officials say\n                 Read more:What we know about the victimsHelicopter pilot was former White House aide Helicopter was 'above limit' The jet's flight recorder showed its altitude as 325ft (99m), plus or minus 25ft (7.6m). The helicopter was flying at 300ft (91m), which was 100ft (30.5m) over the maximum allowed for that route, the NTSB has said. Key safety system turned off Earlier this week, it emerged that a key safety system was turned off on the helicopter. Senate commerce committee chairperson Ted Cruz, who has been briefed by investigators, said the Black Hawk had switched off its automatic dependent surveillance-broadcast (ADS-B), which is allowed for military aircraft. ADS-B is an advanced surveillance technology to track aircraft location. Mr Cruz said the helicopter had a transponder so it would appear on radar but ADS-B is much more accurate. \"This was a training mission, so there was no compelling national security reason for ADS-B to be turned off,\" Mr Cruz said. Read more from Sky News:Judge pauses Trump plan to put thousands of workers on leave41 killed and bus burned out after collision with truck in Mexico Also, the Federal Aviation Administration (FAA) has started reviewing airports with high numbers of mixed helicopter and plane traffic nearby after Mr Cruz said he had wanted a safety review. President Donald Trump on Thursday blamed the collision on what he called an \"obsolete\" computer system used by US air traffic controllers and vowed to replace it. 👉 Follow Trump 100 on your podcast app 👈 He has also linked a diversity drive at the FAA under previous governments to the crash. It has since been said there is no evidence to support the president's claim. Last week's crash was the deadliest US air disaster since 12 November 2001, when a jet hit a New York City neighbourhood soon after take-off, killing all 260 people on board and five on the ground."
    },
    {
        "title": "Day 21: Trump's popularity, Musk's influence and America's soft power  ",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/day-21-trumps-popularity-musks-influence-and-americas-soft-power-13305611",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250205063108",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-09 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On this episode, our US correspondents James Matthews and Mark Stone tackle listeners' questions on everything from Elon Musk's influence in Washington to the impact of Trump's plans abroad, and why the president wants to ban paper straws... If you'd like to know more about Project 2025, Mark wrote a handy explainer. If you've got a question you'd like James, Martha and Mark to answer, you can email it to trump100@sky.uk "
    },
    {
        "title": "Friends star David Schwimmer urges Elon Musk to remove Kanye West from X after 'hate-filled, ignorant' comments",
        "description": "Friends star David Schwimmer has called on X owner Elon Musk to remove Kanye West from the platform.",
        "url": "https://news.sky.com/story/friends-star-david-schwimmer-urges-elon-musk-to-remove-kanye-west-from-x-after-hate-filled-ignorant-comments-13305867",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-david-schwimmer-kanye-west_6823709.jpg?20250209031431",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-09 02:50:00",
        "Headline": "Many of the rapper's X posts on Friday centred on the Jewish community, the most severe of which said \"I love Hitler\" and \"I'm a Nazi\".",
        "Content": "Friends star David Schwimmer has called on X owner Elon Musk to remove Kanye West from the platform. It comes after the US rapper, also known as Ye, appeared to write a barrage of posts on his social media account, making offensive comments, including about Jewish people. Many of the musician's X posts on Friday centred on the Jewish community, the most severe of which said \"I love Hitler\" and \"I'm a Nazi\". Another post said: \"I'm never apologising for my Jewish comments.\" On Saturday, Schwimmer, who is Jewish, urged Mr Musk to remove West from X because of his \"hate-filled, ignorant bile\". The US actor said on his Instagram account: \"This is so 2022. \"We can't stop a deranged bigot from spewing hate filled, ignorant bile… but we CAN stop giving him a megaphone, Mr. Musk. \n                  Which celebrities are attending Donald Trump's inauguration?\n                 \n                  Kanye West accused of sexual assault on set of music video in new lawsuit\n                 \n                  Kanye West and Adidas reach settlement after years of lawsuits\n                 \"Kanye West has 32.7 million followers on your platform, X. That's twice as many people than the number of Jews in existence. \"His sick hate speech results in REAL LIFE violence against Jews. \"I don't know what's worse, the fact that he identifies as a Nazi (which implies he wants to exterminate ALL marginalized communities including his own) or the fact that there is not sufficient OUTRAGE to remove and ban him from all social media at this point.\" \"Silence is complicity,\" he added. A while later, West was posting more offensive comments about Jewish people. The Campaign Against Antisemitism has also called for Mr Musk to remove West from X. Grammys controversy A week ago, the rapper and his wife Bianca Censori caused a stir at the Grammy Awards, when she wore a seemingly transparent dress on the red carpet as he stood next to her. Read more from Sky News:Oasis fans say Ticketmaster cancelled orders over 'bot' claimsIs Bridget Jones a heroine of our time or an absolute disgrace? West has had his X account suspended at least twice in the past. It was suspended in December 2022 after he made antisemitic comments and praised Hitler. Mr Musk said at the time the account would be suspended after he posted an image that appeared to show a swastika inside a Star of David. Mr Musk said the suspension was \"for incitement to violence\". The account was unsuspended by July 2023. In October 2022, West's account was restricted over antisemitic comments but he returned to the platform the following month. In that case, he also made antisemitic remarks that led to Adidas cutting ties with the rapper."
    },
    {
        "title": "Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump",
        "description": "Prince Harry's memoir dropped so many bombshells, his admission of drug-taking certainly was not the most jaw-dropping revelation.",
        "url": "https://news.sky.com/story/prince-harrys-criticism-of-weak-moral-character-at-invictus-games-felt-like-a-jibe-at-donald-trump-13305960",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-prince-harry-duke-of-sussex_6823820.jpg?20250209110750",
        "type": "US",
        "Author": "Laura Bundock",
        "Date Published": "2025-02-09 12:34:00",
        "Headline": "In a recent interview, Donald Trump said he would not intervene in the Duke of Sussex's case.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n  Prince Harry's memoir dropped so many bombshells, his admission of drug-taking certainly was not the most jaw-dropping revelation. But it did start a campaign by a US thinktank to question whether he lied on his visa application or was given special dispensation. Two years later, the legal case rumbles on, but the Duke of Sussex might have been thrown an unexpected lifeline by US President Donald Trump, who once said he would not protect the prince if he was re-elected because \"he betrayed the Queen\". In a recent interview with the New York Post, Mr Trump said he would not intervene in Harry's case. Mr Trump said: \"I don't want to do that. I'll leave him alone. He's got enough problems with his wife. She's terrible.\" The comments might help Harry's case, but Mr Trump clearly could not resist another attack on Meghan Markle. It's no great surprise - he's aired derogatory views before, branding her \"nasty\" and more recently saying: \"I'm not a fan of hers.\" As for the Sussexes, there will be little love lost. Meghan once called Mr Trump \"misogynistic\", albeit before she married Harry. The couple have not directly expressed their political persuasion, but Meghan spoke positively about Kamala Harris being named Joe Biden's running mate in 2020. The couple have also worked closely with Mr Biden's daughter, who runs a wellness centre for women who have suffered trauma. Since they left their roles as working royals, the duke and duchess have been able to speak out more freely. And to that, hours after Mr Trump made his Meghan comments, Harry used his opening speech at the Invictus Games to criticise \"weak moral character\". It feels like a jibe at Mr Trump. Invictus has always been a cause very close to Harry's heart, and one which is widely respected. It is also familiar territory for the Sussexes. It was at these games in Canada in 2017 that they made their first public appearance together. So much has happened since we saw them there. They wanted to escape from the scrutiny and intrusion of royal life. But the negative headlines which they were so desperate to escape, are harder to leave behind."
    },
    {
        "title": "Reeves calls in bank chiefs for growth talks",
        "description": "Rachel Reeves, the chancellor, has called in the bosses of Britain's biggest high street lenders for a fresh round of talks on the government's economic growth agenda.",
        "url": "https://news.sky.com/story/reeves-calls-in-bank-chiefs-for-growth-talks-13306242",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813832.jpg?20250129181436",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-09 17:11:00",
        "Headline": "The chancellor has called in the bosses of lenders including Lloyds Banking Group, Nationwide NatWest for talks on Wednesday as she tries to jumpstart the economy, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves, the chancellor, has called in the bosses of Britain's biggest high street lenders for a fresh round of talks on the government's economic growth agenda. Sky News has learnt that executives from companies including Barclays, HSBC, Lloyds Banking Group, NatWest and Nationwide have been asked to attend a meeting with Ms Reeves on Wednesday. The talks have been convened to discuss Labour's financial services growth strategy - one of the pillars of the wider industrial strategy being drawn up by ministers. Among the attendees at the meeting are expected to be Georges Elhedery, HSBC Holdings' CEO; Debbie Crosbie, CEO of Nationwide; Charlie Nunn, the Lloyds Banking Group chief; Paul Thwaite, NatWest CEO; and senior representatives of Barclays and Santander UK. The meeting will come as the UK-listed banks begin their full-year results reporting season in earnest, with Barclays due to unveil its 2024 figures on Thursday. The chancellor has been spearheading efforts to kickstart economic growth in recent weeks, following a disastrous reaction to her inaugural Budget last autumn. Last week's growth forecast downgrade by the Bank of England has revived pressure on Ms Reeves, who economist believe could be forced into further tax rises later this year as her fiscal headroom evaporates. \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  AstraZeneca move leaves Reeves under the weather\n                 \n                  Can Love Island help Rachel Reeves?\n                 One insider said the bank bosses were likely to be canvassed for fresh ideas on jumpstarting the economy in the months ahead. The chancellor has played a frontline role in ordering the UK's economic regulators to remove barriers to growth. The Treasury did not respond to a request for comment on Sunday, while none of the lenders contacted by Sky News would comment."
    },
    {
        "title": "'Ghost broking': Reports of scammers selling fake car insurance rise by 30% over five years",
        "description": "Reports of \"ghost broking\", scammers selling fake car insurance, have risen by 30% over the last five years, exclusive data obtained by Sky News reveals.",
        "url": "https://news.sky.com/story/ghost-broking-reports-of-scammers-selling-fake-car-insurance-rise-by-30-over-five-years-13305063",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ghost-broking-wayne-simpson_6822750.jpg?20250208065546",
        "type": "Business",
        "Author": "Alice Porter",
        "Date Published": "2025-02-09 00:01:00",
        "Headline": "Ghost brokers often sell false policies to drivers on social media, manipulate information given to genuine insurance companies, or take out insurance and cancel it straight away. This leaves people without valid car insurance, which is illegal.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Reports of \"ghost broking\", scammers selling fake car insurance, have risen by 30% over the last five years, exclusive data obtained by Sky News reveals. Ghost brokers sell false policies to drivers, manipulate information given to genuine insurance companies, or take out insurance and cancel it straight away. This leaves people without valid car insurance, which is illegal. Wayne Simpson lost over £500 to a ghost broker. He was looking for cheap car insurance and saw an advertisement on social media for a deal which was half the price of other companies. He bought the policy, and it was only when he tried to make a claim after a crash that he discovered the truth: \"We called up Aviva and they told me there wasn't a policy taken out in my name and that the number we had given them was not a number they would use. \"That's when the dust settles, and you realise it's been a scam.\" Aviva was not at fault. Victims are lured in by genuine-looking websites and are sent professional-looking invoices. Mr Simpson received insurance documents that looked so real, they even fooled the police officer at the accident. \"She said, 'Your car's not popping up as insured'. Straight away I went to my glove box, pulled the insurance documents, showed her the documents and she read through it and said, 'That's totally fine',\" he said. Read more from Sky News:Judge pauses Trump plan to put USAID workers on leaveZelenskyy tells Trump 'let's do a deal' for Ukraine's rare earthsWreckage found in Alaska of aircraft carrying 10 people Police say young drivers are most likely to be targeted by ghost brokers, partly because they are often looking to reduce their insurance costs. According to the RAC, almost half of young drivers said insurance costs were a top concern. Exclusive data obtained by Sky News from Action Fraud reveals \"ghost broking\" reports have risen by 30% since 2019. Detective Superintendent Tom Hill, head of the City of London Police's Insurance Fraud Enforcement Department, said social media is behind this increase: \"There are limited barriers to entry for social media accounts to be set up so people can take out car insurance and spread the word quite widely. \"Do your research and make sure you're dealing with a genuine broker or genuine insurance company. If the conversation has been moved on to WhatsApp, for example, alarm bells should be ringing\". In 2024, victims of ghost broking lost an average of £2,206. Victims lose money to the scam and then have to pay additional costs to repair their cars after an accident. They could also face criminal charges, a fine or licence points if found to be driving without a valid licence."
    },
    {
        "title": "Labour MP 'deeply regrets' comments he made on WhatsApp group - after minister sacked for remarks on same chat",
        "description": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat.",
        "url": "https://news.sky.com/story/labour-mp-deeply-regrets-comments-made-on-whatsapp-group-after-health-minister-sacked-for-remarks-on-same-chat-13306335",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-oliver-ryan-parliament_6824321.jpg?20250209234022",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-09 18:19:00",
        "Headline": "In a statement on X, Oliver Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the Labour investigation.",
        "Content": "A Labour MP has said he \"deeply regrets\" comments he made on a WhatsApp group - a day after health minister Andrew Gwynne was sacked for alleged racist and sexist remarks posted on the same chat. Burnley MP Oliver Ryan is being investigated by the Labour Party over comments which a government source said were \"unacceptable and deeply disappointing\". The source told the Press Association: \"While a Labour Party investigation is already under way, the chief whip will also be speaking to him and no action is off the table.\" Politics latest: Minister says Andrew Gwynne's comments 'unacceptable' In a statement on X, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" \n                  Casual nature of sacked Labour minister's outrageous comments will worry Starmer after his battle to change party\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  Baroness Harman issues warning to Labour MPs who set up group over Reform UK threat\n                 He also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". \"I did not see every message, but I accept responsibility for not being more proactive in challenging what was said,\" he added. Mr Gwynne, the MP for Gorton and Denton, was sacked as health minister by Sir Keir Starmer on Saturday over remarks he posted on the chat. He reportedly made antisemitic comments and \"joked\" about a pensioner constituent, saying he hoped she died before the next election, according to the Mail on Sunday. Meanwhile, a senior official earlier said Labour will punish any other MP or minister caught up in the scandal. Speaking to Sunday Morning With Trevor Phillips, housing minister Matthew Pennycook described Mr Gwynne's remarks as \"unacceptable\". \"I don't know, personally, what other people on that WhatsApp conversation have said... I've being very clear, there's an investigation taking place into the whole incident. \"What the public can take from the way the prime minister has acted decisively in this case to dismiss Andrew Gwynne is that if any other Labour MP or minister falls short he will act to uphold the highest standards in public office.\" Read more from Sky News:Much-disputed spirit of Thatcher marches through UK politicsFarage claims Reform UK has 200,000 members On Saturday, a Labour spokesperson confirmed Mr Gwynne had been suspended as a member of the Labour Party. Following the decision by Labour, Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. \"I've served the Labour Party all my life and it was a huge honour to be appointed a minister by Keir Starmer. \"I entirely understand the decisions the PM and the party have taken and, while very sad to have been suspended, will support them in any way I can.\" Mr Gwynne is the latest minister to go, with ex-treasury minister Tulip Siddiq quitting last month and Louise Haigh stepping aside as transport minister in November."
    },
    {
        "title": "Nigel Farage claims Reform UK has 200,000 members and has warning for Labour",
        "description": "Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000.",
        "url": "https://news.sky.com/story/nigel-farage-claims-reform-uk-has-200000-members-and-has-warning-for-labour-13306272",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-reform-uk_6824054.jpg?20250209170359",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-09 17:40:00",
        "Headline": "The party's growth since its founding in 2021 has been \"truly extraordinary\", Mr Farage said, promising that Reform UK is on course to become \"the biggest political party in this country\".",
        "Content": " Reform UK leader Nigel Farage has said the party now has more than 200,000 members and is aiming to overtake the Labour Party's total of 309,000. Speaking to delegates at a regional conference in Wiltshire, the Clacton MP called his party's growth \"truly extraordinary\" since its founding in 2021 as the re-launch of the Brexit Party. With the party's live membership ticker displayed on a screen behind him, he said it was on course to become \"the biggest political party in this country\". \"That's our goal. That's our aim. That's our target,\" he said. Reform UK is already ahead of the Conservatives, who revealed in November that almost 132,000 members were eligible to vote during the party's leadership election to replace Rishi Sunak. Referring to last year's row with new Conservative leader Kemi Badenoch, when she doubted Reform's total membership, he said the party \"got people to come in and check and look at the back end, and it's all absolutely legit\". Reflecting on Reform UK's rapid growth, he said: \"In the modern world to have got here this quickly, isn't it truly extraordinary? \"Doesn't it show you something is happening in this country? People want real political leadership. They want real change. That's what that tells you.\" The party polled more than four million votes in last year's election, winning five seats, including Mr Farage's Essex constituency. Mr Farage, the former head of UKIP, had ruled himself out of standing but made a U-turn after saying he had a \"terrible sense of guilt\" for not offering to run. In another sign of its growing threat to the main parties, last week, Reform UK came top in a poll of people who voted Conservative at the last election. Switching his focus to their political opponents, he declared that \"when we overtake [the Labour Party], we will be the biggest political party in this country\". The Tories had \"betrayed the country with open door immigration, increased taxes, with not delivering Brexit\", he said. \"A 10 million increase in the population of this country over the course of the last 20 years has devalued the living standards of everybody in this country,\" Mr Farage added. \"It's truly incredible. The wave of people that came under Boris Johnson from 2021, of the millions that came, only 20% are working or contributing. The rest are costing us, the taxpayer. It's an outrage.\" Read more:More ministers 'could be caught up' in scandalWarning to MPs behind Reform threat chat groupGreen or growth? Only one winner for PM Spelling out Reform UK's key platform, he said: \"Anyone that comes here illegally will be deported. Simple as that. \"We're the only party that says 'no more population increase through immigration for many years to come'.\" Calling it \"the one net zero I approve of\", he said the UK \"hasn't got enough houses, we can't get GP appointments, our roads are completely overloaded, our infrastructure is crumbling\"."
    },
    {
        "title": "Love or hate her, the much-disputed spirit of Margaret Thatcher continues to march through UK politics",
        "description": "Margaret Thatcher died on 8 April 2013. But the UK's longest-serving post-war prime minister still casts a long shadow over politics today, more than a decade later.",
        "url": "https://news.sky.com/story/love-or-hate-her-the-much-disputed-spirit-of-margaret-thatcher-continues-to-march-through-uk-politics-13304579",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-margaret-thatcher-conservatives_6822064.png?20250207101300",
        "type": "Politics",
        "Author": "Adam Boulton",
        "Date Published": "2025-02-09 00:01:00",
        "Headline": "Alongside the likes of Winston Churchill and Tony Blair, Margaret Thatcher remains one of the most memorable British leaders of her century.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Margaret Thatcher died on 8 April 2013. But the UK's longest-serving post-war prime minister still casts a long shadow over politics today, more than a decade later. Only last week the Labour Prime Minister Sir Keir Starmer cited her example in support of his deregulation plans. \"In the 1980s, the Thatcher government deregulated finance capital…,\" he wrote in The Times, \"This is our equivalent.\" No British woman leader other than Elizabeth I has been the subject of so many plays and films, or impersonated by so many actors. The Iron Lady has been played by Meryl Streep, Gillian Anderson, Lindsay Duncan and Andrea Riseborough, among others. Harriet Walter takes the lead in the latest Channel 4 drama Brian and Maggie, which recreates a TV interview in which the real Thatcher confirmed to journalist Brian Walden that she did not believe in \"equality\". A year of anniversaries This is a big year for admirers - and detractors - of Thatcher. \n                  Kemi Badenoch after 100 days: A work in progress and her Farage problem\n                 \n                  Former Tory MP speaks from Ukraine after joining military following end of political career\n                 \n                  Conservatives pledge to tighten immigration rules in Reform fightback\n                 This October marks 100 years since her birth in Grantham, Lincolnshire, the daughter of a grocer. The Westminster thinktank Policy Exchange is launching The Thatcher Centenary Project. This week it held its inaugural meeting marking an equally important Thatcher anniversary: 50 years since she became the leader of the Conservative Party. On 5 February 1979, Thatcher scored a surprise victory over the incumbent Ted Heath in the first round of the Conservative leadership election, winning the votes of 130 MPs to Heath's 119. Sir Hugh Fraser MP, husband of the glamorous author Lady Antonia Fraser, also ran, garnering 16 votes. Heath was out. He had been elected prime minister in 1970 and took the UK into the European Community, but after an economically damaging period of confrontation with trade unions, he was defeated in two general elections in 1974. In the second round on 11 February 1975, she was elected leader of the opposition by a majority knock-out, 146 votes to 79 for Willie Whitelaw, 19 each for Jim Prior and Geoffrey Howe, and 11 for John Peyton. She became the first female leader of a major British political party. Four years later she beat Labour's Jim Callaghan in the general election to become Britain's first woman prime minister. She would go on to win two further elections, and be prime minister for 11 years, until she was forced out by her party in the autumn of 1990 - a fate she put down to \"treachery\". 'We need impact' That was more than 30 years ago and does not explain why she is still such a potent icon today, both hated and revered. The explanation lies partly in the way in which her policies transformed Britain, partly in her political success and partly in the force of her character. As she wrote in a letter to her daughter Carol: \"Brain power is not enough. We need personality and impact as well.\" I started to cover British politics from about 1983 and interviewed Mrs Thatcher quite often. She was great to talk to because she engaged, even with a young reporter, and seemed to enjoy being challenged while arguing her position with conviction. In her later years in Downing Street, she lost this openness and ability to respond to those who disagreed with her. Months before her downfall, I remember the cabinet minister Chris Patten complaining: \"She'll have to go. She's stopped listening.\" In foreign affairs, her years in power included a military victory to retake the Falkland Islands, a genuinely special relationship with US president Ronald Reagan, detente with Mikhail Gorbachev as the Soviet Union imploded and an increasingly sceptical approach to membership of what became the European Union. At home, Sir Keir is still praising her for the \"meaningful change\" she made to Britain/he and Rachel Reeves are trying on her clothes as they try to emulate her efforts to \"drag Britain out of its stupor by letting loose our natural entrepreneurialism\". This prime minister is now looking to the private sector to provide homes and build infrastructure. The milk snatcher Thatcher's former speechwriter John O'Sullivan views her election as Tory leader as \"the first big victory for radical Conservatism\". She set about selling off council houses to create a \"property-owning democracy\" and began privatisation of many nationalised industries. There was a widescale deindustrialisation of Britain's traditional heavy industries and simultaneous deregulation which led to a boom in the services and financial sector. She confronted trade union power and defeated the National Union of Mineworkers' strike. Unsurprisingly, she became a hate figure to many on the centre and left of British politics. At my children's primary school in the 1980s and '90s there was a playground rhyme about \"Margaret Thatcher milk snatcher\", a reference to the cancellation of free milk for school children during her time as Heath's education secretary. There is a song \"Merry Christmas Maggie Thatcher/ We all celebrate today /'Cause it's one day closer to your death\" in 2005's Billy Liar The Musical. The audience voted to keep it in when she died in 2013. Disciples of the Iron Lady Thatcher's legacy has been complicated for Conservative politicians. They continue to argue over whether Thatcher in her prime would have been a leave or remain voter in the 2016 referendum. Read more:Obituary of the Iron LadyThatcher refused to share flight with pandaThirty years on from Thatcher's No10 exit She campaigned to join the EEC, enjoyed sparring with Brussels as prime minister, but became a bitter critic in her post-Downing Street decline. Her immediate successor, John Major, built on Thatcherite policies but was heavily critical of her behaviour as a self-declared \"back seat driver\". Tory leaders since Major have all claimed to be her disciples. From cold to warm in Labour land On the Labour side, attitudes have generally warmed up over the years. Neil Kinnock, the Labour leader who was beaten by Thatcher in 1992 and 1997, insists that the only thing he admires about her is her success as a woman. John Smith challenged her economic approach. Tony Blair invited her for a private discussion in Number 10 soon after his general election victory and continued to treat her with wary respect. Gordon Brown went further. He welcomed the then 81-year-old to tea in Downing Street and told journalists: \"I admire Lady Thatcher… I am a conviction politician like her.\" On her death, Ed Miliband paid tribute to a woman who \"broke the mould\". Jeremy Corbyn, the left-winger who led Labour between 2015 and 2020, was the exception. He stuck by the barbs he had aimed at prime minister Thatcher when he was a backbench Labour MP: \"Every week, I speak to renters threatened with eviction. Homeless people struggling to survive. Parents using food banks. Elderly people who can't afford heating. That is the legacy of Thatcherism. We will never achieve meaningful change until it ends for good.\" Today Sir Keir is happy to strike Thatcherite poses. Ironically, while some Conservatives are celebrating Thatcher this year, other Tories want to move on. Kwasi Kwarteng, who served briefly as Liz Truss's \"kamikaze\" chancellor, chose this anniversary year to warn \"modern politicians\" that \"they should not indulge in a grotesque cosplay of an idealised Thatcher who only ever existed in their imagination\". The debate is as lively as ever about Thatcher and her legacy. She is not forgotten - whether people actually knew her when she was alive or not. One thing everyone agrees on is that she always enjoyed a good argument, until her declining years. With Churchill and Blair she is one of the most memorable British prime ministers of her century and her much-disputed political soul goes marching on into the next one."
    },
    {
        "title": "Former Tory MP speaks from Ukraine after joining military following end of political career",
        "description": "\"If Ukraine falls&#8230; we know what happens next\", former Tory MP Jack Lopresti tells Trevor Phillips from Kyiv.",
        "url": "https://news.sky.com/story/former-tory-mp-speaks-from-ukraine-after-joining-military-following-end-of-political-career-13305958",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jack-lopresti-ukraine_6823819.jpg?20250209110341",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-09 10:39:00",
        "Headline": "Jack Lopresti has joined the Ukrainian military, having previously been a British reserve soldier in Afghanistan. He says he had visited the war zone before and chose to work there after politics.",
        "Content": " \"If Ukraine falls… we know what happens next\", former Tory MP Jack Lopresti tells Trevor Phillips from Kyiv. Less than a year ago, he was the parliamentary representative for Filton and Bradley Stoke near Bristol - now he is working with the Ukrainian military. Mr Lopresti is a former reservist soldier, although plays down his time in Afghanistan when asked. Ukraine war latest: Trump says Putin wants dying to stop But he has returned to his past way of life after leaving politics behind. \"The last time I spoke in the House of Commons, I said that the defence of the UK began in Ukraine,\" Mr Lopresti - who says he prefers being called Jack (short for Giacomo) - told Sunday Morning With Trevor Phillips. \"And I've been coming here for two years now, regularly helping with charities to work with defence manufacturers in my previous constituency. \n                  Kemi Badenoch after 100 days: A work in progress and her Farage problem\n                 \n                  Love or hate her, the much-disputed spirit of Margaret Thatcher continues to march through UK politics\n                 \n                  Conservatives pledge to tighten immigration rules in Reform fightback\n                 \"And about a year ago, I thought to myself, well, you know, politics looks difficult for us as a party at the moment, to say the least, and if I were not re-elected, then I'd come out here and do whatever I could to help. And I knew in the back of my mind that more than likely I would end up in the military, which is where I am.\" This is a somewhat different path than that taken by many former politicians - who tend to revert to careers as lawyers, lobbyists or talking heads. Read more:Does Germany need to be war ready?Trump envoy calls for Ukraine election after ceasefire Mr Lopresti says Ukrainians are not just fighting for their own survival and freedom - but that is also \"our\" battle, referring to the UK's support for Kyiv. \"If Ukraine falls, if we fail here, then we know [Putin] won't stop. So, you know, this is a battle for Europe. \"And if Putin succeeds, it is a green light for dictators everywhere.\" The former MP goes on: \"I cannot reiterate that enough really - if Ukraine falls, that we know what comes next. Estonia, Poland, Lithuania, a war with NATO. Perhaps the Chinese will look and say, actually, these guys won't fight, so we'll move on Taiwan. \"You know, this is a must win. And that's what I'm motivated by.\" Since Donald Trump's election as US president last year, there has been talk about whether talks to end the war will begin. Overnight, Mr Trump said he had spoken to Vladimir Putin on the phone - although the Russian side has not yet confirmed the conversation took place. Volodymyr Zelenskyy has told Mr Trump \"let's do a deal\" - offering the US a partnership over Ukraine's stores of rare earth minerals. 👉 Follow Trump 100 on your podcast app 👈 Also overnight, Russian state media claimed that the nation's armed forces had claimed control of the Orikhovo-Vasylivka settlement in Ukraine's eastern Donetsk region. And waves of drones from both sides attacked the other."
    },
    {
        "title": "Reeves calls in bank chiefs for growth talks",
        "description": "Rachel Reeves, the chancellor, has called in the bosses of Britain's biggest high street lenders for a fresh round of talks on the government's economic growth agenda.",
        "url": "https://news.sky.com/story/reeves-calls-in-bank-chiefs-for-growth-talks-13306242",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813832.jpg?20250129181436",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-09 17:11:00",
        "Headline": "The chancellor has called in the bosses of lenders including Lloyds Banking Group, Nationwide NatWest for talks on Wednesday as she tries to jumpstart the economy, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves, the chancellor, has called in the bosses of Britain's biggest high street lenders for a fresh round of talks on the government's economic growth agenda. Sky News has learnt that executives from companies including Barclays, HSBC, Lloyds Banking Group, NatWest and Nationwide have been asked to attend a meeting with Ms Reeves on Wednesday. The talks have been convened to discuss Labour's financial services growth strategy - one of the pillars of the wider industrial strategy being drawn up by ministers. Among the attendees at the meeting are expected to be Georges Elhedery, HSBC Holdings' CEO; Debbie Crosbie, CEO of Nationwide; Charlie Nunn, the Lloyds Banking Group chief; Paul Thwaite, NatWest CEO; and senior representatives of Barclays and Santander UK. The meeting will come as the UK-listed banks begin their full-year results reporting season in earnest, with Barclays due to unveil its 2024 figures on Thursday. The chancellor has been spearheading efforts to kickstart economic growth in recent weeks, following a disastrous reaction to her inaugural Budget last autumn. Last week's growth forecast downgrade by the Bank of England has revived pressure on Ms Reeves, who economist believe could be forced into further tax rises later this year as her fiscal headroom evaporates. \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  AstraZeneca move leaves Reeves under the weather\n                 \n                  Can Love Island help Rachel Reeves?\n                 One insider said the bank bosses were likely to be canvassed for fresh ideas on jumpstarting the economy in the months ahead. The chancellor has played a frontline role in ordering the UK's economic regulators to remove barriers to growth. The Treasury did not respond to a request for comment on Sunday, while none of the lenders contacted by Sky News would comment."
    },
    {
        "title": "Digitising house-buying process considered as a way to speed up transactions",
        "description": "Digitising more of the house-buying process is being explored by the government as a way to speed up transactions.",
        "url": "https://news.sky.com/story/digitising-house-buying-process-eyed-as-way-to-speed-up-transactions-13306006",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-for-sale-house-houses_6823857.jpg?20250209124915",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-09 12:35:00",
        "Headline": "A 12-week project to establish the \"design and implementation of agreed rules on data\" that will make sharing between conveyancers, lenders and others has been announced by the government.",
        "Content": "Digitising more of the house-buying process is being explored by the government as a way to speed up transactions. Reforming the housing sector is a key part of Labour's plans for government. As part of this, ministers want to modernise the \"cumbersome\" and paper-laden path property transactions currently have to go through. A 12-week project to establish the \"design and implementation of agreed rules on data\" that will make sharing between conveyancers, lenders and others has been announced Housing minister Matthew Pennycook told Sunday Morning with Trevor Phillips: \"It will speed up the home buying and selling process. At the moment, it's too costly, it's too stressful. \"Huge numbers of house sales fall through that cost the economy, around £400m, so we're taking action on that. \"Increase protections for leaseholders as well as part of our homeownership drive to protect them as we move to, bring the leasehold system to an end completely. But it's just one step on a wider push.\" Mr Pennycook said in announcing the plans: \"Our modernisation of the system sits alongside further reforms to improve the lives of leasehold homeowners across the country, allowing them to more easily and cheaply take control of the buildings they live in and clamp down on unreasonable or extortionate charges. \"These reforms build on the government's Plan for Change to deliver higher living standards and 1.5 million safe and decent homes in this parliament, and our ongoing efforts to protect leaseholders suffering from unfair and unreasonable practices as we work to end the feudal leasehold system for good.\" Read more:Starmer vows to 'take on NIMBYs'Labour demands housing targets from councilsHousebuilding fight could turn 'toxic' for Starmer  When buying a home, conveyancing typically takes several weeks, but waiting for documents needed for property searches and other parts of the process can delay it. Rightmove, a platform that is used by estate agents and house buyers, has said it takes an average of five months from an offer being accepted to people moving into a property. Presenter First, the good news for Sir Keir Starmer. \n Interest rates went down a bit, Donald Trump reckons that he's been well-behaved enough to swerve a tariff on British exports to the USA, and the Tories are dropping in the polls as their new leader hits her first hundred days.\n Now, the bad news.\n Growth rates are also down, inflation is up, and net migration doesn't seem to be budging. Worst of all, Nigel Farage is grinning like the Cheshire Cat, as Reform hits the top of the opinion polls.\n The prime minister's problem – shared with most western governments – is that there won't be growth in ageing societies without young workers from abroad. But there won't be young workers if there are no houses, hospitals and trains for them to come to. \n He plans to break through the impasse by launching (yet another) crackdown on immigration, and by streamlining the process of house buying – both measures aimed at prompting the growth promised by the chancellor. \n It may even work. But as long as the voters' attention is diverted by Donald Trump, or by Nigel Farage, or by the noise of ministerial resignations for sending racist, sexist and distasteful WhatsApp messages, he won't get any credit for his actions.\n The company said digitising the process is key to making this faster. A \"fully digitalised\" home buying and selling process would mean mortgage companies and surveyors can access the information they need immediately with identity checks only carried out once, the Ministry of Housing, Communities and Local Government said. 👉Listen to Politics At Jack And Sam's on your podcast app👈 Rightmove chief executive Johan Svanstrom said: \"Digitising the property market is key to helping speed up the moving process. \"If the plans set out today can further the access to information and an improved transaction process, it's also critical to drive industry-wide adoption of tech solutions and collaboration to make it a success. \"The current process also contributes to an average of more than one in five home sales falling through, and hopefully a better process can help reduce this as well.\""
    },
    {
        "title": "Coal tips safety: Residents say lessons 'not learned' from Aberfan disaster",
        "description": "Residents who live near disused coal tips in South Wales say lessons have not been learned from the Aberfan disaster nearly 60 years on.",
        "url": "https://news.sky.com/story/coal-tips-safety-residents-say-lessons-not-learned-from-aberfan-disaster-13302964",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wales-coal-tips_6819384.jpg?20250204125502",
        "type": "Technology",
        "Author": "Tomos Evans",
        "Date Published": "2025-02-09 00:01:00",
        "Headline": "Sky News has spoken with residents who live near some of Wales's most dangerous disused coal tips, who say lessons have not been learned since the 1966 tragedy which killed 144 people, including 116 children.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Residents who live near disused coal tips in South Wales say lessons have not been learned from the Aberfan disaster nearly 60 years on. Their comments come after a disused coal tip in Cwmtillery, Blaenau Gwent, partially collapsed in November, forcing around 40 homes to be evacuated. A coal tip is made up of waste material from coal mining, many of which have existed for several decades.  Dianne Morgan, 68, has lived in the house she had built in the Cwmtillery ward for the last 10 years. She told Sky News she didn't know there was a category D tip - the most dangerous - behind her property, until the slip, which happened after heavy rainfall during Storm Bert. \"All we were told was underlying mines had been there. But there was no mention of a tip when we had searches at all,\" she said. \"I'm not being funny, if I had known there was a tip behind me, I wouldn't have built here.\" \n                  Charlene Hobbs: Fresh appeal for information about missing mum as new CCTV released\n                 \n                  Colin Richards death: 18-year-old Corey Gauci denies murder of father-of-seven\n                 \n                  Sophia Kelemen: Man in court over baby's death after she was hit by car\n                 'Got to be sorted' There are 2,573 disused coal tips in Wales, according to Welsh government data - the vast majority of which are in the former coal mining communities of the South Wales Valleys. Three hundred and sixty of these are in the two most dangerous categories and are monitored at least once a year as they have \"the potential to impact public safety\". Ms Morgan said she believes lessons have not been learned from the Aberfan disaster in 1966 when a colliery spoil tip collapsed killing 144 people, including 116 children. A build-up of water within the tip after heavy rain caused it to suddenly slide downhill as slurry. The tragedy is considered the worst mining-related disaster in British history and was more recently featured in an episode of Netflix series The Crown. \"The tip's got to come down,\" she said, but added that the authorities \"don't want to pay\". \"They think they'll just drag it on and on and on and then people just forget, but you're not going to forget are you? Because every time we have pouring down rain or if you hear a noise, you come out here and I have a check just in case it's something,\" she added. \"They all talk about they're all broke, ain't we all? But that doesn't matter, it's people's lives you're dealing with and people's homes at the end of the day. \"It took everything we had to build this, if that came down and wrecked this, even if I wasn't in it, we've got nothing.\" She said the slip before Christmas \"could have been a lot worse\". \"Irrespective of who owns it, it's got to be sorted...'cause you don't know where it's going to come down next',\" Ms Morgan said. \"We've got to have a surety that this tip is going to be seen to, and not only this tip but other tips for other people that could be in the same situation that we are, especially with the rain we're having at the moment.\" 'Nothing getting done' Brian Preece, 77, has lived in Cwmtillery all his life. He told Sky News he \"always played on the tips\" as a child. \"We never had one inclination from anywhere in my life that them tips was dangerous,\" he said. \"I played on them myself, my children played on them, my grandchildren, my great-grandchildren.\" He said that if a larger tip would have come down, his street \"would have gone\" and the tips needed to be taken \"down to a safe level\". \"They've said they was going to do this, and they said they was going to do that, but there's nothing getting done and everybody's worrying now,\" he added. \"The only safe way on my behalf, and I'm sure everybody else, is they should be dropped. \"Alright, they say it's going to cost a lot of money, [but] they've got to drop it. You can't put a price on children's lives, on anybody's life, and it should be down.\" Sky News has approached Blaenau Gwent Council for its response. 'Nothing has changed' In October, Chancellor Rachel Reeves announced £25m in the budget for the maintenance of coal tips in Wales to ensure communities are kept \"safe\". Meanwhile, the Welsh government has outlined proposals for a Disused Tips Authority for Wales, which would take on responsibility for coal tip safety in future. But campaigners say the money promised to tackle the issue is not enough. Stuart Adams, 65, regularly walks the tips at Bedwas and Cilfynydd. Mr Adams is part of the Clear South Wales's Coal Tips group, which is calling for action to make the tips safer. \"It's ordinary people that are going to be affected if there is a disaster, or even a minor slip, which has just happened in Cwmtillery. They still cause masses of disruption for people,\" he told Sky News. \"I'm no expert on the financial side of things, but clearly [the money's] not enough to make these places safe.\" Mr Adams said the tip at Cilfynydd Common collapsed in 1939 and was seen as \"a precursor to an Aberfan disaster\". \"Luckily no one was hurt, and no one was killed [in the 1939 slip],\" he added. \"The same could quite easily happen again as nothing has changed with regards to the tips.\" 'First of its kind' legislation A Welsh government spokesperson said it had invested more than £100m in coal tip safety since 2021 \"to ensure our coal tip communities are safe\". \"We have also introduced modern legislation - the first of its kind in the UK - to prevent disused coal and non-coal tips from being a threat to human life,\" they added. \"The highest risk coal tips (category C and D) are regularly inspected by the Mining Remediation Authority (MRA) and we continue to work with partners across Wales to inspect sites, including additional checks during extreme weather.\" A spokesperson for the MRA (formerly the Coal Authority) said it continued to provide \"support, expertise and advice\" to the Welsh government. \"We undertake an inspection programme on behalf of Welsh government and other agencies, providing recommendations for maintenance requirements,\" they added. \"We also continue to directly manage the 26 coal tips that the Mining Remediation Authority owns in Wales and provide management services to other landowners as needed.\""
    },
    {
        "title": "Friends star David Schwimmer urges Elon Musk to remove Kanye West from X after 'hate-filled, ignorant' comments",
        "description": "Friends star David Schwimmer has called on X owner Elon Musk to remove Kanye West from the platform.",
        "url": "https://news.sky.com/story/friends-star-david-schwimmer-urges-elon-musk-to-remove-kanye-west-from-x-after-hate-filled-ignorant-comments-13305867",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-david-schwimmer-kanye-west_6823709.jpg?20250209031431",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-09 02:50:00",
        "Headline": "Many of the rapper's X posts on Friday centred on the Jewish community, the most severe of which said \"I love Hitler\" and \"I'm a Nazi\".",
        "Content": "Friends star David Schwimmer has called on X owner Elon Musk to remove Kanye West from the platform. It comes after the US rapper, also known as Ye, appeared to write a barrage of posts on his social media account, making offensive comments, including about Jewish people. Many of the musician's X posts on Friday centred on the Jewish community, the most severe of which said \"I love Hitler\" and \"I'm a Nazi\". Another post said: \"I'm never apologising for my Jewish comments.\" On Saturday, Schwimmer, who is Jewish, urged Mr Musk to remove West from X because of his \"hate-filled, ignorant bile\". The US actor said on his Instagram account: \"This is so 2022. \"We can't stop a deranged bigot from spewing hate filled, ignorant bile… but we CAN stop giving him a megaphone, Mr. Musk. \n                  Which celebrities are attending Donald Trump's inauguration?\n                 \n                  Kanye West accused of sexual assault on set of music video in new lawsuit\n                 \n                  Kanye West and Adidas reach settlement after years of lawsuits\n                 \"Kanye West has 32.7 million followers on your platform, X. That's twice as many people than the number of Jews in existence. \"His sick hate speech results in REAL LIFE violence against Jews. \"I don't know what's worse, the fact that he identifies as a Nazi (which implies he wants to exterminate ALL marginalized communities including his own) or the fact that there is not sufficient OUTRAGE to remove and ban him from all social media at this point.\" \"Silence is complicity,\" he added. A while later, West was posting more offensive comments about Jewish people. The Campaign Against Antisemitism has also called for Mr Musk to remove West from X. Grammys controversy A week ago, the rapper and his wife Bianca Censori caused a stir at the Grammy Awards, when she wore a seemingly transparent dress on the red carpet as he stood next to her. Read more from Sky News:Oasis fans say Ticketmaster cancelled orders over 'bot' claimsIs Bridget Jones a heroine of our time or an absolute disgrace? West has had his X account suspended at least twice in the past. It was suspended in December 2022 after he made antisemitic comments and praised Hitler. Mr Musk said at the time the account would be suspended after he posted an image that appeared to show a swastika inside a Star of David. Mr Musk said the suspension was \"for incitement to violence\". The account was unsuspended by July 2023. In October 2022, West's account was restricted over antisemitic comments but he returned to the platform the following month. In that case, he also made antisemitic remarks that led to Adidas cutting ties with the rapper."
    },
    {
        "title": "Big Boys cast bid farewell with season three of Bafta-winning show",
        "description": "Jack Rooke says he does not want to revisit the Big Boys story again once season three is out.",
        "url": "https://news.sky.com/story/big-boys-cast-bid-farewell-with-season-three-of-bafta-winning-show-13305882",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-big-boys-dylan-llewellyn_6823726.jpg?20250209072409",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-02-09 08:38:00",
        "Headline": "The semi-autobiographical reflection of Jack Rooke's university days, Big Boys, is ending after three seasons. Starring Derry Girls' Dylan Llewellyn and Sweetpea's Jon Pointing, the Channel 4 show follows the friendship between two male students.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n Jack Rooke says he does not want to revisit the Big Boys story again once season three is out. The Bafta award-winning writer based the Channel 4 series on his university experience in the 2010s while he explored his sexuality for the first time and learned to live with the grief from his father's death. Speaking to Sky News, he says although the drama comedy received a great reaction from fans and critics, he does not imagine ever returning to it for a reboot or spin-off. \"I know everyone always wants to leave the door open. I think there's something so brilliant, a special moment here to just celebrate something being exactly what it is,\" he says. \"It's a succinct story that has a beginning and an end in the final episode of Big Boys, the last two episodes I wrote kind of almost run one into another. It's like a two-part ending.\" He adds: \"I just think there's something about leaving them. Every single character by the end of their series, their story is tied up, and I'm proud of that as a writer because it's quite difficult to try and give everyone an ending. But I think we've done that.\" That decision does not mean he wants to leave his cast behind, in fact, he says he already has a goal in mind. \"I'm really up for writing something completely different that has exactly the same cast. I would like to write like a completely different story. Completely fictional, completely oddball, completely weird, but have the whole gang in there again playing completely different parts,\" he says. \"One day I'd like to write Dylan [Llewellyn] as a real nasty villain. No more sweethearts from the 'wee English fella' [from Derry Girls]. I want him to play like someone quite bloodthirsty.\" Read more from Sky News:Friends star calls on Elon Musk to ban Kanye West from XOasis fans say Ticketmaster cancelled orders over 'bot' claimsDemi Moore continues winning streak at Critics Choice Awards Season one and two of Big Boys followed Jack, played by Derry Girls star Llewellyn, a shy 19-year-old student moving a short distance away from his mother for the first time to start his new life at Brent University. Sharing accommodation with Danny, Sweetpea actor Jon Pointing, the pair quickly form a close bond and begin to navigate through their lives together. Llewellyn says he will look back proudly at what the cast and crew achieved with the series, showing young people finding their footing and pride in themselves. \"I think that the dynamic between Jack and Danny is something you don't see very often - a gay guy and a straight guy having that friendship, having that bond,\" he says. \"You don't see it enough on TV, I don't think. And yet you have it every day, you have it like in real life so why isn't it on TV, you know?\" For those who may not have watched a full episode yet, they have more than likely stumbled upon one of its most poignant scenes. The moment the character Jack made the decision to tell his mother he's gay featured on Celebrity Gogglebox and quickly went viral on social media. Rooke says the appearance on Gogglebox was huge for the show, but it was also special to have a moment about his mother and late father resonate with people. \"People call it a coming out scene but to me, every line in that scene was about grief. It was about loss. It was about when you can't tell someone who is no longer with you something so huge about yourself, but you can still tell the people who are there and who are going to love and support you, whatever,\" he says. \"So, I think that scene to me is always going to be really close to my heart. And the three of them performed their socks off in that moment.\" The 31-year-old says he is slightly apprehensive about how he has decided to finish the acclaimed show. \"There is a scene in episode six of series three, and even just the last two minutes of that episode, the last two minutes of Big Boys, to me, I feel like that is the show. It's about 'chosen family' and people who pick you up when you are at your lowest and I think that's the sort of legacy of the show,\" he says. \"It's always about the people we choose, and I know that the concept of chosen family isn't a new thing, but I don't think you can ever be reminded enough how important that is, especially right now in the current climate we're in. It is about saying 'we' first.\" He adds: \"It's a risk some people might not like the ending of this show [sic]. I think we've taken a bit of a riskier end to this but that feels truer and more authentic and will hopefully resonate with people.\" Big Boys season three airs on Channel 4 at 10pm on Sunday 9 February."
    },
    {
        "title": "Jimmy Savile's former mountainside property damaged by fire",
        "description": "A property formerly owned by paedophile Jimmy Savile has been damaged by fire, according to reports.",
        "url": "https://news.sky.com/story/jimmy-saviles-former-mountainside-property-damaged-by-fire-13305992",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jimmy-savile-glen-coe_6823835.jpg?20250209120608",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-09 13:12:00",
        "Headline": "When it was auctioned in 2013, the property was described as \"a traditional refurbished detached cottage in an attractive location within scenic Highland countryside\".",
        "Content": "A property formerly owned by paedophile Jimmy Savile has been damaged by fire, according to reports. The property in Glen Coe, Scotland, had been set to be demolished after failed redevelopment plans and years of vandalism. However, at around 5.30pm on Saturday emergency services were called after reports of a blaze at one of the outbuildings. The A82 was shut in both directions. A spokesperson for Police Scotland said: \"Emergency services attended and the fire was extinguished by Scottish Fire and Rescue Service. \"Inquiries are ongoing to establish the full circumstances.\" Savile bought the whitewashed cottage, named Allt Na Reigh, in 1998. \n                  Yvette Fielding says she was assaulted by Rolf Harris on Blue Peter and left alone with Jimmy Savile\n                 \n                  Steve Coogan hopes his portrayal of Jimmy Savile in The Reckoning will help prevent abuse\n                 \n                  Nicky Campbell compares 'abusive' teacher at Edinburgh Academy to Jimmy Savile\n                 It was auctioned in 2013 and was described as \"a traditional refurbished detached cottage in an attractive location within scenic Highland countryside\". \"The grounds also boast a large outbuilding with one bedroom chalet, log store and there are garden grounds with waterfalls and a large parking area to front,\" the description said. Its current owner has been granted planning permission to demolish the existing property and replace it with a new four-bedroom, one-and-a-half storey house. The redevelopment will also celebrate another of the cottage's former owners - Scottish climber Dr Hamish MacInnes. He invented ice axes and a stretcher used by mountain rescue teams all over the world. Former BBC television and radio presenter Savile, who died in 2011, is believed to be one of Britain's most prolific sex offenders. He was never brought to justice for his crimes."
    },
    {
        "title": "Robbie Williams explains why he paid £20k for Eric Morecambe's glasses",
        "description": "Robbie Williams has said he bought Eric Morecambe's glasses and pipe because he has always seen the comedian as an \"uncle of sorts\".",
        "url": "https://news.sky.com/story/robbie-williams-explains-why-he-paid-16320k-for-eric-morecambes-glasses-13306056",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-eric-morecambe-glasses_6797296.jpg?20250112011832",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-09 13:49:00",
        "Headline": "The Angels singer paid more than 10 times the estimate for the imitation tortoiseshell glasses by Metzler.",
        "Content": "Robbie Williams has said he bought Eric Morecambe's glasses and pipe because he has always seen the comedian as an \"uncle of sorts\". The singer said he cried \"happy, childlike tears\" after submitting the top bid last month with a final offer of £20,000. This far exceeded the £2,000 to £4,000 estimate. In an Instagram post featuring photos of Williams using the glasses and pipe, he said he treated himself to the items ahead of his 51st birthday. The Angels singer recalled appointing Mike, a member of his team who handles his digital presence, to be \"chief bidder\" as he was in Los Angeles about to board a plane as the auction got under way. \"As it happens, I got to watch the lot being auctioned live. My iPhone and Mike's iPhone acting like walkie-talkies,\" he wrote. Read more on Sky News:Friends star urges Elon Musk to remove Kanye West from XBig Boys cast bid farewell with season three of Bafta-winning show \n                  Robbie Williams says people from the 90s shouldn't be shamed for how they think and feel\n                 \n                  Port Vale FC dismiss Robbie Williams takeover rumours\n                 \n                  Robbie Williams fan dies after concert fall in Sydney\n                 \"'What should I do Ayd's?' I nervously kept asking my wife. 'Keep bidding' Ayda says with the steely determination of someone bursting through an electronics store door on Black Friday. \"'Keep going Mike' I say. This vignette of conversation would repeat itself several times over the next 10 minutes.\" Once he won the bidding war, Williams said he cried \"happy, childlike tears\". \"You see, I guess we all need friends-we-never-meet from off the telly. Eric has always been mine. An uncle of sorts,\" he wrote. \"To the very core of me, Eric Morecambe's spirit has been salve for my soul. How Eric made me feel is how I want to make people feel. \"What a gift to be able to create such joy and have that joy be present just by thinking of them.\" The imitation tortoiseshell glasses by Metzler, said to be synonymous with Morecambe's sharp wit and comedic persona, were sold alongside his Barling briar pipe and two black-and-white photographs of him with the spectacles. Hanson Auctioneers offered Morecambe's belongings in 700 lots on January 10 and 11, more than 40 years after the comic died of a heart attack aged 58 in 1984."
    }
]