[
    {
        "title": "Man arrested over Leeds crossbow incident which seriously injured two women has died",
        "description": "A man being investigated by counter terror police over a crossbow and firearm attack has died in hospital.",
        "url": "https://news.sky.com/story/man-38-involved-in-leeds-crossbow-incident-which-seriously-injured-two-women-has-died-13358095",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-owen-lawrence-crossbow_6900794.png?20250429144300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 11:20:00",
        "Headline": "Owen Lawrence, 38, had been detained following the attack on Saturday which left two women, aged 19 and 31, in hospital.",
        "Content": " A man being investigated by counter terror police over a crossbow and firearm attack has died in hospital. The 38-year-old man was detained following the incident on Saturday which left two women, aged 19 and 31, seriously injured. Officers were called to Otley Road in Headingley, Leeds, to reports of a \"serious incident involving a man seen with weapons\", West Yorkshire Police said. The suspect - who was found with a self-inflicted injury - has been named as Owen Lawrence from Headingley. Police confirmed his death and said he is believed to have acted on his own. West Yorkshire Police said on Monday that one of the victims has been discharged from hospital, while the other has undergone surgery for life-threatening injuries. The force added that she is now recovering in hospital and is in a stable condition. Counter Terrorism Policing North East is continuing to investigate the incident following Lawrence's death. Posts on two Facebook accounts that appear to be linked to Lawrence include images of a gun and makeshift wooden knives, as well as a rambling entry setting out an apparent plan to kill people taking part in the Otley Road Run pub crawl. He also refers to victims including \"neurotypicals and police, if I need to\", and says that he has \"explored far-right ideas\" including the conspiracy theory referred to as the great replacement. Detective Chief Superintendent James Dunkerley, head of Counter Terrorism Policing North East, said: \"Officers will continue to conduct enquiries and we ask that if anyone has information that may assist, to pass this to police. \"We understand there are concerns around the incident, and questions about how and why this has happened. Our teams are committed to carrying out an in-depth investigation to provide answers to those affected. \"We continue to work closely with West Yorkshire Police to support the local community and thank residents for their support and understanding over the weekend. \"Our thoughts are with the victims, their families, and all those affected by this incident.\" Read more from Sky News:Mark Carney wins Canada electionWoman dies in skydiving incidentMan rescued from Mount Fuji twice It comes a day after proposals designed to tighten the law around crossbow sales were put forward by the government. Home Office minister Dame Diana Johnson said amendments tabled to the Crime and Policing Bill aim to strengthen age verification controls on both the online sale and delivery of the weapon. Dame Diana also expressed concerns about how people can go online and \"in a few clicks\" buy a crossbow, as she signalled the government intends to bring forward further measures. Her remarks came during an urgent question in the House of Commons about the attack in Leeds."
    },
    {
        "title": "Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments",
        "description": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled.",
        "url": "https://news.sky.com/story/kneecaps-eden-project-gig-cancelled-amid-row-over-kill-mps-comments-13358275",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 16:35:00",
        "Headline": "The cancellation of the concert follows an apology by the band to the families of MPs who have been murdered, but which also said the relevant footage had been \"exploited\", leading Downing Street to demand a fuller apology and the opposition leader to call for them to be banned.",
        "Content": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled. It comes after a row in which one of the group appeared to call for Tory MPs to be killed and another appeared to shout \"up Hamas, up Hezbollah\" in historical footage of a gig. A spokesperson for Eden Sessions, which organises the gigs at the Cornwall venue, said: \"Eden Sessions Limited announced today that the Kneecap show at Eden Project scheduled for July 4, 2025 has been cancelled. \"Ticket purchasers will be contacted directly and will be fully refunded. \"The refund process will commence from Wednesday, April 30 2025. Refunds will be processed against the original payment cards used. Purchasers should allow six working days for funds to be received into their accounts.\" On Monday, the band apologised to the families of murdered MPs Sir David Amess and Jo Cox after footage emerged of one of its members appearing to say \"kill your local MP\". But Katie Amess, daughter of Sir David, dismissed their apology, accusing them of \"deflection and excuses and gaslighting\". \n                  Why are Kneecap controversial?\n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis\n                 Why are Kneecap controversial?Murdered MP's daughter 'happy to meet' rappers In a statement posted on Instagram, the group, comprising Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, said they \"reject any suggestion that we would seek to incite violence against any MP or individual. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs. No smear campaign will change that,\" they added. The footage had been \"exploited and weaponised,\" they said. Their statement didn't impress Ms Amess, however, who on Tuesday accused them of \"gaslighting\", saying their comments were \"absurd\" and \"not an apology\". \"They don't understand what they're talking about, they obviously aren't educated enough in what they're speaking about to think that they can use those excuses and everybody will be like, 'oh, never mind, let's move on to something else'. They haven't taken any accountability. \"These words that they are using are extremely dangerous and they have not acknowledged that. 'Half-hearted' apology The prime minister's official spokesman called the band's statement \"half-hearted\" and urged them to make a fuller apology. He said Downing Street \"completely reject in the strongest possible terms the comments that they've made, particularly in relation to MPs and intimidation as well as obviously the situation in the Middle East. \"It's right that the police are looking into these videos.\" Conservative leader Kemi Badenoch called for Kneecap to be banned, saying they apologised \"because they realise that people don't like the kind of things that they've been saying\" and are \"worried they're going to lose their slot at Glastonbury\". Read more from Sky News:UK could hit 29C this weekWoman dies in skydiving incident'Moronic mission' to fell famous tree Police assessing Kneecap videos The Metropolitan Police is assessing footage from a November 2023 gig appearing to show one member of the group saying: \"The only good Tory is a dead Tory. Kill your local MP\", along with a video clip from a different concert in November 2024 in which a member of the band appeared to shout \"up Hamas, up Hezbollah\" - groups which are banned as terrorist organisations in the UK. In Monday's statement, Kneecap insisted they have \"never supported\" Hamas or Hezbollah. Ministers also put pressure on the organisers of the Glastonbury Festival over the band's inclusion in this year's line-up. In the Commons, security minister Dan Jarvis said ministers \"would urge organisers of the Glastonbury Festival to think very carefully about who is invited to perform there later this year\"."
    },
    {
        "title": "US voters divided over Trump's first 100 days - 10 out of 10, or a lack of grace and empathy?",
        "description": "From the White House these past 100 days,<a target=\"_blank\" href='https://podfollow.com/trump100/view'> I've chronicled the whirlwind that's reshaping America.</a>",
        "url": "https://news.sky.com/story/us-voters-divided-over-trumps-first-100-days-10-out-of-10-or-a-lack-of-grace-and-empathy-13358324",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-oval-office_6895491.jpg?20250424134305",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-04-29 18:23:00",
        "Headline": "After an exhaustive first 100 days, US citizens are becoming unusually reluctant to voice their opinions, concerned about the risk of becoming identified with one political side or the other in a sharply-divided country.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  From the White House these past 100 days, I've chronicled the whirlwind that's reshaping America. Getting beyond the West Wing and out of Washington has been harder. The volume of news has necessitated a near-constant presence in the US capital. Every single day, there has been something. Of course, this has been entirely intentional for the president and his team of proud disrupters. They pledged to govern differently, and on that promise, they have more than delivered. To fix America, Donald Trump first had to convince people that it is broken. Many didn't need convincing. Look for decline here and you'll easily find it; communities left behind. Look for bureaucracy and waste - you'll find that too. Common sense silenced by wokism? Many can relate to that. Immigration out of control? Politicians have been struggling with that for decades. In just 100 days, Mr Trump has harnessed all of that into a package of change that feels like nothing short of a revolution. \n                  Tariffs, DOGE and diet coke: Trump's first 100 days in 100 words\n                 \n                  Inside the Vietnamese factory preparing for the worst since Trump's tariff threat\n                 \n                  Who is Mark Carney - the political novice now elected by Canadian voters as prime minister?\n                 Despite the tsunami of news, my colleagues and I have managed to escape from the White House. And it is there, beyond Washington, that the more subtle but no less profound changes to the fabric of this nation can be felt. Whether it be innocuous tattoos that might now be associated with gang membership, free speech opinions penned on social media, or the willingness just to chat about politics, one startling thing I have observed these past 100 days is a growing sense of fear.  A passion for politics Anyone who has worked as a foreign correspondent in America will tell you that Americans love to give their opinion on politics. And they do it, always, with word-perfect articulation. There is no better place in the world for a 'voxpop'. There is a passion for politics that I haven't seen anywhere else I've lived and worked. Until now. Over these past 100 days, I have increasingly found a reticence that reflects an America changed by this president and his style. I'm in Detroit at the moment, in Michigan, the battleground state that helped to deliver Donald Trump the presidency back in November. I was here back then, too, and recall the enthusiasm with which people would discuss the upcoming election. There was enthusiasm for Trump and enthusiasm for Harris. An indictment of the times Now the response to my questions is, so often, \"no thanks, I'd rather not\". Sometimes people ask where the report will be seen. \"Will it be on in America?\" Think about it - this is America. What an indictment of the times, that people fear offering their opinion - whatever side of the aisle they sit. Very often, it's businesses that are extremely cautious of being associated with one political view or another. Such is the animosity now between the two sides. After a day of perseverance in Detroit this week, a few folk did talk to us. Their answers were revealing. In a park, I met Marie Freeman who said people are now \"more angry\". Her view is that America has lost something over these past 100 days. Trump 100: Read moreTariffs, DOGE and diet coke: Trump's first 100 days in 100 wordsWhy Trump faces awkward reckoning 100 days into the jobHow Trump's immigration crackdown has changed lives \"I definitely want us to move forward in a positive, more empathetic way. I think with Trump being such a hardcore president, we lose the empathy, we lose the grace for our fellow neighbours. We're all so angry because we're under angry leadership. And that's not good.\" 👉 Follow Trump100 on your podcast app 👈 She articulated a vibe which I recognise in so many parts of this country right now. A lack of grace and empathy. Yet, yards away, a couple walking their cats stopped to chat. I asked how they would rate these past 100 days. Two tens out of ten for Trump's performance."
    },
    {
        "title": "Crush fly-tippers' vans, government tells councils",
        "description": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste.",
        "url": "https://news.sky.com/story/crush-fly-tippers-vans-government-tells-councils-13358361",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crush-car-fly-tipping_6901140.jpg?20250429213040",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 20:14:00",
        "Headline": "Labour claims the last Conservative administration let fly-tipping get \"out of control\" - while the Tories say Labour is mismanaging waste in areas where it runs local authorities.",
        "Content": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste. No new funding is being given to local authorities for the initiatives, with ministers saying the seven percent raise announced in the budget can be used. As part of the announcement, the government has also proposed that fly-tippers could face up to five years in prison, although this would require a change in the law. Politics Hub: Follow latest updates Environment Secretary Steve Reed said: \"Councils will get much more aggressive against fly-tippers and that includes using the latest technology, things like the new mobile CCTV cameras and drones to identify, track and then seize the vehicles that are being used for fly-tipping to a yard like this and crush them. \"That's both as a punishment for those people who are dumping the rubbish but also as a deterrent for those who are thinking about doing it.\" He added: \"We're also looking to change the law so that those rogue operators who take rubbish from someone's home and then dump it on a nearby road - they were getting away almost scot-free under the previous government - they will now be looking at potentially five-year prison sentences.\" \n                  Wes Streeting's ex-aide Samuel Gould given suspended sentence after exposing himself to girl\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 The minister claimed the fly-tipping was \"out of control\" under the last government. Data from the Department for Environment, Food and Rural Affairs (DEFRA) shows local authorities in England dealt with a record 1.15 million incidents last year - a 20% increase from 2018/19. Environment Agency chief executive Philip Duffy said: \"We're determined to bring these criminals to justice through tough enforcement action and prosecutions. \"That's why we support the government's crackdown on waste criminals, which will ensure we have the right powers to shut rogue operators out of the waste industry.\" However, the Conservatives claimed that rubbish is \"piling high\" in areas like Birmingham as refuse workers strike against a pay and jobs offer from the Labour-run council. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Read more:Gangs 'make millions' from wasteVillage blocked by rubbish Shadow environment secretary Victoria Atkins said: \"Wherever Labour is in charge, waste is piling high - like in Birmingham, where Labour's inability to stand up to their union paymasters has left rat-infested rubbish littered across the street. \"And with statistics showing that of the 50 worst local areas for fly-tipping, 72% are Labour controlled, it is clear that voting Labour gets you rubbish and rats. \"So the British public deserve real action, not this series of reheated announcements and policies already introduced by previous governments that Labour is peddling.\" Liberal Democrat deputy leader Daisy Cooper said: \"Under the Conservatives' watch, local communities have been plagued by a fly-tipping epidemic. \"From overflowing bins to piles of hazardous waste, fly-tipping is blighting our landscapes, poisoning livestock on farming land and causing misery for residents. \"Enough is enough. \"The Liberal Democrats are calling for a fly-tipping fighting fund, to push for stronger local enforcement and tougher penalties for offenders.\""
    },
    {
        "title": "UK joins US in strike on Houthi target in Yemen for first time since Donald Trump re-elected",
        "description": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected.",
        "url": "https://news.sky.com/story/uk-joins-us-in-strike-on-houthi-target-in-yemen-for-first-time-since-donald-trump-re-elected-13358440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yemen-sanaa_6901213.jpg?20250430020943",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 23:46:00",
        "Headline": "The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden.",
        "Content": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected. The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden. The ministry said careful intelligence analysis identified a cluster of buildings used by the Houthis to manufacture the sort of drones used to attack ships, located 15 miles south of the capital Sanaa. RAF Typhoon FGR4s conducted strikes on several buildings using Paveway IV precision-guided bombs. The planes had air refuelling support from Voyager tankers. The ministry said the strike was conducted after dark to reduce the likelihood of civilians being in the area. All the aircraft returned safely. Defence Secretary John Healey said: \"This government will always act in the interests of our national and economic security. \"Royal Air Force Typhoons have successfully conducted strikes against a Houthi military target in Yemen and all UK aircraft and personnel have returned safely to base. \"We conducted these strikes, supported by the US, to degrade Houthi capabilities and prevent further attacks against UK and international shipping.\" Read more from Sky News:Kneecap's Eden Project gig cancelled amid 'kill MPs' rowIsrael releases medic detained after IDF attack on aid workersCrush fly-tippers' vans, government tells councils Houthis a 'persistent threat' to 'freedom of navigation' Mr Healey said Houthi activities in the Red Sea are a \"persistent threat\" to \"freedom of navigation\". \"A 55% drop in shipping through the Red Sea has already cost billions, fuelling regional instability and risking economic security for families in the UK,\" he said. \"The government is steadfast in our commitment to reinforcing global stability and protecting British working people. I am proud of the dedication and professionalism shown by the service men and women involved in this operation.\" US intensifies strikes on Houthis It was the first time UK forces have struck a target in Yemen since May last year, the ministry confirmed. The US has intensified its strikes on the Iran-backed Houthis under Mr Trump's presidency, after his re-election in November 2024. The group began launching attacks on shipping routes in November 2023 saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza.  The strike came after a Houthi-controlled TV channel claimed a US strike killed 68 people at a detention centre for African migrants in Yemen on Monday."
    },
    {
        "title": "Gaza aid worker detained after Israeli attack has been released",
        "description": "A paramedic in Gaza who was detained for more than five weeks following an Israeli attack that killed 15 aid workers has been released, the Palestinian Red Crescent Society (PRCS) said.",
        "url": "https://news.sky.com/story/gaza-aid-worker-detained-after-israeli-attack-has-been-released-13358133",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/gaza-aid-israel_6900664.jpg?20250429131533",
        "type": "Home",
        "Author": "Michelle Inez Simon, visual investigations producer, and Sky News&#x27; Gaza team",
        "Date Published": "2025-04-29 12:11:00",
        "Headline": "Asaad al Nsasrah, a paramedic with the Palestinian Red Crescent Society, has been released from Israeli detention after 37 days.",
        "Content": "By Michelle Inez Simon, visual investigations producer, and Sky News' Gaza team   A paramedic in Gaza who was detained for more than five weeks following an Israeli attack that killed 15 aid workers has been released, the Palestinian Red Crescent Society (PRCS) said. Asaad al Nsasrah was one of 17 aid workers who were attacked in Tel al Sultan in southern Gaza by Israeli forces on 23 March. Asaad was one of two first responders who survived - the other 15 were killed. He was initially thought to be missing, as his body was not among the dead. It was not until 13 April, three weeks after the attack, that Israel confirmed Asaad was alive and in Israeli detention. The PRCS announced Asaad's release on X and shared a video of him reuniting with colleagues. Sky News has seen images showing Asaad, among other released Palestinians, in a grey tracksuit at al Amal Hospital in Khan Younis, where he is undergoing medical examination, according to the PRCS. Sky News investigated how the attack on the aid workers unfolded - unearthing new evidence earlier this month contradicting Israel's official account of what happened. The Israeli military later released the findings of its own investigation into the incident, saying it had dismissed a deputy commander for providing an \"inaccurate report\".  The PRCS claimed the Israeli military's investigation was \"full of lies\". Asaad's voice can be heard in a video, initially published by the New York Times, that shows the moments leading up to the attack on the aid workers. The video was discovered on Rifaat Radwaan's phone, which was found on his body by rescue workers five days after the attack. Among those killed were one UN worker, eight paramedics from the PRCS and six first responders from Civil Defence - the official fire and rescue service of Gaza's Hamas-led government. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Meghan denies she is still using HRH title",
        "description": "Meghan's representatives have denied she is continuing to use the title Her Royal Highness (HRH) after relinquishing royal duties.",
        "url": "https://news.sky.com/story/meghan-denies-she-is-still-using-hrh-title-13358076",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-meghan-duchess-of-sussex_6900732.jpg?20250429135832",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 10:54:00",
        "Headline": "The Duchess of Sussex gave up the title when she stepped back as a senior royal - but video from a podcast interview suggests she still refers to herself as \"HRH\".",
        "Content": "Meghan's representatives have denied she is continuing to use the title Her Royal Highness (HRH) after relinquishing royal duties. The Duchess of Sussex gave up her royal title along with husband Prince Harry when they stepped down as senior royals in March 2020. However, video from the Jamie Kern Lima Show podcast shows a gift basket sent by Meghan to the host with a card that reads: \"With Compliments of HRH The Duchess of Sussex\". Ms Lima, co-founder of IT Cosmetics, said the basket she received containing homemade strawberry sauce and ice cream was sent to her home \"about a year ago... to see if that helps lighten my load\". A spokesman for the Sussexes said they do not use HRH titles. Buckingham Palace has been approached for comment. Although no laws were passed or documents signed to prevent the use of the titles, Harry and Meghan's agreement with the late Queen and senior officials was that they would stop using the word \"Royal\" after what was christened \"Megxit\" on 31 March 2020. They still retain the HRH titles, which Harry has had since birth, but are not supposed to use them. 'It's more of a honeymoon period for us now' Meanwhile, the duchess told the podcast she is enjoying a new \"honeymoon\" feeling with her husband since the pair got \"a little bit of breathing space\" after stepping back from their royal duties. Meghan said the couple struggled to fully enjoy one another's company early in their relationship as they were quickly put into \"the trenches\" by the media spotlight. The pair started dating in 2016 and married in 2018, initially taking on royal duties before deciding to step back from their roles, leading to strained relations between Harry and the King and the Prince of Wales. She said: \"You have to imagine at the beginning, everyone has, like, butterflies. \"Then we immediately went into the trenches together. Yeah, right out of the gate, like six months into dating. \"So now, seven years later, when you have a little bit of breathing space, you can just enjoy each other in a new way, and that's why I feel like it's more of a honeymoon period for us now.\" The duchess praised her husband for keeping the family \"safe\". Harry settled his long-running legal battle with News Group Newspapers (NGN) in January, receiving substantial damages and a \"full and unequivocal apology\" for \"serious intrusion\" into his private life and \"unlawful activities\" by The Sun. The duke is also involved in a legal battle with the Home Office over the level of taxpayer-funded personal security he should receive when visiting the UK. Read more from Sky News:Mark Carney wins Canada electionWoman dies in skydiving incidentMan rescued from Mount Fuji twice Meghan became emotional when talking about her children, Archie and Lilibet, and revealed that she sends emails to secret addresses she has created for them to read when they are older. She said: \"Before I go to bed, almost every night, I email them, like, here's your report card from today, or, oh my gosh, wasn't it the funniest thing this morning?\".  It comes after Meghan launched her Netflix show, new podcast and lifestyle brand As Ever. Meghan's first batch of As Ever products, including raspberry spread, flower sprinkles and herbal tea, sold out, but her Netflix lifestyle series With Love, Meghan was met with a barrage of critical reviews. The duchess also launched a new podcast series, Confessions Of A Female Founder, in April. In the fourth episode, the former Suits actress described how she started small with her jam-making inspired business venture because of a fear of failing and that she was given business advice by Oprah Winfrey. Meghan also claimed she is an over-achiever because her blood type is A positive, and admitted ignoring her own advisers to follow her gut feelings. She was frequently accused of ignoring royal aides' advice when she was a working royal."
    },
    {
        "title": "Three people killed after shooting in Sweden",
        "description": "Three people have been killed after a shooting in Sweden.",
        "url": "https://news.sky.com/story/three-people-killed-after-shooting-in-sweden-13358357",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sweden-crime-gang_6901119.jpg?20250429205719",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-29 19:53:00",
        "Headline": "Witnesses told Swedish media they heard five gunshots and saw people in the area running to take cover. A murder investigation has since been launched by police after the incident in the city of Uppsala.",
        "Content": "Three people have been killed after a shooting in Sweden. A murder investigation has been launched following the incident in the city of Uppsala. Witnesses told local media they heard five shots and saw people in the area running to take cover. Inside Sweden's deadly gang war Police said it was investigating the shooting as a homicide and that it had no information about whether it was a terror or hate crime-related incident at this point. A spokesperson for the force said it had information someone had left the scene on an electric scooter - it was unclear whether they were a suspect, witness or otherwise. Electric scooters have been used several times as a mode of transport after gang shootings in the country. \n                  Denmark postal service to stop delivering letters\n                 \n                  Orebro shooting: What we know about the man suspected of killing 11 people at an adult education centre in Sweden? \n                 \n                  Orebro shooting: Sweden gunman 'had access to weapons and had major problems at school'\n                 Uppsala, a city around 70km (43 miles) north of the capital Stockholm, has seen a number of gang-related shootings in the past decade, but usually outside the city centre. In a statement, Swedish justice minister Gunnar Strommer said: \"A brutal act of violence has occurred in central Uppsala... this is at the same time as the whole of Uppsala has begun Walpurgis Night. \"What has happened is extremely serious.\" The shooting took place on the eve of the Walpurgis spring festival in the city. Local media reported that the attack took place near or in a hairdresser's. In February, 10 people were killed in the city of Orebro in the country's deadliest ever mass shooting after a 35-year-old opened fire in an adult learning centre. Read more from Sky News:Deaths linked to Spain-Portugal blackoutStudent rescued from mountain twiceKim Kardashian to testify in armed robbery trial Sweden's right-wing government came to power in 2022, promising to tackle gang-related violence. It has tightened laws and given more powers to police and after the Orebro shooting it vowed to tighten gun laws as well."
    },
    {
        "title": "Government warned it is setting country up for 'disaster' unless it better prepares UK for heavy flooding and intense heat",
        "description": "A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires.",
        "url": "https://news.sky.com/story/government-warned-it-is-setting-country-up-for-disaster-unless-it-better-prepares-uk-for-heavy-flooding-and-intense-heat-13358235",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wildfire-country-down_6900969.jpg?20250429172227",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-29 23:30:00",
        "Headline": "After deadly flooding in Valencia and fierce LA wildfires, climate advisers in the UK have issued a stark warning the country is unprepared to cope with a hotter world.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires. Following deadly flooding in Valencia and furious wildfires in Los Angeles, the UK's climate advisers have warned people and critical infrastructure are highly exposed to extreme weather due to a \"piecemeal and disjointed approach\". They warned progress in adapting to a hotter world has either been glacial, or moved in the wrong direction - amid fears of budget cuts in the upcoming spending review and spiralling problems in the water industry. Of the 46 measures of government delivery - from protecting railways from collapsing to ensuring water and food security - not one was rated \"good\". The Climate Change Committee (CCC) even said there has been \"no change in addressing this risk\" under the new Labour government - raising questions about its claims to be a climate leader. The government says the issue is a top priority. Baroness Brown, who chairs the CCC's adaptation committee, told Sky News: \"We know what climate change is doing now. We know worse is to come. And yet nobody seems to be taking this seriously enough.\" \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 While Labour has made bold strides in trying to limit climate change, it's done very little on helping us deal with the impacts, she said. \"It still seems to feel like it's tomorrow's problem… and if we don't tackle it today, it becomes tomorrow's disaster.\" The \"Progress in adapting to climate change\" report warns that by 2050: It said climate change is already hitting hard:  Outcry has been widespread Farmers said it is \"shocking how unprepared we are\", while businesses called it \"sobering reading\". Thinktanks said climate threats \"should be considered national security risks\" and scientists said getting it right \"could save the UK billions of pounds\". Obstetricians warned air pollution and heatwaves risk premature births. But spending across government is tightly squeezed as the chancellor moots further cuts - with the budget for flood defences proposed for the chopping block. The issue isn't unique to the UK. Around the world, adapting to climate change has proved harder to get to grips with than measures to curb it. Scientists say both are needed. But \"this isn't impossible,\" said Baroness Brown, citing good examples in Canada, Germany and the Netherlands. She said in some areas, the UK government doesn't even know what it is aiming for, even though targets are \"hugely important\" for attracting private investment. Bev Cornaby, director of the Corporate Leaders Group UK, said: \"The private sector can deliver more, including innovation, investment and leadership, with clear goals, joined up policy and better communication and engagement from government.\" The CCC called for a raft of measures, from retrofitting hospitals with green roofs for cooling, to ensuring people know what to do in a heatwave such as closing windows and curtains in the morning. A government spokesperson said they would carefully consider the findings of the committee's report. They added: \"Alongside our transition to become a clean energy superpower and accelerating towards net zero, the government is taking robust action to prepare for the impacts of a changing climate. \"We are investing a record £2.65bn to repair and build flood defences, protecting tens of thousands of homes and businesses and helping local communities become more resilient to the effects of climate change such as overheating and drought.\""
    },
    {
        "title": "UK joins US in strike on Houthi target in Yemen for first time since Donald Trump re-elected",
        "description": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected.",
        "url": "https://news.sky.com/story/uk-joins-us-in-strike-on-houthi-target-in-yemen-for-first-time-since-donald-trump-re-elected-13358440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yemen-sanaa_6901213.jpg?20250430020943",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 23:46:00",
        "Headline": "The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden.",
        "Content": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected. The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden. The ministry said careful intelligence analysis identified a cluster of buildings used by the Houthis to manufacture the sort of drones used to attack ships, located 15 miles south of the capital Sanaa. RAF Typhoon FGR4s conducted strikes on several buildings using Paveway IV precision-guided bombs. The planes had air refuelling support from Voyager tankers. The ministry said the strike was conducted after dark to reduce the likelihood of civilians being in the area. All the aircraft returned safely. Defence Secretary John Healey said: \"This government will always act in the interests of our national and economic security. \"Royal Air Force Typhoons have successfully conducted strikes against a Houthi military target in Yemen and all UK aircraft and personnel have returned safely to base. \"We conducted these strikes, supported by the US, to degrade Houthi capabilities and prevent further attacks against UK and international shipping.\" Read more from Sky News:Kneecap's Eden Project gig cancelled amid 'kill MPs' rowIsrael releases medic detained after IDF attack on aid workersCrush fly-tippers' vans, government tells councils Houthis a 'persistent threat' to 'freedom of navigation' Mr Healey said Houthi activities in the Red Sea are a \"persistent threat\" to \"freedom of navigation\". \"A 55% drop in shipping through the Red Sea has already cost billions, fuelling regional instability and risking economic security for families in the UK,\" he said. \"The government is steadfast in our commitment to reinforcing global stability and protecting British working people. I am proud of the dedication and professionalism shown by the service men and women involved in this operation.\" US intensifies strikes on Houthis It was the first time UK forces have struck a target in Yemen since May last year, the ministry confirmed. The US has intensified its strikes on the Iran-backed Houthis under Mr Trump's presidency, after his re-election in November 2024. The group began launching attacks on shipping routes in November 2023 saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza.  The strike came after a Houthi-controlled TV channel claimed a US strike killed 68 people at a detention centre for African migrants in Yemen on Monday."
    },
    {
        "title": "Man arrested over Leeds crossbow incident which seriously injured two women has died",
        "description": "A man being investigated by counter terror police over a crossbow and firearm attack has died in hospital.",
        "url": "https://news.sky.com/story/man-38-involved-in-leeds-crossbow-incident-which-seriously-injured-two-women-has-died-13358095",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-owen-lawrence-crossbow_6900794.png?20250429144300",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 11:20:00",
        "Headline": "Owen Lawrence, 38, had been detained following the attack on Saturday which left two women, aged 19 and 31, in hospital.",
        "Content": " A man being investigated by counter terror police over a crossbow and firearm attack has died in hospital. The 38-year-old man was detained following the incident on Saturday which left two women, aged 19 and 31, seriously injured. Officers were called to Otley Road in Headingley, Leeds, to reports of a \"serious incident involving a man seen with weapons\", West Yorkshire Police said. The suspect - who was found with a self-inflicted injury - has been named as Owen Lawrence from Headingley. Police confirmed his death and said he is believed to have acted on his own. West Yorkshire Police said on Monday that one of the victims has been discharged from hospital, while the other has undergone surgery for life-threatening injuries. The force added that she is now recovering in hospital and is in a stable condition. Counter Terrorism Policing North East is continuing to investigate the incident following Lawrence's death. Posts on two Facebook accounts that appear to be linked to Lawrence include images of a gun and makeshift wooden knives, as well as a rambling entry setting out an apparent plan to kill people taking part in the Otley Road Run pub crawl. He also refers to victims including \"neurotypicals and police, if I need to\", and says that he has \"explored far-right ideas\" including the conspiracy theory referred to as the great replacement. Detective Chief Superintendent James Dunkerley, head of Counter Terrorism Policing North East, said: \"Officers will continue to conduct enquiries and we ask that if anyone has information that may assist, to pass this to police. \"We understand there are concerns around the incident, and questions about how and why this has happened. Our teams are committed to carrying out an in-depth investigation to provide answers to those affected. \"We continue to work closely with West Yorkshire Police to support the local community and thank residents for their support and understanding over the weekend. \"Our thoughts are with the victims, their families, and all those affected by this incident.\" Read more from Sky News:Mark Carney wins Canada electionWoman dies in skydiving incidentMan rescued from Mount Fuji twice It comes a day after proposals designed to tighten the law around crossbow sales were put forward by the government. Home Office minister Dame Diana Johnson said amendments tabled to the Crime and Policing Bill aim to strengthen age verification controls on both the online sale and delivery of the weapon. Dame Diana also expressed concerns about how people can go online and \"in a few clicks\" buy a crossbow, as she signalled the government intends to bring forward further measures. Her remarks came during an urgent question in the House of Commons about the attack in Leeds."
    },
    {
        "title": "Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments",
        "description": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled.",
        "url": "https://news.sky.com/story/kneecaps-eden-project-gig-cancelled-amid-row-over-kill-mps-comments-13358275",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 16:35:00",
        "Headline": "The cancellation of the concert follows an apology by the band to the families of MPs who have been murdered, but which also said the relevant footage had been \"exploited\", leading Downing Street to demand a fuller apology and the opposition leader to call for them to be banned.",
        "Content": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled. It comes after a row in which one of the group appeared to call for Tory MPs to be killed and another appeared to shout \"up Hamas, up Hezbollah\" in historical footage of a gig. A spokesperson for Eden Sessions, which organises the gigs at the Cornwall venue, said: \"Eden Sessions Limited announced today that the Kneecap show at Eden Project scheduled for July 4, 2025 has been cancelled. \"Ticket purchasers will be contacted directly and will be fully refunded. \"The refund process will commence from Wednesday, April 30 2025. Refunds will be processed against the original payment cards used. Purchasers should allow six working days for funds to be received into their accounts.\" On Monday, the band apologised to the families of murdered MPs Sir David Amess and Jo Cox after footage emerged of one of its members appearing to say \"kill your local MP\". But Katie Amess, daughter of Sir David, dismissed their apology, accusing them of \"deflection and excuses and gaslighting\". \n                  Why are Kneecap controversial?\n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis\n                 Why are Kneecap controversial?Murdered MP's daughter 'happy to meet' rappers In a statement posted on Instagram, the group, comprising Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, said they \"reject any suggestion that we would seek to incite violence against any MP or individual. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs. No smear campaign will change that,\" they added. The footage had been \"exploited and weaponised,\" they said. Their statement didn't impress Ms Amess, however, who on Tuesday accused them of \"gaslighting\", saying their comments were \"absurd\" and \"not an apology\". \"They don't understand what they're talking about, they obviously aren't educated enough in what they're speaking about to think that they can use those excuses and everybody will be like, 'oh, never mind, let's move on to something else'. They haven't taken any accountability. \"These words that they are using are extremely dangerous and they have not acknowledged that. 'Half-hearted' apology The prime minister's official spokesman called the band's statement \"half-hearted\" and urged them to make a fuller apology. He said Downing Street \"completely reject in the strongest possible terms the comments that they've made, particularly in relation to MPs and intimidation as well as obviously the situation in the Middle East. \"It's right that the police are looking into these videos.\" Conservative leader Kemi Badenoch called for Kneecap to be banned, saying they apologised \"because they realise that people don't like the kind of things that they've been saying\" and are \"worried they're going to lose their slot at Glastonbury\". Read more from Sky News:UK could hit 29C this weekWoman dies in skydiving incident'Moronic mission' to fell famous tree Police assessing Kneecap videos The Metropolitan Police is assessing footage from a November 2023 gig appearing to show one member of the group saying: \"The only good Tory is a dead Tory. Kill your local MP\", along with a video clip from a different concert in November 2024 in which a member of the band appeared to shout \"up Hamas, up Hezbollah\" - groups which are banned as terrorist organisations in the UK. In Monday's statement, Kneecap insisted they have \"never supported\" Hamas or Hezbollah. Ministers also put pressure on the organisers of the Glastonbury Festival over the band's inclusion in this year's line-up. In the Commons, security minister Dan Jarvis said ministers \"would urge organisers of the Glastonbury Festival to think very carefully about who is invited to perform there later this year\"."
    },
    {
        "title": "Why are Kneecap controversial?",
        "description": "Irish band Kneecap have had a meteoric rise in the music industry, with tens of millions of streams on Spotify alone and widespread critical acclaim.",
        "url": "https://news.sky.com/story/why-are-kneecap-controversial-13358184",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-kneecap-band-government_6761084.jpg?20241129121256",
        "type": "UK",
        "Author": "Jake Levison",
        "Date Published": "2025-04-29 13:11:00",
        "Headline": "The English and Irish-language rap group have been embroiled in huge controversy in recent weeks - but who are they, and what are they accused of?",
        "Content": "\n          News reporter\n       Irish band Kneecap have had a meteoric rise in the music industry, with tens of millions of streams on Spotify alone and widespread critical acclaim. The trio's genre-bending rap/hip hop tracks, performed in a mixture of English and Irish-language, have clearly resonated with a mainstream audience, but their many controversial moments - some of them seemingly intentional - have helped them hit such heights. Here's what you need to know about the band and their most notorious moments. Who's in the band? The group is made up of three friends from Belfast: Mo Chara (Liam Og O Hannaidh), Moglai Bap (Naoise O Caireallain) and DJ Provai (JJ O Dochartaigh). The latter is a former teacher who still wears a balaclava, initially to disguise himself from his students when the band started out in 2017. They were controversial from the get-go - and seemingly by design. \n                  Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments\n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis\n                 Their debut track - CEARTA - is based on how band member Bap was stopped by police for spray-painting cearta, the Irish word for rights, on a bus stop. Before fame, Bap and Chara, who have known each other for around 15 years, transformed a former youth club into party hub, where they would play their favourite tracks. And it was through this venture into the club space that they later met DJ Provai. The group called themselves Kneecap in reference to kneecapping, a common form of paramilitary punishment in Northern Ireland during The Troubles which sees someone shot or hit repeatedly on both knees. From cult heroes to mainstream success Kneecap released their first mixtape, 3cag, in 2018 to critical acclaim, and their 2019 single HOOD is their most streamed single to date. But their success reached new levels in 2024 with the release of their 18-track album, Fine Art, which culminated in a headline-worthy crowd attending their early-morning timeslot at Glastonbury. The band then ventured into the film industry with a self-titled biopic about their rise to prominence, set in post-Troubles Belfast, starring themselves alongside Irish actor Michael Fassbender. Before its full release last summer, it had been the talk of various film festivals, including Tribeca in New York. Speaking to Sky News at Glastonbury last year, the band said the reaction had been \"crazy\". Since then it's got crazier, with the film getting six BAFTA nominations and earning its writer and director Rich Peppiatt a win for Outstanding Debut. The band cracked the UK and are now following suit in the US, having sold out several shows there. Court battle with the UK government It would take a long time to cover all of Kneecap's controversial moments; much of it is a part of their music itself. They have been banned from Irish public service broadcaster RTE for their references to drug-taking. But there have been some particularly high-profile incidents since 2024. The first was their legal battle with the then-Conservative UK government, who blocked a grant for the band which was initially approved by the British Phonographic Industry. The group's application to the Music Export Growth Scheme, which supports UK-registered artists in global markets, was for £14,250, but Kemi Badenoch, then business secretary, stopped it. At the time, a government spokesperson said it fully supported freedom of speech, but that it was \"hardly surprising\" it did not want to hand out UK taxpayers' money to those opposed to the United Kingdom. One of their most famous tracks had been 2019's Get Your Brits Out, which had been criticised for being anti-British. The trio have always denied this being the case. Chara told Sky News after their Glastonbury set: \"This is a thing that people love to spin, like we're some anti-British band. \"We have English family. We have loads of good friends who call themselves British. It's the British government we don't like.\" Kneecap won a discrimination case against the UK government in November, earning them the same amount that the grant was worth. DJ Provai said the band's motivation was \"equality\". \"For us, this action was never about £14,250; it could have been 50p,\" he said, after the band said it would donate the funds to two Belfast charities. \"This was an attack on artistic culture, an attack on the Good Friday Agreement itself and an attack on Kneecap and our way of expressing ourselves.\" Calling for deaths of Conservative MPs Police say they are assessing a video of a Kneecap performance from November 2023, in which a member of the trio allegedly called for the death of Conservative MPs. The member is alleged to have said: \"The only good Tory is a dead Tory. Kill your local MP.\" Two British MPs have been murdered in the past 10 years - Labour's Jo Cox in 2016 and Conservative Sir David Amess in 2021.  In a statement, Kneecap said they rejected \"any suggestion that we would seek to incite violence against any MP or individual. Ever.\" They added: \"An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action. \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt.\" Pro-Palestinian messages at gigs The investigation into the MP comments was announced several days after the Met said it had referred a different video from a Kneecap gig to be reviewed by counter-terror police. Footage from that gig, at London's Kentish Town Forum last November, appeared to show one member of the group shouting \"up Hamas, up Hezbollah\". Hamas and Hezbollah are both proscribed as terrorist groups in the UK. Under Section 12 of the Terrorism Act 2000, it is an offence to express \"an opinion or belief that is supportive of a proscribed organisation\". The police say they are \"assessing\" both clips to \"determine whether further police investigation is required\". Kneecap have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In their statement, they said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Investigation comes after Coachella fallout Just days before the police investigations were announced, TV personality Sharon Osbourne called for Kneecap's US work visas to be revoked after accusing them of making \"aggressive political statements\" including \"projections of anti-Israel messages and hate speech\" at Coachella Music and Arts Festival. As the band performed on the second night, they displayed words on the big screen reading: \"Israel is committing genocide against the Palestinian people. \"It is being enabled by the US government who arm and fund Israel despite their war crimes. F*** Israel. Free Palestine\". Israel's ongoing offensive in Gaza, which came after Hamas gunmen launched an attack killing 1,200 people in Israel on 7 October 2023, has seen at least 52,000 people killed, according to the Gaza health ministry. Read more:BBC presenter called out for 'exceptionally inappropriate language', review hearsThe Alarm frontman dies after blood cancer diagnosis Speaking to Rolling Stone after Osbourne's comments, Kneecap member Mo Chara said: \"Her rant has so many holes in it that it hardly warrants a reply, but she should listen to War Pigs that was written by Black Sabbath [led by Ozzy Osbourne, her husband].\" He also told the outlet: \"We believe we have an obligation to use our platform when we can to raise the issue of Palestine, and it was important for us to speak out at Coachella as the USA is the main funder and supplier of weapons to Israel as they commit genocide in Gaza.\" Kneecap has been continually outspoken in favour of Palestinians at gigs. In November, DJ Provai arrived for the court verdict against the UK government in a vehicle bearing the Irish and Palestinian flags and blaring loud music."
    },
    {
        "title": "Two men went on 'moronic mission' to fell Sycamore Gap tree, jury told",
        "description": "Two men went on a \"moronic mission\" to fell the famous Sycamore Gap tree in an act of \"mindless vandalism\" which they filmed on a phone, a jury has been told.",
        "url": "https://news.sky.com/story/two-men-went-on-moronic-mission-to-fell-sycamore-gap-tree-jury-told-13358045",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-sycamore-gap-tree-crme_6555192.jpg?20250429112946",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 10:25:00",
        "Headline": "Daniel Graham, 39, and Adam Carruthers, 32, deny two counts each of criminal damage.",
        "Content": " Two men went on a \"moronic mission\" to fell the famous Sycamore Gap tree in an act of \"mindless vandalism\" which they filmed on a phone, a jury has been told. Daniel Graham, 39, and Adam Carruthers, 32, used a chainsaw to chop down the tree and \"the technique that they used showed expertise and a determined, deliberate approach to the felling\", prosecutors told Newcastle Crown Court on Tuesday. Richard Wright KC, prosecuting, said one of the men cut across the trunk, causing the sycamore to fall and hit Hadrian's Wall, while the other defendant filmed what they were doing on a mobile phone. Mr Wright said: \"The prosecution say that two men are responsible for that mindless vandalism - the defendants, Daniel Graham and Adam Carruthers.\" The prosecutor said the pair had driven to the Sycamore Gap area of Northumberland in Graham's Range Rover from the Carlisle area, where they lived, late on 27 September 2023. Opening the prosecution case, Mr Wright told the jury: \"Though the tree had grown for over 100 years, the act of irreparably damaging it was the work of a matter of minutes. \"Having completed their moronic mission, the pair got back into the Range Rover, and travelled back towards Carlisle. \"During that return journey Mr Carruthers received a video of his young child from his partner. He replied to her 'I've got a better video than that'. \"Minutes later the video of the felling of the tree was sent from Graham's phone to Carruthers' phone. \"At the time of that text conversation the only people in the world who knew that the tree had been felled were the men who had cut it down.\" Mr Wright told the court photographs and two short videos were taken on Graham's phone which showed a piece of wood next to a chainsaw in the boot of his Range Rover. The prosecutor said: \"A forensic botanist has confirmed that there is very strong evidence to support the hypothesis that the piece of wood in the video and images is the wedge that was taken from Sycamore Gap. \"This was perhaps a trophy taken from the scene to remind them of their actions, actions that they appear to have been revelling in.\" The missing wedge was never recovered. The jury also heard how the pair allegedly shared social media posts about the incident with each other as the media began reporting the news, with Graham allegedly saying to Carruthers: \"Here we go.\" Graham and Carruthers were said to be \"friends who were regularly in each other's company\" at the time of the felling. Graham lived in Carlisle and had a groundwork company called D M Graham Groundworks. Carruthers lived at a location on the Kirkbride Airfield in Cumbria and told police during an interview he worked in property maintenance and mechanics. Ian Everard, who had worked for the Forestry Commission for more than 36 years, examined the tree and photographs, and confirmed that the marking of the tree and cutting a wedge is a recognised technique in felling. Mr Wright said: \"The prosecution say that use of this technique is relevant, in that it shows that the tree was felled by someone with some knowledge of how to fell a tree. \"It also shows that the people who felled the tree knew that the tree would fall onto the wall, or at least would have known that there was a risk that it would fall onto the wall.\" Graham and Carruthers deny two counts each of criminal damage. They are jointly charged with causing £622,191 of criminal damage to the much-photographed Northumberland tree. They are also charged with causing £1,144 of damage to Hadrian's Wall, a UNESCO World Heritage Site. The wall and the tree belong to the National Trust. The trial continues."
    },
    {
        "title": "Government warned it is setting country up for 'disaster' unless it better prepares UK for heavy flooding and intense heat",
        "description": "A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires.",
        "url": "https://news.sky.com/story/government-warned-it-is-setting-country-up-for-disaster-unless-it-better-prepares-uk-for-heavy-flooding-and-intense-heat-13358235",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wildfire-country-down_6900969.jpg?20250429172227",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-29 23:30:00",
        "Headline": "After deadly flooding in Valencia and fierce LA wildfires, climate advisers in the UK have issued a stark warning the country is unprepared to cope with a hotter world.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires. Following deadly flooding in Valencia and furious wildfires in Los Angeles, the UK's climate advisers have warned people and critical infrastructure are highly exposed to extreme weather due to a \"piecemeal and disjointed approach\". They warned progress in adapting to a hotter world has either been glacial, or moved in the wrong direction - amid fears of budget cuts in the upcoming spending review and spiralling problems in the water industry. Of the 46 measures of government delivery - from protecting railways from collapsing to ensuring water and food security - not one was rated \"good\". The Climate Change Committee (CCC) even said there has been \"no change in addressing this risk\" under the new Labour government - raising questions about its claims to be a climate leader. The government says the issue is a top priority. Baroness Brown, who chairs the CCC's adaptation committee, told Sky News: \"We know what climate change is doing now. We know worse is to come. And yet nobody seems to be taking this seriously enough.\" \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 While Labour has made bold strides in trying to limit climate change, it's done very little on helping us deal with the impacts, she said. \"It still seems to feel like it's tomorrow's problem… and if we don't tackle it today, it becomes tomorrow's disaster.\" The \"Progress in adapting to climate change\" report warns that by 2050: It said climate change is already hitting hard:  Outcry has been widespread Farmers said it is \"shocking how unprepared we are\", while businesses called it \"sobering reading\". Thinktanks said climate threats \"should be considered national security risks\" and scientists said getting it right \"could save the UK billions of pounds\". Obstetricians warned air pollution and heatwaves risk premature births. But spending across government is tightly squeezed as the chancellor moots further cuts - with the budget for flood defences proposed for the chopping block. The issue isn't unique to the UK. Around the world, adapting to climate change has proved harder to get to grips with than measures to curb it. Scientists say both are needed. But \"this isn't impossible,\" said Baroness Brown, citing good examples in Canada, Germany and the Netherlands. She said in some areas, the UK government doesn't even know what it is aiming for, even though targets are \"hugely important\" for attracting private investment. Bev Cornaby, director of the Corporate Leaders Group UK, said: \"The private sector can deliver more, including innovation, investment and leadership, with clear goals, joined up policy and better communication and engagement from government.\" The CCC called for a raft of measures, from retrofitting hospitals with green roofs for cooling, to ensuring people know what to do in a heatwave such as closing windows and curtains in the morning. A government spokesperson said they would carefully consider the findings of the committee's report. They added: \"Alongside our transition to become a clean energy superpower and accelerating towards net zero, the government is taking robust action to prepare for the impacts of a changing climate. \"We are investing a record £2.65bn to repair and build flood defences, protecting tens of thousands of homes and businesses and helping local communities become more resilient to the effects of climate change such as overheating and drought.\""
    },
    {
        "title": "'Prolific' board game shoplifter sentenced",
        "description": "A man has been sentenced after carrying out a 22-month shoplifting spree at a London store, where he stole board games, books and toys with a total value of thousands of pounds.",
        "url": "https://news.sky.com/story/prolific-board-game-shoplifter-sentenced-13358255",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-paul-mangal-london_6900920.jpg?20250429164109",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 15:41:00",
        "Headline": "Paul Mangal stole more than £3,000 worth of board games, books and toys from a shop in Haringey.",
        "Content": "A man has been sentenced after carrying out a 22-month shoplifting spree at a London store, where he stole board games, books and toys with a total value of thousands of pounds. Paul Mangal, of Haringey, north London, received a 12-month jail term, suspended for two years, for stealing more than £3,000 worth of goods. The \"prolific shoplifter\", 58, repeatedly targeted a Waterstones store on The Broadway in Crouch End, Haringey, between April 2023 and February this year, the Metropolitan Police said. The force found out about his stealing from store staff after increasing the number of patrols it carried out in The Broadway since last September. Officers gathered CCTV footage and other evidence to identify Mangal in January, during a month-long operation. When the suspect entered the store and made off with several items in a suitcase the following month, staff alerted officers, who arrested him near his home in Hornsey and charged him the following day. Mangal admitted 23 charges of theft at Highbury Corner Magistrates' Court in February. \n                  Huge fire breaks out at electrical substation in west London\n                 \n                  'Nervous wees' of women at London Marathon 'to be turned into something amazing'\n                 \n                  Man charged with murder after woman stabbed to death in Enfield\n                 In addition to the suspended jail term, Mangal was banned from entering Crouch End or Hornsey for two years, and from being in possession of a suitcase in either of those areas. Sergeant James Elliott, of the local policing team in north London, who led the investigation, said shoplifting is something that worries local people and businesses in Haringey, and \"we are stepping up our efforts to tackle it\". He said the strong relationships they built with staff at the branch allowed them to identify Mangal \"by assessing his patterns of offending, which appeared to ramp up before, during and immediately after Christmas, then almost daily up until his arrest\". Read more from Sky News:Woman dies in skydiving incident'Moronic mission' to fell famous treeNo charges over ice hockey death Some businesses on The Broadway are being targeted so often, Sergeant Elliott said, that \"many have stopped reporting thefts to police\". But, he said, through proactive measures such as \"relationship building and doubling the number of officers on the ward since February\", they have managed to reduce the number of thefts in the area by 35% since December last year. The Met says it plans to introduce Live Facial Recognition (LFR) patrols to identify offenders, and over the summer, officers will be out on bicycles \"so they're able to react quicker to shoplifting incidents when they occur\"."
    },
    {
        "title": "Crush fly-tippers' vans, government tells councils",
        "description": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste.",
        "url": "https://news.sky.com/story/crush-fly-tippers-vans-government-tells-councils-13358361",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crush-car-fly-tipping_6901140.jpg?20250429213040",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-29 20:14:00",
        "Headline": "Labour claims the last Conservative administration let fly-tipping get \"out of control\" - while the Tories say Labour is mismanaging waste in areas where it runs local authorities.",
        "Content": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste. No new funding is being given to local authorities for the initiatives, with ministers saying the seven percent raise announced in the budget can be used. As part of the announcement, the government has also proposed that fly-tippers could face up to five years in prison, although this would require a change in the law. Politics Hub: Follow latest updates Environment Secretary Steve Reed said: \"Councils will get much more aggressive against fly-tippers and that includes using the latest technology, things like the new mobile CCTV cameras and drones to identify, track and then seize the vehicles that are being used for fly-tipping to a yard like this and crush them. \"That's both as a punishment for those people who are dumping the rubbish but also as a deterrent for those who are thinking about doing it.\" He added: \"We're also looking to change the law so that those rogue operators who take rubbish from someone's home and then dump it on a nearby road - they were getting away almost scot-free under the previous government - they will now be looking at potentially five-year prison sentences.\" \n                  Wes Streeting's ex-aide Samuel Gould given suspended sentence after exposing himself to girl\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 The minister claimed the fly-tipping was \"out of control\" under the last government. Data from the Department for Environment, Food and Rural Affairs (DEFRA) shows local authorities in England dealt with a record 1.15 million incidents last year - a 20% increase from 2018/19. Environment Agency chief executive Philip Duffy said: \"We're determined to bring these criminals to justice through tough enforcement action and prosecutions. \"That's why we support the government's crackdown on waste criminals, which will ensure we have the right powers to shut rogue operators out of the waste industry.\" However, the Conservatives claimed that rubbish is \"piling high\" in areas like Birmingham as refuse workers strike against a pay and jobs offer from the Labour-run council. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Read more:Gangs 'make millions' from wasteVillage blocked by rubbish Shadow environment secretary Victoria Atkins said: \"Wherever Labour is in charge, waste is piling high - like in Birmingham, where Labour's inability to stand up to their union paymasters has left rat-infested rubbish littered across the street. \"And with statistics showing that of the 50 worst local areas for fly-tipping, 72% are Labour controlled, it is clear that voting Labour gets you rubbish and rats. \"So the British public deserve real action, not this series of reheated announcements and policies already introduced by previous governments that Labour is peddling.\" Liberal Democrat deputy leader Daisy Cooper said: \"Under the Conservatives' watch, local communities have been plagued by a fly-tipping epidemic. \"From overflowing bins to piles of hazardous waste, fly-tipping is blighting our landscapes, poisoning livestock on farming land and causing misery for residents. \"Enough is enough. \"The Liberal Democrats are calling for a fly-tipping fighting fund, to push for stronger local enforcement and tougher penalties for offenders.\""
    },
    {
        "title": "Scottish FA banning transgender women from playing in women's football",
        "description": "Scottish football is introducing a ban on transgender women playing in women's football, Sky News understands.",
        "url": "https://news.sky.com/story/scottish-fa-banning-transgender-women-from-playing-in-womens-football-13358216",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-football-grass-sprots_6900883.jpg?20250429155637",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-04-29 14:21:00",
        "Headline": "The updated policy follows the UK Supreme Court ruling that a female is defined by biological sex.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Scottish football is introducing a ban on transgender women playing in women's football, Sky News understands. The updated policy goes beyond global governing body FIFA, which has been conducting a gender eligibility review for more than three years without any conclusion. The Scottish Football Association's change follows the UK Supreme Court ruling that a female is defined by biological sex. From next season, only players who were female at birth will be allowed to play in women's football over the age of 13 in Scotland. The new policy emulates blanket bans on trans women in women's sport introduced by athletics, cricket and rugby. The Supreme Court ruling has prompted another review of regulations in English football, just weeks after the Football Association (FA) updated gender eligibility rules. The FA will be able to prevent transgender women from playing in women's matches if there are concerns about the safety of opponents and the fairness of the competition. The FA will only intervene on a case-by-case basis, hoping to resolve issues through dialogue. The FA rules still say that players over the age of 16 who were male at birth have to show their blood testosterone is below a particular level to play in women's matches.  There aren't believed to be any transgender women in women's professional football in England or Scotland. The FA says there are only around 20 trans women playing this season in the grassroots game. There are concerns about trans women, who face being marginalised and discriminated against in society, being excluded from sport. Read more from Sky News:Why the definition of a woman has caused controversyTwo men went on 'moronic mission' to fell tree, court hearsChild damages painting worth tens of millions of pounds But others want to protect the fairness and safety of sport, with concerns about transgender women retaining physical advantages having gone through any male puberty."
    },
    {
        "title": "Gaza aid worker detained after Israeli attack has been released",
        "description": "A paramedic in Gaza who was detained for more than five weeks following an Israeli attack that killed 15 aid workers has been released, the Palestinian Red Crescent Society (PRCS) said.",
        "url": "https://news.sky.com/story/gaza-aid-worker-detained-after-israeli-attack-has-been-released-13358133",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/gaza-aid-israel_6900664.jpg?20250429131533",
        "type": "World",
        "Author": "Michelle Inez Simon, visual investigations producer, and Sky News&#x27; Gaza team",
        "Date Published": "2025-04-29 12:11:00",
        "Headline": "Asaad al Nsasrah, a paramedic with the Palestinian Red Crescent Society, has been released from Israeli detention after 37 days.",
        "Content": "By Michelle Inez Simon, visual investigations producer, and Sky News' Gaza team   A paramedic in Gaza who was detained for more than five weeks following an Israeli attack that killed 15 aid workers has been released, the Palestinian Red Crescent Society (PRCS) said. Asaad al Nsasrah was one of 17 aid workers who were attacked in Tel al Sultan in southern Gaza by Israeli forces on 23 March. Asaad was one of two first responders who survived - the other 15 were killed. He was initially thought to be missing, as his body was not among the dead. It was not until 13 April, three weeks after the attack, that Israel confirmed Asaad was alive and in Israeli detention. The PRCS announced Asaad's release on X and shared a video of him reuniting with colleagues. Sky News has seen images showing Asaad, among other released Palestinians, in a grey tracksuit at al Amal Hospital in Khan Younis, where he is undergoing medical examination, according to the PRCS. Sky News investigated how the attack on the aid workers unfolded - unearthing new evidence earlier this month contradicting Israel's official account of what happened. The Israeli military later released the findings of its own investigation into the incident, saying it had dismissed a deputy commander for providing an \"inaccurate report\".  The PRCS claimed the Israeli military's investigation was \"full of lies\". Asaad's voice can be heard in a video, initially published by the New York Times, that shows the moments leading up to the attack on the aid workers. The video was discovered on Rifaat Radwaan's phone, which was found on his body by rescue workers five days after the attack. Among those killed were one UN worker, eight paramedics from the PRCS and six first responders from Civil Defence - the official fire and rescue service of Gaza's Hamas-led government. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "UK joins US in strike on Houthi target in Yemen for first time since Donald Trump re-elected",
        "description": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected.",
        "url": "https://news.sky.com/story/uk-joins-us-in-strike-on-houthi-target-in-yemen-for-first-time-since-donald-trump-re-elected-13358440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yemen-sanaa_6901213.jpg?20250430020943",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 23:46:00",
        "Headline": "The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden.",
        "Content": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected. The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden. The ministry said careful intelligence analysis identified a cluster of buildings used by the Houthis to manufacture the sort of drones used to attack ships, located 15 miles south of the capital Sanaa. RAF Typhoon FGR4s conducted strikes on several buildings using Paveway IV precision-guided bombs. The planes had air refuelling support from Voyager tankers. The ministry said the strike was conducted after dark to reduce the likelihood of civilians being in the area. All the aircraft returned safely. Defence Secretary John Healey said: \"This government will always act in the interests of our national and economic security. \"Royal Air Force Typhoons have successfully conducted strikes against a Houthi military target in Yemen and all UK aircraft and personnel have returned safely to base. \"We conducted these strikes, supported by the US, to degrade Houthi capabilities and prevent further attacks against UK and international shipping.\" Read more from Sky News:Kneecap's Eden Project gig cancelled amid 'kill MPs' rowIsrael releases medic detained after IDF attack on aid workersCrush fly-tippers' vans, government tells councils Houthis a 'persistent threat' to 'freedom of navigation' Mr Healey said Houthi activities in the Red Sea are a \"persistent threat\" to \"freedom of navigation\". \"A 55% drop in shipping through the Red Sea has already cost billions, fuelling regional instability and risking economic security for families in the UK,\" he said. \"The government is steadfast in our commitment to reinforcing global stability and protecting British working people. I am proud of the dedication and professionalism shown by the service men and women involved in this operation.\" US intensifies strikes on Houthis It was the first time UK forces have struck a target in Yemen since May last year, the ministry confirmed. The US has intensified its strikes on the Iran-backed Houthis under Mr Trump's presidency, after his re-election in November 2024. The group began launching attacks on shipping routes in November 2023 saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza.  The strike came after a Houthi-controlled TV channel claimed a US strike killed 68 people at a detention centre for African migrants in Yemen on Monday."
    },
    {
        "title": "Inside the Vietnamese factory preparing for the worst since Trump's tariff threat",
        "description": "On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks.",
        "url": "https://news.sky.com/story/inside-the-vietnamese-factory-preparing-for-the-worst-since-trumps-tariff-threat-13357895",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vietnam-tariffs_6900332.jpg?20250429050543",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-29 03:07:00",
        "Headline": "Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks. Ever since Donald Trump announced a whopping 46% trade tariff on Vietnam, they've been preparing for the worst. They're rushing through orders to clients in three separate states in America. Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted. Workers like Do Thi Anh are feeling the pressure. \"I have two children to raise. If the tariffs are too high, the US will buy fewer things. I'll earn less money and I won't be able to support my children either. Luckily here our boss has a good vision,\" she tells me. That vision was crafted back in 2021. When COVID struck, they started to look at diversifying their market. Previously they used to export 40% of their garments to America. Now it's closer to 20%. The cheery-looking owner of the firm, Pham Quang Anh, tells me with a resilient smile: \"We see it as dangerous to depend on one or two markets. So, we had to lose profit and spend on marketing for other markets.\" That foresight could pay off in the months to come. But others are in a far more vulnerable state. Some of Mr Pham's colleagues in the industry export all their garments to America. If the 46% tariff is enforced, it could destroy their businesses. Read more from Sky News:The world and America have changed irreversibly under TrumpTrump's first 100 days in 100 wordsHow Trump's immigration crackdown has changed lives Doubts US will start making what Vietnam delivers Down by the Saigon River, young couples watch on as sunset falls between the glimmering skyscrapers that stand as a testament to Vietnam's miracle growth. Cuong, an affluent-looking man who works in finance, questions the logic and likelihood that America will start making what Vietnam has spent years developing the labour, skills and supply chains to reliably deliver. \"The United States' GDP is so high. It's the largest in the world right now. What's the point in trying to get jobs from developing countries like Vietnam and other Asian nations? It's unnecessary,\" he tells me. But the Trump administration claims China is using Vietnam to illegally circumvent tariffs, putting \"Made in Vietnam\" labels on Chinese products. There's no easy way to assess that claim. But market watchers believe Vietnam does need to signal its willingness to crack down on so-called \"trans-shipments\" if it wants to cut a deal with Washington. 👉 Follow Trump100 on your podcast app 👈 Vietnam can't afford to alienate China The US may also demand a major cutback in Chinese manufacturing in Vietnam. That will be a much harder deal to strike. Vietnam can't afford to alienate its big brother. Luke Treloar, head of strategy at KPMG in Vietnam, is however cautiously optimistic. \"If Vietnam goes into these trade talks saying we will be a reliable manufacturer of the core products you need and the core products America wants to sell, the outcome could be good,\" he says. But the key question is just how much influence China will have on Vietnamese negotiators. Anything above 10-20% tariffs would be intensively challenging This moment is a huge test of Vietnam's resilience. Anything like 46% tariffs would be ruinous. Analysts say 10-20% would be survivable. Anything above, intensely challenging. But this looming threat is also an opportunity for Vietnam to negotiate and grow. Not, though, without some very testing concessions."
    },
    {
        "title": "Itamar Ben-Gvir: Israeli minister called 'war criminal' in extraordinary row with protesters during US visit",
        "description": "An Israeli minister has been called a \"war criminal\" in an extraordinary row with protesters inside the US Capitol.",
        "url": "https://news.sky.com/story/itamar-ben-gvir-israeli-minister-called-war-criminal-in-extraordinary-row-with-protesters-during-us-visit-13358286",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-itamar-ben-gvir-israel_6901082.jpg?20250429195814",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 17:24:00",
        "Headline": "Far-right ultranationalist settler Itamar Ben-Gvir travelled to the US, but his visit was dogged by protests. A group of orthodox Jews mistakenly thought a woman was involved in one of the protests and threatened to rape her, chasing her through the streets of New York.",
        "Content": " An Israeli minister has been called a \"war criminal\" in an extraordinary row with protesters inside the US Capitol. Itamar Ben-Gvir travelled to Washington on Tuesday, where he met with a series of members of Congress as part of a wider trip to the country. But between meetings, he was confronted by pro-Palestinian protesters who called him a \"war criminal\", \"responsible for genocide\" and a \"racist pig\". The ultranationalist settler leader responded by telling the protesters: \"You kill baby!\" Mr Ben-Gvir, a far-right politician who was once on the fringes of Israeli politics and wants to intensify the war in Gaza, shouted at the protesters again in a fiery back-and-forth. \"You are supposed to be in the Hague,\" the protester says in videos of the confrontation at one point - referring to International Criminal Court warrants for Israeli Prime Minister Benjamin Netanyahu and former defence minister Yoav Gallant. Mr Ben-Gvir's trip to the US was met with protests elsewhere too, with a man hiding in a bathroom for two hours at a Manhattan steakhouse just to jump out on him and shout: \"Get the f*** out of New York!\" \n                  Gaza aid worker detained after Israeli attack has been released\n                 \n                  Israel is 'starving, killing and displacing' Gaza civilians, Palestinian envoy tells UN court \n                 \n                  Israeli official says claims IDF targets aid workers are 'blood libel' after UK minister calls for investigation\n                 Who is Ben-Gvir? A hard-line supporter of Jewish settlements, Mr Ben-Gvir was previously convicted in Israel of racist incitement and support for terrorist groups. He has called for the deportation of all Arab citizens from Israel and, for years, hung a picture in his home of a man who massacred more than two dozen Muslim worshippers. Mr Ben-Gvir also visited the headquarters of the Chabad-Lubavitch movement in Brooklyn, where he was greeted by scores more protesters who waved Palestinian flags. 'They threatened to rape me' During this visit, a Brooklyn woman was left fearing for her life after a mob of orthodox Jews mistook her for a protester and kicked her, spat on her, pelted her with objects and chased her. The assault was recorded on camera by bystanders. The woman, a local in her 30s, only came outside after hearing police helicopters and not wanting to be filmed, she covered her face with a scarf. \"As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,\" said the woman. \"They were shouting at me, threatening to rape me, chanting 'death to Arabs'. I thought the police would protect me from the mob, but they did nothing to intervene,\" she added. As the chants grew, a lone police officer intervened to try to escort her to safety, but they were followed by hundreds of men shouting in Hebrew and English. \"This is America,\" one of the men can be heard saying. \"We got Israel. We got an army now.\" Eventually, the officer got her into a police vehicle and drove her away. A police spokesperson said one person was arrested and five others were issued summons following the protests. However, it wasn't clear whether this included anyone involved in assaulting the woman. A Chabad-Lubavitch spokesman, Rabbi Motti Seligson, denounced both the anti-Ben-Gvir protesters and the mob that chased the woman. 'I responded!' In response to the protests that dogged Mr Ben-Gvir during his trip, he took to social media to share an image of himself in the Capitol. He said: \"Between meetings, several pro-Palestinian protesters began shouting pro-Hamas and Gaza slogans at me. \"I responded by saying that they were supporting the murderers, just like on 9/11 - we will defeat them!\" Meanwhile, within Gaza, Israel's total blockade of aid into the enclave has entered its second month, with the UN's food agency warning its stocks of food had now run out. So far this week, the bodies of 51 people killed and 113 injured were brought to hospitals in Gaza, according to the Hamas-run health ministry. Read more from Sky News:'Prolific' board game shoplifter sentencedIsraeli troops shot at aid workers from 'point-blank range'Student rescued from mountain twice in four days There has also been increased scrutiny of Israel's treatment of aid workers in recent weeks - as it released a medic it held prisoner since Israeli troops killed 15 aid workers."
    },
    {
        "title": "Three people killed after shooting in Sweden",
        "description": "Three people have been killed after a shooting in Sweden.",
        "url": "https://news.sky.com/story/three-people-killed-after-shooting-in-sweden-13358357",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sweden-crime-gang_6901119.jpg?20250429205719",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 19:53:00",
        "Headline": "Witnesses told Swedish media they heard five gunshots and saw people in the area running to take cover. A murder investigation has since been launched by police after the incident in the city of Uppsala.",
        "Content": "Three people have been killed after a shooting in Sweden. A murder investigation has been launched following the incident in the city of Uppsala. Witnesses told local media they heard five shots and saw people in the area running to take cover. Inside Sweden's deadly gang war Police said it was investigating the shooting as a homicide and that it had no information about whether it was a terror or hate crime-related incident at this point. A spokesperson for the force said it had information someone had left the scene on an electric scooter - it was unclear whether they were a suspect, witness or otherwise. Electric scooters have been used several times as a mode of transport after gang shootings in the country. \n                  Denmark postal service to stop delivering letters\n                 \n                  Orebro shooting: What we know about the man suspected of killing 11 people at an adult education centre in Sweden? \n                 \n                  Orebro shooting: Sweden gunman 'had access to weapons and had major problems at school'\n                 Uppsala, a city around 70km (43 miles) north of the capital Stockholm, has seen a number of gang-related shootings in the past decade, but usually outside the city centre. In a statement, Swedish justice minister Gunnar Strommer said: \"A brutal act of violence has occurred in central Uppsala... this is at the same time as the whole of Uppsala has begun Walpurgis Night. \"What has happened is extremely serious.\" The shooting took place on the eve of the Walpurgis spring festival in the city. Local media reported that the attack took place near or in a hairdresser's. In February, 10 people were killed in the city of Orebro in the country's deadliest ever mass shooting after a 35-year-old opened fire in an adult learning centre. Read more from Sky News:Deaths linked to Spain-Portugal blackoutStudent rescued from mountain twiceKim Kardashian to testify in armed robbery trial Sweden's right-wing government came to power in 2022, promising to tackle gang-related violence. It has tightened laws and given more powers to police and after the Orebro shooting it vowed to tighten gun laws as well."
    },
    {
        "title": "Couple and adult son 'died from carbon monoxide poisoning after using generator' during Spain-Portugal blackout",
        "description": "Two parents and their adult son are said to have died from carbon monoxide poisoning after using a generator during the blackout that hit Spain and Portugal this week, according to local reports.",
        "url": "https://news.sky.com/story/couple-and-adult-son-died-from-carbon-monoxide-poisoning-after-using-generator-during-spain-portugal-blackout-13358250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-backout-blackout-spain_6900957.jpg?20250429184730",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 15:38:00",
        "Headline": "According to reports in Spanish media, there have been at least four deaths connected to the blackout that hit the country and Portugal on Monday. While power is now largely restored, a number of questions remain unanswered.",
        "Content": " Two parents and their adult son are said to have died from carbon monoxide poisoning after using a generator during the blackout that hit Spain and Portugal this week, according to local reports. This would bring the number of deaths linked to the incident, which struck the Iberian Peninsula around midday on Monday, to four. Millions of people were caught up in the chaos triggered by the mass blackout. Explained: What impact will blackout have? It brought many areas to a standstill, stopping trains, grounding planes, halting internet and mobile phone services, downing traffic lights and cash machines and leading to some routine hospital operations being suspended. Spain's interior ministry declared a national emergency and both it and Portugal convened emergency cabinet meetings over the issue. Portugal's grid operator said the blackout was caused by a \"rare atmospheric phenomenon\" which caused \"anomalous oscillations\" in very high-voltage lines. But Spain's grid operator has so far not confirmed any possible cause. \n                  What impact is the blackout in Spain and Portugal having and how long will it last?\n                 \n                  Power returning in Spain and Portugal after large parts hit by blackout - but what caused it?\n                 \n                  Calvin Parris: One of UK's most wanted men jailed for 12 years after Algarve arrest\n                 Much of the power supply has now been restored. Carbon monoxide poisoning The elderly married couple and their son were reportedly found dead at their home in Ourense, in northwest Spain, around midday on Tuesday. Local reports pointed to carbon monoxide poisoning as responsible for their deaths. Europa Press, citing sources in the emergency services, said the couple were aged 81 and 77, and their son was 56. It quoted local mayor Alvaro Vila as saying there were \"indications\" the poisoning came about due to faults from a generator used to keep a ventilator going. When a care worker couldn't get access to the property, the civil guard and the fire department were called. Fire in Madrid A middle-aged woman was found dead Monday night after a fire in her first-floor Madrid apartment, according to reports. It was initially reported that the main line of the investigation was over a candle starting the fire. El Pais reported on the fatal blaze, saying it took place in the Carabanchel district of the Spanish capital. Read more:Spain and Portugal blackouts as it happenedWhy restoring power will be a nightmare It added that thirteen other people in the apartment building were treated by medics. The first calls to emergency services were reportedly made shortly before 10pm local time."
    },
    {
        "title": "Child damages Rothko painting worth tens of millions of pounds in Rotterdam",
        "description": "A child has damaged a huge painting thought to be worth tens of millions of pounds in the Netherlands.",
        "url": "https://news.sky.com/story/child-damages-rothko-painting-worth-tens-of-millions-of-pounds-in-rotterdam-13358008",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mark-rothko-rotterdam_6900554.jpg?20250429112311",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 09:02:00",
        "Headline": "A spokesperson for the Museum Boijmans Van Beuningen has said it is considering the \"next steps\" after the artwork sustained \"superficial damage\".",
        "Content": "A child has damaged a huge painting thought to be worth tens of millions of pounds in the Netherlands. The abstract artwork, named \"Grey, Orange on Maroon, No. 8\", by Mark Rothko was on public display in a storage facility next to the Museum Boijmans Van Beuningen in Rotterdam when it sustained \"superficial damage\". A spokesperson for the museum told Sky News that a child \"touched the painting when it was on display\". They added in a statement: \"As a result, small scratches are visible in the unvarnished paint layer in the lower part of the painting. \"Conservation expertise has been sought in the Netherlands and abroad. We are currently researching the next steps for the treatment of the painting. We expect that the work will be able to be shown again in the future.\" The museum did not reveal how it much thought the painting was worth or the expected cost of any repair work. Prominent Dutch art collector Bert Kreuk estimated three years ago that the painting would potentially sell for between €40m (£34m) to €50m (£42m), the Algemeen Dagblad news site in the Netherlands reports. \n                  UK joins US in strike on Houthi target in Yemen for first time since Donald Trump re-elected\n                 \n                  Man arrested over Leeds crossbow incident which seriously injured two women has died\n                 \n                  Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments\n                 A museum spokesperson also told the news service that the Rothko painting was damaged during an \"unguarded moment\". The abstract artwork had reportedly been the centrepiece of the museum before the building was closed for renovation. The painting is therefore currently on display in a nearby art storage facility which contains the museum's entire collection and is open to the public. Read more from Sky News:Mark Carney wins Canada electionWoman dies in skydiving incidentMan rescued from Mount Fuji twice in four daysRothko was born in a part of Russia which is now Latvia in 1903 but moved to America as a child. The artist, who died in 1970, was best known for his \"colour field\" paintings and many of his works have sold for tens of millions of pounds. Rothko's 1958 work, Black on Maroon was deliberately vandalised at London's Tate Modern gallery in October 2012. Wlodzimierz Umaniec was sent to prison for two years for the defacing the painting. During his trial, prosecuting barrister Gregor McKinley said the cost of repairing the work would be about £200,000. It took conservators 18 months to repair the painting."
    },
    {
        "title": "Woman suspected of killing three people with toxic mushrooms in beef wellington goes on trial",
        "description": "The trial has begun for an Australian woman accused of murdering her ex-husband's parents and an aunt by serving them a beef wellington laced with poisonous mushrooms.",
        "url": "https://news.sky.com/story/woman-suspected-of-killing-three-people-with-toxic-mushrooms-goes-on-trial-13357964",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-erin-patterson-australia_6346181.jpg?20231103075841",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-29 08:19:00",
        "Headline": "Erin Patterson, 50, was also initially charged with the attempted murder of her ex-husband, but that charge was dropped just before the trial began.",
        "Content": "The trial has begun for an Australian woman accused of murdering her ex-husband's parents and an aunt by serving them a beef wellington laced with poisonous mushrooms. Erin Patterson is charged with the murders of her former parents-in-law, Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, along with the attempted murder of Reverend Ian Wilkinson, Heather's husband. She was originally also charged with the attempted murder of her ex-husband, but prosecutors have dropped those charges. The four alleged victims became ill after being served beef wellington for lunch by Patterson at her home in Leongatha, a small town in Melbourne, on 29 July 2023. All four felt unwell by midnight that evening. Gail and Heather died nearly a week later on Friday 4 August, while Don died a day later. Reverend Wilkinson, 68, spent seven weeks in hospital but survived. \n                  Ransacked and looted: What I found in my family home destroyed by militiamen\n                 \n                  Gaza aid worker detained after Israeli attack has been released\n                 \n                  Trump latest: 'We're just getting started,' Trump tells Michigan rally marking 100 days in office\n                 Prosecutors say the dish contained the poisonous mushrooms. Police previously said the symptoms of all four of those who became ill were consistent with poisoning from wild Amanita phalloides, known as death cap mushrooms - which are responsible for 90% of all toxic mushroom-related fatalities. Patterson, a 50-year-old mother of two, has pleaded not guilty to all charges. Read more:Police had previous contact with Vancouver vehicle attack suspectStudent rescued from mountain twice - after going back to find his phone In a voluntary statement to police in August 2023, Patterson said she wanted to \"clear up the record\" because she was \"extremely stressed and overwhelmed by the deaths of my loved ones\" and was hospitalised herself after eating the meal. She said she served the meal and allowed the guests to choose their own plates, adding she then took the last plate and ate some of the beef wellington herself. Patterson said she had \"absolutely no reason to hurt these people whom I loved\". Fifteen jurors were selected on Tuesday at the Latrobe Valley Magistrates' Court in nearby Morwell, with the opening arguments expected to begin on Wednesday morning. They were told by Justice Christopher Beale to disregard the fact Patterson was initially charged with the attempted murder of her ex-husband. \"Those charges have been dropped and you must put them out of your mind,\" he told the jury. The potential maximum sentence for murder is life imprisonment. The trial is expected to run for five to six weeks."
    },
    {
        "title": "US voters divided over Trump's first 100 days - 10 out of 10, or a lack of grace and empathy?",
        "description": "From the White House these past 100 days,<a target=\"_blank\" href='https://podfollow.com/trump100/view'> I've chronicled the whirlwind that's reshaping America.</a>",
        "url": "https://news.sky.com/story/us-voters-divided-over-trumps-first-100-days-10-out-of-10-or-a-lack-of-grace-and-empathy-13358324",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-oval-office_6895491.jpg?20250424134305",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-04-29 18:23:00",
        "Headline": "After an exhaustive first 100 days, US citizens are becoming unusually reluctant to voice their opinions, concerned about the risk of becoming identified with one political side or the other in a sharply-divided country.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  From the White House these past 100 days, I've chronicled the whirlwind that's reshaping America. Getting beyond the West Wing and out of Washington has been harder. The volume of news has necessitated a near-constant presence in the US capital. Every single day, there has been something. Of course, this has been entirely intentional for the president and his team of proud disrupters. They pledged to govern differently, and on that promise, they have more than delivered. To fix America, Donald Trump first had to convince people that it is broken. Many didn't need convincing. Look for decline here and you'll easily find it; communities left behind. Look for bureaucracy and waste - you'll find that too. Common sense silenced by wokism? Many can relate to that. Immigration out of control? Politicians have been struggling with that for decades. In just 100 days, Mr Trump has harnessed all of that into a package of change that feels like nothing short of a revolution. \n                  Tariffs, DOGE and diet coke: Trump's first 100 days in 100 words\n                 \n                  Inside the Vietnamese factory preparing for the worst since Trump's tariff threat\n                 \n                  Who is Mark Carney - the political novice now elected by Canadian voters as prime minister?\n                 Despite the tsunami of news, my colleagues and I have managed to escape from the White House. And it is there, beyond Washington, that the more subtle but no less profound changes to the fabric of this nation can be felt. Whether it be innocuous tattoos that might now be associated with gang membership, free speech opinions penned on social media, or the willingness just to chat about politics, one startling thing I have observed these past 100 days is a growing sense of fear.  A passion for politics Anyone who has worked as a foreign correspondent in America will tell you that Americans love to give their opinion on politics. And they do it, always, with word-perfect articulation. There is no better place in the world for a 'voxpop'. There is a passion for politics that I haven't seen anywhere else I've lived and worked. Until now. Over these past 100 days, I have increasingly found a reticence that reflects an America changed by this president and his style. I'm in Detroit at the moment, in Michigan, the battleground state that helped to deliver Donald Trump the presidency back in November. I was here back then, too, and recall the enthusiasm with which people would discuss the upcoming election. There was enthusiasm for Trump and enthusiasm for Harris. An indictment of the times Now the response to my questions is, so often, \"no thanks, I'd rather not\". Sometimes people ask where the report will be seen. \"Will it be on in America?\" Think about it - this is America. What an indictment of the times, that people fear offering their opinion - whatever side of the aisle they sit. Very often, it's businesses that are extremely cautious of being associated with one political view or another. Such is the animosity now between the two sides. After a day of perseverance in Detroit this week, a few folk did talk to us. Their answers were revealing. In a park, I met Marie Freeman who said people are now \"more angry\". Her view is that America has lost something over these past 100 days. Trump 100: Read moreTariffs, DOGE and diet coke: Trump's first 100 days in 100 wordsWhy Trump faces awkward reckoning 100 days into the jobHow Trump's immigration crackdown has changed lives \"I definitely want us to move forward in a positive, more empathetic way. I think with Trump being such a hardcore president, we lose the empathy, we lose the grace for our fellow neighbours. We're all so angry because we're under angry leadership. And that's not good.\" 👉 Follow Trump100 on your podcast app 👈 She articulated a vibe which I recognise in so many parts of this country right now. A lack of grace and empathy. Yet, yards away, a couple walking their cats stopped to chat. I asked how they would rate these past 100 days. Two tens out of ten for Trump's performance."
    },
    {
        "title": "Day 100: Does Trump really 'run the country and the world'?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/day-100-does-trump-really-8216run-the-country-and-the-world-13357902",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-trump-100_6869518.jpg?20250429132803",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-29 04:55:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   On the 100th day of Donald Trump's second term in the White House, our US correspondents James Matthews, Mark Stone and Martha Kelner look back at the most significant moments from the last few months. From deportations and tariffs to that moment with President Zelenskyy in the Oval Office, is Donald Trump right when he claims he runs the US and the world? Plus, Mark and Martha have a challenge for James 'The Voice' Matthews... If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Inside the Vietnamese factory preparing for the worst since Trump's tariff threat",
        "description": "On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks.",
        "url": "https://news.sky.com/story/inside-the-vietnamese-factory-preparing-for-the-worst-since-trumps-tariff-threat-13357895",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vietnam-tariffs_6900332.jpg?20250429050543",
        "type": "US",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-29 03:07:00",
        "Headline": "Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks. Ever since Donald Trump announced a whopping 46% trade tariff on Vietnam, they've been preparing for the worst. They're rushing through orders to clients in three separate states in America. Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted. Workers like Do Thi Anh are feeling the pressure. \"I have two children to raise. If the tariffs are too high, the US will buy fewer things. I'll earn less money and I won't be able to support my children either. Luckily here our boss has a good vision,\" she tells me. That vision was crafted back in 2021. When COVID struck, they started to look at diversifying their market. Previously they used to export 40% of their garments to America. Now it's closer to 20%. The cheery-looking owner of the firm, Pham Quang Anh, tells me with a resilient smile: \"We see it as dangerous to depend on one or two markets. So, we had to lose profit and spend on marketing for other markets.\" That foresight could pay off in the months to come. But others are in a far more vulnerable state. Some of Mr Pham's colleagues in the industry export all their garments to America. If the 46% tariff is enforced, it could destroy their businesses. Read more from Sky News:The world and America have changed irreversibly under TrumpTrump's first 100 days in 100 wordsHow Trump's immigration crackdown has changed lives Doubts US will start making what Vietnam delivers Down by the Saigon River, young couples watch on as sunset falls between the glimmering skyscrapers that stand as a testament to Vietnam's miracle growth. Cuong, an affluent-looking man who works in finance, questions the logic and likelihood that America will start making what Vietnam has spent years developing the labour, skills and supply chains to reliably deliver. \"The United States' GDP is so high. It's the largest in the world right now. What's the point in trying to get jobs from developing countries like Vietnam and other Asian nations? It's unnecessary,\" he tells me. But the Trump administration claims China is using Vietnam to illegally circumvent tariffs, putting \"Made in Vietnam\" labels on Chinese products. There's no easy way to assess that claim. But market watchers believe Vietnam does need to signal its willingness to crack down on so-called \"trans-shipments\" if it wants to cut a deal with Washington. 👉 Follow Trump100 on your podcast app 👈 Vietnam can't afford to alienate China The US may also demand a major cutback in Chinese manufacturing in Vietnam. That will be a much harder deal to strike. Vietnam can't afford to alienate its big brother. Luke Treloar, head of strategy at KPMG in Vietnam, is however cautiously optimistic. \"If Vietnam goes into these trade talks saying we will be a reliable manufacturer of the core products you need and the core products America wants to sell, the outcome could be good,\" he says. But the key question is just how much influence China will have on Vietnamese negotiators. Anything above 10-20% tariffs would be intensively challenging This moment is a huge test of Vietnam's resilience. Anything like 46% tariffs would be ruinous. Analysts say 10-20% would be survivable. Anything above, intensely challenging. But this looming threat is also an opportunity for Vietnam to negotiate and grow. Not, though, without some very testing concessions."
    },
    {
        "title": "Tariffs, DOGE and diet coke: Trump's first 100 days in 100 words",
        "description": "Donald Trump has been back in the Oval Office for just a few months, but for his supporters - and critics - there have been plenty of historic moments to pore over. ",
        "url": "https://news.sky.com/story/tariffs-doge-and-diet-coke-trumps-first-100-days-in-100-words-13357620",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-trump-100_6899978.jpg?20250428164409",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-29 03:20:00",
        "Headline": "The US president's return to the White House has provided no shortage of landmark moments, encounters and executive orders. ",
        "Content": "Donald Trump has been back in the Oval Office for just a few months, but for his supporters - and critics - there have been plenty of historic moments to pore over.  Here, Sky News' US correspondents sum up the past 100 days in 100 words... 1. America First His two-word slogan for prioritising US interests in domestic and foreign policies - emphasising nationalism, economic protectionism, and reduced global intervention. 2. Fest Trump confirmed he is set for a second state visit to the UK later this year, describing the planned events hosted by the King as a \"fest\". 3. Term \n                  US voters divided over Trump's first 100 days - 10 out of 10, or a lack of grace and empathy?\n                 \n                  Inside the Vietnamese factory preparing for the worst since Trump's tariff threat\n                 \n                  Who is Mark Carney - the political novice now elected by Canadian voters as prime minister?\n                 He says he’s \"not joking\" about running for a third term, even though it’s constitutionally impossible. 4. DOGE The newly created Department of Government Efficiency, led by Elon Musk, named after a meme, and focused on cutting excessive government spending. 5. Protest Americans unhappy with Trump 2.0 have taken to public protest. Many thousands have gathered at demonstrations in cities across the country. 6. Shape He’s gone from 6 feet 2 inches in height and 240 pounds - when charged in New York in 2023 - to 6 feet 3 inches in height and 224 pounds, according to his physician’s report in 2025. 7. Popularity Donald Trump’s popularity at the 100-day mark is 44%, according to a Fox News poll on presidential approval ratings. Compared with Biden 54%, Obama 62%, and George W Bush 63%. 8. Taiwan Asked if his policy was that China would never take Taiwan by force, Trump replied: \"I never comment on that. I don't comment on it because I don't want to ever put myself in that position.\" Less than the reassurance the Taiwanese will have wanted. 9. Truth By using his own social media platform, named Truth Social, he engages with audiences directly, shaping his own narrative as truth. 10. Tariff  Trump calls it the \"most beautiful word in the dictionary\". Can also be filed under ‘ugly.’ At the moment, most of the world is subject to a 10% 'baseline'. 11. Media Continuing his crusade against traditional media (\"fake news\"), the White House has moved to displace long-established outlets with \"new media\" championing him, rather than holding him accountable. 12. Eggs  Eggs, eggs, eggs… Trump keeps talking about eggs. Prices have spiked over the past year and the president keeps making false claims about how he’s brought costs down. 13. ICE Trump expanded the role of Immigration and Customs Enforcement to enforce stricter immigration policies, including mass deportations, sparking much legal and political debate. 14. Judges  He has been critical of judges who ruled against his policies, branding one a \"radical left lunatic\" and calling for them to be impeached. 15. Climate One of the first moves of his second term was to withdraw from the Paris Climate Agreement - a move he also made in his first term. 16. Gender Trump takes a binary view, recognising only male and female, and has implemented policies to restrict transgender rights and banning transgender people from participation in the military and in sports. 17. Gulf  Trump signed an executive order renaming the Gulf of Mexico as the Gulf of America, saying it was to honour 'American greatness'. 18. Golf  After busy weeks in DC, Trump has stuck to his Florida weekends, unwinding with 18 holes of golf, with his \"frequent victories\" even mentioned in his annual medical report. 19. DEI The acronym for diversity, equity and inclusion programmes, designed to widen access to jobs and ensure fair treatment for marginalised groups. Trump has waged war on DEI practices. 20. Education  Trump dismantled the Department of Education, and has gone to war with some of America’s most prestigious universities. 21. Cabinet  The 21 members of the cabinet fawn over Trump in televised meetings. 22. Yippy People have \"been getting a little yippy\". That was the president's stated reason in early April for suddenly calling a pause to his global tariffs. 23. China  Trump’s trade war with the superpower has caused huge ramifications across global supply chains.  24. Sharpie  Trump’s penchant for his Sharpie pen has become synonymous with his sweeping use of executive orders. 25. Signal  The messaging app which hit the headlines when top security officials added a journalist to discussions about air strikes in Yemen. 26. Influencers  The White House has opened up its press pool access to include \"new media\", which has usually included conservative influencers favourable to the president. 27. Constitution  Some critics of Trump say he is flagrantly flaunting the US Constitution in order to reach his deportation goals. 28. Access  Trump has regularly held lengthy question-and-answer Oval Office sessions with the press pool, a major departure from Biden’s term. 29. Penguins  Trump imposed tariffs on inhabited islands near Antarctica, including remote islands home to only penguins. 30. Drill  \"Drill, baby, drill\" has been adopted by Trump as his mantra for ramping up fossil fuel extraction at the expense of climate targets. 31. Minerals A minerals deal with Ukraine is at the heart of Trump’s negotiations to try and end the war. Without security guarantees, Zelenskyy has been reluctant to sign it. 32. Trans  Trump’s efforts to try and eradicate \"gender ideology\" has led to him barring trans people from military service, and restricting transgender care for minors. 33. Margarita The tequila-based cocktail found itself central to a row over deportations when photos appeared to show a wrongly deported man sharing a drink with a Democratic Senator on a visit to El Salvador. 34. Gaza An AI video of Trump’s Gaza did the rounds on social media. It was supposed to be satire, but it was a stark reminder of Trump’s vision for the Middle East.  35. Witkoff  The unlikeliest of advisors but an old golfing and real estate buddy of the president’s who's become his Swiss-Army Knife global envoy, leading negotiations in the Middle East and with Russia. 36. Leavitt  White House press secretary Karoline Leavitt has become one of the faces of Trump’s 100 days, known for sharp rebukes to the media and adept question dodging in the daily briefings.  37. Tattoos Many of the men deported to El Salvador by the Trump administration have a number of tattoos. Immigration authorities use certain tattoos to designate people as gang members. 38. Bogies Trump removed the resolute desk from the Oval Office for refurbishment, just days after Elon Musk’s four-year-old son, X, appeared to pick his nose and wipe it on the historic piece of furniture. 39. Biden  Donald Trump has repeatedly referred to his predecessor, blaming him for all manner of perceived failings. At one point, he was recorded as having said Biden’s name an average of over six times a day. 40. CECOT The maximum security prison in El Salvador, where the administration has deported hundreds of alleged gang members. 41. Stenographers  Donald Trump is saying a lot of words - far more than in his first term - and it is pushing White House stenographers to the limit. He spoke more than 22,000 words on inauguration day. 42. Kai  Trump’s 17-year-old granddaughter, an aspiring golfer, has been building her social media presence, amassing millions of followers and emerging a powerful political PR force in targeting Gen Z. 43. Tesla The president turned car salesman for a day, promoting the Tesla range for his embattled aide, Elon Musk, by purchasing a red model X on the driveway of the White House. 44. Courts Trump’s administration is testing the country’s legal boundaries on all fronts. Showdowns in the Supreme Court seem to be his preferred way to get things done. 45. Churchill Trump returned a bust of Sir Winston Churchill to the Oval Office after Biden had removed it during his presidency. 46. Congress Or a lack of one. Trump has signed more executive orders in his first 100 days than any other president before him, and he's yet to pass any legislation through Congress. 47. Inauguration  For the first time since 1985, the inauguration for the 47th President was held inside the Capitol, due to the freezing conditions in Washington. 48. Democrats  Democrats have struggled to shape their response to Trump 2.0, but will need an aligned strategy ahead of the midterms and their effort to retake the White House in 2028. 49. Putin Trump has re-established US communications with President Putin, even addressing him directly as Vladimir in a Truth Social post. 50. JD  JD Vance has played a more prominent role than many of his predecessors - criticising European allies, challenging Zelenskyy in the Oval Office, receiving the cold shoulder in Greenland and visiting Pope Francis just hours before the pontiff’s death. 51. Canada He’s thrown frequent jabs at Canada, imposed tariffs and insisted it should become America’s 51st state. But his attacks have caused a surge in Canadian patriotism. 52. Miracle  A face-to-face meeting between Presidents Trump and Zelenskyy at the Pope’s funeral was branded a miracle and produced an iconic image of the two men seated just feet apart in St Peter’s Basilica. 53. Sleepy On at least two occasions, Trump appeared to fall asleep - in the National Cathedral on the morning after his inauguration and at the funeral of Pope Francis in Rome. 54. Bruising  The back of Donald Trump’s right hand has shown bruising. The White House explanation is the number of hands he has to shake. 55. Autopen The president has repeatedly criticised his predecessor for using an autopen to sign presidential documents. 56. Greenland Home to around 56,000 people, covered with ice and rich with mineral resources; Trump has his eyes set on the world’s largest island. He claims it's essential for national security. 57. Schedule  Trump has a busy schedule of appearances around the 100-day mark - his team recognise the milestone as a measure of his performance and the PR value of reinforcing their message. 58. Aviation  Cuts made to the federal workforce included shrinking the Federal Aviation Administration. This was brought into sharper focus following a plane crash in Washington which killed 67 people. 59. Super Bowl  Trump has rarely travelled so far but one of his few trips beyond DC or Florida was to New Orleans where he became the first sitting president to attend the Super Bowl.  60. Recession  Top economists have warned that the market turmoil caused by Trump’s sweeping tariffs could soon lead to a recession. 61. Pardon  Trump pardoned more than 1,500 people charged or convicted over involvement in the 6 January 2021 storming of the Capitol. 62. Retribution  From revoking security clearance for former presidents, to removing security details from his critics, to challenging judges and prosecutors who investigated him, Trump is on a vengeance mission. 63. King  He says he \"loves\" King Charles and was visibly flattered to receive the invitation for an unprecedented second state visit to the UK. 64. Hegseth As in Pete. Trump \"stands strongly\" behind his defence secretary despite his sharing military attack plans on at least two Signal group chats.  65. Bessent As in treasury secretary, Scott. He calmed the markets when he said a trade standoff with China wasn’t sustainable and expected de-escalation. America blinking? It’s how many saw it. 66. Volatility  It’s a theme with Donald Trump on matters large and small. It makes the markets nervous, in particular. See tariffs. 67. Voice of America The Trump administration tried to shut down the global broadcaster, saying it has a \"leftist bias\". However, a judge halted the move. 68. Nobel The president has made no secret that he has his sights on the Nobel Peace Prize. He took the opportunity to riff on the matter when Norway’s prime minister paid a visit (a Norwegian committee makes the decision). 69. Diet Coke President Trump reinstated a Diet Coke button to the Oval Office. He presses it to order a delivery to his desk. 70. Melania The president and the first lady continue to live largely separate lives but have come together for occasional public appearances, including at the Pope’s funeral and the annual White House Easter Egg Roll.  71. Town hall Town hall events, when Congress members take questions from their constituents, have been tense as republican lawmakers face a backlash over cuts to the federal government and social programmes. 72. Musk The world’s richest man, Tesla and SpaceX chief Elon Musk, has been Trump’s right-hand man, heading the Department of Government Efficiency and boasting about his cuts to the federal government by wielding a chainsaw. 73. NPR/PBS President Trump’s administration drafted a memo to Congress, outlining plans to end nearly all funding for the US’s public broadcasters, National Public Radio and Public Broadcasting Service - the home of Sesame Street. 74. McGregor On St Patrick’s Day, he hosted Conor McGregor at the White House, three months after the Irish mixed martial arts fighter was found liable for sexual assault in a civil case in Dublin. 75. Harvard  Trump has threatened to freeze billions in funding to the acclaimed American university, unless it complies with demands from the administration, including ensuring \"diverse\" viewpoints in teaching. Harvard has filed a lawsuit in response. 76. Markets His sweeping tariffs wiped $2.5trn off US stock markets; the pausing of them then caused them to skyrocket in a way rarely seen since WW2. 77. Hollywood Trump has made actors Jon Voight, Mel Gibson, and Sylvester Stallone 'Special Ambassadors; to the \"very troubled\" Hollywood, where he hopes to increase American investment in film production. 78. Age  Trump is the oldest person ever elected to the White House. He’ll turn 79 in June and reports suggest he could have a joint parade with the military. 79. Gold  The Oval Office has been transformed over the last 100 days. Gold trim, gold motifs, gold cups and gold frames have turned the presidential office into something more akin to a royal court - or Mar-a-Lago. 80. Evangelical Trump has galvanised the Christian right in the US, creating a faith office in the White House to \"protect religious liberty\", led by the televangelist Paula White. 81. Bishop Episcopal Bishop Mariann Budde confronted President Trump and VP JD Vance during the traditional prayer service at Washington National Cathedral - her sermon called for the administration to show mercy to the LGBTQ+ community, immigrants, and refugees. 82. Marjorie As in, Taylor-Greene, congresswoman for Georgia and a figurehead for the Make America Great Again movement. She is a loyal enforcer of Trumpian politics and sometimes attack dog - including in a run-in with Sky News’ Martha Kelner.  83. Deportation The administration has fast-tracked deportations by by-passing judges and invoking the use of 200-year-old wartime laws to remove people without due process, prompting fears of a constitutional crisis. 84. Education  Trump signed an executive order to \"facilitate\" the closure of the Department of Education and return responsibility for education to each state. 85. Kennedy As in Robert F. Jr., or RFK Jr. Trump’s health secretary and one-time presidential rival has split opinions, with both his plans to take on \"Big Food\" and his baseless claims that vaccines can cause autism. 86. Kennedy As in Center. Following his election, Trump scrapped the 18 board members of the arts centre, and replaced them with those more politically akin to himself. Artists including actor Issa Rae and the Broadway show Hamilton have since cancelled dates in protest. 87. Kennedy As in JFK. Trump signed an executive order to release all remaining files related to the assassination of President John F Kennedy in 1963, but none appeared to strengthen any of the many conspiracy theories. 88. Bunny  One of the stranger sights of the past 100 days was Trump paying tribute to Pope Francis, while standing next to someone dressed as the Easter Bunny at a White House event.  89. Science  Trump’s orders to reduce \"waste\" and \"inefficiencies\" in federal departments has led to swathes of scientific data to be deleted from government websites, including research into health, climate change, and extreme weather. 90. AF1 President Trump is unhappy with Boeing, who he says are taking too long to update the presidential planes, known as Air Force One. The current fleet has been in service since 1990. 91. Space He suggested two astronauts, stuck in space for eight months, might \"love\" each other and commented on the female astronaut’s weightless \"wild hair\", before claiming the credit when SpaceX safely returned them to Earth safely. 92. TikTok The video social media app was banned for a total of 12 hours in the US in January - President Trump has since twice granted the platform’s owner ByteDance more time to find a buyer. 93. Liberation He labelled 2 April ‘Liberation Day’, marking the roll-out of his tariff plan to increase manufacturing and reduce America’s trade deficit with other nations. 94. Zelenskyy From a jaw-dropping on-camera row in the Oval Office, to a conciliatory tete-a-tete at the Pope’s funeral, his hot-cold approach to the Ukrainian leader has upended 80-year-old global alliances.  95. Barron The president’s youngest son Barron has caused multiple viral moments for his family in the first 100 days, including; a clip of his 5-year-old self saying \"I like my suitcase\" spiralling out of control on TikTok; and being credited for his father’s appearance on Joe Rogan’s podcast. 96. Mar-a-Lago Trump has spent nine of the 14 weekends since his inauguration at Mar-a-Lago, his private club in Palm Beach Florida - he calls it \"the southern White House\". 97. Petrol The health of the US economy is often judged on petrol prices. Trump falsely claimed petrol prices had hit $1.98 per gallon in the final week of his first 100 days. But experts say the national average was actually $3.17 per gallon. 98. Starmer  Despite coming from opposite ends of the political spectrum, President Trump has said he and the UK’s prime minister \"get along well\", describing him as a \"special man\" during Starmer’s visit to the White House. 99. Pope  The Pope’s funeral on Saturday marked Donald Trump’s first foreign trip of his second term. 100. Trump 100  The Sky News podcast, 100 episodes strong. And more to come. 👉 Follow Trump100 on your podcast app 👈"
    },
    {
        "title": "No criminal charges over death of ice hockey player Adam Johnson whose neck was cut by opponent's skate",
        "description": "No criminal charges will be brought over the death of an ice hockey player who died during a match in Sheffield, prosecutors have announced.",
        "url": "https://news.sky.com/story/no-criminal-charges-over-death-of-ice-hockey-player-adam-johnson-whose-neck-was-cut-by-opponents-skate-13357920",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-adam-johnson-hockey_6340204.jpg?20250429122332",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-29 05:46:00",
        "Headline": "Matthew Petgrave was arrested on suspicion of manslaughter and later bailed - but the Crown Prosecution Service has now said it will not bring criminal charges against the Canadian.",
        "Content": "No criminal charges will be brought over the death of an ice hockey player who died during a match in Sheffield, prosecutors have announced. Nottingham Panthers' Adam Johnson died in October 2023 after his neck was cut by an opposition player's skate during a match at Sheffield's Utilita Arena. The Sheffield Steelers player, Matthew Petgrave, was arrested on suspicion of manslaughter and later bailed - but the Crown Prosecution Service (CPS) has now said it will not bring criminal charges against the Canadian. Michael Quinn, deputy chief crown prosecutor, said: \"This was a shocking and deeply upsetting incident. The CPS and South Yorkshire Police have worked closely together to determine whether any criminal charges should be brought against the other ice hockey player involved. \"Following a thorough police investigation and a comprehensive review of all the evidence by the CPS, we have concluded that there is not a realistic prospect of conviction for any criminal offence and so there will not be a prosecution. \"Our thoughts remain with the family and friends of Adam Johnson.\" Before joining Nottingham Panthers, the Minnesota-born Johnson played in Pennsylvania for the Pittsburgh Penguins, and Sweden for the Malmo Redhawks. He also played in California for Ontario Reign and in Germany for Augsburger Panther. A post-mortem examination confirmed the 29-year-old died as a result of the fatal neck injury. The crowd of 8,000 spectators watched in horror as desperate attempts were made to save his life as he lay on the ice, shielded by fellow players. The game was abandoned and spectators were asked to leave in the aftermath. Kari Johnson, Johnson's aunt, was watching the match via a livestream with his father and grandmother when he was fatally injured. Speaking to Sky News at the time, Ms Johnson said: \"It was a mess, it was a nightmare, it was like it wasn't real. We were in shock, we couldn't believe this was happening.\"  Ms Johnson described her nephew as a \"kind soul\" and a \"private kid\" who \"never would have wanted to be in the limelight like this\". He simply wanted to be \"good at hockey and have fun\", she said, adding he was \"having the time of his life in the UK\" and was planning to get engaged to his girlfriend. Read more from Sky News:Woman dies in skydiving incidentTwo men went on 'moronic mission' to fell famous tree, jury told In January 2024, Sheffield's senior coroner, Tanyka Rawden, suspended her investigation while the police inquiry took its course. It later emerged that Ms Rawden had issued a Prevention of Future Deaths Report to Ice Hockey UK and the English Ice Hockey Association (EIHA) about the use of neck guards in the sport. In the report, Ms Rawden said she was \"sufficiently concerned that deaths may occur in the future if neck guards or protectors are not worn\", with the bodies given 56 days to say what action had been taken - or why action had not been taken. Neck guards have been mandatory in the Elite League (EIHL), in which the Nottingham Panthers and Sheffield Steelers compete, since January 2024. This followed the International Ice Hockey Federation's decision in December to mandate the use of neck laceration protectors for its competitions."
    },
    {
        "title": "Meghan denies she is still using HRH title",
        "description": "Meghan's representatives have denied she is continuing to use the title Her Royal Highness (HRH) after relinquishing royal duties.",
        "url": "https://news.sky.com/story/meghan-denies-she-is-still-using-hrh-title-13358076",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-meghan-duchess-of-sussex_6900732.jpg?20250429135832",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-29 10:54:00",
        "Headline": "The Duchess of Sussex gave up the title when she stepped back as a senior royal - but video from a podcast interview suggests she still refers to herself as \"HRH\".",
        "Content": "Meghan's representatives have denied she is continuing to use the title Her Royal Highness (HRH) after relinquishing royal duties. The Duchess of Sussex gave up her royal title along with husband Prince Harry when they stepped down as senior royals in March 2020. However, video from the Jamie Kern Lima Show podcast shows a gift basket sent by Meghan to the host with a card that reads: \"With Compliments of HRH The Duchess of Sussex\". Ms Lima, co-founder of IT Cosmetics, said the basket she received containing homemade strawberry sauce and ice cream was sent to her home \"about a year ago... to see if that helps lighten my load\". A spokesman for the Sussexes said they do not use HRH titles. Buckingham Palace has been approached for comment. Although no laws were passed or documents signed to prevent the use of the titles, Harry and Meghan's agreement with the late Queen and senior officials was that they would stop using the word \"Royal\" after what was christened \"Megxit\" on 31 March 2020. They still retain the HRH titles, which Harry has had since birth, but are not supposed to use them. 'It's more of a honeymoon period for us now' Meanwhile, the duchess told the podcast she is enjoying a new \"honeymoon\" feeling with her husband since the pair got \"a little bit of breathing space\" after stepping back from their royal duties. Meghan said the couple struggled to fully enjoy one another's company early in their relationship as they were quickly put into \"the trenches\" by the media spotlight. The pair started dating in 2016 and married in 2018, initially taking on royal duties before deciding to step back from their roles, leading to strained relations between Harry and the King and the Prince of Wales. She said: \"You have to imagine at the beginning, everyone has, like, butterflies. \"Then we immediately went into the trenches together. Yeah, right out of the gate, like six months into dating. \"So now, seven years later, when you have a little bit of breathing space, you can just enjoy each other in a new way, and that's why I feel like it's more of a honeymoon period for us now.\" The duchess praised her husband for keeping the family \"safe\". Harry settled his long-running legal battle with News Group Newspapers (NGN) in January, receiving substantial damages and a \"full and unequivocal apology\" for \"serious intrusion\" into his private life and \"unlawful activities\" by The Sun. The duke is also involved in a legal battle with the Home Office over the level of taxpayer-funded personal security he should receive when visiting the UK. Read more from Sky News:Mark Carney wins Canada electionWoman dies in skydiving incidentMan rescued from Mount Fuji twice Meghan became emotional when talking about her children, Archie and Lilibet, and revealed that she sends emails to secret addresses she has created for them to read when they are older. She said: \"Before I go to bed, almost every night, I email them, like, here's your report card from today, or, oh my gosh, wasn't it the funniest thing this morning?\".  It comes after Meghan launched her Netflix show, new podcast and lifestyle brand As Ever. Meghan's first batch of As Ever products, including raspberry spread, flower sprinkles and herbal tea, sold out, but her Netflix lifestyle series With Love, Meghan was met with a barrage of critical reviews. The duchess also launched a new podcast series, Confessions Of A Female Founder, in April. In the fourth episode, the former Suits actress described how she started small with her jam-making inspired business venture because of a fear of failing and that she was given business advice by Oprah Winfrey. Meghan also claimed she is an over-achiever because her blood type is A positive, and admitted ignoring her own advisers to follow her gut feelings. She was frequently accused of ignoring royal aides' advice when she was a working royal."
    },
    {
        "title": "Burberry checks out contenders to replace Murphy as chairman ",
        "description": "Burberry is kicking off a formal search for a new chairman nearly a year after installing the latest in a string of chief executives charged with reviving the luxury fashion brand.",
        "url": "https://news.sky.com/story/burberry-checks-out-contenders-to-replace-murphy-as-chairman-13358258",
        "image_url": "https://e3.365dm.com/20/02/1920x1080/skynews-burberry-store-new_4913587.jpg?20200207095728",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-29 15:52:00",
        "Headline": "The London-listed luxury goods group is seeking a successor to Gerry Murphy, who has chaired the company since 2017, Sky News understands",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Burberry is kicking off a formal search for a new chairman nearly a year after installing the latest in a string of chief executives charged with reviving the luxury fashion brand. Sky News understands that Burberry is working with headhunters on a hunt for Gerry Murphy's successor. Mr Murphy, who also chairs Tesco, is not expected to step down this year, although the precise timing has yet to be formally determined, according to insiders. Last summer, Sky News reported that Burberry had commenced a search for a non-executive director capable of taking over from Mr Murphy in due course. That mandate is now said to have evolved into a more straightforward hunt for a new chair, sources suggested. Planning for his departure comes as Burberry and other luxury goods manufacturers grapple with the uncertainty of swingeing tariffs amid an escalating international trade war. The company is now being run by Joshua Schulman, the former Jimmy Choo boss, who was drafted in last July to arrest its decline. \n                  Ian King: The people and events that defined my 11 years at Sky News\n                 \n                  Money blog: M&S empty shelves across UK - what you need to know\n                 \n                  Food inflation highest in almost a year - more to come, industry warns\n                 Mr Schulman replaced Jonathan Akeroyd, who left in the wake of a string of profit warnings. Shares in Burberry closed on Tuesday at 738.8p, giving it a market value of about £2.6bn. The stock is down by more than a third over the last year. A spokesperson for Burberry said: \"In the normal course of business, we look at succession planning for board roles as they reach term.\""
    },
    {
        "title": "Food inflation highest in almost a year - more to come, industry warns",
        "description": "Food inflation has hit its highest level in almost a year and could continue to go up, according to an industry body.",
        "url": "https://news.sky.com/story/food-inflation-highest-in-almost-a-year-more-to-come-industry-warns-13357915",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-shopping-trolley-supermarket_6285181.jpg?20230915074554",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-04-29 05:22:00",
        "Headline": "The British Retail Consortium sees a threat that rising costs, including tax rises, will be passed on to customers - but separate data suggests a supermarket price war are keeping increases in check for now.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Food inflation has hit its highest level in almost a year and could continue to go up, according to an industry body. The British Retail Consortium (BRC) reported a 2.6% annual lift in food costs during April - the highest level since May last year and up from a 2.4% rate the previous month. The body said there was a clear risk of further increases ahead due to rising costs, with the sector facing £7bn of tax increases this year due to the budget last October. Money latest: Can we hide my wife's redundancy from mortgage provider? It warned that shoppers risked paying a higher price - but separate industry figures suggested any immediate blows were being cushioned by the effects of a continuing supermarket price war. Kantar Worldpanel, which tracks trends and prices, said spending on promotions reached its highest level this year at almost 30% of total sales over the four weeks to 20 April. It said that price cuts, mainly through loyalty cards, helped people to make the most of the Easter holiday with almost 20% of items sold at respective market leaders Tesco and Sainsbury's on a price match. \n                  Inflation fall likely to be a temporary respite for consumers and chancellor\n                 \n                  Inflation continues to fall but expect an April rebound due to across-the-board bill hikes\n                 \n                  Inflation rise unlikely to shift Bank of England's stance on interest rates\n                 Its measure of wider grocery inflation rose to 3.8%, however. Wider BRC data showed overall shop price inflation at -0.1% over the 12 months to April, with discounting largely responsible for weaker non-food goods. But its chief executive, Helen Dickinson, said retailers were \"unable to absorb\" the surge in costs they were facing. \"The days of shop price deflation look numbered,\" she said, as food inflation rose to its highest in 11 months, and non-food deflation eased significantly. \"Everyday essentials including bread, meat, and fish, all increased prices on the month. This comes in the same month retailers face a mountain of new employment costs in the form of higher employer National Insurance Contributions and increased NLW [national living wage],\" she added.  While retail sales growth has proved somewhat resilient this year, it is believed big rises to household bills in April - from things like inflation-busting water, energy and council tax bills - will bite and continue to keep a lid on major purchases. Also pressing on both consumer and business sentiment is Donald Trump's trade war - threatening further costs and hits to economic growth ahead. Read more from Sky News:UK-US trade talks 'moving in positive way', says White HouseM&S tells agency workers to stay at home after cyberattack A further BRC survey, also published on Tuesday, showed more than half of human resources directors expect to reduce hiring due to the government's planned Employment Rights Bill. The bill, which proposes protections for millions of workers including guaranteed minimum hours, greater hurdles for sacking new staff and increased sick pay, is currently being debated in parliament. The BRC said one of the biggest concerns was that guaranteed minimum hours rules would hit part-time roles."
    },
    {
        "title": "The councils dishing out most (and least) fines to parents over holidays",
        "description": "New research has revealed vast differences in the number of truancy fines handed out by local authorities in England and Wales.",
        "url": "https://news.sky.com/story/the-councils-dishing-out-most-and-least-fines-to-parents-over-holidays-13358028",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-school-holidays_6900529.jpg?20250429105753",
        "type": "Business",
        "Author": "Brad Young",
        "Date Published": "2025-04-29 09:53:00",
        "Headline": "Parents are disregarding fines and potential jailtime to save money with term-time holidays. There can be severe consequences, but there also appear to be huge differences in the approach of each local authority.",
        "Content": "\n          Live news reporter\n              @bradley_jyoung\n New research has revealed vast differences in the number of truancy fines handed out by local authorities in England and Wales. The most aggressive council, Essex County Council, imposed 35,605 fines for unauthorised school absences - which cost parents up to £160 - between 2022 and 2024, according to Confused.com. Meanwhile, the most relaxed council, Denbighshire County Council, imposed just four. In fact, far fewer fines were imposed across Wales (2,762) than England (873,062). That equates to a fine for every 65 people in England, compared with every 1,134 people in Wales. Here you can see the 10 councils that handed out the most and fewest fines... The insurance site found nearly two in five parents whose child has had an unauthorised absence admitted to taking them on holiday, saving an average of £567 on travel costs - rising to more than £1,000 for 16% of them. Some 27% of parents have received a fine for doing so. \"I would do it again because the hike in prices for term-time versus non-term-time holidays is crazy,\" said Joanne, from Cambridge, who took her two daughters, aged eight and 12, out of school for the last three days of term in July 2024. She was fined £80 for allowing them to travel with their grandfather to visit their father at his home in Singapore, a trip that lasted 15 days in total. \"They don't see him throughout the year, so I think that's valuable in itself, and then if you're going on a holiday to see a different kind of culture, I think there's education to be had in that,\" she said. Almost half (48%) of those surveyed who were fined said they would do it again. 'Severe consequences' \"With prices often soaring outside of term time, some parents are weighing up the potential cost of a fine against the savings they can make by travelling off-peak,\" Alvaro Iturmendi, travel insurance expert at Confused.com, said. \"But if this is something that is happening repeatedly, then councils could take legal action. So while the savings could seem worth it, the consequences could be far more severe than you realise.\" Councils in England can fine each parent £80 for absences, doubling if it's not paid within 21 days. If a parent receives a second fine for the same child within three years, this will be charged at the higher rate of £160. In Wales, councils can fine each parent £60, doubling if it's not paid within 28 days. It's the responsibility of local authorities to decide when to issue fines, meaning the process varies from council to council. Under national rules, a fine must be considered when a child has missed five days of school for unauthorised reasons. If they are off school three or more times within three years, the parent/s can be taken to court, where they could face a £2,500 fine, a community order or a jail sentence of up to three months. Scotland and Northern Ireland do not issue fines, though parents could still face legal action. Regular unauthorised absences could see parents fined up to £1,000 by a court. In Scotland, they could face up to a month in prison. Read more:UK-US trade talks 'moving in positive way', says White HouseM&S tells agency workers to stay at home after cyberattack \"Poor attendance damages children's prospects and term-time holidays place the burden on teachers to support missed learning - affecting the entire class,\" a Department for Education spokesperson warned. \"That's why fines have a vital place in our system, so everyone is held accountable for ensuring our children are in school.\" Yet a third of people surveyed said they believed travel was just as important as formal education (33%), that parents should have more freedom to decide (31%) and that schools should have more discretion to approve term-time holidays (35%). You can find more information on absence rules and Confused.com's truancy fine calculator here."
    },
    {
        "title": "Inside the Vietnamese factory preparing for the worst since Trump's tariff threat",
        "description": "On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks.",
        "url": "https://news.sky.com/story/inside-the-vietnamese-factory-preparing-for-the-worst-since-trumps-tariff-threat-13357895",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vietnam-tariffs_6900332.jpg?20250429050543",
        "type": "Business",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-29 03:07:00",
        "Headline": "Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  On the outskirts of Ho Chi Minh City, factory workers at Dony Garment have been working overtime for weeks. Ever since Donald Trump announced a whopping 46% trade tariff on Vietnam, they've been preparing for the worst. They're rushing through orders to clients in three separate states in America. Sewing machines buzz with the sound of frantic efforts to do whatever they can before Mr Trump's big decision day. He may have put his \"Liberation Day\" tariffs on pause for 90 days, but no one in this factory is taking anything for granted. Workers like Do Thi Anh are feeling the pressure. \"I have two children to raise. If the tariffs are too high, the US will buy fewer things. I'll earn less money and I won't be able to support my children either. Luckily here our boss has a good vision,\" she tells me. That vision was crafted back in 2021. When COVID struck, they started to look at diversifying their market. Previously they used to export 40% of their garments to America. Now it's closer to 20%. The cheery-looking owner of the firm, Pham Quang Anh, tells me with a resilient smile: \"We see it as dangerous to depend on one or two markets. So, we had to lose profit and spend on marketing for other markets.\" That foresight could pay off in the months to come. But others are in a far more vulnerable state. Some of Mr Pham's colleagues in the industry export all their garments to America. If the 46% tariff is enforced, it could destroy their businesses. Read more from Sky News:The world and America have changed irreversibly under TrumpTrump's first 100 days in 100 wordsHow Trump's immigration crackdown has changed lives Doubts US will start making what Vietnam delivers Down by the Saigon River, young couples watch on as sunset falls between the glimmering skyscrapers that stand as a testament to Vietnam's miracle growth. Cuong, an affluent-looking man who works in finance, questions the logic and likelihood that America will start making what Vietnam has spent years developing the labour, skills and supply chains to reliably deliver. \"The United States' GDP is so high. It's the largest in the world right now. What's the point in trying to get jobs from developing countries like Vietnam and other Asian nations? It's unnecessary,\" he tells me. But the Trump administration claims China is using Vietnam to illegally circumvent tariffs, putting \"Made in Vietnam\" labels on Chinese products. There's no easy way to assess that claim. But market watchers believe Vietnam does need to signal its willingness to crack down on so-called \"trans-shipments\" if it wants to cut a deal with Washington. 👉 Follow Trump100 on your podcast app 👈 Vietnam can't afford to alienate China The US may also demand a major cutback in Chinese manufacturing in Vietnam. That will be a much harder deal to strike. Vietnam can't afford to alienate its big brother. Luke Treloar, head of strategy at KPMG in Vietnam, is however cautiously optimistic. \"If Vietnam goes into these trade talks saying we will be a reliable manufacturer of the core products you need and the core products America wants to sell, the outcome could be good,\" he says. But the key question is just how much influence China will have on Vietnamese negotiators. Anything above 10-20% tariffs would be intensively challenging This moment is a huge test of Vietnam's resilience. Anything like 46% tariffs would be ruinous. Analysts say 10-20% would be survivable. Anything above, intensely challenging. But this looming threat is also an opportunity for Vietnam to negotiate and grow. Not, though, without some very testing concessions."
    },
    {
        "title": "Sugar tax could be applied to milkshakes to tackle obesity",
        "description": "The sugar tax currently imposed on soft drinks could be applied to milkshakes as the government seeks to crack down on rising obesity levels.",
        "url": "https://news.sky.com/story/sugar-tax-could-be-applied-to-milkshakes-to-tackle-obesity-13357997",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milkshakes-generic_6900559.jpg?20250429112652",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-29 08:58:00",
        "Headline": "Milk and dairy substitute-based drinks have been exempt from the tax on fizzy drinks, but Britons are still eating and drinking double the amount of sugar they should be.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The sugar tax currently imposed on soft drinks could be applied to milkshakes as the government seeks to crack down on rising obesity levels. The government has opened a consultation to extend the tax to pre-packaged drinks containing at least 75% milk, including non-dairy substitutes with added sugar such as oat, soy, almond and rice milk. This will include pre-packaged cans of latte, flavoured milkshake drinks and cartons of milk alternatives bought in supermarkets. Politics latest: Govt 'reviewing' Article 8 of ECHR Ministers also want to lower the minimum amount of sugar allowed before the tax is applied in these drinks, as well as in fizzy drinks already included in the tax - known formally as the Soft Drinks Industry Levy. Extending the tax will hit 203 pre-packaged milk-based drinks currently available - 93% of sales, Department of Health analysis found. The original sugar tax on soft drinks was introduced in 2018 under the Conservative government and has led to a 46% reduction in sugar in those drinks, with 89% of soft drinks sold in the UK now not paying the tax due to reformulation. Modelling studies have found this may have prevented thousands of cases of childhood obesity and cut down on tooth decay. However, the government said UK sugar intakes remain about double the recommended level, which is why Chancellor Rachel Reeves announced in the October budget there would be a consultation to extend it. The proposals are: • To reduce the minimum sugar content at which the tax applies from 5g to 4g of sugar per 100ml • To include milk-based drinks - but with a \"lactose allowance\" to account for milk's natural sugars • To also include milk substitute drinks with added sugars. The government says this could reduce daily calorie intake by 1.2kcal in 19-64 year olds and 2.1kcal in 11-18 year olds to achieve health and economic benefits of around £4.2bn over 25 years. The Treasury's tax department, which carried out the analysis, said that was an average over each age group, with many people not consuming the drinks at all. Drinks that would come under the new proposal include: Starbucks Caramel Macchiato Iced Coffee (8.2g sugar/100ml), Shaken Udder Vanillalicious milkshake (8.4g sugar/100ml), Yazoo Strawberry Milk Drink (9.6g sugar/100ml), Alpro Soya Chocolate long life drink (7.6g sugar/100ml), Califia Farms Matcha Latte (4.3g sugar/100ml), Oatly Oat Drink Chocolate Deluxe (6.8g sugar/100ml). Read more:The food industry's dirty secret making Britain poorer and unhealthierFood inflation highest in almost a year  'Sucker punch' to stretched families The Conservatives said the extension is a \"sucker punch\" to households when Labour had \"already pushed up the cost of living for families\". Reform UK leader Nigel Farage told the BBC he was \"sick to death of a government telling us how we should live\" and said they should focus on educating people who can then make healthy decisions. Currently, the sugar tax is charged at £1.94 per 10 litres on drinks with 5g to 7.9g sugar per 100ml and £2.59 per 10 litres for drinks with 8g or more sugar per 100ml. For the 2023/2024 financial year, the sugar tax brought in about £338m, with 95% paid on drinks containing 8g or more sugar per 100ml. Milk and milk substitute-based drinks have been exempt from the sugar tax over concerns one in five teenage girls did not get enough calcium in their drinks. However, milk-based drinks only provide up to 3.5% of calcium for children aged 11 to 18 years, compared with 25% from plain milk and 38% from cereal products, including fortified white bread. Calls for sugar tax on food Industry body, the Food and Drink Federation, welcomed the consultation and said \"significant progress\" had already been made in reducing sugar in soft drinks and pre-packed milk drinks in the last three years. It added manufacturers are facing a series of pressures and called on the government to \"create the right conditions for businesses to innovate and also be clear about their long-term goals to promote business confidence\". Charity The Food Foundation also welcomed the consultation but said the government needs to be more ambitious and include food in the sugar tax \"if the government is serious about improving diets, our health and the economy\". The consultation will run from 28 April until 21 July, with businesses, charities and individuals encouraged to let their views be known."
    },
    {
        "title": "'My wife lost her job and we're buying a house - do we need to tell our mortgage provider?'",
        "description": "Every week we ask an expert to answer your financial problems or consumer disputes in the Money blog. Today, we tackled this issue sent to us by a reader in Shropshire, who writes:",
        "url": "https://news.sky.com/story/my-wife-lost-her-job-and-were-buying-a-house-do-we-need-to-tell-our-mortgage-provider-13358019",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stock-istock-generic_6848624.jpg?20250307063055",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-29 09:41:00",
        "Headline": "Do you have to tell your new mortgage provider if you're made redundant? We investigate.",
        "Content": "Every week we ask an expert to answer your financial problems or consumer disputes in the Money blog. Today, we tackled this issue sent to us by a reader in Shropshire, who writes: We are due to complete on our first house in a couple of weeks but my wife found out last week that she's being made redundant. She works in sales and is likely to get another job soon. All our credit checks have been passed. Do we need to disclose this? The Money team answers... First, we are sorry to hear about your wife's redundancy. This kind of thing is unwelcome at any time, but if you're in the process of a house move - one of life's most stressful events - it can be particularly gut-wrenching. Do you have to tell your lender? Money regular David Hollingworth, associate director at L&C Mortgages, says: \"There will be a requirement for the applicant to let the lender know that there's been a change in their financial circumstances.\" Most lenders will explicitly stipulate that you have to make them aware of a change of circumstances, such as redundancy. \n                  Burberry checks out contenders to replace Murphy as chairman \n                 \n                  Ian King: The people and events that defined my 11 years at Sky News\n                 \n                  Money blog: M&S empty shelves across UK - what you need to know\n                 If you don't, it could have a financial impact, says Natalie Bradley, partner and conveyancing specialist at Stephensons. \"The client could commit themselves to an exchange of contracts. The lender may then carry out another credit check (some do but it is rare) and ask for further payslips,\" she says. \"They then may withdraw the mortgage offer as they become aware of the change in circumstances. If this were to happen the client would then lose the 10% deposit given on exchange.\" She also says if the buyer did not consent to their solicitor telling the lender about the redundancy, the solicitor may pull out of acting on their behalf. \"Naturally, the client does not really want to put themselves in a position where they buy a property with no income to pay the mortgage. This could lead to repossession which would adversely affect their credit rating,\" Natalie says. Will mortgage be withdrawn? It's possible for the mortgage offer to be withdrawn if there's a \"material change in circumstances\", says Hollingworth. \"For many, moving from two incomes to one is likely to make it difficult to meet the lenders' criteria and it could unfortunately mean no longer qualifying for the mortgage.\" Some hope A job loss doesn't automatically mean losing your mortgage offer, however. While it's worth having a rethink of whether to pursue the mortgage amount you've been offered given your new situation, you could still be okay if you are buying with someone else and your combined income is enough to cover repayments. Significant savings or a new job offer on the horizon could also reassure the lender that you won't fall behind on paying back what you owe. Or if your wife receives a redundancy payment, a smaller mortgage could be required. Read more Money problems:'My late husband had premium bonds. Can I put them in my name and how do I check if we ever won?''I'm organising a hen do and someone has dropped out last minute. Do I ask her to pay?'Everything you need to know about chargeback A mortgage reassessment A mortgage reassessment could take a while - and it may end in you being offered a smaller loan or higher interest rate. Hollingworth's advice is to give good consideration to whether to pursue the mortgage offer and therefore your house purchase at all - and don't get yourself into trouble. \"Although that would potentially mean missing out on the new home in the near term it could save falling into deeper problems by taking on a bigger debt at a time when income has reduced,\" he says. \"Failing to present the correct information to the lender through the application process would be fraudulent.\" This feature is not intended as financial advice - the aim is to give an overview of the things you should think about. Submit your dilemma or consumer dispute via:"
    },
    {
        "title": "Financier Hands checks into holiday parks operator Lovat",
        "description": "The investment firm founded by financier Guy Hands has struck a deal to buy a portfolio of British holiday parks.",
        "url": "https://news.sky.com/story/financier-hands-checks-into-holiday-parks-operator-lovat-13357995",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-guy-hands-chelsea_6900478.jpg?20250429100722",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-29 08:53:00",
        "Headline": "The acquisition with Angelo Gordon is one of Terra Firma's first deals since it announced Guy Hands' exit as chairman in July 2023, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The investment firm founded by financier Guy Hands has struck a deal to buy a portfolio of British holiday parks. Sky News has learnt that Terra Firma, which Mr Hands ran for decades, is buying Lovat Parks, a privately owned leisure group, in partnership with Angelo Gordon, a specialist backer of real estate assets. Lovat Parks operates premium holiday homes and luxury lodges at nine sites across the UK, including locations in Cornwall, Norfolk and the New Forest. Money latest: The area where 35k parents have been fined over school attendance Raoul Fraser, the company's founder, will continue to run the business. The deal is one of Terra Firma's first acquisitions since it announced in 2023 that Mr Hands would step back from day-to-day involvement with the firm. He set up Terra Firma in 2002, and through it acquired companies including the record label EMI and the care homes operator Four Seasons Health Care. \n                  Burberry checks out contenders to replace Murphy as chairman \n                 \n                  Ian King: The people and events that defined my 11 years at Sky News\n                 \n                  Money blog: M&S empty shelves across UK - what you need to know\n                 Last December, it struck a near-£6bn deal to sell 36,000 military homes to the UK's Ministry of Defence, bringing an end to a long-running battle between Mr Hands' firm and the government. The price it and Angelo Gordon were paying for Lovat Parks was unclear on Tuesday. Read more from Sky News:Food inflation highest for more than a year - more to come, industry warnsMandate solar panels on all new homes to cut bills, councils argue In a statement issued following an enquiry from Sky News, Terra Firma managing director Richard Hands - the son of Guy - said: \"Lovat Parks operates some of the highest quality holiday parks in attractive destinations around the UK, in a sector that has proven resilient and durable. \"Through our partnership with TPG Angelo Gordon, we are excited to bring our operational and strategic expertise in multi-site asset-backed businesses to deliver on the company's ambitious growth plans.\""
    },
    {
        "title": "Crush fly-tippers' vans, government tells councils",
        "description": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste.",
        "url": "https://news.sky.com/story/crush-fly-tippers-vans-government-tells-councils-13358361",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crush-car-fly-tipping_6901140.jpg?20250429213040",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-29 20:14:00",
        "Headline": "Labour claims the last Conservative administration let fly-tipping get \"out of control\" - while the Tories say Labour is mismanaging waste in areas where it runs local authorities.",
        "Content": "The government wants councils to crush more vans used to fly-tip rubbish, as it announces a crackdown on the illegal dumping of waste. No new funding is being given to local authorities for the initiatives, with ministers saying the seven percent raise announced in the budget can be used. As part of the announcement, the government has also proposed that fly-tippers could face up to five years in prison, although this would require a change in the law. Politics Hub: Follow latest updates Environment Secretary Steve Reed said: \"Councils will get much more aggressive against fly-tippers and that includes using the latest technology, things like the new mobile CCTV cameras and drones to identify, track and then seize the vehicles that are being used for fly-tipping to a yard like this and crush them. \"That's both as a punishment for those people who are dumping the rubbish but also as a deterrent for those who are thinking about doing it.\" He added: \"We're also looking to change the law so that those rogue operators who take rubbish from someone's home and then dump it on a nearby road - they were getting away almost scot-free under the previous government - they will now be looking at potentially five-year prison sentences.\" \n                  Wes Streeting's ex-aide Samuel Gould given suspended sentence after exposing himself to girl\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  US trade deal 'possible' but not 'certain', says senior minister\n                 The minister claimed the fly-tipping was \"out of control\" under the last government. Data from the Department for Environment, Food and Rural Affairs (DEFRA) shows local authorities in England dealt with a record 1.15 million incidents last year - a 20% increase from 2018/19. Environment Agency chief executive Philip Duffy said: \"We're determined to bring these criminals to justice through tough enforcement action and prosecutions. \"That's why we support the government's crackdown on waste criminals, which will ensure we have the right powers to shut rogue operators out of the waste industry.\" However, the Conservatives claimed that rubbish is \"piling high\" in areas like Birmingham as refuse workers strike against a pay and jobs offer from the Labour-run council. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Read more:Gangs 'make millions' from wasteVillage blocked by rubbish Shadow environment secretary Victoria Atkins said: \"Wherever Labour is in charge, waste is piling high - like in Birmingham, where Labour's inability to stand up to their union paymasters has left rat-infested rubbish littered across the street. \"And with statistics showing that of the 50 worst local areas for fly-tipping, 72% are Labour controlled, it is clear that voting Labour gets you rubbish and rats. \"So the British public deserve real action, not this series of reheated announcements and policies already introduced by previous governments that Labour is peddling.\" Liberal Democrat deputy leader Daisy Cooper said: \"Under the Conservatives' watch, local communities have been plagued by a fly-tipping epidemic. \"From overflowing bins to piles of hazardous waste, fly-tipping is blighting our landscapes, poisoning livestock on farming land and causing misery for residents. \"Enough is enough. \"The Liberal Democrats are calling for a fly-tipping fighting fund, to push for stronger local enforcement and tougher penalties for offenders.\""
    },
    {
        "title": "Trump or Carney – will Starmer have to choose?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/trump-or-carney-8211-will-starmer-have-to-choose-13357934",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-29 06:29:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 The morning political podcast which gives you all need for the day ahead in 20 minutes, usually with Sky News' Sam Coates and Politico's Anne McElvoy. But, for this episode, Anne is somewhere over the Atlantic travelling back from the US so Sam is joined by Politico's Tim Ross. Mark Carney's Liberal Party has won the Canadian election. It'll give Keir Starmer a centre-left ally at G7 but how will the PM position himself now in the Trump-Carney standoff? Elsewhere, with political leaders out and about in Bristol, Scunthorpe, South Cambridgeshire and Wiltshire - there are plenty of clues about the biggest target seats in the last 48 hours before local election voting. To find lists of candidates in all the local elections, you can search here: https://www.electoralcommission.org.uk/i-am-a/voter/your-election-information"
    },
    {
        "title": "UK joins US in strike on Houthi target in Yemen for first time since Donald Trump re-elected",
        "description": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected.",
        "url": "https://news.sky.com/story/uk-joins-us-in-strike-on-houthi-target-in-yemen-for-first-time-since-donald-trump-re-elected-13358440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yemen-sanaa_6901213.jpg?20250430020943",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-29 23:46:00",
        "Headline": "The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden.",
        "Content": "The UK has joined US forces in attacking a Houthi target in Yemen for the first time since Donald Trump was re-elected. The Ministry of Defence (MoD) confirmed the strikes took place on Tuesday as part of the government's response to Houthi attacks on international shipping in the Red Sea and Gulf of Aden. The ministry said careful intelligence analysis identified a cluster of buildings used by the Houthis to manufacture the sort of drones used to attack ships, located 15 miles south of the capital Sanaa. RAF Typhoon FGR4s conducted strikes on several buildings using Paveway IV precision-guided bombs. The planes had air refuelling support from Voyager tankers. The ministry said the strike was conducted after dark to reduce the likelihood of civilians being in the area. All the aircraft returned safely. Defence Secretary John Healey said: \"This government will always act in the interests of our national and economic security. \"Royal Air Force Typhoons have successfully conducted strikes against a Houthi military target in Yemen and all UK aircraft and personnel have returned safely to base. \"We conducted these strikes, supported by the US, to degrade Houthi capabilities and prevent further attacks against UK and international shipping.\" Read more from Sky News:Kneecap's Eden Project gig cancelled amid 'kill MPs' rowIsrael releases medic detained after IDF attack on aid workersCrush fly-tippers' vans, government tells councils Houthis a 'persistent threat' to 'freedom of navigation' Mr Healey said Houthi activities in the Red Sea are a \"persistent threat\" to \"freedom of navigation\". \"A 55% drop in shipping through the Red Sea has already cost billions, fuelling regional instability and risking economic security for families in the UK,\" he said. \"The government is steadfast in our commitment to reinforcing global stability and protecting British working people. I am proud of the dedication and professionalism shown by the service men and women involved in this operation.\" US intensifies strikes on Houthis It was the first time UK forces have struck a target in Yemen since May last year, the ministry confirmed. The US has intensified its strikes on the Iran-backed Houthis under Mr Trump's presidency, after his re-election in November 2024. The group began launching attacks on shipping routes in November 2023 saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza.  The strike came after a Houthi-controlled TV channel claimed a US strike killed 68 people at a detention centre for African migrants in Yemen on Monday."
    },
    {
        "title": "Sugar tax could be applied to milkshakes to tackle obesity",
        "description": "The sugar tax currently imposed on soft drinks could be applied to milkshakes as the government seeks to crack down on rising obesity levels.",
        "url": "https://news.sky.com/story/sugar-tax-could-be-applied-to-milkshakes-to-tackle-obesity-13357997",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milkshakes-generic_6900559.jpg?20250429112652",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-29 08:58:00",
        "Headline": "Milk and dairy substitute-based drinks have been exempt from the tax on fizzy drinks, but Britons are still eating and drinking double the amount of sugar they should be.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The sugar tax currently imposed on soft drinks could be applied to milkshakes as the government seeks to crack down on rising obesity levels. The government has opened a consultation to extend the tax to pre-packaged drinks containing at least 75% milk, including non-dairy substitutes with added sugar such as oat, soy, almond and rice milk. This will include pre-packaged cans of latte, flavoured milkshake drinks and cartons of milk alternatives bought in supermarkets. Politics latest: Govt 'reviewing' Article 8 of ECHR Ministers also want to lower the minimum amount of sugar allowed before the tax is applied in these drinks, as well as in fizzy drinks already included in the tax - known formally as the Soft Drinks Industry Levy. Extending the tax will hit 203 pre-packaged milk-based drinks currently available - 93% of sales, Department of Health analysis found. The original sugar tax on soft drinks was introduced in 2018 under the Conservative government and has led to a 46% reduction in sugar in those drinks, with 89% of soft drinks sold in the UK now not paying the tax due to reformulation. Modelling studies have found this may have prevented thousands of cases of childhood obesity and cut down on tooth decay. However, the government said UK sugar intakes remain about double the recommended level, which is why Chancellor Rachel Reeves announced in the October budget there would be a consultation to extend it. The proposals are: • To reduce the minimum sugar content at which the tax applies from 5g to 4g of sugar per 100ml • To include milk-based drinks - but with a \"lactose allowance\" to account for milk's natural sugars • To also include milk substitute drinks with added sugars. The government says this could reduce daily calorie intake by 1.2kcal in 19-64 year olds and 2.1kcal in 11-18 year olds to achieve health and economic benefits of around £4.2bn over 25 years. The Treasury's tax department, which carried out the analysis, said that was an average over each age group, with many people not consuming the drinks at all. Drinks that would come under the new proposal include: Starbucks Caramel Macchiato Iced Coffee (8.2g sugar/100ml), Shaken Udder Vanillalicious milkshake (8.4g sugar/100ml), Yazoo Strawberry Milk Drink (9.6g sugar/100ml), Alpro Soya Chocolate long life drink (7.6g sugar/100ml), Califia Farms Matcha Latte (4.3g sugar/100ml), Oatly Oat Drink Chocolate Deluxe (6.8g sugar/100ml). Read more:The food industry's dirty secret making Britain poorer and unhealthierFood inflation highest in almost a year  'Sucker punch' to stretched families The Conservatives said the extension is a \"sucker punch\" to households when Labour had \"already pushed up the cost of living for families\". Reform UK leader Nigel Farage told the BBC he was \"sick to death of a government telling us how we should live\" and said they should focus on educating people who can then make healthy decisions. Currently, the sugar tax is charged at £1.94 per 10 litres on drinks with 5g to 7.9g sugar per 100ml and £2.59 per 10 litres for drinks with 8g or more sugar per 100ml. For the 2023/2024 financial year, the sugar tax brought in about £338m, with 95% paid on drinks containing 8g or more sugar per 100ml. Milk and milk substitute-based drinks have been exempt from the sugar tax over concerns one in five teenage girls did not get enough calcium in their drinks. However, milk-based drinks only provide up to 3.5% of calcium for children aged 11 to 18 years, compared with 25% from plain milk and 38% from cereal products, including fortified white bread. Calls for sugar tax on food Industry body, the Food and Drink Federation, welcomed the consultation and said \"significant progress\" had already been made in reducing sugar in soft drinks and pre-packed milk drinks in the last three years. It added manufacturers are facing a series of pressures and called on the government to \"create the right conditions for businesses to innovate and also be clear about their long-term goals to promote business confidence\". Charity The Food Foundation also welcomed the consultation but said the government needs to be more ambitious and include food in the sugar tax \"if the government is serious about improving diets, our health and the economy\". The consultation will run from 28 April until 21 July, with businesses, charities and individuals encouraged to let their views be known."
    },
    {
        "title": "Kemi Badenoch warns of 'long road ahead' for Tories but says it won't be 'decades' before party back in power",
        "description": "Conservative leader Kemi Badenoch has said her party will not be in opposition for \"decades\" - but warns there is a \"long road ahead\" for the Tories.",
        "url": "https://news.sky.com/story/badenoch-warns-of-long-road-ahead-for-tories-but-says-it-wont-be-decades-before-party-back-in-power-13358254",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kemi-badenoch-tories_6900952.jpg?20250429191213",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-29 15:44:00",
        "Headline": "The Conservative leader says she wants her party back in government at the next general election - but she admits \"that's a really tough job\". Thursday marks Kemi Badenoch's first electoral test since taking over from Rishi Sunak.",
        "Content": " Conservative leader Kemi Badenoch has said her party will not be in opposition for \"decades\" - but warns there is a \"long road ahead\" for the Tories. Her comments to Sky News's political editor Beth Rigby come ahead of Thursday's local elections in England, which are expected to prove challenging for Ms Badenoch. It is her first electoral test since taking over from Rishi Sunak after their party's general election defeat last year ended a 14-year period in government. Politics latest: Number 10 rejects Kneecap apology The Conservatives are also unlikely to win the Runcorn and Helsby by-election, triggered by former Labour MP Mike Amesbury punching a constituent. Speaking to Beth Rigby in Wiltshire, Ms Badenoch said: \"We are rebuilding. We've just left the government a historic defeat. You don't just come back from that overnight. \"The last oppositions were 14 years, 13 years, 18 years. I've been a leader for six months. \"There's a long road ahead. I'm not going to let it be decades. \"I want to do this in four years, but that's a really tough job.\" Read more:Where are elections happening?Reform-Tory pact would be 'disaster' Asked by Beth if this was her asking for more time from her party, Ms Badenoch said: \"That's what my party selected me for. \"I said we're going to do this the hard way, the long way, but the most reliable way.\" There have also been reports that shadow justice secretary Robert Jenrick is manoeuvring himself to try to replace Ms Badenoch. He was defeated by the current leader in a vote of the party membership last year. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Backing from former chancellor Speaking to the Politics Hub With Sophy Ridge, ex-chancellor Jeremy Hunt cautioned against removing Ms Badenoch. Mr Hunt told Sophy that it would be \"the worst possible thing\" to have speculation about a \"change in leadership\". The Tory MP added: \"I don't think anyone would have done better than Kemi.\"  Ms Badenoch has played down the division within her party. She said: \"Robert Jenrick is a hard-working member of my team. He is talking about getting former Conservative voters back. \"I agree with him. We have a great team, unlike Nigel Farage, who's lost 20% of his party. \"We are united, and we're fighting for every single vote.\" On the subject of Reform UK and its leader Nigel Farage, Ms Badenoch told Sky News that she was not opposed to Conservatives doing deals with any parties for control of councils. She said that local elections are different to national parliamentary votes, where a coalition is not on the cards. The interview with Kemi Badenoch is part of a series of election previews with all major parties invited."
    },
    {
        "title": "Kemi Badenoch: 'I would not want a man doing my breast screening exam'",
        "description": "Kemi Badenoch has said she would not want a male radiographer performing a mammogram to screen for breast cancer.",
        "url": "https://news.sky.com/story/kemi-badenoch-i-would-not-want-a-man-doing-my-breast-screening-exam-13358052",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kemi-badenoch-local-election_6893618.jpg?20250422110831",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-29 10:22:00",
        "Headline": "The Society of Radiographers says male health workers could \"excel\" at mammograms but are not allowed to because of their gender.",
        "Content": "Kemi Badenoch has said she would not want a male radiographer performing a mammogram to screen for breast cancer. The Conservative leader said she would \"definitely want a woman\" to perform a breast screening exam - after experts said male health workers should be allowed to perform them to tackle workforce shortages. Mammograms are the only health examination carried out solely by female staff. The NHS's breast screening programme invites women aged 50 to 71 for examinations which look for cancers too small to see or feel. Politics latest: Govt 'reviewing' Article 8 of ECHR Amid a \"critical\" staff shortage, the Society of Radiographers (SoR) said male health workers could excel in the field but are being denied the chance because of their gender. Ms Badenoch, 45, told Times Radio: \"I've had a mammogram, it is a very, very intrusive process. \"It involves the clinician holding both of your breasts for a long period of time, feeling them, manipulating them, putting them in the machine. \"I would not want a man doing that - (I) definitely would want a woman.\" She added: \"I think the solution is to get more radiographers, not to ask women, yet again, to sacrifice their privacy and dignity to deal with a supply issue. I don't think that's right.\" At the SoR annual conference, they will vote on whether they want to allow male mammographers, stating the skills needed \"are not inherently gendered attributes, specific or biased to one gender\". The motion adds men \"might excel in this\" and \"offer a different perspective or approach to patient care\". They also said transgender men should be included in the NHS breast screening programme. Read more from Sky News:Sugar tax could be applied to milkshakesSex offenders to be denied refugee status  The SoR said the vacancy rate among screening mammographers is 17.5% and is nearly 20% among symptomatic mammographers, who assess women with lumps in their breasts or family history of breast cancer. \"Allowing men to work in mammography would help to reduce shortages - and therefore to reduce waiting lists,\" said Charlotte Beardmore, executive director of professional policy at the SoR. \"That, in turn, would ensure that every patient is given the treatment they need, when they need it.\" A Department of Health and Social Care (DHSC) spokesperson said: \"This government inherited a broken NHS where too many cancer patients are waiting too long for diagnosis and treatment, including for breast cancer. \"Through our Plan for Change, we are driving down waiting times, getting patients seen and treated faster. \"We will also tackle workforce shortages head on, and ensure the NHS has the staff it needs to be there for all of us when we need it.\""
    },
    {
        "title": "Government warned it is setting country up for 'disaster' unless it better prepares UK for heavy flooding and intense heat",
        "description": "A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires.",
        "url": "https://news.sky.com/story/government-warned-it-is-setting-country-up-for-disaster-unless-it-better-prepares-uk-for-heavy-flooding-and-intense-heat-13358235",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wildfire-country-down_6900969.jpg?20250429172227",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-29 23:30:00",
        "Headline": "After deadly flooding in Valencia and fierce LA wildfires, climate advisers in the UK have issued a stark warning the country is unprepared to cope with a hotter world.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A blistering new report has slated government efforts to protect Britons from climate change that is already flooding homes, farmland and railways, overheating hospitals and schools and fuelling wildfires. Following deadly flooding in Valencia and furious wildfires in Los Angeles, the UK's climate advisers have warned people and critical infrastructure are highly exposed to extreme weather due to a \"piecemeal and disjointed approach\". They warned progress in adapting to a hotter world has either been glacial, or moved in the wrong direction - amid fears of budget cuts in the upcoming spending review and spiralling problems in the water industry. Of the 46 measures of government delivery - from protecting railways from collapsing to ensuring water and food security - not one was rated \"good\". The Climate Change Committee (CCC) even said there has been \"no change in addressing this risk\" under the new Labour government - raising questions about its claims to be a climate leader. The government says the issue is a top priority. Baroness Brown, who chairs the CCC's adaptation committee, told Sky News: \"We know what climate change is doing now. We know worse is to come. And yet nobody seems to be taking this seriously enough.\" \n                  End the 'absolute scandal' of new homes built without solar panels, government urged\n                 \n                  Scientists create lab-grown chunks of chicken in 'breakthrough' that could pave way for larger cuts of meat\n                 \n                  'Tropical nights' in European holiday hotspots are soaring\n                 While Labour has made bold strides in trying to limit climate change, it's done very little on helping us deal with the impacts, she said. \"It still seems to feel like it's tomorrow's problem… and if we don't tackle it today, it becomes tomorrow's disaster.\" The \"Progress in adapting to climate change\" report warns that by 2050: It said climate change is already hitting hard:  Outcry has been widespread Farmers said it is \"shocking how unprepared we are\", while businesses called it \"sobering reading\". Thinktanks said climate threats \"should be considered national security risks\" and scientists said getting it right \"could save the UK billions of pounds\". Obstetricians warned air pollution and heatwaves risk premature births. But spending across government is tightly squeezed as the chancellor moots further cuts - with the budget for flood defences proposed for the chopping block. The issue isn't unique to the UK. Around the world, adapting to climate change has proved harder to get to grips with than measures to curb it. Scientists say both are needed. But \"this isn't impossible,\" said Baroness Brown, citing good examples in Canada, Germany and the Netherlands. She said in some areas, the UK government doesn't even know what it is aiming for, even though targets are \"hugely important\" for attracting private investment. Bev Cornaby, director of the Corporate Leaders Group UK, said: \"The private sector can deliver more, including innovation, investment and leadership, with clear goals, joined up policy and better communication and engagement from government.\" The CCC called for a raft of measures, from retrofitting hospitals with green roofs for cooling, to ensuring people know what to do in a heatwave such as closing windows and curtains in the morning. A government spokesperson said they would carefully consider the findings of the committee's report. They added: \"Alongside our transition to become a clean energy superpower and accelerating towards net zero, the government is taking robust action to prepare for the impacts of a changing climate. \"We are investing a record £2.65bn to repair and build flood defences, protecting tens of thousands of homes and businesses and helping local communities become more resilient to the effects of climate change such as overheating and drought.\""
    },
    {
        "title": "Drinking white wine could reduce risk of cardiac arrest - study",
        "description": "Drinking white wine and Champagne, eating more fruit and keeping waistlines slim could reduce the risk of sudden cardiac arrest, according to a new study.",
        "url": "https://news.sky.com/story/drinking-white-wine-and-eating-more-fruit-could-reduce-risk-of-cardiac-arrest-study-13357927",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-white-wine-fruit-generic_6900388.jpg?20250429074431",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-29 06:12:00",
        "Headline": "New research identifies 56 risk factors associated with sudden cardiac arrest and finds up to 63% of cases might be avoidable.",
        "Content": "Drinking white wine and Champagne, eating more fruit and keeping waistlines slim could reduce the risk of sudden cardiac arrest, according to a new study. Experts have suggested thousands of cardiac arrests could be prevented by tackling health and lifestyle issues. They found a higher consumption of Champagne or white wine, more fruit, maintaining a positive mood, remaining a healthy weight and keeping blood pressure under control appeared to protect against a cardiac arrest. People who are more educated also seemed less prone to cardiac arrest, the study suggested, while poor sleep patterns and a lack of exercise could be detrimental. A cardiac arrest - where the heart suddenly stops beating - is an emergency medical situation that usually happens without warning. People suddenly collapse and are unconscious, and are not breathing or not breathing normally. Without immediate treatment, people die. UK figures suggest there are about 30,000 cardiac arrests a year outside of hospital where emergency medical services attempt to resuscitate a person who has collapsed and stopped breathing normally. The latest study, published in the Canadian Journal of Cardiology, identified 56 risk factors associated with sudden cardiac arrest and found up to 63% of cases might be avoidable. \"As expected, lifestyles account for the most burden,\" the researchers said, adding: \"Public awareness campaigns should be further encouraged to promote lifestyle interventions.\" The study looked at 502,094 middle-to-older aged people included in the UK Biobank of data. Of those, 3,147 people suffered sudden cardiac arrest during a typical follow-up period of 13.8 years. The 56 risk factors identified by researchers included lifestyle factors, socio-economic status, and the local environment, such as exposure to air pollution. The researchers concluded that between 40% and 63% of sudden cardiac arrest cases may be avoidable when looking at all 56 risk factors. For lifestyle factors, the study found that a higher consumption of Champagne and/or white wine and fruit intake protected against cardiac arrest, while \"fed-up\" feelings, high body mass indexes (BMIs) and arm fat mass, high blood pressure, and a lower education level all increased the risk. Read more from Sky News:Ultra-processed foods could be linked to thousands of deaths a yearDisposable vape ban 'may not curb e-cigarette use' Lead investigator Dr Huihuan Luo, from Fudan University in Shanghai, China, said: \"The study found significant associations between various modifiable factors and sudden cardiac arrest, with lifestyle changes being the most impactful in preventing cases.\" In an accompanying editorial, Nicholas Grubic, from the University of Toronto, and Dakota Gustafson, from Queen's University in Ontario, added: \"One of the study's most intriguing findings is the cardioprotective effect associated with Champagne and white wine consumption, questioning long-held assumptions about the specificity of red wine's cardioprotective properties. \"Research on the underlying mechanisms remains unclear, but these findings reinforce the idea that the benefits of moderate alcohol consumption may be more complex than previously assumed.\""
    },
    {
        "title": "Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments",
        "description": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled.",
        "url": "https://news.sky.com/story/kneecaps-eden-project-gig-cancelled-amid-row-over-kill-mps-comments-13358275",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250428104545",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-29 16:35:00",
        "Headline": "The cancellation of the concert follows an apology by the band to the families of MPs who have been murdered, but which also said the relevant footage had been \"exploited\", leading Downing Street to demand a fuller apology and the opposition leader to call for them to be banned.",
        "Content": "A performance by Belfast rap trio Kneecap at the Eden Project has been cancelled. It comes after a row in which one of the group appeared to call for Tory MPs to be killed and another appeared to shout \"up Hamas, up Hezbollah\" in historical footage of a gig. A spokesperson for Eden Sessions, which organises the gigs at the Cornwall venue, said: \"Eden Sessions Limited announced today that the Kneecap show at Eden Project scheduled for July 4, 2025 has been cancelled. \"Ticket purchasers will be contacted directly and will be fully refunded. \"The refund process will commence from Wednesday, April 30 2025. Refunds will be processed against the original payment cards used. Purchasers should allow six working days for funds to be received into their accounts.\" On Monday, the band apologised to the families of murdered MPs Sir David Amess and Jo Cox after footage emerged of one of its members appearing to say \"kill your local MP\". But Katie Amess, daughter of Sir David, dismissed their apology, accusing them of \"deflection and excuses and gaslighting\". \n                  Why are Kneecap controversial?\n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis\n                 Why are Kneecap controversial?Murdered MP's daughter 'happy to meet' rappers In a statement posted on Instagram, the group, comprising Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh, said they \"reject any suggestion that we would seek to incite violence against any MP or individual. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs. No smear campaign will change that,\" they added. The footage had been \"exploited and weaponised,\" they said. Their statement didn't impress Ms Amess, however, who on Tuesday accused them of \"gaslighting\", saying their comments were \"absurd\" and \"not an apology\". \"They don't understand what they're talking about, they obviously aren't educated enough in what they're speaking about to think that they can use those excuses and everybody will be like, 'oh, never mind, let's move on to something else'. They haven't taken any accountability. \"These words that they are using are extremely dangerous and they have not acknowledged that. 'Half-hearted' apology The prime minister's official spokesman called the band's statement \"half-hearted\" and urged them to make a fuller apology. He said Downing Street \"completely reject in the strongest possible terms the comments that they've made, particularly in relation to MPs and intimidation as well as obviously the situation in the Middle East. \"It's right that the police are looking into these videos.\" Conservative leader Kemi Badenoch called for Kneecap to be banned, saying they apologised \"because they realise that people don't like the kind of things that they've been saying\" and are \"worried they're going to lose their slot at Glastonbury\". Read more from Sky News:UK could hit 29C this weekWoman dies in skydiving incident'Moronic mission' to fell famous tree Police assessing Kneecap videos The Metropolitan Police is assessing footage from a November 2023 gig appearing to show one member of the group saying: \"The only good Tory is a dead Tory. Kill your local MP\", along with a video clip from a different concert in November 2024 in which a member of the band appeared to shout \"up Hamas, up Hezbollah\" - groups which are banned as terrorist organisations in the UK. In Monday's statement, Kneecap insisted they have \"never supported\" Hamas or Hezbollah. Ministers also put pressure on the organisers of the Glastonbury Festival over the band's inclusion in this year's line-up. In the Commons, security minister Dan Jarvis said ministers \"would urge organisers of the Glastonbury Festival to think very carefully about who is invited to perform there later this year\"."
    },
    {
        "title": "Why are Kneecap controversial?",
        "description": "Irish band Kneecap have had a meteoric rise in the music industry, with tens of millions of streams on Spotify alone and widespread critical acclaim.",
        "url": "https://news.sky.com/story/why-are-kneecap-controversial-13358184",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-kneecap-band-government_6761084.jpg?20241129121256",
        "type": "Entertainment",
        "Author": "Jake Levison",
        "Date Published": "2025-04-29 13:11:00",
        "Headline": "The English and Irish-language rap group have been embroiled in huge controversy in recent weeks - but who are they, and what are they accused of?",
        "Content": "\n          News reporter\n       Irish band Kneecap have had a meteoric rise in the music industry, with tens of millions of streams on Spotify alone and widespread critical acclaim. The trio's genre-bending rap/hip hop tracks, performed in a mixture of English and Irish-language, have clearly resonated with a mainstream audience, but their many controversial moments - some of them seemingly intentional - have helped them hit such heights. Here's what you need to know about the band and their most notorious moments. Who's in the band? The group is made up of three friends from Belfast: Mo Chara (Liam Og O Hannaidh), Moglai Bap (Naoise O Caireallain) and DJ Provai (JJ O Dochartaigh). The latter is a former teacher who still wears a balaclava, initially to disguise himself from his students when the band started out in 2017. They were controversial from the get-go - and seemingly by design. \n                  Kneecap's Eden Project gig cancelled amid row over 'kill MPs' comments\n                 \n                  'Powerful individuals' at BBC making lives of colleagues 'unbearable', says chairman\n                 \n                  Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis\n                 Their debut track - CEARTA - is based on how band member Bap was stopped by police for spray-painting cearta, the Irish word for rights, on a bus stop. Before fame, Bap and Chara, who have known each other for around 15 years, transformed a former youth club into party hub, where they would play their favourite tracks. And it was through this venture into the club space that they later met DJ Provai. The group called themselves Kneecap in reference to kneecapping, a common form of paramilitary punishment in Northern Ireland during The Troubles which sees someone shot or hit repeatedly on both knees. From cult heroes to mainstream success Kneecap released their first mixtape, 3cag, in 2018 to critical acclaim, and their 2019 single HOOD is their most streamed single to date. But their success reached new levels in 2024 with the release of their 18-track album, Fine Art, which culminated in a headline-worthy crowd attending their early-morning timeslot at Glastonbury. The band then ventured into the film industry with a self-titled biopic about their rise to prominence, set in post-Troubles Belfast, starring themselves alongside Irish actor Michael Fassbender. Before its full release last summer, it had been the talk of various film festivals, including Tribeca in New York. Speaking to Sky News at Glastonbury last year, the band said the reaction had been \"crazy\". Since then it's got crazier, with the film getting six BAFTA nominations and earning its writer and director Rich Peppiatt a win for Outstanding Debut. The band cracked the UK and are now following suit in the US, having sold out several shows there. Court battle with the UK government It would take a long time to cover all of Kneecap's controversial moments; much of it is a part of their music itself. They have been banned from Irish public service broadcaster RTE for their references to drug-taking. But there have been some particularly high-profile incidents since 2024. The first was their legal battle with the then-Conservative UK government, who blocked a grant for the band which was initially approved by the British Phonographic Industry. The group's application to the Music Export Growth Scheme, which supports UK-registered artists in global markets, was for £14,250, but Kemi Badenoch, then business secretary, stopped it. At the time, a government spokesperson said it fully supported freedom of speech, but that it was \"hardly surprising\" it did not want to hand out UK taxpayers' money to those opposed to the United Kingdom. One of their most famous tracks had been 2019's Get Your Brits Out, which had been criticised for being anti-British. The trio have always denied this being the case. Chara told Sky News after their Glastonbury set: \"This is a thing that people love to spin, like we're some anti-British band. \"We have English family. We have loads of good friends who call themselves British. It's the British government we don't like.\" Kneecap won a discrimination case against the UK government in November, earning them the same amount that the grant was worth. DJ Provai said the band's motivation was \"equality\". \"For us, this action was never about £14,250; it could have been 50p,\" he said, after the band said it would donate the funds to two Belfast charities. \"This was an attack on artistic culture, an attack on the Good Friday Agreement itself and an attack on Kneecap and our way of expressing ourselves.\" Calling for deaths of Conservative MPs Police say they are assessing a video of a Kneecap performance from November 2023, in which a member of the trio allegedly called for the death of Conservative MPs. The member is alleged to have said: \"The only good Tory is a dead Tory. Kill your local MP.\" Two British MPs have been murdered in the past 10 years - Labour's Jo Cox in 2016 and Conservative Sir David Amess in 2021.  In a statement, Kneecap said they rejected \"any suggestion that we would seek to incite violence against any MP or individual. Ever.\" They added: \"An extract of footage, deliberately taken out of all context, is now being exploited and weaponised, as if it were a call to action. \"To the Amess and Cox families, we send our heartfelt apologies, we never intended to cause you hurt.\" Pro-Palestinian messages at gigs The investigation into the MP comments was announced several days after the Met said it had referred a different video from a Kneecap gig to be reviewed by counter-terror police. Footage from that gig, at London's Kentish Town Forum last November, appeared to show one member of the group shouting \"up Hamas, up Hezbollah\". Hamas and Hezbollah are both proscribed as terrorist groups in the UK. Under Section 12 of the Terrorism Act 2000, it is an offence to express \"an opinion or belief that is supportive of a proscribed organisation\". The police say they are \"assessing\" both clips to \"determine whether further police investigation is required\". Kneecap have said they are facing a \"co-ordinated smear campaign\" after speaking out about \"the ongoing genocide against the Palestinian people\". In their statement, they said: \"Let us be unequivocal: we do not, and have never, supported Hamas or Hezbollah. We condemn all attacks on civilians, always. It is never okay. We know this more than anyone, given our nation's history. \"Kneecap's message has always been - and remains - one of love, inclusion, and hope. This is why our music resonates across generations, countries, classes and cultures and has brought hundreds of thousands of people to our gigs.\" Investigation comes after Coachella fallout Just days before the police investigations were announced, TV personality Sharon Osbourne called for Kneecap's US work visas to be revoked after accusing them of making \"aggressive political statements\" including \"projections of anti-Israel messages and hate speech\" at Coachella Music and Arts Festival. As the band performed on the second night, they displayed words on the big screen reading: \"Israel is committing genocide against the Palestinian people. \"It is being enabled by the US government who arm and fund Israel despite their war crimes. F*** Israel. Free Palestine\". Israel's ongoing offensive in Gaza, which came after Hamas gunmen launched an attack killing 1,200 people in Israel on 7 October 2023, has seen at least 52,000 people killed, according to the Gaza health ministry. Read more:BBC presenter called out for 'exceptionally inappropriate language', review hearsThe Alarm frontman dies after blood cancer diagnosis Speaking to Rolling Stone after Osbourne's comments, Kneecap member Mo Chara said: \"Her rant has so many holes in it that it hardly warrants a reply, but she should listen to War Pigs that was written by Black Sabbath [led by Ozzy Osbourne, her husband].\" He also told the outlet: \"We believe we have an obligation to use our platform when we can to raise the issue of Palestine, and it was important for us to speak out at Coachella as the USA is the main funder and supplier of weapons to Israel as they commit genocide in Gaza.\" Kneecap has been continually outspoken in favour of Palestinians at gigs. In November, DJ Provai arrived for the court verdict against the UK government in a vehicle bearing the Irish and Palestinian flags and blaring loud music."
    },
    {
        "title": "Mike Peters: The Alarm frontman dies aged 66 after blood cancer diagnosis",
        "description": "The frontman of Welsh band The Alarm, Mike Peters, has died aged 66.",
        "url": "https://news.sky.com/story/mike-peters-the-alarm-frontman-dies-aged-66-after-blood-cancer-diagnosis-13358105",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mike-peters-the-alarm_6900602.jpg?20250429120825",
        "type": "Entertainment",
        "Author": "Tomos Evans",
        "Date Published": "2025-04-29 11:30:00",
        "Headline": "Peters had been undergoing treatment for fast-growing lymphoma, after he was first diagnosed with blood cancer more than 30 year ago.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The frontman of Welsh band The Alarm, Mike Peters, has died aged 66. The rock star had been diagnosed with blood cancer and was forced to cancel a US tour last year. He had been undergoing treatment for fast-growing lymphoma at the Christie NHS Foundation Trust in Manchester. A spokesperson for Love Hope Strength, the cancer charity he set up with his wife, announced his death on Tuesday. Peters was first diagnosed with the blood cancer chronic lymphocytic leukaemia (CLL) more than 30 years ago, when he was 36 years old. Last year, he discovered a large swollen gland on his neck five days before he was due to fly to Chicago for a tour, news he described as having come as \"a bolt out of the blue\". Doctors diagnosed him with Richter's syndrome, where CLL transforms into a more aggressive high grade lymphoma. \n                  One-year-old girl dies after collision with vehicle on campsite in North Wales\n                 \n                  Driver who killed mother and daughter in crash is jailed\n                 \n                  Schoolgirl who attempted to murder teachers and pupil in Wales detained for 15 years\n                 \"I am still reeling from the consequences of this new and completely unforeseen diagnosis and doing my best to process what is happening,\" he said in a statement at the time. The Prestatyn-born singer leaves behind his wife, Jules, 58, and two sons, Dylan, 20, and Evan, 18. During his career, Peters supported U2 and Status Quo on tour and played with Bob Dylan and Bruce Springsteen. He first rose to fame in the early 1980s with The Alarm, which had hits including 68 Guns and Strength. In 2019, he was awarded an MBE for services to cancer care. Read more from Sky News:Huge fire breaks out at electrical substationWoman dies in skydiving incident Peters composed and sang the EURO 2020 Wales song, The Red Wall Of Cymru. Ian Gwyn Hughes, from the Football of Association of Wales (FAW), said Peters was \"a natural choice\". \"He will not only be remembered for his music but also as just a proper, genuine football fan who made a huge contribution to the culture of The Red Wall,\" he added."
    },
    {
        "title": "Student rescued from mountain twice in four days - after going back to find his phone",
        "description": "A Chinese student who was airlifted from Japan's Mount Fuji last week had to be saved a second time just four days later, local authorities have said.",
        "url": "https://news.sky.com/story/student-rescued-from-mount-fuji-twice-in-four-days-13357944",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mount-fuji-japan-mountain_6900409.jpg?20250429080430",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-04-29 06:59:00",
        "Headline": "The man, identified by police only as a 27-year-old Chinese student, developed altitude sickness twice after climbing during the peak's off-season.",
        "Content": "A Chinese student who was airlifted from Japan's Mount Fuji last week had to be saved a second time just four days later, local authorities have said. The 27-year-old climber made an emergency call on 22 April after getting altitude sickness on the mountain's Fujinomiya trail, about 3,000 metres (nearly 10,000 feet) above sea level. It is the peak's off-season, when officials urge people to be aware of incredibly harsh conditions. But four days later, police said they received another call to the mountain after the student, who has not been named, returned to look for his phone and other belongings left behind. They said another climber found him there unable to move after he apparently developed altitude sickness for a second time. Read more:Letter sheds possible new light on Shakespeare's marriageWoman who faked being a man to get into Magic Circle finally allowed in There is no penalty when a climber needs to be rescued, but the Chinese student's case prompted outrage on social media and calls for him to be charged, at least for his second rescue. \n                  Lightning strike injures five students at school in Japan - reports\n                 \n                  YouTuber Airi Sato stabbed to death while livestreaming on Tokyo street\n                 \n                  Why China could benefit most from Trump's tariffs\n                 The Shizuoka police urged all climbers to use caution, noting that the mountain has low temperatures and is covered in snow even in spring. The mountain's hiking trails are officially open only from July to early September, but there is not a ban on hiking off-season. Local authorities introduced entry fees and caps on the number of entrants on the most popular trail last year, and say they will introduce similar rules on other main trails later this year, whereas climbing off-season and off trail has no charge."
    }
]