[
    {
        "title": "Farage confirms he wants to deport women asylum seekers back to Taliban in Afghanistan",
        "description": "Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister.",
        "url": "https://news.sky.com/story/farage-confirms-he-wants-to-deport-women-back-to-taliban-in-afghanistan-13425996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7012717.png?20250906130251",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 11:22:00",
        "Headline": "Speaking to Sky News' political editor Beth Rigby, the Reform UK leader clarified his position on deporting asylum seekers back to the Taliban.",
        "Content": " Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister. The Reform UK leader's position on the topic has not been clear, with him previously saying he wouldn't send women back to the fundamentalist regime that took over after western militaries withdrew, before now saying he would. Mr Farage was speaking to Sky News' political editor Beth Rigby at the Reform UK party conference in Birmingham. Politics live: Govt responds to Farage wanting early election When asked if he would \"detain\" women and children and \"send them back\", the Clacton MP said \"yes\". Challenged on when he said in August that he was not \"discussing\" women and children, Mr Farage claimed this was a reference to his desire to see men detained on arrival in the UK. At the time, he said he was \"very, very clear\" on the \"deportation of illegal immigrants\", adding: \"We are not even discussing women and children at this stage - there are so many illegal males in Britain, and the news reports that said that after my conference yesterday were wrong\". Speaking today, Mr Farage claimed that the UK has a \"duty of care\" to a child if, for example, a four-year-old arrives in a dinghy - but not to women and men. \"For clarity, those that cross the English Channel will be detained and deported, men and women,\" Mr Farage went on. \"Children, we'll have to think about.\" Read more:Is Reform really now a government in waiting?Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences? 'No one' can prevent small boats crossing the Channel The Reform leader also rowed back on his pledge to stop all boats within two weeks if he is elected prime minister. Speaking to the conference yesterday, Mr Farage said: \"You cannot come here illegally and stay - we will stop the boats within two weeks of winning government.\" But speaking to Beth Rigby today, he changed tack - saying \"the passing of legislation\" would be required. He said only then would the boats be stopped within two weeks, or sooner In the interview with Rigby, Mr Farage tried to claim he did not say he would end the boats within two weeks of \"winning government\". But the video of his speech, as well as the transcript released by Reform UK, clearly show him saying: \"We will stop the boats within two weeks of winning government.\" When asked why he wouldn't be able to follow through with his initial claim, Mr Farage said it was impossible and that \"no one\" can prevent them crossing the Channel. The Reform UK leader said the law he wants to introduce will be called the Illegal Migration Act once it is passed by parliament. He confirmed his agenda includes leaving the European Convention on Human Rights, shutting down asylum hotels and housing people at RAF bases instead, as well as deporting Channel migrants.  Read more on Sky News:Flares thrown at migrant hotelLabour plans to overhaul 'broken' asylum systemMr Farage also claimed that deportation flights would also begin within two weeks of the law changing, and this combination of factors would stop people from wanting to travel from France. Political correspondent Nigel Farage insists his policy on mass deportations is clear when it comes to women and girls.\n But I've watched every Reform speech since they unveiled their flagship policy - and I was there in the room to ask him when he announced what he will do with women and children who come here via small boats if he was in power - and I still can't work it out.\n That's because he's said three different things since, including in an interview today.\n Originally he said everyone would be detained: \"Yes, women and children, everybody on arrival will be detained. And I've accepted already that how we deal with children is a much more complicated and difficult issue.\"\n A day later he said Reform is \"not even discussing women and children at this stage\" implying women and children would not be deported. \n He also said it was \"not true\" that's he had committed to sending women and girls back to countries where they can be raped, tortured and killed.\n But today at their conference he told Sky News that women who arrive by boat will be deported to Afghanistan \"if necessary\". \n Considering Reform UK say they are willing to make deals with Afghanistan and Syria, this question is an important one. The UK has not recognised the Taliban as a legitimate government of Afghanistan since the group seized Kabul in 2021 and first established a regime based on an extreme interpretation of Islamic law. \n Reform's deputy leader Richard Tice has defended those plans, saying: \"Sometimes you do deals with people you may not want to go down the pub with.\"\n Farage clarified that \"children, of course, we'll have to know that we're sending them off somewhere sensible\".\n He has also previously said asylum seekers were a threat to national security and to British women.\n The broader political issue though, is that Reform's immigration plan was meant to be a detailed and considered policy on an issue they've been ahead of other politicians on for years. \n So why aren't they more forthcoming with their answers on what they would do with women and children?\n If they had hoped to truly embody their conference slogan of \"next steps\" to professionalise the party, they need to urgently address this.\n But party members here don't seem to be bothered by this detail amongst the fireworks, the enthusiasm and the energy here.\n It turns out that years of banging on about this single issue for decades is Nigel Farage's greatest strength - and the public are willing to give him the grace to work out the details later down the line.\n This strategy all depends on Reform UK winning the next general election - which Labour does not have to call until 2029. However, the Reform leader says he believes the government will collapse in 2027 due to economic pressure and other factors. Reform are currently well clear of Labour and the Conservatives in the polling, and are targeting next year's Welsh, Scottish and English local elections to try and win more power in councils and national assemblies."
    },
    {
        "title": "Nigel Farage admits he made a mistake over house ownership after a week that proves how much details matter",
        "description": "It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle.",
        "url": "https://news.sky.com/story/nigel-farage-admits-he-made-a-mistake-over-house-ownership-after-a-week-that-proves-how-much-details-matter-13426302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7013125.png?20250906201103",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-06 18:13:00",
        "Headline": "There is no suggestion that the Reform UK leader did anything wrong, but he admits he misspoke last year when he said he bought a house in his Clacton constituency, when it was purchased by his partner.",
        "Content": "\n          Political editor\n              @BethRigby\n  It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle. The massive Westminster news on Friday meant Mr Farage had to move his speech to avoid a clash with the prime minister's reshuffle, as many a journalist like me dashed back to London to pick up an even bigger story than Mr Farage - not something he's that used to these days, after a summer of nearly back-to-back coverage of his insurgent party and its policies. But the news about Ms Rayner both detracted from and put the spotlight on him when it came to his own tax affairs. Politics latest - reshuffle continues The Labour-backing Mirror newspaper published a story calling Mr Farage a \"hypocrite\" for criticising Ms Rayner when he also had questions to answer. Because while Ms Rayner resigned after admitting she did not pay enough tax  on a home she bought in Hove, East Sussex, Mr Farage was also under scrutiny for saying he had bought his house in Clacton, when in fact he had not. Last November, Mr Farage told Sky News he \"just exchanged contracts on the house. I've bought a house in Clacton\". But in fact, Mr Farage, who owns multiple properties, hadn't bought a house at all. It was his partner who bought the house, and in doing so, only paid standard stamp duty as it is her main home. Had Mr Farage bought the house, he'd have been liable for an additional £44,000 in tax as a second home purchase.  There is no suggestion that Mr Farage did anything wrong, but he did misspeak and he used the house purchase in Clacton last November to deflect against accusations that he wasn't invested in his constituency and didn't spend any time there. He admitted to me that he made a mistake when he said it was his property. He said he \"shouldn't have said 'I', I should have said 'we'. It's her money. It's her asset. I own none of it. But I just happen to spend some time there\".  His admission comes after the Reform UK leader was challenged earlier this year over whether the property had been bought in his partner's name in a way that allowed him legally to avoid higher-rate stamp duty - a charge he roundly rejects. But it also seems that voters reject deputy party leader Richard Tice's assertion that Mr Farage's tax affairs were \"irrelevant\". Angela Rayner's forced resignation because of her own failures on tax compliance shows that these matters, particularly at a time when the government is asking voters to pay even more tax, are very pertinent. Read more on Sky News:Who's in, who's out in reshuffleRayner graffiti removedWhat a time to become home secretary Unlike Angela Rayner, no one is suggesting Mr Farage has broken any rules or owes any underpaid tax to HMRC. But the lesson of this very long week in politics is that all politicians need to make sure their tax affairs are in order - and would do well to remember that the sniff test matters too."
    },
    {
        "title": "Clashes break out at Palestine Action protest - as police make around 425 arrests",
        "description": "Clashes have broken out at a protest for Palestine Action in London as police reveal they have arrested more than 425 people. ",
        "url": "https://news.sky.com/story/arrests-made-at-protest-for-palestine-action-in-london-13426020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-action-demonstrators_7012952.jpg?20250906164728",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 12:22:00",
        "Headline": "The police said officers had been \"subjected to an exceptional level of abuse\" at the protest, including \"punches, kicks, spitting and objects being thrown\".",
        "Content": " Clashes have broken out at a protest for Palestine Action in London as police reveal they have arrested more than 425 people.  The Metropolitan Police said officers had been \"subjected to an exceptional level of abuse\" at the Westminster protest, including \"punches, kicks, spitting and objects being thrown\". It added some protesters had been both physically and verbally abusive in a \"coordinated effort to prevent officers carrying out their duties\", and that more than 25 of the arrests were made for assault. Officers were seen drawing their batons while demonstrators took action in support of the proscribed terror organisation. One man was seen with blood streaming down his face behind a barrier after being arrested, while the crowd was heard chanting \"shame on you\" and \"you're supporting genocide\". Tense scenes on the western side of Parliament Square saw several protesters fall over in a crush while water was thrown at officers. Deputy Assistant Commissioner, Claire Smart, who led the policing operation, said officers had been \"punched, kicked, spat on and had objects thrown at them\". \n                  Six charged with terror offences over support for Palestine Action\n                 \n                  Revealed: Huge rise in protests being dealt with by police\n                 \n                  Palestine Action: More than 60 people charged with showing support for proscribed group, police say\n                 She said the majority of protests, including the Palestine Coalition march, attended by around 20,000 people, \"passed with very few arrests\". But \"this was not the case at the protest organised by Defend Our Juries in support of the proscribed terrorist organisation Palestine Action\". \"The tactics deployed by supporters of Palestine Action in their attempt to overwhelm the justice system, as well as the level of violence seen in the crowd, required significant resource which took officers out of neighbourhoods to the detriment of the Londoners who rely on them,\" she said. First arrest after just 12 minutes The Met Police announced the first arrests of the day on X just 12 minutes after the protest's official start time. The protest's organiser, Defend Our Juries, said it estimated 1,500 had gathered for the rally, where many of them held signs saying: \"I oppose genocide. I support Palestine Action.\" In an update early on Saturday evening, the Met said: \"Any assaults against officers will not be tolerated and arrests have already been made. We will identify all those responsible and prosecute to the full extent of the law.\" It had warned before the protest that \"expressing support for a proscribed organisation is a criminal offence under the Terrorism Act\". \"Where our officers see offences, we will make arrests,\" it said. A spokesperson for Defend Our Juries claimed the rally had been \"the picture of peaceful protest\" and that the Met Police's statement about its officers being abused was an \"astonishing claim\". \"I've been here all day and I haven't seen any violence or aggression from anyone,\" they said. \"I've only seen aggression and violence from the police.\" Palestine Action has been banned as a terror group since 5 July after MPs voted overwhelmingly in favour of the move proposed by then-home secretary Yvette Cooper, making it illegal to express support for the group. Read more:Farage wants to deport women asylum seekers back to TalibanIsrael warns Gaza City residents to flee south to 'humanitarian area' The ban on the group came shortly after two Voyager aircraft suffered around £7m worth of damage at RAF Brize Norton in Oxfordshire on 20 June. More than 530 people were arrested at the last major demonstration against Palestine Action being banned as a terror group. However, the Met Police used \"street bail\" to avoid having to process them all in custody. Street bail allows officers to release suspects on bail before they are taken to a police station. The suspect receives a bail notice requiring them to return to a station at a future date instead. The organisers encouraged protesters not to accept street bail during today's demonstration, writing in a briefing document before they started: \"It will not be practically possible for the police to arrest 1,000 non-compliant people on the same day, and that is the strategic rationale behind non-compliance. It increases pressure on the state.\" In a reference to the advice in the briefing document, a Metropolitan Police spokesperson told Sky News the move would be \"misguided\". It faces a legal challenge in November after the High Court granted a full judicial review to Palestine Action co-founder Huda Ammori."
    },
    {
        "title": "Cable snapped in deadly Lisbon funicular crash, report finds",
        "description": "A report into the&#160;deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped.",
        "url": "https://news.sky.com/story/cable-snapped-in160deadly-lisbon-funicular-crash-report-finds-13426028",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-funicular-lisbon_7010493.jpg?20250903203010",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 13:09:00",
        "Headline": "The carriages had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\" and, even though both brakes were immediately applied, it \"had no effect in reducing the [top] vehicle's speed\".",
        "Content": " A report into the deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped. The carriages of the city's iconic Gloria funicular had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\". The vehicle's brake‑guard immediately \"activated the pneumatic brake as well as the manual brake\", the Office for the Prevention and Investigation of Aircraft Accidents and Railway Accidents said. But the measures \"had no effect in reducing the vehicle's speed\", as it accelerated and crashed at around 60kmh (37mph), and the disaster unfolded in less than 50 seconds. Questions have been asked about the maintenance of the equipment, but the report said that, based on the evidence seen so far, it was up to date. A scheduled visual inspection had been carried out on the morning of the accident, but the area where the cable broke \"is not visible without dismantling.\" The Gloria funicular is a national monument that dates from 1914 and is very popular with tourists visiting the Portuguese capital. It operates between Restauradores Square in downtown Lisbon and the Bairro Alto neighbourhood. The journey is just 276m (905ft) and takes just over a minute, but it operates up a steep hill, with two carriages travelling in opposite directions. How the disaster unfolded At around 6pm on Wednesday, Cabin No.2, at the bottom of the funicular, \"jerked backward sharply\", the report said. \"After moving roughly 10 metres, its movement stopped as it partially left the tracks and its trolley became buried at the lower end of the cable channel.\" Cabin No.1, at the top, \"continued descending and accelerated\" before derailing and smashing \"sideways into the wall of a building on the left side, destroying the wooden box [from which the carriage is constructed]\". It crashed into a cast‑iron streetlamp and a support pole, causing \"significant damage\" before hitting \"the corner of another building\". Cable failed at top Analysis of the wreckage showed the cable connecting the cabins failed where it was attached inside the upper trolley of cabin No.1 at the top. The cable's specified useful life is 600 days and at the time of the accident, it had been used for 337 days, leaving another 263 days before needing to be replaced. The operating company regards this life expectancy as having \"a significant safety margin\". The exact number of people aboard each cabin when it crashed has not been confirmed. Britons killed in disaster Kayleigh Smith, 36, and William Nelson, 44, died alongside 14 others in Wednesday's incident, including another British victim who has not yet been named. Read more on Sky News:Clashes at Palestine Action protestThe saint of the internet ageDonatella Versace among Armani mourners Five Portuguese citizens died when the packed carriage plummeted out of control - four of them workers at a charity on the hill - but most victims were foreigners."
    },
    {
        "title": "Harry wants to put 'trials and tribulations' behind him in first UK visit in months - but will he meet the King?",
        "description": "Prince Harry will carry out a rare public engagement outside of London this week, as he heads back to the UK for a visit with \"no negativity\".",
        "url": "https://news.sky.com/story/harry-wants-to-put-trials-and-tribulations-behind-him-in-first-uk-visit-in-months-but-will-he-meet-king-13426045",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-harry-sussex_6987649.jpg?20250810203012",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 23:01:00",
        "Headline": "The Duke of Sussex, who is no longer a working royal, is set to carry out a run of engagements and make a substantial donation to BBC Children in Need. ",
        "Content": " Prince Harry will carry out a rare public engagement outside of London this week, as he heads back to the UK for a visit with \"no negativity\". After a tumultuous five years, the Duke of Sussex and his team are hoping this may be a trip that can help begin to \"put the trials and tribulations behind them\" and herald a reset, according to sources close to the royal. It's been confirmed the duke will be in Nottingham on Tuesday, visiting a youth organisation that he's maintained strong personal contact with since moving to America. Harry, who is no longer a working royal, is set to carry out a run of engagements and make a substantial donation to BBC Children in Need to support work tackling violence affecting young people. It is not known if he will meet with his estranged brother, the Prince of Wales, or his father, the King. The King is currently in Balmoral with the Queen, and so far, no engagements have been announced for the couple this coming week. The monarch last met his youngest son face-to-face more than 18 months ago, when the duke made a transatlantic dash to see his father after hearing about his cancer diagnosis. The pair spent less than an hour together. Royal correspondent Harry's past visits to the UK, since stepping away from royal life, have often been shrouded in secrecy with any public moments taking place in London. This will also be the first time in a while that he isn't returning due to a court case. Sources close to Harry suggest that already means \"there is no negativity with this trip\" saying that \"Harry is really looking forward to coming back to do what he loves\", focusing on his charity work.  \"It's a moment to put the trials and tribulations of the last few years behind us,\" they added. But Harry and his team are well aware that there will be considerable interest in whether or not he will see his father, the King. Hopes of reconciliation and a potential meeting were ramped up earlier in the summer when members of Harry's team were photographed meeting with the King's communications secretary for the first time. Both sides aren't commenting on any possible contact between Harry and his father this week. \n When Harry arrives in London on Monday the King will be in Scotland, marking Queen Elizabeth's death and his Accession Day. But it's understood that Harry is due to be in the UK for most of the coming week. The strain in the relationship between father and son was emphasised by Harry in an interview he gave after he lost his legal challenge against the Home Office over his security. We also understand that his team have tried to \"pack in as much as possible\" in the coming days, with a number of private meetings and public visits to other organisations with which he has longstanding links.  We are told he will not be meeting lawyers.  Ultimately it appears that Prince Harry and his team are hoping this visit will have a different, more upbeat tone, compared to other recent trips to the UK, in what feels like a reset for the duke.\n It has been suggested that he may have wanted to make the trip longer but as he's \"financially responsible\" for the visit, including the travel and security bill for him and his team, his time here comes at a considerable cost. Read more:Harry's broken relationship with Royal Family - how did we get here?Harry and Meghan extend Netflix partnership Harry last visited the Community Recording Studio (CRS) in Nottingham's St Ann's area to mark World Mental Health Day in 2019, just two months before he and the Duchess of Sussex announced they were stepping down as senior working royals and moving to North America. He is planning to hold a private briefing with Children in Need, the Police and Crime Commission, the CRS and community outreach group Epic Partners in Nottingham, stage informal catch-ups with some of the young people he met before, and watch performances from CRS artists and make a short speech. Harry appears to be focusing on his philanthropic ventures while his wife, Meghan, works on her lifestyle brand, As Ever. She is not expected to join him on the trip to the UK. Senior aides to the King and the duke were pictured together in London this July in what was reported to be an initial step towards opening channels of communication between the two sides. Harry levelled repeated accusations at the King, Queen, William and Kate in his Oprah interview, Netflix documentary, and memoir Spare. But he outlined hopes for a \"reconciliation\" with his family in a BBC interview in May. His sit-down with the BBC came in the wake of a court battle over his security in the UK. His level of security was changed after the couple stepped down as senior royals. Harry took a legal challenge to the Court of Appeal, which he ultimately lost in May. He said he \"can’t see a world in which I would be bringing my wife and children back\" to the UK."
    },
    {
        "title": "Resident of Epping asylum hotel assaulted, say police, after reports of people throwing flares",
        "description": "A resident of a hotel housing asylum seekers has been assaulted, police say, after they responded to reports of people throwing firecrackers and flares outside the property. ",
        "url": "https://news.sky.com/story/resident-of-epping-asylum-hotel-assaulted-say-police-after-reports-of-people-throwing-flares-13426307",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bell-hotel-firecracker_7012537.png?20250906032625",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 18:37:00",
        "Headline": "Essex Police said the antisocial behaviour was not carried out by legitimate protesters and was a \"change from the peaceful protest we saw on Thursday and on many occasions before\".",
        "Content": "A resident of a hotel housing asylum seekers has been assaulted, police say, after they responded to reports of people throwing firecrackers and flares outside the property.  Officers were called to the Bell Hotel on Friday evening, where people were throwing smoke bombs. Essex Police said the antisocial behaviour was not carried out by legitimate protesters and was a \"change from the peaceful protect we saw on Thursday and on many occasions before\". Police also received reports a resident of the hotel was assaulted, and arrested a 49-year-old man from Harlow in connection with this. He remains in custody. One man was also issued with a Section 42 Notice yesterday evening, under the Criminal Justice and Police Act 2001. This is a legal power that allows police to direct someone to leave the area if their presence is believed to be causing alarm or distress. Chief Superintendent Simon Anslow said: \"I have seen reports that those living at the hotel were throwing flares - I have watched footage of the events yesterday and can say that this is categorically untrue. This is flagrant disinformation, the likes of which we have seen before, designed to cause trouble. \"In fact, flares were being lit and thrown by those purporting to protest, but there is a stark difference between criminal behaviour and those seeking to genuinely exercise their right to protest.\" He continued: \"Flares, firecrackers and smoke bombs are not peaceful. Assaulting those living at the hotel is not peaceful. Surrounding and intimidating people living in the hotel is not peaceful.\" A dispersal order was put in place on Friday evening, which gives officers the power to disperse anyone suspected of anti-social behaviour."
    },
    {
        "title": "Claims at Reform conference that vaccines gave royals cancer 'extremism', says Streeting",
        "description": "A vaccine-sceptic doctor has told the Reform UK conference that COVID vaccines contributed to cancer in the royal family - to criticisms of \"extremism\" from the health secretary and condemnation from experts.",
        "url": "https://news.sky.com/story/claims-at-reform-conference-that-vaccines-gave-royals-cancer-extremism-says-streeting-13426168",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-vaccination-porton-down_6242389.jpg?20240305213304",
        "type": "Home",
        "Author": "Tim Baker, political reporter, at Reform UK conference in Birmingham",
        "Date Published": "2025-09-06 15:58:00",
        "Headline": "Health Secretary Wes Streeting has denounced the claim made by Dr Aseem Malhotra. Buckingham Palace has been approached for comment.",
        "Content": "By Tim Baker, political reporter, at Reform UK conference in Birmingham  A vaccine-sceptic doctor has told the Reform UK conference that COVID vaccines contributed to cancer in the royal family - to criticisms of \"extremism\" from the health secretary and condemnation from experts. Dr Aseem Malhotra spent around a quarter of an hour presenting a series of claims on the main stage of the conference in Birmingham - with thousands present in the crowd. Dr Malhotra, who described himself as a friend of controversial US health secretary Robert F Kennedy Jr, said hundreds of studies showed the harms of mRNA vaccines. He went on to say that he agreed with another doctor that \"it's highly likely that the COVID vaccines have been a factor, a significant factor, in the cancer of members of the royal family.\" Politics latest: Starmer continues ministerial reshuffle Sky News has contacted Buckingham Palace for comment. The comments were met with silence from the audience in the room. Wes Streeting, the Labour MP and health secretary, was quick to criticise Dr Malhotra. He said: \"When we are seeing falling numbers of parents getting their children vaccinated, and a resurgence of disease we had previously eradicated, it is shockingly irresponsible for Nigel Farage to give a platform to these poisonous lies. \"Farage should apologise and sever all ties with this dangerous extremism.\" Read more:Inside the fight over vaccines in the USWhy are child vaccination rates the lowest in decade Blood Cancer UK's healthcare professional advisory panel, which is made up of specialists from across the UK, said: \"There are no controlled, large-scale studies (studies with the most robust scientific evidence) that demonstrate an increased cancer risk following COVID-19 vaccination.\" Brian Ferguson, a professor of viral immunology and the University of Cambridge, said: \"There is no credible evidence that these vaccines disrupt tumour suppressors or drive any kind of process - biochemical or otherwise - that results in cancer. \"It is particularly crass to try to link this pseudoscience to the unfortunate incidents of cancer in the royal family and is reminiscent of the 'died suddenly' trope which attempted - and ultimately failed - to link the death of any young person to their vaccination status. \"This kind of outlandish conspiracy theory only serves to undermine the credibility of those spreading it.\" Lord Bethell, the Conservative peer and former health minister, said: \"This [is] bad science, bad royal-watching and bad politics - the British public strongly support vaccines and resent people who try to hijack our much-loved royal family for promoting loopy ideas. \"Might work well with American donors, but this is a clanger for Reform UK's credibility. I hope they give up this rubbish.\" A spokesperson for Reform UK said: \"Dr Aseem Malhotra is a guest speaker with his own opinions who has an advisory role in the US government. Reform UK does not endorse what he said but does believe in free speech.\""
    },
    {
        "title": "Man killed in shark attack in Australia after screams of 'don't bite me' heard",
        "description": "A man killed by a shark in Australia has been named, as a witness described hearing screams of \"don't bite me\" moments before the fatal attack.",
        "url": "https://news.sky.com/story/dont-bite-me-man-dies-after-shark-attack-in-sydney-13425903",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mercury-psillakis-shark-attack_7012662.jpg?20250906103911",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-06 05:12:00",
        "Headline": "The last time a person in Sydney was killed in a shark attack was in February 2022 - which was the city's first fatal shark attack since 1963.",
        "Content": " A man killed by a shark in Australia has been named, as a witness described hearing screams of \"don't bite me\" moments before the fatal attack. Emergency services responded to reports that a man in his 50s had suffered critical injuries at Long Reef Beach, Sydney, shortly after 10am (1am in the UK) on Saturday. Authorities said that the man was brought to shore but died at the scene. The victim - named by Australian media as Mercury Psillakis - was married and had a young daughter, police said - with the incident happening a day before Father's Day in Australia. Two sections of a surfboard have been recovered and taken for examination, and beaches near the area are closed as drones search for the animal. Police are liaising with wildlife experts to determine the species of shark involved. Screams of 'don't bite me' heard by witness Speaking to Sky News Australia, witness Mark Morgenthal said he saw the attack and that the shark was one of the biggest he had ever seen. \"There was a guy screaming, 'I don't want to get bitten, I don't want to get bitten, don't bite me,' and I saw the dorsal fin of the shark come up, and it was huge,\" Mr Morgenthal said. \"Then I saw the tail fin come up and start kicking, and the distance between the dorsal fin and the tail fin looked to be about four metres, so it actually looked like a six-metre shark.\" Victim was a father and experienced surfer New South Wales Police Superintendent John Duncan said at a news conference that the victim was 57 years old, calling the incident a \"terrible tragedy\". \"The gentleman had gone out about 9.30 this morning with some of his friends, about five or six of his mates,\" he added. \"He's an experienced surfer that we understand. \"Unfortunately, it would appear that a large, what we believe to be a shark, has attacked him. And as a result of that, he lost a number of limbs. \"His colleagues managed to make it back to the beach safely, and a short time later, his body was found floating in the surf, and a couple of other people went out and recovered it.\" Mr Duncan added that officers \"understand he leaves behind a wife and a young daughter... and obviously tomorrow being Father's Day is particularly critical and particularly tragic\". Local surfer and eyewitness Bill Sakula also told reporters at the beach: \"It's going to send shockwaves through the community. \"Everyone is going to be a little bit nervous for a while.\" Read more:British couple killed in Lisbon funicular crash namedHow relationships can be rocked by serious illnessMandelson calls Trump a maverick 'risk taker' Surf Life Saving NSW has deployed a drone to search for further shark activity. Its chief executive Steve Pearce said: \"Our deepest condolences go to the family of the man involved in this terrible tragedy.\" Shark attacks are very rare, with this incident widely thought to be the first in New South Wales this year. The last time a person in Sydney was killed in a shark attack was in February 2022 - the city's first fatal shark attack since 1963."
    },
    {
        "title": "What if Romeo had a scar? Or Juliet a facial difference? The actors challenging screen conventions",
        "description": "Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too.",
        "url": "https://news.sky.com/story/what-if-romeo-had-a-scar-or-juliet-a-facial-difference-the-actors-challenging-screen-conventions-13425770",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-crystal-marshall-romeo-olukotun_7012443.jpg?20250906193903",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-06 18:00:00",
        "Headline": "From Bond to Batman to Star Wars, film and TV have used scars, burns and birthmarks as a shorthand for villainy for years - but could change be on the way?",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too. She told Sky News: \"Pre-cancer, and everything that happened I wasn't aware how people who had facial differences were villainised or victimised. \"Experiencing that, seeing the trauma, I've been so affected by people staring at me in the street, and hate comments about my appearance.\" She believes part of the problem is the screen portrayal of visibly different characters: \"There's a narrative in Hollywood, especially that's been going on for years, that people are not addressing and seeing that these are real people.\" Refusing to let her differences keep her from pursuing her dreams, Crystal studied acting at LAMDA, one of the UK's top drama schools. Now a professional actress, she knows her appearance will always be judged. \"[My visible difference] is on my face. I can't really hide anything. Every time I talk or enter a room, it's not like anyone's fault, I just know that people have that first perception or viewpoint of me.\" \n                  Former London's Burning actor John Alford guilty of sexually assaulting girls aged 14 and 15\n                 \n                  Ibiza lizards 'near extinction' due to invasive snakes and mounting litter\n                 \n                  Legendary fashion designer Giorgio Armani dies\n                 With aspirations to one day appear in a Marvel movie, she hopes her drive to perform will help others in the future. \"I didn't have anyone who looked like me as a role model… It would have just been so much better if I'd had that one person to look up to, to be inspired by.\" Lack of representation is not the only problem. When visible difference does make it onto the screen, misrepresentations and negative overtones often reinforce stigma. Nearly one in five people in the UK self-identifying as having a visible difference, such as a mark, scar or condition, according to charity Changing Faces. New research they conducted into the way disfigurement is portrayed on screen found that people with visible differences were over twice as likely to be shown as a victim or a villain than as a love interest. Film and television have used scars, burns and birthmarks as a shorthand for villainy across the genres for years. From Bond to Batman and Star Wars, to more family-friendly productions such as The Lion King. And while visibly different characters aren't common on screen, a woman with a physical difference in film or TV is even rarer. Author and entertainment journalist Kristen Lopez says it's because women's value on screen is so tied up with their sexuality. The author of Popcorn Disabilities: The Highs and Lows of Disabled Representation in the Movies has even come up with a term to describe the industry's attempt to keep their leading ladies \"sexy and beautiful\". \"You often see what I call 'pretty disabilities'. It's a disability that is not going to affect the physical perfection of the actress. And it will also allow for an A-list, usually non-disabled actress, to continue to play the character.\" Lopez says for that reason, films are more comfortable with portraying blind or visually impaired women, deaf women, or non-verbal women, because their disability \"doesn't mar the face\". Speaking from her own experience of growing up with brittle bone disease, she says: \"I worry about the next generation of disabled girls - what are they seeing? Do they feel represented? \"How do you navigate adolescence if you don't see anybody that looks like you doing the things that every other young person is doing?\" Romeo Olukotun was just one year old when an accident left him with second and third-degree burns on his torso, chest and neck. With his accident not spoken about at home, he admits, \"I just kind of had to deal with that on my own\". He did find some flashes of inspiration, including from singer Seal. \"I loved how even though he had a visible difference and scarring on his face, he wasn't looked down because of that. He was seen for his talent.\" With his confidence taking a hit due to his scars while at secondary school and university, he rebuilt his self-esteem as an adult through cheerleading. Later spotted at a music video shoot he'd gone along to with a friend, he's now an actor and model. But his visible differences have, at times, affected his casting. Romeo told Sky News: \"Because my scar on my neck looks like I've been stabbed, I would often be asked to 'Try this [performance] like a thug or someone who's on the streets'. And I didn't like being labelled as that. I'm someone who is much more than my scars.\" He's now a man on a mission: \"I want to be someone who shows other people with a visible difference that they can be anything. They can play the romantic lead, they can play a villain if they want to. They can be a hero, not just be labelled as someone sinister and evil, Machiavellian.\" While the film and TV industries might be slow to change, LAMDA vice principal Dr Philippa Strandberg-Long is hopeful for the future. \"We have to make our students aware of the industry that they are going into and not, I guess, create a utopia where they're not aware of the industry they're going into. However, we can change it from how we educate our students that come out. \"Things won't change overnight, but it will change over time. So, we have to put in the work at the grassroots, which is here.\" Changing Faces is the UK's leading charity for anyone with a visible difference. They have a confidential support and information line for anyone dealing with the impact of visible difference."
    },
    {
        "title": "Farage confirms he wants to deport women asylum seekers back to Taliban in Afghanistan",
        "description": "Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister.",
        "url": "https://news.sky.com/story/farage-confirms-he-wants-to-deport-women-back-to-taliban-in-afghanistan-13425996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7012717.png?20250906130251",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-06 11:22:00",
        "Headline": "Speaking to Sky News' political editor Beth Rigby, the Reform UK leader clarified his position on deporting asylum seekers back to the Taliban.",
        "Content": " Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister. The Reform UK leader's position on the topic has not been clear, with him previously saying he wouldn't send women back to the fundamentalist regime that took over after western militaries withdrew, before now saying he would. Mr Farage was speaking to Sky News' political editor Beth Rigby at the Reform UK party conference in Birmingham. Politics live: Govt responds to Farage wanting early election When asked if he would \"detain\" women and children and \"send them back\", the Clacton MP said \"yes\". Challenged on when he said in August that he was not \"discussing\" women and children, Mr Farage claimed this was a reference to his desire to see men detained on arrival in the UK. At the time, he said he was \"very, very clear\" on the \"deportation of illegal immigrants\", adding: \"We are not even discussing women and children at this stage - there are so many illegal males in Britain, and the news reports that said that after my conference yesterday were wrong\". Speaking today, Mr Farage claimed that the UK has a \"duty of care\" to a child if, for example, a four-year-old arrives in a dinghy - but not to women and men. \"For clarity, those that cross the English Channel will be detained and deported, men and women,\" Mr Farage went on. \"Children, we'll have to think about.\" Read more:Is Reform really now a government in waiting?Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences? 'No one' can prevent small boats crossing the Channel The Reform leader also rowed back on his pledge to stop all boats within two weeks if he is elected prime minister. Speaking to the conference yesterday, Mr Farage said: \"You cannot come here illegally and stay - we will stop the boats within two weeks of winning government.\" But speaking to Beth Rigby today, he changed tack - saying \"the passing of legislation\" would be required. He said only then would the boats be stopped within two weeks, or sooner In the interview with Rigby, Mr Farage tried to claim he did not say he would end the boats within two weeks of \"winning government\". But the video of his speech, as well as the transcript released by Reform UK, clearly show him saying: \"We will stop the boats within two weeks of winning government.\" When asked why he wouldn't be able to follow through with his initial claim, Mr Farage said it was impossible and that \"no one\" can prevent them crossing the Channel. The Reform UK leader said the law he wants to introduce will be called the Illegal Migration Act once it is passed by parliament. He confirmed his agenda includes leaving the European Convention on Human Rights, shutting down asylum hotels and housing people at RAF bases instead, as well as deporting Channel migrants.  Read more on Sky News:Flares thrown at migrant hotelLabour plans to overhaul 'broken' asylum systemMr Farage also claimed that deportation flights would also begin within two weeks of the law changing, and this combination of factors would stop people from wanting to travel from France. Political correspondent Nigel Farage insists his policy on mass deportations is clear when it comes to women and girls.\n But I've watched every Reform speech since they unveiled their flagship policy - and I was there in the room to ask him when he announced what he will do with women and children who come here via small boats if he was in power - and I still can't work it out.\n That's because he's said three different things since, including in an interview today.\n Originally he said everyone would be detained: \"Yes, women and children, everybody on arrival will be detained. And I've accepted already that how we deal with children is a much more complicated and difficult issue.\"\n A day later he said Reform is \"not even discussing women and children at this stage\" implying women and children would not be deported. \n He also said it was \"not true\" that's he had committed to sending women and girls back to countries where they can be raped, tortured and killed.\n But today at their conference he told Sky News that women who arrive by boat will be deported to Afghanistan \"if necessary\". \n Considering Reform UK say they are willing to make deals with Afghanistan and Syria, this question is an important one. The UK has not recognised the Taliban as a legitimate government of Afghanistan since the group seized Kabul in 2021 and first established a regime based on an extreme interpretation of Islamic law. \n Reform's deputy leader Richard Tice has defended those plans, saying: \"Sometimes you do deals with people you may not want to go down the pub with.\"\n Farage clarified that \"children, of course, we'll have to know that we're sending them off somewhere sensible\".\n He has also previously said asylum seekers were a threat to national security and to British women.\n The broader political issue though, is that Reform's immigration plan was meant to be a detailed and considered policy on an issue they've been ahead of other politicians on for years. \n So why aren't they more forthcoming with their answers on what they would do with women and children?\n If they had hoped to truly embody their conference slogan of \"next steps\" to professionalise the party, they need to urgently address this.\n But party members here don't seem to be bothered by this detail amongst the fireworks, the enthusiasm and the energy here.\n It turns out that years of banging on about this single issue for decades is Nigel Farage's greatest strength - and the public are willing to give him the grace to work out the details later down the line.\n This strategy all depends on Reform UK winning the next general election - which Labour does not have to call until 2029. However, the Reform leader says he believes the government will collapse in 2027 due to economic pressure and other factors. Reform are currently well clear of Labour and the Conservatives in the polling, and are targeting next year's Welsh, Scottish and English local elections to try and win more power in councils and national assemblies."
    },
    {
        "title": "Clashes break out at Palestine Action protest - as police make around 425 arrests",
        "description": "Clashes have broken out at a protest for Palestine Action in London as police reveal they have arrested more than 425 people. ",
        "url": "https://news.sky.com/story/arrests-made-at-protest-for-palestine-action-in-london-13426020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-action-demonstrators_7012952.jpg?20250906164728",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-06 12:22:00",
        "Headline": "The police said officers had been \"subjected to an exceptional level of abuse\" at the protest, including \"punches, kicks, spitting and objects being thrown\".",
        "Content": " Clashes have broken out at a protest for Palestine Action in London as police reveal they have arrested more than 425 people.  The Metropolitan Police said officers had been \"subjected to an exceptional level of abuse\" at the Westminster protest, including \"punches, kicks, spitting and objects being thrown\". It added some protesters had been both physically and verbally abusive in a \"coordinated effort to prevent officers carrying out their duties\", and that more than 25 of the arrests were made for assault. Officers were seen drawing their batons while demonstrators took action in support of the proscribed terror organisation. One man was seen with blood streaming down his face behind a barrier after being arrested, while the crowd was heard chanting \"shame on you\" and \"you're supporting genocide\". Tense scenes on the western side of Parliament Square saw several protesters fall over in a crush while water was thrown at officers. Deputy Assistant Commissioner, Claire Smart, who led the policing operation, said officers had been \"punched, kicked, spat on and had objects thrown at them\". \n                  Six charged with terror offences over support for Palestine Action\n                 \n                  Revealed: Huge rise in protests being dealt with by police\n                 \n                  Palestine Action: More than 60 people charged with showing support for proscribed group, police say\n                 She said the majority of protests, including the Palestine Coalition march, attended by around 20,000 people, \"passed with very few arrests\". But \"this was not the case at the protest organised by Defend Our Juries in support of the proscribed terrorist organisation Palestine Action\". \"The tactics deployed by supporters of Palestine Action in their attempt to overwhelm the justice system, as well as the level of violence seen in the crowd, required significant resource which took officers out of neighbourhoods to the detriment of the Londoners who rely on them,\" she said. First arrest after just 12 minutes The Met Police announced the first arrests of the day on X just 12 minutes after the protest's official start time. The protest's organiser, Defend Our Juries, said it estimated 1,500 had gathered for the rally, where many of them held signs saying: \"I oppose genocide. I support Palestine Action.\" In an update early on Saturday evening, the Met said: \"Any assaults against officers will not be tolerated and arrests have already been made. We will identify all those responsible and prosecute to the full extent of the law.\" It had warned before the protest that \"expressing support for a proscribed organisation is a criminal offence under the Terrorism Act\". \"Where our officers see offences, we will make arrests,\" it said. A spokesperson for Defend Our Juries claimed the rally had been \"the picture of peaceful protest\" and that the Met Police's statement about its officers being abused was an \"astonishing claim\". \"I've been here all day and I haven't seen any violence or aggression from anyone,\" they said. \"I've only seen aggression and violence from the police.\" Palestine Action has been banned as a terror group since 5 July after MPs voted overwhelmingly in favour of the move proposed by then-home secretary Yvette Cooper, making it illegal to express support for the group. Read more:Farage wants to deport women asylum seekers back to TalibanIsrael warns Gaza City residents to flee south to 'humanitarian area' The ban on the group came shortly after two Voyager aircraft suffered around £7m worth of damage at RAF Brize Norton in Oxfordshire on 20 June. More than 530 people were arrested at the last major demonstration against Palestine Action being banned as a terror group. However, the Met Police used \"street bail\" to avoid having to process them all in custody. Street bail allows officers to release suspects on bail before they are taken to a police station. The suspect receives a bail notice requiring them to return to a station at a future date instead. The organisers encouraged protesters not to accept street bail during today's demonstration, writing in a briefing document before they started: \"It will not be practically possible for the police to arrest 1,000 non-compliant people on the same day, and that is the strategic rationale behind non-compliance. It increases pressure on the state.\" In a reference to the advice in the briefing document, a Metropolitan Police spokesperson told Sky News the move would be \"misguided\". It faces a legal challenge in November after the High Court granted a full judicial review to Palestine Action co-founder Huda Ammori."
    },
    {
        "title": "Resident of Epping asylum hotel assaulted, say police, after reports of people throwing flares",
        "description": "A resident of a hotel housing asylum seekers has been assaulted, police say, after they responded to reports of people throwing firecrackers and flares outside the property. ",
        "url": "https://news.sky.com/story/resident-of-epping-asylum-hotel-assaulted-say-police-after-reports-of-people-throwing-flares-13426307",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bell-hotel-firecracker_7012537.png?20250906032625",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-06 18:37:00",
        "Headline": "Essex Police said the antisocial behaviour was not carried out by legitimate protesters and was a \"change from the peaceful protest we saw on Thursday and on many occasions before\".",
        "Content": "A resident of a hotel housing asylum seekers has been assaulted, police say, after they responded to reports of people throwing firecrackers and flares outside the property.  Officers were called to the Bell Hotel on Friday evening, where people were throwing smoke bombs. Essex Police said the antisocial behaviour was not carried out by legitimate protesters and was a \"change from the peaceful protect we saw on Thursday and on many occasions before\". Police also received reports a resident of the hotel was assaulted, and arrested a 49-year-old man from Harlow in connection with this. He remains in custody. One man was also issued with a Section 42 Notice yesterday evening, under the Criminal Justice and Police Act 2001. This is a legal power that allows police to direct someone to leave the area if their presence is believed to be causing alarm or distress. Chief Superintendent Simon Anslow said: \"I have seen reports that those living at the hotel were throwing flares - I have watched footage of the events yesterday and can say that this is categorically untrue. This is flagrant disinformation, the likes of which we have seen before, designed to cause trouble. \"In fact, flares were being lit and thrown by those purporting to protest, but there is a stark difference between criminal behaviour and those seeking to genuinely exercise their right to protest.\" He continued: \"Flares, firecrackers and smoke bombs are not peaceful. Assaulting those living at the hotel is not peaceful. Surrounding and intimidating people living in the hotel is not peaceful.\" A dispersal order was put in place on Friday evening, which gives officers the power to disperse anyone suspected of anti-social behaviour."
    },
    {
        "title": "What if Romeo had a scar? Or Juliet a facial difference? The actors challenging screen conventions",
        "description": "Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too.",
        "url": "https://news.sky.com/story/what-if-romeo-had-a-scar-or-juliet-a-facial-difference-the-actors-challenging-screen-conventions-13425770",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-crystal-marshall-romeo-olukotun_7012443.jpg?20250906193903",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-06 18:00:00",
        "Headline": "From Bond to Batman to Star Wars, film and TV have used scars, burns and birthmarks as a shorthand for villainy for years - but could change be on the way?",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too. She told Sky News: \"Pre-cancer, and everything that happened I wasn't aware how people who had facial differences were villainised or victimised. \"Experiencing that, seeing the trauma, I've been so affected by people staring at me in the street, and hate comments about my appearance.\" She believes part of the problem is the screen portrayal of visibly different characters: \"There's a narrative in Hollywood, especially that's been going on for years, that people are not addressing and seeing that these are real people.\" Refusing to let her differences keep her from pursuing her dreams, Crystal studied acting at LAMDA, one of the UK's top drama schools. Now a professional actress, she knows her appearance will always be judged. \"[My visible difference] is on my face. I can't really hide anything. Every time I talk or enter a room, it's not like anyone's fault, I just know that people have that first perception or viewpoint of me.\" \n                  Former London's Burning actor John Alford guilty of sexually assaulting girls aged 14 and 15\n                 \n                  Ibiza lizards 'near extinction' due to invasive snakes and mounting litter\n                 \n                  Legendary fashion designer Giorgio Armani dies\n                 With aspirations to one day appear in a Marvel movie, she hopes her drive to perform will help others in the future. \"I didn't have anyone who looked like me as a role model… It would have just been so much better if I'd had that one person to look up to, to be inspired by.\" Lack of representation is not the only problem. When visible difference does make it onto the screen, misrepresentations and negative overtones often reinforce stigma. Nearly one in five people in the UK self-identifying as having a visible difference, such as a mark, scar or condition, according to charity Changing Faces. New research they conducted into the way disfigurement is portrayed on screen found that people with visible differences were over twice as likely to be shown as a victim or a villain than as a love interest. Film and television have used scars, burns and birthmarks as a shorthand for villainy across the genres for years. From Bond to Batman and Star Wars, to more family-friendly productions such as The Lion King. And while visibly different characters aren't common on screen, a woman with a physical difference in film or TV is even rarer. Author and entertainment journalist Kristen Lopez says it's because women's value on screen is so tied up with their sexuality. The author of Popcorn Disabilities: The Highs and Lows of Disabled Representation in the Movies has even come up with a term to describe the industry's attempt to keep their leading ladies \"sexy and beautiful\". \"You often see what I call 'pretty disabilities'. It's a disability that is not going to affect the physical perfection of the actress. And it will also allow for an A-list, usually non-disabled actress, to continue to play the character.\" Lopez says for that reason, films are more comfortable with portraying blind or visually impaired women, deaf women, or non-verbal women, because their disability \"doesn't mar the face\". Speaking from her own experience of growing up with brittle bone disease, she says: \"I worry about the next generation of disabled girls - what are they seeing? Do they feel represented? \"How do you navigate adolescence if you don't see anybody that looks like you doing the things that every other young person is doing?\" Romeo Olukotun was just one year old when an accident left him with second and third-degree burns on his torso, chest and neck. With his accident not spoken about at home, he admits, \"I just kind of had to deal with that on my own\". He did find some flashes of inspiration, including from singer Seal. \"I loved how even though he had a visible difference and scarring on his face, he wasn't looked down because of that. He was seen for his talent.\" With his confidence taking a hit due to his scars while at secondary school and university, he rebuilt his self-esteem as an adult through cheerleading. Later spotted at a music video shoot he'd gone along to with a friend, he's now an actor and model. But his visible differences have, at times, affected his casting. Romeo told Sky News: \"Because my scar on my neck looks like I've been stabbed, I would often be asked to 'Try this [performance] like a thug or someone who's on the streets'. And I didn't like being labelled as that. I'm someone who is much more than my scars.\" He's now a man on a mission: \"I want to be someone who shows other people with a visible difference that they can be anything. They can play the romantic lead, they can play a villain if they want to. They can be a hero, not just be labelled as someone sinister and evil, Machiavellian.\" While the film and TV industries might be slow to change, LAMDA vice principal Dr Philippa Strandberg-Long is hopeful for the future. \"We have to make our students aware of the industry that they are going into and not, I guess, create a utopia where they're not aware of the industry they're going into. However, we can change it from how we educate our students that come out. \"Things won't change overnight, but it will change over time. So, we have to put in the work at the grassroots, which is here.\" Changing Faces is the UK's leading charity for anyone with a visible difference. They have a confidential support and information line for anyone dealing with the impact of visible difference."
    },
    {
        "title": "Unions demand no retreat on workers' rights after Rayner quits",
        "description": "Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet.",
        "url": "https://news.sky.com/story/unions-demand-no-retreat-on-workers-rights-after-rayner-quits-13426073",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-06 23:01:00",
        "Headline": "TUC chief Paul Nowak has warned ministers not to dilute the Employment Rights Bill which Angela Rayner, who departed the cabinet on Friday, has spearheaded. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet. As delegates gather in Brighton for the TUC's annual conference, the movement's leadership is claiming four million people - one in eight of the UK workforce - are in \"pervasive\" insecure work. And union bosses are urging the government to stand firm and reject attempts by Tories and Liberal Democrats to weaken the former deputy prime minister's Employment Rights Bill in its final stages in parliament. The TUC's general secretary, Paul Nowak, has claimed Ms Rayner, who resigned on Friday over unpaid stamp duty on a seaside flat, was a victim of misogyny and was being hounded out by right-wing politicians and right-wing media. As well as Ms Rayner leaving the government, the other minister driving the bill through parliament, Jonathan Reynolds, was demoted in Sir Keir Starmer's cabinet reshuffle from the senior post of business secretary to chief whip. Until last week, Ms Rayner had been expected to deliver the keynote Labour Party speech at the TUC on Tuesday, but it emerged midweek that the education secretary, Bridget Phillipson, would be the speaker. However, in Friday's reshuffle she lost responsibility for adult skills - a key issue for the unions - to the new work and pensions secretary Pat McFadden, who will now head a new, beefed-up super-ministry promoting growth. \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 And ironically, the TUC conference in Brighton is taking place less than two miles from the luxury seaside flat in Hove, on which Ms Rayner's avoidance of £40,000 in stamp duty led to her resignation as deputy PM, housing secretary and Labour deputy leader. Just before parliament's summer recess, the House of Lords backed by 304 votes to 160 a Tory-led amendment to Ms Rayner's bill to reduce the qualifying period for unfair dismissal claims from two years to six months, rather than from day one, as proposed by Ms Rayner.  Third reading of the bill in the Lords was last Wednesday, the day of Ms Rayner's Sky News confession, and the bill is now set for parliamentary ping-pong, assuming the government overturns the Lords' amendments in the Commons. But in a pre-conference interview with Sky News, TUC chief and Rayner supporter Mr Nowak demanded no diluting of her bill, which also includes banning zero hours contracts which exploit workers and fire and rehire. Read more:Despite her exit, Rayner remains a powerful forceWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time \"We are now at a crucial stage in the delivery of the Employment Rights Bill, just weeks away from Royal Assent,\" said Mr Nowak. \"And our clear message to the government will be to deliver the bill and deliver it in full. \"Ignore the amendments from the unelected peers, Tory and Lib Dem peers in the House of Lords, that are aimed at gutting the legislation, weakening workers' rights. \"Stand with the British public, deliver decent employment rights. That's important in workplaces up and down the country, but it's important because these are proposals that are popular with the British public as well.\" The TUC says its analysis shows low-paid jobs in occupations such as the care, leisure and service sectors account for 77% of the increase in insecure jobs since 2011. Black and ethnic minority ethnic workers account for 70% of the explosion in insecure work, according to the TUC, and southwest England and Yorkshire and Humber are insecure work hotspots. Mr Nowak told Sky News: \"We've got well over a million people now on zero-hours contracts. We've got millions of people who don't have sick pay from day one and 70% of the kids who live in poverty have parents who go out to work. \"The government is absolutely right to be focused on making work pay. And the Employment Rights Bill is about putting more money in the pockets of working people, giving people more security at work. \"That's good for workers, but it's also good for good employers as well, so they're not undercut by the cowboys.\" Speaking to Sky News last Wednesday, shortly after Ms Rayner's tearful confession to Sky's political editor Beth Rigby, Mr Nowak said: \"There's a real heavy dose of misogyny when it comes to Angela. \"Angela Rayner is playing a really important role in government and I wouldn't want to see her hounded out of an important role by right-wing politicians and the right-wing media, who frankly can't handle the fact that a working-class woman is our deputy prime minister.\""
    },
    {
        "title": "Harry wants to put 'trials and tribulations' behind him in first UK visit in months - but will he meet the King?",
        "description": "Prince Harry will carry out a rare public engagement outside of London this week, as he heads back to the UK for a visit with \"no negativity\".",
        "url": "https://news.sky.com/story/harry-wants-to-put-trials-and-tribulations-behind-him-in-first-uk-visit-in-months-but-will-he-meet-king-13426045",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-harry-sussex_6987649.jpg?20250810203012",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-06 23:01:00",
        "Headline": "The Duke of Sussex, who is no longer a working royal, is set to carry out a run of engagements and make a substantial donation to BBC Children in Need. ",
        "Content": " Prince Harry will carry out a rare public engagement outside of London this week, as he heads back to the UK for a visit with \"no negativity\". After a tumultuous five years, the Duke of Sussex and his team are hoping this may be a trip that can help begin to \"put the trials and tribulations behind them\" and herald a reset, according to sources close to the royal. It's been confirmed the duke will be in Nottingham on Tuesday, visiting a youth organisation that he's maintained strong personal contact with since moving to America. Harry, who is no longer a working royal, is set to carry out a run of engagements and make a substantial donation to BBC Children in Need to support work tackling violence affecting young people. It is not known if he will meet with his estranged brother, the Prince of Wales, or his father, the King. The King is currently in Balmoral with the Queen, and so far, no engagements have been announced for the couple this coming week. The monarch last met his youngest son face-to-face more than 18 months ago, when the duke made a transatlantic dash to see his father after hearing about his cancer diagnosis. The pair spent less than an hour together. Royal correspondent Harry's past visits to the UK, since stepping away from royal life, have often been shrouded in secrecy with any public moments taking place in London. This will also be the first time in a while that he isn't returning due to a court case. Sources close to Harry suggest that already means \"there is no negativity with this trip\" saying that \"Harry is really looking forward to coming back to do what he loves\", focusing on his charity work.  \"It's a moment to put the trials and tribulations of the last few years behind us,\" they added. But Harry and his team are well aware that there will be considerable interest in whether or not he will see his father, the King. Hopes of reconciliation and a potential meeting were ramped up earlier in the summer when members of Harry's team were photographed meeting with the King's communications secretary for the first time. Both sides aren't commenting on any possible contact between Harry and his father this week. \n When Harry arrives in London on Monday the King will be in Scotland, marking Queen Elizabeth's death and his Accession Day. But it's understood that Harry is due to be in the UK for most of the coming week. The strain in the relationship between father and son was emphasised by Harry in an interview he gave after he lost his legal challenge against the Home Office over his security. We also understand that his team have tried to \"pack in as much as possible\" in the coming days, with a number of private meetings and public visits to other organisations with which he has longstanding links.  We are told he will not be meeting lawyers.  Ultimately it appears that Prince Harry and his team are hoping this visit will have a different, more upbeat tone, compared to other recent trips to the UK, in what feels like a reset for the duke.\n It has been suggested that he may have wanted to make the trip longer but as he's \"financially responsible\" for the visit, including the travel and security bill for him and his team, his time here comes at a considerable cost. Read more:Harry's broken relationship with Royal Family - how did we get here?Harry and Meghan extend Netflix partnership Harry last visited the Community Recording Studio (CRS) in Nottingham's St Ann's area to mark World Mental Health Day in 2019, just two months before he and the Duchess of Sussex announced they were stepping down as senior working royals and moving to North America. He is planning to hold a private briefing with Children in Need, the Police and Crime Commission, the CRS and community outreach group Epic Partners in Nottingham, stage informal catch-ups with some of the young people he met before, and watch performances from CRS artists and make a short speech. Harry appears to be focusing on his philanthropic ventures while his wife, Meghan, works on her lifestyle brand, As Ever. She is not expected to join him on the trip to the UK. Senior aides to the King and the duke were pictured together in London this July in what was reported to be an initial step towards opening channels of communication between the two sides. Harry levelled repeated accusations at the King, Queen, William and Kate in his Oprah interview, Netflix documentary, and memoir Spare. But he outlined hopes for a \"reconciliation\" with his family in a BBC interview in May. His sit-down with the BBC came in the wake of a court battle over his security in the UK. His level of security was changed after the couple stepped down as senior royals. Harry took a legal challenge to the Court of Appeal, which he ultimately lost in May. He said he \"can’t see a world in which I would be bringing my wife and children back\" to the UK."
    },
    {
        "title": "Cable snapped in deadly Lisbon funicular crash, report finds",
        "description": "A report into the&#160;deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped.",
        "url": "https://news.sky.com/story/cable-snapped-in160deadly-lisbon-funicular-crash-report-finds-13426028",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-funicular-lisbon_7010493.jpg?20250903203010",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-06 13:09:00",
        "Headline": "The carriages had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\" and, even though both brakes were immediately applied, it \"had no effect in reducing the [top] vehicle's speed\".",
        "Content": " A report into the deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped. The carriages of the city's iconic Gloria funicular had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\". The vehicle's brake‑guard immediately \"activated the pneumatic brake as well as the manual brake\", the Office for the Prevention and Investigation of Aircraft Accidents and Railway Accidents said. But the measures \"had no effect in reducing the vehicle's speed\", as it accelerated and crashed at around 60kmh (37mph), and the disaster unfolded in less than 50 seconds. Questions have been asked about the maintenance of the equipment, but the report said that, based on the evidence seen so far, it was up to date. A scheduled visual inspection had been carried out on the morning of the accident, but the area where the cable broke \"is not visible without dismantling.\" The Gloria funicular is a national monument that dates from 1914 and is very popular with tourists visiting the Portuguese capital. It operates between Restauradores Square in downtown Lisbon and the Bairro Alto neighbourhood. The journey is just 276m (905ft) and takes just over a minute, but it operates up a steep hill, with two carriages travelling in opposite directions. How the disaster unfolded At around 6pm on Wednesday, Cabin No.2, at the bottom of the funicular, \"jerked backward sharply\", the report said. \"After moving roughly 10 metres, its movement stopped as it partially left the tracks and its trolley became buried at the lower end of the cable channel.\" Cabin No.1, at the top, \"continued descending and accelerated\" before derailing and smashing \"sideways into the wall of a building on the left side, destroying the wooden box [from which the carriage is constructed]\". It crashed into a cast‑iron streetlamp and a support pole, causing \"significant damage\" before hitting \"the corner of another building\". Cable failed at top Analysis of the wreckage showed the cable connecting the cabins failed where it was attached inside the upper trolley of cabin No.1 at the top. The cable's specified useful life is 600 days and at the time of the accident, it had been used for 337 days, leaving another 263 days before needing to be replaced. The operating company regards this life expectancy as having \"a significant safety margin\". The exact number of people aboard each cabin when it crashed has not been confirmed. Britons killed in disaster Kayleigh Smith, 36, and William Nelson, 44, died alongside 14 others in Wednesday's incident, including another British victim who has not yet been named. Read more on Sky News:Clashes at Palestine Action protestThe saint of the internet ageDonatella Versace among Armani mourners Five Portuguese citizens died when the packed carriage plummeted out of control - four of them workers at a charity on the hill - but most victims were foreigners."
    },
    {
        "title": "Nigel Farage admits he made a mistake over house ownership after a week that proves how much details matter",
        "description": "It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle.",
        "url": "https://news.sky.com/story/nigel-farage-admits-he-made-a-mistake-over-house-ownership-after-a-week-that-proves-how-much-details-matter-13426302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7013125.png?20250906201103",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-06 18:13:00",
        "Headline": "There is no suggestion that the Reform UK leader did anything wrong, but he admits he misspoke last year when he said he bought a house in his Clacton constituency, when it was purchased by his partner.",
        "Content": "\n          Political editor\n              @BethRigby\n  It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle. The massive Westminster news on Friday meant Mr Farage had to move his speech to avoid a clash with the prime minister's reshuffle, as many a journalist like me dashed back to London to pick up an even bigger story than Mr Farage - not something he's that used to these days, after a summer of nearly back-to-back coverage of his insurgent party and its policies. But the news about Ms Rayner both detracted from and put the spotlight on him when it came to his own tax affairs. Politics latest - reshuffle continues The Labour-backing Mirror newspaper published a story calling Mr Farage a \"hypocrite\" for criticising Ms Rayner when he also had questions to answer. Because while Ms Rayner resigned after admitting she did not pay enough tax  on a home she bought in Hove, East Sussex, Mr Farage was also under scrutiny for saying he had bought his house in Clacton, when in fact he had not. Last November, Mr Farage told Sky News he \"just exchanged contracts on the house. I've bought a house in Clacton\". But in fact, Mr Farage, who owns multiple properties, hadn't bought a house at all. It was his partner who bought the house, and in doing so, only paid standard stamp duty as it is her main home. Had Mr Farage bought the house, he'd have been liable for an additional £44,000 in tax as a second home purchase.  There is no suggestion that Mr Farage did anything wrong, but he did misspeak and he used the house purchase in Clacton last November to deflect against accusations that he wasn't invested in his constituency and didn't spend any time there. He admitted to me that he made a mistake when he said it was his property. He said he \"shouldn't have said 'I', I should have said 'we'. It's her money. It's her asset. I own none of it. But I just happen to spend some time there\".  His admission comes after the Reform UK leader was challenged earlier this year over whether the property had been bought in his partner's name in a way that allowed him legally to avoid higher-rate stamp duty - a charge he roundly rejects. But it also seems that voters reject deputy party leader Richard Tice's assertion that Mr Farage's tax affairs were \"irrelevant\". Angela Rayner's forced resignation because of her own failures on tax compliance shows that these matters, particularly at a time when the government is asking voters to pay even more tax, are very pertinent. Read more on Sky News:Who's in, who's out in reshuffleRayner graffiti removedWhat a time to become home secretary Unlike Angela Rayner, no one is suggesting Mr Farage has broken any rules or owes any underpaid tax to HMRC. But the lesson of this very long week in politics is that all politicians need to make sure their tax affairs are in order - and would do well to remember that the sniff test matters too."
    },
    {
        "title": "Cable snapped in deadly Lisbon funicular crash, report finds",
        "description": "A report into the&#160;deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped.",
        "url": "https://news.sky.com/story/cable-snapped-in160deadly-lisbon-funicular-crash-report-finds-13426028",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-funicular-lisbon_7010493.jpg?20250903203010",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-06 13:09:00",
        "Headline": "The carriages had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\" and, even though both brakes were immediately applied, it \"had no effect in reducing the [top] vehicle's speed\".",
        "Content": " A report into the deadly Lisbon Gloria funicular crash has said the cable linking the two carriages snapped. The carriages of the city's iconic Gloria funicular had travelled no more than six metres when they \"suddenly lost the balancing force of the connecting cable\". The vehicle's brake‑guard immediately \"activated the pneumatic brake as well as the manual brake\", the Office for the Prevention and Investigation of Aircraft Accidents and Railway Accidents said. But the measures \"had no effect in reducing the vehicle's speed\", as it accelerated and crashed at around 60kmh (37mph), and the disaster unfolded in less than 50 seconds. Questions have been asked about the maintenance of the equipment, but the report said that, based on the evidence seen so far, it was up to date. A scheduled visual inspection had been carried out on the morning of the accident, but the area where the cable broke \"is not visible without dismantling.\" The Gloria funicular is a national monument that dates from 1914 and is very popular with tourists visiting the Portuguese capital. It operates between Restauradores Square in downtown Lisbon and the Bairro Alto neighbourhood. The journey is just 276m (905ft) and takes just over a minute, but it operates up a steep hill, with two carriages travelling in opposite directions. How the disaster unfolded At around 6pm on Wednesday, Cabin No.2, at the bottom of the funicular, \"jerked backward sharply\", the report said. \"After moving roughly 10 metres, its movement stopped as it partially left the tracks and its trolley became buried at the lower end of the cable channel.\" Cabin No.1, at the top, \"continued descending and accelerated\" before derailing and smashing \"sideways into the wall of a building on the left side, destroying the wooden box [from which the carriage is constructed]\". It crashed into a cast‑iron streetlamp and a support pole, causing \"significant damage\" before hitting \"the corner of another building\". Cable failed at top Analysis of the wreckage showed the cable connecting the cabins failed where it was attached inside the upper trolley of cabin No.1 at the top. The cable's specified useful life is 600 days and at the time of the accident, it had been used for 337 days, leaving another 263 days before needing to be replaced. The operating company regards this life expectancy as having \"a significant safety margin\". The exact number of people aboard each cabin when it crashed has not been confirmed. Britons killed in disaster Kayleigh Smith, 36, and William Nelson, 44, died alongside 14 others in Wednesday's incident, including another British victim who has not yet been named. Read more on Sky News:Clashes at Palestine Action protestThe saint of the internet ageDonatella Versace among Armani mourners Five Portuguese citizens died when the packed carriage plummeted out of control - four of them workers at a charity on the hill - but most victims were foreigners."
    },
    {
        "title": "France on brink of economic and political crisis as PM looks set to lose confidence vote",
        "description": "France is facing the possibility of having its fifth prime minister in less than two years, an economic crisis and the threat of further civil unrest if a parliamentary deadlock isn't resolved in the coming days.",
        "url": "https://news.sky.com/story/france-on-brink-of-economic-and-political-crisis-as-pm-looks-set-to-lose-confidence-vote-13426347",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-emmanuel-macron-francois-bayrou_7013095.jpg?20250906190900",
        "type": "World",
        "Author": "Alastair Bunkall, Europe correspondent",
        "Date Published": "2025-09-06 23:00:00",
        "Headline": "Francois Bayrou may be forced out of the role he has only held since December if, as expected, he loses Monday's vote, a scenario that could have dire consequences for the French economy and President Emmanuel Macron.",
        "Content": "By Alastair Bunkall, Europe correspondent   France is facing the possibility of having its fifth prime minister in less than two years, an economic crisis and the threat of further civil unrest if a parliamentary deadlock isn't resolved in the coming days. French MPs will debate a vote of no confidence in the country's current prime minister, Francois Bayrou, on Monday afternoon. If, as expected, he loses, it will deepen the country's economic and political malaise and could even put the future of Emmanuel Macron's presidency in doubt. Mr Bayrou, a 74-year-old political veteran only in office since December, has proposed a drastic budget making around £40bn in savings, including cutting two of the country's annual public holidays. This has been met by considerable opposition and even anger among the French public, even though Mr Bayrou and economists in Europe have warned that the EU's second-largest economy faces a Greek-style debt crisis if it doesn't act urgently. Mr Bayrou called the unexpected confidence vote last month, hoping to boost his legitimacy and get his highly controversial economic package passed. The Socialist Party is expected to join forces with its natural enemies in the far-right National Rally to oppose the prime minister. \n                  Trump brokers Putin and Zelenskyy meeting\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 \n                  Nigel Farage hits back at Emmanuel Macron after French president sparks fresh Brexit row\n                 Celine Thiebault-Martinez, a Socialist Party MP, said Mr Bayrou's budget \"once again penalises the most vulnerable, working-class families and ordinary workers\". Her party's alternative budget would make half the savings Mr Bayrou wants and would pay back the huge state debt over a longer period. Ms Thiebault-Martinez doesn't believe they can be persuaded to back the prime minister on Monday. \"They wave the IMF flag, saying we'll soon be under supervision like Greece once was, but those are false arguments; they're made to scare.\" But the figures don't support her opinion. France hasn't balanced a budget since 1974. Its debt to GDP ratio is now the third highest in Europe, only better than Greece and Italy, and the country spends more servicing its debt every year than it does on either defence or education. National Rally, the far-right party of Marine Le Pen rising in national polls, favours holding fresh parliamentary elections, confident they will increase their share of MPs in the Assembly, putting them into a position of greater power. They see Monday's vote as a chance to punish Mr Macron. National Rally MP Gaetan Dussaussaye said \"for eight years now [since Mr Macron was elected] it's always been the same recipe: More rules, more taxes, preventing the French economy from working and moving forward\".But the far-right party is vague when asked what its alternative plan to reform the country's economy would be. \"What we want is a complete change in how the economy is managed in France. That means giving the power back to the French people to decide,\" he said.  Assuming Mr Bayrou loses Monday's vote and the government falls, he will stay in office temporarily while the president works out what to do next. Mr Macron will be faced with only difficult choices; call new elections to try to re-establish a majority, appoint yet another new prime minister in the hope they can succeed where the previous four have failed, or even stand down himself, something he has repeatedly ruled out despite growing calls for him to go. Nicolas Gaudin, owner of CMO, a company making parts for the car and aviation industry, based in National Rally's northern France heartland, said he is torn. He wants - and needs - some economic certainty and without immediate reforms, his company could go bust by the end of the year, but for him, Mr Bayrou's policies undermine the social considerations that \"make France a wonderful country\". He said: \"Our clients, major companies in the aeronautics and automotive industries, are cutting their maintenance and industrialisation costs and that directly impacts our requests and orders. \"We have no visibility at the moment. Back in June, we told ourselves that things would pick up in September, but here we are in September, and we still don't have any more information.\" For his small workforce on the factory floor, it's more straightforward - they feel long abandoned by the traditional political classes. Alexandre Bocquet said the whole political system \"needs redoing from scratch\" \"We don't feel represented. When it comes to purchasing power or work, we feel completely abandoned,\" he adds. Read more on Sky News:Cable snapped in deadly funicular crashThe saint of the internet ageDonatella Versace among Armani mourners It's this sentiment that has made Le Pen's National Rally party the favourite to win the presidency at the next elections in 2027, if not sooner. Many hold Mr Macron responsible for the crisis after he called snap elections in June 2024 which led to a hung parliament and a deeply fractured lower chamber unable to agree on much. A day of civil action has been called for next Wednesday. It's unclear how widespread it will be, but organisers are hoping businesses will shut down and major roads blocked."
    },
    {
        "title": "Israel warns Gaza City residents to flee to 'humanitarian area' - as another tower is bombed",
        "description": "Any remaining residents in Gaza's largest city should leave for a designated area in the south, Israel's military warned, before bombing a high-rise tower.",
        "url": "https://news.sky.com/story/israel-warns-gaza-city-residents-to-flee-south-to-humanitarian-area-13425948",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-gaza-city-susi_7012736.jpg?20250906132612",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-06 08:12:00",
        "Headline": "As Israel's offensive on Gaza City continues, the military has now declared what it calls a humanitarian zone in the south. Residents should flee to safety there, a spokesperson has said, as some Gazans endure a crisis in food and medical care.",
        "Content": " Any remaining residents in Gaza's largest city should leave for a designated area in the south, Israel's military warned, before bombing a high-rise tower. Israeli forces are carrying out an offensive on the suburbs of Gaza City, in the territory's north, as part of plans to capture it - raising concerns over a growing humanitarian crisis. While Prime Minister Benjamin Netanyahu has faced pressure to stop the attack and allow more aid in, the military has announced a new humanitarian zone in the south. Spokesperson Avichay Adraee said Gaza City residents should head to a designated coastal area of Khan Younis, where, he said, they would be able to receive food, medical care and shelter. Within hours, Israel had bombed a high-rise tower in Gaza City, claiming it was being used by Hamas, though it did not provide evidence. Israel's Defence Minister Israel Katz shared a video of what appeared to be the building collapsing after the strike, which comes the day after a separate building was bombed. It is not immediately clear if there are any casualties. Before the strike, health authorities in the Hamas-run territory reported at least 23 Palestinians have been killed on Saturday, including at least 13 in the Gaza City area. On Thursday, Israel said it has control of around 40% of Gaza City and 75% of the entire territory of Gaza. Many of the city's residents had already been displaced earlier in the war, only to return later. Some of them have said they will refuse to move again. That's despite the military claiming it is within a few kilometres of the city centre, coming after weeks of heavy strikes. But the war in Gaza has left Israel increasingly isolated in the diplomatic sphere, with some of its closest allies condemning the campaign that's devastated the territory. Just two weeks ago, a famine was declared in Gaza City and surrounding areas by the Integrated Food Security Phase Classification, a globally recognised system for classifying the severity of food insecurity. There is also concern within Israel, where calls have grown to stop the war and secure the release of the remaining 48 hostages. Israel believes 20 of those hostages are still alive. Even as relatives of those hostages lead protests, Mr Netanyahu continues to push for an all-or-nothing deal to release all hostages and defeat Hamas. Read more:Israel strikes high-rise building in Gaza CityWest Bank family describe daily harassment On Friday, Donald Trump said Washington is in \"very deep\" negotiations with Hamas to release the captives. \"We said let them all out, right now let them all out. And much better things will happen for them but if you don't let them all out, it's going to be a tough situation, it's going to be nasty,\" he added. Hamas is \"asking for some things that are fine\", he said, without elaborating."
    },
    {
        "title": "Man killed in shark attack in Australia after screams of 'don't bite me' heard",
        "description": "A man killed by a shark in Australia has been named, as a witness described hearing screams of \"don't bite me\" moments before the fatal attack.",
        "url": "https://news.sky.com/story/dont-bite-me-man-dies-after-shark-attack-in-sydney-13425903",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mercury-psillakis-shark-attack_7012662.jpg?20250906103911",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-06 05:12:00",
        "Headline": "The last time a person in Sydney was killed in a shark attack was in February 2022 - which was the city's first fatal shark attack since 1963.",
        "Content": " A man killed by a shark in Australia has been named, as a witness described hearing screams of \"don't bite me\" moments before the fatal attack. Emergency services responded to reports that a man in his 50s had suffered critical injuries at Long Reef Beach, Sydney, shortly after 10am (1am in the UK) on Saturday. Authorities said that the man was brought to shore but died at the scene. The victim - named by Australian media as Mercury Psillakis - was married and had a young daughter, police said - with the incident happening a day before Father's Day in Australia. Two sections of a surfboard have been recovered and taken for examination, and beaches near the area are closed as drones search for the animal. Police are liaising with wildlife experts to determine the species of shark involved. Screams of 'don't bite me' heard by witness Speaking to Sky News Australia, witness Mark Morgenthal said he saw the attack and that the shark was one of the biggest he had ever seen. \"There was a guy screaming, 'I don't want to get bitten, I don't want to get bitten, don't bite me,' and I saw the dorsal fin of the shark come up, and it was huge,\" Mr Morgenthal said. \"Then I saw the tail fin come up and start kicking, and the distance between the dorsal fin and the tail fin looked to be about four metres, so it actually looked like a six-metre shark.\" Victim was a father and experienced surfer New South Wales Police Superintendent John Duncan said at a news conference that the victim was 57 years old, calling the incident a \"terrible tragedy\". \"The gentleman had gone out about 9.30 this morning with some of his friends, about five or six of his mates,\" he added. \"He's an experienced surfer that we understand. \"Unfortunately, it would appear that a large, what we believe to be a shark, has attacked him. And as a result of that, he lost a number of limbs. \"His colleagues managed to make it back to the beach safely, and a short time later, his body was found floating in the surf, and a couple of other people went out and recovered it.\" Mr Duncan added that officers \"understand he leaves behind a wife and a young daughter... and obviously tomorrow being Father's Day is particularly critical and particularly tragic\". Local surfer and eyewitness Bill Sakula also told reporters at the beach: \"It's going to send shockwaves through the community. \"Everyone is going to be a little bit nervous for a while.\" Read more:British couple killed in Lisbon funicular crash namedHow relationships can be rocked by serious illnessMandelson calls Trump a maverick 'risk taker' Surf Life Saving NSW has deployed a drone to search for further shark activity. Its chief executive Steve Pearce said: \"Our deepest condolences go to the family of the man involved in this terrible tragedy.\" Shark attacks are very rare, with this incident widely thought to be the first in New South Wales this year. The last time a person in Sydney was killed in a shark attack was in February 2022 - the city's first fatal shark attack since 1963."
    },
    {
        "title": "Former pilot who tried to cut plane engines after taking magic mushrooms pleads guilty",
        "description": "A former pilot who tried to turn off a plane's engines while riding off-duty on magic mushrooms has pleaded guilty to interfering with a flight crew.",
        "url": "https://news.sky.com/story/former-pilot-who-tried-to-cut-plane-engines-after-taking-magic-mushrooms-pleads-guilty-13425989",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-joseph-emerson-plane_7012737.jpg?20250906132842",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-06 10:55:00",
        "Headline": "Joseph Emerson told police he was upset over a friend's recent death, had taken magic mushrooms about two days before he was due to ride in the cockpit, and had not slept in over 40 hours.",
        "Content": "A former pilot who tried to turn off a plane's engines while riding off-duty on magic mushrooms has pleaded guilty to interfering with a flight crew. Joseph Emerson, a former Alaska Airlines pilot, was sitting in the spare seat of the cockpit of Horizon Air flight 2059 from Everett to San Francisco when he tried to cut the engines in 2023. The two pilots flying stopped him from doing so, and the plane was then diverted to Portland, where it landed safely with 84 people on board. After his arrest, Emerson told police he was upset over a friend's recent death, had taken psilocybin - commonly known as magic mushrooms - about two days earlier, and had not slept in over 40 hours. The off-duty pilot, of Pleasant Hill, California, was charged in federal court with interfering with a flight crew. Separately, a state indictment in Oregon charged him with 83 counts of endangering another person and one count of endangering an aircraft. He has now pleaded guilty to the federal count and no-contest - which carries the same legal effect as a guilty plea - to the state charges. 'What happened was wrong' Speaking to the court on Friday, Emerson said he had no intention of harming anyone, but accepted \"I still made the decision to take psilocybin, and that led to my inability to determine that I was operating in reality for an extended period of time\". \"That doesn't make this right,\" he said. \"What happened was wrong and should not have happened, and I bear the responsibility for that.\" According to Sky's US partner network NBC News, one of the pilots also told investigators that Emerson said \"I'm not okay\" before he reached for the red fire suppression handles - which would have cut off fuel to the engines. Multnomah County deputy district attorney Eric Pickard said in a written statement on Friday that what \"Joseph Emerson did was reckless, selfish, and criminal\". \"We should remember how close he came to ruining the lives of not just the 84 people aboard Flight 2059, but all of their family members and friends as well,\" he added. Typically, off-duty airline pilots sit in the jump seat of the flight deck behind the pilots to fly back to their home base if seats are available. Read more from Sky News:Man killed in shark attack in SydneyIsrael warns Gaza City residents to flee to 'humanitarian area'Flares thrown at migrant hotel As part of a plea agreement for the state charges, Emerson was sentenced to 50 days in jail - which he has already served - five years on probation, 664 hours of community service and $60,569 (£44,840) in restitution. He still faces sentencing for the federal charge of interfering with a flight crew, which carries a maximum sentence of 20 years in prison. Emerson is set to appear in court for federal sentencing on 17 November."
    },
    {
        "title": "Donatella Versace among mourners as Giorgio Armani lies in state",
        "description": "Donatella Versace has joined scores of mourners in Milan to pay respects to legendary fashion designer Giorgio Armani as his body lies in state.",
        "url": "https://news.sky.com/story/donatella-versace-among-mourners-as-giorgio-armani-lies-in-state-13425995",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donatella-versace-giorgio-armani_7012702.jpg?20250906122712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-06 11:19:00",
        "Headline": "Members of the public have stood in lengthy queues to pay their respects to the legendary fashion designer, who died on Thursday at the age of 91.",
        "Content": "Donatella Versace has joined scores of mourners in Milan to pay respects to legendary fashion designer Giorgio Armani as his body lies in state. The Italian billionaire died at home surrounded by his family on Thursday at the age of 91. Fellow fashion icon Ms Versace, 70, wore a dark skirt suit and left a bouquet of white flowers when she visited the Armani Theatre to pay tribute on Saturday, where the casket of Mr Armani lies surrounded by candles. Other notable attendees included Milan mayor Giuseppe Sala, who was among the first to arrive, along with film directors Gabriele Salvatores and Giuseppe Tornatore, Angela Missoni; daughter of late Italian designer Rosita Missoni; and other high-end designers and business people. Outside the theatre, Mr Sala told reporters: \"A man of extraordinary elegance. Milan is full of signs of Armani. It will be impossible to forget him.\" The line of mourners stretched back down the block some two hours after the theatre opened, as some said they travelled for several hours to go and pay their respects. Among them was Annamaria Longo Dorni, from Lago Maggiore, north of Milan, who wore an Armani midnight blue jacket for the occasion. \n                  Cable snapped in deadly Lisbon funicular crash, report finds\n                 \n                  Carlo Acutis: The London-born teen about to become first millennial Catholic saint\n                 \n                  France on brink of economic and political crisis as PM looks set to lose confidence vote\n                 \"You put it on, and you're perfect,\" she said as she waited. \"It's always up to date, even after 20 years.\" Read more on Sky News:The best celebrity looks created by Giorgio ArmaniThe London-born teen about to become first millennial Catholic saint At the viewing chamber, a photo of the designer smiling and waving was projected on the back wall, along with his parting words which read: \"The mark I hope to leave is one of commitment, respect and genuine care for people and for reality. That's where everything truly begins.\" The public viewing will continue until Sunday evening, before Mr Armani is buried following a private funeral on Monday. Other celebrities including Ralph Lauren, Julia Roberts, Anna Wintour and Leonardo DiCaprio have paid tribute in messages. Mr Armani did not appear at his runway shows in Milan for the first time ever in June as he recovered from an unknown illness, but he later revealed he \"oversaw every aspect of the show remotely via video link\". In a statement after his death, his fashion house said he was \"indefatigable to the end,\" working until his final days."
    },
    {
        "title": "Mandelson to praise Trump as maverick 'risk taker' and paint Brexit as liberating force",
        "description": "Britain's ambassador to the United States will use a keynote speech today to underline the UK-US special relationship - while also attempting to 'Reform-proof' his own struggling government.",
        "url": "https://news.sky.com/story/mandelson-to-praise-trump-as-maverick-risk-taker-and-paint-brexit-as-liberating-force-13425899",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mandelson-trump_7012551.jpg?20250906052432",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-09-06 03:53:00",
        "Headline": "The 'Prince of Darkness' will cast Mr Trump as the consequence, not the cause, of the disruption to international systems.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Britain's ambassador to the United States will use a keynote speech today to underline the UK-US special relationship - while also attempting to 'Reform-proof' his own struggling government. Lord Mandelson, the architect of New Labour, master of political spin and now Britain's man in Washington, will use the 2025 annual lecture at Ditchley Park to offer a positive spin on a presidency which has proudly upended norms and frayed alliances. In the speech, parts of which have been released in advance, Mandelson will describe President Trump as a \"risk taker\" with an \"iron-clad stomach\". Lord Mandelson was chosen as ambassador by Prime Minister Sir Keir Starmer late last year. He is a political appointee rather than a career diplomat. And with intriguing language he will offer his take on the parallels between Trump and Starmer's challenges and mandates. He will say: \"I credit President Trump's political instincts in identifying the anxieties gripping not only millions of Americans, but also far more pervasive Western trends: economic stagnation for many, a sense of irreversible decline, the lost promise of meaningful work… \"These American concerns find their mirror image in British society, where Keir Starmer won an electoral mandate for national renewal which is similar to Donald Trump's.\" Yet Mandelson delivers the speech at the end of a week when Nigel Farage was in town. Screaming for his own form of Trump-like national renewal, the disruptive leader of the UK's top-polling political party - Reform - was in Washington to hobnob in the Oval Office and to tell Congress that Keir Starmer is turning Blighty into North Korea.  Mr Farage enjoys lapping up the limelight in Washington, where he is an old-world conservative celebrity in the new MAGA White House. His calculation is that the MAGA wave will reach the UK shores soon. Reform's policy platform is a mirror of the Trump agenda in many respects, tweaked accordingly. The administration is happy to support him. There is a MAGA-Reform mutual respect. And so it is politically savvy or unavoidably necessary for Lord Mandelson, New Labour's architect laying the foundations of the current UK government, to proclaim: 'We respect Trump too.' The truth is the government, like so many around the world, sees Donald Trump as an infuriating and unpredictable disrupter with the ability to upend norms at the stroke of a Sharpie. But they can't articulate that publicly. Instead, the 'Prince of Darkness' will cast Mr Trump as the consequence not the cause of the disruption to international systems, even if many argue that he can be both. As a master of spin, strategy and ruthlessness, Mandelson clearly has an admiration for Trump's political style and sheer chutzpah. He will tell the Ditchley Park lecture: \"The president may not follow the traditional rulebook or conventional practice, but he is a risk taker in a world where a 'business as usual' approach no longer works.\" At a time when the Labour government is struggling and feeling the heat from Farage and his disrupters, are these words to be read as a not-so-subtle message to Prime Minister Starmer? Mandelson is an old-fashioned liberal. He hasn't the stomach for 'wokey' politics or own goals like the arrest of Graham Linehan. Is there a frustration that the political party he built is now messing it all up? \"Indeed, he seems to have an iron-clad stomach for political risk…\" he will say of Trump, decrying the tendency of previous presidents to descend \"into an analysis paralysis and gradual incrementalism\". Lord Mandelson may be Britain's man in Washington now but, more than anyone else to hold the post, he is deeply integrated into the Downing Street machine. He is tight with Number 10 chief of staff Morgan McSweeney and was inside Downing Street when Friday's reshuffle took place. A total coincidence I am told. A week before the president's state visit to the UK, Lord Mandelson's speech is designed to steady a special relationship put under pressure by the return of Trump. \"Do we always have identical views?\" he will say. \"Of course not, we never have. And we are not looking for special treatment. Our alliance exists because it serves both nations' interests, because the core values of Britons and Americans remain aligned, as the world around us becomes more threatening.\" Read more from Sky News:Trump rebrands Pentagon as the Department of WarThe proxy war that will redefine US public health And, in a shapeshifting manoeuvre that only the original spin doctor could manage, Lord Mandelson, a cheerleading remainer in the EU referendum campaign, now casts Brexit as a liberator. \"Brexit has freed us to pursue closer US ties,\" he will say in his speech. \"Britain has the opportunity to use its regulatory freedom and independence from European law to deepen American investment opportunities. This is crucial as, post-Brexit, we need to leverage every advantage we can to spur UK growth and employment.\" The ambassador is expected to concede that pre-referendum warnings of the demise of Britain's trans-Atlantic clout have not transpired, while maintaining that Brexit has hit the UK financially with a net-loss to its economy. They say the British ambassador is the custodian of the US-UK special relationship. This ambassador has seen what the relationship looks like under Trump. With trademark political gymnastics, he seems now to be both admiring of the Trumpian movement but also anxious that if Britain under Labour doesn't get its house in order, then it too will get its own Trumpian disrupter."
    },
    {
        "title": "Donald Trump orders 'take down' of 44-year-old peace vigil opposite White House",
        "description": "One of the world's longest-running peace vigils could be under threat after Donald Trump ordered to \"take it down\".",
        "url": "https://news.sky.com/story/donald-trump-orders-take-down-of-44-year-old-peace-vigil-opposite-white-house-13425982",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-philipos-melaku-bello_7012680.jpg?20250906110559",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-06 09:58:00",
        "Headline": "The White House Peace Vigil has stood near the White House since 1981, calling for global disarmament. After a reporter asked about the \"eyesore\" tent, Donald Trump said he will look into taking it down.",
        "Content": "One of the world's longest-running peace vigils could be under threat after Donald Trump ordered to \"take it down\". The White House Peace Vigil, which has stood near the president's residence since 1981, is a tent manned around the clock in a call for peace and global disarmament. Flanked by various anti-war placards, the small blue tent was described as an \"eyesore\" by a reporter from conservative outlet Real America's Voice, who asked Mr Trump about it. \"Take it down, today, right now,\" he said, after asking where the tent is and claiming he hadn't heard of it. \"We're going to look into it right now.\" On Friday night, police were seen talking to what appeared to be demonstrators near the vigil, in Lafayette Park, across the street from the White House. The vigil-keeper Philipos Melaku-Bello was seen hugging another protester, who feared the 44-year-old site could be torn down. It follows another threat against the vigil earlier this year, when Representative Jeff Van Drew wrote a letter to the Interior Department describing the site as a \"24-7 eyesore\". In the letter, shared by the Washington Post, he said people have \"every right to protest their government\", but not to \"hijack a national park and turn it into a 24/7 eyesore\". The site of the vigil is in a park run by the National Park Service (NPS), which stipulates this tent must be manned at all times to remain standing. In 2013, the vigil was briefly taken down by park police when it was found abandoned. Organisers said the man responsible for staying at the tent overnight that day was a veteran who had an episode of post-traumatic stress disorder. Read more:Trump rebrands Pentagon as Department of WarTrump is vulnerable over Epstein - this shows why A few hours later, the site was allowed to stand again. Connie Picciotto, who maintained the protest from its launch in 1981 until her death in 2016, said at the time she was \"never going to give up\", when she saw the tent had been removed."
    },
    {
        "title": "President Trump signs order rebranding Pentagon as the Department of War ",
        "description": "President Trump has signed an executive order rebranding the US Department of Defense as the Department of War.",
        "url": "https://news.sky.com/story/president-trump-signs-order-rebranding-pentagon-as-the-department-of-war-13425876",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-hegseth-war_7012536.jpg?20250906012322",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-06 00:16:00",
        "Headline": "The president said the switch to the Department of Defense title after the Second World War was a \"woke\" move.",
        "Content": "President Trump has signed an executive order rebranding the US Department of Defense as the Department of War. He called the original name \"woke\" and said the new title sent \"a message of victory\" and \"a message of strength\". It can only be used as a secondary title unless Congress approves the change - but the department's website has already switched to war.gov - as have its social media accounts. The door of Pete Hegsesth's office has also been adorned with a fresh \"Secretary of War\" sign. Mr Hegseth said the move wasn't \"politically correct\" but that it showed \"we're going to go on offence\". \"We're going to raise up warriors, not just defenders,\" he added. President Trump signed the executive order in the White House's Oval Office on Friday. \n                  Donald Trump orders 'take down' of 44-year-old peace vigil opposite White House\n                 \n                  Trump to rebrand Pentagon as the Department of War\n                 \n                  Why did some people think Trump was dead?\n                 \"We won the First World War. We won the Second World War. We won everything before that and in between,\" he said. \"And then we decided to go woke and we changed the name to Department of Defense. So we're going Department of War.\" The president denied the rebrand ran contrary to his peacemaking efforts - which he claims have already \"ended seven wars\". \"I think I've gotten peace because of the fact that we're strong,\" he told reporters. The official executive order states that the name \"demonstrates our ability and willingness to fight and win wars on behalf of our Nation at a moment's notice, not just to defend\". It also commands Mr Hegseth to pursue legislation within 60 days to make the change permanent. The Department of Defense - often referred to colloquially as the Pentagon due to the shape of its Washington HQ - was called the War Department from 1789 until 1949. Historians say the name was changed to show the US was focused on preventing conflict following the Second World War. Read more from Sky News:The proxy war that will redefine US public healthJudge says Trump's National Guard deployment was illegal President Trump's reversion to the previous more combative title could end up costing tens of millions, with letterheads and building signs in the US and at military bases around the world potentially needing a refresh. Joe Biden's effort to rename nine army bases honouring the Confederacy and Confederate leaders, set to cost $39m (£29m), was reversed by Mr Hegseth earlier this year. Mr Trump's other federal renaming orders include controversially labelling the Gulf of Mexico the \"Gulf Of America\" and reverting North America's tallest mountain, Denali in Alaska, to its former name of Mount McKinley. The Mexican government and Alaska's Republican senators both rejected the changes."
    },
    {
        "title": "Former pilot who tried to cut plane engines after taking magic mushrooms pleads guilty",
        "description": "A former pilot who tried to turn off a plane's engines while riding off-duty on magic mushrooms has pleaded guilty to interfering with a flight crew.",
        "url": "https://news.sky.com/story/former-pilot-who-tried-to-cut-plane-engines-after-taking-magic-mushrooms-pleads-guilty-13425989",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-joseph-emerson-plane_7012737.jpg?20250906132842",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-06 10:55:00",
        "Headline": "Joseph Emerson told police he was upset over a friend's recent death, had taken magic mushrooms about two days before he was due to ride in the cockpit, and had not slept in over 40 hours.",
        "Content": "A former pilot who tried to turn off a plane's engines while riding off-duty on magic mushrooms has pleaded guilty to interfering with a flight crew. Joseph Emerson, a former Alaska Airlines pilot, was sitting in the spare seat of the cockpit of Horizon Air flight 2059 from Everett to San Francisco when he tried to cut the engines in 2023. The two pilots flying stopped him from doing so, and the plane was then diverted to Portland, where it landed safely with 84 people on board. After his arrest, Emerson told police he was upset over a friend's recent death, had taken psilocybin - commonly known as magic mushrooms - about two days earlier, and had not slept in over 40 hours. The off-duty pilot, of Pleasant Hill, California, was charged in federal court with interfering with a flight crew. Separately, a state indictment in Oregon charged him with 83 counts of endangering another person and one count of endangering an aircraft. He has now pleaded guilty to the federal count and no-contest - which carries the same legal effect as a guilty plea - to the state charges. 'What happened was wrong' Speaking to the court on Friday, Emerson said he had no intention of harming anyone, but accepted \"I still made the decision to take psilocybin, and that led to my inability to determine that I was operating in reality for an extended period of time\". \"That doesn't make this right,\" he said. \"What happened was wrong and should not have happened, and I bear the responsibility for that.\" According to Sky's US partner network NBC News, one of the pilots also told investigators that Emerson said \"I'm not okay\" before he reached for the red fire suppression handles - which would have cut off fuel to the engines. Multnomah County deputy district attorney Eric Pickard said in a written statement on Friday that what \"Joseph Emerson did was reckless, selfish, and criminal\". \"We should remember how close he came to ruining the lives of not just the 84 people aboard Flight 2059, but all of their family members and friends as well,\" he added. Typically, off-duty airline pilots sit in the jump seat of the flight deck behind the pilots to fly back to their home base if seats are available. Read more from Sky News:Man killed in shark attack in SydneyIsrael warns Gaza City residents to flee to 'humanitarian area'Flares thrown at migrant hotel As part of a plea agreement for the state charges, Emerson was sentenced to 50 days in jail - which he has already served - five years on probation, 664 hours of community service and $60,569 (£44,840) in restitution. He still faces sentencing for the federal charge of interfering with a flight crew, which carries a maximum sentence of 20 years in prison. Emerson is set to appear in court for federal sentencing on 17 November."
    },
    {
        "title": "Kyle pledges 'ambitious' growth agenda in call with UK bosses   ",
        "description": "Peter Kyle, the new business and trade secretary, has pledged to deliver an \"ambitious\" growth agenda, telling the bosses of some of Britain's biggest companies that he wants the government to play a role in creating the UK's first trillion-dollar company.",
        "url": "https://news.sky.com/story/kyle-pledges-ambitious-growth-agenda-in-call-with-uk-bosses-13426142",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-kyle-business-secretary_7012928.jpg?20250906163126",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-06 15:26:00",
        "Headline": "Peter Kyle, the new business and trade secretary, has told business leaders he wants the government to help create Britain’s first company worth at least $1trn, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Peter Kyle, the new business and trade secretary, has pledged to deliver an \"ambitious\" growth agenda, telling the bosses of some of Britain's biggest companies that he wants the government to play a role in creating the UK's first trillion-dollar company. Sky News has learnt that Mr Kyle held a hastily convened call with business leaders on Saturday afternoon following his appointment as Jonathan Reynolds' successor. The call was joined by chief executives or their equivalents from companies including BAE Systems, Heathrow Airport, Microsoft UK, NatWest Group and Octopus Energy. Representatives of business groups, including the CBI, FSB and Make UK also participated, according to insiders. Mr Kyle said the overlap between the Department for Business and Trade (DBT) and Department for Science, Innovation and Technology (DSIT), where he was previously the secretary of state, meant he would seek to deploy the resources of the British Business Bank to fuel economic growth. He said he wanted the UK to become the best place in the world for start-up and scale-up companies, adding that he understood the importance of a long-term approach to building business confidence. Among his ambitions, he said, was for the government to help assist in the creation of Britain's first company worth at least $1trn - a milestone achieved by only a few US-based companies, including Amazon, Apple and Nvidia. \n                  Trump ally Representative Jim Jordan to criticise Online Safety Act in meeting with Technology Secretary Peter Kyle\n                 \n                  Two-hour screen time limit and curfews for children being considered by government\n                 \n                  Government to announce new scheme as it ramps up AI adoption with backing from Facebook owner Meta\n                 Mr Kyle told bosses he would fly to Washington on Sunday to help prepare for President Donald Trump's forthcoming state visit, before travelling to China in place of Mr Reynolds for talks with officials. He added that Sir Keir Starmer had given him a licence to pursue growth opportunities in conjunction with DSIT, the Treasury and the Department for Work and Pensions. The new business secretary added that he wanted a greater focus on risk-taking, reflecting a drive by Chancellor Rachel Reeves in recent months. Responding to an enquiry from Sky News, a government spokesman issued a statement from Mr Kyle saying: \"I want government to be seen as an active partner that delivers success, supports new business and backs wealth creation. \"This government's number one mission is economic growth. \"We need to crack on and do it. Read more on Sky News:Money - student finance specialRetail giants race to save Claire'sEuros and weather boost sales \"We must double down, while being creative and unrelenting in pursuit of our goal. \"I want this to be the greatest place to start a business, or scale up. \"We haven't maximised the potential in this country, and I'm ambitious in wanting to see the first trillion-dollar company to emerge from the UK.\""
    },
    {
        "title": "Unions demand no retreat on workers' rights after Rayner quits",
        "description": "Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet.",
        "url": "https://news.sky.com/story/unions-demand-no-retreat-on-workers-rights-after-rayner-quits-13426073",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "Business",
        "Author": "Jon Craig",
        "Date Published": "2025-09-06 23:01:00",
        "Headline": "TUC chief Paul Nowak has warned ministers not to dilute the Employment Rights Bill which Angela Rayner, who departed the cabinet on Friday, has spearheaded. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet. As delegates gather in Brighton for the TUC's annual conference, the movement's leadership is claiming four million people - one in eight of the UK workforce - are in \"pervasive\" insecure work. And union bosses are urging the government to stand firm and reject attempts by Tories and Liberal Democrats to weaken the former deputy prime minister's Employment Rights Bill in its final stages in parliament. The TUC's general secretary, Paul Nowak, has claimed Ms Rayner, who resigned on Friday over unpaid stamp duty on a seaside flat, was a victim of misogyny and was being hounded out by right-wing politicians and right-wing media. As well as Ms Rayner leaving the government, the other minister driving the bill through parliament, Jonathan Reynolds, was demoted in Sir Keir Starmer's cabinet reshuffle from the senior post of business secretary to chief whip. Until last week, Ms Rayner had been expected to deliver the keynote Labour Party speech at the TUC on Tuesday, but it emerged midweek that the education secretary, Bridget Phillipson, would be the speaker. However, in Friday's reshuffle she lost responsibility for adult skills - a key issue for the unions - to the new work and pensions secretary Pat McFadden, who will now head a new, beefed-up super-ministry promoting growth. \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 And ironically, the TUC conference in Brighton is taking place less than two miles from the luxury seaside flat in Hove, on which Ms Rayner's avoidance of £40,000 in stamp duty led to her resignation as deputy PM, housing secretary and Labour deputy leader. Just before parliament's summer recess, the House of Lords backed by 304 votes to 160 a Tory-led amendment to Ms Rayner's bill to reduce the qualifying period for unfair dismissal claims from two years to six months, rather than from day one, as proposed by Ms Rayner.  Third reading of the bill in the Lords was last Wednesday, the day of Ms Rayner's Sky News confession, and the bill is now set for parliamentary ping-pong, assuming the government overturns the Lords' amendments in the Commons. But in a pre-conference interview with Sky News, TUC chief and Rayner supporter Mr Nowak demanded no diluting of her bill, which also includes banning zero hours contracts which exploit workers and fire and rehire. Read more:Despite her exit, Rayner remains a powerful forceWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time \"We are now at a crucial stage in the delivery of the Employment Rights Bill, just weeks away from Royal Assent,\" said Mr Nowak. \"And our clear message to the government will be to deliver the bill and deliver it in full. \"Ignore the amendments from the unelected peers, Tory and Lib Dem peers in the House of Lords, that are aimed at gutting the legislation, weakening workers' rights. \"Stand with the British public, deliver decent employment rights. That's important in workplaces up and down the country, but it's important because these are proposals that are popular with the British public as well.\" The TUC says its analysis shows low-paid jobs in occupations such as the care, leisure and service sectors account for 77% of the increase in insecure jobs since 2011. Black and ethnic minority ethnic workers account for 70% of the explosion in insecure work, according to the TUC, and southwest England and Yorkshire and Humber are insecure work hotspots. Mr Nowak told Sky News: \"We've got well over a million people now on zero-hours contracts. We've got millions of people who don't have sick pay from day one and 70% of the kids who live in poverty have parents who go out to work. \"The government is absolutely right to be focused on making work pay. And the Employment Rights Bill is about putting more money in the pockets of working people, giving people more security at work. \"That's good for workers, but it's also good for good employers as well, so they're not undercut by the cowboys.\" Speaking to Sky News last Wednesday, shortly after Ms Rayner's tearful confession to Sky's political editor Beth Rigby, Mr Nowak said: \"There's a real heavy dose of misogyny when it comes to Angela. \"Angela Rayner is playing a really important role in government and I wouldn't want to see her hounded out of an important role by right-wing politicians and the right-wing media, who frankly can't handle the fact that a working-class woman is our deputy prime minister.\""
    },
    {
        "title": "WH Smith buyer and HMV owner in race to save Claire's",
        "description": "The new owner of WH Smith's high street empire and the saviour of HMV are racing to salvage a future of Claire's, the accessories retailer which slumped into administration last month, putting thousands of jobs at risk.",
        "url": "https://news.sky.com/story/wh-smith-buyer-and-hmv-owner-in-race-to-save-claires-13425916",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-accessories-claires-accessories_6965200.jpg?20250720165751",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-06 06:21:00",
        "Headline": "Modella Capital, which has become Britain’s most prolific retail investor, and Doug Putman have both expressed interest in taking over the collapsed accessories chain’s UK stores, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The new owner of WH Smith's high street empire and the saviour of HMV are racing to salvage a future of Claire's, the accessories retailer which slumped into administration last month, putting thousands of jobs at risk. Sky News has learnt that Modella Capital, which is to rebrand hundreds of WH Smith shops under the name TG Jones, made an offer to buy Claire's from administrators at Interpath in the last ten days. Sources said that Doug Putman, whose Sunrise Records rescued HMV in 2019 and who failed in a bid to buy Wilko after its collapse four years later, had also tabled a bid. This weekend, it was unclear which of the two were ahead in the battle to buy Claire's, or whether any other parties were in discussions with Interpath. The restructuring firm said in mid-August that it would continue to trade all 278 UK shops and 28 Irish stores while it assessed options for the business. Roughly 2,150 people work across the business, making Claire's one of the biggest high street chains to fall into insolvency this year. Claire's has been a fixture in British shopping centres and town centres for decades, and is particularly popular among teenage shoppers. \n                  Kyle pledges 'ambitious' growth agenda in call with UK bosses   \n                 \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  Student finance guide: 27 unmissable discounts; how to win housemate rows; £100 bank account bonus; advice for parents\n                 It had been running a sale process prior to its appointment as administrators, but bidders including the turnaround specialist Hilco Capital walked away from the auction. If Modella Capital does acquire Claire's UK operations, it would underline its status as the most prolific new investor in British retailing. It agreed to buy WH Smith's 480 UK shops in the spring, ultimately chipping the purchase price by £12m to £40m. Modella already owned The Original Factory Shop and Hobbycraft, and has been repeatedly linked with other high street assets. Any buyer of Claire's UK business would be likely to close scores of shops, according to insiders, with a core estate of roughly 100 outlets thought to be viable. The retail industry has been left reeling by the employers' national insurance hike announced by Rachel Reeves, the chancellor, last autumn. Both Poundland and River Island recently survived creditor votes paving the way for them to slash rents and close dozens of stores. The collapse of Claire's UK operations came a week after its US parent company filed for Chapter 11 bankruptcy protection. The company had been owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring. It has since agreed to sell up to 950 of its US stores to Ames Watson, a private equity firm. Will Wright, UK chief executive at Interpath, said last month: \"Claire's has long been a popular brand across the UK, known not only for its trend-led accessories but also as the go-to destination for ear piercing. \"Over the coming weeks, we will endeavour to continue to operate all stores as a going concern for as long as we can, while we assess options for the company. \"This includes exploring the possibility of a sale which would secure a future for this well-loved brand.\" This weekend, Interpath declined to comment on talks with prospective buyers, while Modella declined to comment and Mr Putman did not respond to an enquiry from Sky News."
    },
    {
        "title": "Farage confirms he wants to deport women asylum seekers back to Taliban in Afghanistan",
        "description": "Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister.",
        "url": "https://news.sky.com/story/farage-confirms-he-wants-to-deport-women-back-to-taliban-in-afghanistan-13425996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7012717.png?20250906130251",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-06 11:22:00",
        "Headline": "Speaking to Sky News' political editor Beth Rigby, the Reform UK leader clarified his position on deporting asylum seekers back to the Taliban.",
        "Content": " Nigel Farage has confirmed he wants to deport women asylum seekers back to the Taliban in Afghanistan if he becomes prime minister. The Reform UK leader's position on the topic has not been clear, with him previously saying he wouldn't send women back to the fundamentalist regime that took over after western militaries withdrew, before now saying he would. Mr Farage was speaking to Sky News' political editor Beth Rigby at the Reform UK party conference in Birmingham. Politics live: Govt responds to Farage wanting early election When asked if he would \"detain\" women and children and \"send them back\", the Clacton MP said \"yes\". Challenged on when he said in August that he was not \"discussing\" women and children, Mr Farage claimed this was a reference to his desire to see men detained on arrival in the UK. At the time, he said he was \"very, very clear\" on the \"deportation of illegal immigrants\", adding: \"We are not even discussing women and children at this stage - there are so many illegal males in Britain, and the news reports that said that after my conference yesterday were wrong\". Speaking today, Mr Farage claimed that the UK has a \"duty of care\" to a child if, for example, a four-year-old arrives in a dinghy - but not to women and men. \"For clarity, those that cross the English Channel will be detained and deported, men and women,\" Mr Farage went on. \"Children, we'll have to think about.\" Read more:Is Reform really now a government in waiting?Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences? 'No one' can prevent small boats crossing the Channel The Reform leader also rowed back on his pledge to stop all boats within two weeks if he is elected prime minister. Speaking to the conference yesterday, Mr Farage said: \"You cannot come here illegally and stay - we will stop the boats within two weeks of winning government.\" But speaking to Beth Rigby today, he changed tack - saying \"the passing of legislation\" would be required. He said only then would the boats be stopped within two weeks, or sooner In the interview with Rigby, Mr Farage tried to claim he did not say he would end the boats within two weeks of \"winning government\". But the video of his speech, as well as the transcript released by Reform UK, clearly show him saying: \"We will stop the boats within two weeks of winning government.\" When asked why he wouldn't be able to follow through with his initial claim, Mr Farage said it was impossible and that \"no one\" can prevent them crossing the Channel. The Reform UK leader said the law he wants to introduce will be called the Illegal Migration Act once it is passed by parliament. He confirmed his agenda includes leaving the European Convention on Human Rights, shutting down asylum hotels and housing people at RAF bases instead, as well as deporting Channel migrants.  Read more on Sky News:Flares thrown at migrant hotelLabour plans to overhaul 'broken' asylum systemMr Farage also claimed that deportation flights would also begin within two weeks of the law changing, and this combination of factors would stop people from wanting to travel from France. Political correspondent Nigel Farage insists his policy on mass deportations is clear when it comes to women and girls.\n But I've watched every Reform speech since they unveiled their flagship policy - and I was there in the room to ask him when he announced what he will do with women and children who come here via small boats if he was in power - and I still can't work it out.\n That's because he's said three different things since, including in an interview today.\n Originally he said everyone would be detained: \"Yes, women and children, everybody on arrival will be detained. And I've accepted already that how we deal with children is a much more complicated and difficult issue.\"\n A day later he said Reform is \"not even discussing women and children at this stage\" implying women and children would not be deported. \n He also said it was \"not true\" that's he had committed to sending women and girls back to countries where they can be raped, tortured and killed.\n But today at their conference he told Sky News that women who arrive by boat will be deported to Afghanistan \"if necessary\". \n Considering Reform UK say they are willing to make deals with Afghanistan and Syria, this question is an important one. The UK has not recognised the Taliban as a legitimate government of Afghanistan since the group seized Kabul in 2021 and first established a regime based on an extreme interpretation of Islamic law. \n Reform's deputy leader Richard Tice has defended those plans, saying: \"Sometimes you do deals with people you may not want to go down the pub with.\"\n Farage clarified that \"children, of course, we'll have to know that we're sending them off somewhere sensible\".\n He has also previously said asylum seekers were a threat to national security and to British women.\n The broader political issue though, is that Reform's immigration plan was meant to be a detailed and considered policy on an issue they've been ahead of other politicians on for years. \n So why aren't they more forthcoming with their answers on what they would do with women and children?\n If they had hoped to truly embody their conference slogan of \"next steps\" to professionalise the party, they need to urgently address this.\n But party members here don't seem to be bothered by this detail amongst the fireworks, the enthusiasm and the energy here.\n It turns out that years of banging on about this single issue for decades is Nigel Farage's greatest strength - and the public are willing to give him the grace to work out the details later down the line.\n This strategy all depends on Reform UK winning the next general election - which Labour does not have to call until 2029. However, the Reform leader says he believes the government will collapse in 2027 due to economic pressure and other factors. Reform are currently well clear of Labour and the Conservatives in the polling, and are targeting next year's Welsh, Scottish and English local elections to try and win more power in councils and national assemblies."
    },
    {
        "title": "Nigel Farage admits he made a mistake over house ownership after a week that proves how much details matter",
        "description": "It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle.",
        "url": "https://news.sky.com/story/nigel-farage-admits-he-made-a-mistake-over-house-ownership-after-a-week-that-proves-how-much-details-matter-13426302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-beth-rigby_7013125.png?20250906201103",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-06 18:13:00",
        "Headline": "There is no suggestion that the Reform UK leader did anything wrong, but he admits he misspoke last year when he said he bought a house in his Clacton constituency, when it was purchased by his partner.",
        "Content": "\n          Political editor\n              @BethRigby\n  It's normally Nigel Farage who seizes the megaphone, but his big Birmingham Reform UK party conference was metaphorically gatecrashed by Angela Rayner's dramatic resignation, followed by Sir Keir Starmer's shock reshuffle. The massive Westminster news on Friday meant Mr Farage had to move his speech to avoid a clash with the prime minister's reshuffle, as many a journalist like me dashed back to London to pick up an even bigger story than Mr Farage - not something he's that used to these days, after a summer of nearly back-to-back coverage of his insurgent party and its policies. But the news about Ms Rayner both detracted from and put the spotlight on him when it came to his own tax affairs. Politics latest - reshuffle continues The Labour-backing Mirror newspaper published a story calling Mr Farage a \"hypocrite\" for criticising Ms Rayner when he also had questions to answer. Because while Ms Rayner resigned after admitting she did not pay enough tax  on a home she bought in Hove, East Sussex, Mr Farage was also under scrutiny for saying he had bought his house in Clacton, when in fact he had not. Last November, Mr Farage told Sky News he \"just exchanged contracts on the house. I've bought a house in Clacton\". But in fact, Mr Farage, who owns multiple properties, hadn't bought a house at all. It was his partner who bought the house, and in doing so, only paid standard stamp duty as it is her main home. Had Mr Farage bought the house, he'd have been liable for an additional £44,000 in tax as a second home purchase.  There is no suggestion that Mr Farage did anything wrong, but he did misspeak and he used the house purchase in Clacton last November to deflect against accusations that he wasn't invested in his constituency and didn't spend any time there. He admitted to me that he made a mistake when he said it was his property. He said he \"shouldn't have said 'I', I should have said 'we'. It's her money. It's her asset. I own none of it. But I just happen to spend some time there\".  His admission comes after the Reform UK leader was challenged earlier this year over whether the property had been bought in his partner's name in a way that allowed him legally to avoid higher-rate stamp duty - a charge he roundly rejects. But it also seems that voters reject deputy party leader Richard Tice's assertion that Mr Farage's tax affairs were \"irrelevant\". Angela Rayner's forced resignation because of her own failures on tax compliance shows that these matters, particularly at a time when the government is asking voters to pay even more tax, are very pertinent. Read more on Sky News:Who's in, who's out in reshuffleRayner graffiti removedWhat a time to become home secretary Unlike Angela Rayner, no one is suggesting Mr Farage has broken any rules or owes any underpaid tax to HMRC. But the lesson of this very long week in politics is that all politicians need to make sure their tax affairs are in order - and would do well to remember that the sniff test matters too."
    },
    {
        "title": "Unions demand no retreat on workers' rights after Rayner quits",
        "description": "Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet.",
        "url": "https://news.sky.com/story/unions-demand-no-retreat-on-workers-rights-after-rayner-quits-13426073",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-06 23:01:00",
        "Headline": "TUC chief Paul Nowak has warned ministers not to dilute the Employment Rights Bill which Angela Rayner, who departed the cabinet on Friday, has spearheaded. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Union leaders are demanding no eleventh-hour retreat by the government on workers' rights now their champion Angela Rayner is no longer in the cabinet. As delegates gather in Brighton for the TUC's annual conference, the movement's leadership is claiming four million people - one in eight of the UK workforce - are in \"pervasive\" insecure work. And union bosses are urging the government to stand firm and reject attempts by Tories and Liberal Democrats to weaken the former deputy prime minister's Employment Rights Bill in its final stages in parliament. The TUC's general secretary, Paul Nowak, has claimed Ms Rayner, who resigned on Friday over unpaid stamp duty on a seaside flat, was a victim of misogyny and was being hounded out by right-wing politicians and right-wing media. As well as Ms Rayner leaving the government, the other minister driving the bill through parliament, Jonathan Reynolds, was demoted in Sir Keir Starmer's cabinet reshuffle from the senior post of business secretary to chief whip. Until last week, Ms Rayner had been expected to deliver the keynote Labour Party speech at the TUC on Tuesday, but it emerged midweek that the education secretary, Bridget Phillipson, would be the speaker. However, in Friday's reshuffle she lost responsibility for adult skills - a key issue for the unions - to the new work and pensions secretary Pat McFadden, who will now head a new, beefed-up super-ministry promoting growth. \n                  Angela Rayner may no longer be at the top table but she remains a powerful force in the Labour Party\n                 \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  From non-job to key job - Why there's so much at stake in the election for Rayner's replacement\n                 And ironically, the TUC conference in Brighton is taking place less than two miles from the luxury seaside flat in Hove, on which Ms Rayner's avoidance of £40,000 in stamp duty led to her resignation as deputy PM, housing secretary and Labour deputy leader. Just before parliament's summer recess, the House of Lords backed by 304 votes to 160 a Tory-led amendment to Ms Rayner's bill to reduce the qualifying period for unfair dismissal claims from two years to six months, rather than from day one, as proposed by Ms Rayner.  Third reading of the bill in the Lords was last Wednesday, the day of Ms Rayner's Sky News confession, and the bill is now set for parliamentary ping-pong, assuming the government overturns the Lords' amendments in the Commons. But in a pre-conference interview with Sky News, TUC chief and Rayner supporter Mr Nowak demanded no diluting of her bill, which also includes banning zero hours contracts which exploit workers and fire and rehire. Read more:Despite her exit, Rayner remains a powerful forceWhat a moment for Shabana MahmoodCooper picking up the reins at a challenging time \"We are now at a crucial stage in the delivery of the Employment Rights Bill, just weeks away from Royal Assent,\" said Mr Nowak. \"And our clear message to the government will be to deliver the bill and deliver it in full. \"Ignore the amendments from the unelected peers, Tory and Lib Dem peers in the House of Lords, that are aimed at gutting the legislation, weakening workers' rights. \"Stand with the British public, deliver decent employment rights. That's important in workplaces up and down the country, but it's important because these are proposals that are popular with the British public as well.\" The TUC says its analysis shows low-paid jobs in occupations such as the care, leisure and service sectors account for 77% of the increase in insecure jobs since 2011. Black and ethnic minority ethnic workers account for 70% of the explosion in insecure work, according to the TUC, and southwest England and Yorkshire and Humber are insecure work hotspots. Mr Nowak told Sky News: \"We've got well over a million people now on zero-hours contracts. We've got millions of people who don't have sick pay from day one and 70% of the kids who live in poverty have parents who go out to work. \"The government is absolutely right to be focused on making work pay. And the Employment Rights Bill is about putting more money in the pockets of working people, giving people more security at work. \"That's good for workers, but it's also good for good employers as well, so they're not undercut by the cowboys.\" Speaking to Sky News last Wednesday, shortly after Ms Rayner's tearful confession to Sky's political editor Beth Rigby, Mr Nowak said: \"There's a real heavy dose of misogyny when it comes to Angela. \"Angela Rayner is playing a really important role in government and I wouldn't want to see her hounded out of an important role by right-wing politicians and the right-wing media, who frankly can't handle the fact that a working-class woman is our deputy prime minister.\""
    },
    {
        "title": "Graffiti calling Angela Rayner 'tax evader' removed after resident pays for clean-up",
        "description": "A resident has paid for the clean-up of graffiti outside Angela Rayner's flat in Hove, according to the Brighton and Hove City Council.",
        "url": "https://news.sky.com/story/graffiti-calling-angela-rayner-tax-evader-removed-after-resident-pays-for-clean-up-13425981",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-graffiti_7012679.jpg?20250906110557",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-06 09:58:00",
        "Headline": "The graffiti appeared on a white wall outside the former deputy leader's £800,000 seaside property on Thursday.",
        "Content": "A resident has paid for the clean-up of graffiti outside Angela Rayner's flat in Hove, according to the Brighton and Hove City Council. The graffiti calling Ms Rayner a \"tax evader\" and a \"b****\" appeared on a white wall outside her £800,000 seaside property on Thursday after she admitted she did not pay the right amount of stamp duty when she bought it. Across the road, \"tax evader Rayner\" and \"Rayner tax avoidance\" were graffitied on a construction chipboard. It was initially scheduled to be cleared away by workers from the local council on Thursday afternoon, but they withdrew after complaints from locals about how quickly the clean-up was happening compared to similar vandalism across the city. Follow the latest updates with the Politics Hub blog On Friday, a council spokesperson said: \"Due to security concerns, and in line with our policy of removal of offensive graffiti, we have removed graffiti reported in Hove. This has been paid for by a resident.\" Sussex Police said it was treating the matter as criminal damage and that it was speaking to Ms Rayner to \"address any further concerns\". Ms Rayner, who resigned as deputy prime minister, housing secretary and deputy Labour leader on Friday, condemned the graffiti, with her spokesperson calling it \"totally unjustifiable\" and \"a matter for the police\". \"Neither Angela nor her neighbours deserve to be subjected to harassment and intimidation,\" they added. \"It will rightly be a matter for the police to take action as they deem appropriate.\" Sir Keir Starmer's spokesperson said the prime minister \"condemns this vandalism in the strongest possible terms\". \"Whatever scrutiny our parliamentarians may face, it is appalling that their private homes should be targeted in this way,\" they added.  MP for Hove and Portslade, Peter Kyle, who was made Business and Trade Secretary in Sir Keir's cabinet reshuffle on Friday, said: \"I'm really disappointed that the heritage wall has been defaced over this issue. Hove is better than this. \"There are many, many ways people can express their anger and disappointment in Angela Rayner, including reporting her to the Commissioner for Standards. But defacing a wall is not one of those ways.\" How Rayner has addressed stamp duty controversy  Scrutiny over Ms Rayner's finances began when The Daily Telegraph claimed she avoided £40,000 in stamp duty on her flat in Hove by removing her name from the deeds of another property in Greater Manchester. In a lengthy statement released on Wednesday, she said it was a \"complex living arrangement\" as her first home was sold to a trust following her divorce in 2023 to provide stability for her teenage son, who has lifelong disabilities and is the sole beneficiary of the trust. The home had been adapted for her son and the sale to the trust was to give him \"the security of knowing the home is his\", Ms Rayner said. Read more:Beth Rigby: Rayner is powerhouse - and her departure creates difficultiesAnalysis: What a moment for Mahmood to take the helm at the Home Office She went on to say that she did not own any other home when she bought the flat in Hove, and her understanding \"on advice from lawyers, was that my circumstances meant I was liable for the standard rate of stamp duty\". She said the allegations in the media led her to seek further advice from a leading tax counsel, who advised that the application of \"complex deeming provisions which relate to my son's trust gives rise to additional stamp duty liabilities\". In a letter to Sir Keir announcing her resignation, Ms Rayner said she \"deeply\" regretted her decision to not seek additional specialist tax advice sooner."
    },
    {
        "title": "Claims at Reform conference that vaccines gave royals cancer 'extremism', says Streeting",
        "description": "A vaccine-sceptic doctor has told the Reform UK conference that COVID vaccines contributed to cancer in the royal family - to criticisms of \"extremism\" from the health secretary and condemnation from experts.",
        "url": "https://news.sky.com/story/claims-at-reform-conference-that-vaccines-gave-royals-cancer-extremism-says-streeting-13426168",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-vaccination-porton-down_6242389.jpg?20240305213304",
        "type": "Politics",
        "Author": "Tim Baker, political reporter, at Reform UK conference in Birmingham",
        "Date Published": "2025-09-06 15:58:00",
        "Headline": "Health Secretary Wes Streeting has denounced the claim made by Dr Aseem Malhotra. Buckingham Palace has been approached for comment.",
        "Content": "By Tim Baker, political reporter, at Reform UK conference in Birmingham  A vaccine-sceptic doctor has told the Reform UK conference that COVID vaccines contributed to cancer in the royal family - to criticisms of \"extremism\" from the health secretary and condemnation from experts. Dr Aseem Malhotra spent around a quarter of an hour presenting a series of claims on the main stage of the conference in Birmingham - with thousands present in the crowd. Dr Malhotra, who described himself as a friend of controversial US health secretary Robert F Kennedy Jr, said hundreds of studies showed the harms of mRNA vaccines. He went on to say that he agreed with another doctor that \"it's highly likely that the COVID vaccines have been a factor, a significant factor, in the cancer of members of the royal family.\" Politics latest: Starmer continues ministerial reshuffle Sky News has contacted Buckingham Palace for comment. The comments were met with silence from the audience in the room. Wes Streeting, the Labour MP and health secretary, was quick to criticise Dr Malhotra. He said: \"When we are seeing falling numbers of parents getting their children vaccinated, and a resurgence of disease we had previously eradicated, it is shockingly irresponsible for Nigel Farage to give a platform to these poisonous lies. \"Farage should apologise and sever all ties with this dangerous extremism.\" Read more:Inside the fight over vaccines in the USWhy are child vaccination rates the lowest in decade Blood Cancer UK's healthcare professional advisory panel, which is made up of specialists from across the UK, said: \"There are no controlled, large-scale studies (studies with the most robust scientific evidence) that demonstrate an increased cancer risk following COVID-19 vaccination.\" Brian Ferguson, a professor of viral immunology and the University of Cambridge, said: \"There is no credible evidence that these vaccines disrupt tumour suppressors or drive any kind of process - biochemical or otherwise - that results in cancer. \"It is particularly crass to try to link this pseudoscience to the unfortunate incidents of cancer in the royal family and is reminiscent of the 'died suddenly' trope which attempted - and ultimately failed - to link the death of any young person to their vaccination status. \"This kind of outlandish conspiracy theory only serves to undermine the credibility of those spreading it.\" Lord Bethell, the Conservative peer and former health minister, said: \"This [is] bad science, bad royal-watching and bad politics - the British public strongly support vaccines and resent people who try to hijack our much-loved royal family for promoting loopy ideas. \"Might work well with American donors, but this is a clanger for Reform UK's credibility. I hope they give up this rubbish.\" A spokesperson for Reform UK said: \"Dr Aseem Malhotra is a guest speaker with his own opinions who has an advisory role in the US government. Reform UK does not endorse what he said but does believe in free speech.\""
    },
    {
        "title": "What if Romeo had a scar? Or Juliet a facial difference? The actors challenging screen conventions",
        "description": "Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too.",
        "url": "https://news.sky.com/story/what-if-romeo-had-a-scar-or-juliet-a-facial-difference-the-actors-challenging-screen-conventions-13425770",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-crystal-marshall-romeo-olukotun_7012443.jpg?20250906193903",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-06 18:00:00",
        "Headline": "From Bond to Batman to Star Wars, film and TV have used scars, burns and birthmarks as a shorthand for villainy for years - but could change be on the way?",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Crystal was 18 when bone cancer changed her face. On top of chemotherapy and operations, she had to deal with other painful realities too. She told Sky News: \"Pre-cancer, and everything that happened I wasn't aware how people who had facial differences were villainised or victimised. \"Experiencing that, seeing the trauma, I've been so affected by people staring at me in the street, and hate comments about my appearance.\" She believes part of the problem is the screen portrayal of visibly different characters: \"There's a narrative in Hollywood, especially that's been going on for years, that people are not addressing and seeing that these are real people.\" Refusing to let her differences keep her from pursuing her dreams, Crystal studied acting at LAMDA, one of the UK's top drama schools. Now a professional actress, she knows her appearance will always be judged. \"[My visible difference] is on my face. I can't really hide anything. Every time I talk or enter a room, it's not like anyone's fault, I just know that people have that first perception or viewpoint of me.\" \n                  Former London's Burning actor John Alford guilty of sexually assaulting girls aged 14 and 15\n                 \n                  Ibiza lizards 'near extinction' due to invasive snakes and mounting litter\n                 \n                  Legendary fashion designer Giorgio Armani dies\n                 With aspirations to one day appear in a Marvel movie, she hopes her drive to perform will help others in the future. \"I didn't have anyone who looked like me as a role model… It would have just been so much better if I'd had that one person to look up to, to be inspired by.\" Lack of representation is not the only problem. When visible difference does make it onto the screen, misrepresentations and negative overtones often reinforce stigma. Nearly one in five people in the UK self-identifying as having a visible difference, such as a mark, scar or condition, according to charity Changing Faces. New research they conducted into the way disfigurement is portrayed on screen found that people with visible differences were over twice as likely to be shown as a victim or a villain than as a love interest. Film and television have used scars, burns and birthmarks as a shorthand for villainy across the genres for years. From Bond to Batman and Star Wars, to more family-friendly productions such as The Lion King. And while visibly different characters aren't common on screen, a woman with a physical difference in film or TV is even rarer. Author and entertainment journalist Kristen Lopez says it's because women's value on screen is so tied up with their sexuality. The author of Popcorn Disabilities: The Highs and Lows of Disabled Representation in the Movies has even come up with a term to describe the industry's attempt to keep their leading ladies \"sexy and beautiful\". \"You often see what I call 'pretty disabilities'. It's a disability that is not going to affect the physical perfection of the actress. And it will also allow for an A-list, usually non-disabled actress, to continue to play the character.\" Lopez says for that reason, films are more comfortable with portraying blind or visually impaired women, deaf women, or non-verbal women, because their disability \"doesn't mar the face\". Speaking from her own experience of growing up with brittle bone disease, she says: \"I worry about the next generation of disabled girls - what are they seeing? Do they feel represented? \"How do you navigate adolescence if you don't see anybody that looks like you doing the things that every other young person is doing?\" Romeo Olukotun was just one year old when an accident left him with second and third-degree burns on his torso, chest and neck. With his accident not spoken about at home, he admits, \"I just kind of had to deal with that on my own\". He did find some flashes of inspiration, including from singer Seal. \"I loved how even though he had a visible difference and scarring on his face, he wasn't looked down because of that. He was seen for his talent.\" With his confidence taking a hit due to his scars while at secondary school and university, he rebuilt his self-esteem as an adult through cheerleading. Later spotted at a music video shoot he'd gone along to with a friend, he's now an actor and model. But his visible differences have, at times, affected his casting. Romeo told Sky News: \"Because my scar on my neck looks like I've been stabbed, I would often be asked to 'Try this [performance] like a thug or someone who's on the streets'. And I didn't like being labelled as that. I'm someone who is much more than my scars.\" He's now a man on a mission: \"I want to be someone who shows other people with a visible difference that they can be anything. They can play the romantic lead, they can play a villain if they want to. They can be a hero, not just be labelled as someone sinister and evil, Machiavellian.\" While the film and TV industries might be slow to change, LAMDA vice principal Dr Philippa Strandberg-Long is hopeful for the future. \"We have to make our students aware of the industry that they are going into and not, I guess, create a utopia where they're not aware of the industry they're going into. However, we can change it from how we educate our students that come out. \"Things won't change overnight, but it will change over time. So, we have to put in the work at the grassroots, which is here.\" Changing Faces is the UK's leading charity for anyone with a visible difference. They have a confidential support and information line for anyone dealing with the impact of visible difference."
    }
]