[
    {
        "title": "Trump tells Israel 'stop bombing Gaza' - as Hamas agrees to release Israeli hostages, and to parts of peace deal ",
        "description": "Donald Trump has said Hamas is ready for a \"lasting peace\" after the Palestinian militants agreed to release all remaining hostages, as he called on Israel to stop bombing Gaza.",
        "url": "https://news.sky.com/story/hamas-agrees-to-release-all-remaining-israeli-hostages-but-seeks-further-talks-on-trumps-peace-deal-13443611",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-israel-gaza-palestine_6896665.jpg?20250425184431",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-03 19:57:00",
        "Headline": "The US leader had earlier warned he would unleash \"all hell\" if Hamas did not respond to his proposals.",
        "Content": " Donald Trump has said Hamas is ready for a \"lasting peace\" after the Palestinian militants agreed to release all remaining hostages, as he called on Israel to stop bombing Gaza. The US leader was responding to a statement by Hamas on Friday in which the group committed to returning all remaining hostages in Gaza, dead and alive. Hamas also said it wants to engage in negotiations to discuss further details of the president's peace plan, including handing over \"administration of the enclave to a Palestinian body of independent technocrats\". However, other aspects of the 20-point document, it warned, would require further consultation among Palestinians.  The Hamas statement came after Mr Trump warned he would unleash \"all hell\" if they did not respond to his peace plan, announced earlier this week, by Sunday. Following the group's response, the president said there was now a real chance of peace. \"I believe they are ready for a lasting PEACE,\" Mr Trump posted on Truth Social. \"Israel must immediately stop the bombing of Gaza, so that we can get the Hostages out safely and quickly! \n                  Trump sets new deadline for Hamas to agree Gaza deal with Israel - or face 'all hell'\n                 \n                  MPs tell Starmer it's 'more urgent than ever' to create Ukraine-style family visa for Gazans\n                 \n                  Will Trump's Gaza plan leave eternal peace in the Middle East? \n                 \"Right now, it's far too dangerous to do that. We are already in discussions on details to be worked out. This is not about Gaza alone, this is about long sought PEACE in the Middle East.\" In a video later posted on his Truth Social platform, Mr Trump called it a \"very special day\" and said the end of the war was \"very close\". Prime Minister Benjamin Netanyahu said Israel was prepared for the implementation of the \"first stage\" of Mr Trump's plan, apparently in reference to the release of hostages.  Starmer calls for 'agreement without delay' Sir Keir Starmer said Hamas's partial acceptance of the peace plan was a \"significant step forwards\" and called for an \"agreement without delay\". The prime minister said Mr Trump's efforts \"have brought us closer to peace than ever before\" and added: \"There is now an opportunity to end the fighting, for the hostages to return home, and for humanitarian aid to reach those who so desperately need it. \"We call on all sides to implement the agreement without delay.\" He went on to say the UK was ready to support further negotiations and work \"towards sustainable peace for Israelis and Palestinians alike\". French President Emmanuel Macron said \"the release of all hostages and a ceasefire in Gaza are within reach\", while a spokesperson for UN Secretary General Antonio Guterres urged \"all parties to seize the opportunity\". Hamas agrees to release hostages The breakthrough came just hours after Mr Trump had set a new deadline of Sunday to respond to his proposals, backed by the Arab nations. The US president and the Israeli prime minister unveiled the peace plan at the White House on Monday. Israel agreed to the terms, which include an immediate ceasefire; the release of all hostages; Hamas disarming; a guarantee no one will be forced to leave Gaza and a governing \"peace panel\" including Sir Tony Blair. And on Friday, a statement from Hamas confirmed \"its approval to release all prisoners of the occupation - whether alive or the remains of the deceased - according to the exchange framework included in President Trump's proposal\". Israel estimates 48 hostages remain in Gaza, 20 of whom are alive. Hamas official says group will not disarm 'before Israeli occupation ends' The group also said it was ready to engage in negotiations through mediators and it appreciated \"Arab, Islamic and international efforts, as well as the efforts of US President Donald Trump\". But, Hamas official Mousa Abu Marzouk told Al Jazeera news the group would not disarm \"before the Israeli occupation ends\". By Celine Alkhaldi, Middle East producer\n\n Hamas has issued a carefully worded response to Donald Trump's Gaza proposal. \n The movement welcomed international efforts to end the fighting, agreed in principle to the release of all Israeli hostages, and said it is prepared to begin negotiations on the details of an agreement. It also renewed its commitment to handing over administration of Gaza to a committee of Palestinian technocrats formed by national consensus and backed by Arab and Islamic states.  That position has been consistent for months and was not part of Mr Trump's plan.  On wider questions, Hamas said decisions must be taken within a comprehensive Palestinian framework, leaving the most sensitive issues for future discussion. The statement appears to accept parts of Mr Trump's proposal, but in some areas it does not match its terms.  Hamas made no mention of disarmament, avoided any pledge to withdraw permanently from governing, and linked any hostage deal to a complete Israeli withdrawal. Taken together, the response shows a willingness to engage on humanitarian and political steps already familiar from past proposals, while deferring the core disputes to a broader Palestinian process. Hamas does not know where all hostages are Sky News Middle East correspondent Adam Parsons said the \"most important part\" of the Hamas response was that it showed a willingness to do a deal. \"The peace plan could have died - Hamas could have rejected it - but it is still alive.\" He said there were still \"huge obstacles\" which would prevent outright acceptance though. In spite of a pledge to release hostages, he said Hamas did not entirely know where all of them were - some were even being held by other groups. Hamas's support for a new government for Palestine was positive, he said, but the specification in the Hamas response that it should be purely Palestinian and not, as Mr Trump had proposed, a \"panel\" that included external representatives, would be problematic."
    },
    {
        "title": "Manchester synagogue attack: Families pay tribute to 'kind and heroic' victims - as police arrest three more suspects",
        "description": "The families of the two victims of the Manchester synagogue attack have paid tribute to them as \"heroic, beloved and cherished\".",
        "url": "https://news.sky.com/story/two-men-killed-in-manchester-synagogue-attack-named-as-police-step-up-patrols-13443311",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-synagogue_7040462.jpg?20251003191752",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-03 04:41:00",
        "Headline": "The Independent Office for Police Conduct (IOPC) is investigating the shooting - standard practice when a member of the public is killed.",
        "Content": " The families of the two victims of the Manchester synagogue attack have paid tribute to them as \"heroic, beloved and cherished\". Adrian Daulby, 53, and Melvin Cravitz, 66, were killed in the attack at Heaton Park synagogue in Crumpsall on Thursday. Mr Daulby, a member of the congregation, was shot accidentally when police opened fire on attacker Jihad al Shamie. The synagogue's rabbi told Sky News it happened as Mr Daulby \"was holding the doors to make sure everyone inside stayed safe\".  His family said he was a \"hero\" and a \"lovely down-to-earth man\" whose \"final act was one of profound courage and he will forever be remembered for his heroic act\". The family of Mr Cravitz - a security guard at the synagogue who was attending the service - said he would \"do anything to help anyone\". \"He was so kind, caring and always wanted to chat and get to know people,\" they said. \"He was devoted to his wife, family and loved his food. He will be sorely missed by his wife, family, friends and community.\" The tributes came as police said three more people - a man and two women - had been arrested on suspicion of terror offences, bringing the total to six. They also revealed the attacker had been on bail over a suspected rape, but wasn't on the radar of counter-terror police. The Independent Office for Police Conduct (IOPC) is investigating the shooting - standard practice when a member of the public is killed. The investigation would include \"whether police may have caused or contributed to the death\" of Mr Daulby. Sir Stephen Watson, the head of Greater Manchester police, confirmed Mr Daulby's injury appeared to be \"a tragic and unforeseen consequence of the urgently required action taken by my officers\". 'Gentle giant' Other relatives of Mr Cravitz told Sky News he was a \"gentle giant\" who \"would never harm a fly\".  His cousin, Phil Bentley, said his death was even more tragic as he would never normally be at the synagogue that early. Hindi Cohen, a friend and neighbour, said he was a \"lovely man\" with a good sense of humour, adding: \"Our kids loved him. He called himself uncle Melvin to my kids.\" One of Mr Daulby's neighbours was also emphatic in his praise for a man he lived next door to for 20 years. Abdul Rahimi called him \"one of the best guys I've ever seen in my life\" and a \"very, very good man\", who often bought books and toys for children on their street.  Another neighbour, Waqas Hussain, said the pair bonded over a shared love of nature, animals and birds. He said Mr Daulby was a cancer survivor, who lived alone and started going to the synagogue more after his father died a few years ago. \"Just one of them people... so innocent, so approachable and so pure,\" he told Sky News. He said his friend hadn't been fasting for health reasons and was debating whether or not to go the synagogue on Thursday. Increased police patrols are being put in place near synagogues across the country following the atrocity.  Lammy heckled at vigil Police in London and Manchester have urged people not to hold planned protests in the cities this weekend so they can keep officers free. A vigil for the victims was also held in Manchester on Friday - but Deputy Prime Minister David Lammy walked out to shouts of \"shame on you\" and boos from a few in the crowd.  \"Go to Palestine but leave us alone,\" one person shouted. Another protester shouted \"my children's school was closed today - you allowed this to happen.\" Read more:Ex-minister says father-in-law was at synagogue attackAttacker's family condemn 'heinous act' Thirty-five-year-old Jihad al Shamie was named as the attacker on Thursday and is believed to be of Syrian descent. He is understood to have been granted British citizenship when he was around 16, having entered the UK as a young child. Police shot him dead seven minutes after the first emergency call as they feared he was wearing an explosive device - later identified as a fake.  Three men also remain in hospital after the attack, with two of them named as Yoni Finlay and Andrew Franks. One suffered a stab wound, a second was hurt after being hit by a car that al Shamie is said to have driven towards the synagogue, and the third suffered a gunshot wound. One of the injured victims was working for the Community Security Trust (CST), a charity which provides security to the Jewish community. Its chief executive, Mark Gardner, said: \"One of our CST personnel was seriously injured in yesterday's terror attack at Heaton Park Synagogue. \"We pray for his continuing recovery and salute the courage of all those who helped stop the terrorist from getting into the shul.\""
    },
    {
        "title": "Sean 'Diddy' Combs sentenced to more than four years in prison",
        "description": "Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers.",
        "url": "https://news.sky.com/story/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison-13443408",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-diddy-combs-court_7040465.jpg?20251003192849",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-10-03 08:48:00",
        "Headline": "The hip-hop mogul was convicted of two prostitution-related offences but cleared of the more serious charges of sex-trafficking and racketeering conspiracy following his high-profile trial earlier this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers. Judge Arun Subramanian handed down his 50-month sentence - including a $500,000 fine - at the end of a long and emotional full-day hearing, which saw the hip-hop mogul speak out for the first time in court. Combs, 55, admitted his past behaviour was \"disgusting, shameful and sick\", and apologised personally to Cassie Ventura and \"Jane\", another former girlfriend who testified anonymously during the trial. But despite his plea for \"mercy\" and expressions of remorse, the judge told him he had abused his \"power and control\" with women he professed to love - and rejected the defence's characterisation that \"freak off\" sexual encounters were consensual experiences, that his was just a \"sex, drugs and rock'n'roll story\". Addressing Cassie and \"the other brave survivors who came forward\", the judge said. \"We heard you... I can only say your families are proud of you and your children will be proud of you. \"You weren't just talking to the jury you were talking to the women who feel powerless - you gave them a voice, you stood up to power, it's not easy.\" Combs showed no visible change of emotion as his sentence was delivered, looking straight ahead as the judge spoke. Afterwards, he seemed subdued - with no sign of the enthusiasm or feeling showed earlier in the day. Ahead of his own speech, the court heard from six of his seven children - causing the rapper to break down in tears as they spoke about how much they loved him, how he has changed, and how much they and their younger two-year-old sister need him. The sentencing brings to an end a sordid case that featured harrowing testimony - not just from Cassie and Jane, but also from former employees and associates of Combs. He was convicted in July of flying people around the US and abroad for sexual encounters, including his then girlfriends and male sex workers, in violation of prostitution laws. However, he was cleared of more serious charges of racketeering conspiracy and sex-trafficking that could have put him in jail for life. 'I hate myself right now' On the eve of his sentencing, Combs submitted a letter to the judge pleading for \"mercy\" and apologising for the \"hurt and pain\" he has caused others. He expanded on this in court, saying he wanted to \"personally apologise\" to Cassie for \"any harm\" he caused her \"emotionally or physically\", and to Jane - and all victims of domestic violence. He told the court he got \"lost in my excess and lost in my ego\", but since his time in prison he has been \"humbled and broken to my core\". Combs continued: \"I hate myself right now... I am truly sorry for it all.\" Read more:The rise and fall of DiddyDiddy sentencing: As it happened Once one of the most influential hip-hop producers of the 1990s and 2000s - the founder of Bad Boy Records and a Grammy-winning artist in his own right - he has led a very different life since his high-profile arrest. He was facing a maximum of 20 years in prison for the prostitution-related charges, so the sentence is towards the lower end of the scale. Prosecutors had argued he should spend at least 11 years behind bars, while Combs's lawyers were calling for him to be freed almost immediately due to time already served since his arrest just over a year ago. Christy Slavik, for the prosecution, told the judge sparing the rapper serious prison time would excuse years of violence. 'Make the most of that second chance' The judge, who had rejected bail for the rapper several times before sentencing, told him that he would get through his time in prison. It will be hard, he said, but he will still \"have a life afterwards\". Combs has \"a chance for renewal and redemption\", he added. \"What went wrong can be made right... I am counting on you to make the most of that second chance.\" Outside the courthouse, journalists and onlookers swarmed the pavements as TV crews stood in a long row across the street, echoing scenes from the two-month high-profile trial. It included four days of testimony from Cassie, now Cassie Ventura Fine, who told the court she was coerced and sometimes blackmailed into sexual encounters with male sex workers, referred to as \"freak offs\". Cassie responds Jurors were also shown video clips of Combs dragging and beating her in a Los Angeles hotel hallway after one of those sessions in 2016. Combs referred to this in court, saying it was a \"heavy burden\" that he will forever carry, and that he was \"sick from drugs\" and \"out of control\" at the time, \"lost in my excess and lost in my ego\". Ahead of the sentencing, Cassie also submitted a letter to the judge, calling Combs a \"manipulator\" and saying she would fear for her safety should he be immediately released. Responding to the sentence, her lawyers Douglas Wigdor and Meredith Firetog (Wigdor LLP), said: \"While nothing can undo the trauma caused by Combs, the sentence imposed today recognises the impact of the serious offences he committed. \"We are confident that with the support of her family and friends, Ms Ventura will continue healing knowing that her bravery and fortitude have been an inspiration to so many.\""
    },
    {
        "title": "Man dies and tens of thousands without power as Storm Amy brings 90mph winds to UK and Ireland",
        "description": "A man has died and hundreds of thousands were left without power after Storm Amy brought 90mph winds and heavy rain to parts of the UK and Ireland.",
        "url": "https://news.sky.com/story/man-dies-and-tens-of-thousands-without-power-as-storm-amy-brings-90mph-winds-to-uk-and-ireland-13443835",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-weather-galway-storm-amy_7040721.jpg?20251003220615",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-03 20:17:00",
        "Headline": "Irish police say the death of a man in his 40s in the Letterkenny areas of Co Donegal was being treated as weather related.",
        "Content": "A man has died and hundreds of thousands were left without power after Storm Amy brought 90mph winds and heavy rain to parts of the UK and Ireland. A yellow weather warning covers the whole of Britain from midnight and is in force for most of Saturday. The Scottish island of Tiree so far tops the wind charts at 96mph, followed by 85mph at Capel Curig in North Wales - which also had 43mm of rain on Friday. Get the Sky News forecast for your area  The worst gusts have been in the North, but the Met Office said it is likely to be very windy everywhere on Saturday. It warned of possible disruption to public transport, hazardous driving conditions, potential power cuts and dangerous waves. Exposed coastal and hilly areas, such as Scotland's far north - where an amber warning indicates potential danger to life - could again see gusts of 90mph. Gusts of 45-55mph are likely elsewhere across the UK, with heavy rain also expected in western Scotland. \"The very strong winds will also be accompanied by spells of heavy rain, with difficult driving conditions likely, especially for high-sided vehicles on prone routes, such as crosswinds on exposed or high-level routes,\" said the Met Office. ScotRail said some lines were shutting on Friday evening, with speed restrictions on all other routes. Many schools in Northern Ireland were also advised to close at midday on Friday, while residents in County Donegal, in the Republic of Ireland, were put under the maximum red warning and told to \"shelter in place\" until 6pm. Irish police said the death of a man in his 40s in the Letterkenny areas of Co Donegal was being treated as weather related.  Read more: What are weather warnings and how do they work? Around 184,000 homes, farms and businesses across Ireland were also without power at 5.15pm, according to the Electricity Supply Board (ESB). In Northern Ireland, NIE Networks said 50,000 properties had been cut off. However, the worst of the storm should ease for the vast majority of the country on Sunday as the storm moves towards Scandinavia. Amy is the first named storm of the new season, which began on 1 September. The names are chosen from thousands of public suggestions each year. The next few storms will be named Bram, Chandra - and Dave."
    },
    {
        "title": "Expert 'kept awake at night' over fear of deadly brain disease passed on in transfusions",
        "description": "A senior government adviser on the safety of blood transfusions has told Sky News he is \"kept awake at night\" worrying about the possibility of a deadly brain disease being passed from donor to patient.",
        "url": "https://news.sky.com/story/expert-kept-awake-at-night-over-fear-of-deadly-brain-disease-passed-on-in-transfusions-13442969",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-blood-donor-transfusion_6752456.jpg?20241119231626",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "Professor James Neuberger says blood transfusions should only be given \"when necessary\" and that patients should be informed of the risks.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n A senior government adviser on the safety of blood transfusions has told Sky News he is \"kept awake at night\" worrying about the possibility of a deadly brain disease being passed from donor to patient. Professor James Neuberger was speaking after a Sky News investigation into the case of Natalie Bralee-Brett and her brother Neil, who both became infected with the potentially deadly brain disease iatrogenic cerebral amyloid angiopathy (ICAA). Natalie and Neil underwent childhood NHS operations involving infected tissue taken from dead bodies and transplanted into their own. As a result, Natalie suffers from bleeding on the brain and is at high risk of a fatal stroke and developing Alzheimer's. Her brother's condition has deteriorated to the extent that he has now been forced to give up work. Speaking to Sky News, Professor Neuberger said: \"The ICAA is a much more difficult problem and a much more challenging one, and certainly one that keeps me and my colleagues awake at night. \"At the moment consensus is that this is of concern. We need to make sure that blood transfusion is given only when necessary. \"We need people to understand that blood transfusion carries risk and although as I say blood is very safe in the UK we need to ensure that patients understand that there is a risk.\" \n                  Two species of disease-carrying mosquitoes found in UK\n                 \n                  Cannabis extract reduces chronic low back pain without risk of addiction, study suggests\n                 \n                  Donald Trump's health claims 'really dangerous', autism community warns\n                 Prof Neuberger is the chair of SaBTO, the UK's Advisory Committee on the Safety of Blood, Tissues and Organs, an independent body that provides advice to UK health ministers and departments - as well as the UK Blood and Transplant services - to ensure the safety of blood, cells, tissues, and organs used for transfusion and transplantation. ICAA happens when a protein called amyloid builds up in the blood vessels of the brain - making them fragile and more likely to bleed. Read more:NHS cadaver implant leaves woman with one of world's rarest diseases Link between disease and blood transfusions Usually, it affects people in their 70s and 80s, but in rare cases it can appear much earlier. When it develops after a medical procedure, it's called iatrogenic CAA (ICAA). US researchers working with a cohort of patients with the condition between November 2023 and January 2024 established a link between the disease and blood transfusions. Of 35 patients screened, they discovered two (6%) had a clear history of blood transfusion. Both had received the transfusions as children, decades before showing symptoms. They were diagnosed with CAA much earlier than usual at ages 47 and 57. Both already had severe disease. If blood transfusions can spread amyloid protein, even rarely, this would have important consequences for blood safety. A spokesperson for NHS Blood and Transplant said: \"Scientists and doctors are much more aware of emerging risks than in the past. The blood safety system is also much more responsive to those risks. \"The current systems in place are more effective in maintaining the safety of the blood supply than ever before. We currently have one of the safest blood supplies in the world. \"We follow the advice of several independent expert committees and bodies including SaBTO, the UK's Advisory Committee on the Safety of Blood, Tissues and Organs. We're currently awaiting the outcome of SaBTO's work into iatrogenic cerebral amyloid angiopathy. SaBTO will usually make recommendations to ministers and it is for ministers to decide whether these recommendations should become guidance. \"The potential risks around iatrogenic cerebral amyloid angiopathy and blood transfusions are unknown. However, it is important to remember that while we have extensive blood safety systems in place, all blood transfusions are not, and never will be, without risk. That is why it is important that all blood transfusions are given only when necessary.\""
    },
    {
        "title": "Sky News joins NATO air patrol designed to deter Russia from pushing boundaries",
        "description": "Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane.",
        "url": "https://news.sky.com/story/sky-news-joins-nato-air-patrol-designed-to-deter-russia-from-pushing-boundaries-13443911",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nato-typhoons_7040777.jpg?20251004003944",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane. One suddenly turns on its wing and dips below us, reappearing alongside our other flank, its sharp nose seeming to reach out for the nozzle of an outstretched hose which trails from the wings of our RAF Voyager jet like a jellyfish on a long tentacle, tossed about by savage currents. Air-to-air refuelling at high speeds and in high winds looks, from my perspective less than 10m away, fiendishly hard. It takes several minutes and several attempts before the pilot finally manages to latch the probe on the side of their jet on to the fuel hose nozzle and start to fill up, guzzling as much as four tonnes of fuel in one go. But this is what they're trained for: highly technical manoeuvres at high speeds. The two RAF Typhoons on mission with us will refuel four times that night. It's a force multiplier. It means they'll be in the air and on patrol that much longer. We're flying on a nighttime mission over Poland as part of NATO's Operation Eastern Sentry. The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September, the first time the alliance has had to deal with a coordinated and deliberate drone incursion into its airspace. They were inexpensive Gerbera decoy drones, a way of testing NATO's defences and a warning from the Kremlin that Russia can do much worse in the way of drone warfare if European leaders continue to pour money and weapons into Ukraine. Yes, the Typhoons can down any airborne threat, drones included, given they have Advanced Short Range Air-to-Air Missiles (ASRAAM) and a 27mm Mauser cannon. Yes, that is a significant amount of firepower to use against what could end up being just an unarmed piece of plywood with a GPS tracker on it. But this is an exercise in deterrence, to let Russia know that NATO is alert and ready, as European leaders gather to discuss how best to defend against drones beyond conventional air defence. For that, they're employing Ukraine's hard-won expertise, developed beneath the misery of their drone-filled skies. Read more:Airport drone sightings - what we knowPutin issues defiant message Russia's warning shot to NATO Germany and Denmark are both reporting unidentified drone sightings over key installations, forcing them to close airspace including, temporarily, Copenhagen and Munich airports. Estonia escorted Russian MiG fighter jets from its airspace after a 12-minute incursion. Russia is pushing boundaries, a warning shot to NATO as it deliberates support for Ukraine. Moscow, of course, denies all this.  For Vladimir Putin NATO is war-mongering. \"We're closely monitoring the growing militarisation of Europe. Is this just talk, or is it time for us to take countermeasures?\" he asked the audience at the annual Valdai meeting, a veiled threat if ever there was one. But that is the status quo between Russia and NATO. Veiled threats and hybrid warfare, with drones a new weapon in Russia's arsenal. NATO hopes to make Putin recognise limitations of his armed forces As French President Emmanuel Macron said, NATO's best defence is \"more unpredictability and more strategic ambiguity\". And images of what NATO is capable of, the mastery of its fighter jets, the coordinated armies within its command and their shared commitment to common defence, those are intended to make Russia's leader take stock and recognise the limitations of his exhausted and overstretched armed forces. Whether they do or not, well - that is a completely different matter."
    },
    {
        "title": "Power outage in Spain and Portugal 'first known blackout caused by excessive voltage'",
        "description": "A massive power outage which brought much of Spain and Portugal to a standstill earlier this year is the first known blackout caused by excessive voltage, a report has found.",
        "url": "https://news.sky.com/story/power-outage-in-spain-and-portugal-first-known-blackout-caused-by-excessive-voltage-13443544",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-spain-barcelona-power-outage_6900317.jpg?20250428233213",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-03 15:41:00",
        "Headline": "Huge swathes of Spain and Portugal, including major cities like Barcelona, Lisbon, Madrid, Porto and Seville, were affected by the power outage - Europe's most significant blackout in more than two decades.",
        "Content": "A massive power outage which brought much of Spain and Portugal to a standstill earlier this year is the first known blackout caused by excessive voltage, a report has found. The blackout on 28 April stranded thousands of train passengers and left millions of people without phone and internet coverage and access to cash from ATMs across the Iberian Peninsula. Huge swathes of Spain and Portugal, including major cities like Barcelona, Lisbon, Madrid, Porto and Seville, were affected by the power outage - Europe's most significant blackout in more than two decades. Like previous probes, the report by the European network of electricity transmission system operators pointed to a surge in voltage as the immediate cause of the outage. A final report, due in the first quarter of 2026, will investigate the root causes and steps taken to control voltage in the system. Damian Cortinas, chair of ENTSO-E's board, said there was no indication that a cyber attack had occurred. Mr Cortinas also said that Spain's increasing dependence on renewable energy and its limited power interconnections with other countries had not contributed to the outage. \n                  Spain: Ibiza and Formentera hit by widespread flooding as red alert issued amid 'extraordinary danger'\n                 \n                  Spanish defence minister's jet suffers GPS disturbance near Russian enclave\n                 \n                  Could Eurovision boycotts over Israel lead to a competition crisis?\n                 \"If there had been double the interconnection capacity, this would not have stopped the blackout, and this would not have accelerated the recovery,\" Mr Cortinas said. Read more from Sky News:Woman named as new Archbishop of Canterbury in historic firstTaylor Swift releases highly anticipated new album After the blackout, the Spanish and Portuguese governments have urged the EU to help them develop new power links with other countries, which they say would help their power grids respond to disruptions. The report follows several others by the Spanish government and power and grid companies. The national energy watchdog and Spanish politicians are also conducting separate probes. Redeia, owner of grid operator REE, has blamed the blackout on some power plants' failure to help maintain appropriate voltage while Spanish utilities blamed the Spanish grid operator's poor planning."
    },
    {
        "title": "'Best month ever' for UK battery electric vehicle sales",
        "description": "Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures.",
        "url": "https://news.sky.com/story/best-month-ever-for-uk-battery-electric-vehicle-sales-13443516",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ev-evs-electric-cars_7040053.jpg?20251003124545",
        "type": "Home",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The Society for Motor Manufacturers and Traders attributed the rise to the government's Electric Car Grant scheme, along with factors such as an \"ever-increasing choice of models\".",
        "Content": "By Daniel Binns, business reporter  Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures. More than 72,000 new BEVs were registered in September, accounting for 23.3% of the total market, the Society for Motor Manufacturers and Traders (SMMT) said. It described the figures - a 29% rise on the 56,000 BEVs sold in September 2024 - as \"the best month on record for BEV volumes\". The motor lobby group attributed the increase to the government's Electric Car Grant scheme, as well as factors such as the \"ever-increasing choice of models\" in the sector. More than 20,000 consumers have taken advantage since the £650m grant scheme was launched earlier this summer. It offers discounts of up to £3,750 on 36 electric models. Overall, the SMMT said just over 50% of the 312,887 new vehicles registered last month were electric models, including both hybrid and battery types. The total number of newly registered cars and other vehicles was up nearly 14% compared to last year, the best September performance since 2020, it added. Manufacturers have been set a target of ensuring 28% of vehicles sold this year must be electric, although the mandate was relaxed earlier this year to include hybrid as well as battery-only cars. Mike Hawes, chief executive of the SMMT, said: \"Electrified vehicles are powering market growth after a sluggish summer - and with record ZEV [zero emission vehicles] uptake, massive industry investment is paying off, despite demand still trailing ambition. \"The Electric Car Grant will help to break down one of the barriers holding back more drivers from making the switch - and tackling remaining roadblocks, by unlocking infrastructure investment and driving down energy costs, will be crucial to the success of the industry and the environmental goals we share.\" However, the SMMT said more still needed to be done to \"re-energise\" private buyers to switch to electric. Read more from Sky News:Baroness Mone attacks 'reckless' BadenochCustomer details stolen in Renault cyber attackCotswold Company lays groundwork for sale Commenting on the figures, Colin Walker, from the Energy and Climate Intelligence Unit, said: \"Demand for electric cars is up again and factoring in the flexibilities the car industry lobbied for in the UK's EV policy, sales are now ahead of where they need to be to hit this year's target. \"That would be two years in a row that the targets would have been hit and drivers are making hundreds of pounds of savings each year by making the switch to electric.\" Transport Secretary Heidi Alexander added: \"Our discounts have sparked a surge in electric car sales, making them cheaper and within reach of more households than ever before.\""
    },
    {
        "title": "Keeping Up Appearances star Dame Patricia Routledge has died",
        "description": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said.",
        "url": "https://news.sky.com/story/keeping-up-appearances-star-dame-patricia-routledge-has-died-13443457",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-clive-swift-patricia-routledge_7039926.jpg?20251003111802",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-03 10:04:00",
        "Headline": "Though best known for playing the notoriously snobbish Hyacinth Bucket in Keeping Up Appearances, the actress received her damehood for services to the theatre and charity.",
        "Content": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said. \"We are deeply saddened to confirm the passing of Dame Patricia Routledge, who died peacefully in her sleep this morning surrounded by love,\" her agent said in a statement. \"Even at 96 years old, Dame Patricia's passion for her work and for connecting with live audiences never waned, just as new generations of audiences have continued to find her through her beloved television roles. \"She will be dearly missed by those closest to her and by her devoted admirers around the world.\" Dame Patricia played the notoriously snobbish Hyacinth Bucket in the BBC sitcom between 1990 and 1995, which attracted as many as 13 million viewers at its peak. She earned two BAFTA nominations for the role in 1992 and 1993. Another of her notable 90s TV appearances came when she played a pensioner-turned-detective in the £3m six-part BBC TV crime series Hetty Wainthropp Investigates. She also had a prolific career in the theatre, winning an Olivier Award for her role as the Old Lady in acclaimed composer Leonard Bernstein's operetta Candide in 1988, and a Tony Award for her part as Alice Challice in Darling Of The Day in 1968. The actress was honoured at Buckingham Palace in 2017, being made a Dame Commander of the British Empire for her services to the theatre and charity. She was born in Birkenhead, Merseyside in 1929, and went on to study English Language and Literature at the University of Liverpool, where she appeared in student shows before making her professional debut at the Liverpool Playhouse in 1952, playing Hippolyta in A Midsummer Night's Dream. Years later, after her career skyrocketed, she spoke of how important her northern roots were to her. \"You are never done with your roots. I think the people who try to make out that they are, are in deep trouble,\" she was once quoted as saying. Dame Patricia made her debut on a London stage in 1954, quickly establishing herself as a major character actress. She also became a Broadway star, wowing New York critics with her performance in the play How's The World Treating You? and appearing in numerous musicals. Later, Leonard Bernstein penned solos especially for her as she starred in the presidential drama 1600 Pennsylvania Avenue. Though she was best known for embodying Hyacinth Bucket in the '90s, she made memorable TV appearances from the 1950s. Notable roles included Victoria Regina for Granada in 1964 and Kitty in Victoria Wood: As Seen on TV in the mid-1980s. More recently, in 2016, Dame Patricia fronted a Channel 4 documentary celebrating the 150th anniversary of the birth of Beatrix Potter, having previously played the children's author on stage and in 2012. "
    },
    {
        "title": "Manchester synagogue attack: Families pay tribute to 'kind and heroic' victims - as police arrest three more suspects",
        "description": "The families of the two victims of the Manchester synagogue attack have paid tribute to them as \"heroic, beloved and cherished\".",
        "url": "https://news.sky.com/story/two-men-killed-in-manchester-synagogue-attack-named-as-police-step-up-patrols-13443311",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-synagogue_7040462.jpg?20251003191752",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-03 04:41:00",
        "Headline": "The Independent Office for Police Conduct (IOPC) is investigating the shooting - standard practice when a member of the public is killed.",
        "Content": " The families of the two victims of the Manchester synagogue attack have paid tribute to them as \"heroic, beloved and cherished\". Adrian Daulby, 53, and Melvin Cravitz, 66, were killed in the attack at Heaton Park synagogue in Crumpsall on Thursday. Mr Daulby, a member of the congregation, was shot accidentally when police opened fire on attacker Jihad al Shamie. The synagogue's rabbi told Sky News it happened as Mr Daulby \"was holding the doors to make sure everyone inside stayed safe\".  His family said he was a \"hero\" and a \"lovely down-to-earth man\" whose \"final act was one of profound courage and he will forever be remembered for his heroic act\". The family of Mr Cravitz - a security guard at the synagogue who was attending the service - said he would \"do anything to help anyone\". \"He was so kind, caring and always wanted to chat and get to know people,\" they said. \"He was devoted to his wife, family and loved his food. He will be sorely missed by his wife, family, friends and community.\" The tributes came as police said three more people - a man and two women - had been arrested on suspicion of terror offences, bringing the total to six. They also revealed the attacker had been on bail over a suspected rape, but wasn't on the radar of counter-terror police. The Independent Office for Police Conduct (IOPC) is investigating the shooting - standard practice when a member of the public is killed. The investigation would include \"whether police may have caused or contributed to the death\" of Mr Daulby. Sir Stephen Watson, the head of Greater Manchester police, confirmed Mr Daulby's injury appeared to be \"a tragic and unforeseen consequence of the urgently required action taken by my officers\". 'Gentle giant' Other relatives of Mr Cravitz told Sky News he was a \"gentle giant\" who \"would never harm a fly\".  His cousin, Phil Bentley, said his death was even more tragic as he would never normally be at the synagogue that early. Hindi Cohen, a friend and neighbour, said he was a \"lovely man\" with a good sense of humour, adding: \"Our kids loved him. He called himself uncle Melvin to my kids.\" One of Mr Daulby's neighbours was also emphatic in his praise for a man he lived next door to for 20 years. Abdul Rahimi called him \"one of the best guys I've ever seen in my life\" and a \"very, very good man\", who often bought books and toys for children on their street.  Another neighbour, Waqas Hussain, said the pair bonded over a shared love of nature, animals and birds. He said Mr Daulby was a cancer survivor, who lived alone and started going to the synagogue more after his father died a few years ago. \"Just one of them people... so innocent, so approachable and so pure,\" he told Sky News. He said his friend hadn't been fasting for health reasons and was debating whether or not to go the synagogue on Thursday. Increased police patrols are being put in place near synagogues across the country following the atrocity.  Lammy heckled at vigil Police in London and Manchester have urged people not to hold planned protests in the cities this weekend so they can keep officers free. A vigil for the victims was also held in Manchester on Friday - but Deputy Prime Minister David Lammy walked out to shouts of \"shame on you\" and boos from a few in the crowd.  \"Go to Palestine but leave us alone,\" one person shouted. Another protester shouted \"my children's school was closed today - you allowed this to happen.\" Read more:Ex-minister says father-in-law was at synagogue attackAttacker's family condemn 'heinous act' Thirty-five-year-old Jihad al Shamie was named as the attacker on Thursday and is believed to be of Syrian descent. He is understood to have been granted British citizenship when he was around 16, having entered the UK as a young child. Police shot him dead seven minutes after the first emergency call as they feared he was wearing an explosive device - later identified as a fake.  Three men also remain in hospital after the attack, with two of them named as Yoni Finlay and Andrew Franks. One suffered a stab wound, a second was hurt after being hit by a car that al Shamie is said to have driven towards the synagogue, and the third suffered a gunshot wound. One of the injured victims was working for the Community Security Trust (CST), a charity which provides security to the Jewish community. Its chief executive, Mark Gardner, said: \"One of our CST personnel was seriously injured in yesterday's terror attack at Heaton Park Synagogue. \"We pray for his continuing recovery and salute the courage of all those who helped stop the terrorist from getting into the shul.\""
    },
    {
        "title": "What we know about Manchester attacker Jihad al Shamie -  as his family condemn 'heinous act'",
        "description": "The Manchester synagogue attacker was a British citizen of Syrian descent who came to the UK as a small child and had not previously been on the radar of police or MI5.",
        "url": "https://news.sky.com/story/what-we-know-about-manchester-terrorist-jihad-al-shamie-as-new-picture-emerges-13443361",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-scene-believed-manchester_7039004.jpg?20251002213459",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-03 07:35:00",
        "Headline": "The 35-year-old was shot dead by police after launching a car and knife attack at a synagogue in Crumpsall. ",
        "Content": "The Manchester synagogue attacker was a British citizen of Syrian descent who came to the UK as a small child and had not previously been on the radar of police or MI5. Jihad al Shamie, 35, was shot dead by armed officers seven minutes after launching a car and knife attack while wearing what appeared to be a vest with an explosive device, which was later found to be fake. Manchester attack latest: Police on 'high alert' across country Adrian Daulby, 53, and Melvin Cravitz, 66, were killed after he drove at people outside Heaton Park Hebrew Congregation Synagogue, in Crumpsall, before stabbing a man. One of the victims killed in yesterday's attack was shot mistakenly by officers during their attempts to bring the attacker under control, Greater Manchester Police believe. Three others remain in hospital with serious injuries. Three people - two men in their 30s and a woman in her 60s - have been arrested on suspicion of the preparation or commission of acts of terrorism. \n                  'Hero' shot dead by accident was holding Manchester synagogue doors to block attacker, rabbi says\n                 \n                  Former minister Grant Shapps reveals his father-in-law was present at 'chilling' Manchester synagogue attack\n                 \n                  Police call for protest against Palestine Action ban to be cancelled after Manchester synagogue attack\n                  But Home Secretary Shabana Mahmood said it is \"too early\" to say if there was a terrorist cell behind the attack on Thursday morning, which took place on Yom Kippur, Judaism's holiest day. She said al Shamie, who is of Syrian descent, came to the UK as a \"small child\" and was naturalised as a British citizen in the mid-2000s. The home secretary also said he was not known to the security services or police and had not been referred to the government's Prevent anti-radicalisation scheme. Asked about the attacker's name on LBC, which presenter Nick Ferrari translated as \"struggle of the Syrian\", she said: \"I was very surprised to discover that name myself. \"Actually, as a Muslim, I've never heard someone being called Jihad, but it is the name that he was born with - that has always been his name.\" Al Shamie is believed to have lived in a council house in a quiet cul-de-sac in Langley Crescent, Prestwich, around two miles from the scene. Videos obtained by Sky News show armed police, with a dog and a chainsaw, raiding the address at around 3.30pm on Thursday. Read more:Synagogue terror victims namedHow the attack unfoldedWorshippers leaving synagogue hear news of attack In a post on Facebook, apparently from his family, his relatives said the attack \"has been a profound shock to us\". \"The al Shamie family in the UK and abroad strongly condemns this heinous act, which targeted peaceful, innocent civilians,\" they said. \"We fully distance ourselves from this attack and express our deep shock and sorrow over what has happened. \"Our hearts and thoughts are with the victims and their families, and we pray for their strength and comfort.\" Seen lifting weights One of al Shamie's neighbours said: \"We used to see him out in the garden working out, doing weights, press-ups. \"He used to change his clothes. One day he would be wearing the full gown, to the floor and the next jeans and pyjama bottoms.\" Geoff Haliwell, 72, told Sky News the property used to be on his window cleaning round and he believed the al Shamie family, including his mother, father and brothers, had lived there for around 20 years. \"There's no way I could've thought they were in any way involved in anything like this,\" he said, describing the family as \"nice people\". He said he had also seen Jihad al Shamie use benches to work out and said he would sometimes wear western clothes and at other times \"traditional\" Syrian dress, but showed no signs of radicalisation. \"[He was a] smashing lad to talk to, just the same as everyone else. He didn't stand out in any way,\" he added. Another neighbour, Kate McLeish, said she thought al Shamie was \"an odd guy\" and said he used to park his battered black Kia \"quite badly on the road\". The Syrian British Consortium, an organisation representing Syrians in the UK, said no one in its community networks has been able to identify him or confirm knowing him personally."
    },
    {
        "title": "'Hero' shot dead by accident was holding Manchester synagogue doors to block attacker, rabbi says",
        "description": "The man accidentally shot dead during the Manchester synagogue attack was holding the doors shut to make sure the knifeman could not enter, says rabbi Daniel Walker.",
        "url": "https://news.sky.com/story/hero-shot-dead-by-accident-was-holding-manchester-synagogue-doors-to-block-attacker-rabbi-says-13443656",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rabbi-walker-manchester-synagogue_7040430.jpg?20251003185046",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-03 16:12:00",
        "Headline": "The synagogue's rabbi says the \"pain is very raw - we are still in the crisis stage - but we are strong and we are going to recover\".",
        "Content": " The man accidentally shot dead during the Manchester synagogue attack was holding the doors shut to make sure the knifeman could not enter, says rabbi Daniel Walker. Police revealed earlier that one of the two victims died from a police bullet, fired as officers shot dead Jihad al Shamie. Attack latest: Al Shamie was on bail for alleged rape Rabbi Walker told Sky News: \"One of the men was murdered entering into the synagogue from the outside on his way to pray, he was coming for morning services, Yom Kippur, and his life was taken. \"The other man was inside the foyer, helping hold the doors to stop the terrorist coming in and when shots were fired he was fatally wounded. \"That was Adrian, who was holding the doors to make sure everyone inside stayed safe.\" Adrian Daulby's family have described the 53-year-old a \"hero\" and a \"down-to-earth man\" who would \"forever be remembered for his heroic act\". \n                  Former minister Grant Shapps reveals his father-in-law was present at 'chilling' Manchester synagogue attack\n                 \n                  What we know about Manchester attacker Jihad al Shamie -  as his family condemn 'heinous act'\n                 \n                  Police call for protest against Palestine Action ban to be cancelled after Manchester synagogue attack\n                 One of his neighbours, Abdul Rahimi, told Sky News he was a \"very, very good man\" who often bought books and toys for children on their street. It comes as police said on Friday night that three more people - a man and two women - had been arrested on suspicion on terror offences, bringing the total to six. Synagogue security guard Melvin Cravitz, 66, was the other man killed in Thursday's attack at Heaton Park synagogue His relatives told Sky News he was a \"gentle giant\" who \"would never harm a fly\". In another tribute issued via the police, they added: \"Melvin would do anything to help anyone. He was so kind, caring and always wanted to chat and get to know people. \"He was devoted to his wife, family and loved his food. He will be sorely missed by his wife, family, friends and community.\" Greater Manchester's police chief, Sir Stephen Watson, said one of the three people in hospital also suffered a gunshot injury which isn't life-threatening. The chief constable said it's believed they was close to Mr Daulby behind the synagogue door. He said Mr Daulby's wound appeared to be a \"tragic and unforeseen consequence of the urgently required action taken by my officers to bring this vicious attack to an end\".  Rabbi Walker told Sky News the \"pain is very raw - we are still in the crisis stage - but we are strong and we are going to recover\". \"I still believe in hope, I still believe that we will come together and that we are better than this - and that we'll be better than this,\" he said. He praised the solidarity shown by the public and politicians as \"heartening\" and said \"it's good to know we're not alone\".  Al Shamie, 35, was shot dead outside the synagogue on Thursday morning amid fears he had a suicide vest - later revealed to be fake. He had ploughed his car into people at the gates of the building before launching a stabbing attack. Police said he was also seen acting suspiciously outside the synagogue 15 minutes before, but was confronted by security and walked away. The killer came to the UK from Syria as a small child and hadn't been on the radar of counter-terror police or MI5. However, he was on bail for an alleged rape at the time of the attack. Read more:Ex-minister says father-in-law was at synagogue attackAttacker's family condemn 'heinous act' Al Shamie is believed to have lived in a council house in Langley Crescent, Prestwich, around two miles from the scene. \"We used to see him out in the garden working out, doing weights, press-ups,\" said one of his neighbours. \"He used to change his clothes. One day he would be wearing the full gown, to the floor and the next jeans and pyjama bottoms.\" Geoff Haliwell, 72, told Sky News he believed the family, including his mother, father and brothers, had lived there around 20 years. \"There's no way I could've thought they were in any way involved in anything like this,\" he said, describing the family as \"nice people\". Another neighbour, Kate McLeish, said she thought al Shamie was \"an odd guy\" and said he used to park his battered black Kia \"quite badly on the road\"."
    },
    {
        "title": "Expert 'kept awake at night' over fear of deadly brain disease passed on in transfusions",
        "description": "A senior government adviser on the safety of blood transfusions has told Sky News he is \"kept awake at night\" worrying about the possibility of a deadly brain disease being passed from donor to patient.",
        "url": "https://news.sky.com/story/expert-kept-awake-at-night-over-fear-of-deadly-brain-disease-passed-on-in-transfusions-13442969",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-blood-donor-transfusion_6752456.jpg?20241119231626",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "Professor James Neuberger says blood transfusions should only be given \"when necessary\" and that patients should be informed of the risks.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n A senior government adviser on the safety of blood transfusions has told Sky News he is \"kept awake at night\" worrying about the possibility of a deadly brain disease being passed from donor to patient. Professor James Neuberger was speaking after a Sky News investigation into the case of Natalie Bralee-Brett and her brother Neil, who both became infected with the potentially deadly brain disease iatrogenic cerebral amyloid angiopathy (ICAA). Natalie and Neil underwent childhood NHS operations involving infected tissue taken from dead bodies and transplanted into their own. As a result, Natalie suffers from bleeding on the brain and is at high risk of a fatal stroke and developing Alzheimer's. Her brother's condition has deteriorated to the extent that he has now been forced to give up work. Speaking to Sky News, Professor Neuberger said: \"The ICAA is a much more difficult problem and a much more challenging one, and certainly one that keeps me and my colleagues awake at night. \"At the moment consensus is that this is of concern. We need to make sure that blood transfusion is given only when necessary. \"We need people to understand that blood transfusion carries risk and although as I say blood is very safe in the UK we need to ensure that patients understand that there is a risk.\" \n                  Two species of disease-carrying mosquitoes found in UK\n                 \n                  Cannabis extract reduces chronic low back pain without risk of addiction, study suggests\n                 \n                  Donald Trump's health claims 'really dangerous', autism community warns\n                 Prof Neuberger is the chair of SaBTO, the UK's Advisory Committee on the Safety of Blood, Tissues and Organs, an independent body that provides advice to UK health ministers and departments - as well as the UK Blood and Transplant services - to ensure the safety of blood, cells, tissues, and organs used for transfusion and transplantation. ICAA happens when a protein called amyloid builds up in the blood vessels of the brain - making them fragile and more likely to bleed. Read more:NHS cadaver implant leaves woman with one of world's rarest diseases Link between disease and blood transfusions Usually, it affects people in their 70s and 80s, but in rare cases it can appear much earlier. When it develops after a medical procedure, it's called iatrogenic CAA (ICAA). US researchers working with a cohort of patients with the condition between November 2023 and January 2024 established a link between the disease and blood transfusions. Of 35 patients screened, they discovered two (6%) had a clear history of blood transfusion. Both had received the transfusions as children, decades before showing symptoms. They were diagnosed with CAA much earlier than usual at ages 47 and 57. Both already had severe disease. If blood transfusions can spread amyloid protein, even rarely, this would have important consequences for blood safety. A spokesperson for NHS Blood and Transplant said: \"Scientists and doctors are much more aware of emerging risks than in the past. The blood safety system is also much more responsive to those risks. \"The current systems in place are more effective in maintaining the safety of the blood supply than ever before. We currently have one of the safest blood supplies in the world. \"We follow the advice of several independent expert committees and bodies including SaBTO, the UK's Advisory Committee on the Safety of Blood, Tissues and Organs. We're currently awaiting the outcome of SaBTO's work into iatrogenic cerebral amyloid angiopathy. SaBTO will usually make recommendations to ministers and it is for ministers to decide whether these recommendations should become guidance. \"The potential risks around iatrogenic cerebral amyloid angiopathy and blood transfusions are unknown. However, it is important to remember that while we have extensive blood safety systems in place, all blood transfusions are not, and never will be, without risk. That is why it is important that all blood transfusions are given only when necessary.\""
    },
    {
        "title": "Sky News joins NATO air patrol designed to deter Russia from pushing boundaries",
        "description": "Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane.",
        "url": "https://news.sky.com/story/sky-news-joins-nato-air-patrol-designed-to-deter-russia-from-pushing-boundaries-13443911",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nato-typhoons_7040777.jpg?20251004003944",
        "type": "UK",
        "Author": "Diana Magnay",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane. One suddenly turns on its wing and dips below us, reappearing alongside our other flank, its sharp nose seeming to reach out for the nozzle of an outstretched hose which trails from the wings of our RAF Voyager jet like a jellyfish on a long tentacle, tossed about by savage currents. Air-to-air refuelling at high speeds and in high winds looks, from my perspective less than 10m away, fiendishly hard. It takes several minutes and several attempts before the pilot finally manages to latch the probe on the side of their jet on to the fuel hose nozzle and start to fill up, guzzling as much as four tonnes of fuel in one go. But this is what they're trained for: highly technical manoeuvres at high speeds. The two RAF Typhoons on mission with us will refuel four times that night. It's a force multiplier. It means they'll be in the air and on patrol that much longer. We're flying on a nighttime mission over Poland as part of NATO's Operation Eastern Sentry. The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September, the first time the alliance has had to deal with a coordinated and deliberate drone incursion into its airspace. They were inexpensive Gerbera decoy drones, a way of testing NATO's defences and a warning from the Kremlin that Russia can do much worse in the way of drone warfare if European leaders continue to pour money and weapons into Ukraine. Yes, the Typhoons can down any airborne threat, drones included, given they have Advanced Short Range Air-to-Air Missiles (ASRAAM) and a 27mm Mauser cannon. Yes, that is a significant amount of firepower to use against what could end up being just an unarmed piece of plywood with a GPS tracker on it. But this is an exercise in deterrence, to let Russia know that NATO is alert and ready, as European leaders gather to discuss how best to defend against drones beyond conventional air defence. For that, they're employing Ukraine's hard-won expertise, developed beneath the misery of their drone-filled skies. Read more:Airport drone sightings - what we knowPutin issues defiant message Russia's warning shot to NATO Germany and Denmark are both reporting unidentified drone sightings over key installations, forcing them to close airspace including, temporarily, Copenhagen and Munich airports. Estonia escorted Russian MiG fighter jets from its airspace after a 12-minute incursion. Russia is pushing boundaries, a warning shot to NATO as it deliberates support for Ukraine. Moscow, of course, denies all this.  For Vladimir Putin NATO is war-mongering. \"We're closely monitoring the growing militarisation of Europe. Is this just talk, or is it time for us to take countermeasures?\" he asked the audience at the annual Valdai meeting, a veiled threat if ever there was one. But that is the status quo between Russia and NATO. Veiled threats and hybrid warfare, with drones a new weapon in Russia's arsenal. NATO hopes to make Putin recognise limitations of his armed forces As French President Emmanuel Macron said, NATO's best defence is \"more unpredictability and more strategic ambiguity\". And images of what NATO is capable of, the mastery of its fighter jets, the coordinated armies within its command and their shared commitment to common defence, those are intended to make Russia's leader take stock and recognise the limitations of his exhausted and overstretched armed forces. Whether they do or not, well - that is a completely different matter."
    },
    {
        "title": "Man dies and tens of thousands without power as Storm Amy brings 90mph winds to UK and Ireland",
        "description": "A man has died and hundreds of thousands were left without power after Storm Amy brought 90mph winds and heavy rain to parts of the UK and Ireland.",
        "url": "https://news.sky.com/story/man-dies-and-tens-of-thousands-without-power-as-storm-amy-brings-90mph-winds-to-uk-and-ireland-13443835",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-weather-galway-storm-amy_7040721.jpg?20251003220615",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-03 20:17:00",
        "Headline": "Irish police say the death of a man in his 40s in the Letterkenny areas of Co Donegal was being treated as weather related.",
        "Content": "A man has died and hundreds of thousands were left without power after Storm Amy brought 90mph winds and heavy rain to parts of the UK and Ireland. A yellow weather warning covers the whole of Britain from midnight and is in force for most of Saturday. The Scottish island of Tiree so far tops the wind charts at 96mph, followed by 85mph at Capel Curig in North Wales - which also had 43mm of rain on Friday. Get the Sky News forecast for your area  The worst gusts have been in the North, but the Met Office said it is likely to be very windy everywhere on Saturday. It warned of possible disruption to public transport, hazardous driving conditions, potential power cuts and dangerous waves. Exposed coastal and hilly areas, such as Scotland's far north - where an amber warning indicates potential danger to life - could again see gusts of 90mph. Gusts of 45-55mph are likely elsewhere across the UK, with heavy rain also expected in western Scotland. \"The very strong winds will also be accompanied by spells of heavy rain, with difficult driving conditions likely, especially for high-sided vehicles on prone routes, such as crosswinds on exposed or high-level routes,\" said the Met Office. ScotRail said some lines were shutting on Friday evening, with speed restrictions on all other routes. Many schools in Northern Ireland were also advised to close at midday on Friday, while residents in County Donegal, in the Republic of Ireland, were put under the maximum red warning and told to \"shelter in place\" until 6pm. Irish police said the death of a man in his 40s in the Letterkenny areas of Co Donegal was being treated as weather related.  Read more: What are weather warnings and how do they work? Around 184,000 homes, farms and businesses across Ireland were also without power at 5.15pm, according to the Electricity Supply Board (ESB). In Northern Ireland, NIE Networks said 50,000 properties had been cut off. However, the worst of the storm should ease for the vast majority of the country on Sunday as the storm moves towards Scandinavia. Amy is the first named storm of the new season, which began on 1 September. The names are chosen from thousands of public suggestions each year. The next few storms will be named Bram, Chandra - and Dave."
    },
    {
        "title": "'Best month ever' for UK battery electric vehicle sales",
        "description": "Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures.",
        "url": "https://news.sky.com/story/best-month-ever-for-uk-battery-electric-vehicle-sales-13443516",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ev-evs-electric-cars_7040053.jpg?20251003124545",
        "type": "UK",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The Society for Motor Manufacturers and Traders attributed the rise to the government's Electric Car Grant scheme, along with factors such as an \"ever-increasing choice of models\".",
        "Content": "By Daniel Binns, business reporter  Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures. More than 72,000 new BEVs were registered in September, accounting for 23.3% of the total market, the Society for Motor Manufacturers and Traders (SMMT) said. It described the figures - a 29% rise on the 56,000 BEVs sold in September 2024 - as \"the best month on record for BEV volumes\". The motor lobby group attributed the increase to the government's Electric Car Grant scheme, as well as factors such as the \"ever-increasing choice of models\" in the sector. More than 20,000 consumers have taken advantage since the £650m grant scheme was launched earlier this summer. It offers discounts of up to £3,750 on 36 electric models. Overall, the SMMT said just over 50% of the 312,887 new vehicles registered last month were electric models, including both hybrid and battery types. The total number of newly registered cars and other vehicles was up nearly 14% compared to last year, the best September performance since 2020, it added. Manufacturers have been set a target of ensuring 28% of vehicles sold this year must be electric, although the mandate was relaxed earlier this year to include hybrid as well as battery-only cars. Mike Hawes, chief executive of the SMMT, said: \"Electrified vehicles are powering market growth after a sluggish summer - and with record ZEV [zero emission vehicles] uptake, massive industry investment is paying off, despite demand still trailing ambition. \"The Electric Car Grant will help to break down one of the barriers holding back more drivers from making the switch - and tackling remaining roadblocks, by unlocking infrastructure investment and driving down energy costs, will be crucial to the success of the industry and the environmental goals we share.\" However, the SMMT said more still needed to be done to \"re-energise\" private buyers to switch to electric. Read more from Sky News:Baroness Mone attacks 'reckless' BadenochCustomer details stolen in Renault cyber attackCotswold Company lays groundwork for sale Commenting on the figures, Colin Walker, from the Energy and Climate Intelligence Unit, said: \"Demand for electric cars is up again and factoring in the flexibilities the car industry lobbied for in the UK's EV policy, sales are now ahead of where they need to be to hit this year's target. \"That would be two years in a row that the targets would have been hit and drivers are making hundreds of pounds of savings each year by making the switch to electric.\" Transport Secretary Heidi Alexander added: \"Our discounts have sparked a surge in electric car sales, making them cheaper and within reach of more households than ever before.\""
    },
    {
        "title": "Keeping Up Appearances star Dame Patricia Routledge has died",
        "description": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said.",
        "url": "https://news.sky.com/story/keeping-up-appearances-star-dame-patricia-routledge-has-died-13443457",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-clive-swift-patricia-routledge_7039926.jpg?20251003111802",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-03 10:04:00",
        "Headline": "Though best known for playing the notoriously snobbish Hyacinth Bucket in Keeping Up Appearances, the actress received her damehood for services to the theatre and charity.",
        "Content": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said. \"We are deeply saddened to confirm the passing of Dame Patricia Routledge, who died peacefully in her sleep this morning surrounded by love,\" her agent said in a statement. \"Even at 96 years old, Dame Patricia's passion for her work and for connecting with live audiences never waned, just as new generations of audiences have continued to find her through her beloved television roles. \"She will be dearly missed by those closest to her and by her devoted admirers around the world.\" Dame Patricia played the notoriously snobbish Hyacinth Bucket in the BBC sitcom between 1990 and 1995, which attracted as many as 13 million viewers at its peak. She earned two BAFTA nominations for the role in 1992 and 1993. Another of her notable 90s TV appearances came when she played a pensioner-turned-detective in the £3m six-part BBC TV crime series Hetty Wainthropp Investigates. She also had a prolific career in the theatre, winning an Olivier Award for her role as the Old Lady in acclaimed composer Leonard Bernstein's operetta Candide in 1988, and a Tony Award for her part as Alice Challice in Darling Of The Day in 1968. The actress was honoured at Buckingham Palace in 2017, being made a Dame Commander of the British Empire for her services to the theatre and charity. She was born in Birkenhead, Merseyside in 1929, and went on to study English Language and Literature at the University of Liverpool, where she appeared in student shows before making her professional debut at the Liverpool Playhouse in 1952, playing Hippolyta in A Midsummer Night's Dream. Years later, after her career skyrocketed, she spoke of how important her northern roots were to her. \"You are never done with your roots. I think the people who try to make out that they are, are in deep trouble,\" she was once quoted as saying. Dame Patricia made her debut on a London stage in 1954, quickly establishing herself as a major character actress. She also became a Broadway star, wowing New York critics with her performance in the play How's The World Treating You? and appearing in numerous musicals. Later, Leonard Bernstein penned solos especially for her as she starred in the presidential drama 1600 Pennsylvania Avenue. Though she was best known for embodying Hyacinth Bucket in the '90s, she made memorable TV appearances from the 1950s. Notable roles included Victoria Regina for Granada in 1964 and Kitty in Victoria Wood: As Seen on TV in the mid-1980s. More recently, in 2016, Dame Patricia fronted a Channel 4 documentary celebrating the 150th anniversary of the birth of Beatrix Potter, having previously played the children's author on stage and in 2012. "
    },
    {
        "title": "Trump tells Israel 'stop bombing Gaza' - as Hamas agrees to release Israeli hostages, and to parts of peace deal ",
        "description": "Donald Trump has said Hamas is ready for a \"lasting peace\" after the Palestinian militants agreed to release all remaining hostages, as he called on Israel to stop bombing Gaza.",
        "url": "https://news.sky.com/story/hamas-agrees-to-release-all-remaining-israeli-hostages-but-seeks-further-talks-on-trumps-peace-deal-13443611",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-israel-gaza-palestine_6896665.jpg?20250425184431",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-03 19:57:00",
        "Headline": "The US leader had earlier warned he would unleash \"all hell\" if Hamas did not respond to his proposals.",
        "Content": " Donald Trump has said Hamas is ready for a \"lasting peace\" after the Palestinian militants agreed to release all remaining hostages, as he called on Israel to stop bombing Gaza. The US leader was responding to a statement by Hamas on Friday in which the group committed to returning all remaining hostages in Gaza, dead and alive. Hamas also said it wants to engage in negotiations to discuss further details of the president's peace plan, including handing over \"administration of the enclave to a Palestinian body of independent technocrats\". However, other aspects of the 20-point document, it warned, would require further consultation among Palestinians.  The Hamas statement came after Mr Trump warned he would unleash \"all hell\" if they did not respond to his peace plan, announced earlier this week, by Sunday. Following the group's response, the president said there was now a real chance of peace. \"I believe they are ready for a lasting PEACE,\" Mr Trump posted on Truth Social. \"Israel must immediately stop the bombing of Gaza, so that we can get the Hostages out safely and quickly! \n                  Trump sets new deadline for Hamas to agree Gaza deal with Israel - or face 'all hell'\n                 \n                  MPs tell Starmer it's 'more urgent than ever' to create Ukraine-style family visa for Gazans\n                 \n                  Will Trump's Gaza plan leave eternal peace in the Middle East? \n                 \"Right now, it's far too dangerous to do that. We are already in discussions on details to be worked out. This is not about Gaza alone, this is about long sought PEACE in the Middle East.\" In a video later posted on his Truth Social platform, Mr Trump called it a \"very special day\" and said the end of the war was \"very close\". Prime Minister Benjamin Netanyahu said Israel was prepared for the implementation of the \"first stage\" of Mr Trump's plan, apparently in reference to the release of hostages.  Starmer calls for 'agreement without delay' Sir Keir Starmer said Hamas's partial acceptance of the peace plan was a \"significant step forwards\" and called for an \"agreement without delay\". The prime minister said Mr Trump's efforts \"have brought us closer to peace than ever before\" and added: \"There is now an opportunity to end the fighting, for the hostages to return home, and for humanitarian aid to reach those who so desperately need it. \"We call on all sides to implement the agreement without delay.\" He went on to say the UK was ready to support further negotiations and work \"towards sustainable peace for Israelis and Palestinians alike\". French President Emmanuel Macron said \"the release of all hostages and a ceasefire in Gaza are within reach\", while a spokesperson for UN Secretary General Antonio Guterres urged \"all parties to seize the opportunity\". Hamas agrees to release hostages The breakthrough came just hours after Mr Trump had set a new deadline of Sunday to respond to his proposals, backed by the Arab nations. The US president and the Israeli prime minister unveiled the peace plan at the White House on Monday. Israel agreed to the terms, which include an immediate ceasefire; the release of all hostages; Hamas disarming; a guarantee no one will be forced to leave Gaza and a governing \"peace panel\" including Sir Tony Blair. And on Friday, a statement from Hamas confirmed \"its approval to release all prisoners of the occupation - whether alive or the remains of the deceased - according to the exchange framework included in President Trump's proposal\". Israel estimates 48 hostages remain in Gaza, 20 of whom are alive. Hamas official says group will not disarm 'before Israeli occupation ends' The group also said it was ready to engage in negotiations through mediators and it appreciated \"Arab, Islamic and international efforts, as well as the efforts of US President Donald Trump\". But, Hamas official Mousa Abu Marzouk told Al Jazeera news the group would not disarm \"before the Israeli occupation ends\". By Celine Alkhaldi, Middle East producer\n\n Hamas has issued a carefully worded response to Donald Trump's Gaza proposal. \n The movement welcomed international efforts to end the fighting, agreed in principle to the release of all Israeli hostages, and said it is prepared to begin negotiations on the details of an agreement. It also renewed its commitment to handing over administration of Gaza to a committee of Palestinian technocrats formed by national consensus and backed by Arab and Islamic states.  That position has been consistent for months and was not part of Mr Trump's plan.  On wider questions, Hamas said decisions must be taken within a comprehensive Palestinian framework, leaving the most sensitive issues for future discussion. The statement appears to accept parts of Mr Trump's proposal, but in some areas it does not match its terms.  Hamas made no mention of disarmament, avoided any pledge to withdraw permanently from governing, and linked any hostage deal to a complete Israeli withdrawal. Taken together, the response shows a willingness to engage on humanitarian and political steps already familiar from past proposals, while deferring the core disputes to a broader Palestinian process. Hamas does not know where all hostages are Sky News Middle East correspondent Adam Parsons said the \"most important part\" of the Hamas response was that it showed a willingness to do a deal. \"The peace plan could have died - Hamas could have rejected it - but it is still alive.\" He said there were still \"huge obstacles\" which would prevent outright acceptance though. In spite of a pledge to release hostages, he said Hamas did not entirely know where all of them were - some were even being held by other groups. Hamas's support for a new government for Palestine was positive, he said, but the specification in the Hamas response that it should be purely Palestinian and not, as Mr Trump had proposed, a \"panel\" that included external representatives, would be problematic."
    },
    {
        "title": "Sky News joins NATO air patrol designed to deter Russia from pushing boundaries",
        "description": "Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane.",
        "url": "https://news.sky.com/story/sky-news-joins-nato-air-patrol-designed-to-deter-russia-from-pushing-boundaries-13443911",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nato-typhoons_7040777.jpg?20251004003944",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Out of the darkness, flashing bars of red and blue, followed by the black, avian-like forms of two Typhoon fighter jets, emerge and glide side-long towards our plane. One suddenly turns on its wing and dips below us, reappearing alongside our other flank, its sharp nose seeming to reach out for the nozzle of an outstretched hose which trails from the wings of our RAF Voyager jet like a jellyfish on a long tentacle, tossed about by savage currents. Air-to-air refuelling at high speeds and in high winds looks, from my perspective less than 10m away, fiendishly hard. It takes several minutes and several attempts before the pilot finally manages to latch the probe on the side of their jet on to the fuel hose nozzle and start to fill up, guzzling as much as four tonnes of fuel in one go. But this is what they're trained for: highly technical manoeuvres at high speeds. The two RAF Typhoons on mission with us will refuel four times that night. It's a force multiplier. It means they'll be in the air and on patrol that much longer. We're flying on a nighttime mission over Poland as part of NATO's Operation Eastern Sentry. The RAF is supplying Typhoon fighter jets and refuelling capabilities to help patrol the skies and bolster NATO's eastern flank after Russia sent scores of drones into NATO territory on 10 September, the first time the alliance has had to deal with a coordinated and deliberate drone incursion into its airspace. They were inexpensive Gerbera decoy drones, a way of testing NATO's defences and a warning from the Kremlin that Russia can do much worse in the way of drone warfare if European leaders continue to pour money and weapons into Ukraine. Yes, the Typhoons can down any airborne threat, drones included, given they have Advanced Short Range Air-to-Air Missiles (ASRAAM) and a 27mm Mauser cannon. Yes, that is a significant amount of firepower to use against what could end up being just an unarmed piece of plywood with a GPS tracker on it. But this is an exercise in deterrence, to let Russia know that NATO is alert and ready, as European leaders gather to discuss how best to defend against drones beyond conventional air defence. For that, they're employing Ukraine's hard-won expertise, developed beneath the misery of their drone-filled skies. Read more:Airport drone sightings - what we knowPutin issues defiant message Russia's warning shot to NATO Germany and Denmark are both reporting unidentified drone sightings over key installations, forcing them to close airspace including, temporarily, Copenhagen and Munich airports. Estonia escorted Russian MiG fighter jets from its airspace after a 12-minute incursion. Russia is pushing boundaries, a warning shot to NATO as it deliberates support for Ukraine. Moscow, of course, denies all this.  For Vladimir Putin NATO is war-mongering. \"We're closely monitoring the growing militarisation of Europe. Is this just talk, or is it time for us to take countermeasures?\" he asked the audience at the annual Valdai meeting, a veiled threat if ever there was one. But that is the status quo between Russia and NATO. Veiled threats and hybrid warfare, with drones a new weapon in Russia's arsenal. NATO hopes to make Putin recognise limitations of his armed forces As French President Emmanuel Macron said, NATO's best defence is \"more unpredictability and more strategic ambiguity\". And images of what NATO is capable of, the mastery of its fighter jets, the coordinated armies within its command and their shared commitment to common defence, those are intended to make Russia's leader take stock and recognise the limitations of his exhausted and overstretched armed forces. Whether they do or not, well - that is a completely different matter."
    },
    {
        "title": "Germany should 'get power to shoot down drones', official says - as Vladimir Putin denies involvement in airspace violations",
        "description": "Germany should \"get the power to shoot down\" drones in its airspace, an official has said, after incursions led to major disruption at Munich airport.",
        "url": "https://news.sky.com/story/germany-should-get-power-to-shoot-down-drones-official-says-as-vladimir-putin-denies-involvement-in-airspace-violations-13443541",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-munich-airport_7040156.jpg?20251003140936",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-03 12:46:00",
        "Headline": "Nearly 3,000 passengers were left stranded late on Thursday after several drone sightings forced cancellations and diversions at Munich Airport.",
        "Content": "Germany should \"get the power to shoot down\" drones in its airspace, an official has said, after incursions led to major disruption at Munich airport. Nearly 3,000 passengers were left stranded late on Thursday after several drone sightings forced air traffic control to suspend operations, leading to cancellations and diversions. It was the latest in a series of similar incidents that have rattled Europe, raising concerns about attacks on Ukraine's allies, possibly directed by Russia. Markus Soeder, the premier of Bavaria, has said: \"Our police must get the power to shoot drones down.\" He told German publication Bild: \"We need sovereignty over our airspace.\" Federal police deployed helicopters and other means to try to track down the drones, but no signs of them could be found, a spokesperson for Germany's federal police said. Flights resumed at 5am local time (3am in the UK). \n                  Oktoberfest opening delayed in Munich after bomb threat\n                 \n                  Former assistant to AfD politician found guilty of Chinese spy charges\n                 \n                  Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor\n                 It comes after airspace intrusions last week shut airports in Denmark and Norway - after which European Union leaders at a Copenhagen summit backed plans to bolster the bloc's anti-drone defences.  Authorities have not publicly blamed anyone for the Munich incident but some European officials have suggested Russia was behind the other violations. Read more:Airport drone sightings - what we knowPutin issues defiant message European Commission chief Ursula von der Leyen said on Wednesday: \"Russia tries to test us. But Russia also tries to sow division and anxiety in our societies.\" Putin jokes about drone accusations  The Kremlin has denied any involvement in the incidents - and Vladimir Putin made a joke as he was asked about sending drones on Thursday.  The Russian president grinned as he quipped: \"I won't do it anymore - to France, Denmark, Copenhagen, Lisbon - wherever they could reach.\" Taking a more serious tone, he continued: \"But seriously, we don't even have drones that can reach Lisbon. \"We have some and they have long range but there are no targets, which is the main thing.\" Officials in Russia and close ally Belarus did last month acknowledge that some drones used as part of the war in Ukraine had entered Polish airspace - prompting a scramble by Poland and NATO allies to deploy fighter jets to shoot them down."
    },
    {
        "title": "Will Trump-style billionaire Andrej Babis return to power? What the Czech election means for Ukraine",
        "description": "Czechs head to the polls this Friday and Saturday in an election which could impact the country&#8217;s support for Ukraine.",
        "url": "https://news.sky.com/story/will-trump-style-billionaire-andrej-babis-return-to-power-what-the-czech-election-means-for-ukraine-13443356",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-czech-election_7039757.png?20251003084644",
        "type": "World",
        "Author": "Mirek Gosney, social media producer",
        "Date Published": "2025-10-03 07:23:00",
        "Headline": "Andrej Babis, 71, is the favourite to take over from under-fire Czech prime minister Petr Fiala ",
        "Content": "By Mirek Gosney, social media producer  Czechs head to the polls this Friday and Saturday in an election which could impact the country’s support for Ukraine. Prime Minister Petr Fiala faces being voted out of office, with billionaire businessman Andrej Babis the current favourite to win. Babis, the 71-year-old leader of right-wing opposition party ANO (Action for Dissatisfied Citizens), has been dubbed the \"Czech Trump\" due to his business empire and populist leanings. The Slovak-born chemicals, farming and media tycoon has vowed that if he wins this weekend, he will stop sending military aid to Ukraine, insisting that instead funds should be redirected to support Czech citizens. Babis previously served as prime minister from 2017 to 2021, when he suffered defeat to Fiala's centre-right SPOLU (Together) coalition, a pro-Ukraine administration. Babis's party pledges to cap energy prices and oppose EU climate and migration pacts. Critics have warned that the plans could increase national debt, plunging the country into a deeper cost of living crisis. Thousands of people protested in Prague's Old Town Square last weekend in a rally organised by anti-extremist movement A Million Moments for Democracy, where speakers warned the current populist surge could threaten the country's democratic direction. \n                  Thousands forced to evacuate flooding in Italy - as King Charles expresses his 'profound shock'\n                 \n                  Boats are better than cars in the Polish town where floods have damaged 80% of homes\n                 \n                  At least 16 killed in flooding across eastern and central Europe\n                 But although the favourite to win, Babis could still face difficulties forming a government. He is forecast to win about one third of the vote, but 101 seats are required to form a working majority in the country's 200-seat Chamber of Deputies - the lower house of parliament. So far opposition parties have ruled out working with ANO, meaning it could need to partner with smaller fringe parties to form a cabinet. These could include explicitly anti-NATO, anti-EU parties such as the hard-right Freedom and Direct Democracy (SPD) and hard-left Stacilo. In addition, President Petr Pavel, a retired NATO general, who appoints the prime minister and cabinet, has said he may refuse any ministers or cabinet members pushing anti-EU and anti-NATO agendas and defended Czechia sending military aid to Ukraine. Who is Andrej Babis? Babis, who boasts a $4.3bn (£3.2bn) net worth according to Forbes, co-founded the far-right Patriots for Europe faction in the European Parliament alongside Hungarian populist leader Viktor Orban. His fortune is thanks to his ownership of agro-chemical business empire Agrofert, which includes more than 200 companies, and the purchase of key media outlets. Babis often wears a red cap inscribed with \"Strong Czechia\", a nod to Donald Trump's MAGA movement and their iconic red baseball caps. How could this election impact Ukraine? Czechia has played a crucial role in raising funds among its NATO allies to send military equipment and munitions to Ukraine, now in its fourth year of war with Russia. It uses contributions from NATO partner donations to buy ammunition and military equipment from the global market, sourced by private companies contracted by the Czech Ministry of Defence. The scheme contributed 1.5 million artillery shells to Ukraine from more than a dozen countries in 2024 and expects to exceed 1.8 million donations by the year's end. But Babis has called the scheme \"overpriced\" and \"untransparent\" and said the funds the Czech government contributes should be spent on domestic issues instead. He also said management of the scheme should be handed over to NATO. A poll by Czech research institute STEM from June found just under half of Czech respondents shared Babis's view, calling the amount of Czech military aid sent to Ukraine \"too large\". But AMOS, the section of the Defence Ministry which contracts the initiative, rebuked Babis's claims about the scheme, stressing that the entire process is designed to be \"as transparent as possible\" for donors. An AMOS spokesperson said: \"The system of military-technical assistance to Ukraine has been thoroughly presented to our Western partners, who have expressed their clear and continuous support.\" West to unrest - Will Babis really scrap the scheme? Dr Sean Hanley, a Central and Eastern European politics expert at UCL, dismissed Babis's claims about ending Czech military aid for Ukraine as \"political theatre\". He told Sky News: \"I think it is a signal to say, 'I'm not pro-Ukrainian. I'm anti-Western leaning.' It will appeal to certain groups of voters. \"But Babis also said this [scheme] is something NATO should be doing. So, we have this big rhetoric, the headlines, but then the reality will be that Czechia steps back and plays a much lower profile role. And it will be discreetly repackaged as a NATO initiative. \"The more consequential thing is that Babis doesn't want to increase defence spending.\" ANO did not respond to a request for comment. When will we know the results? Polls are now open and close on Saturday - with results expected to be announced in the evening. Parties must obtain at least 5% of votes to win seats. Voting thresholds are higher for coalition parties. This election marks the first to allow postal voting for citizens living abroad."
    },
    {
        "title": "Power outage in Spain and Portugal 'first known blackout caused by excessive voltage'",
        "description": "A massive power outage which brought much of Spain and Portugal to a standstill earlier this year is the first known blackout caused by excessive voltage, a report has found.",
        "url": "https://news.sky.com/story/power-outage-in-spain-and-portugal-first-known-blackout-caused-by-excessive-voltage-13443544",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-spain-barcelona-power-outage_6900317.jpg?20250428233213",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-03 15:41:00",
        "Headline": "Huge swathes of Spain and Portugal, including major cities like Barcelona, Lisbon, Madrid, Porto and Seville, were affected by the power outage - Europe's most significant blackout in more than two decades.",
        "Content": "A massive power outage which brought much of Spain and Portugal to a standstill earlier this year is the first known blackout caused by excessive voltage, a report has found. The blackout on 28 April stranded thousands of train passengers and left millions of people without phone and internet coverage and access to cash from ATMs across the Iberian Peninsula. Huge swathes of Spain and Portugal, including major cities like Barcelona, Lisbon, Madrid, Porto and Seville, were affected by the power outage - Europe's most significant blackout in more than two decades. Like previous probes, the report by the European network of electricity transmission system operators pointed to a surge in voltage as the immediate cause of the outage. A final report, due in the first quarter of 2026, will investigate the root causes and steps taken to control voltage in the system. Damian Cortinas, chair of ENTSO-E's board, said there was no indication that a cyber attack had occurred. Mr Cortinas also said that Spain's increasing dependence on renewable energy and its limited power interconnections with other countries had not contributed to the outage. \n                  Spain: Ibiza and Formentera hit by widespread flooding as red alert issued amid 'extraordinary danger'\n                 \n                  Spanish defence minister's jet suffers GPS disturbance near Russian enclave\n                 \n                  Could Eurovision boycotts over Israel lead to a competition crisis?\n                 \"If there had been double the interconnection capacity, this would not have stopped the blackout, and this would not have accelerated the recovery,\" Mr Cortinas said. Read more from Sky News:Woman named as new Archbishop of Canterbury in historic firstTaylor Swift releases highly anticipated new album After the blackout, the Spanish and Portuguese governments have urged the EU to help them develop new power links with other countries, which they say would help their power grids respond to disruptions. The report follows several others by the Spanish government and power and grid companies. The national energy watchdog and Spanish politicians are also conducting separate probes. Redeia, owner of grid operator REE, has blamed the blackout on some power plants' failure to help maintain appropriate voltage while Spanish utilities blamed the Spanish grid operator's poor planning."
    },
    {
        "title": "Japan could be hours away from running out of Asahi",
        "description": "Japan could be hours away from running out of Asahi, the country's most popular beer.",
        "url": "https://news.sky.com/story/super-dry160why-japan-could-be-hours-away-from-running-out-of-asahi-its-most-popular-beer-13443294",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-asahi-beer_7039639.jpg?20251003031913",
        "type": "World",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-03 02:17:00",
        "Headline": "A cyber-attack has forced dozens of Japanese factories to stop production - with shops and restaurants reluctant to stock other brands.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Japan could be hours away from running out of Asahi, the country's most popular beer. Dozens of factories nationwide have ground to a halt following a cyber attack on Monday. The breach disabled the company's ordering and delivery systems - and also took its call centre operations offline. Supermarkets and Japanese pubs known as izakayas risk running super dry, with some retailers raising fears of potential panic buying. According to NHK, Asahi Group has now had to suspend plans to launch new products including soft drinks, coffee and throat lozenges. One wholesaler expects to run out of beer kegs by Saturday at the latest, meaning they'll no longer be able to supply booze to retailers. They are now considering whether to start selling other brands as a temporary measure. \n                  Japan's prime minister Shigeru Ishiba resigns\n                 \n                  Elderly woman conned by romance scammer posing as stranded astronaut\n                 \n                  Japan releases AI-generated video showing simulation of Mount Fuji violently erupting\n                 Akira Kudo, who runs an izakaya in Tokyo, has been told that one of the two brands of Asahi he regularly purchases is now out of stock. He's now unable to predict when pints can be poured again. \"We have received beer from the wholesaler to replace Asahi, but we would like to avoid using other manufacturers if possible, so we will consider our options until the very last minute,\" Akira added. Read more from Sky News:William hints at 'changes' when he is kingSean 'Diddy' Combs admits 'past wrongs' A shortage may leave Japanese drinkers unimpressed. While there are other breweries in the country, Asahi has a fiercely loyal following. Figures from Kirin Holdings suggest that the typical consumer drank 34.5 litres of beer a year in 2022, the equivalent of 54 large bottles. Asahi executives are now consulting with the police and trying to determine whether the company has fallen victim to ransomware. They have stressed that no personal information or customer data has been leaked. Brewing operations outside of Japan - including in the UK - are also unaffected. There have been a series of high-profile cyber attacks on well-known brands in recent months - including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR)."
    },
    {
        "title": "Sean 'Diddy' Combs sentenced to more than four years in prison",
        "description": "Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers.",
        "url": "https://news.sky.com/story/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison-13443408",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-diddy-combs-court_7040465.jpg?20251003192849",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-10-03 08:48:00",
        "Headline": "The hip-hop mogul was convicted of two prostitution-related offences but cleared of the more serious charges of sex-trafficking and racketeering conspiracy following his high-profile trial earlier this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers. Judge Arun Subramanian handed down his 50-month sentence - including a $500,000 fine - at the end of a long and emotional full-day hearing, which saw the hip-hop mogul speak out for the first time in court. Combs, 55, admitted his past behaviour was \"disgusting, shameful and sick\", and apologised personally to Cassie Ventura and \"Jane\", another former girlfriend who testified anonymously during the trial. But despite his plea for \"mercy\" and expressions of remorse, the judge told him he had abused his \"power and control\" with women he professed to love - and rejected the defence's characterisation that \"freak off\" sexual encounters were consensual experiences, that his was just a \"sex, drugs and rock'n'roll story\". Addressing Cassie and \"the other brave survivors who came forward\", the judge said. \"We heard you... I can only say your families are proud of you and your children will be proud of you. \"You weren't just talking to the jury you were talking to the women who feel powerless - you gave them a voice, you stood up to power, it's not easy.\" Combs showed no visible change of emotion as his sentence was delivered, looking straight ahead as the judge spoke. Afterwards, he seemed subdued - with no sign of the enthusiasm or feeling showed earlier in the day. Ahead of his own speech, the court heard from six of his seven children - causing the rapper to break down in tears as they spoke about how much they loved him, how he has changed, and how much they and their younger two-year-old sister need him. The sentencing brings to an end a sordid case that featured harrowing testimony - not just from Cassie and Jane, but also from former employees and associates of Combs. He was convicted in July of flying people around the US and abroad for sexual encounters, including his then girlfriends and male sex workers, in violation of prostitution laws. However, he was cleared of more serious charges of racketeering conspiracy and sex-trafficking that could have put him in jail for life. 'I hate myself right now' On the eve of his sentencing, Combs submitted a letter to the judge pleading for \"mercy\" and apologising for the \"hurt and pain\" he has caused others. He expanded on this in court, saying he wanted to \"personally apologise\" to Cassie for \"any harm\" he caused her \"emotionally or physically\", and to Jane - and all victims of domestic violence. He told the court he got \"lost in my excess and lost in my ego\", but since his time in prison he has been \"humbled and broken to my core\". Combs continued: \"I hate myself right now... I am truly sorry for it all.\" Read more:The rise and fall of DiddyDiddy sentencing: As it happened Once one of the most influential hip-hop producers of the 1990s and 2000s - the founder of Bad Boy Records and a Grammy-winning artist in his own right - he has led a very different life since his high-profile arrest. He was facing a maximum of 20 years in prison for the prostitution-related charges, so the sentence is towards the lower end of the scale. Prosecutors had argued he should spend at least 11 years behind bars, while Combs's lawyers were calling for him to be freed almost immediately due to time already served since his arrest just over a year ago. Christy Slavik, for the prosecution, told the judge sparing the rapper serious prison time would excuse years of violence. 'Make the most of that second chance' The judge, who had rejected bail for the rapper several times before sentencing, told him that he would get through his time in prison. It will be hard, he said, but he will still \"have a life afterwards\". Combs has \"a chance for renewal and redemption\", he added. \"What went wrong can be made right... I am counting on you to make the most of that second chance.\" Outside the courthouse, journalists and onlookers swarmed the pavements as TV crews stood in a long row across the street, echoing scenes from the two-month high-profile trial. It included four days of testimony from Cassie, now Cassie Ventura Fine, who told the court she was coerced and sometimes blackmailed into sexual encounters with male sex workers, referred to as \"freak offs\". Cassie responds Jurors were also shown video clips of Combs dragging and beating her in a Los Angeles hotel hallway after one of those sessions in 2016. Combs referred to this in court, saying it was a \"heavy burden\" that he will forever carry, and that he was \"sick from drugs\" and \"out of control\" at the time, \"lost in my excess and lost in my ego\". Ahead of the sentencing, Cassie also submitted a letter to the judge, calling Combs a \"manipulator\" and saying she would fear for her safety should he be immediately released. Responding to the sentence, her lawyers Douglas Wigdor and Meredith Firetog (Wigdor LLP), said: \"While nothing can undo the trauma caused by Combs, the sentence imposed today recognises the impact of the serious offences he committed. \"We are confident that with the support of her family and friends, Ms Ventura will continue healing knowing that her bravery and fortitude have been an inspiration to so many.\""
    },
    {
        "title": "Balin Miller, renowned Alaskan climber, dies after falling at Yosemite National Park while livestreaming",
        "description": "An Alaskan climber fell to his death from Yosemite National Park's El Capitan while livestreaming on TikTok.",
        "url": "https://news.sky.com/story/balin-miller-renown-alaskan-climber-dies-after-falling-at-yosemite-national-park-while-livestreaming-13443449",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-balin-miller-yosemite_7039719.jpg?20251003075917",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-03 11:05:00",
        "Headline": "Social media users said they watched Balin Miller, 23, livestream his climb up Yosemite National Park's El Capitan on TikTok in the days leading up to his death.",
        "Content": "An Alaskan climber fell to his death from Yosemite National Park's El Capitan while livestreaming on TikTok. Balin Miller, 23, died in a climbing accident on Wednesday, his mother Jeanine Girard-Moorman confirmed in a statement. \"He's been climbing since he was a young boy,\" she said. \"His heart and soul was truly to just climb. \"He loved to climb and it was never about money and fame.\" While details of the incident are not clear, Balin's brother Dylan Miller said that he was lead rope soloing - a way to climb alone while still protected by a rope - on a 2,400ft (730m) route named Sea of Dreams. He had already finished the climb and was hauling up his last bit of gear when he likely rappelled off the end of his rope, the older brother said. \"He said he felt most alive when he was climbing,\" Dylan added. \"I'm his bigger brother but he was my mentor.\" \n                  Body language expert reveals Trump and Putin's key giveaways from their Alaska summit\n                 \n                  Trump produced a made-for-TV summit - but Putin seemed to be the one pulling the strings\n                 \n                  Key takeaways from Alaska summit from Sky News correspondents\n                 Many posted tributes to the Alaskan climber on social media, saying they had watched him climb on a TikTok livestream and calling him \"orange tent guy\" because of his distinctive camp setup. On Facebook, Michelle Derrick said Balin was livestreaming during the fatal incident, and he was attempting to retrieve his bags that were stuck on a rock when he fell. Another climber, Tom Evans, also posted he was climbing at El Capitan at the time, and saw a man rappel off his lead line. \"He was a young man,\" Mr Evans added, \"highly regarded among the best climbers here.\" Read more from Sky News:Two killed in terror attack namedJapan could run out of AsahiWeather warnings for whole of UK Balin was an accomplished alpinist who gained international attention for claiming the first solo ascent of Mount McKinley's Slovak Direct. He posted photos of his ascent up the technically difficult route that took him 56 hours to complete on his Instagram in June. It marks the third death at the national park in California this year: In June, an 18-year-old from Texas died in the park while free-soloing, or climbing without a rope, on a different formation. In August, a 29-year-old woman died after being struck in the head by a large tree branch while hiking. Balin's death also came on the first day of the US government shutdown, which leaves national parks \"generally\" open but with limited operations and closed visitor centres. The National Park Service said in a statement that they are investigating the incident and \"park rangers and emergency personnel responded immediately\"."
    },
    {
        "title": "Long-lost Spanish treasure worth $1m discovered off Florida coast",
        "description": "Long-lost Spanish treasure worth an estimated $1m (&#163;740,000) has been discovered off the coast of Florida.",
        "url": "https://news.sky.com/story/long-lost-spanish-treasure-worth-1m-discovered-off-florida-coast-13443304",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-coins-coast_7039649.jpg?20251003045840",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-03 03:07:00",
        "Headline": "What makes this haul special is that dates and mint marks are still visible on some of the coins found over the summer - a valuable resource for historians.",
        "Content": "Long-lost Spanish treasure worth an estimated $1m (£740,000) has been discovered off the coast of Florida. More than 1,000 silver and gold coins were found by a team of specialist divers in a stretch of water aptly known as the \"Treasure Coast\". It is believed they were minted in the Spanish colonies of Bolivia, Mexico and Peru - and were bound for Spain on a fleet of ships also carrying jewels back in 1715. But the precious loot spilled into the sea when a hurricane wrecked the flotilla. This is not the first such discovery to be made along the Treasure Coast, as gold coins worth millions of dollars have been uncovered by salvagers and hunters in recent years. What makes this haul special is that dates and mint marks are still visible on some of the coins found over the summer - a valuable resource for historians. Sal Guttoso from Queen Jewels, the company that struck gold, said: \"This discovery is not only about the treasure itself, but the stories it tells. \n                  Sean 'Diddy' Combs sentenced to more than four years in prison\n                 \n                  Sean 'Diddy' Combs latest: Hip-hop mogul sentenced to more than four years in prison\n                 \n                  Balin Miller, renowned Alaskan climber, dies after falling at Yosemite National Park while livestreaming\n                 \"Each coin is a piece of history - a tangible link to the people who lived, worked and sailed during the Golden Age of the Spanish Empire. \"Finding 1,000 of them in a single recovery is both rare and extraordinary.\" The company uses underwater metal detectors, and hand fans sand, to carefully comb the sea floor. Florida law means \"treasure troves\" belong to the state, but excavators are often given permission to conduct \"recovery services\". As well as this, 20% of historical artefacts must remain in public ownership - either for research or to go on display."
    },
    {
        "title": "Baroness Mone: I have no wish to rejoin Lords as Conservative peer",
        "description": "Baroness Michell Mone has accused Conservative leader Kemi Badenoch of using \"reckless\" language that could prejudice a police investigation, and says she has \"no desire\" to return to the House of Lords as a Tory peer.",
        "url": "https://news.sky.com/story/baroness-mone-attacks-reckless-kemi-badenoch-over-ppe-police-action-call-13443485",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lady-mone-michelle-mone_7038030.jpg?20251001185548",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-03 12:42:00",
        "Headline": "The former Conservative peer has accused the Tory leader of using \"inflammatory\" language and potentially prejudicing a criminal investigation.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Baroness Michell Mone has accused Conservative leader Kemi Badenoch of using \"reckless\" language that could prejudice a police investigation, and says she has \"no desire\" to return to the House of Lords as a Tory peer. A day after she wrote to Sir Keir Starmer, accusing the government of pursuing a vendetta against her, the former Conservative peer responded to comments by Ms Badenoch following a High Court ruling that a company linked to Baroness Mone's husband must repay £122m received for surgical gowns. The court found that PPE Medpro, founded by her husband Doug Barrowman, was in breach of contract with the Department of Health and gave it two weeks to repay the sum. While not a director of the company, Baroness Mone used her political contacts to introduce PPE Medpro to the government's \"VIP fast-lane\" at the start of the pandemic, and a family trust of which her children are beneficiaries received £29m of the profits. A separate criminal investigation by the National Crime Agency (NCA) is ongoing, and assets linked to the couple worth £75m have been frozen while it continues. In a series of radio interviews, Ms Badenoch criticised Baroness Mone, accusing her of bringing shame on the Conservative Party and calling for her to step down from the House of Lords. \"Where people do wrong, they should be punished,\" she said. \"They should face the full force of the law and this is something that I very strongly believe in,\" she said. \"And as the prosecution against her continues, they should throw the book at her for every single bit of wrongdoing that has taken place.\"  In a letter from her private office, Baroness Mone accuses the Tory leader of being ignorant of the facts and calls out a series of other Conservative politicians who introduced companies to the VIP lane. \"I was shocked to the core to read about your inflammatory language on BBC Radio yesterday calling for me to resign from the House of Lords,\" she writes. \"You are commenting on a live criminal investigation that could prejudice the outcome of any trial, and in so doing, you are reportable to the attorney general for breach of and contempt of court. Does no one ever tell you these things before you and your colleagues make reckless statements in the public domain?\" Read more from Sky News:Customer details stolen in Renault cyber attackJapan could run out of AsahiTinned tuna-owner to unveil £1.5bn float Baroness Mone goes on to say the NCA investigation has \"nothing to do with PPE Medpro and the contracts\". \"The case theory of the NCA investigation is that I somehow misled the Conservative government about my alleged concealed involvement and ended up pocketing a lot of money,\" she writes. \"Well I'm sorry to disappoint you, but it isn't true.\" She also says the Conservative government knew of her involvement and names former health secretary Matt Hancock, Lord Agnew, Lord Feldman and Lord Chadlington as being among 51 \"mostly Conservative peers and MPs\" who introduced providers to the VIP lane. \"So Kemi, my role was exactly the same as all other Conservative MPs and peers who were trying to help provide PPE… if I have done wrong, then so have all the others in the VIP lane. In which case, you should be calling out for them to resign as well. That's if you manage to work out what it is they are supposed to have done wrong.\"  She concludes by saying she has no wish to rejoin the Lords as a Conservative Peer \"assuming there still is a Conservative Party before the next General Election\". Baroness Mone lost the Conservative whip when she took a leave of absence from the Lords in 2022, and Ms Badenoch has made it clear she would not be welcome back. The letter comes as an online petition calling for Baroness Mone to step down from the Lords, launched by the Covid-19 Bereaved Families for Justice, attracted 60,000 signatures in 24 hours. The Conservative Party has been approached for comment."
    },
    {
        "title": "'Best month ever' for UK battery electric vehicle sales",
        "description": "Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures.",
        "url": "https://news.sky.com/story/best-month-ever-for-uk-battery-electric-vehicle-sales-13443516",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ev-evs-electric-cars_7040053.jpg?20251003124545",
        "type": "Business",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The Society for Motor Manufacturers and Traders attributed the rise to the government's Electric Car Grant scheme, along with factors such as an \"ever-increasing choice of models\".",
        "Content": "By Daniel Binns, business reporter  Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures. More than 72,000 new BEVs were registered in September, accounting for 23.3% of the total market, the Society for Motor Manufacturers and Traders (SMMT) said. It described the figures - a 29% rise on the 56,000 BEVs sold in September 2024 - as \"the best month on record for BEV volumes\". The motor lobby group attributed the increase to the government's Electric Car Grant scheme, as well as factors such as the \"ever-increasing choice of models\" in the sector. More than 20,000 consumers have taken advantage since the £650m grant scheme was launched earlier this summer. It offers discounts of up to £3,750 on 36 electric models. Overall, the SMMT said just over 50% of the 312,887 new vehicles registered last month were electric models, including both hybrid and battery types. The total number of newly registered cars and other vehicles was up nearly 14% compared to last year, the best September performance since 2020, it added. Manufacturers have been set a target of ensuring 28% of vehicles sold this year must be electric, although the mandate was relaxed earlier this year to include hybrid as well as battery-only cars. Mike Hawes, chief executive of the SMMT, said: \"Electrified vehicles are powering market growth after a sluggish summer - and with record ZEV [zero emission vehicles] uptake, massive industry investment is paying off, despite demand still trailing ambition. \"The Electric Car Grant will help to break down one of the barriers holding back more drivers from making the switch - and tackling remaining roadblocks, by unlocking infrastructure investment and driving down energy costs, will be crucial to the success of the industry and the environmental goals we share.\" However, the SMMT said more still needed to be done to \"re-energise\" private buyers to switch to electric. Read more from Sky News:Baroness Mone attacks 'reckless' BadenochCustomer details stolen in Renault cyber attackCotswold Company lays groundwork for sale Commenting on the figures, Colin Walker, from the Energy and Climate Intelligence Unit, said: \"Demand for electric cars is up again and factoring in the flexibilities the car industry lobbied for in the UK's EV policy, sales are now ahead of where they need to be to hit this year's target. \"That would be two years in a row that the targets would have been hit and drivers are making hundreds of pounds of savings each year by making the switch to electric.\" Transport Secretary Heidi Alexander added: \"Our discounts have sparked a surge in electric car sales, making them cheaper and within reach of more households than ever before.\""
    },
    {
        "title": "Furniture retailer Cotswold Company lays groundwork for sale",
        "description": "The long-standing owner of The Cotswold Company, the premium furniture and homewares brand, is paving the way for a sale after retaining investment bankers to oversee discussions with potential buyers.",
        "url": "https://news.sky.com/story/furniture-retailer-cotswold-company-lays-groundwork-for-sale-13443435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cotswold-company-furniture_7039889.jpg?20251003104439",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-03 09:36:00",
        "Headline": "Private equity investor True has appointed Arrowpoint Advisory to help prepare The Cotswold Company for a sale nine years after it last changed hands, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The long-standing owner of The Cotswold Company, the premium furniture and homewares brand, is paving the way for a sale after retaining investment bankers to oversee discussions with potential buyers. Sky News has learnt that True, the private equity firm, recently appointed Rothschild-owned Arrowpoint Advisory to formulate a long-term disposal plan. Sources said an auction of the premium handcrafted furniture retailer was not imminent, but acknowledged True was expected to pursue a sale in the next couple of years. The investor has owned the business since 2016. News of the prospective sale comes two weeks after The Cotswold Company reported a 30% rise in sales in the six months to August 30. It said the rise had been driven by strong momentum behind the brand, as well as improvements to its digital offering. Read more from Sky News:Japan could run out of AsahiTinned tuna-owner to unveil £1.5bn floatSupplier's plea over JLR cyber attack The company has more than 250,000 active customers, and opened two new showrooms during the half-year period. Ralph Tucker, The Cotswold Company's chief executive, said it provided \"alternatives to soulless and low-quality furniture\". It recently recruited TV personality Will Kirk as its quality expert, which it hopes will cement its credentials as a seller of products known for their craftsmanship and sustainability. True and The Cotswold Company declined to comment."
    },
    {
        "title": "Customer details stolen in Renault UK cyber attack",
        "description": "Renault UK has become the latest car company to be hit by a cyber attack.",
        "url": "https://news.sky.com/story/customer-details-stolen-in-renault-uk-cyber-attack-13443469",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-renault-car_7039968.jpg?20251003113040",
        "type": "Business",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-10-03 10:15:00",
        "Headline": "The car firm has insisted that the breach was an \"isolated incident\" and that no financial information was accessed.",
        "Content": "By Daniel Binns, business reporter  Renault UK has become the latest car company to be hit by a cyber attack. The firm said some customer personal data had been accessed during a breach of one of its third-party data providers, but that no financial information or passwords had been compromised. A spokesman said this included \"customer names, addresses, dates of birth, gender, phone numbers, vehicle identification numbers and vehicle registration details\". It comes after Jaguar Land Rover (JLR) was forced to suspend production at its UK factories following a cyber attack on 31 August. JLR said earlier this week that it planned to resume limited production \"in the coming days\", but no firm date has been announced. Renault UK said none of its systems had been compromised, and manufacturing has not been affected. A spokesperson added: \"The third-party [data] provider has confirmed this is an isolated incident which has been contained, and we are working with it to ensure that all appropriate actions are being taken. We have notified all relevant authorities... \"We wish to apologise to all affected customers. Data privacy is of the upmost importance to us and we deeply regret that this has occurred.\" Read more from Sky News:Two men killed in synagogue attack namedJapan could run out of AsahiTinned tuna-owner to unveil £1.5bn float Renault UK confirmed it was in the process of contacting all customers affected and advised them \"to be cautious of any unsolicited requests for personal information\". It refused to say how many were affected \"for ongoing data security reasons\". Retailers, airports and even a nursery chain have been targeted by cyber criminals during a spate of online attacks in recent months."
    },
    {
        "title": "Formula One podcaster Audioboom revs up talks about sale",
        "description": "The London-listed media company which produces Formula One motor racing&#8217;s official podcast series is exploring a sale following a fresh set of approaches from potential buyers.",
        "url": "https://news.sky.com/story/formula-one-podcaster-audioboom-revs-up-talks-about-sale-13443442",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-f1-formula-one-grand-prix_7030120.jpg?20250924093013",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-03 12:44:00",
        "Headline": "The London-listed podcast producer whose titles include F1: Beyond the Grid is working with J Goodwin & Co to explore talks with prospective buyers, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The London-listed media company which produces Formula One motor racing’s official podcast series is exploring a sale following a fresh set of approaches from potential buyers. Sky News has learnt that Audioboom Group is working with advisers to explore the terms of a potential takeover of the company. J Goodwin & Co, a firm founded by prominent media industry banker Jonathan Goodwin, is understood to be overseeing talks with prospective buyers. Audioboom has a market capitalisation of close to £100m, after a 157% surge in its valuation over the last 12 months. Media analysts cited the likes of Fox Corporation and iHeartMedia as potential bidders for Audioboom, although it was unclear on Friday whether any formal talks were yet taking place with them or other third parties. Any deal would probably need to be pitched at a significant premium to the current share price to secure a recommendation from Audioboom's board. Audioboom produces podcasts including the official Formula 1 titles F1: Beyond the Grid and F1 Nation, True Crime Obsessed and No Such Thing As A Fish. The company says its shows are downloaded 135 million times each month by more than 40 million listeners around the world. It is ranked as the fifth-largest podcast publisher in the US by Edison Research. Read more from Sky News:Customer details stolen in Renault cyber attackJapan could run out of AsahiTinned tuna-owner to unveil £1.5bn float Audioboom-produced content is distributed through the likes of Apple Podcasts, YouTube and Spotify. It recently announced the appointment of Craig Eastwood, a former executive at British podcast network Adelicious, to spearhead an international expansion that the company said would be \"pivotal to Audioboom's long-term growth strategy\". The exploration of a sale is not the first time that Audioboom has engaged in such a process. In 2020, it worked with the merchant bank The Raine Group to hold talks with suitors but eventually called off the process. On Friday afternoon, shares in Audioboom were trading at 547.5p, up about 1.4% on the day. Audioboom could not be reached for comment."
    },
    {
        "title": "Japan could be hours away from running out of Asahi",
        "description": "Japan could be hours away from running out of Asahi, the country's most popular beer.",
        "url": "https://news.sky.com/story/super-dry160why-japan-could-be-hours-away-from-running-out-of-asahi-its-most-popular-beer-13443294",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-asahi-beer_7039639.jpg?20251003031913",
        "type": "Business",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-03 02:17:00",
        "Headline": "A cyber-attack has forced dozens of Japanese factories to stop production - with shops and restaurants reluctant to stock other brands.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Japan could be hours away from running out of Asahi, the country's most popular beer. Dozens of factories nationwide have ground to a halt following a cyber attack on Monday. The breach disabled the company's ordering and delivery systems - and also took its call centre operations offline. Supermarkets and Japanese pubs known as izakayas risk running super dry, with some retailers raising fears of potential panic buying. According to NHK, Asahi Group has now had to suspend plans to launch new products including soft drinks, coffee and throat lozenges. One wholesaler expects to run out of beer kegs by Saturday at the latest, meaning they'll no longer be able to supply booze to retailers. They are now considering whether to start selling other brands as a temporary measure. \n                  Japan's prime minister Shigeru Ishiba resigns\n                 \n                  Elderly woman conned by romance scammer posing as stranded astronaut\n                 \n                  Japan releases AI-generated video showing simulation of Mount Fuji violently erupting\n                 Akira Kudo, who runs an izakaya in Tokyo, has been told that one of the two brands of Asahi he regularly purchases is now out of stock. He's now unable to predict when pints can be poured again. \"We have received beer from the wholesaler to replace Asahi, but we would like to avoid using other manufacturers if possible, so we will consider our options until the very last minute,\" Akira added. Read more from Sky News:William hints at 'changes' when he is kingSean 'Diddy' Combs admits 'past wrongs' A shortage may leave Japanese drinkers unimpressed. While there are other breweries in the country, Asahi has a fiercely loyal following. Figures from Kirin Holdings suggest that the typical consumer drank 34.5 litres of beer a year in 2022, the equivalent of 54 large bottles. Asahi executives are now consulting with the police and trying to determine whether the company has fallen victim to ransomware. They have stressed that no personal information or customer data has been leaked. Brewing operations outside of Japan - including in the UK - are also unaffected. There have been a series of high-profile cyber attacks on well-known brands in recent months - including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR)."
    },
    {
        "title": "The Green Party might be small but it's thinking big - can it make a dent in Reform's rise?",
        "description": "It's a small party with big ambition, a handful of MPs led by a controversial but charismatic leader determined to turn anti-establishment sentiment into a major political breakthrough.",
        "url": "https://news.sky.com/story/the-green-party-might-be-small-but-its-thinking-big-can-it-make-a-dent-in-reforms-rise-13443331",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-zack-polanski-green-party_7009132.jpg?20250902113234",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-10-03 06:21:00",
        "Headline": "With a palpable new air of brashness and confidence, the Green Party will be making waves this weekend, as their party conference commences in Bournemouth.",
        "Content": "\n          Political correspondent\n              @wizbates\n It's a small party with big ambition, a handful of MPs led by a controversial but charismatic leader determined to turn anti-establishment sentiment into a major political breakthrough. No, not Reform - it's the Greens with a palpable new air of brashness and confidence that will be making waves this weekend, as their party conference commences in the seaside town of Bournemouth. As a movement in the UK, they have maintained a steadfast presence over many years but have failed to really cut through nationally, with disenfranchised left-wingers more inclined to drift to the Lib Dems. The last general election was different though, taking them from one to four MPs - no mean feat in a first past the post system. And now a potent mixture of fractured politics and mass disappointment at Labour's faltering first year in office has left an opportunity for even greater advancement. Ready to seize it is their newly elected leader, Zack Polanski, whose style seems well-suited to the current climate and is far more confrontational than his gentler predecessors. He is adept at social media and takes to it with an ease almost every other politician can only dream of - no clunky attempts at mimicking influencers or boring walking and talking in the constituency videos. \n                  Palestine Action proscription must be 'withdrawn', says Green Party leader Zack Polanski\n                 \n                  What's Zack Polanski's story?\n                 \n                  New Green leader reveals he spoke to Jeremy Corbyn - and doesn't rule out pact\n                 Instead, he goes out and interviews voters himself, coming across as interested and persuasive and has even started his own podcast, which is well-executed and engaging. Another explanation of their current momentum is their policies which are clear, memorable and indicative of their values - something that most political parties aim for but don't often achieve. The Greens would bring in a wealth tax aimed at the super rich, they would nationalise the water companies, they describe the assault on Gaza as genocide, they support self-ID for trans people, and of course, they want to protect the environment. And I remembered all that without googling - how's that for landing your message?  But of course, like all parties, especially those gaining support, they face challenges and criticism. Their biggest obstacle as they grow will be maintaining unity amongst the increasingly disparate factions of new Green voters. Is it possible to happily combine countryside-loving former Tories with angry ex-Labour city dwellers, pro-Gaza Muslims and trans activists? So far, they seem to be managing it, but we'll find out over the next few days if any cracks are starting to appear. Another big obstacle is Nigel Farage, a figure uniquely skilled at demanding attention and dominating the political landscape. When it comes to hoovering up the support of the disenfranchised, he's been doing it for decades and it's paying off, with polls now tipping him for prime minister. Read more:People in the UK have less disposable incomeThe battle for the soul of Your Party continues In his leader's speech, Mr Polanski accused Labour of playing \"handmaidens\" to Reform's \"dangerous politics\" rather than confronting it. \"When Farage says jump, Labour asks 'how high',\" he said. Despite the Greens having a comparable number of MPs, they are not making the same kind of progress and like every other leader, Mr Polanksi will have to work out how to make a dent in Reform's rise. At the same time, they have a tricky challenger from their own side, with Jeremy Corbyn and Zarah Sultana's chaotic new party likely to eat into their vote, if it can survive. And finally, they also face the standard criticisms - that their sums don't add up, that their tax and spend plans are unrealistic, that they are woke and disconnected - all of which they will need to take on to get closer to power. These are just some of the issues that will come up in Bournemouth this weekend, where the forecast predicts a storm is coming - let's see."
    },
    {
        "title": "Police call for protest against Palestine Action ban to be cancelled after Manchester synagogue attack",
        "description": "London and Manchester police have called for protests to be delayed or cancelled after the synagogue terror attack.",
        "url": "https://news.sky.com/story/met-police-calls-for-protest-against-palestine-action-ban-to-be-cancelled-after-manchester-synagogue-attack-13443348",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-synagogue_7039662.jpg?20251003062155",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-03 06:54:00",
        "Headline": "Police in the capital say they want to deploy every available officer to protect Jewish communities but are instead having to prepare for a protest in Trafalgar Square.",
        "Content": "London and Manchester police have called for protests to be delayed or cancelled after the synagogue terror attack. Metropolitan Police said it wanted to deploy every available officer to protect Jewish communities, but was instead having to prepare for a protest against the banning of Palestine Action. Politics latest: Mahmood says pro-Palestinian protests 'dishonourable' after Manchester attack The Met said it was \"having to plan for a gathering of more than 1,000 people in Trafalgar Square on Saturday in support of a terrorist organisation\". It added: \"By choosing to encourage mass law breaking on this scale, Defend Our Juries [the protest organisers] are drawing resources away from the communities of London at a time when they are needed most.\" Palestine Action was banned under anti-terrorism laws in July. Greater Manchester's police chief echoed the call, urging protest organisers in the city to ask \"whether this is really the right time\". \n                  Arrests made as Palestine Action supporters protest at Labour conference in Liverpool\n                 \n                  Sally Rooney says she's been told not to enter UK because she may be arrested\n                 \n                  First people charged with supporting Palestine Action plead not guilty\n                 \"You could do the responsible and sensitive thing and refrain, on this occasion, from protesting in a manner which is likely to add to the trauma currently being experienced by our Jewish community,\" said Chief Constable Sir Stephen Watson. He said peaceful gatherings would not be stopped but warned officers would \"act immediately to curtail any acts of violence, intimidation or threat\". Defend Our Juries, which has led demonstrations against the Palestine Action ban, said it planned to go ahead with the march. \"Today, the Metropolitan Police wrote to us to ask that we postpone Saturday's mass protest in Trafalgar Square, citing 'significant pressure on policing',\" said a statement. \"Our response in short: Don't arrest us then.\" It comes after the home secretary criticised separate pro-Palestinian protests held last night as \"fundamentally un-British\" and \"dishonourable\". A demonstration - held to protest the Israeli navy halting a flotilla carrying aid to Gaza - was held in London's Whitehall on Thursday evening, hours after the attack in Crumpsall in which two men were killed. The Metropolitan Police said 40 people had been arrested in the course of the protest, six of whom were arrested for assaults on police officers.  Speaking to Anna Jones on Sky News Breakfast, Shabana Mahmood said she was \"very disappointed\" to see the protests go ahead, given the context. \"I think that behaviour is fundamentally un-British,\" she said. \"I think it's dishonourable.\" She said the issues that had been driving the pro-Palestine protests have been \"going on for some time\" and \"don't look like they're going to come to an end any day soon\" - but that those behind the demonstrations could have taken a \"step back\". \"They could have stepped back and just given a community that has suffered deep loss just a day or two to process what has happened and to carry on with the grieving process,\" she said. \"I think some humanity could have been shown.\" Any further protests must \"comply with the law and, where someone steps outside of the law of our land, they will be arrested\", the home secretary warned. She added: \"And to anybody who is thinking about going on a protest, what I would say is, imagine if that was you that has had a family member murdered on the holiest day in your faith. Imagine how you would feel and then just step back for a minute, give people a chance to grieve. \"We can get back to our protests later - just because you have a freedom doesn't mean you have to use it.\" However, Zack Polanski, the leader of the Green Party, accused the home secretary of being \"deeply irresponsible\" for her comments about pro-Palestine protests. \"I think ultimately conflating protests against the genocide in Gaza and ultimately weaponising that against an antisemitic attack on our streets, a terrorist attack, is deeply irresponsible,\" he told Sky News Breakfast. The Green Party leader said it was \"worrying when governments are increasingly trying to crush down dissent\" and using \"what is a brutal attack... to try and make a point about protest\". \"We need statesmanship at this moment. We need responsibility,\" he added. The two men killed outside the Heaton Park Hebrew Congregation Synagogue in Thursday's attack have been named by police as Adrian Daulby, 53, and Melvin Cravitz, 66. The suspect has been named as Jihad al Shamie - a 35-year-old British citizen of Syrian descent. He is understood to have been granted British citizenship in 2006 when he was around 16 years old, having entered the UK as a young child. Ms Mahmood confirmed to Sky News that the perpetrator was not known to counter-terror police and that he had not been referred to the government's anti-terrorism scheme Prevent. Three other people - two men in their 30s and a woman in her 60s - have been arrested on suspicion of the commission, preparation and instigation of acts of terrorism. Read more:What we know about the attackStarmer vows to 'wrap arms' around Jewish community Asked if she was concerned about further attacks, Ms Mahmood said the government was on \"high alert\". She said there had been an increase in police resources not just in Manchester but across he country. \"We as a government want to make sure that people feel safe going about their business today; so people will see an increased police presence, particularly around synagogues and other places of interest for the Jewish community,\" she said."
    },
    {
        "title": "Former minister Grant Shapps reveals his father-in-law was present at 'chilling' Manchester synagogue attack",
        "description": "A former Tory cabinet minister has revealed that his father-in-law was present at the Manchester synagogue attack as he called on the public to \"stand unshaken against hate\".",
        "url": "https://news.sky.com/story/former-minister-grant-shapps-reveals-his-father-in-law-was-present-at-chilling-manchester-synagogue-attack-13443510",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-grant-shapps-honour_6882686.jpg?20251003144013",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-03 11:31:00",
        "Headline": "Sir Grant Shapps has urged the public to \"stand unshaken against hate\" following Thursday's Manchester synagogue attack.",
        "Content": "A former Tory cabinet minister has revealed that his father-in-law was present at the Manchester synagogue attack as he called on the public to \"stand unshaken against hate\". Sir Grant Shapps, who is Jewish, said it was \"chilling\" to hear his father-in-law's \"first-hand account\" of the attack at Heaton Park Hebrew Congregation on Thursday, in which two men were killed. Politics latest: Protests after Manchester attack were 'fundamentally un-British' In a post on X, Sir Grant, who has served in various Conservative cabinet posts, including home secretary and defence secretary, said: \"Yesterday's terrorist attack on Manchester's synagogue was an assault on the Jewish community and our shared humanity; hearing my father-in-law's chilling first-hand account brings home the horror, as we mourn the lost, pray for the injured, and stand unshaken against hate.\" Elaborating on the account, Sir Grant told The Times newspaper that his father-in-law, Michael Goldstone, came \"face-to-face\" with al Shamie from inside the synagogue, where he is a member of the congregation. He said: \"He was face-to-face with the terrorist, holding the inside of the door, as he tried to break down the front doors. \"They locked the doors when the car crashed into the gate, which prevented more killings.\" \n                  Who is running in the Conservative Party leadership race?\n                 \n                  Sunak insists Tories can still win election after minister admits party could lose \n                 \n                  Grant Shapps 'angry inside' over infected blood scandal ahead of inquiry report\n                 The two men killed outside the Heaton Park Hebrew Congregation Synagogue in Thursday's attack have been named by police as Adrian Daulby, 53, and Melvin Cravitz, 66. One of the victims killed in yesterday's attack was shot mistakenly by officers during the armed response, Greater Manchester Police believe. The suspect has been named as Jihad al Shamie - a 35-year-old British citizen of Syrian descent. He is understood to have been granted British citizenship in 2006, having entered the UK as a young child.  His family have condemned the \"heinous\" attack, which they said targeted \"peaceful, innocent civilians\". \"We fully distance ourselves from this attack and express our deep shock and sorrow over what has happened,\" his relatives wrote on social media. Read more:What we know about the synagogue attack in ManchesterWorshippers leave synagogue to hear news of attack Home Secretary Shabana Mahmood has confirmed to Sky News that the perpetrator was not known to counter-terror police and that he had not been referred to the government's anti-terrorism scheme Prevent. In a visit to the scene of the attack on Friday, Prime Minister Sir Keir Starmer said \"this was a dreadful attack, a terrorist attack to inflict fear. Attacking Jews because they are Jews.\"It's really important today that the whole country comes together, people of all faiths and no faith, stand in support and solidarity with our Jewish community,\" he said."
    },
    {
        "title": "Baroness Mone: I have no wish to rejoin Lords as Conservative peer",
        "description": "Baroness Michell Mone has accused Conservative leader Kemi Badenoch of using \"reckless\" language that could prejudice a police investigation, and says she has \"no desire\" to return to the House of Lords as a Tory peer.",
        "url": "https://news.sky.com/story/baroness-mone-attacks-reckless-kemi-badenoch-over-ppe-police-action-call-13443485",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lady-mone-michelle-mone_7038030.jpg?20251001185548",
        "type": "Politics",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-03 12:42:00",
        "Headline": "The former Conservative peer has accused the Tory leader of using \"inflammatory\" language and potentially prejudicing a criminal investigation.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Baroness Michell Mone has accused Conservative leader Kemi Badenoch of using \"reckless\" language that could prejudice a police investigation, and says she has \"no desire\" to return to the House of Lords as a Tory peer. A day after she wrote to Sir Keir Starmer, accusing the government of pursuing a vendetta against her, the former Conservative peer responded to comments by Ms Badenoch following a High Court ruling that a company linked to Baroness Mone's husband must repay £122m received for surgical gowns. The court found that PPE Medpro, founded by her husband Doug Barrowman, was in breach of contract with the Department of Health and gave it two weeks to repay the sum. While not a director of the company, Baroness Mone used her political contacts to introduce PPE Medpro to the government's \"VIP fast-lane\" at the start of the pandemic, and a family trust of which her children are beneficiaries received £29m of the profits. A separate criminal investigation by the National Crime Agency (NCA) is ongoing, and assets linked to the couple worth £75m have been frozen while it continues. In a series of radio interviews, Ms Badenoch criticised Baroness Mone, accusing her of bringing shame on the Conservative Party and calling for her to step down from the House of Lords. \"Where people do wrong, they should be punished,\" she said. \"They should face the full force of the law and this is something that I very strongly believe in,\" she said. \"And as the prosecution against her continues, they should throw the book at her for every single bit of wrongdoing that has taken place.\"  In a letter from her private office, Baroness Mone accuses the Tory leader of being ignorant of the facts and calls out a series of other Conservative politicians who introduced companies to the VIP lane. \"I was shocked to the core to read about your inflammatory language on BBC Radio yesterday calling for me to resign from the House of Lords,\" she writes. \"You are commenting on a live criminal investigation that could prejudice the outcome of any trial, and in so doing, you are reportable to the attorney general for breach of and contempt of court. Does no one ever tell you these things before you and your colleagues make reckless statements in the public domain?\" Read more from Sky News:Customer details stolen in Renault cyber attackJapan could run out of AsahiTinned tuna-owner to unveil £1.5bn float Baroness Mone goes on to say the NCA investigation has \"nothing to do with PPE Medpro and the contracts\". \"The case theory of the NCA investigation is that I somehow misled the Conservative government about my alleged concealed involvement and ended up pocketing a lot of money,\" she writes. \"Well I'm sorry to disappoint you, but it isn't true.\" She also says the Conservative government knew of her involvement and names former health secretary Matt Hancock, Lord Agnew, Lord Feldman and Lord Chadlington as being among 51 \"mostly Conservative peers and MPs\" who introduced providers to the VIP lane. \"So Kemi, my role was exactly the same as all other Conservative MPs and peers who were trying to help provide PPE… if I have done wrong, then so have all the others in the VIP lane. In which case, you should be calling out for them to resign as well. That's if you manage to work out what it is they are supposed to have done wrong.\"  She concludes by saying she has no wish to rejoin the Lords as a Conservative Peer \"assuming there still is a Conservative Party before the next General Election\". Baroness Mone lost the Conservative whip when she took a leave of absence from the Lords in 2022, and Ms Badenoch has made it clear she would not be welcome back. The letter comes as an online petition calling for Baroness Mone to step down from the Lords, launched by the Covid-19 Bereaved Families for Justice, attracted 60,000 signatures in 24 hours. The Conservative Party has been approached for comment."
    },
    {
        "title": "Starmer made a mistake calling Reform policy 'racist', Harriet Harman says",
        "description": "Sir Keir Stamer made a mistake by labelling Reform UK's migration policy racist, a Labour Party grandee has said.",
        "url": "https://news.sky.com/story/starmer-made-a-mistake-calling-reform-policy-racist-harriet-harman-says-13442862",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039332.jpg?20251002173952",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-03 04:09:00",
        "Headline": "The former Labour minister said the prime minister should have moved on and not repeated the word, after attacking Reform's migration policy.",
        "Content": " Sir Keir Stamer made a mistake by labelling Reform UK's migration policy racist, a Labour Party grandee has said. Dame Harriet Harman told the Sky News Electoral Dysfunction podcast with political editor Beth Rigby that trying to label a policy racist, but not the politicians or the supporters, was too nuanced of an argument for voters to understand. The Labour Party conference was dominated by discussions about Nigel Farage and Reform UK, and the way to fight off their surge in the polls. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Speaking to the BBC last Sunday, the prime minister said Reform's plans to require settled immigrants to apply for British citizenship or face deportation was a \"racist policy\". However, he and other cabinet ministers declined to call Mr Farage, Reform UK or their supporters racist in subsequent interviews. Read more:Starmer says Farage isn't racistPM brands Reform policy racistLong road ahead for Starmer, says Beth Rigby Dame Harriet said: \"So I think in a way, what happened is he made that without planning it - he said the racist thing. \"And then instead of just going back on it, he slightly doubled down.\" Asked by Rigby if it was a mistake, Dame Harriet says that the prime minister should have \"just moved on and redefined it rather than trying to explain it\". \"You can't distinguish between a racist policy from a party and a racist party leader because that's too subtle and nuanced for the public,\" she added.  Politics latest: Follow live updates Pushed by Rigby on if it was a mistake to use the word racist, Dame Harriet said \"yeah\". She added: \"It doesn't work well. \"I think it's much better to take things on as divisive rather than label the person, to label someone - that's the kind of end of a conversation. \"I think you have to be explaining why it's wrong, why it's harmful, why it's problematic.\""
    },
    {
        "title": "Why is Keir Starmer obsessed with Nigel Farage? ",
        "description": null,
        "url": "https://news.sky.com/story/why-is-keir-starmer-obsessed-with-nigel-farage-13443064",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251002190858",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-03 04:14:00",
        "Headline": "No subtitle found",
        "Content": "When the Prime Minister said Reform's migration policy was 'racist' - was that a mistake?  It dominated the Labour Party conference in Liverpool this week, where Beth asked sIR Keir Starmer about his comments... and pulled him up on Donald Trump's remarks about Sadiq Khan. So with the May elections starting to loom in the minds of politicians, how worried are Labour that they are going to massively lose out to Reform? And did Andy Burnham have the impact everyone expected in Liverpool? Plus, Harriet and Ruth give their tales of conferences past. Remember, you can also watch Beth Rigby, Harriet Harman and Ruth Davidson on YouTube. Fill in our survey: https://forms.gle/G72yDkjs6EmoVLp39"
    },
    {
        "title": "Palestine Action proscription must be 'withdrawn', says Green Party leader Zack Polanski",
        "description": "The proscription of Palestine Action must be \"withdrawn\", Green Party leader Zack Polanski has said.",
        "url": "https://news.sky.com/story/palestine-action-proscription-must-be-withdrawn-says-green-party-leader-zack-polanski-13443556",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-green-party-zack-polanski_7040119.jpg?20251003134745",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-03 13:02:00",
        "Headline": "The head of the Greens accuses Labour of carrying out a \"draconian crackdown\" on the right to protest - as pro-Palestine groups are criticised for organising demonstrations following the Manchester synagogue attack.",
        "Content": "The proscription of Palestine Action must be \"withdrawn\", Green Party leader Zack Polanski has said. Addressing his party's conference in Bournemouth, Mr Polanski said the Labour government had overseen a \"draconian crackdown on the right to protest\" by legally banning and labelling the group a terrorist organisation. Politics latest: PM welcomes first female Archbishop of Canterbury It comes as a group that supports Palestine Action was criticised for planning a march in London on Saturday, days after the attack on a synagogue in Manchester that resulted in the death of two men. The Met Police has called for a planned protest, organised by Defend Our Juries, to be delayed or cancelled after the incident on Thursday, while Shabana Mahmood, the home secretary, called a separate protest held on Thursday in support of Palestine as \"dishonorable\" and \"un-British\". Mr Polanski said he felt Thursday's attack \"deeply\" as a Jewish man raised in north Manchester, and that \"my heart is with our community more widely\". But he repeated his belief that Israel's actions in Gaza amounted to \"genocide\" and that the UK \"must stop selling arms to Israel\". \n                  The Green Party might be small but it's thinking big - can it make a dent in Reform's rise?\n                 \n                  What's Zack Polanski's story?\n                 \n                  New Green leader reveals he spoke to Jeremy Corbyn - and doesn't rule out pact\n                 \"We must stop sharing intelligence. We will do everything we can to stop the genocide.\" The government has suspended some arms exports licences to Israel due to concerns they could be used to violate international law. However, components for the F35 jets were not included in the ban, except when they were sent directly to Israel, as the UK is part of a supply chain that sells the jets to more than 20 countries. Mr Polanski went on to say that every MP who had supported the proscription of Palestine Action as terrorist organisation should \"hang their heads in shame\". \"We cannot talk about stopping genocide without talking about draconian crackdown on the right to protest happening against those taking action for Palestine; using terrorist legislation to arrest hundreds and hundreds of protesters for simply holding up a sign,\" he said. \"This country has a proud tradition of protecting civil liberties, but once again, a Labour government is cracking down on our rights from terrorist proscriptions against protesters, to banning journalists from their conference, to diving into a rushed, evidence-free plan for digital IDs that will only discriminate mainly against minorities. \"The alarm bells of authoritarianism are ringing loud and clear.\" Earlier today Mr Polanski, who was elected as Green Party leader last month, clashed with the home secretary on whether pro-Palestine protests should go ahead. Ms Mahmood said the issues that had been driving the pro-Palestine protests had been \"going on for some time\" and that those behind the demonstrations could have taken a \"step back\" to give the Jewish community a \"chance to grieve\". Read more:Former minister's father-in-law present at Manchester synagogue attackStarmer still has a very long road ahead \"They could have stepped back and just given a community that has suffered deep loss just a day or two to process what has happened and to carry on with the grieving process,\" she said. \"I think some humanity could have been shown.\" In response, Mr Polanski branded the home secretary's comments \"deeply irresponsible\". \"I think ultimately conflating protests against the genocide in Gaza and ultimately weaponising that against an anti-Semitic attack on our streets, a terrorist attack, is deeply irresponsible,\" he told Sky News Breakfast. The Green Party leader said it was \"worrying when governments are increasingly trying to crush down dissent\" and using \"what is a brutal attack... to try and make a point about protest\". \"We need statesmanship at this moment. We need responsibility,\" he added."
    },
    {
        "title": "'Best month ever' for UK battery electric vehicle sales",
        "description": "Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures.",
        "url": "https://news.sky.com/story/best-month-ever-for-uk-battery-electric-vehicle-sales-13443516",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ev-evs-electric-cars_7040053.jpg?20251003124545",
        "type": "Technology",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-10-03 23:01:00",
        "Headline": "The Society for Motor Manufacturers and Traders attributed the rise to the government's Electric Car Grant scheme, along with factors such as an \"ever-increasing choice of models\".",
        "Content": "By Daniel Binns, business reporter  Nearly a quarter of vehicles sold in the UK last month were battery electric (BEV) models, according to industry figures. More than 72,000 new BEVs were registered in September, accounting for 23.3% of the total market, the Society for Motor Manufacturers and Traders (SMMT) said. It described the figures - a 29% rise on the 56,000 BEVs sold in September 2024 - as \"the best month on record for BEV volumes\". The motor lobby group attributed the increase to the government's Electric Car Grant scheme, as well as factors such as the \"ever-increasing choice of models\" in the sector. More than 20,000 consumers have taken advantage since the £650m grant scheme was launched earlier this summer. It offers discounts of up to £3,750 on 36 electric models. Overall, the SMMT said just over 50% of the 312,887 new vehicles registered last month were electric models, including both hybrid and battery types. The total number of newly registered cars and other vehicles was up nearly 14% compared to last year, the best September performance since 2020, it added. Manufacturers have been set a target of ensuring 28% of vehicles sold this year must be electric, although the mandate was relaxed earlier this year to include hybrid as well as battery-only cars. Mike Hawes, chief executive of the SMMT, said: \"Electrified vehicles are powering market growth after a sluggish summer - and with record ZEV [zero emission vehicles] uptake, massive industry investment is paying off, despite demand still trailing ambition. \"The Electric Car Grant will help to break down one of the barriers holding back more drivers from making the switch - and tackling remaining roadblocks, by unlocking infrastructure investment and driving down energy costs, will be crucial to the success of the industry and the environmental goals we share.\" However, the SMMT said more still needed to be done to \"re-energise\" private buyers to switch to electric. Read more from Sky News:Baroness Mone attacks 'reckless' BadenochCustomer details stolen in Renault cyber attackCotswold Company lays groundwork for sale Commenting on the figures, Colin Walker, from the Energy and Climate Intelligence Unit, said: \"Demand for electric cars is up again and factoring in the flexibilities the car industry lobbied for in the UK's EV policy, sales are now ahead of where they need to be to hit this year's target. \"That would be two years in a row that the targets would have been hit and drivers are making hundreds of pounds of savings each year by making the switch to electric.\" Transport Secretary Heidi Alexander added: \"Our discounts have sparked a surge in electric car sales, making them cheaper and within reach of more households than ever before.\""
    },
    {
        "title": "Sean 'Diddy' Combs sentenced to more than four years in prison",
        "description": "Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers.",
        "url": "https://news.sky.com/story/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison-13443408",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-diddy-combs-court_7040465.jpg?20251003192849",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-10-03 08:48:00",
        "Headline": "The hip-hop mogul was convicted of two prostitution-related offences but cleared of the more serious charges of sex-trafficking and racketeering conspiracy following his high-profile trial earlier this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been sentenced to more than four years in prison over prostitution charges relating to his former girlfriends and male sex workers. Judge Arun Subramanian handed down his 50-month sentence - including a $500,000 fine - at the end of a long and emotional full-day hearing, which saw the hip-hop mogul speak out for the first time in court. Combs, 55, admitted his past behaviour was \"disgusting, shameful and sick\", and apologised personally to Cassie Ventura and \"Jane\", another former girlfriend who testified anonymously during the trial. But despite his plea for \"mercy\" and expressions of remorse, the judge told him he had abused his \"power and control\" with women he professed to love - and rejected the defence's characterisation that \"freak off\" sexual encounters were consensual experiences, that his was just a \"sex, drugs and rock'n'roll story\". Addressing Cassie and \"the other brave survivors who came forward\", the judge said. \"We heard you... I can only say your families are proud of you and your children will be proud of you. \"You weren't just talking to the jury you were talking to the women who feel powerless - you gave them a voice, you stood up to power, it's not easy.\" Combs showed no visible change of emotion as his sentence was delivered, looking straight ahead as the judge spoke. Afterwards, he seemed subdued - with no sign of the enthusiasm or feeling showed earlier in the day. Ahead of his own speech, the court heard from six of his seven children - causing the rapper to break down in tears as they spoke about how much they loved him, how he has changed, and how much they and their younger two-year-old sister need him. The sentencing brings to an end a sordid case that featured harrowing testimony - not just from Cassie and Jane, but also from former employees and associates of Combs. He was convicted in July of flying people around the US and abroad for sexual encounters, including his then girlfriends and male sex workers, in violation of prostitution laws. However, he was cleared of more serious charges of racketeering conspiracy and sex-trafficking that could have put him in jail for life. 'I hate myself right now' On the eve of his sentencing, Combs submitted a letter to the judge pleading for \"mercy\" and apologising for the \"hurt and pain\" he has caused others. He expanded on this in court, saying he wanted to \"personally apologise\" to Cassie for \"any harm\" he caused her \"emotionally or physically\", and to Jane - and all victims of domestic violence. He told the court he got \"lost in my excess and lost in my ego\", but since his time in prison he has been \"humbled and broken to my core\". Combs continued: \"I hate myself right now... I am truly sorry for it all.\" Read more:The rise and fall of DiddyDiddy sentencing: As it happened Once one of the most influential hip-hop producers of the 1990s and 2000s - the founder of Bad Boy Records and a Grammy-winning artist in his own right - he has led a very different life since his high-profile arrest. He was facing a maximum of 20 years in prison for the prostitution-related charges, so the sentence is towards the lower end of the scale. Prosecutors had argued he should spend at least 11 years behind bars, while Combs's lawyers were calling for him to be freed almost immediately due to time already served since his arrest just over a year ago. Christy Slavik, for the prosecution, told the judge sparing the rapper serious prison time would excuse years of violence. 'Make the most of that second chance' The judge, who had rejected bail for the rapper several times before sentencing, told him that he would get through his time in prison. It will be hard, he said, but he will still \"have a life afterwards\". Combs has \"a chance for renewal and redemption\", he added. \"What went wrong can be made right... I am counting on you to make the most of that second chance.\" Outside the courthouse, journalists and onlookers swarmed the pavements as TV crews stood in a long row across the street, echoing scenes from the two-month high-profile trial. It included four days of testimony from Cassie, now Cassie Ventura Fine, who told the court she was coerced and sometimes blackmailed into sexual encounters with male sex workers, referred to as \"freak offs\". Cassie responds Jurors were also shown video clips of Combs dragging and beating her in a Los Angeles hotel hallway after one of those sessions in 2016. Combs referred to this in court, saying it was a \"heavy burden\" that he will forever carry, and that he was \"sick from drugs\" and \"out of control\" at the time, \"lost in my excess and lost in my ego\". Ahead of the sentencing, Cassie also submitted a letter to the judge, calling Combs a \"manipulator\" and saying she would fear for her safety should he be immediately released. Responding to the sentence, her lawyers Douglas Wigdor and Meredith Firetog (Wigdor LLP), said: \"While nothing can undo the trauma caused by Combs, the sentence imposed today recognises the impact of the serious offences he committed. \"We are confident that with the support of her family and friends, Ms Ventura will continue healing knowing that her bravery and fortitude have been an inspiration to so many.\""
    },
    {
        "title": "Keeping Up Appearances star Dame Patricia Routledge has died",
        "description": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said.",
        "url": "https://news.sky.com/story/keeping-up-appearances-star-dame-patricia-routledge-has-died-13443457",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-clive-swift-patricia-routledge_7039926.jpg?20251003111802",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-03 10:04:00",
        "Headline": "Though best known for playing the notoriously snobbish Hyacinth Bucket in Keeping Up Appearances, the actress received her damehood for services to the theatre and charity.",
        "Content": "Actress Dame Patricia Routledge, best known for TV show Keeping Up Appearances, has died aged 96, her agent has said. \"We are deeply saddened to confirm the passing of Dame Patricia Routledge, who died peacefully in her sleep this morning surrounded by love,\" her agent said in a statement. \"Even at 96 years old, Dame Patricia's passion for her work and for connecting with live audiences never waned, just as new generations of audiences have continued to find her through her beloved television roles. \"She will be dearly missed by those closest to her and by her devoted admirers around the world.\" Dame Patricia played the notoriously snobbish Hyacinth Bucket in the BBC sitcom between 1990 and 1995, which attracted as many as 13 million viewers at its peak. She earned two BAFTA nominations for the role in 1992 and 1993. Another of her notable 90s TV appearances came when she played a pensioner-turned-detective in the £3m six-part BBC TV crime series Hetty Wainthropp Investigates. She also had a prolific career in the theatre, winning an Olivier Award for her role as the Old Lady in acclaimed composer Leonard Bernstein's operetta Candide in 1988, and a Tony Award for her part as Alice Challice in Darling Of The Day in 1968. The actress was honoured at Buckingham Palace in 2017, being made a Dame Commander of the British Empire for her services to the theatre and charity. She was born in Birkenhead, Merseyside in 1929, and went on to study English Language and Literature at the University of Liverpool, where she appeared in student shows before making her professional debut at the Liverpool Playhouse in 1952, playing Hippolyta in A Midsummer Night's Dream. Years later, after her career skyrocketed, she spoke of how important her northern roots were to her. \"You are never done with your roots. I think the people who try to make out that they are, are in deep trouble,\" she was once quoted as saying. Dame Patricia made her debut on a London stage in 1954, quickly establishing herself as a major character actress. She also became a Broadway star, wowing New York critics with her performance in the play How's The World Treating You? and appearing in numerous musicals. Later, Leonard Bernstein penned solos especially for her as she starred in the presidential drama 1600 Pennsylvania Avenue. Though she was best known for embodying Hyacinth Bucket in the '90s, she made memorable TV appearances from the 1950s. Notable roles included Victoria Regina for Granada in 1964 and Kitty in Victoria Wood: As Seen on TV in the mid-1980s. More recently, in 2016, Dame Patricia fronted a Channel 4 documentary celebrating the 150th anniversary of the birth of Beatrix Potter, having previously played the children's author on stage and in 2012. "
    },
    {
        "title": "Taylor Swift releases new album The Life Of A Showgirl",
        "description": "Taylor Swift has released her highly anticipated 12th studio album The Life Of A Showgirl.",
        "url": "https://news.sky.com/story/taylor-swift-releases-new-album-the-life-of-a-showgirl-and-shes-in-the-uk-13443302",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-taylor-swift-graham-norton-show_7039647.jpg?20251003045034",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-03 03:25:00",
        "Headline": "The 12-track record is expected to top charts around the world and features a collaboration with US pop star Sabrina Carpenter.",
        "Content": "Taylor Swift has released her highly anticipated 12th studio album The Life Of A Showgirl. The 12-track record, which is expected to top charts around the world, was unveiled at 5am. US pop star Sabrina Carpenter joins Swift on the title song as the only collaboration on the album, which was written during the European leg of her record-breaking Eras tour. The album was produced by Swift's long-time collaborators Max Martin and Shellback, two Swedish producers who have worked with her on some of her biggest hits. Friday will also see the debut of The Official Release Party Of A Showgirl in cinemas, which features the world premiere of the music video for the single The Fate Of Ophelia, as well as behind-the-scenes footage and lyric videos from the album. The 89-minute film will be shown in cinemas around the country, though many screenings have already sold out. Swift discusses 'fun' task of planning wedding The 35-year-old will appear on The Graham Norton Show on Friday evening, where she will say she wants to finish promoting her album before the \"fun\" task of planning her wedding. In the segment, filmed in the UK on Thursday, the 14-time Grammy winner spoke about her engagement with NFL star Travis Kelce. She told Norton: \"He really crushed it in surprising me. While we were talking on his podcast, he had a complete garden built out the back of his house to propose in. He went all out - 10 out of 10.\" Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tour The full track list is: 1. The Fate Of Ophelia\n2. Elizabeth Taylor\n3. Opalite\n4. Father Figure\n5. Eldest Daughter\n6. Ruin The Friendship\n7. Actually Romantic\n8. Wi$h Li$t\n9. Wood\n10. Cancelled!\n11. Honey\n12. The Life Of A Showgirl (featuring Sabrina Carpenter) Asked when the wedding will take place, she said: \"You'll know.\" She added: \"I want to do the album stuff first, and the wedding is what happens after in terms of planning. I think it will be fun to plan.\" The Life Of A Showgirl is Swift's first album since she announced her engagement to 35-year-old Kelce in an Instagram post in August, which was captioned: \"Your English teacher and your gym teacher are getting married.\""
    },
    {
        "title": "Long-lost Spanish treasure worth $1m discovered off Florida coast",
        "description": "Long-lost Spanish treasure worth an estimated $1m (&#163;740,000) has been discovered off the coast of Florida.",
        "url": "https://news.sky.com/story/long-lost-spanish-treasure-worth-1m-discovered-off-florida-coast-13443304",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-coins-coast_7039649.jpg?20251003045840",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-10-03 03:07:00",
        "Headline": "What makes this haul special is that dates and mint marks are still visible on some of the coins found over the summer - a valuable resource for historians.",
        "Content": "Long-lost Spanish treasure worth an estimated $1m (£740,000) has been discovered off the coast of Florida. More than 1,000 silver and gold coins were found by a team of specialist divers in a stretch of water aptly known as the \"Treasure Coast\". It is believed they were minted in the Spanish colonies of Bolivia, Mexico and Peru - and were bound for Spain on a fleet of ships also carrying jewels back in 1715. But the precious loot spilled into the sea when a hurricane wrecked the flotilla. This is not the first such discovery to be made along the Treasure Coast, as gold coins worth millions of dollars have been uncovered by salvagers and hunters in recent years. What makes this haul special is that dates and mint marks are still visible on some of the coins found over the summer - a valuable resource for historians. Sal Guttoso from Queen Jewels, the company that struck gold, said: \"This discovery is not only about the treasure itself, but the stories it tells. \n                  Sean 'Diddy' Combs sentenced to more than four years in prison\n                 \n                  Sean 'Diddy' Combs latest: Hip-hop mogul sentenced to more than four years in prison\n                 \n                  Balin Miller, renowned Alaskan climber, dies after falling at Yosemite National Park while livestreaming\n                 \"Each coin is a piece of history - a tangible link to the people who lived, worked and sailed during the Golden Age of the Spanish Empire. \"Finding 1,000 of them in a single recovery is both rare and extraordinary.\" The company uses underwater metal detectors, and hand fans sand, to carefully comb the sea floor. Florida law means \"treasure troves\" belong to the state, but excavators are often given permission to conduct \"recovery services\". As well as this, 20% of historical artefacts must remain in public ownership - either for research or to go on display."
    }
]