[
    {
        "title": "'What will hold back the Russians?' Zelenskyy responds to new US peace proposal for Ukraine",
        "description": "Volodymyr Zelenskyy says the US has offered to create a \"free economic zone\" in the contested Donbas region of eastern Ukraine in a bid to push a peace deal over the line.",
        "url": "https://news.sky.com/story/what-will-hold-back-the-russians-zelenskyy-responds-to-new-us-peace-proposal-for-ukraine-13482384",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-volodymyr-zelenskyy_7105520.jpg?20251209122818",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-11 21:57:00",
        "Headline": "Volodymyr Zelenskyy raised questions over the scheme, asking who will govern the zone and how the Russians could be prevented from seizing it.",
        "Content": " Volodymyr Zelenskyy says the US has offered to create a \"free economic zone\" in the contested Donbas region of eastern Ukraine in a bid to push a peace deal over the line. The Donbas - an industrial and coal-mining area primarily made up of the Donetsk and Luhansk regions - has become one of the key sticking points in the US-proposed peace plan. The first draft of the plan, widely leaked last month, stipulated that Ukraine must withdraw from areas of the Donbas it currently controls, thought to be a minority portion, as a condition for peace. Ukraine considered that point \"unacceptable\", and Mr Zelenskyy has spent the last few weeks drafting a response to the plan that removed \"obvious anti-Ukraine points\". After a series of meetings with Ukraine's European allies, including a trip to London to meet Sir Keir Starmer on Monday, Zelenskyy said on Thursday that he'd sent Washington a revised peace plan, whittled down to just 20 points. The new US proposal envisions Ukraine withdrawing from its territory in the Donbas without the Russians advancing, creating a neutral zone. But Zelenskyy poured cold water on the plans as he briefed journalists in Kyiv. \n                  'Israelis are returning to their land... that is the right thing to do' - the illegal settlement filling Palestinians with dread\n                 \n                  US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \"Who will govern this territory, which they are calling a 'free economic zone' or a 'demilitarised zone' - they don't know,\" he said. \"If one side's troops have to retreat and the other side stays where they are, then what will hold back these other troops, the Russians? Or what will stop them disguising themselves as civilians and taking over this free economic zone? This is all very serious. \"It's not a fact that Ukraine would agree to it, but if you are talking about a compromise then it has to be a fair compromise.\" Sky News military analyst Michael Clarke gave an ominous assessment of the proposal, saying it left \"no physical solution\" to resolve the problem of future attacks.  He said: \"If Ukraine gives up the fortress cities in the Donbas, the only security they can have is by being heavily armed and being backed by their allies in some way.\" \"The only thing that would stop Russia is deterrence: the knowledge that either the European forces were sitting in Ukraine ready to fight for them, which is hard to imagine at the moment, and even harder to imagine that they are backed up by American forces.\" Matthew Savill, director of military sciences at the Royal United Service Institute, was similarly sceptical. \"The general view is that the Russians will be too tempted to... try and come back for more,\" he told Sky News. He added that \"some kind of temporary ceasefire\" might work, but it would require \"the Europeans to demonstrate they can put their forces where their mouth is in terms of a reassurance force\". Amid this backdrop there was a meeting today of the coalition of the willing - the 34-strong bloc of nations pledged to support Ukraine against Russian aggression, of which Britain is a part. Read more:Analysis: Russia may exploit death of British soldier in UkraineRussia sending Ukrainian children to 'abusive' camp in North Korea There was agreement to continue to fund military support, \"progress on mobilising frozen Russian sovereign assets\", and an update from Zelenskyy on Russia's continued bombardment of his country, according to Downing Street. Afterwards, Zelenskyy said the bloc was working to ensure any peace deal contains \"serious components of European deterrence\". He added: \"It is important that the United States is with us and supports these efforts. No one is interested in a third Russian invasion.\" He also addressed growing pressure from the US for an election in Ukraine, saying \"there must be a ceasefire\" before the country can go to the polls. 👉 Tap to follow Trump100 wherever you get your podcasts👈 Zelenskyy's term expired last year, but wartime elections are forbidden by law in Ukraine. Meanwhile, the tone tonight from the White House was one of impatience, with Trump's team saying he wouldn't attend further meetings until there's a real chance of signing a peace deal. \"The president is extremely frustrated with both sides of this war, and he is sick of meetings just for the sake of meeting,\" said White House spokeswoman Karoline Leavitt."
    },
    {
        "title": "NHS facing 'worst case scenario' December amid 'super flu' surge",
        "description": "NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\".",
        "url": "https://news.sky.com/story/nhs-facing-worst-case-scenario-december-amid-super-flu-surge-13482068",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nhs-hospital-ward_7107556.jpg?20251211155252",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:40:00",
        "Headline": "The record-breaking demand on hospitals, A&Es and ambulance services coincides with a resident doctors' strike from 17 to 22 December – sparking fears of major disruption for patients in the run-up to Christmas.",
        "Content": " NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\". The warning comes as new figures revealed the number of people in hospital with flu have increased by more than half in just one week. Catch up as it happened: NHS warns of 'worst-case scenario' as 'super flu' surges Latest figures show: • An average of 2,660 patients were in hospital per day with flu last week • This is the highest ever for this time of year and up 55% on last week • At this point last year the number stood at 1,861 patients, while in 2023 it was just 402  Health service bosses are warning the number of flu patients in hospital has already increased sharply since the week covered by this data - with no peak in sight. Read more: Why is flu season worse this year?   Virus outbreaks coincide with doctors' strikes Weekly flu numbers in England peaked at 5,408 patients last winter and reached 5,441 over the winter of 2022/23, the highest level since the pandemic.  Alongside rocketing flu, the number of norovirus patients in hospital has also risen by 35%. The NHS is now warning winter viruses are starting to \"engulf hospitals\". Demand for A&Es and ambulance services is also soaring. New monthly figures show A&E attendances were a record for November at 2.35 million - more than 30,000 higher than November 2024. In addition, there were 48,814 more ambulance incidents (802,525) compared with last year (753,711). Some hospitals across the country have asked staff, patients and visitors to wear face masks to cut the spread of flu, while others have gone in and out of critical incident status due to the high number of people attending A&E. The record-breaking demand on the NHS coincides with a resident doctors' strike from 17 to 22 December over pay and jobs - sparking fears of major disruption for patients in the run up to Christmas. People are being advised to attend any planned appointments scheduled during the strikes unless they have been contacted to reschedule.  Flu vaccinations on the up... who can get one? The NHS is urging anyone eligible to get their flu vaccination to help prevent them getting seriously ill. Latest figures show more than 17.4 million people have been vaccinated so far this year, more than 381,000 higher than last year. You can get it if you: • Are 65 or over in England, Scotland, Wales and Northern Ireland • Are pregnant • Live in a care home • Are the main carer for an older or disabled person, or receive carer's allowance • Live with someone who has a weakened immune system • Are a frontline health and social care worker • Are of school age • Have certain medical conditions (the NHS has a full list) Wes Streeting, the health secretary, warned of a \"tidal wave of flu tearing through our hospitals\". \"We are working with the NHS to make sure it is able to cope with this as best as possible,\" he said.  Health correspondent NHSE press releases can be prone to hyperbole: a \"tsunami of infections, worst case scenarios\" and \"tidal wave of flu surging through hospitals\" are recent examples. But the health service's headline writers can be allowed this excess right now. The latest flu numbers are bad. Really bad and could get worse. One recent projection was 8,000 patients, before this wave subsides. But that's where the problem lies. There is no peak in sight. We know flu season has come early. It's going to last longer. But there's uncertainty over when we expect to see infections falling. Hospitals are at capacity. Most of those receiving care are elderly or have underlying health conditions. But younger, fitter people can't afford to be complacent. This is a particularly nasty strain that is highly infectious. Nobody is immune. Except those people who have protected themselves with a vaccine. Warning 'extremely challenging few weeks ahead' Professor Meghana Pandit, NHS national medical director, warned the health service faces \"an extremely challenging few weeks ahead\" with \"staff being pushed to the limit\". She said: \"With record demand for A&E and ambulances and an impending resident doctors' strike, this unprecedented wave of super flu is leaving the NHS facing a worst-case scenario for this time of year - with staff being pushed to the limit to keep providing the best possible care for patients. \"The numbers of patients in hospital with flu is extremely high for this time of year. Even worse, it continues to rise and the peak is not in sight yet, so the NHS faces an extremely challenging few weeks ahead.\" She added: \"We have prepared earlier for winter than ever before, and stress-tested services to ensure people have a range of ways to get the help they need and avoid needing to go to A&E. \"For non-life-threatening care, people should call NHS 111 or use 111 online, which can direct you to the most appropriate place, and use A&E and 999 for life threatening conditions and serious injuries.\"  Read more from Sky News:US accused of 'piracy'Flights diverted in Moscow Mr Streeting has offered the British Medical Association (BMA) a last-minute deal in the hope doctors will call off the walkout, which starts next Wednesday. The doctors' union has agreed to put the offer to members over the coming day, and is expected to announced a decision on Monday, just two days before the planned strike. The offer includes a fast expansion of specialist training posts as well as covering out-of-pocket expenses such as exam fees, but does not include extra pay.    "
    },
    {
        "title": "Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location",
        "description": "An oil tanker seized by the US off the Venezuelan coast on Wednesday spent years trying to sail the seas unnoticed.",
        "url": "https://news.sky.com/story/moving-in-the-shadows-why-tanker-seized-by-us-off-venezuela-was-spoofing-its-location-13482140",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-osint-teaser_7107538.png?20251211153339",
        "type": "Home",
        "Author": "Adam Parker, OSINT editor, and Sophia Massam, junior digital investigations journalist",
        "Date Published": "2025-12-11 12:36:00",
        "Headline": "Here's what we know about how and why the oil tanker Skipper 'spoofed' its location, and what eventually led to it being seized by the US.",
        "Content": "By Adam Parker, OSINT editor, and Sophia Massam, junior digital investigations journalist   An oil tanker seized by the US off the Venezuelan coast on Wednesday spent years trying to sail the seas unnoticed. Changing names, switching flags, and vanishing from tracking systems. That all came to an end this week, when American coast guard teams descending from helicopters with guns drawn stormed the ship, named Skipper. A US official said the helicopters that took the teams to the tanker came from the aircraft carrier USS Gerald R Ford. The sanctioned tanker Over the past two years, Skipper has been tracked to countries under US sanctions including Iran. TankerTrackers.com, which monitors crude oil shipments, estimates Skipper has transported nearly 13 million barrels of Iranian and Venezuelan oil since 2021. \n                  'Venezuela has already been invaded' says Nobel Peace Prize winner Machado when asked about Trump intervention\n                 \n                  Venezuelan opposition leader misses Nobel Peace Prize ceremony as 'lives risked' to get her to Oslo\n                 \n                  Is this what the beginning of a war looks like? How the US threat around Venezuela is shaping up\n                 And in 2022, the US Treasury Office of Foreign Assets Control (OFAC) placed Skipper, then known as Adisa, on its sanctions list. But that did not stop the ship's activities. In mid-November 2025, it was pictured at the Jose Oil Export Terminal in Venezuela, where it was loaded with more than one million barrels of crude oil. It left Jose Oil Export Terminal between 4 and 5 December, according to TankerTrackers.com. And on 6 or 7 December, Skipper did a ship-to-ship transfer with another tanker in the Caribbean, the Neptune 6. Ship-to-ship transfers allow sanctioned vessels to obscure where oil shipments have come from. The transfer with Neptune 6 took place while Skipper's tracking system, known as AIS, was turned off. Read more:Everything we know about dramatic ship seizureIs this what the beginning of a war looks like? Dimitris Ampatzidis, senior risk and compliance manager at Kpler, told Sky News: \"Vessels, when they are trying to hide the origin of the cargo or a port call or any operation that they are taking, they can just switch off the AIS.\" Matt Smith, head analyst US at Kpler, said they believe the ship's destination was Cuba. Around five days after leaving the Venezuelan port, it was seized around 70 miles off the coast. Moving in the shadows  Skipper has tried to go unnoticed by using a method called 'spoofing'. This is where a ship transmits a false location to hide its real movements. \"When we're talking about spoofing, we're talking about when the vessel manipulates the AIS data in order to present that she's in a specific region,\" Mr Ampatzidis explained. \"So you declare false AIS data and everyone else in the region, they are not aware about your real location, they are only aware of the false location that you are transmitted.\" When it was intercepted by the US, it was sharing a different location more than 400 miles away from its actual position. Skipper was manipulating its tracking signals to falsely place itself in Guyanese waters and fraudulently flying the flag of Guyana. \"We have really real concerns about the spoofing events,\" Mr Ampatzidis told Sky News. \"It's about the safety on the seas. As a shipping industry, we have inserted the AIS data, the AIS technology, this GPS tracking technology, more than a decade back, in order to ensure that vessels and crew on board on these vessels are safe when they're travelling.\" Dozens of sanctioned tankers 'operating off Venezuela' Skipper is not the only sanctioned ship off the coast of Venezuela. According to analysis by Windward, 30 sanctioned tankers were operating in Venezuelan ports and waters as of 11 December. The tanker seizure is a highly unusual move from the US government and is part of the Trump administration's increasing pressure on Venezuelan President Nicolas Maduro. In recent months, the largest US military presence in the region in decades has built up, and a series of deadly strikes has been launched on alleged drug-smuggling boats in the Caribbean Sea and eastern Pacific Ocean. In the past, Mr Ampatzidis explained, actions like sanctions have had a limited effect on illegally operating tankers. But the seizure of Skipper will send a signal to other dark fleet ships. \"From today, they will know that if they are doing spoofing, if they are doing dark activities in closer regions of the US, they will be in the spotlight and they will be the key targets from the US Navy.\" The Data X Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Ex-commander of unit tasked with trialling Ajax armoured vehicle lost 20% of hearing",
        "description": "The former commander of a unit tasked with trialling the British Army's new Ajax armoured fighting vehicle has lost about 20% of his hearing and suspects his time on the &#163;10m platform could be to blame.",
        "url": "https://news.sky.com/story/ex-commander-of-unit-tasked-with-trialling-ajax-armoured-vehicle-lost-20-of-hearing-13482221",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-army-ajax_7107554.jpg?20251211174053",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-11 14:58:00",
        "Headline": "Rob Page is speaking publicly for the first time about his two years spent putting the vehicle through its paces from 2019 to 2021.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The former commander of a unit tasked with trialling the British Army's new Ajax armoured fighting vehicle has lost about 20% of his hearing and suspects his time on the £10m platform could be to blame. Rob Page, a former lieutenant colonel who has since left the military, is speaking publicly for the first time about his two years spent putting the vehicle through its paces from 2019 to 2021. In that time, he said he witnessed soldiers on the Armoured Trials and Delivery Unit suffer harm to their hearing because of excessive noise as they operated the platform and harm to their bodies because it vibrated so much when moving. He flagged his concerns up the chain of command and ultimately recommended that trials be halted in late 2020 and again in 2021 until the noise and vibration problems could be resolved. Yet, more than five years later, dozens more troops were hurt last month while using the 40-tonne, tracked vehicles - barely a fortnight after Luke Pollard, a defence minister, declared Ajax to be safe and finally ready for operations. As a result, usage has again been paused as an investigation is carried out. \"It feels a bit like a repetition,\" Mr Page told Sky News in an interview. \"But… soldier safety has to come first, and foremost.\" \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 \n                  British soldier who died in Ukraine named\n                 \n                  UK special forces unit had 'deliberate policy' to 'kill fighting-aged males' in Afghanistan, inquiry told \n                 That had been at the forefront of his mind back in 2019 when his troops started to suffer the impact of their bodies being shaken around after the very first trials of the Ajax. \"Essentially, you know, hands, wrists, knees, feet, that type of pain,\" he said. \"It was concerning, and so we immediately started to raise the fact that this was occurring… We wanted to understand the risk a bit more so that we could make it as safe as possible for them [the troops] to operate the vehicle.\"  At the time, there had been a lot of pressure on the army and Defence Equipment and Support - the branch of the Ministry of Defence tasked with procuring kit - to bring a fleet of almost 600 Ajax vehicles of different variations into service. The delivery of the platform - manufactured by the American defence company General Dynamics under a £6.3bn contract - was already running late and costs had grown. It meant raising the alarm about the safety of the machine was a particularly daunting move, especially as the army is in desperate need of new armoured fighting vehicles after previous attempts to procure such equipment over decades had failed. Yet over the course of 2020, Mr Page was becoming more worried as soldiers began experiencing ringing in their ears as well as what is known as \"whole body vibration\". His team put in place a health check to document how personnel felt before using an Ajax vehicle and then afterwards. \"That gave increasingly more evidence that like, hey, there's a problem here,\" Mr Page said. Read more from Sky News:Birth stories: Women felt ignored, neglected and dismissedHow to see the Geminid meteor shower in the next few days  He also discovered that a separate team of soldiers based at a large factory in Merthyr Tydfil, South Wales, where the six variants of the Ajax are being assembled, was also becoming sick. \"We started to put this picture together and escalate it up the chain of command quite forthrightly.\" A particular concern the former officer raised was about a \"noise and vibration calculator\" provided by General Dynamics that had been used to set what was meant to be safe speeds to operate the vehicle and a safe length of time to be in it. He said he requested to see the data on which the calculator had been configured because his soldiers were operating Ajax within the correct limitations but still experiencing noise and vibration symptoms. 'Chernobyl email' Mr Page said he decided to write what he called a \"Chernobyl email\" - a reference to the worst nuclear accident in history, when a reactor at a nuclear power plant in the Ukrainian city of Chernobyl exploded in the 1980s. \"I said, look, we've got a known hazard that we're exposing soldiers to with a set of controls, but I'm not confident the controls are correct,\" he recalled. \"When the Chernobyl reactor exploded, the decision was taken to put soldiers on the roof to sweep debris back into the reactor. \"And they did that on a three-minute rotation. And so I felt at the time what we were doing was we've got a vibration hazard, we've got a noise hazard. \"We can't quite quantify both, but we know they're there. \"And our solution is to mitigate that with time in the vehicle exposure and speed to hopefully bring the vibration down. \"And for me this felt like it wasn't yet a precise science.\" He continued: \"That was what I was flagging constantly to my superiors.\" The former army officer said he had wanted the noise and vibrations to be properly understood and an \"engineering fix\" found. He shared his views with the authors of two major reviews that were conducted into the programme after it was halted. Mr Page's words are included in two official reports that were subsequently published, but all contributions were made anonymously so he was not publicly identified back then. The former officer, who spent more than 20 years in the army, said he agreed with the conclusion of the larger of the two reviews that the problems with Ajax were part of a \"systemic challenge\" within defence procurement rather than the fault of any particular individual. \"Going after this blame game is really not constructive,\" he said. \"What was important was actually getting hold of the risk and understanding it and making sure that we weren't causing harm and we were putting in the correct controls that meant that we were not capable of causing harm and that's what the focus needed to be.\" This included - most crucially - finding and fixing the cause of the noise and vibration, instead of relying on work-arounds such as more cushioning on seats, better ear protection and limiting the time spent on the vehicles. Dozens of soldiers had hearing examined Once the trials were stopped in 2021, Mr Page and his team of 30 to 40 soldiers were invited to have their hearing examined by specialists at Queen Elizabeth Hospital in Birmingham. He said he had suffered pain to his knees and back because of exposure to vibrations while inside Ajax but he had not initially realised that his hearing may also have been affected. But a specialist talked him through the results of his hearing test. \"She was like: 'Can you track conversations in a loud room?' And I was like 'Well, no, absolutely not'. She was like: 'Do you get tinnitus?' And I was like: 'Yes, definitely'.\" He was in his early 40s at the time of the test and now faces the prospect of his hearing rapidly declining. \"I've lost about 20% of my hearing but it's really the tinnitus that's more frustrating… Hearing is a sense. It's one of our core senses and losing it is a permanent disability. And that for me is really the sort of tragedy that's come out of some of this.\" What has been the manufacturer's response? General Dynamics UK said a huge amount of work has done into ensuring the safety of Ajax, calling it \"one of the most tested combat vehicles ever produced\". The company said in a statement: \"Soldier safety is our highest priority at GDUK. Since 2019, we have worked with the British Army and the Ministry of Defence to conduct extensive testing and trials. We continue, without any hesitation or limitation, to support them. \"Vehicle enhancements and headset changes have been implemented since issues were first identified more than five years ago. Since February 2023, independent assessments confirm noise and vibration levels are within approved legislative limits.\" It continued: \"The initial reports of noise and vibration concerns from soldiers made over five years ago led to a structured detailed technical investigation conducted jointly by GDUK, DE&S and Army involving noise and vibration experts from, HSE (the Health and Safety Executive), industry, recognised test Establishments and academia… Ajax now holds the most comprehensive safety case of any armoured platform worldwide, covering vibration, acoustics, ergonomics, and crew health. This is the one of the most tested combat vehicles ever produced.\" GD concluded: \"We have full confidence in the performance and the protection it provides our soldiers. It is the world's most advanced, fully digitised, armoured fighting vehicle.\" A Ministry of Defence spokesperson said: \"We will always put the safety of our personnel first and the current pause shows that we will investigate any issues when they arise…We take any allegations very seriously and will look closely at any evidence provided.\""
    },
    {
        "title": "Nigel Farage's former school responds to claims he made racist comments as a student",
        "description": "Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\".",
        "url": "https://news.sky.com/story/nigel-farages-former-school-responds-to-claims-he-made-racist-comments-as-student-13482312",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform-uk_7107685.jpg?20251211182414",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-12-11 17:40:00",
        "Headline": "Dulwich College says the alleged behaviour attributed to Nigel Farage is \"wholly incompatible with the values the College holds\". Reform UK says this is a \"witch hunt\".",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\". In the first reported statement from the school about the accusations - which date from 1970s - current master Robert Milne wrote \"such behaviour is wholly incompatible with the values the College holds\". \"What we can unequivocally state is that the behaviours described are entirely at odds with the Dulwich College of today,\" he continued The comments come in a letter to former Dulwich pupil Jean-Pierre Lihou. Mr Lihou, 61, has alleged the current Reform UK leader sang antisemitic songs to Jewish schoolmates and \"had a big issue with anyone called Patel\".  Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". \n                  Reform UK denies Nigel Farage broke electoral law\n                 \n                  Millionaire former Tory donor defects to Reform\n                 \n                  Nigel Farage racism allegations are deeply shocking - but will they deter voters?\n                 Nigel Farage said: \"I have not met or spoken to this master. So I am surprised by his uninformed comments in response to claims from nearly 50 years ago from politically motivated actors. \"If he is interested, I can show him the many messages that I have received from fellow pupils, including Jewish ones, that entirely contradict these allegations.\" A spokesperson for Reform UK said: \"This witch hunt is merely an attempt to discredit Reform and Nigel Farage. \"Instead of debating Reform on the substance of our ideas and policies, the left-wing media and deeply unpopular Labour Party are now using 50-year-old smears in a last act of desperation. \"The British public see right through it.\" The letter also says the college has avoided making any public statements \"to protect the college's reputation in the long term\". \"This should not be interpreted as indifference: safeguarding the college's good name and upholding its values are of paramount importance to us,\" it continues. Mr Lihou told Sky News he cautiously welcomed the letter written to him from the master and said he understands why the college wasn't willing to unequivocally condemn the allegations against the Reform leader directly. \"Dulwich College has been clear that such accusations are very much at odds with the values of the school,\" he said. He added: \"Why can Mr Farage not accept that approaching 30 people [who] have lasting memories from him as a 13-year-old to an adult that he should unreservedly apologise for?\" Sky News has contacted Dulwich College for a comment."
    },
    {
        "title": "Charlie Kirk shooting suspect makes first in-person court appearance",
        "description": "The man accused of killing right-wing influencer Charlie Kirk has appeared in person at court for the first time.",
        "url": "https://news.sky.com/story/charlie-kirk-shooting-suspect-makes-first-in-person-court-appearance-13482340",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tyler-robinson-charlie-kirk_7107753.jpg?20251211194929",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-11 19:21:00",
        "Headline": "Making his first in-person appearance at a Utah court, Tyler Robinson arrived with restraints on his wrists and ankles and wearing a dress shirt, tie and slacks.",
        "Content": "The man accused of killing right-wing influencer Charlie Kirk has appeared in person at court for the first time. Tyler Robinson, 22, from Utah, is charged with aggravated murder in relation to the shooting of Kirk on the Utah Valley University campus in Orem. Video of the incident showed Kirk, 31, and a staunch ally of Donald Trump, reaching up with his right hand after a gunshot was heard as blood came out from the left side of his neck. He died shortly after. Prosecutors plan to seek the death penalty.  On Wednesday's appearance at Fourth District Court in Provo, Utah, Robinson arrived in court with restraints on his wrists and ankles and wearing a dress shirt, tie and slacks. Read more: What we can learn about suspect from charging document According to the Associated Press, he smiled at family members sitting in the front row of the courtroom, where his mother teared up and wiped her eyes with a tissue. \n                  Incoming Oxford Union president George Abaraonye loses confidence vote sparked by Charlie Kirk comments - but disputes result\n                 \n                  Voting ends over future of Oxford Union president-elect after Charlie Kirk comment\n                 \n                  Obama and Schwarzenegger face off in major political row\n                 He made previous court appearances via video or audio feed from jail. The shooting happened during Kirk's \"prove me wrong\" series, which saw the father of two visit campuses and debate contentious subjects; in this case, he was discussing mass shootings. Prosecutors say the bullet which struck Kirk's neck \"passed closely to several other individuals\", including the person questioning him as part of the event. A charging document about Robinson from September includes incriminating texts sent between the alleged shooter and his roommate after Kirk's death. Read more from Sky News:Analysis: The real reason for Trump's Venezuela exploitsFBI release Luigi Mangione 'to-do list' before alleged assassination Judge Tony Graf also heard arguments on Wednesday about whether cameras and media should be allowed in the courtroom, with Robinson's lawyers and the Utah County Sheriff's Office asking for them to be banned. Mr Kirk's widow, Erika Kirk, has called for full transparency and said \"we deserve to have cameras in there\". The judge has already made allowances to protect Robinson's presumption of innocence before a trial, agreeing that the case has drawn \"extraordinary\" public attention."
    },
    {
        "title": "Hundreds of artefacts stolen from museum in Bristol in 'high-value' raid",
        "description": "More than 600 artefacts have been stolen from a building housing items belonging to a museum in Bristol.",
        "url": "https://news.sky.com/story/hundreds-of-high-value-artefacts-stolen-from-museum-in-bristol-as-police-issue-appeal-13482110",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-museum-bristol-artefacts_7107323.jpg?20251211114734",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-11 11:38:00",
        "Headline": "The items were taken from Bristol Museum's British Empire and Commonwealth collection on 25 September, say police, who now want the public's help.  ",
        "Content": "More than 600 artefacts have been stolen from a building housing items belonging to a museum in Bristol. The items were taken from Bristol Museum's British Empire and Commonwealth collection on 25 September, Avon and Somerset Police said. The force described the burglary as involving \"high-value\" artefacts, as they appealed for the public's help in identifying people caught on CCTV. It is not clear why the appeal is being issued more than two months after the burglary occurred. The break-in took place between 1am and 2am on Thursday 25 September when a group of four unknown males gained entry to a building in the Cumberland Road area of the city. Read more from Sky News:Rare chance to see Mary Queen of Scots' last letterPlan to tackle rough sleeping unveiled Items stolen in the raid include a ship lantern, an ivory Buddha and a waist belt plate mount.Detectives say they hope the four people on CCTV will be able to help them with their enquiries. They are described as: • Male one: white, of medium to stocky build, wearing a white cap, black jacket, light-coloured trousers, and black trainers• Male two: white, of slim build, wearing a grey-hooded jacket, black trousers, and black trainers• Male three: white, wearing a green cap, black jacket, light-coloured shorts, and white trainers, and appears to walk with a slight limp in his right leg• Male four: white, of large build, wearing a two-toned orange and navy/black puffed jacket, black trousers, and black and white trainers The officer leading the investigation, Detective Constable Dan Burgan, said: \"The theft of many items which carry a significant cultural value is a significant loss for the city. \"These items, many of which were donations, form part of a collection that provides insight into a multi-layered part of British history, and we are hoping that members of the public can help us to bring those responsible to justice. \"So far, our enquiries have included significant CCTV enquiries as well as forensic investigations and speaking liaising with the victims. \"If you recognise the men pictured or have seen any of the possible items being sold online, please call us.\" The British Empire and Commonwealth Collection at Bristol Archives documents the links between Britain and nations in the British Empire from the late 19th century to recent times. It includes household belongings, souvenirs, photographs and papers."
    },
    {
        "title": "Nurse Sandy Peggie to appeal trans doctor row judgment following 'completely made up' quote claim",
        "description": "A nurse is to appeal the employment tribunal judgment she received after a row with a transgender doctor about the shared use of a hospital female changing room, her lawyer has announced.",
        "url": "https://news.sky.com/story/sandie-peggie-tribunal-judgment-amended-amid-completely-made-up-quote-row-13482047",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sandie-peggie-dundee_7107562.jpg?20251211160304",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-12-11 08:47:00",
        "Headline": "The decision comes after supporters of the nurse highlighted alleged inaccuracies in a tribunal ruling. The case centres on a dispute with a transgender medic about a female changing room.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A nurse is to appeal the employment tribunal judgment she received after a row with a transgender doctor about the shared use of a hospital female changing room, her lawyer has announced. Nurse Sandie Peggie's decision follows a claim that a quote used in the original judgment this week was \"completely made up\". Solicitor Margaret Gribbon confirmed the move during a press conference on Thursday, shortly after a certificate of correction was issued amid complaints about the quote used in Monday's ruling. Ms Peggie said: \"Whilst I am delighted that the tribunal was critical of Fife health board and found they had harassed me, their judgment, I believe, falls short in many respects and that is why I certainly won't be giving up this legal fight any time soon.\" Ms Gribbon claimed some of the findings in the ruling were \"hugely problematic\" as she accused NHS Fife of going on an \"archaeological dig to find material to discredit\" Ms Peggie. She added: \"It was even suggested to Sandie, by Fife health board's KC during her cross-examination, that she'd lied about having experienced a menstrual flood on Christmas Eve 2023. \"So, against that background, it is difficult to envisage what woman would contemplate raising a complaint of this nature.\" \n                  Super flu strikes during perfect storm for NHS\n                 \n                  Birth stories: Women felt ignored, neglected and dismissed\n                 \n                  NHS facing 'worst case scenario' December amid 'super flu' surge\n                 Ms Gribbon said work on the appeal was already under way and will be submitted next month. Maya Forstater, chief executive of sex-based rights charity Sex Matters, had earlier claimed the employment judge's reference to a previous case involving herself had included a quote which was incorrect. She posted on X: \"This 'quote' from my judgment doesn't come from my judgment. It is completely made up.\" The certificate of correction, issued on Thursday by the Judicial Office, has not changed the verdict itself. In a statement, Ms Forstater said: \"I knew this was wrong, and it's good it's being amended, but I am astonished that it happened and I would like an explanation of how it happened. \"Claimants and witnesses going to court swear to tell the truth, the whole truth and nothing but the truth, and we expect nothing less from the judges.\" She added: \"This judgment was already being questioned because it seems to fly in the face of the Supreme Court's clear statement that single-sex facilities can only be on the basis of sex, not claimed identity. \"Errors like this just add to the growing feeling that this is not a sound judgment.\" Ms Peggie took action following a row with transgender medic Dr Beth Upton - who was born male and now identifies as a female - at Victoria Hospital in Kirkcaldy on Christmas Eve 2023. The nurse, who had complained about sharing a female changing room with Dr Upton, was placed on special leave after her colleague made an allegation of bullying and harassment, and cited concerns about patient care. Ms Peggie lodged a claim against NHS Fife and Dr Upton in response, with the nurse going on to win a claim for harassment against the health board. All other allegations of discrimination and victimisation were dismissed, with the employment tribunal additionally rejecting all claims against Dr Upton. In the 312-page judgment, the tribunal said NHS Fife should have taken action to reflect Ms Peggie's concerns over Dr Upton's use of the female changing room. The health board was found to have harassed the nurse by failing to revoke the doctor's permission on an interim basis until different work rotas took effect, and as a result, Dr Upton and Ms Peggie were both present in the changing facilities on two occasions. It was also found to have harassed Ms Peggie by taking an unreasonable length of time to investigate the allegations against her, and by making reference to patient care allegations against her on 28 March 2024. The health board was additionally found to have harassed Ms Peggie by giving an instruction to her not to discuss the case, until a further message a little over two weeks later which confirmed that applied only to the investigation. Read more:NHS Fife chief announces early retirement ahead of ruling Ms Peggie paid tribute to Neale Hanvey, depute leader of the Alba Party, who signposted her to Sex Matters. The nurse additionally thanked Ms Forstater and a whole host of women's rights campaigners, including For Women Scotland, Murray Blackburn Mackenzie, Women Won't Weesht, Women's Rights Network Scotland and the LGB Alliance. She also praised her \"outstanding\" legal team, made up of lead counsel Naomi Cunningham, junior counsel Dr Charlotte Elves, and solicitor Ms Gribbon. After thanking her family and friends for being a \"tower of strength\", she added: \"Finally, I want to pay tribute to my late dad who we lost in January and who I know will be looking down on me feeling proud that he, with my mum, raised a daughter who did not and will not weesht.\" The tribunal's hearings took place earlier this year - before and after the landmark UK Supreme Court judgment in April, which ruled \"woman\" and \"sex\" in the Equality Act 2010 refers to \"a biological woman and biological sex\". NHS Fife previously described the tribunal as a \"complex and lengthy process\" as it vowed to work through the detail of the judgment to \"understand fully what it means for the organisation\". The health board said it was aware of the updated judgment. A spokesperson added: \"We acknowledge the claimant's right to appeal in line with the employment tribunal process.\""
    },
    {
        "title": "Three men jailed for life after man, 60, shot dead through living room window in County Durham",
        "description": "Three men have been jailed for life for the murder of a man in his own home.",
        "url": "https://news.sky.com/story/three-men-jailed-for-life-after-man-60-shot-dead-through-window-in-county-durham-13482063",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sean-ray-thomas-sterling_7106662.jpg?20251210152147",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:36:00",
        "Headline": "Barry Dawson was shot through the front window of his terraced house in Stanley in April.",
        "Content": " Three men have been jailed for life for the murder of a man in his own home. Barry Dawson, who was a grandfather, was shot through the living room window of his terraced house in Stanley, County Durham, on 5 April. Following a trial at Teesside Crown Court which concluded in October, Sean Reay, 30, of Sabin Terrace, Stanley, who shot the 60-year-old, was found guilty of his murder along with Kelvin Lawson, 38, and 22-year-old Thomas Sterling. Reay was given a minimum term of 32 years. Lawson, of Frosterley Gardens, Stanley, who smashed the downstairs window to allow his co-accused to get a clearer shot, got a minimum term of 28 years. Sterling, of The Avenue, Stanley, received a minimum term of 26 years. The judge said he was part of a \"show of strength\" in the street that day. A Crown Prosecution Service spokesman said at the time of their conviction: \"The shot struck Barry in the chest, puncturing his heart, lung and liver, and he was tragically pronounced dead at the scene a short time later. \"Following the shooting, Sean Reay fled the Durham area and was later arrested in Northern Ireland.\" Mr Dawson had lived in the street for more than two decades and was a well-liked member of his community. The shocking doorbell footage caught the shooting and then Mr Dawson's son, Shane, shouting: \"They shot my dad.\" Mr Justice Cotter said: \"This was an extraordinary crime in an ordinary residential street. \"It was the sort of thing most people only see in television or films, and then not in this country.\" In a victim impact statement, Mr Dawson's partner, Sarah Hopwood, said the man people knew as Buck was an \"adored father and grandfather\". She said: \"This horrendous crime has broken our hearts and it is something we will never recover from.\" Sean Reay 'out for revenge' The court heard Reay was out for revenge following an altercation outside his property earlier that day, which was suspected to be drug-related, and in which he claimed a man threatened to burn his house down. Reay's gang believed the person responsible was in Mr Dawson's home and they hoped to lure him out by breaking windows. Mr Dawson, who had been resting upstairs, and who had nothing to do with the earlier trouble outside the home, came downstairs to see what was going on. Mr Justice Cotter said Reay was in charge, while Lawson and Sterling were \"key lieutenants\". Trio 'lived by a code' The judge said the three men lived by a code that saw the police as the enemy. \"You can reflect on where your code has got you during your decades in prison,\" he said. \"Until you reject the code, you will not be safe to rejoin society.\" Reay recruited Kevin Dorward, 38, to drive them to the shooting and his cousin Keith Dorward, 48, also came along. They were cleared of murder, but admitted perverting the course of justice by trying to burn out the getaway car. Kevin Dorward's partner, Michaela Hetherington, also admitted perverting the course of justice by falsely claiming to police that the car had been stolen. The judge jailed Kevin Dorward for 20 months, Keith Dorward for 16 months, both of whom were living in Annfield Plain at the time, and Hetherington for 15 months, meaning she will be released immediately, having served 246 days on remand. Detective Chief Inspector Neil Fuller, Senior Investigating Officer for Operation Hamnett at Durham Constabulary, said: \"I hope this investigation sends out a clear message to criminals that we will not allow such extreme violence on our streets. \"There is no place for guns on our streets, and we take a zero-tolerance approach in tackling and bringing to justice those who choose to carry such weapons. \"Barry Dawson needlessly lost his life that afternoon because of the despicable actions of these three men. My thoughts remain with those who loved him.\""
    },
    {
        "title": "NHS facing 'worst case scenario' December amid 'super flu' surge",
        "description": "NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\".",
        "url": "https://news.sky.com/story/nhs-facing-worst-case-scenario-december-amid-super-flu-surge-13482068",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nhs-hospital-ward_7107556.jpg?20251211155252",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:40:00",
        "Headline": "The record-breaking demand on hospitals, A&Es and ambulance services coincides with a resident doctors' strike from 17 to 22 December – sparking fears of major disruption for patients in the run-up to Christmas.",
        "Content": " NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\". The warning comes as new figures revealed the number of people in hospital with flu have increased by more than half in just one week. Catch up as it happened: NHS warns of 'worst-case scenario' as 'super flu' surges Latest figures show: • An average of 2,660 patients were in hospital per day with flu last week • This is the highest ever for this time of year and up 55% on last week • At this point last year the number stood at 1,861 patients, while in 2023 it was just 402  Health service bosses are warning the number of flu patients in hospital has already increased sharply since the week covered by this data - with no peak in sight. Read more: Why is flu season worse this year?   Virus outbreaks coincide with doctors' strikes Weekly flu numbers in England peaked at 5,408 patients last winter and reached 5,441 over the winter of 2022/23, the highest level since the pandemic.  Alongside rocketing flu, the number of norovirus patients in hospital has also risen by 35%. The NHS is now warning winter viruses are starting to \"engulf hospitals\". Demand for A&Es and ambulance services is also soaring. New monthly figures show A&E attendances were a record for November at 2.35 million - more than 30,000 higher than November 2024. In addition, there were 48,814 more ambulance incidents (802,525) compared with last year (753,711). Some hospitals across the country have asked staff, patients and visitors to wear face masks to cut the spread of flu, while others have gone in and out of critical incident status due to the high number of people attending A&E. The record-breaking demand on the NHS coincides with a resident doctors' strike from 17 to 22 December over pay and jobs - sparking fears of major disruption for patients in the run up to Christmas. People are being advised to attend any planned appointments scheduled during the strikes unless they have been contacted to reschedule.  Flu vaccinations on the up... who can get one? The NHS is urging anyone eligible to get their flu vaccination to help prevent them getting seriously ill. Latest figures show more than 17.4 million people have been vaccinated so far this year, more than 381,000 higher than last year. You can get it if you: • Are 65 or over in England, Scotland, Wales and Northern Ireland • Are pregnant • Live in a care home • Are the main carer for an older or disabled person, or receive carer's allowance • Live with someone who has a weakened immune system • Are a frontline health and social care worker • Are of school age • Have certain medical conditions (the NHS has a full list) Wes Streeting, the health secretary, warned of a \"tidal wave of flu tearing through our hospitals\". \"We are working with the NHS to make sure it is able to cope with this as best as possible,\" he said.  Health correspondent NHSE press releases can be prone to hyperbole: a \"tsunami of infections, worst case scenarios\" and \"tidal wave of flu surging through hospitals\" are recent examples. But the health service's headline writers can be allowed this excess right now. The latest flu numbers are bad. Really bad and could get worse. One recent projection was 8,000 patients, before this wave subsides. But that's where the problem lies. There is no peak in sight. We know flu season has come early. It's going to last longer. But there's uncertainty over when we expect to see infections falling. Hospitals are at capacity. Most of those receiving care are elderly or have underlying health conditions. But younger, fitter people can't afford to be complacent. This is a particularly nasty strain that is highly infectious. Nobody is immune. Except those people who have protected themselves with a vaccine. Warning 'extremely challenging few weeks ahead' Professor Meghana Pandit, NHS national medical director, warned the health service faces \"an extremely challenging few weeks ahead\" with \"staff being pushed to the limit\". She said: \"With record demand for A&E and ambulances and an impending resident doctors' strike, this unprecedented wave of super flu is leaving the NHS facing a worst-case scenario for this time of year - with staff being pushed to the limit to keep providing the best possible care for patients. \"The numbers of patients in hospital with flu is extremely high for this time of year. Even worse, it continues to rise and the peak is not in sight yet, so the NHS faces an extremely challenging few weeks ahead.\" She added: \"We have prepared earlier for winter than ever before, and stress-tested services to ensure people have a range of ways to get the help they need and avoid needing to go to A&E. \"For non-life-threatening care, people should call NHS 111 or use 111 online, which can direct you to the most appropriate place, and use A&E and 999 for life threatening conditions and serious injuries.\"  Read more from Sky News:US accused of 'piracy'Flights diverted in Moscow Mr Streeting has offered the British Medical Association (BMA) a last-minute deal in the hope doctors will call off the walkout, which starts next Wednesday. The doctors' union has agreed to put the offer to members over the coming day, and is expected to announced a decision on Monday, just two days before the planned strike. The offer includes a fast expansion of specialist training posts as well as covering out-of-pocket expenses such as exam fees, but does not include extra pay.    "
    },
    {
        "title": "Super flu strikes during perfect storm for NHS",
        "description": "The spread of subclade K, the super flu, is picking up - and it's not looking good for the NHS.",
        "url": "https://news.sky.com/story/super-flu-strikes-during-perfect-storm-for-nhs-13482250",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nhs-maternity_7107246.jpg?20251211101131",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-11 15:42:00",
        "Headline": "No subtitle found",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The spread of subclade K, the super flu, is picking up - and it's not looking good for the NHS. An average of just under 2,700 hospital beds a day in England were occupied by patients with flu last week. There are fears that could jump to somewhere between 5,000 and 8,000 by the end of this week. That's on top of COVID and RSV. And with the possibility of a five-day strike by resident (junior) doctors next week, it's a perfect storm for hospitals. Christmas flu Children are the super-spreaders of flu. It races around classrooms and some schools have temporarily shut because of the impact. \n                  Parents warned about danger of 'baby sleep pillows' after infant deaths\n                 \n                  NHS warns of 'worst-case scenario' as 'super flu' surges\n                 \n                  UK Apollo leaf lettuce in pre-packed sandwiches was likely cause of fatal E.coli outbreak\n                 The Christmas holidays aren't far off. They are likely to put the brakes on children passing around the virus. But it's also a time of year when families mix with elderly relatives, who are more likely to be hit hard by the infection - perhaps even needing hospital care. So while the holidays may temporarily slow the overall rise in infections, the impact on hospitals could get much worse. Subclade K Flu is spreading so rapidly at the moment because immunity to subclade K from previous infections and vaccinations is low. The virus - a variant of the H3N2 flu strain - suddenly acquired seven new mutations in late summer. Every 100 people infected with seasonal flu would typically pass the virus on to 120 others. With subclade K, it's 140. And that's why cases are rising so quickly on the charts. At the moment, 18 in every 100,000 patients in England are consulting their GP with flu-like symptoms. That's still well short of the peak of around 50 in every 100,000 in 2017/18, the worst flu outbreak in recent years. The grim reality of flu Flu is a really unpleasant disease, nothing like a cold. I've had it twice in my life and it physically hurt to get out of bed. It's grim. Most people get over it with a few days' rest and paracetamol to take the edge off the fever. But vulnerable people can become seriously ill. In the outbreak of 2017/18, around 22,000 died. Read more:Nurses 'deeply concerned about what lies ahead'NHS braced for 'toughest winter' after record-breaking month That's why the NHS is urging people in certain groups - the over 65s, those with underlying health conditions, pregnant women, carers and children - to get the jab. The vaccine isn't a great match for subclade K, but still reduces the chance of hospital admission by 30-40% in adults. It's impossible to say when the spread will peak, but the latest figures suggest the outbreak is far from over."
    },
    {
        "title": "Ex-commander of unit tasked with trialling Ajax armoured vehicle lost 20% of hearing",
        "description": "The former commander of a unit tasked with trialling the British Army's new Ajax armoured fighting vehicle has lost about 20% of his hearing and suspects his time on the &#163;10m platform could be to blame.",
        "url": "https://news.sky.com/story/ex-commander-of-unit-tasked-with-trialling-ajax-armoured-vehicle-lost-20-of-hearing-13482221",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-army-ajax_7107554.jpg?20251211174053",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-11 14:58:00",
        "Headline": "Rob Page is speaking publicly for the first time about his two years spent putting the vehicle through its paces from 2019 to 2021.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The former commander of a unit tasked with trialling the British Army's new Ajax armoured fighting vehicle has lost about 20% of his hearing and suspects his time on the £10m platform could be to blame. Rob Page, a former lieutenant colonel who has since left the military, is speaking publicly for the first time about his two years spent putting the vehicle through its paces from 2019 to 2021. In that time, he said he witnessed soldiers on the Armoured Trials and Delivery Unit suffer harm to their hearing because of excessive noise as they operated the platform and harm to their bodies because it vibrated so much when moving. He flagged his concerns up the chain of command and ultimately recommended that trials be halted in late 2020 and again in 2021 until the noise and vibration problems could be resolved. Yet, more than five years later, dozens more troops were hurt last month while using the 40-tonne, tracked vehicles - barely a fortnight after Luke Pollard, a defence minister, declared Ajax to be safe and finally ready for operations. As a result, usage has again been paused as an investigation is carried out. \"It feels a bit like a repetition,\" Mr Page told Sky News in an interview. \"But… soldier safety has to come first, and foremost.\" \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 \n                  British soldier who died in Ukraine named\n                 \n                  UK special forces unit had 'deliberate policy' to 'kill fighting-aged males' in Afghanistan, inquiry told \n                 That had been at the forefront of his mind back in 2019 when his troops started to suffer the impact of their bodies being shaken around after the very first trials of the Ajax. \"Essentially, you know, hands, wrists, knees, feet, that type of pain,\" he said. \"It was concerning, and so we immediately started to raise the fact that this was occurring… We wanted to understand the risk a bit more so that we could make it as safe as possible for them [the troops] to operate the vehicle.\"  At the time, there had been a lot of pressure on the army and Defence Equipment and Support - the branch of the Ministry of Defence tasked with procuring kit - to bring a fleet of almost 600 Ajax vehicles of different variations into service. The delivery of the platform - manufactured by the American defence company General Dynamics under a £6.3bn contract - was already running late and costs had grown. It meant raising the alarm about the safety of the machine was a particularly daunting move, especially as the army is in desperate need of new armoured fighting vehicles after previous attempts to procure such equipment over decades had failed. Yet over the course of 2020, Mr Page was becoming more worried as soldiers began experiencing ringing in their ears as well as what is known as \"whole body vibration\". His team put in place a health check to document how personnel felt before using an Ajax vehicle and then afterwards. \"That gave increasingly more evidence that like, hey, there's a problem here,\" Mr Page said. Read more from Sky News:Birth stories: Women felt ignored, neglected and dismissedHow to see the Geminid meteor shower in the next few days  He also discovered that a separate team of soldiers based at a large factory in Merthyr Tydfil, South Wales, where the six variants of the Ajax are being assembled, was also becoming sick. \"We started to put this picture together and escalate it up the chain of command quite forthrightly.\" A particular concern the former officer raised was about a \"noise and vibration calculator\" provided by General Dynamics that had been used to set what was meant to be safe speeds to operate the vehicle and a safe length of time to be in it. He said he requested to see the data on which the calculator had been configured because his soldiers were operating Ajax within the correct limitations but still experiencing noise and vibration symptoms. 'Chernobyl email' Mr Page said he decided to write what he called a \"Chernobyl email\" - a reference to the worst nuclear accident in history, when a reactor at a nuclear power plant in the Ukrainian city of Chernobyl exploded in the 1980s. \"I said, look, we've got a known hazard that we're exposing soldiers to with a set of controls, but I'm not confident the controls are correct,\" he recalled. \"When the Chernobyl reactor exploded, the decision was taken to put soldiers on the roof to sweep debris back into the reactor. \"And they did that on a three-minute rotation. And so I felt at the time what we were doing was we've got a vibration hazard, we've got a noise hazard. \"We can't quite quantify both, but we know they're there. \"And our solution is to mitigate that with time in the vehicle exposure and speed to hopefully bring the vibration down. \"And for me this felt like it wasn't yet a precise science.\" He continued: \"That was what I was flagging constantly to my superiors.\" The former army officer said he had wanted the noise and vibrations to be properly understood and an \"engineering fix\" found. He shared his views with the authors of two major reviews that were conducted into the programme after it was halted. Mr Page's words are included in two official reports that were subsequently published, but all contributions were made anonymously so he was not publicly identified back then. The former officer, who spent more than 20 years in the army, said he agreed with the conclusion of the larger of the two reviews that the problems with Ajax were part of a \"systemic challenge\" within defence procurement rather than the fault of any particular individual. \"Going after this blame game is really not constructive,\" he said. \"What was important was actually getting hold of the risk and understanding it and making sure that we weren't causing harm and we were putting in the correct controls that meant that we were not capable of causing harm and that's what the focus needed to be.\" This included - most crucially - finding and fixing the cause of the noise and vibration, instead of relying on work-arounds such as more cushioning on seats, better ear protection and limiting the time spent on the vehicles. Dozens of soldiers had hearing examined Once the trials were stopped in 2021, Mr Page and his team of 30 to 40 soldiers were invited to have their hearing examined by specialists at Queen Elizabeth Hospital in Birmingham. He said he had suffered pain to his knees and back because of exposure to vibrations while inside Ajax but he had not initially realised that his hearing may also have been affected. But a specialist talked him through the results of his hearing test. \"She was like: 'Can you track conversations in a loud room?' And I was like 'Well, no, absolutely not'. She was like: 'Do you get tinnitus?' And I was like: 'Yes, definitely'.\" He was in his early 40s at the time of the test and now faces the prospect of his hearing rapidly declining. \"I've lost about 20% of my hearing but it's really the tinnitus that's more frustrating… Hearing is a sense. It's one of our core senses and losing it is a permanent disability. And that for me is really the sort of tragedy that's come out of some of this.\" What has been the manufacturer's response? General Dynamics UK said a huge amount of work has done into ensuring the safety of Ajax, calling it \"one of the most tested combat vehicles ever produced\". The company said in a statement: \"Soldier safety is our highest priority at GDUK. Since 2019, we have worked with the British Army and the Ministry of Defence to conduct extensive testing and trials. We continue, without any hesitation or limitation, to support them. \"Vehicle enhancements and headset changes have been implemented since issues were first identified more than five years ago. Since February 2023, independent assessments confirm noise and vibration levels are within approved legislative limits.\" It continued: \"The initial reports of noise and vibration concerns from soldiers made over five years ago led to a structured detailed technical investigation conducted jointly by GDUK, DE&S and Army involving noise and vibration experts from, HSE (the Health and Safety Executive), industry, recognised test Establishments and academia… Ajax now holds the most comprehensive safety case of any armoured platform worldwide, covering vibration, acoustics, ergonomics, and crew health. This is the one of the most tested combat vehicles ever produced.\" GD concluded: \"We have full confidence in the performance and the protection it provides our soldiers. It is the world's most advanced, fully digitised, armoured fighting vehicle.\" A Ministry of Defence spokesperson said: \"We will always put the safety of our personnel first and the current pause shows that we will investigate any issues when they arise…We take any allegations very seriously and will look closely at any evidence provided.\""
    },
    {
        "title": "Hundreds of artefacts stolen from museum in Bristol in 'high-value' raid",
        "description": "More than 600 artefacts have been stolen from a building housing items belonging to a museum in Bristol.",
        "url": "https://news.sky.com/story/hundreds-of-high-value-artefacts-stolen-from-museum-in-bristol-as-police-issue-appeal-13482110",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-museum-bristol-artefacts_7107323.jpg?20251211114734",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-11 11:38:00",
        "Headline": "The items were taken from Bristol Museum's British Empire and Commonwealth collection on 25 September, say police, who now want the public's help.  ",
        "Content": "More than 600 artefacts have been stolen from a building housing items belonging to a museum in Bristol. The items were taken from Bristol Museum's British Empire and Commonwealth collection on 25 September, Avon and Somerset Police said. The force described the burglary as involving \"high-value\" artefacts, as they appealed for the public's help in identifying people caught on CCTV. It is not clear why the appeal is being issued more than two months after the burglary occurred. The break-in took place between 1am and 2am on Thursday 25 September when a group of four unknown males gained entry to a building in the Cumberland Road area of the city. Read more from Sky News:Rare chance to see Mary Queen of Scots' last letterPlan to tackle rough sleeping unveiled Items stolen in the raid include a ship lantern, an ivory Buddha and a waist belt plate mount.Detectives say they hope the four people on CCTV will be able to help them with their enquiries. They are described as: • Male one: white, of medium to stocky build, wearing a white cap, black jacket, light-coloured trousers, and black trainers• Male two: white, of slim build, wearing a grey-hooded jacket, black trousers, and black trainers• Male three: white, wearing a green cap, black jacket, light-coloured shorts, and white trainers, and appears to walk with a slight limp in his right leg• Male four: white, of large build, wearing a two-toned orange and navy/black puffed jacket, black trousers, and black and white trainers The officer leading the investigation, Detective Constable Dan Burgan, said: \"The theft of many items which carry a significant cultural value is a significant loss for the city. \"These items, many of which were donations, form part of a collection that provides insight into a multi-layered part of British history, and we are hoping that members of the public can help us to bring those responsible to justice. \"So far, our enquiries have included significant CCTV enquiries as well as forensic investigations and speaking liaising with the victims. \"If you recognise the men pictured or have seen any of the possible items being sold online, please call us.\" The British Empire and Commonwealth Collection at Bristol Archives documents the links between Britain and nations in the British Empire from the late 19th century to recent times. It includes household belongings, souvenirs, photographs and papers."
    },
    {
        "title": "Three men jailed for life after man, 60, shot dead through living room window in County Durham",
        "description": "Three men have been jailed for life for the murder of a man in his own home.",
        "url": "https://news.sky.com/story/three-men-jailed-for-life-after-man-60-shot-dead-through-window-in-county-durham-13482063",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sean-ray-thomas-sterling_7106662.jpg?20251210152147",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:36:00",
        "Headline": "Barry Dawson was shot through the front window of his terraced house in Stanley in April.",
        "Content": " Three men have been jailed for life for the murder of a man in his own home. Barry Dawson, who was a grandfather, was shot through the living room window of his terraced house in Stanley, County Durham, on 5 April. Following a trial at Teesside Crown Court which concluded in October, Sean Reay, 30, of Sabin Terrace, Stanley, who shot the 60-year-old, was found guilty of his murder along with Kelvin Lawson, 38, and 22-year-old Thomas Sterling. Reay was given a minimum term of 32 years. Lawson, of Frosterley Gardens, Stanley, who smashed the downstairs window to allow his co-accused to get a clearer shot, got a minimum term of 28 years. Sterling, of The Avenue, Stanley, received a minimum term of 26 years. The judge said he was part of a \"show of strength\" in the street that day. A Crown Prosecution Service spokesman said at the time of their conviction: \"The shot struck Barry in the chest, puncturing his heart, lung and liver, and he was tragically pronounced dead at the scene a short time later. \"Following the shooting, Sean Reay fled the Durham area and was later arrested in Northern Ireland.\" Mr Dawson had lived in the street for more than two decades and was a well-liked member of his community. The shocking doorbell footage caught the shooting and then Mr Dawson's son, Shane, shouting: \"They shot my dad.\" Mr Justice Cotter said: \"This was an extraordinary crime in an ordinary residential street. \"It was the sort of thing most people only see in television or films, and then not in this country.\" In a victim impact statement, Mr Dawson's partner, Sarah Hopwood, said the man people knew as Buck was an \"adored father and grandfather\". She said: \"This horrendous crime has broken our hearts and it is something we will never recover from.\" Sean Reay 'out for revenge' The court heard Reay was out for revenge following an altercation outside his property earlier that day, which was suspected to be drug-related, and in which he claimed a man threatened to burn his house down. Reay's gang believed the person responsible was in Mr Dawson's home and they hoped to lure him out by breaking windows. Mr Dawson, who had been resting upstairs, and who had nothing to do with the earlier trouble outside the home, came downstairs to see what was going on. Mr Justice Cotter said Reay was in charge, while Lawson and Sterling were \"key lieutenants\". Trio 'lived by a code' The judge said the three men lived by a code that saw the police as the enemy. \"You can reflect on where your code has got you during your decades in prison,\" he said. \"Until you reject the code, you will not be safe to rejoin society.\" Reay recruited Kevin Dorward, 38, to drive them to the shooting and his cousin Keith Dorward, 48, also came along. They were cleared of murder, but admitted perverting the course of justice by trying to burn out the getaway car. Kevin Dorward's partner, Michaela Hetherington, also admitted perverting the course of justice by falsely claiming to police that the car had been stolen. The judge jailed Kevin Dorward for 20 months, Keith Dorward for 16 months, both of whom were living in Annfield Plain at the time, and Hetherington for 15 months, meaning she will be released immediately, having served 246 days on remand. Detective Chief Inspector Neil Fuller, Senior Investigating Officer for Operation Hamnett at Durham Constabulary, said: \"I hope this investigation sends out a clear message to criminals that we will not allow such extreme violence on our streets. \"There is no place for guns on our streets, and we take a zero-tolerance approach in tackling and bringing to justice those who choose to carry such weapons. \"Barry Dawson needlessly lost his life that afternoon because of the despicable actions of these three men. My thoughts remain with those who loved him.\""
    },
    {
        "title": "Nigel Farage's former school responds to claims he made racist comments as a student",
        "description": "Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\".",
        "url": "https://news.sky.com/story/nigel-farages-former-school-responds-to-claims-he-made-racist-comments-as-student-13482312",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform-uk_7107685.jpg?20251211182414",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-12-11 17:40:00",
        "Headline": "Dulwich College says the alleged behaviour attributed to Nigel Farage is \"wholly incompatible with the values the College holds\". Reform UK says this is a \"witch hunt\".",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\". In the first reported statement from the school about the accusations - which date from 1970s - current master Robert Milne wrote \"such behaviour is wholly incompatible with the values the College holds\". \"What we can unequivocally state is that the behaviours described are entirely at odds with the Dulwich College of today,\" he continued The comments come in a letter to former Dulwich pupil Jean-Pierre Lihou. Mr Lihou, 61, has alleged the current Reform UK leader sang antisemitic songs to Jewish schoolmates and \"had a big issue with anyone called Patel\".  Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". \n                  Reform UK denies Nigel Farage broke electoral law\n                 \n                  Millionaire former Tory donor defects to Reform\n                 \n                  Nigel Farage racism allegations are deeply shocking - but will they deter voters?\n                 Nigel Farage said: \"I have not met or spoken to this master. So I am surprised by his uninformed comments in response to claims from nearly 50 years ago from politically motivated actors. \"If he is interested, I can show him the many messages that I have received from fellow pupils, including Jewish ones, that entirely contradict these allegations.\" A spokesperson for Reform UK said: \"This witch hunt is merely an attempt to discredit Reform and Nigel Farage. \"Instead of debating Reform on the substance of our ideas and policies, the left-wing media and deeply unpopular Labour Party are now using 50-year-old smears in a last act of desperation. \"The British public see right through it.\" The letter also says the college has avoided making any public statements \"to protect the college's reputation in the long term\". \"This should not be interpreted as indifference: safeguarding the college's good name and upholding its values are of paramount importance to us,\" it continues. Mr Lihou told Sky News he cautiously welcomed the letter written to him from the master and said he understands why the college wasn't willing to unequivocally condemn the allegations against the Reform leader directly. \"Dulwich College has been clear that such accusations are very much at odds with the values of the school,\" he said. He added: \"Why can Mr Farage not accept that approaching 30 people [who] have lasting memories from him as a 13-year-old to an adult that he should unreservedly apologise for?\" Sky News has contacted Dulwich College for a comment."
    },
    {
        "title": "London tube and some train fares to rise, says mayor Sadiq Khan",
        "description": "Tube and some train fares in London are to rise from March,  under new plans announced by the capital's mayor. ",
        "url": "https://news.sky.com/story/london-tube-and-some-train-fares-to-rise-says-sadiq-khan-13482279",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-london-underground_7010145.jpg?20250903134048",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-11 16:30:00",
        "Headline": "Tube single fare hikes are capped at 20p as the mayor acknowledges the cost-of-living crisis. A passenger watchdog says the news is \"bittersweet\". ",
        "Content": "Tube and some train fares in London are to rise from March,  under new plans announced by the capital's mayor.  The hike will apply to the London Underground, the Elizabeth Line, the DLR and Overground lines, with single Tube fare increases to be capped at 20p. But bus and tram fares will be frozen for the \"seventh time\" until July, and weekly and daily caps across the Transport for London (Tfl) network will not change. A passenger watchdog has described the news as a \"bittersweet pill\" for Londoners. London mayor Sir Sadiq Khan said: \"When the government awarded TfL £2.2 billion in vital investment - the biggest ever multi-year funding deal for London in more than a decade - it made clear its expectation that TfL fares must rise by inflation plus 1%. \"However, I remain committed to doing everything in my power to keep TfL fares as affordable as possible because I know how the cost-of-living crisis is still hitting many Londoners hard.\" Under the new fare pricing, a peak time Tube journey within Zone 1 will rise from £2.90 to £3.10, while Piccadilly line fares from Zone 1 to Heathrow will increase from £5.80 to £5.90. \n                  Man arrested after frozen pangolins, rats and porcupines seized in London\n                 \n                  US student guilty of murdering Chinese partner after row over STDs\n                 \n                  Heathrow Airport live: Woman targeted in suitcase robbery before 'pepper spray' incident, police say\n                 Elizabeth line fares from Zone 1 to Heathrow would rise from £13.90 to £15.50, but would only impact single journeys due to the daily and weekly caps. The mayor added: \"The plans would mean that only fares on Tube and TfL rail services would now increase from March 2026. \"I also plan to ensure that increases to pay-as-you-go fares on the Tube will be capped at 20p, with many only rising by just 10p.\" Read more fron Sky News:NHS facing 'worst case scenario' amid 'super flu' surgeWhy did the US seize an oil tanker off Venezuela? Watchdog, London TravelWatch, called the announcement a \"bittersweet pill for Londoners to swallow,\" noting the \"crumbs of comfort\" in bus and tram fare freezes, \"as well as the promise of improved services, albeit paid for by inflation-busting rises in Tube and TfL rail fares\". It added: \"On the other hand, delays to the delivery of new Tube and DLR trains, alongside worsening bus speeds across the capital, will make the overall package feel like a hard sell to many passengers.\""
    },
    {
        "title": "Scottish newspaper editor David McCann charged over alleged indecent communications",
        "description": "A Scottish newspaper editor has been suspended after being charged in connection with alleged indecent online communications.",
        "url": "https://news.sky.com/story/scottish-newspaper-editor-david-mccann-charged-over-alleged-indecent-communications-13482227",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-court-edinburgh-edinburgh-sheriff-court_6853286.jpg?20251211162916",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-11 15:01:00",
        "Headline": "David McCann, editor of The Times and The Sunday Times in Scotland, was arrested after police executed a search warrant at a property in the Edinburgh area last month.",
        "Content": "A Scottish newspaper editor has been suspended after being charged in connection with alleged indecent online communications. David McCann, editor of The Times and The Sunday Times in Scotland, was arrested after police executed a search warrant at a property in the Edinburgh area on 25 November. The 43-year-old appeared at Edinburgh Sheriff Court on 26 November. He made no plea and was remanded in custody before being granted bail the following day. McCann was promoted to editor of the News UK titles in July, having previously served as deputy editor and news editor. Before joining the company in 2018, he previously worked as assistant editor and head of news at The Herald, and assistant news editor at the Daily Record. He also held various roles at the Edinburgh Evening News. \n                  Laura Docherty guilty of trying to murder toddler by giving her adult medication\n                 \n                  Edinburgh Airport: Flights resume after 'IT issue' halted air traffic - as it happened\n                 \n                  Have you seen this nutcracker? CCTV shows thief stealing festive statue in Edinburgh\n                 A Police Scotland spokesperson said: \"On Tuesday 25 November 2025, officers executed a search warrant at a property in the Edinburgh area. \"A 43-year-old man has been arrested and charged in connection with indecent online communications.\" Read more from Sky News:Thief banned from wearing wigs in shops after 'brazen' theftsHundreds of artefacts stolen from museum in raid The Crown Office and Procurator Fiscal Service (COPFS) said a standard prosecution report had been received from the force. A spokesperson for News UK said: \"We have been informed that David McCann, editor of The Times and The Sunday Times in Scotland, has been made the subject of a criminal investigation unrelated to his work. \"He has been suspended from the business. We will not be making any further comment at this time.\""
    },
    {
        "title": "Nurse Sandy Peggie to appeal trans doctor row judgment following 'completely made up' quote claim",
        "description": "A nurse is to appeal the employment tribunal judgment she received after a row with a transgender doctor about the shared use of a hospital female changing room, her lawyer has announced.",
        "url": "https://news.sky.com/story/sandie-peggie-tribunal-judgment-amended-amid-completely-made-up-quote-row-13482047",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sandie-peggie-dundee_7107562.jpg?20251211160304",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-12-11 08:47:00",
        "Headline": "The decision comes after supporters of the nurse highlighted alleged inaccuracies in a tribunal ruling. The case centres on a dispute with a transgender medic about a female changing room.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A nurse is to appeal the employment tribunal judgment she received after a row with a transgender doctor about the shared use of a hospital female changing room, her lawyer has announced. Nurse Sandie Peggie's decision follows a claim that a quote used in the original judgment this week was \"completely made up\". Solicitor Margaret Gribbon confirmed the move during a press conference on Thursday, shortly after a certificate of correction was issued amid complaints about the quote used in Monday's ruling. Ms Peggie said: \"Whilst I am delighted that the tribunal was critical of Fife health board and found they had harassed me, their judgment, I believe, falls short in many respects and that is why I certainly won't be giving up this legal fight any time soon.\" Ms Gribbon claimed some of the findings in the ruling were \"hugely problematic\" as she accused NHS Fife of going on an \"archaeological dig to find material to discredit\" Ms Peggie. She added: \"It was even suggested to Sandie, by Fife health board's KC during her cross-examination, that she'd lied about having experienced a menstrual flood on Christmas Eve 2023. \"So, against that background, it is difficult to envisage what woman would contemplate raising a complaint of this nature.\" \n                  Super flu strikes during perfect storm for NHS\n                 \n                  Birth stories: Women felt ignored, neglected and dismissed\n                 \n                  NHS facing 'worst case scenario' December amid 'super flu' surge\n                 Ms Gribbon said work on the appeal was already under way and will be submitted next month. Maya Forstater, chief executive of sex-based rights charity Sex Matters, had earlier claimed the employment judge's reference to a previous case involving herself had included a quote which was incorrect. She posted on X: \"This 'quote' from my judgment doesn't come from my judgment. It is completely made up.\" The certificate of correction, issued on Thursday by the Judicial Office, has not changed the verdict itself. In a statement, Ms Forstater said: \"I knew this was wrong, and it's good it's being amended, but I am astonished that it happened and I would like an explanation of how it happened. \"Claimants and witnesses going to court swear to tell the truth, the whole truth and nothing but the truth, and we expect nothing less from the judges.\" She added: \"This judgment was already being questioned because it seems to fly in the face of the Supreme Court's clear statement that single-sex facilities can only be on the basis of sex, not claimed identity. \"Errors like this just add to the growing feeling that this is not a sound judgment.\" Ms Peggie took action following a row with transgender medic Dr Beth Upton - who was born male and now identifies as a female - at Victoria Hospital in Kirkcaldy on Christmas Eve 2023. The nurse, who had complained about sharing a female changing room with Dr Upton, was placed on special leave after her colleague made an allegation of bullying and harassment, and cited concerns about patient care. Ms Peggie lodged a claim against NHS Fife and Dr Upton in response, with the nurse going on to win a claim for harassment against the health board. All other allegations of discrimination and victimisation were dismissed, with the employment tribunal additionally rejecting all claims against Dr Upton. In the 312-page judgment, the tribunal said NHS Fife should have taken action to reflect Ms Peggie's concerns over Dr Upton's use of the female changing room. The health board was found to have harassed the nurse by failing to revoke the doctor's permission on an interim basis until different work rotas took effect, and as a result, Dr Upton and Ms Peggie were both present in the changing facilities on two occasions. It was also found to have harassed Ms Peggie by taking an unreasonable length of time to investigate the allegations against her, and by making reference to patient care allegations against her on 28 March 2024. The health board was additionally found to have harassed Ms Peggie by giving an instruction to her not to discuss the case, until a further message a little over two weeks later which confirmed that applied only to the investigation. Read more:NHS Fife chief announces early retirement ahead of ruling Ms Peggie paid tribute to Neale Hanvey, depute leader of the Alba Party, who signposted her to Sex Matters. The nurse additionally thanked Ms Forstater and a whole host of women's rights campaigners, including For Women Scotland, Murray Blackburn Mackenzie, Women Won't Weesht, Women's Rights Network Scotland and the LGB Alliance. She also praised her \"outstanding\" legal team, made up of lead counsel Naomi Cunningham, junior counsel Dr Charlotte Elves, and solicitor Ms Gribbon. After thanking her family and friends for being a \"tower of strength\", she added: \"Finally, I want to pay tribute to my late dad who we lost in January and who I know will be looking down on me feeling proud that he, with my mum, raised a daughter who did not and will not weesht.\" The tribunal's hearings took place earlier this year - before and after the landmark UK Supreme Court judgment in April, which ruled \"woman\" and \"sex\" in the Equality Act 2010 refers to \"a biological woman and biological sex\". NHS Fife previously described the tribunal as a \"complex and lengthy process\" as it vowed to work through the detail of the judgment to \"understand fully what it means for the organisation\". The health board said it was aware of the updated judgment. A spokesperson added: \"We acknowledge the claimant's right to appeal in line with the employment tribunal process.\""
    },
    {
        "title": "US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela",
        "description": "The US will not \"stand by and watch sanctioned vessels sail the seas\", the White House has warned, after American forces seized an oil tanker off the coast of Venezuela.",
        "url": "https://news.sky.com/story/us-wont-stand-by-and-watch-sanctioned-vessels-warns-white-house-after-tanker-seized-off-venezuela-13482352",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-oil-tanker_7106952.png?20251210225500",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-11 20:01:00",
        "Headline": "White House spokeswoman Karoline Leavitt said sanctioned vessels \"fuel narcoterrorism\" and \"rogue and illegitimate regimes around the world\".",
        "Content": " The US will not \"stand by and watch sanctioned vessels sail the seas\", the White House has warned, after American forces seized an oil tanker off the coast of Venezuela. Spokeswoman Karoline Leavitt told reporters she would not speak about future ship seizures, but said the US would continue to follow Donald Trump's sanction policies. \"We're not going to stand by and watch sanctioned vessels sail the seas with black market oil, the proceeds of which will fuel narcoterrorism of rogue and illegitimate regimes around the world,\" she said. The US is gearing up to intercept more ships, six sources familiar with the matter told Reuters. One source said several more sanctioned tankers had been identified by the US for potential seizure. Two of the people said the US Justice Department and Homeland Security had been planning the seizures for months. American forces were monitoring vessels in Venezuelan ports and waiting for them to sail into international waters before taking action, one source added. \n                  Maria Corina Machado says her daring escape involved US help\n                 \n                  The real reason for Donald Trump's Venezuela exploits\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 It comes after a crude oil tanker, named Skipper, on Wednesday was stormed by US forces executing a seizure warrant. The ship left Venezuela's main oil port of Jose between 4 and 5 December after loading about 1.1 million barrels of oil, according to satellite information analysed by TankerTrackers.com and internal shipping data from Venezuelan state oil company PDVSA. Economics and data editor Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs. It is, he has said repeatedly, that country's part in the production and smuggling of illegal narcotics into America that lies behind the ratcheting up of forces in the Caribbean in recent weeks. But what if there's something else going on here too? What if this is really all about oil? In one respect this is clearly preposterous. After all, the United States is, by a country mile, the world's biggest oil producer. Venezuela is a comparative minnow these days, the 21st biggest producer in the world, its output having been depressed under the Chavez and then Maduro regimes. Why should America care about Venezuelan oil? For the answer, one needs to spend a moment - strange as this will sound - contemplating the chemistry of oil... Read more US attorney general Pam Bondi said on X, formerly Twitter, that the ship was \"used to transport sanctioned oil from Venezuela and Iran\". \"For multiple years, the oil tanker has been sanctioned by the United States due to its involvement in an illicit oil shipping network supporting foreign terrorist organisations,\" she added. Ms Leavitt said that \"the United States does intend to get the oil\" that was onboard the vessel. The government in Caracas, led by President Nicolas Maduro, branded the ship's seizure a \"blatant theft\" and an \"act of international piracy\". Read more:Analysis: Is this what the beginning of a war looks like?US-Venezuela crisis explainedWhy tanker seized by US was 'spoofing' its location The US has been ramping up the pressure on Mr Maduro and is reportedly considering trying to oust him. It has piled on sanctions, carried out a military build-up in the southern Caribbean, and launched attacks on suspected drug vessels from Venezuela. Now America has issued new sanctions targeting Franqui Flores, Efrain Antonio Campo Flores, and Carlos Erik Malpica Flores - three nephews of Mr Maduro's wife, Cilia Flores - as well as on six crude oil tankers and six shipping companies linked to them. By seizing oil tankers, the US is threatening Mr Maduro's government's main revenue source - oil exports. The sources said the US was focusing on what's been called the shadow fleet - tankers transporting sanctioned oil to China, the biggest buyer of crude from Venezuela and Iran. They said one shipper had already temporarily suspended three voyages transporting six million barrels of Venezuelan crude oil. \"The cargoes were just loaded and were about to start sailing to Asia,\" a source said. \"Now the voyages are cancelled and tankers are waiting off the Venezuelan coast as it's safer to do that.\""
    },
    {
        "title": "Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location",
        "description": "An oil tanker seized by the US off the Venezuelan coast on Wednesday spent years trying to sail the seas unnoticed.",
        "url": "https://news.sky.com/story/moving-in-the-shadows-why-tanker-seized-by-us-off-venezuela-was-spoofing-its-location-13482140",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-osint-teaser_7107538.png?20251211153339",
        "type": "World",
        "Author": "Adam Parker, OSINT editor, and Sophia Massam, junior digital investigations journalist",
        "Date Published": "2025-12-11 12:36:00",
        "Headline": "Here's what we know about how and why the oil tanker Skipper 'spoofed' its location, and what eventually led to it being seized by the US.",
        "Content": "By Adam Parker, OSINT editor, and Sophia Massam, junior digital investigations journalist   An oil tanker seized by the US off the Venezuelan coast on Wednesday spent years trying to sail the seas unnoticed. Changing names, switching flags, and vanishing from tracking systems. That all came to an end this week, when American coast guard teams descending from helicopters with guns drawn stormed the ship, named Skipper. A US official said the helicopters that took the teams to the tanker came from the aircraft carrier USS Gerald R Ford. The sanctioned tanker Over the past two years, Skipper has been tracked to countries under US sanctions including Iran. TankerTrackers.com, which monitors crude oil shipments, estimates Skipper has transported nearly 13 million barrels of Iranian and Venezuelan oil since 2021. \n                  'Venezuela has already been invaded' says Nobel Peace Prize winner Machado when asked about Trump intervention\n                 \n                  Venezuelan opposition leader misses Nobel Peace Prize ceremony as 'lives risked' to get her to Oslo\n                 \n                  Is this what the beginning of a war looks like? How the US threat around Venezuela is shaping up\n                 And in 2022, the US Treasury Office of Foreign Assets Control (OFAC) placed Skipper, then known as Adisa, on its sanctions list. But that did not stop the ship's activities. In mid-November 2025, it was pictured at the Jose Oil Export Terminal in Venezuela, where it was loaded with more than one million barrels of crude oil. It left Jose Oil Export Terminal between 4 and 5 December, according to TankerTrackers.com. And on 6 or 7 December, Skipper did a ship-to-ship transfer with another tanker in the Caribbean, the Neptune 6. Ship-to-ship transfers allow sanctioned vessels to obscure where oil shipments have come from. The transfer with Neptune 6 took place while Skipper's tracking system, known as AIS, was turned off. Read more:Everything we know about dramatic ship seizureIs this what the beginning of a war looks like? Dimitris Ampatzidis, senior risk and compliance manager at Kpler, told Sky News: \"Vessels, when they are trying to hide the origin of the cargo or a port call or any operation that they are taking, they can just switch off the AIS.\" Matt Smith, head analyst US at Kpler, said they believe the ship's destination was Cuba. Around five days after leaving the Venezuelan port, it was seized around 70 miles off the coast. Moving in the shadows  Skipper has tried to go unnoticed by using a method called 'spoofing'. This is where a ship transmits a false location to hide its real movements. \"When we're talking about spoofing, we're talking about when the vessel manipulates the AIS data in order to present that she's in a specific region,\" Mr Ampatzidis explained. \"So you declare false AIS data and everyone else in the region, they are not aware about your real location, they are only aware of the false location that you are transmitted.\" When it was intercepted by the US, it was sharing a different location more than 400 miles away from its actual position. Skipper was manipulating its tracking signals to falsely place itself in Guyanese waters and fraudulently flying the flag of Guyana. \"We have really real concerns about the spoofing events,\" Mr Ampatzidis told Sky News. \"It's about the safety on the seas. As a shipping industry, we have inserted the AIS data, the AIS technology, this GPS tracking technology, more than a decade back, in order to ensure that vessels and crew on board on these vessels are safe when they're travelling.\" Dozens of sanctioned tankers 'operating off Venezuela' Skipper is not the only sanctioned ship off the coast of Venezuela. According to analysis by Windward, 30 sanctioned tankers were operating in Venezuelan ports and waters as of 11 December. The tanker seizure is a highly unusual move from the US government and is part of the Trump administration's increasing pressure on Venezuelan President Nicolas Maduro. In recent months, the largest US military presence in the region in decades has built up, and a series of deadly strikes has been launched on alleged drug-smuggling boats in the Caribbean Sea and eastern Pacific Ocean. In the past, Mr Ampatzidis explained, actions like sanctions have had a limited effect on illegally operating tankers. But the seizure of Skipper will send a signal to other dark fleet ships. \"From today, they will know that if they are doing spoofing, if they are doing dark activities in closer regions of the US, they will be in the spotlight and they will be the key targets from the US Navy.\" The Data X Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "The real reason for Donald Trump's Venezuela exploits",
        "description": "Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs.",
        "url": "https://news.sky.com/story/the-real-reason-for-donald-trumps-venezuela-exploits-13482185",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oil-venezuela_7107432.jpg?20251211133920",
        "type": "World",
        "Author": "Ed Conway",
        "Date Published": "2025-12-11 13:40:00",
        "Headline": "The president has cited drugs as the reason for US action against Venezuela. But Sky's Ed Conway says there is an alternative economic explanation.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs. It is, he has said repeatedly, that country's part in the production and smuggling of illegal narcotics into America that lies behind the ratcheting up of forces in the Caribbean in recent weeks. But what if there's something else going on here too? What if this is really all about oil? In one respect this is clearly preposterous. After all, the United States is, by a country mile, the world's biggest oil producer. Venezuela is a comparative minnow these days, the 21st biggest producer in the world, its output having been depressed under the Chavez and then Maduro regimes. Why should America care about Venezuelan oil? Money latest: Urgent warning over tumble dryers For the answer, one needs to spend a moment - strange as this will sound - contemplating the chemistry of oil. Crude oil is, as the name suggests, quite crude. It's an organic compound, the product of ancient organisms that have been compressed and heated up under the earth's surface for hundreds of millions of years. And as such, crude oil is subtly different depending on the conditions under which those organisms were compressed. In some parts of the world, crude oil comes out of the ground as clear, flowing liquid. Sometimes it is green. Sometimes it is heavy, thick gloopy stuff. Oil producers have a word for these differing varieties: light, medium and heavy.  And here's the first thing you need to know. Most of America's refineries are set up to process the heavy stuff. In other words, if America is going to keep its cars fed with gasoline, it needs heavy, gloopy crude. And since it costs many, many billions of dollars to overhaul refineries, no-one particularly wants to do that anytime soon. Read more:Why did the US seize tanker off Venezuela? But the second thing you need to know is the vast majority of that oil produced in America, thanks to the shale revolution, is light crude. In other words, America's refineries are not compatible with most of the oil America produces. The upshot is that for all that America theoretically pumps more crude oil than it would ever need out of its own territories, it is still totally dependent on trade to meet its demands for heavy oil. Most American crude is exported overseas. And America imports well over 6,000 barrels of oil a day to feed its refineries in Texas and Louisiana with the heavy stuff they can digest. All of which brings us to Venezuela, because it is, alongside Canada and Russia, sitting on the world's biggest reserves of heavy oil. Right now, most American oil comes from Canada but were Donald Trump keen to wean himself off Canadian crude, he is well aware there is a vast resource of it sitting on the other side of the Caribbean for all those Texas and Louisiana refineries."
    },
    {
        "title": "'What will hold back the Russians?' Zelenskyy responds to new US peace proposal for Ukraine",
        "description": "Volodymyr Zelenskyy says the US has offered to create a \"free economic zone\" in the contested Donbas region of eastern Ukraine in a bid to push a peace deal over the line.",
        "url": "https://news.sky.com/story/what-will-hold-back-the-russians-zelenskyy-responds-to-new-us-peace-proposal-for-ukraine-13482384",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-volodymyr-zelenskyy_7105520.jpg?20251209122818",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-11 21:57:00",
        "Headline": "Volodymyr Zelenskyy raised questions over the scheme, asking who will govern the zone and how the Russians could be prevented from seizing it.",
        "Content": " Volodymyr Zelenskyy says the US has offered to create a \"free economic zone\" in the contested Donbas region of eastern Ukraine in a bid to push a peace deal over the line. The Donbas - an industrial and coal-mining area primarily made up of the Donetsk and Luhansk regions - has become one of the key sticking points in the US-proposed peace plan. The first draft of the plan, widely leaked last month, stipulated that Ukraine must withdraw from areas of the Donbas it currently controls, thought to be a minority portion, as a condition for peace. Ukraine considered that point \"unacceptable\", and Mr Zelenskyy has spent the last few weeks drafting a response to the plan that removed \"obvious anti-Ukraine points\". After a series of meetings with Ukraine's European allies, including a trip to London to meet Sir Keir Starmer on Monday, Zelenskyy said on Thursday that he'd sent Washington a revised peace plan, whittled down to just 20 points. The new US proposal envisions Ukraine withdrawing from its territory in the Donbas without the Russians advancing, creating a neutral zone. But Zelenskyy poured cold water on the plans as he briefed journalists in Kyiv. \n                  'Israelis are returning to their land... that is the right thing to do' - the illegal settlement filling Palestinians with dread\n                 \n                  US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \"Who will govern this territory, which they are calling a 'free economic zone' or a 'demilitarised zone' - they don't know,\" he said. \"If one side's troops have to retreat and the other side stays where they are, then what will hold back these other troops, the Russians? Or what will stop them disguising themselves as civilians and taking over this free economic zone? This is all very serious. \"It's not a fact that Ukraine would agree to it, but if you are talking about a compromise then it has to be a fair compromise.\" Sky News military analyst Michael Clarke gave an ominous assessment of the proposal, saying it left \"no physical solution\" to resolve the problem of future attacks.  He said: \"If Ukraine gives up the fortress cities in the Donbas, the only security they can have is by being heavily armed and being backed by their allies in some way.\" \"The only thing that would stop Russia is deterrence: the knowledge that either the European forces were sitting in Ukraine ready to fight for them, which is hard to imagine at the moment, and even harder to imagine that they are backed up by American forces.\" Matthew Savill, director of military sciences at the Royal United Service Institute, was similarly sceptical. \"The general view is that the Russians will be too tempted to... try and come back for more,\" he told Sky News. He added that \"some kind of temporary ceasefire\" might work, but it would require \"the Europeans to demonstrate they can put their forces where their mouth is in terms of a reassurance force\". Amid this backdrop there was a meeting today of the coalition of the willing - the 34-strong bloc of nations pledged to support Ukraine against Russian aggression, of which Britain is a part. Read more:Analysis: Russia may exploit death of British soldier in UkraineRussia sending Ukrainian children to 'abusive' camp in North Korea There was agreement to continue to fund military support, \"progress on mobilising frozen Russian sovereign assets\", and an update from Zelenskyy on Russia's continued bombardment of his country, according to Downing Street. Afterwards, Zelenskyy said the bloc was working to ensure any peace deal contains \"serious components of European deterrence\". He added: \"It is important that the United States is with us and supports these efforts. No one is interested in a third Russian invasion.\" He also addressed growing pressure from the US for an election in Ukraine, saying \"there must be a ceasefire\" before the country can go to the polls. 👉 Tap to follow Trump100 wherever you get your podcasts👈 Zelenskyy's term expired last year, but wartime elections are forbidden by law in Ukraine. Meanwhile, the tone tonight from the White House was one of impatience, with Trump's team saying he wouldn't attend further meetings until there's a real chance of signing a peace deal. \"The president is extremely frustrated with both sides of this war, and he is sick of meetings just for the sake of meeting,\" said White House spokeswoman Karoline Leavitt."
    },
    {
        "title": "'Venezuela has already been invaded' says Nobel Peace Prize winner Machado when asked about Trump intervention",
        "description": "Venezuela's Nobel Peace Prize winning opposition leader has said her country has \"has already been invaded\", when asked whether she would support a US invasion.  ",
        "url": "https://news.sky.com/story/venezuela-has-already-been-invaded-says-nobel-peace-prize-winner-machado-when-asked-about-trump-intervention-13482086",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maria-corina-machado_7107205.jpg?20251211092338",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-11 10:43:00",
        "Headline": "Venezuelan opposition leader, Maria Corina Machado, claimed Russia, Iran, Hezbollah, Hamas, and drug cartels were all active in her country when the question of a US invasion was raised.",
        "Content": " Venezuela's Nobel Peace Prize winning opposition leader has said her country has \"has already been invaded\", when asked whether she would support a US invasion.   Speaking at a news conference in Oslo after being awarded the famous prize, Maria Corina Machado replied: \"Look, some people talk about invasion in Venezuela and the threat of an invasion in Venezuela and I answered Venezuela has been already invaded. \"We have the Russian agents, we have the Iranian agents. We have terrorist groups such as Hezbollah, Hamas, operating freely in accordance with the regime. \"We have the Colombian guerrilla, the drug cartels that have taken over 60% of our populations and not only involved in drug trafficking, but in human trafficking in networks of prostitution. This has turned Venezuela into the criminal hub of the Americas.\" The 58-year-old engineer continued: \"Where do those funds come from? Well, from drug trafficking, from the black market of oil, from arms trafficking, and from human trafficking. We need to cut those flows.\"  Read more:Peace prize winner makes appearanceVenezuela's opposition leader greets crowd It comes after news of the US seizing an oil tanker off the coast of Venezuela, in the latest push by the Trump administration to increase the pressure on the government in Caracas. \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \n                  Venezuelan opposition leader misses Nobel Peace Prize ceremony as 'lives risked' to get her to Oslo\n                 \n                  Is this what the beginning of a war looks like? How the US threat around Venezuela is shaping up\n                 America has built up the largest military presence in the region in decades and launched a series of deadly strikes on boats it claims were drug-smuggling in the Caribbean. Ms Machado made her return to the public eye in the early hours of Wednesday morning from the balcony of the Norwegian capital's Grand Hotel, after covertly travelling to Oslo to receive the Nobel Peace Prize. She didn't make it to Oslo in time to receive the Nobel Peace Prize in person, after an extraordinary day shrouded in uncertainty over her whereabouts. It was accepted on her behalf by her daughter Ana Corina Sosa. The opposition leader has dedicated her prize in part to US President Donald Trump, who has said he himself deserved the honour. Ms Machado has aligned herself with hawks close to Trump who argue that Venezuela's president Nicolas Maduro has links to criminal gangs that pose a direct threat to US national security, despite doubts raised by the US intelligence community."
    },
    {
        "title": "Maria Corina Machado says her daring escape involved US help",
        "description": "Some details have emerged about Maria Corina Machado's daring escape from Venezuela.",
        "url": "https://news.sky.com/story/maria-corina-machado-says-her-daring-escape-involved-us-help-13482320",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maria-corina-machado_7107664.jpg?20251211180555",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-12-11 17:49:00",
        "Headline": "Despite reports of a disguise and a fishing boat, Maria Corina Machado revealed little of her journey to Oslo. One fact she did confirm, however, was US help in her journey.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Some details have emerged about Maria Corina Machado's daring escape from Venezuela. She was reportedly disguised and took a wooden fishing boat overnight in choppy seas to the Caribbean island of Curacao. From there, she flew by private jet to Norway. Ms Machado has revealed little herself, however, promising to tell the story one day but not wanting to expose the people \"who risked their lives\" to get her to Oslo. One fact she did confirm, when she spoke to the media here, was help from the US in her journey. Read more: In-hiding peace prize winner makes emotional appearance Now here in Norway, she is reunited with her family, many of whom she hasn't seen for two years. She's missed graduations and weddings and said she couldn't sleep thinking of the moment she would hug her three children. \n                  US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela\n                 \n                  The real reason for Donald Trump's Venezuela exploits\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 Pressed a number of times on whether she supported a possible US invasion of Venezuela to overthrow Nicolas Maduro, she wouldn't commit outright but said that the country has already been invaded by Russia, Iran and terrorist groups like Hezbollah.  Ms Machado said she needed international help to bring back democracy. She was equally but understandably vague about her next movements. The Venezuelan opposition leader will want to spend time with her family and revealed that she hasn't seen a doctor for a proper check-up in over a year because she has been forced to live in hiding. Read more from Sky News:Why did the US seize an oil tanker off Venezuela?Disney characters coming to AI in $1bn deal She has also had many invitations, presumably from world leaders, to visit - she might decide that it is a good opportunity to build relations and support for the day Maduro does leave. But she said she would go back to Venezuela \"when the time is right\" and \"whether or not Maduro is still there\". I've no doubt she will, but the journey home will be every bit as dangerous as the extraordinary journey out."
    },
    {
        "title": "Russia sending Ukrainian children to 'harmful and abusive' camp in North Korea, says human rights group",
        "description": "Ukrainian children abducted by Russia have been sent to North Korea for \"political indoctrination\", human rights campaigners have warned.",
        "url": "https://news.sky.com/story/russia-sending-ukrainian-children-to-harmful-and-abusive-camp-in-north-korea-says-human-rights-group-13482298",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kateryna-rashevska_7107624.jpg?20251211173041",
        "type": "World",
        "Author": "Michael Havis, news reporter",
        "Date Published": "2025-12-11 17:20:00",
        "Headline": "\"Several\"  children from occupied territories have faced indoctrination at the Songdowon International Children's Camp on the east coast of North Korea, Sky News has been told.",
        "Content": "By Michael Havis, news reporter  Ukrainian children abducted by Russia have been sent to North Korea for \"political indoctrination\", human rights campaigners have warned. The Kyiv-based Regional Centre for Human Rights said it had confirmed \"several\" cases of Ukrainian children being sent to a camp in the reclusive nation. Here they faced \"militarisation and political indoctrination\", constituting \"harmful and abusive treatment, with potentially severe psychological consequences\", the organisation told Sky News via email. \"At this moment we have confirmation of several cases involving Ukrainian children taken from the occupied territories to North Korea,\" wrote Kateryna Rashevska, the centre's legal expert. She added that they knew of others who had also been considered for the camps, though had not necessarily attended them. \"There are also mentions of other children, including from the occupied Luhansk region, who participated in the competitive selection process,\" Ms Rashevska said. \"However, there is no confirmation of their selection.\" \n                  Trump orders nuclear weapons tests as he meets Xi\n                 \n                  Trump says he is '100% open' to meeting Kim Jong Un during Asia trip\n                 \n                  Kim Jong Un reveals he still has 'good memories' of Donald Trump\n                 She identified two affected children in testimony she gave to the US Congress last week. Ms Rashevska told a Senate subcommittee: \"12-year-old Misha from the occupied Donetsk region and 16-year-old Liza from occupied Simferopol were sent to Songdowon camp in North Korea, 9,000 km from home. \"Children there were taught to 'destroy Japanese militarists' and met Korean veterans who, in 1968, attacked the U.S. Navy ship Pueblo, killing and wounding nine American soldiers.\" The centre told Sky News that Misha, (short for Mykhailo) stayed at the camp from 21 July to 1 August 2025 as part of a \"Korean-Russian Friendship\" event, while Liza, (short for Yelyzaveta), was there from July to August last year. An official programme for one trip lists events like Korea Day, Russia Day, as well as sport, and activities dedicated to the history, culture and traditions of the two countries. But campaigners say we shouldn't be deceived by the benign itinerary. Ms Rashevska said: \"Although such visits are presented as 'cultural exchanges' they are in fact 'children's diplomacy' which effectively legitimizes the totalitarian regime in North Korea. \"For children from the occupied territories, this means visiting a state that supports aggression against Ukraine. \"All of them have already undergone ideological indoctrination and militarisation, making them a kind of tool of Russian propaganda. \"The inclusion of children from the occupied territories of Ukraine also serves as a way for the Russians to legitimise the annexation and demonstrate that these children have already become bearers of Russian identity.\" The Songdowon International Children's Camp, on the east coast of North Korea, lies just a few miles from the regime's newly-built beach resort at Wonsan. Read more:North Koreans in Ukraine 'blow themselves up to avoid capture'Trump says he is '100% open' to meeting Kim Jong Un To get there, Ms Rashevska said, children were taken from occupied Ukraine to Moscow, then to Vladivostok in the Russian far east, and finally on to North Korea. And while only a few children have made the trip so far, campaigners are raising the alarm now in the hope of saving others. Ms Rashevska wrote: \"A small number of children taken to North Korea does not mean that Russia will not expand these programs in the future. \"This is why it is important to raise this issue publicly, so that these isolated cases do not develop into administrative practices or state policies of the Russian Federation. \"That would increasingly hinder the return of children, especially from closed countries like North Korea.\" North Korea has been sending troops to Ukraine to fight alongside Russian forces since last year. And Ms Rashevska said it was no coincidence that Ukrainian children were being sent to a hostile nation. She told Sky News: \"North Korea is also participating in the crime of aggression... and that is why they sent Ukrainian children to this enemy state.\""
    },
    {
        "title": "Man arrested after frozen pangolins, rats and porcupines seized in London",
        "description": "A man has been arrested after police seized 38kg of illegal frozen bushmeat including pangolins, cane rats and porcupines, the food safety watchdog has said.",
        "url": "https://news.sky.com/story/man-arrested-after-frozen-pangolins-rats-and-porcupines-seized-in-london-13482197",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-pangolin-frozen_7107423.jpg?20251211133349",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-11 13:58:00",
        "Headline": "The news comes as authorities from 134 countries revealed they seized a record number of illegally traded live animals and a record amount of illegally traded wild animal meat.",
        "Content": "A man has been arrested after police seized 38kg of illegal frozen bushmeat including pangolins, cane rats and porcupines, the food safety watchdog has said. Officers from the Food Standards Agency (FSA) and the Metropolitan Police found the bushmeat at a site in Deptford, southeast London, on 5 December. Bushmeat is from wild animals - often species found in tropical regions - that have been hunted. A 57-year-old man was arrested and released under investigation, the FSA said. The operation targeted illegally imported meat products that posed potential food safety risks to consumers because illegally imported meat bypasses safety checks, the watchdog said. Some species, such as pangolins, are also critically endangered and all commercial trade of them is prohibited internationally. Pangolins are hunted by humans for their meat and scales. They are the only type of mammal with scales covering their bodies from head to tail, and they feed on ants, termites and insect larvae, according to the Zoological Society of London (ZSL). \n                  Scottish wildlife park defends decision to allow convicted animal abuser to volunteer at visitor attraction\n                 \n                  Natalie Herron: Scottish woman jailed for sharing monkey torture videos\n                 \n                  UK's oldest polar bear euthanised at the age of 28\n                 One million pangolins are thought to have been poached in the space of a single decade to satisfy demand, making them perhaps the world's most-poached animal, ZSL said. It said pangolins' scales and other body parts are used for traditional medicine in China, Vietnam and parts of West and Central Africa, despite there being no scientific evidence of them having any health benefits. A senior investigator at the FSA, Simon Ashwin, said the body \"advises consumers not to buy or eat illegally imported meat, including bushmeat, as it may pose serious health risks\". A global problem  The news comes as authorities from 134 countries revealed they had seized a record number of illegally traded live animals and a record amount of illegally traded wild animal meat. An operation between 15 September and 15 October, coordinated by Interpol and the World Customs Organisation, identified 1,100 suspects, and resulted in the arrest of 24 people in South Africa, two in Vietnam and one in Qatar. Nearly 30,000 live animals were seized in the month-long global sting by police, customs, border security, and forestry and wildlife authorities. Interpol said the operation underlined a growing demand for exotic pets including birds, tortoises, reptiles and primates. There was also a sharp rise in the trafficking of exotic arthropods - with almost 10,500 butterflies, spiders and insects seized. \"Though tiny in size, these creatures play vital ecological roles. Their removal destabilises food chains and introduces invasive species or diseases, posing serious biosecurity and public health risks,\" Interpol said. Wild animal meat trafficking was also on the rise - with a record 5.8 tonnes of bushmeat being seized. Read more from Sky News:Double building collapse in Morocco leaves 22 deadMeghan contacts estranged father Thomas Markle In particular, authorities noted an increase in cases of trafficking from Africa into Europe. Kenyan officials seized more than 400kg of giraffe meat, while Tanzanian police recovered zebra and antelope meat and skins valued at about £7,500 ($10,000). Most wildlife trafficking this year involved animal remains, parts and products, often for traditional medicine or foods. The annual value of wildlife crime is estimated at £14.9bn ($20bn), but the real figure is probably much higher. Interpol said the operation \"once again exposes the sophistication and scale of the criminal networks driving the illegal wildlife and forestry trade - networks that increasingly intersect with all crime areas, from drug trafficking to human exploitation\"."
    },
    {
        "title": "Trump's high seas raid may be followed by something much more severe",
        "description": "The pictures are striking - US forces sliding down ropes on to the deck of an oil tanker in the Caribbean.",
        "url": "https://news.sky.com/story/dawn-raid-on-the-high-seas-paints-vivid-portrait-of-trumps-approach-to-venezuela-13482003",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-maduro_7107044.jpg?20251211012824",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-12-11 01:18:00",
        "Headline": "The latest US operation against Venezuela will fuel speculation that airstrikes may soon follow - and Donald Trump hasn't ruled out land operations, either.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The pictures are striking - US forces sliding down ropes on to the deck of an oil tanker in the Caribbean. Their dawn operation painted a vivid portrait of the Trump administration's approach to the Maduro government. Officials framed it as the execution of a warrant on a vessel they linked to sanctioned oil from Venezuela and Iran. But the imagery of armed troops seizing control of the bridge was anything but routine.  Instead, it underscored the White House's preference for visible demonstrations of muscle over diplomacy. From Iran to North Korea, Trump has relied heavily on sanctions and show-of-strength tactics. Venezuela, long mired in economic collapse and political turmoil, is a prime target for that strategy. Critics argue that such high stakes on the high seas risk escalating tensions without offering a path to political transition in Caracas. By targeting an oil shipment, rather than another suspected drug boat, Washington has signalled its willingness to disrupt exports.  Trump seems determined to shut down the main source of funding for Nicolas Maduro's embattled government. Nine months ago, Trump imposed a 25% tariff on all goods imported into the US from any country buying oil or gas from Venezuela. This is more aggressive and will be viewed in Caracas as a direct threat to the country's economy and sovereignty. Read more: Is this what the beginning of a war looks like? The interception of the tanker raises more questions about international maritime law and the reach of US enforcement powers. In the space of four months, the US has bombed 23 boats, killing 87 people, accusing the occupants of being \"narcoterrorists\". This will fuel speculation that airstrikes could be imminent, Trump having posted two weeks ago, that he had closed the airspace."
    },
    {
        "title": "'Catastrophic', life-threatening, floods hitting Washington State, USA",
        "description": "Tens of thousands of people have been told to evacuate homes in Washington State, northwest America, to escape \"catastrophic\", life-threatening, floods.  ",
        "url": "https://news.sky.com/story/catastrophic-life-threatening-floods-hitting-washington-state-usa-13482050",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-snoqualmie-river-washington_7107177.jpg?20251211085954",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-11 08:53:00",
        "Headline": "Tens of thousands told to evacuate as governor, Bob Ferguson, declares a state-wide emergency,  warning that \"lives will be at stake in the coming days\".",
        "Content": " Tens of thousands of people have been told to evacuate homes in Washington State, northwest America, to escape \"catastrophic\", life-threatening, floods.   Days of relentless heavy rain have triggered rescues and road closures and the state's governor, Bob Ferguson, declared a state-wide emergency on Wednesday, warning that \"lives will be at stake in the coming days\". \"Catastrophic flooding is likely\" in many areas and the state is requesting rescue teams and boats, Mr Ferguson said, as rivers reached near historic levels. Heavy rain continued to fall over parts of the state on Thursday morning, and led to the suspension of Amtrak trains between Seattle and Vancouver. A large swathe of the Cascade mountains saw 4-6in of rain fall between late Tuesday and late Wednesday, the National Weather Service in Seattle said. Almost 7in was recorded in the Olympic Mountains. \"Approximately 100,000 people in Washington State have been advised to evacuate,\" Washington Emergency Management Division spokesperson Karina Shagren told CNN on Wednesday. Hundreds of National Guard troops are being sent in to help stricken communities. A major road - Interstate 90 east of Seattle - has been blocked by a landslide leaving vehicles trapped by tree trunks, branches, mud and standing water. The city of Mount Vernon, Washington, and upriver communities were given instructions to evacuate to higher ground as flooding is anticipated in the region, Mr Ferguson said on Wednesday. Read more from Sky News:Why did the US seize an oil tanker off the coast of Venezuela?UK rebuts Milei's claims about arms exports and Falkland Islands Hamilton, Rockport, Marblemount and Concrete are also being asked \"to evacuate to high ground as soon as possible,\" the governor said. More than a foot of rain is anticipated across higher parts of the Pacific Northwest. Rainfall reached 3.03in at the Olympia Regional Airport on Monday, breaking the previous record of 2.5in, Sky's US partner NBC News has reported. More than 17,000 customers in Washington State had lost electricity by Wednesday night, according to PowerOutage.us. In a valley leading out to the foothills of Mount Rainier southeast of Seattle, Pierce County sheriff's deputies on Wednesday rescued people from a mobile home park in Orting, including one man who waded through waist-deep water in Santa hat. Part of the town was ordered to evacuate over concerns about the Puyallup River's extremely high levels and upstream levees."
    },
    {
        "title": "US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela",
        "description": "The US will not \"stand by and watch sanctioned vessels sail the seas\", the White House has warned, after American forces seized an oil tanker off the coast of Venezuela.",
        "url": "https://news.sky.com/story/us-wont-stand-by-and-watch-sanctioned-vessels-warns-white-house-after-tanker-seized-off-venezuela-13482352",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-oil-tanker_7106952.png?20251210225500",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-11 20:01:00",
        "Headline": "White House spokeswoman Karoline Leavitt said sanctioned vessels \"fuel narcoterrorism\" and \"rogue and illegitimate regimes around the world\".",
        "Content": " The US will not \"stand by and watch sanctioned vessels sail the seas\", the White House has warned, after American forces seized an oil tanker off the coast of Venezuela. Spokeswoman Karoline Leavitt told reporters she would not speak about future ship seizures, but said the US would continue to follow Donald Trump's sanction policies. \"We're not going to stand by and watch sanctioned vessels sail the seas with black market oil, the proceeds of which will fuel narcoterrorism of rogue and illegitimate regimes around the world,\" she said. The US is gearing up to intercept more ships, six sources familiar with the matter told Reuters. One source said several more sanctioned tankers had been identified by the US for potential seizure. Two of the people said the US Justice Department and Homeland Security had been planning the seizures for months. American forces were monitoring vessels in Venezuelan ports and waiting for them to sail into international waters before taking action, one source added. \n                  Maria Corina Machado says her daring escape involved US help\n                 \n                  The real reason for Donald Trump's Venezuela exploits\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 It comes after a crude oil tanker, named Skipper, on Wednesday was stormed by US forces executing a seizure warrant. The ship left Venezuela's main oil port of Jose between 4 and 5 December after loading about 1.1 million barrels of oil, according to satellite information analysed by TankerTrackers.com and internal shipping data from Venezuelan state oil company PDVSA. Economics and data editor Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs. It is, he has said repeatedly, that country's part in the production and smuggling of illegal narcotics into America that lies behind the ratcheting up of forces in the Caribbean in recent weeks. But what if there's something else going on here too? What if this is really all about oil? In one respect this is clearly preposterous. After all, the United States is, by a country mile, the world's biggest oil producer. Venezuela is a comparative minnow these days, the 21st biggest producer in the world, its output having been depressed under the Chavez and then Maduro regimes. Why should America care about Venezuelan oil? For the answer, one needs to spend a moment - strange as this will sound - contemplating the chemistry of oil... Read more US attorney general Pam Bondi said on X, formerly Twitter, that the ship was \"used to transport sanctioned oil from Venezuela and Iran\". \"For multiple years, the oil tanker has been sanctioned by the United States due to its involvement in an illicit oil shipping network supporting foreign terrorist organisations,\" she added. Ms Leavitt said that \"the United States does intend to get the oil\" that was onboard the vessel. The government in Caracas, led by President Nicolas Maduro, branded the ship's seizure a \"blatant theft\" and an \"act of international piracy\". Read more:Analysis: Is this what the beginning of a war looks like?US-Venezuela crisis explainedWhy tanker seized by US was 'spoofing' its location The US has been ramping up the pressure on Mr Maduro and is reportedly considering trying to oust him. It has piled on sanctions, carried out a military build-up in the southern Caribbean, and launched attacks on suspected drug vessels from Venezuela. Now America has issued new sanctions targeting Franqui Flores, Efrain Antonio Campo Flores, and Carlos Erik Malpica Flores - three nephews of Mr Maduro's wife, Cilia Flores - as well as on six crude oil tankers and six shipping companies linked to them. By seizing oil tankers, the US is threatening Mr Maduro's government's main revenue source - oil exports. The sources said the US was focusing on what's been called the shadow fleet - tankers transporting sanctioned oil to China, the biggest buyer of crude from Venezuela and Iran. They said one shipper had already temporarily suspended three voyages transporting six million barrels of Venezuelan crude oil. \"The cargoes were just loaded and were about to start sailing to Asia,\" a source said. \"Now the voyages are cancelled and tankers are waiting off the Venezuelan coast as it's safer to do that.\""
    },
    {
        "title": "Trump's high seas raid may be followed by something much more severe",
        "description": "The pictures are striking - US forces sliding down ropes on to the deck of an oil tanker in the Caribbean.",
        "url": "https://news.sky.com/story/dawn-raid-on-the-high-seas-paints-vivid-portrait-of-trumps-approach-to-venezuela-13482003",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-maduro_7107044.jpg?20251211012824",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-12-11 01:18:00",
        "Headline": "The latest US operation against Venezuela will fuel speculation that airstrikes may soon follow - and Donald Trump hasn't ruled out land operations, either.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The pictures are striking - US forces sliding down ropes on to the deck of an oil tanker in the Caribbean. Their dawn operation painted a vivid portrait of the Trump administration's approach to the Maduro government. Officials framed it as the execution of a warrant on a vessel they linked to sanctioned oil from Venezuela and Iran. But the imagery of armed troops seizing control of the bridge was anything but routine.  Instead, it underscored the White House's preference for visible demonstrations of muscle over diplomacy. From Iran to North Korea, Trump has relied heavily on sanctions and show-of-strength tactics. Venezuela, long mired in economic collapse and political turmoil, is a prime target for that strategy. Critics argue that such high stakes on the high seas risk escalating tensions without offering a path to political transition in Caracas. By targeting an oil shipment, rather than another suspected drug boat, Washington has signalled its willingness to disrupt exports.  Trump seems determined to shut down the main source of funding for Nicolas Maduro's embattled government. Nine months ago, Trump imposed a 25% tariff on all goods imported into the US from any country buying oil or gas from Venezuela. This is more aggressive and will be viewed in Caracas as a direct threat to the country's economy and sovereignty. Read more: Is this what the beginning of a war looks like? The interception of the tanker raises more questions about international maritime law and the reach of US enforcement powers. In the space of four months, the US has bombed 23 boats, killing 87 people, accusing the occupants of being \"narcoterrorists\". This will fuel speculation that airstrikes could be imminent, Trump having posted two weeks ago, that he had closed the airspace."
    },
    {
        "title": "'Catastrophic', life-threatening, floods hitting Washington State, USA",
        "description": "Tens of thousands of people have been told to evacuate homes in Washington State, northwest America, to escape \"catastrophic\", life-threatening, floods.  ",
        "url": "https://news.sky.com/story/catastrophic-life-threatening-floods-hitting-washington-state-usa-13482050",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-snoqualmie-river-washington_7107177.jpg?20251211085954",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-11 08:53:00",
        "Headline": "Tens of thousands told to evacuate as governor, Bob Ferguson, declares a state-wide emergency,  warning that \"lives will be at stake in the coming days\".",
        "Content": " Tens of thousands of people have been told to evacuate homes in Washington State, northwest America, to escape \"catastrophic\", life-threatening, floods.   Days of relentless heavy rain have triggered rescues and road closures and the state's governor, Bob Ferguson, declared a state-wide emergency on Wednesday, warning that \"lives will be at stake in the coming days\". \"Catastrophic flooding is likely\" in many areas and the state is requesting rescue teams and boats, Mr Ferguson said, as rivers reached near historic levels. Heavy rain continued to fall over parts of the state on Thursday morning, and led to the suspension of Amtrak trains between Seattle and Vancouver. A large swathe of the Cascade mountains saw 4-6in of rain fall between late Tuesday and late Wednesday, the National Weather Service in Seattle said. Almost 7in was recorded in the Olympic Mountains. \"Approximately 100,000 people in Washington State have been advised to evacuate,\" Washington Emergency Management Division spokesperson Karina Shagren told CNN on Wednesday. Hundreds of National Guard troops are being sent in to help stricken communities. A major road - Interstate 90 east of Seattle - has been blocked by a landslide leaving vehicles trapped by tree trunks, branches, mud and standing water. The city of Mount Vernon, Washington, and upriver communities were given instructions to evacuate to higher ground as flooding is anticipated in the region, Mr Ferguson said on Wednesday. Read more from Sky News:Why did the US seize an oil tanker off the coast of Venezuela?UK rebuts Milei's claims about arms exports and Falkland Islands Hamilton, Rockport, Marblemount and Concrete are also being asked \"to evacuate to high ground as soon as possible,\" the governor said. More than a foot of rain is anticipated across higher parts of the Pacific Northwest. Rainfall reached 3.03in at the Olympia Regional Airport on Monday, breaking the previous record of 2.5in, Sky's US partner NBC News has reported. More than 17,000 customers in Washington State had lost electricity by Wednesday night, according to PowerOutage.us. In a valley leading out to the foothills of Mount Rainier southeast of Seattle, Pierce County sheriff's deputies on Wednesday rescued people from a mobile home park in Orting, including one man who waded through waist-deep water in Santa hat. Part of the town was ordered to evacuate over concerns about the Puyallup River's extremely high levels and upstream levees."
    },
    {
        "title": "Charlie Kirk shooting suspect makes first in-person court appearance",
        "description": "The man accused of killing right-wing influencer Charlie Kirk has appeared in person at court for the first time.",
        "url": "https://news.sky.com/story/charlie-kirk-shooting-suspect-makes-first-in-person-court-appearance-13482340",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tyler-robinson-charlie-kirk_7107753.jpg?20251211194929",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-11 19:21:00",
        "Headline": "Making his first in-person appearance at a Utah court, Tyler Robinson arrived with restraints on his wrists and ankles and wearing a dress shirt, tie and slacks.",
        "Content": "The man accused of killing right-wing influencer Charlie Kirk has appeared in person at court for the first time. Tyler Robinson, 22, from Utah, is charged with aggravated murder in relation to the shooting of Kirk on the Utah Valley University campus in Orem. Video of the incident showed Kirk, 31, and a staunch ally of Donald Trump, reaching up with his right hand after a gunshot was heard as blood came out from the left side of his neck. He died shortly after. Prosecutors plan to seek the death penalty.  On Wednesday's appearance at Fourth District Court in Provo, Utah, Robinson arrived in court with restraints on his wrists and ankles and wearing a dress shirt, tie and slacks. Read more: What we can learn about suspect from charging document According to the Associated Press, he smiled at family members sitting in the front row of the courtroom, where his mother teared up and wiped her eyes with a tissue. \n                  Incoming Oxford Union president George Abaraonye loses confidence vote sparked by Charlie Kirk comments - but disputes result\n                 \n                  Voting ends over future of Oxford Union president-elect after Charlie Kirk comment\n                 \n                  Obama and Schwarzenegger face off in major political row\n                 He made previous court appearances via video or audio feed from jail. The shooting happened during Kirk's \"prove me wrong\" series, which saw the father of two visit campuses and debate contentious subjects; in this case, he was discussing mass shootings. Prosecutors say the bullet which struck Kirk's neck \"passed closely to several other individuals\", including the person questioning him as part of the event. A charging document about Robinson from September includes incriminating texts sent between the alleged shooter and his roommate after Kirk's death. Read more from Sky News:Analysis: The real reason for Trump's Venezuela exploitsFBI release Luigi Mangione 'to-do list' before alleged assassination Judge Tony Graf also heard arguments on Wednesday about whether cameras and media should be allowed in the courtroom, with Robinson's lawyers and the Utah County Sheriff's Office asking for them to be banned. Mr Kirk's widow, Erika Kirk, has called for full transparency and said \"we deserve to have cameras in there\". The judge has already made allowances to protect Robinson's presumption of innocence before a trial, agreeing that the case has drawn \"extraordinary\" public attention."
    },
    {
        "title": "World Cup 2026 ticket ballot opens - here's what you need to know",
        "description": "The main ballot to secure tickets to next year's men's World Cup opened on Thursday.",
        "url": "https://news.sky.com/story/world-cup-2026-ticket-ballot-opens-today-heres-what-you-need-to-know-13482057",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-gianni-infantino_7107349.jpg?20251211122212",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:21:00",
        "Headline": "Nearly two million tickets have already been snapped up for next year's World Cup, with the main ballot opening today. Here's what you need to know.",
        "Content": "The main ballot to secure tickets to next year's men's World Cup opened on Thursday. It is the first chance fans have to nab tickets since last week's World Cup draw, which determined the group stages and nearly the full list of matchups, venues and times. FIFA says nearly two million tickets have already been snapped up through its first two phases of ticket release, but individuals did not have the benefit of knowing which teams would be playing at each site and at what time. Everything to know about World Cup 2026 Today's ballot will not guarantee tickets to the tournament - which is set to be the biggest in history - only that you are in the running to get your hands on some. Here's all you need to know. How will the ballot work? The application for the third phase of ticket release, known as the random selection draw, opened at 4pm UK time on 11 December. Here, fans will be able to submit applications for tickets to specific matches. Individuals will only be able to buy four tickets per-match and a total of 40 tickets for the entire tournament per-household. The application window will remain open until January 13, 2026. There is no advantage to applying early - all fixtures remain available throughout the entire period. Those wanting tickets will need to have a FIFA ID in advance, which can be created via FIFA.com/tickets. Once the window closes, FIFA will run a lottery to decide which applications are successful. The lucky fans will be notified by email in February and, if they have been allocated tickets, will be charged automatically. How much will tickets cost? FIFA is yet to confirm the final prices of tickets. The body previously said tickets will start from $60 (£45) in the group stage, with the most expensive tickets for the final reaching highs of $6,730 (£5,094). If true, it will unsurprisingly be way up from the range of $25 (£19) to $475 (£353) - the costs last time the US hosted the tournament in 1994. For the 2022 tournament in Qatar, tickets cost the US dollar equivalent of $69 to $1,607.  Prices for hospitality tickets are believed to be considerably more, ranging from $3,500 (£2,604) to $73,200 (£54,467) per person. As of 10 December, group stage matches involving Mexico cost more than $2,600 (£1,942) to get inside, Sky News' US partner network, NBC, reported, citing StubHub listings, while American and Canadian baseline prices were hovering around $1,100 (£821). The Football Supporters' Association's embassy for England fans said supporters who are allocated category 3 tickets, which they say is one of the cheapest options, will have to pay an estimated $4,700 (£3,510) to attend all matches should England reach the final. It adds for those having to apply for category 1 tickets, this would increase to more than $12,000 (£8,965).  How about dynamic pricing? Initially, FIFA suggested tickets would be sold using dynamic pricing, meaning fans would pay different prices according to demand. Variable pricing had never been used at a World Cup before, raising concerns about affordability. FIFA has now backed away from it, saying allocations would be set at a fixed price for the duration of the next ticket sales phase. The world football's governing body said in a statement to Sky News: \"FIFA can confirm ringfenced allocations are being set aside for specific fan categories, as has been the case at previous FIFA World Cups. These allocations will be set at a fixed price for the duration of the next ticket sales phase. \"The pricing model adopted for FIFA World Cup 26 reflects the existing market practice for major entertainment and sporting events within our hosts on a daily basis, soccer included.\" Are there other ways to get tickets? FA allocation Each nation in the World Cup expects to receive 8% of the tickets for its matches to sell to its own supporters. For England and Scotland, these will be made available to members of the England Supporters Travel Club (ESTC) and the Scotland Supporters Club (SSC). Both the ESTC and SSC ran their own registration of interest before individuals apply for tickets. This registration window closed for both clubs on 10 December at 11.59pm UK time. Fans will receive an email with an access code for the official FIFA portal, where they can apply for tickets from 15 December to 13 January. Resale marketplace FIFA has also created its own online marketplace where fans can resell tickets bought through other phases of the ticketing process. It says the resale marketplace is available to Canadian, American and international residents, while the FIFA Exchange Marketplace is intended for residents of Mexico. FIFA has also issued a warning to fans to be \"wary\" of unofficial websites purportedly selling tickets that aren't yet on the market, after Sky News discovered tickets already being sold for eye-watering prices by the platform Vivid Seats. First-come first-served Fans may be able to buy remaining tickets on a first-come first-served basis closer to the tournament, FIFA says. This is based on availability. What about visas? For those outside the US, Canada or Mexico, securing tickets is not enough to guarantee you will be at World Cup games. People travelling to the US or Canada will need to secure visas in order to make it to the tournament. Most tourists do not need a visa to travel to Mexico. For example, if travelling from the UK to America, Britons will need an ESTA for visits under 90 days, or a B-2 visa for longer stays. From the UK to Canada, Britons will typically need an Electronic Travel Authorisation (ETA), which allows visits for up to six months. FIFA has warned that any ticket holder who fails to obtain the necessary visa or travel authorisation, or is denied entry due to non-compliance with any requirements, will not be entitled to any form of compensation. Donald Trump announced in November that those who need visas to attend the World Cup will be able to go through a \"FIFA portal\" to help get their visa application and interview prioritised at the State Department. This will be known as the FIFA Prioritised Appointment Scheduling System, or FIFA PASS. US Secretary of State Marco Rubio said the administration had added 400 consular officers around the world to deal with increased demand for visas, with individuals still having to go through the same vetting, but will \"move up the queue\" in order to get correct travel documents in place on time for the tournament. Despite the new system, Mr Trump said he \"strongly\" encourages World Cup travellers to the US to apply for their visas \"right away\"."
    },
    {
        "title": "The real reason for Donald Trump's Venezuela exploits",
        "description": "Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs.",
        "url": "https://news.sky.com/story/the-real-reason-for-donald-trumps-venezuela-exploits-13482185",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oil-venezuela_7107432.jpg?20251211133920",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-12-11 13:40:00",
        "Headline": "The president has cited drugs as the reason for US action against Venezuela. But Sky's Ed Conway says there is an alternative economic explanation.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs. It is, he has said repeatedly, that country's part in the production and smuggling of illegal narcotics into America that lies behind the ratcheting up of forces in the Caribbean in recent weeks. But what if there's something else going on here too? What if this is really all about oil? In one respect this is clearly preposterous. After all, the United States is, by a country mile, the world's biggest oil producer. Venezuela is a comparative minnow these days, the 21st biggest producer in the world, its output having been depressed under the Chavez and then Maduro regimes. Why should America care about Venezuelan oil? Money latest: Urgent warning over tumble dryers For the answer, one needs to spend a moment - strange as this will sound - contemplating the chemistry of oil. Crude oil is, as the name suggests, quite crude. It's an organic compound, the product of ancient organisms that have been compressed and heated up under the earth's surface for hundreds of millions of years. And as such, crude oil is subtly different depending on the conditions under which those organisms were compressed. In some parts of the world, crude oil comes out of the ground as clear, flowing liquid. Sometimes it is green. Sometimes it is heavy, thick gloopy stuff. Oil producers have a word for these differing varieties: light, medium and heavy.  And here's the first thing you need to know. Most of America's refineries are set up to process the heavy stuff. In other words, if America is going to keep its cars fed with gasoline, it needs heavy, gloopy crude. And since it costs many, many billions of dollars to overhaul refineries, no-one particularly wants to do that anytime soon. Read more:Why did the US seize tanker off Venezuela? But the second thing you need to know is the vast majority of that oil produced in America, thanks to the shale revolution, is light crude. In other words, America's refineries are not compatible with most of the oil America produces. The upshot is that for all that America theoretically pumps more crude oil than it would ever need out of its own territories, it is still totally dependent on trade to meet its demands for heavy oil. Most American crude is exported overseas. And America imports well over 6,000 barrels of oil a day to feed its refineries in Texas and Louisiana with the heavy stuff they can digest. All of which brings us to Venezuela, because it is, alongside Canada and Russia, sitting on the world's biggest reserves of heavy oil. Right now, most American oil comes from Canada but were Donald Trump keen to wean himself off Canadian crude, he is well aware there is a vast resource of it sitting on the other side of the Caribbean for all those Texas and Louisiana refineries."
    },
    {
        "title": "The real reason for Donald Trump's Venezuela exploits",
        "description": "Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs.",
        "url": "https://news.sky.com/story/the-real-reason-for-donald-trumps-venezuela-exploits-13482185",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oil-venezuela_7107432.jpg?20251211133920",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-12-11 13:40:00",
        "Headline": "The president has cited drugs as the reason for US action against Venezuela. But Sky's Ed Conway says there is an alternative economic explanation.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Donald Trump wants you to know that there is one leading reason why he is bearing down militarily on Venezuela: drugs. It is, he has said repeatedly, that country's part in the production and smuggling of illegal narcotics into America that lies behind the ratcheting up of forces in the Caribbean in recent weeks. But what if there's something else going on here too? What if this is really all about oil? In one respect this is clearly preposterous. After all, the United States is, by a country mile, the world's biggest oil producer. Venezuela is a comparative minnow these days, the 21st biggest producer in the world, its output having been depressed under the Chavez and then Maduro regimes. Why should America care about Venezuelan oil? Money latest: Urgent warning over tumble dryers For the answer, one needs to spend a moment - strange as this will sound - contemplating the chemistry of oil. Crude oil is, as the name suggests, quite crude. It's an organic compound, the product of ancient organisms that have been compressed and heated up under the earth's surface for hundreds of millions of years. And as such, crude oil is subtly different depending on the conditions under which those organisms were compressed. In some parts of the world, crude oil comes out of the ground as clear, flowing liquid. Sometimes it is green. Sometimes it is heavy, thick gloopy stuff. Oil producers have a word for these differing varieties: light, medium and heavy.  And here's the first thing you need to know. Most of America's refineries are set up to process the heavy stuff. In other words, if America is going to keep its cars fed with gasoline, it needs heavy, gloopy crude. And since it costs many, many billions of dollars to overhaul refineries, no-one particularly wants to do that anytime soon. Read more:Why did the US seize tanker off Venezuela? But the second thing you need to know is the vast majority of that oil produced in America, thanks to the shale revolution, is light crude. In other words, America's refineries are not compatible with most of the oil America produces. The upshot is that for all that America theoretically pumps more crude oil than it would ever need out of its own territories, it is still totally dependent on trade to meet its demands for heavy oil. Most American crude is exported overseas. And America imports well over 6,000 barrels of oil a day to feed its refineries in Texas and Louisiana with the heavy stuff they can digest. All of which brings us to Venezuela, because it is, alongside Canada and Russia, sitting on the world's biggest reserves of heavy oil. Right now, most American oil comes from Canada but were Donald Trump keen to wean himself off Canadian crude, he is well aware there is a vast resource of it sitting on the other side of the Caribbean for all those Texas and Louisiana refineries."
    },
    {
        "title": "OpenAI bags Disney characters for Sora short video app",
        "description": "OpenAI has signed its first major licensing deal to bring well-known characters to life on its Sora video generation tool.",
        "url": "https://news.sky.com/story/openai-bags-disney-characters-for-sora-short-video-app-13482236",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-mickey-mouse-disneyland_6633730.jpg?20240720153238",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-11 15:10:00",
        "Headline": "OpenAI's boss says the licensing agreement shows how AI companies and creative leaders can work together responsibly to promote innovation.",
        "Content": "OpenAI has signed its first major licensing deal to bring well-known characters to life on its Sora video generation tool. The company said the agreement with Walt Disney was part of a push to ensure the rights of creators in the generative artificial intelligence (AI) space amid growing concerns over copyright, fakes and misinformation. It forms part of a $1bn Disney investment in OpenAI, that will see the entertainment firm roll out ChatGPT to its staff and grow its AI capabilities. Money latest: Urgent warning over tumble dryers The initial three-year licensing deal will allow Sora users to generate and share videos based on more than 200 Disney, Marvel, Pixar and Star Wars characters. These include Mickey Mouse, Cinderella and Luke Skywalker. Sora allows people to quickly create realistic clips based merely on text prompts. \n                  Apple's AI chief steps down as company falls behind in tech race\n                 \n                  Bigger than COVID? The graph that explains why AI is going to be so huge\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                  Disney and OpenAI said they were committed to responsible use of AI amid the backlash from critics who have pointed to widespread misuse of generative AI in the social media space - a practice known as AI slop. Some have depicted fake messages from celebrities and even used the dead. OpenAI CEO Sam Altman said: \"This agreement shows how AI companies and creative leaders can work together responsibly to promote innovation that benefits society, respect the importance of creativity, and help works reach vast new audiences. His counterpart at Disney, Bob Iger, added that the partnership would \"extend the reach of our storytelling through generative AI, while respecting and protecting creators and their works\". As part of the deal, some user-generated Sora videos will be made available on the Disney+ streaming service. Dan Coatsworth, head of markets at AJ Bell, said of the tie-up: \"It’s a win-win situation for Disney and OpenAI. Disney gets to deploy its beloved brands in the world of AI while keeping control of the intellectual property. \"Fans can use Disney characters to make videos and take social media content to another level. That could drive significant traffic to OpenAI’s Sora social media platform, turning a relatively unknown entity into a household name in a flash. \"As part owner of the business, Disney will be able to use the equity stake in OpenAI to ensure its characters are used in a controlled environment. \"It’s a significant step forward for the concept of fan fiction\", he concluded. "
    },
    {
        "title": "Daily Mail owner lines up NatWest to help fund £500m Telegraph bid",
        "description": "The owner of the Daily Mail is lining up one of Britain's biggest high street lenders to help bankroll its &#163;500m deal to buy The Daily Telegraph.",
        "url": "https://news.sky.com/story/daily-mail-owner-lines-up-natwest-to-help-fund-163500m-telegraph-bid-13482187",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-telegraph-daily-telegraph_7088252.jpg?20251122090200",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-11 13:47:00",
        "Headline": "One of Britain's biggest high street banks is in talks to lend a significant chunk of the purchase price that DMGT has agreed to pay to end the Telegraph's ownership hiatus, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of the Daily Mail is lining up one of Britain's biggest high street lenders to help bankroll its £500m deal to buy The Daily Telegraph. Sky News has learnt that DMGT has turned to its long-standing bank, NatWest Group, to lend a substantial chunk of the Telegraph purchase price. City sources said on Thursday that discussions between the two were still in progress. It was unclear how much of the consideration NatWest might finance, or how much equity DMGT intended to put up as part of the deal. Money latest: Urgent warning over tumble dryers Last month's announcement that DMGT was in exclusive talks to buy Telegraph Media Group achieved a long-standing ambition of the Mail proprietor, Lord Rothermere, to own the rival right-leaning newspaper. However, the transaction still needs to be formally submitted to the culture secretary, Lisa Nandy, who has effectively asked for details of the proposed deal by early next week. \n                  'Stop using it': Urgent safety warning issued for 85,000 tumble dryers | Money blog\n                 \n                  The real reason for Donald Trump's Venezuela exploits\n                 \n                  OpenAI bags Disney characters for Sora short video app\n                 Lengthy inquiries by the Competition and Markets Authority and Ofcom are also expected to follow. DMGT's exclusivity period came within days of a consortium led by RedBird Capital Partners abandoning its own deal amid opposition from within the Telegraph newsroom. NatWest's position as a principal lender would, in theory, be advantageous to Lord Rothermere, who will not want to be reliant on overseas financing for the deal. The DMGT owner had originally intended to acquire a minority stake of just under 10% in the Telegraph titles as part of the RedBird-led transaction. A previous deal proposed by a consortium including RedBird and the Abu Dhabi state-owned investment firm IMI collapsed after the government changed the law regarding foreign state ownership of national newspapers. \"I have long admired the Daily Telegraph,\" Lord Rothermere said last month. \"My family and I have an enduring love of newspapers and for the journalists who make them. \"The Daily Telegraph is Britain's largest and best quality broadsheet newspaper, and I have grown up respecting it. \"It has a remarkable history and has played a vital role in shaping Britain's national debate over many decades.\" If the deal is completed, it would bring the Telegraph newspapers under the same stable of ownership as titles including Metro, The i Paper and New Scientist. DMGT said in November that it planned \"to invest substantially in TMG with the aim of accelerating its international expansion\". \"It will focus particularly on the USA, where the Daily Mail is already successful, with established editorial and commercial operations.\" NatWest declined to comment."
    },
    {
        "title": "Burger King UK lands new backing from buyout firm Bridgepoint",
        "description": "The private equity backer of Burger King UK has injected millions of pounds of new funding as part of a deal which paves the way for their partnership to be extended into the 2040s.",
        "url": "https://news.sky.com/story/burger-king-uk-lands-new-backing-from-buyout-firm-bridgepoint-13482083",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-burger-king-russia_6646898.png?20240804072100",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-11 10:30:00",
        "Headline": "The buyout firm, which invested in fast food giant Burger King in 2017, has injected about £15m into the business in recent days with the promise of more funding to come, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of Burger King UK has injected millions of pounds of new funding as part of a deal which paves the way for their partnership to be extended into the 2040s. Sky News understands that Bridgepoint has invested a further £15m into the fast food giant in recent days, with a further sum - thought to be up to £20m - to be deployed over the next 18 months. The new funding has been committed as Burger King UK's Master Franchise Agreement with a subsidiary of Restaurant Brands International has been extended to 2044 in a deal which is said to align the interests of its various financial stakeholders more closely. Burger King's British operations comprise roughly 575 outlets, and employ approximately 12,000 people. In results released this week, Burger King UK said it had delivered a \"solid performance... amid sector headwinds\" in 2024. Revenue increased by 7% to £408.3m, with underlying earnings before interest, tax, depreciation and amortisation up 12% to £26m. The company also said it had completed a refinancing process, with the maturity of its bank facilities pushed out to March 2028. \n                  'Stop using it': Urgent safety warning issued for 85,000 tumble dryers | Money blog\n                 \n                  The real reason for Donald Trump's Venezuela exploits\n                 \n                  OpenAI bags Disney characters for Sora short video app\n                 Under the leadership of Alasdair Murdoch, its long-serving chief executive, Burger King plans to open roughly 30 new sites next year. It comes at a challenging time for the UK hospitality sector, with casual dining chains TGI Fridays and Leon both filing to appoint administrators in the last few days. Industry bosses say that last month's budget has piled fresh cost pressures on them. Bridgepoint declined to comment on the injection of new capital into Burger King UK."
    },
    {
        "title": "'New future achievable' at Grangemouth as two firms plan job creation",
        "description": "Two new projects on the site of a former oil refinery could create up to 460 new jobs in the coming years, with the help of cash from the UK and Scottish governments.",
        "url": "https://news.sky.com/story/new-future-achievable-at-grangemouth-as-two-firms-plan-job-creation-13482102",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-grangemouth-refinery_6425509.jpg?20251211113031",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-11 11:19:00",
        "Headline": "Biotech firm MiAlgae hopes to create 130 direct full-time jobs over the next five years and support 180 further posts, while Celtic Renewables could create up to 149 jobs by 2030.",
        "Content": "Two new projects on the site of a former oil refinery could create up to 460 new jobs in the coming years, with the help of cash from the UK and Scottish governments. Scottish Energy Secretary Gillian Martin said the announcements by two firms of plans to create jobs shows a \"long-term, new industrial future at Grangemouth is achievable\". Scottish biotech firm MiAlgae hopes to create 130 direct full-time jobs over the next five years - and support 180 further posts - by making fish-free Omega 3 supplements using leftover by-products from the whisky production process. With the proposals announced in the wake of the closure of what was Scotland's only oil refinery back in April, MiAlgae is being helped with £1.5m of funding from both governments. The UK government cash is coming from a £14.5m funding pot for the Grangemouth area announced by Chancellor Rachel Reeves as part of last month's budget. With the project also receiving Just Transition Funding from the Scottish government, MiAlgae can now construct its first commercial-scale manufacturing facility. MiAlgae founder and chief executive Douglas Martin said breaking ground at Grangemouth \"marks an exciting new chapter\" for his company. \n                  Scottish independence could 'reduce energy bills by more than a third', First Minister John Swinney says\n                 \n                  New record for wind-powered electricity in Britain\n                 \n                  Why US may soon have a real energy emergency\n                 He added: \"Our mission has always been to make a meaningful impact, tackling overfishing, reducing waste, and creating sustainable value from industrial by-products. \"This new facility is a huge step towards delivering that mission at scale, bringing new, high-quality green jobs to the local area, and helping Scotland lead the way in this exciting new biotech industry.\" Meanwhile, Celtic Renewables could create up to 149 jobs by 2030 after it received £6.23m of cash from Holyrood ministers towards the planning and construction of a new £120m industrial-scale biorefinery. This work will see waste products from the food, drink and farming sectors converted into acetone, butanol and ethanol - chemicals used in everyday items such as cleaning products and nail varnish remover. Celtic Renewables currently operates a commercial demonstrator biorefinery on a 2.5 acre site at Grangemouth. Mark Simmers, the firm's chief executive, said: \"This investment is a landmark moment for green technologies and is a significant recognition of the work Celtic Renewables is doing for Scotland's green economy and the future of Grangemouth. \"With this support from Scottish government, we can progress our plans to upscale our production capabilities in a large-scale biorefinery with 10 times the capacity of our current facility, creating new green job opportunities, to meet the fast-growing demand for low-carbon, bio-based chemicals.\" Read more from Sky News:Jobs at risk as fast food chain moves to cut restaurantsBurger King UK lands new backing from buyout firm Scottish Secretary Douglas Alexander said the £1.5m investment will \"support MiAlgae's innovative green technology and boost jobs and investment in Grangemouth\". He added: \"The UK government is backing Grangemouth's future with real investment and a clear plan. \"We promised to secure the site's long-term future and create good jobs, and that's exactly what we're doing - supporting new industries, creating opportunities, and ensuring this site remains a vital part of Scotland's industrial heartland for generations to come.\" Scottish government funding of £600,000 is also being given to Scottish Enterprise to support work to ensure Grangemouth is seen as attractive for new investors. Speaking about the proposals from MiAlgae and Celtic Renewables, MSP Ms Martin said: \"Today's announcement will help to support the creation of up to 460 roles directly and across the supply chain in Scotland, and help to highlight the wide range of viable alternatives for Grangemouth. \"They demonstrate that a long-term, new industrial future at Grangemouth is achievable, and will be vital to support the local workforce and community. \"This funding is only the start of the Scottish government's support to help safeguard Grangemouth's role as a leading industrial cluster, and ensure the site continues to support our economy through new, green investment opportunities.\""
    },
    {
        "title": "Resident doctors in England consider whether new offer is enough to call off five-day strike in run-up to Christmas",
        "description": "Doctors in England planning to go on strike in the run-up to Christmas are considering a new offer from the government to end the long-running dispute.",
        "url": "https://news.sky.com/story/resident-doctors-in-england-consider-whether-new-offer-is-enough-to-call-off-five-day-strike-in-run-up-to-christmas-13482036",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-st-thomas-hospital_7082063.jpg?20251114143359",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-11 07:34:00",
        "Headline": "The new government deal does not address resident doctors' demand for a 26% salary rise over the next few years. The British Medical Association is consulting its members and will announce its decision on Monday, two days before a five-day walkout is due to start.",
        "Content": " Doctors in England planning to go on strike in the run-up to Christmas are considering a new offer from the government to end the long-running dispute. Resident doctors, formerly junior doctors, will walk out from 7am on 17 December until 7am on 22 December. Health Secretary Wes Streeting has appealed to doctors to accept the government's latest package.   The British Medical Association (BMA) said it will consult members by surveying them online on whether or not the deal from the government is enough to call off next week's walkout. The poll will close on Monday - just two days before the five-day strike is set to start. The union said the new offer includes new legislation to ensure UK medical graduates are prioritised for speciality training roles. It also includes an increase in the number of speciality training posts over the next three years - from 1,000 to 4,000 - with more to start in 2026. Funding for mandatory Royal College examination and membership fees for resident doctors is also part of the deal. It does not address resident doctors' demand for a 26% salary rise over the next few years to make up for the erosion in their pay in real terms since 2008 - this is on top of a 28.9% increase they have had over the last three years. Mr Streeting warned a resident doctors' strike over Christmas would have a \"much different degree of risk\" than previous walkouts. It coincides with pressures facing the NHS, with health chiefs raising concerns over a \"tidal wave\" of illness and a \"very nasty strain of flu\". A new strain of the flu virus is thought to be much more infectious than previous strains and has already led to a record number of patients needing urgent hospital care. The union's mandate to strike is set to expire shortly, but Mr Streeting has offered to extend it to allow the medics to take action later in January if they reject his offer. He called the union's decision not to take it up \"inexplicable\". Last week, NHS England chief executive Sir Jim Mackey branded the decision by doctors to strike as \"something that feels cruel\" and which is \"calculated to cause mayhem at a time when the service is really pulling all the stops out to try and avoid that and keep people safe\". Read more from Sky News:US accused of 'piracy'Flights diverted in Moscow  BMA resident doctors committee chair Dr Jack Fletcher said the latest government offer \"is the result of thousands of resident doctors showing that they are prepared to stand up for their profession and its future\". \"It should not have taken strike action, but make no mistake: it was strike action that got us this far,\" he said. \"We have forced the government to recognise the scale of the problems and to respond with measures on training numbers and prioritisation. \"However, this offer does not increase the overall number of doctors working in England and does nothing to restore pay for doctors, which remains well within the government's power to do.\""
    },
    {
        "title": "UK rebuts Argentina president Milei's claims about arms exports and Falkland Islands",
        "description": "The government has denied claims from Argentina's president that the two countries are in talks about lifting an arms export ban that has been in place since the Falklands War.",
        "url": "https://news.sky.com/story/uk-rebuts-mileis-claims-about-arms-exports-and-falklands-13482004",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-javier-milei-argentina_7107058.jpg?20251211051427",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-11 03:36:00",
        "Headline": "A government spokesman said there are \"no specific talks\" happening after Argentinian president Javier Milei told The Daily Telegraph that negotiations with Britain were under way to lift weapons export restrictions. ",
        "Content": "The government has denied claims from Argentina's president that the two countries are in talks about lifting an arms export ban that has been in place since the Falklands War. A spokesman said there are \"no specific talks\" taking place, after Javier Milei told The Daily Telegraph negotiations with Britain were under way to lift weapons export restrictions. The government's policy since the Falklands War more than 40 years ago has been weapons with British parts are not allowed to be exported to Argentina if they are judged to \"enhance Argentine military capability\". \"There are no world powers without military power,\" Mr Milei told the newspaper, adding: \"There is no country that counts in the international context if they can't defend their borders.\" He also said he wanted to see the Falklands handed to Argentina via diplomatic means after previously saying he would not relinquish the claim to sovereignty over the islands, but wouldn't seek conflict with the UK. A government spokesman rebutted this, too, saying: \"Sovereignty of the Falkland Islands is not up for negotiation, and we will defend its right to self-determination. \"In 2013, the islanders held a referendum on their future, with an overwhelming majority choosing to remain part of the UK.\" But he added: \"More broadly, we look forward to deepening our co-operation with Argentina across areas including trade, science, and culture to deliver growth for the British people.\" Milei wants Starmer meeting Mr Milei said he plans to come to Britain in April or May next year and would like to meet with Sir Keir Starmer and Reform's Nigel Farage. Argentina's cost-cutting agenda has gone down well with Mr Farage and Tory leader Kemi Badenoch, and helped inspire the Trump administration's Department of Government Efficiency under Elon Musk. If he makes the trip, it would make him the first Argentinian president to visit the UK since 1998. Read more from Sky News:US accused of 'piracy' after troops storm tankerHow Nobel Peace Prize winner emerged from hiding  Mr Milei's comments come after Falkland Islanders told Sky News in March that the threat posed by Argentina \"has not changed\". Since the end of the conflict, there has been a UK military presence on the islands as a deterrent to Argentina not to exercise its continued claim over the Falklands. A 2,000-strong garrison of troops and a squadron of fighter jets and transport aircraft based around the main airport at Mount Pleasant. But Leona Roberts, a member of the Falkland Islands legislative assembly, said: \"Argentina is always a bit of a shadow over our shoulder.\""
    },
    {
        "title": "First Minister John Swinney backs Justice Secretary Angela Constance amid threat of no confidence vote in grooming gangs row",
        "description": "John Swinney is facing calls to sack his justice secretary, with the Scottish Conservatives and Scottish Labour vowing to bring a vote of no confidence against her amid claims she \"brazenly misrepresented\" a leading child abuse expert.",
        "url": "https://news.sky.com/story/first-minister-john-swinney-backs-justice-secretary-angela-constance-amid-threat-of-no-confidence-vote-in-grooming-gangs-row-13482132",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-angela-constance-snp_7099682.jpg?20251211123142",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-11 12:29:00",
        "Headline": "The Scottish Conservatives and Scottish Labour have vowed to bring a vote of no confidence against MSP Angela Constance.",
        "Content": "John Swinney is facing calls to sack his justice secretary, with the Scottish Conservatives and Scottish Labour vowing to bring a vote of no confidence against her amid claims she \"brazenly misrepresented\" a leading child abuse expert. However, the first minister is standing by MSP Angela Constance in the wake of comments she made about Professor Alexis Jay. During First Minister's Questions on Thursday, Scottish Tory leader Russell Findlay insisted Ms Constance had broken the ministerial code. He said: \"If John Swinney won't sack the justice secretary, we will give parliament the chance to have its say with a vote of no confidence.\" Scottish Labour leader Anas Sarwar accused Mr Swinney of \"defending the indefensible\" as he too urged him to sack his \"untrustworthy and incompetent\" justice secretary. Mr Sarwar said: \"This morning I have lodged a motion of no confidence in justice secretary Angela Constance. \"It is clear that she misrepresented Professor Alexis Jay on an issue as serious as grooming gangs and misled this parliament. \n                  Scarlett was 14 - groomed and trafficked in Manchester to be raped by dozens of men\n                 \n                  Prey: Giving a voice to the survivors of grooming gangs \n                 \n                  Scottish government orders review of grooming gangs evidence amid calls for a public inquiry\n                 \"She has had repeated opportunities to apologise and correct the record, but has failed to do so. \"It is now clear that she cannot stay in her position. She must resign, or John Swinney must sack her.\" When she rejected calls for an inquiry into grooming gangs in September, Ms Constance told MSPs Prof Jay agreed with her that such a probe was not needed. But emails made public by the Scottish government on Wednesday revealed the professor - who led the Independent Inquiry into Child Sexual Exploitation in Rotherham in 2014 - later contacted Ms Constance to say she would \"appreciate\" her position \"being clarified\". Prof Jay added that her comments quoted by Ms Constance at Holyrood had \"nothing to do\" with the situation in Scotland. Mr Findlay accused Ms Constance of having \"twisted a statement about England to deny victims an inquiry here in Scotland\". He said: \"The justice secretary brazenly misrepresented a leading child abuse expert in order to block a grooming gang inquiry in Scotland. \"The justice secretary misrepresented an expert, then denied doing so when asked by journalists.\" 👉 Listen to Sky News Daily on your podcast app 👈 He said Ms Constance has failed to correct Holyrood's official record, adding she has \"not even apologised\". Mr Findlay stated: \"Why isn't it obvious to John Swinney that she has broken the ministerial code?\" Read more:Scottish government orders review of grooming gangs evidence Mr Swinney claimed Ms Constance \"was making a general comment\" on the situation when MSPs debated the Victims, Witnesses and Justice Reform (Scotland) Bill. Ms Constance's remarks were a \"reflection of the general comments that were being made on the issues at that time\", he added. The SNP leader said his government is \"taking forward the essential work which is necessary to make a judgement about whether a separate grooming gangs inquiry is required\". He explained this is needed as \"the view that has been expressed to us is that the evidence base is not sufficient to take such a decision at this time\". He also said the Scottish Child Abuse Inquiry, which the government established in 2015 to examine abuse in care settings, could also consider issues linked to grooming. The first minister stressed the \"government has to take care to make sure we properly respect the independent inquiry we have established by statute, which has the power to look at many of these issues\". The Scottish Liberal Democrats later said they would vote against Ms Constance if a no confidence debate is held. Party leader Alex Cole-Hamilton said: \"We don't have confidence in Angela Constance to continue as justice secretary. \"Sometimes in politics people get things wrong, but the decent thing to do is be upfront when that happens. \"After misrepresenting a respected expert, Angela Constance should have apologised to Professor Alexis Jay and been straight with parliament. She didn't, so this is a mess of her own creation.\""
    },
    {
        "title": "Nigel Farage's former school responds to claims he made racist comments as a student",
        "description": "Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\".",
        "url": "https://news.sky.com/story/nigel-farages-former-school-responds-to-claims-he-made-racist-comments-as-student-13482312",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform-uk_7107685.jpg?20251211182414",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-12-11 17:40:00",
        "Headline": "Dulwich College says the alleged behaviour attributed to Nigel Farage is \"wholly incompatible with the values the College holds\". Reform UK says this is a \"witch hunt\".",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Dulwich College has said allegations that Nigel Farage made racist and antisemitic comments to fellow pupils at the school are \"profoundly distressing\" and \"entirely at odds with the Dulwich College of today\". In the first reported statement from the school about the accusations - which date from 1970s - current master Robert Milne wrote \"such behaviour is wholly incompatible with the values the College holds\". \"What we can unequivocally state is that the behaviours described are entirely at odds with the Dulwich College of today,\" he continued The comments come in a letter to former Dulwich pupil Jean-Pierre Lihou. Mr Lihou, 61, has alleged the current Reform UK leader sang antisemitic songs to Jewish schoolmates and \"had a big issue with anyone called Patel\".  Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". \n                  Reform UK denies Nigel Farage broke electoral law\n                 \n                  Millionaire former Tory donor defects to Reform\n                 \n                  Nigel Farage racism allegations are deeply shocking - but will they deter voters?\n                 Nigel Farage said: \"I have not met or spoken to this master. So I am surprised by his uninformed comments in response to claims from nearly 50 years ago from politically motivated actors. \"If he is interested, I can show him the many messages that I have received from fellow pupils, including Jewish ones, that entirely contradict these allegations.\" A spokesperson for Reform UK said: \"This witch hunt is merely an attempt to discredit Reform and Nigel Farage. \"Instead of debating Reform on the substance of our ideas and policies, the left-wing media and deeply unpopular Labour Party are now using 50-year-old smears in a last act of desperation. \"The British public see right through it.\" The letter also says the college has avoided making any public statements \"to protect the college's reputation in the long term\". \"This should not be interpreted as indifference: safeguarding the college's good name and upholding its values are of paramount importance to us,\" it continues. Mr Lihou told Sky News he cautiously welcomed the letter written to him from the master and said he understands why the college wasn't willing to unequivocally condemn the allegations against the Reform leader directly. \"Dulwich College has been clear that such accusations are very much at odds with the values of the school,\" he said. He added: \"Why can Mr Farage not accept that approaching 30 people [who] have lasting memories from him as a 13-year-old to an adult that he should unreservedly apologise for?\" Sky News has contacted Dulwich College for a comment."
    },
    {
        "title": "NHS facing 'worst case scenario' December amid 'super flu' surge",
        "description": "NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\".",
        "url": "https://news.sky.com/story/nhs-facing-worst-case-scenario-december-amid-super-flu-surge-13482068",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nhs-hospital-ward_7107556.jpg?20251211155252",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-11 09:40:00",
        "Headline": "The record-breaking demand on hospitals, A&Es and ambulance services coincides with a resident doctors' strike from 17 to 22 December – sparking fears of major disruption for patients in the run-up to Christmas.",
        "Content": " NHS England has warned the health service is facing a \"worst case scenario\" December with a surge of \"super flu\". The warning comes as new figures revealed the number of people in hospital with flu have increased by more than half in just one week. Catch up as it happened: NHS warns of 'worst-case scenario' as 'super flu' surges Latest figures show: • An average of 2,660 patients were in hospital per day with flu last week • This is the highest ever for this time of year and up 55% on last week • At this point last year the number stood at 1,861 patients, while in 2023 it was just 402  Health service bosses are warning the number of flu patients in hospital has already increased sharply since the week covered by this data - with no peak in sight. Read more: Why is flu season worse this year?   Virus outbreaks coincide with doctors' strikes Weekly flu numbers in England peaked at 5,408 patients last winter and reached 5,441 over the winter of 2022/23, the highest level since the pandemic.  Alongside rocketing flu, the number of norovirus patients in hospital has also risen by 35%. The NHS is now warning winter viruses are starting to \"engulf hospitals\". Demand for A&Es and ambulance services is also soaring. New monthly figures show A&E attendances were a record for November at 2.35 million - more than 30,000 higher than November 2024. In addition, there were 48,814 more ambulance incidents (802,525) compared with last year (753,711). Some hospitals across the country have asked staff, patients and visitors to wear face masks to cut the spread of flu, while others have gone in and out of critical incident status due to the high number of people attending A&E. The record-breaking demand on the NHS coincides with a resident doctors' strike from 17 to 22 December over pay and jobs - sparking fears of major disruption for patients in the run up to Christmas. People are being advised to attend any planned appointments scheduled during the strikes unless they have been contacted to reschedule.  Flu vaccinations on the up... who can get one? The NHS is urging anyone eligible to get their flu vaccination to help prevent them getting seriously ill. Latest figures show more than 17.4 million people have been vaccinated so far this year, more than 381,000 higher than last year. You can get it if you: • Are 65 or over in England, Scotland, Wales and Northern Ireland • Are pregnant • Live in a care home • Are the main carer for an older or disabled person, or receive carer's allowance • Live with someone who has a weakened immune system • Are a frontline health and social care worker • Are of school age • Have certain medical conditions (the NHS has a full list) Wes Streeting, the health secretary, warned of a \"tidal wave of flu tearing through our hospitals\". \"We are working with the NHS to make sure it is able to cope with this as best as possible,\" he said.  Health correspondent NHSE press releases can be prone to hyperbole: a \"tsunami of infections, worst case scenarios\" and \"tidal wave of flu surging through hospitals\" are recent examples. But the health service's headline writers can be allowed this excess right now. The latest flu numbers are bad. Really bad and could get worse. One recent projection was 8,000 patients, before this wave subsides. But that's where the problem lies. There is no peak in sight. We know flu season has come early. It's going to last longer. But there's uncertainty over when we expect to see infections falling. Hospitals are at capacity. Most of those receiving care are elderly or have underlying health conditions. But younger, fitter people can't afford to be complacent. This is a particularly nasty strain that is highly infectious. Nobody is immune. Except those people who have protected themselves with a vaccine. Warning 'extremely challenging few weeks ahead' Professor Meghana Pandit, NHS national medical director, warned the health service faces \"an extremely challenging few weeks ahead\" with \"staff being pushed to the limit\". She said: \"With record demand for A&E and ambulances and an impending resident doctors' strike, this unprecedented wave of super flu is leaving the NHS facing a worst-case scenario for this time of year - with staff being pushed to the limit to keep providing the best possible care for patients. \"The numbers of patients in hospital with flu is extremely high for this time of year. Even worse, it continues to rise and the peak is not in sight yet, so the NHS faces an extremely challenging few weeks ahead.\" She added: \"We have prepared earlier for winter than ever before, and stress-tested services to ensure people have a range of ways to get the help they need and avoid needing to go to A&E. \"For non-life-threatening care, people should call NHS 111 or use 111 online, which can direct you to the most appropriate place, and use A&E and 999 for life threatening conditions and serious injuries.\"  Read more from Sky News:US accused of 'piracy'Flights diverted in Moscow Mr Streeting has offered the British Medical Association (BMA) a last-minute deal in the hope doctors will call off the walkout, which starts next Wednesday. The doctors' union has agreed to put the offer to members over the coming day, and is expected to announced a decision on Monday, just two days before the planned strike. The offer includes a fast expansion of specialist training posts as well as covering out-of-pocket expenses such as exam fees, but does not include extra pay.    "
    },
    {
        "title": "'New future achievable' at Grangemouth as two firms plan job creation",
        "description": "Two new projects on the site of a former oil refinery could create up to 460 new jobs in the coming years, with the help of cash from the UK and Scottish governments.",
        "url": "https://news.sky.com/story/new-future-achievable-at-grangemouth-as-two-firms-plan-job-creation-13482102",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-grangemouth-refinery_6425509.jpg?20251211113031",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-11 11:19:00",
        "Headline": "Biotech firm MiAlgae hopes to create 130 direct full-time jobs over the next five years and support 180 further posts, while Celtic Renewables could create up to 149 jobs by 2030.",
        "Content": "Two new projects on the site of a former oil refinery could create up to 460 new jobs in the coming years, with the help of cash from the UK and Scottish governments. Scottish Energy Secretary Gillian Martin said the announcements by two firms of plans to create jobs shows a \"long-term, new industrial future at Grangemouth is achievable\". Scottish biotech firm MiAlgae hopes to create 130 direct full-time jobs over the next five years - and support 180 further posts - by making fish-free Omega 3 supplements using leftover by-products from the whisky production process. With the proposals announced in the wake of the closure of what was Scotland's only oil refinery back in April, MiAlgae is being helped with £1.5m of funding from both governments. The UK government cash is coming from a £14.5m funding pot for the Grangemouth area announced by Chancellor Rachel Reeves as part of last month's budget. With the project also receiving Just Transition Funding from the Scottish government, MiAlgae can now construct its first commercial-scale manufacturing facility. MiAlgae founder and chief executive Douglas Martin said breaking ground at Grangemouth \"marks an exciting new chapter\" for his company. \n                  Scottish independence could 'reduce energy bills by more than a third', First Minister John Swinney says\n                 \n                  New record for wind-powered electricity in Britain\n                 \n                  Why US may soon have a real energy emergency\n                 He added: \"Our mission has always been to make a meaningful impact, tackling overfishing, reducing waste, and creating sustainable value from industrial by-products. \"This new facility is a huge step towards delivering that mission at scale, bringing new, high-quality green jobs to the local area, and helping Scotland lead the way in this exciting new biotech industry.\" Meanwhile, Celtic Renewables could create up to 149 jobs by 2030 after it received £6.23m of cash from Holyrood ministers towards the planning and construction of a new £120m industrial-scale biorefinery. This work will see waste products from the food, drink and farming sectors converted into acetone, butanol and ethanol - chemicals used in everyday items such as cleaning products and nail varnish remover. Celtic Renewables currently operates a commercial demonstrator biorefinery on a 2.5 acre site at Grangemouth. Mark Simmers, the firm's chief executive, said: \"This investment is a landmark moment for green technologies and is a significant recognition of the work Celtic Renewables is doing for Scotland's green economy and the future of Grangemouth. \"With this support from Scottish government, we can progress our plans to upscale our production capabilities in a large-scale biorefinery with 10 times the capacity of our current facility, creating new green job opportunities, to meet the fast-growing demand for low-carbon, bio-based chemicals.\" Read more from Sky News:Jobs at risk as fast food chain moves to cut restaurantsBurger King UK lands new backing from buyout firm Scottish Secretary Douglas Alexander said the £1.5m investment will \"support MiAlgae's innovative green technology and boost jobs and investment in Grangemouth\". He added: \"The UK government is backing Grangemouth's future with real investment and a clear plan. \"We promised to secure the site's long-term future and create good jobs, and that's exactly what we're doing - supporting new industries, creating opportunities, and ensuring this site remains a vital part of Scotland's industrial heartland for generations to come.\" Scottish government funding of £600,000 is also being given to Scottish Enterprise to support work to ensure Grangemouth is seen as attractive for new investors. Speaking about the proposals from MiAlgae and Celtic Renewables, MSP Ms Martin said: \"Today's announcement will help to support the creation of up to 460 roles directly and across the supply chain in Scotland, and help to highlight the wide range of viable alternatives for Grangemouth. \"They demonstrate that a long-term, new industrial future at Grangemouth is achievable, and will be vital to support the local workforce and community. \"This funding is only the start of the Scottish government's support to help safeguard Grangemouth's role as a leading industrial cluster, and ensure the site continues to support our economy through new, green investment opportunities.\""
    },
    {
        "title": "OpenAI bags Disney characters for Sora short video app",
        "description": "OpenAI has signed its first major licensing deal to bring well-known characters to life on its Sora video generation tool.",
        "url": "https://news.sky.com/story/openai-bags-disney-characters-for-sora-short-video-app-13482236",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-mickey-mouse-disneyland_6633730.jpg?20240720153238",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-11 15:10:00",
        "Headline": "OpenAI's boss says the licensing agreement shows how AI companies and creative leaders can work together responsibly to promote innovation.",
        "Content": "OpenAI has signed its first major licensing deal to bring well-known characters to life on its Sora video generation tool. The company said the agreement with Walt Disney was part of a push to ensure the rights of creators in the generative artificial intelligence (AI) space amid growing concerns over copyright, fakes and misinformation. It forms part of a $1bn Disney investment in OpenAI, that will see the entertainment firm roll out ChatGPT to its staff and grow its AI capabilities. Money latest: Urgent warning over tumble dryers The initial three-year licensing deal will allow Sora users to generate and share videos based on more than 200 Disney, Marvel, Pixar and Star Wars characters. These include Mickey Mouse, Cinderella and Luke Skywalker. Sora allows people to quickly create realistic clips based merely on text prompts. \n                  Apple's AI chief steps down as company falls behind in tech race\n                 \n                  Bigger than COVID? The graph that explains why AI is going to be so huge\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                  Disney and OpenAI said they were committed to responsible use of AI amid the backlash from critics who have pointed to widespread misuse of generative AI in the social media space - a practice known as AI slop. Some have depicted fake messages from celebrities and even used the dead. OpenAI CEO Sam Altman said: \"This agreement shows how AI companies and creative leaders can work together responsibly to promote innovation that benefits society, respect the importance of creativity, and help works reach vast new audiences. His counterpart at Disney, Bob Iger, added that the partnership would \"extend the reach of our storytelling through generative AI, while respecting and protecting creators and their works\". As part of the deal, some user-generated Sora videos will be made available on the Disney+ streaming service. Dan Coatsworth, head of markets at AJ Bell, said of the tie-up: \"It’s a win-win situation for Disney and OpenAI. Disney gets to deploy its beloved brands in the world of AI while keeping control of the intellectual property. \"Fans can use Disney characters to make videos and take social media content to another level. That could drive significant traffic to OpenAI’s Sora social media platform, turning a relatively unknown entity into a household name in a flash. \"As part owner of the business, Disney will be able to use the equity stake in OpenAI to ensure its characters are used in a controlled environment. \"It’s a significant step forward for the concept of fan fiction\", he concluded. "
    }
]