[
    {
        "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
        "description": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences.",
        "url": "https://news.sky.com/story/labour-suspends-mp-dan-norris-after-arrest-13342856",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dan-norris-labour_6877329.jpg?20250405183946",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-05 17:24:00",
        "Headline": "Mr Norris, the MP for North East Somerset and Hanham, has been suspended by the Labour Party. ",
        "Content": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences. A Labour Party spokesperson said: \"Dan Norris MP was immediately suspended by the Labour Party upon being informed of his arrest. \"We cannot comment further while the police investigation is ongoing.\" Police said a man in his 60s had been arrested on Friday on suspicion of sexual offences against a girl, rape, child abduction and misconduct in a public office. Sky News has contacted Mr Norris for comment. Mr Norris, 65, defeated Jacob Rees-Mogg to win the new seat of North East Somerset and Hanham in last year's general election. He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports. Avon and Somerset Police said in a statement: \"In December 2024, we received a referral from another police force relating to alleged non-recent child sex offences having been committed against a girl. \"Most of the offences are alleged to have occurred in the 2000s, but we're also investigating an alleged offence of rape from the 2020s. \"An investigation, led by officers within Operation Bluestone, our dedicated rape and serious sexual assault investigation team, remains ongoing and at an early stage. \"The victim is being supported and given access to any specialist help or support she needs. \"A man, aged in his 60s, was arrested on Friday (April 4) on suspicion of sexual offences against a girl (under the Sexual Offences Act 1956), rape (under the Sexual Offences Act 2003), child abduction and misconduct in a public office. He's been released on conditional bail for enquiries to continue. \"This is an active and sensitive investigation, so we'd respectfully ask people not to speculate on the circumstances so our enquiries can continue unhindered.\" Mr Norris first entered Parliament when Tony Blair came to power in 1997 and served as the Wansdyke MP until 2010. He was an assistant whip under Mr Blair and served as a junior minister under Gordon Brown. Mr Norris has also been West of England mayor since 2021 but is due to step down ahead of May's local elections. A spokesman for the League Against Cruel Sports, a UK-based animal welfare charity which campaigns to end sports such as fox hunting and game bird shooting, confirmed he had stepped down from his role. \"The charity cannot comment further while an investigation is ongoing,\" a statement said."
    },
    {
        "title": "Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states",
        "description": "Thousands of people gathered in various cities across the US as protests against Donald Trump and Elon Musk took place in all 50 states on Saturday.",
        "url": "https://news.sky.com/story/thousands-protest-against-donald-trump-and-elon-musk-at-rallies-in-all-50-us-states-13343002",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-washington-trump-protest_6877496.jpg?20250405220504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:08:00",
        "Headline": "The \"Hands Off!\" protests were against the Trump administration's handling of government downsizing, human rights and the economy, among other issues.",
        "Content": "Thousands of people gathered in various cities across the US as protests against Donald Trump and Elon Musk took place in all 50 states on Saturday. Around 1,200 demonstrations were planned in locations including Washington DC, New York City and West Palm Beach, Florida - just miles away from where the US president has this weekend played golf. The \"Hands Off!\" protests were against the Trump administration's handling of government downsizing, human rights and the economy, among other issues. In Washington DC, protesters streamed on the grass in front of the Washington Monument, where one person carried a banner which read: \"Make democracy great again.\" Another protester took aim at Mr Trump's handling of Russia and Ukraine, with a placard that read: \"Stop Putin's puppets from destroying America.\" Tesla boss Mr Musk also featured on many signs due to his role in controversial government cuts as head of the newly created Department of Government Efficiency (DOGE). Terry Klein, a retired biomedical scientist, said she drove to the rally to protest Mr Trump's policies on \"everything from immigration to the DOGE stuff to the tariffs this week, to education\". \n                  Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'\n                 \n                  Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 \"I mean, our whole country is under attack, all of our institutions, all the things that make America what it is,\" she added. Some at the various protests carried Ukrainian flags, while others sported rainbow attire and waved rainbow flags in support of the LGBTQ+ community. Other protesters wore Palestinian keffiyeh scarves and carried \"Free Palestine\" signs. News correspondent It was built to honour George Washington, a founding father of the United States. And in the shadow of the 555ft Washington Monument, protestors were refusing to accept Donald Trump’s policies lying down. \"Stand tall,\" they chanted, again and again. \"In every city, stand tall. In every state, stand tall. In truth, stand tall. In justice, stand tall.\" Those words, shouted by thousands on the city’s iconic mall, were reinforced by the words on their placards and t-shirts. A minister, wearing a t-shirt with 'Troublesome Priest' printed on it, told me she found what was happening in the US government \"appalling and immortal\". One man said he had won the long-distance award, having travelled 2,750 miles from Hawaii for the protest. \"I finally reached a breaking point,\" he added. \"I couldn’t take it anymore.\"  Another woman said: \"We have to speak up, we have to act, we have to do something, because this is not America.\" I asked her what she would say to those who argue the people did speak when they elected Donald Trump as president. She replied: \"Some people have spoken and then some people have not and those of us that have not, we need to speak now.\"  Thousands marched in New York City's midtown Manhattan and in Boston, Massachusetts, while hundreds gathered in the sunshine outside the Utah State Capitol building in Salt Lake City, and in the rain outside the Statehouse in Columbus, Ohio. 👉 Follow Trump 100 on your podcast app 👈 Mr Trump - who shook financial markets with his tariffs announcement this week - spent the day in Florida, playing a round of golf before returning to his Mar-a-Lago residence. Some four miles from Mar-a-Lago, more than 400 people gathered - and drivers honked their horns in support of protesters who held up signs including one which read: \"Markets tank, Trump golfs.\" The White House has said Mr Trump plans to go golfing again on Sunday."
    },
    {
        "title": "IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked",
        "description": "The IDF has admitted to mistakenly identifying a convoy of aid workers as a threat &#8211; following the emergence of a video which proved their ambulances were clearly marked when Israeli troops opened fire on them. ",
        "url": "https://news.sky.com/story/idf-admits-mistakenly-identifying-gaza-aid-workers-as-threat-after-video-of-attack-showed-ambulances-were-marked-13342874",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-aid-workers_6876575.jpg?20250405094624",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-05 17:48:00",
        "Headline": "The Israeli military originally claimed the vehicles did not have any headlights or emergency signals and were therefore targeted as they looked \"suspicious\".",
        "Content": " The IDF has admitted to mistakenly identifying a convoy of aid workers as a threat – following the emergence of a video which proved their ambulances were clearly marked when Israeli troops opened fire on them.  The bodies of 15 aid workers - including eight medics working for the Palestine Red Crescent Society (PRCS) - were found in a \"mass grave\" after the incident, according to the head of the UN Office for Coordination of Humanitarian Affairs Jonathan Whittall. The Israeli military originally claimed an investigation found the vehicles did not have any headlights or emergency signals and were therefore targeted as they looked \"suspicious\". But video footage obtained by the PRCS, and verified by Sky News, showed the ambulances and a fire vehicle clearly marked with flashing red lights. In a briefing from the IDF, they said the ambulances arrived in the Tel Sultan neighbourhood in Rafah shortly after a Hamas police vehicle drove through. An IDF surveillance aircraft was watching the movement of the ambulances and notified troops on the ground. The IDF said it will not be releasing that footage. When the ambulances arrived, the soldiers opened fire, thinking the medics were a threat, according to the IDF. The soldiers were surprised by the convoy stopping on the road and several people getting out quickly and running, the IDF claimed, adding the soldiers were unaware the suspects were in fact unarmed medics. An Israeli military official would not say how far away troops were when they fired on the vehicles. The IDF acknowledged that its statement claiming that the ambulances had their lights off was incorrect, and was based on the testimony from the soldiers in the incident. The newly emerged video footage showed that the ambulances were clearly identifiable and had their lights on, the IDF said. The IDF added that there will be a re-investigation to look into this discrepancy. Addressing the fact the aid workers' bodies were buried in a mass grave, the IDF said in its briefing this is an approved and regular practice to prevent wild dogs and other animals from eating the corpses. The IDF could not explain why the ambulances were also buried. The IDF said six of the 15 people killed were linked to Hamas, but revealed no detail to support the claim.  The newly emerged footage of the incident was discovered on a phone belonging to one of the workers who was killed, PRCS president Dr Younis Al Khatib said. \"His phone was found with his body and he recorded the whole event,\" he said. \"His last words before being shot, 'Forgive me, mom. I just wanted to help people. I wanted to save lives'.\" Sky News used an aftermath video and satellite imagery to verify the location and timing of the newly emerged footage of the incident. More from Sky News:Israeli troops expand Gaza 'security zone'What happened to the ceasefire?  It was filmed on 23 March north of Rafah and shows a convoy of marked ambulances and a fire-fighting vehicle travelling south along a road towards the city centre. All the vehicles visible in the convoy have their flashing lights on. The footage was filmed early in the morning, with a satellite image seen by Sky News taken at 9.48am local time on the same day showing a group of vehicles bunched together off the road."
    },
    {
        "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
        "description": "Two Labour MPs have been denied entry to Israel and deported.",
        "url": "https://news.sky.com/story/labour-mps-yuan-yang-and-abtisam-mohamed-denied-entry-and-deported-from-israel-13343009",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:39:00",
        "Headline": "UK Foreign Secretary David Lammy reacted to news of the MPs being deported saying he had made it \"clear\" to his Israeli counterparts that it's \"no way to treat British parliamentarians\".",
        "Content": "Two Labour MPs have been denied entry to Israel and deported. Yuan Yang and Abtisam Mohamed were rejected because they were suspected of plans to \"document the activities of security forces and spread anti-Israel hatred\", according to a statement from the Israeli immigration ministry. Ms Yang, who represents Earley and Woodley, and Ms Mohamed, the MP for Sheffield Central, both flew to the country from Luton on Saturday. According to a statement from the Israeli immigration ministry, they were accompanied by two assistants and during questioning, the MPs claimed they were visiting Israel \"as part of an official parliamentary delegation\". The ministry branded their claim as \"false\", but UK Foreign Secretary David Lammy reacted to news of the MPs' detention saying their treatment while \"on a parliamentary delegation to Israel\" was \"unacceptable\". Israel's UK embassy said the MPs were denied entry to Israel \"after accusing Israel of false claims, calling for a boycott, spreading lies, and actively promoting sanctions against Israeli ministers while supporting campaigns aimed at boycotting the State of Israel\". Read more from Sky News:Major UK carmaker to 'pause' US shipments over Trump tariffsTwo people die after caravan fire at holiday park \n                  New video undermines Israel's account of aid worker deaths - and suggests cover-up somewhere along chain\n                 \n                  Video emerges of aid workers being fired on in Gaza - contradicting Israeli account of deadly attack\n                 \n                  Israeli troops expand 'security zone' in northern Gaza - after announcing plans to seize areas of south\n                 A statement added: \"The visit was intended to provoke, harm Israeli citizens, and spread falsehoods about them. It is Israel's responsibility to prevent the entry of such individuals (just as is the practice in the United Kingdom).\" Mr Lammy said in a statement to Sky News: \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities. \"I have made clear to my counterparts in the Israeli government that this is no way to treat British parliamentarians, and we have been in contact with both MPs tonight to offer our support. \"The UK government's focus remains securing a return to the ceasefire and negotiations to stop the bloodshed, free the hostages and end the conflict in Gaza.\""
    },
    {
        "title": "France needs to sort its political mess - or populist winds blowing from the US will strengthen",
        "description": "Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world.",
        "url": "https://news.sky.com/story/france-needs-to-sort-its-political-mess-or-else-the-populist-winds-blowing-from-the-us-will-strengthen-13341745",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marine-le-pen-donald-trump_6876068.png?20250404162436",
        "type": "Home",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "France and Europe need effective leadership from a French president - the unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty for both her friends and foes.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world. Take just the members of the G7 - so-called rich, industrialised democracies. Italy elected Giorgia Meloni in 2022, confirming the rise of the far-right. She was not only Italy's first female leader, she was also the first from a neo-fascist party since Mussolini. The arrival of Donald Trump and Sir Keir Starmer changed the complexion of politics in the US and the UK last year. Germany elected a more hawkish chancellor in waiting this spring. Barring accidents, the next potentially transformative election in what used to be called the \"Western alliance\" will not be for two years. France is due to elect a new president to succeed Emmanuel Macron in the summer of 2027. The contest is already plagued by undercurrents of disruption, conflict between politicians and the law, and populism - similar to the fires burning elsewhere in the US and Europe. This week French judges banned the frontrunner to win the presidency from running for office for the next five years. It looked as though they have knocked Marine Le Pen out of the race. Nobody, least of all her, the leader of the far-right Rassemblement National (RN), knows what is going to happen next in French politics. \n                  Donald Trump calls Marine Le Pen's conviction a 'witch hunt' - as judge given police protection \n                 \n                  Andrew and Dawn Searle: Deaths of British couple in France 'treated as murder-suicide'\n                 \n                  Marine Le Pen's political career is in tatters after being found guilty of embezzlement\n                 In opinion polls just over half of the French population, between 54% and 57%, agreed that justice had run its course. \"The law is the same for everyone,\" President Macron declared. After lengthy consideration by a tribunal of three judges, Le Pen and nine other former RN MEPs were found guilty of illegally siphoning off some €4.4m (£3.7m) of funds from the European Parliament for political operations in France, not for personal gain. Le Pen was sentenced to a five-year ban and four years in prison, not to begin before the appeals process had been concluded. Even then that sentence in France would normally amount to two years' house arrest wearing an ankle alarm.  French presidents, such as Jacques Chirac and Nicolas Sarkozy, have been convicted before. Controversy is flaring because Le Pen was given an extra punishment: the immediate ban on running for political office, starting this week. Le Pen and Jordan Bardella, her second in command at RN, likened the ban to a \"nuclear bomb\" and a \"political death penalty\". Speaking in L'Assemblee Nationale, of which she is still a member, Le Pen identified herself with Alexei Navalny, the dissident leader murdered in Russia, and Ekrem Imamoglu, the recently imprisoned Turkish opposition leader and mayor of Istanbul. The ban was imposed at the discretion of the chief judge Benedicte de Perthuis, a former business consultant, Francois Bayrou, France's Macronist prime minister admitted he was \"troubled\" by the verdict. Not surprisingly perhaps from him, since the prosecution is appealing against verdicts in a similar case of political embezzlement, in which Bayrou's party was found guilty but he was acquitted, escaping any possibility of a ban. Bayrou is expected to be a candidate for the presidency. Meanwhile, RN has the power to bring down his government since it is the largest party in the Assembly, with 37%, but was kept out of power by a coalition. Populist forces on both sides of the Atlantic rushed to support Marine Le Pen. Matteo Salvini in Italy, Geert Wilders in the Netherlands and Vladimir Putin's spokesperson Dmitry Peskov all denounced what they saw as a \"violation of democratic norms\". Hungary's Viktor Orban said on X \"Je suis Marine Le Pen\". Orban's post came on the same platform Donald Trump Jr posted that \"JD Vance was right about everything\", a reference to the US vice president's speech at the Munich Security Conference in which he claimed Europe was silencing populist opposition. President Trump weighed in: \"The Witch Hunt against Marine Le Pen is another example of European Leftists using Lawfare to silence Free Speech… it is the same 'playbook' that was used against me.\" Le Pen has called for bans and tough sentences for corrupt politicians from other parties. In France, mainstream commentators are accusing her of hypocrisy and \"Trumpisme\" for attacking the courts now. They also allege, or rather hope, that RN's anger is endangering Marine Le Pen's drive to make her party respectable with her so-called \"wear a neck-tie strategy\", designed to dispel the loutish, racist image of her father's Front National.  For all the protests, justice and politics are now inextricably mixed in France. A ban from political campaigning would be pointless for most convicts, who have no political ambitions. Any suggestion that Le Pen was just being treated like any other citizen was dispelled when it was announced that her appeal would be speeded up to take place next summer. The president of the court de cassation conceded: \"Justice knows how to adjust to circumstances... an election deadline in this case.\" The ban could be lifted in time to give Le Pen a year to stand for the presidency. At this stage, a full acquittal seems unlikely, given the weight of evidence against RN. That is awkward for her and her party because, presumably, she would be campaigning while under house arrest. The best course of action for 29-year-old Jordan Bardella, Le Pen's apparent successor, or \"Dauphin\", would be to stick with her now. He would gain little if he split RN by insisting she is fatally wounded. 👉 Listen to Sky News Daily on your podcast app 👈 If she loses her appeal in a year's time, his loyalty and indignation would be likely to boost his candidacy. Conventional wisdom is that without a lift he may be slick, but is too callow and too square to stand a chance of becoming president in 2027. The far right in France is no different from the far right elsewhere - prone to internal rivalries and in-fighting. The craggy intellectual Eric Zemmour came fourth in the first round in the last presidential contest in 2022. Back then he had the support of Marion Marechal-Le Pen, Marine Le Pen's flighty niece. The two have since fallen out and may separately bid to carry the far-right torch. Macron is riding high as an international statesman but he is unpopular at home. Even if he wanted to, he cannot stand again because of term limits. His attempts to spawn an heir apparent have failed. The 34-year-old prime minister Gabriel Attal led Ensemble to crushing defeat in last year's parliamentary elections. Current prime minister Bayrou, and former prime minister Edouard Philippe, will probably make a bid for the centre-right vote. Bruno Retailleau, the trenchantly hardline interior minister, looks a stronger candidate for the Gaullist Les Republicains. Read more: Le Pen's political career is in tattersEuropean far-right welcomes Trump 2.0 In the last presidential contest, Jean-Luc Melenchon of the hard-left La France Insoumise came third. He may fancy his chances of getting into the final two in 2027 against a right-wing candidate, unless the Socialists get it together. Or perhaps he may let through two finalists from the right and the extreme right. It is a mess. France and Europe need effective leadership from a French president. The unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty. Her supporters are outraged and her foes no longer know who they are fighting against. The French establishment thinks it will all blow over. Just as likely the controversy in France will strengthen the populist winds blowing across the continent and the US."
    },
    {
        "title": "Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'",
        "description": "An artist whose official portrait of Donald Trump was publicly criticised by the president said her business is now \"in danger of not recovering\".",
        "url": "https://news.sky.com/story/artist-behind-trump-portrait-criticised-by-president-as-truly-the-worst-says-business-in-danger-of-not-recovering-13343013",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-portrait_6865704.jpg?20250324130743",
        "type": "Home",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "Sarah Boardman, the artist behind an official portrait of Donald Trump which the president said was \"truly the worst\", says the viral backlash has put her 41-year-old business at risk.",
        "Content": "By Claire Gilbody Dickerson, news reporter  An artist whose official portrait of Donald Trump was publicly criticised by the president said her business is now \"in danger of not recovering\". The Republican leader made headlines at the end of last month when, in a post on his Truth Social platform, he said the portrait hanging in Colorado's State Capitol had been \"purposefully distorted\". Following the criticism, officials said the portrait would be taken down and it has since been removed. Sarah Boardman, the British artist who painted the Trump portrait, said in a statement to Sky News she felt her \"intentions, integrity, and abilities\" had been \"called into question\" when the president criticised the oil painting. In his post, Mr Trump said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\". Read more from Sky News:Thousands protest against Trump at rallies in every US stateDo Trump's numbers on tariffs really add up? Referring to Ms Boardman, whose collection of official portraits also includes one of former president George W Bush, Mr Trump said \"she must have lost her talent as she got older\". \n                  Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states\n                 \n                  Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                  He then added: \"In any event, I would much prefer not having a picture than having this one.\" 'Changed for the worst' Almost two weeks since the criticism, Ms Boardman has now responded saying her business has been detrimentally impacted. She said: \"President Trump is entitled to comment freely, as we all are, but the additional allegations that I 'purposefully distorted' the portrait, and that I 'must have lost my talent as I got older' are now directly and negatively impacting my business of over 41 years which now is in danger of not recovering.\" The artist also described how \"for the six years that the portrait hung in the Colorado State Capitol Building Rotunda, I received overwhelmingly positive reviews and feedback\". \"Since President Trump's comments, that has changed for the worst,\" she added. 👉 Follow Trump 100 on your podcast app 👈 Ms Boardman said the Colorado State Capitol Advisory Committee, Denver, commissioned her to paint the official portrait of President Trump for the Denver State Capitol Gallery of Presidents. \"The reference photograph and my subsequent 'works in progress' were all approved, throughout that process, by that committee,\" she said. \"I completed the portrait accurately, without 'purposeful distortion', political bias, or any attempt to caricature the subject, actual or implied. I fulfilled the task per my contract.\""
    },
    {
        "title": "'Britain's strictest headteacher' Katharine Birbalsingh criticises Education Secretary over 'appalling' schools bill",
        "description": "Educators are split over the government's proposed Children's Wellbeing and Schools Bill, with some&#160;saying the move will improve fairness and accountability and others warning it could limit innovation in academy schools.",
        "url": "https://news.sky.com/story/britains-strictest-headteacher-katharine-birbalsingh-criticises-education-secretary-over-appalling-schools-bill-13341840",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-katharine-birbalsingh_6876125.jpg?20250404174452",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "The contentious legislation, pushed by the Department for Education as a means to reform the education system, has been met with some scathing criticism.",
        "Content": "\n          Education reporter\n       Educators are split over the government's proposed Children's Wellbeing and Schools Bill, with some saying the move will improve fairness and accountability and others warning it could limit innovation in academy schools. Pushed by the Department for Education (DfE) as a means to reform the education system, the bill seeks to improve school standards, strengthen attendance policies, and ensure that children receive a well-rounded education that prioritises their wellbeing. The legislation also includes measures to increase school accountability, particularly for academies, by giving more oversight to the DfE. Katharine Birbalsingh, headteacher of Michaela School in Wembley, north London, called it \"absolutely appalling\". \"I'm just really concerned because, at the moment, school leaders have the freedom to do various things that are right for their intake,\" she told Sky News. \"This bill will take those freedoms away.\" Ms Birbalsingh, also known as 'Britain's strictest headteacher', added: \"We got unlucky because we could have had Wes Streeting as education secretary, which would have been fine. Unfortunately, we got her [Bridget Phillipson]. \n                  Children facing housing insecurity less likely to pass GCSEs, research shows\n                 \n                  'The system just doesn't work': More children than ever are not in school, report finds, with more than 11 million lost days \n                 \n                  Teaching unions gear up for fight with Number 10 over AI job-loss fears\n                 \"She [Ms Phillipson] is so arrogant. She's just marched in there and gone, 'I know what I'm doing, I'll just do what I want'.\" But some argue that academies are left to their own devices and have a lack of accountability when it comes to things like parental complaints. The bill will require all schools to follow the national curriculum and employ teachers who have Qualified Teacher Status (QTS) or are working towards it. The founder of Oasis Academies, Steve Chalke, told Sky News: \"We're excited about the changes because we feel that education has been in a very, very poor place for the last decade or more. \"Schools have been stripped of resources and there have been giant problems about the recruitment and retention of teachers. \"We feel that this important bill is beginning to address all of those issues.\" The bill plans to provide all primary school children with breakfast, alongside uniform limits. This would prevent schools from having more than three items of branded uniform clothing, potentially addressing concerns parents have about the cost of uniforms. Mr Chalke said: \"I am a fan of working hard collaboratively to create the best opportunities for any and every young person and their family. \"Because behind every struggling child is normally a parent who's struggling with that.\" He added: \"We at Oasis are excited about all of this, but that doesn't mean we don't have questions. \"It doesn't mean that we're being led blindly down the road, but our job is to be engaged in the discussion about how academies work more widely with their local authorities.\"  Read more:More children than ever are not in schoolTeaching unions gear up for fight over AI job-loss fearsHeadteachers 'receive murder threats' by pupils' parents The bill will also give local authorities greater control over the pupil admission process. Ms Birbalsingh said: \"Any council could decide to reduce the number of children in one school and therefore reduce the money at that school and give more pupils to another school that's struggling.\" Mr Chalke said: \"Educational academy boards, academy groups, need to be accountable in strong partnership with others. And if this bill delivers everything it promises, wow. I think [it] will be an extraordinary outcome.\" The bill is set to be debated further in the coming weeks as it moves through parliament. A DfE spokesperson said: \"This government is determined to drive high and rising standards for every child through our Plan for Change, to ensure every family has a good local school for their child. \"Our landmark Children's Wellbeing and Schools Bill delivers on this mission, getting high-quality teachers into every classroom, and ensuring there is a floor on pay and no ceiling. \"These measures will make sure we are giving every child an education as good as the best.\""
    },
    {
        "title": "More than a third of UK adults unable to identify bowel cancer symptoms, research finds",
        "description": "More than a third of UK adults are not able to identify symptoms of bowel cancer, according to new research.",
        "url": "https://news.sky.com/story/more-than-a-third-of-uk-adults-unable-to-identify-bowel-cancer-symptoms-research-finds-13343016",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bowel-screening_6877535.jpg?20250406015356",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "A YouGov survey conducted ahead of bowel cancer awareness month in April shows 35% of people in Great Britain do not know what the symptoms are.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n More than a third of UK adults are not able to identify symptoms of bowel cancer, according to new research. A YouGov survey conducted ahead of bowel cancer awareness month in April shows that 35% of people didn't know what the symptoms were. Just over a fifth (22%) of people mentioned changes to bowel habits, while only 12% of people recognised bleeding from the bottom, and less than half (47%) of those asked mentioned blood in poo as a symptom. Bowel cancer is the UK's second deadliest form of cancer, after lung. It claims 16,800 lives a year, according to Cancer Research UK. Bonnie Brimstone was in her mid-forties when she was diagnosed with stage two bowel cancer. \"It was a huge shock, but I did know there was something not quite right,\" she told Sky News. \"I started going to the toilet more regularly, was looser than normal. I knew that wasn't normal for me. I lost a bit of weight - half a stone - quite quickly. And eventually I saw blood in the toilet. That's when I knew there was something seriously wrong. \n                  King Charles seen in public for first time since suffering side effects from cancer treatment\n                 \n                  Man who claimed weedkiller caused cancer awarded $2.1bn by US jury\n                 \n                  'Eureka moment' as scientists discover how aspirin could stop some cancers spreading\n                 \"Each symptom - being tired, weight loss, going to the toilet more regularly - you can sort of explain away as something else,\" she said. In her case, Bonnie feels awareness of symptoms was \"everything\" but admits she didn't feel comfortable talking about them at first, despite being a \"very open\" person. Read more from Sky News:Two Labour MPs denied entry and deported from IsraelPrince Harry's charity row explained Stigma about symptoms is a problem that experts say is common when it comes to bowel cancer, the fourth most common type of cancer in the UK. \"People do feel a bit embarrassed talking about poo and blood or bleeding from your bottom,\" said Genevieve Edwards, chief executive of Bowel Cancer UK. \"But unless we do feel comfortable… cancer stays in the shadows and that's when it's most deadly,\" she told Sky News. \"If you're diagnosed at stage one, more than nine in 10 people will survive that. It's very survivable. \"If you're diagnosed at stage four, that plummets to less than one in 10. So it's really important,\" she said. Bowel Cancer UK says that less than 40% of people are diagnosed in the early stages of cancer, stages one and two. Almost half are diagnosed in the later stages, three and four."
    },
    {
        "title": "Grand National won by 33/1 shot Nick Rockett - horse ridden by trainer Willie Mullins's son Patrick",
        "description": "Irish amateur rider Patrick Mullins has won the Grand National on 33/1 shot Nick Rockett - a horse trained by his father Willie Mullins.",
        "url": "https://news.sky.com/story/nick-rockett-a-331-shot-wins-the-grand-national-13342555",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-patrick-mullins-willie-mullins_6877048.jpg?20250405165843",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-05 14:56:00",
        "Headline": "Four of trainer Willie Mullins's horses finished in the top five in the world-famous steeplechase, including Nick Rockett which was guided to victory by Mullins's jockey son Patrick.",
        "Content": "Irish amateur rider Patrick Mullins has won the Grand National on 33/1 shot Nick Rockett - a horse trained by his father Willie Mullins. It was a 1-2-3 finish for Mullins Snr as he also trains I Am Maximus (7/1), which came second this time after winning the world-famous steeplechase last year, while another of his horses, Grangeclare West (33/1), was third. After the final fence, Nick Rockett galloped away from I Am Maximus to win by two and a half lengths, in front of about 70,000 racegoers at Aintree on Merseyside. Grangeclare West was a further half-length back, with Iroko, trained by Oliver Greenall and Josh Guerriero, taking fourth as the 13-2 favourite. Mullins also had the fifth-placed horse in Meetingofthewaters (20/1). As well as being back-to-back victories for Willie Mullins, it was also his third Grand National success after his first in 2005 with Hedgehunter. \"It is lovely to be able to give your son a ride in the National, but to be able to win it is just unbelievable,\" Willie Mullins said. \n                  I Am Maximus wins Grand National - and no horses fall at this year's event\n                 \n                  Grand National: Renewed safety fears over race - but organisers insist changes have been made\n                 \n                  Grand National: Changes being made in an attempt to make popular horse race safer\n                 'He jumped fantastic' Patrick Mullins told ITV Racing: \"I had too good a start and was having to take him back all the way. I was wondering at Canal Turn had I lost too much ground, but he just jumped fantastic. \"Then I was there too soon and it is a long way from the back of the last with Paul Townend (on I Am Maximus) on my outside. \"It's everything I've dreamed of since I was a kid, I know it's a cliche but when I was five or six years old, reading books about the National and watching black and white videos of Red Rum. To put my name there is very special.\" Emotional winner Five of the top seven horses were trained by Willie Mullins. Also full of emotion was Nick Rockett owner Stewart Andrew, whose wife Sadie died in December 2022, just five days after watching the horse in his first race. Andrew said: \"This a class horse, he's got the heart of a lion. From a personal point of view, I can't tell you. Sadie would have loved today - she was up there, she'll have had a tenner each-way, I guarantee you.\" With two fences remaining, a group of 15 were in the running. Broadway Boy led the first half of the 30-fence race but fell heavily on the second circuit. Kandoo Kid also fell, bringing down Appreciate It at the 22nd fence. The Grand National - a race for 34 horses - has long been regarded as one of the most dangerous horse races in the world because of the size of the fences. However, a number of new measures were introduced last year in an attempt to make it safer. Changes included reducing the number of competitors, a standing start, making one of the fences shorter, and adding foam and rubber toe boards to every fence."
    },
    {
        "title": "Jaguar Land Rover's US exports announcement sparks anxiety in car-making hub Solihull",
        "description": "The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious.",
        "url": "https://news.sky.com/story/jaguar-land-rovers-us-exports-announcement-sparks-anxiety-in-car-making-hub-solihull-13342833",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-solihull-jaguar-land-rover_6877297.jpg?20250405181736",
        "type": "Home",
        "Author": "Becky Johnson",
        "Date Published": "2025-04-05 17:04:00",
        "Headline": "Manufacturing vehicles is in Solihull's DNA - and a warning that Donald Trump's tariffs could put 25,000 British car manufacturing jobs at risk is a real concern here.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious. The plant in the West Midlands town employs around 10,000 people. Many more work in the supply chain. On the high street, one factory worker said they had been told not to speak to journalists about the company's decision. Another asked us not to name her but said: \"Everyone's talking about it.\" Tariffs latest: Anti-Trump protests take place Referring to a move by the company earlier this year, she added: \"They've already laid off agency staff, the worry is the next jobs to go will be staff jobs.\" Richard Shuttelworth, an 81-year-old who worked for JLR for over 30 years, told us: \"An awful lot of their trade is with America. \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 \n                  Day 76: How badly will China's own US tariffs go down with Trump?\n                 \n                  A red wall on Wall Street - but President Trump appears to believe it will all work out\n                 \"There are going to be a lot of jobs lost if they don't get it sorted.\" But he's uncertain about how the UK government should respond. \"When it comes to retaliation I just don't know,\" he says. \"At the moment I think they're playing it right. \"They should kind of play it cool if you like and just see if they can get a trade deal, because I think the tit for tat is just going to do nobody any good at all.\" This is a town with car-making in its DNA. A warning from the Institute For Public Policy Research that the tariffs could put 25,000 jobs at risk across British car manufacturing is a real concern here. \"It would be devastating to people, it really would,\" says Julie, 63. \"If you wipe that off the landscape, a chunk of people that not only work there but the families that have now got no income.\" That's what is worrying John Constable, who helps run his wife's family's carousel business in the town centre. Ironically, a New York taxi is among the favourite vehicles on the children's ride. If parents aren't earning, the business could grind to a halt. \"People are going to cut back aren't they?\" John says. \"They're going to watch their pennies which we all do […] yes it will have a knock-on effect.\" More from Sky News:Labour MP arrested on suspicion of rapeTwo die in holiday park caravan fire He's worried about a \"tit for tat\" trade war - but does think the government should keep all options open. \"I would monitor it to start with to see how things start to go and what effect it's going to have on the economy,\" he says. \"Then obviously if it's going to be devastating then they need to put something in place.\""
    },
    {
        "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
        "description": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences.",
        "url": "https://news.sky.com/story/labour-suspends-mp-dan-norris-after-arrest-13342856",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dan-norris-labour_6877329.jpg?20250405183946",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 17:24:00",
        "Headline": "Mr Norris, the MP for North East Somerset and Hanham, has been suspended by the Labour Party. ",
        "Content": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences. A Labour Party spokesperson said: \"Dan Norris MP was immediately suspended by the Labour Party upon being informed of his arrest. \"We cannot comment further while the police investigation is ongoing.\" Police said a man in his 60s had been arrested on Friday on suspicion of sexual offences against a girl, rape, child abduction and misconduct in a public office. Sky News has contacted Mr Norris for comment. Mr Norris, 65, defeated Jacob Rees-Mogg to win the new seat of North East Somerset and Hanham in last year's general election. He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports. Avon and Somerset Police said in a statement: \"In December 2024, we received a referral from another police force relating to alleged non-recent child sex offences having been committed against a girl. \"Most of the offences are alleged to have occurred in the 2000s, but we're also investigating an alleged offence of rape from the 2020s. \"An investigation, led by officers within Operation Bluestone, our dedicated rape and serious sexual assault investigation team, remains ongoing and at an early stage. \"The victim is being supported and given access to any specialist help or support she needs. \"A man, aged in his 60s, was arrested on Friday (April 4) on suspicion of sexual offences against a girl (under the Sexual Offences Act 1956), rape (under the Sexual Offences Act 2003), child abduction and misconduct in a public office. He's been released on conditional bail for enquiries to continue. \"This is an active and sensitive investigation, so we'd respectfully ask people not to speculate on the circumstances so our enquiries can continue unhindered.\" Mr Norris first entered Parliament when Tony Blair came to power in 1997 and served as the Wansdyke MP until 2010. He was an assistant whip under Mr Blair and served as a junior minister under Gordon Brown. Mr Norris has also been West of England mayor since 2021 but is due to step down ahead of May's local elections. A spokesman for the League Against Cruel Sports, a UK-based animal welfare charity which campaigns to end sports such as fox hunting and game bird shooting, confirmed he had stepped down from his role. \"The charity cannot comment further while an investigation is ongoing,\" a statement said."
    },
    {
        "title": "Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs",
        "description": "Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump&#8217;s tariffs.",
        "url": "https://news.sky.com/story/jaguar-land-rover-to-pause-us-shipments-over-donald-trump-tariffs-13342440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-jaguar-land-rover_6876730.jpg?20250405140117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 13:44:00",
        "Headline": "The UK carmaker exported around 38,000 cars to the country in the third quarter of 2024.",
        "Content": " Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump’s tariffs. The US president has introduced a 25% levy on all foreign cars imported into the country, which came into force on Thursday. JLR, one of the country's biggest carmakers, exported about 38,000 cars to the US in the third quarter of 2024 - almost equal to the amount sold to the UK and the EU combined. Follow live updates: Trump's baseline 10% tariff kicks in In a statement on Saturday, a spokesperson for the company behind the Jaguar, Land Rover and Range Rover brands said: \"The USA is an important market for JLR's luxury brands. \"As we work to address the new trading terms with our business partners, we are taking some short-term actions including a shipment pause in April, as we develop our mid- to longer-term plans.\" The company released a statement last week before Mr Trump announced a \"baseline\" 10% tariff on goods from around the world, which kicked in on Saturday morning, on what he called \"liberation day\". \n                  Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'\n                 \n                  Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 JLR reassured customers its business was \"resilient\" and \"accustomed to changing market conditions\". \"Our priorities now are delivering for our clients around the world and addressing these new US trading terms,\" the firm said. Trading across the world has been hit by Mr Trump's tariff announcement at the White House on Wednesday. All but one stock on the FTSE 100 fell on Friday - with Rolls-Royce, banks and miners among those to suffer the sharpest losses. Read more: A red wall on Wall Street - but Trump seems to believe it will work out Cars are the top product exported from the UK to the US, with exports worth £8.3bn in the year to the end of September 2024, according to data from the Office for National Statistics. For UK carmakers, the US is the second largest export market behind the European Union. Industry groups have previously warned the tariffs will force firms to rethink where they trade, while a report by thinktank the Institute for Public Policy Research said more than 25,000 car manufacturing jobs in the UK could be at risk."
    },
    {
        "title": "Two people die after caravan fire at holiday park in Lincolnshire",
        "description": "Two people have died following a fire at a caravan site near Skegness, Lincolnshire Police have said.",
        "url": "https://news.sky.com/story/two-people-die-after-caravan-fire-at-holiday-park-in-lincolnshire-13342390",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-golden-beach-caravan-park_6876778.jpg?20250405143027",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 13:03:00",
        "Headline": "Fire and rescue crews attended the scene at Golden Beach Holiday Park, and two people were found to have died. They were reported to be a 10-year-old girl and a 48-year-old man.",
        "Content": "Two people have died following a fire at a caravan site near Skegness, Lincolnshire Police have said. In a statement, officers said they were called at 3.53am on Saturday to a report of a blaze at Golden Beach Holiday Park in the village of Ingoldmells. Fire and rescue crews attended the scene, and two people were found to have died. The force said the victims' next of kin have been informed and will be supported by specially trained officers. Officers are trying to establish the exact cause of the blaze. \"We are at the very early stages of our investigation and as such we are keeping an open mind,\" the force said. Two fire crews remain at the scene."
    },
    {
        "title": "Grand National won by 33/1 shot Nick Rockett - horse ridden by trainer Willie Mullins's son Patrick",
        "description": "Irish amateur rider Patrick Mullins has won the Grand National on 33/1 shot Nick Rockett - a horse trained by his father Willie Mullins.",
        "url": "https://news.sky.com/story/nick-rockett-a-331-shot-wins-the-grand-national-13342555",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-patrick-mullins-willie-mullins_6877048.jpg?20250405165843",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 14:56:00",
        "Headline": "Four of trainer Willie Mullins's horses finished in the top five in the world-famous steeplechase, including Nick Rockett which was guided to victory by Mullins's jockey son Patrick.",
        "Content": "Irish amateur rider Patrick Mullins has won the Grand National on 33/1 shot Nick Rockett - a horse trained by his father Willie Mullins. It was a 1-2-3 finish for Mullins Snr as he also trains I Am Maximus (7/1), which came second this time after winning the world-famous steeplechase last year, while another of his horses, Grangeclare West (33/1), was third. After the final fence, Nick Rockett galloped away from I Am Maximus to win by two and a half lengths, in front of about 70,000 racegoers at Aintree on Merseyside. Grangeclare West was a further half-length back, with Iroko, trained by Oliver Greenall and Josh Guerriero, taking fourth as the 13-2 favourite. Mullins also had the fifth-placed horse in Meetingofthewaters (20/1). As well as being back-to-back victories for Willie Mullins, it was also his third Grand National success after his first in 2005 with Hedgehunter. \"It is lovely to be able to give your son a ride in the National, but to be able to win it is just unbelievable,\" Willie Mullins said. \n                  I Am Maximus wins Grand National - and no horses fall at this year's event\n                 \n                  Grand National: Renewed safety fears over race - but organisers insist changes have been made\n                 \n                  Grand National: Changes being made in an attempt to make popular horse race safer\n                 'He jumped fantastic' Patrick Mullins told ITV Racing: \"I had too good a start and was having to take him back all the way. I was wondering at Canal Turn had I lost too much ground, but he just jumped fantastic. \"Then I was there too soon and it is a long way from the back of the last with Paul Townend (on I Am Maximus) on my outside. \"It's everything I've dreamed of since I was a kid, I know it's a cliche but when I was five or six years old, reading books about the National and watching black and white videos of Red Rum. To put my name there is very special.\" Emotional winner Five of the top seven horses were trained by Willie Mullins. Also full of emotion was Nick Rockett owner Stewart Andrew, whose wife Sadie died in December 2022, just five days after watching the horse in his first race. Andrew said: \"This a class horse, he's got the heart of a lion. From a personal point of view, I can't tell you. Sadie would have loved today - she was up there, she'll have had a tenner each-way, I guarantee you.\" With two fences remaining, a group of 15 were in the running. Broadway Boy led the first half of the 30-fence race but fell heavily on the second circuit. Kandoo Kid also fell, bringing down Appreciate It at the 22nd fence. The Grand National - a race for 34 horses - has long been regarded as one of the most dangerous horse races in the world because of the size of the fences. However, a number of new measures were introduced last year in an attempt to make it safer. Changes included reducing the number of competitors, a standing start, making one of the fences shorter, and adding foam and rubber toe boards to every fence."
    },
    {
        "title": "More than a third of UK adults unable to identify bowel cancer symptoms, research finds",
        "description": "More than a third of UK adults are not able to identify symptoms of bowel cancer, according to new research.",
        "url": "https://news.sky.com/story/more-than-a-third-of-uk-adults-unable-to-identify-bowel-cancer-symptoms-research-finds-13343016",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bowel-screening_6877535.jpg?20250406015356",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "A YouGov survey conducted ahead of bowel cancer awareness month in April shows 35% of people in Great Britain do not know what the symptoms are.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n More than a third of UK adults are not able to identify symptoms of bowel cancer, according to new research. A YouGov survey conducted ahead of bowel cancer awareness month in April shows that 35% of people didn't know what the symptoms were. Just over a fifth (22%) of people mentioned changes to bowel habits, while only 12% of people recognised bleeding from the bottom, and less than half (47%) of those asked mentioned blood in poo as a symptom. Bowel cancer is the UK's second deadliest form of cancer, after lung. It claims 16,800 lives a year, according to Cancer Research UK. Bonnie Brimstone was in her mid-forties when she was diagnosed with stage two bowel cancer. \"It was a huge shock, but I did know there was something not quite right,\" she told Sky News. \"I started going to the toilet more regularly, was looser than normal. I knew that wasn't normal for me. I lost a bit of weight - half a stone - quite quickly. And eventually I saw blood in the toilet. That's when I knew there was something seriously wrong. \n                  King Charles seen in public for first time since suffering side effects from cancer treatment\n                 \n                  Man who claimed weedkiller caused cancer awarded $2.1bn by US jury\n                 \n                  'Eureka moment' as scientists discover how aspirin could stop some cancers spreading\n                 \"Each symptom - being tired, weight loss, going to the toilet more regularly - you can sort of explain away as something else,\" she said. In her case, Bonnie feels awareness of symptoms was \"everything\" but admits she didn't feel comfortable talking about them at first, despite being a \"very open\" person. Read more from Sky News:Two Labour MPs denied entry and deported from IsraelPrince Harry's charity row explained Stigma about symptoms is a problem that experts say is common when it comes to bowel cancer, the fourth most common type of cancer in the UK. \"People do feel a bit embarrassed talking about poo and blood or bleeding from your bottom,\" said Genevieve Edwards, chief executive of Bowel Cancer UK. \"But unless we do feel comfortable… cancer stays in the shadows and that's when it's most deadly,\" she told Sky News. \"If you're diagnosed at stage one, more than nine in 10 people will survive that. It's very survivable. \"If you're diagnosed at stage four, that plummets to less than one in 10. So it's really important,\" she said. Bowel Cancer UK says that less than 40% of people are diagnosed in the early stages of cancer, stages one and two. Almost half are diagnosed in the later stages, three and four."
    },
    {
        "title": "'Britain's strictest headteacher' Katharine Birbalsingh criticises Education Secretary over 'appalling' schools bill",
        "description": "Educators are split over the government's proposed Children's Wellbeing and Schools Bill, with some&#160;saying the move will improve fairness and accountability and others warning it could limit innovation in academy schools.",
        "url": "https://news.sky.com/story/britains-strictest-headteacher-katharine-birbalsingh-criticises-education-secretary-over-appalling-schools-bill-13341840",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-katharine-birbalsingh_6876125.jpg?20250404174452",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "The contentious legislation, pushed by the Department for Education as a means to reform the education system, has been met with some scathing criticism.",
        "Content": "\n          Education reporter\n       Educators are split over the government's proposed Children's Wellbeing and Schools Bill, with some saying the move will improve fairness and accountability and others warning it could limit innovation in academy schools. Pushed by the Department for Education (DfE) as a means to reform the education system, the bill seeks to improve school standards, strengthen attendance policies, and ensure that children receive a well-rounded education that prioritises their wellbeing. The legislation also includes measures to increase school accountability, particularly for academies, by giving more oversight to the DfE. Katharine Birbalsingh, headteacher of Michaela School in Wembley, north London, called it \"absolutely appalling\". \"I'm just really concerned because, at the moment, school leaders have the freedom to do various things that are right for their intake,\" she told Sky News. \"This bill will take those freedoms away.\" Ms Birbalsingh, also known as 'Britain's strictest headteacher', added: \"We got unlucky because we could have had Wes Streeting as education secretary, which would have been fine. Unfortunately, we got her [Bridget Phillipson]. \n                  Children facing housing insecurity less likely to pass GCSEs, research shows\n                 \n                  'The system just doesn't work': More children than ever are not in school, report finds, with more than 11 million lost days \n                 \n                  Teaching unions gear up for fight with Number 10 over AI job-loss fears\n                 \"She [Ms Phillipson] is so arrogant. She's just marched in there and gone, 'I know what I'm doing, I'll just do what I want'.\" But some argue that academies are left to their own devices and have a lack of accountability when it comes to things like parental complaints. The bill will require all schools to follow the national curriculum and employ teachers who have Qualified Teacher Status (QTS) or are working towards it. The founder of Oasis Academies, Steve Chalke, told Sky News: \"We're excited about the changes because we feel that education has been in a very, very poor place for the last decade or more. \"Schools have been stripped of resources and there have been giant problems about the recruitment and retention of teachers. \"We feel that this important bill is beginning to address all of those issues.\" The bill plans to provide all primary school children with breakfast, alongside uniform limits. This would prevent schools from having more than three items of branded uniform clothing, potentially addressing concerns parents have about the cost of uniforms. Mr Chalke said: \"I am a fan of working hard collaboratively to create the best opportunities for any and every young person and their family. \"Because behind every struggling child is normally a parent who's struggling with that.\" He added: \"We at Oasis are excited about all of this, but that doesn't mean we don't have questions. \"It doesn't mean that we're being led blindly down the road, but our job is to be engaged in the discussion about how academies work more widely with their local authorities.\"  Read more:More children than ever are not in schoolTeaching unions gear up for fight over AI job-loss fearsHeadteachers 'receive murder threats' by pupils' parents The bill will also give local authorities greater control over the pupil admission process. Ms Birbalsingh said: \"Any council could decide to reduce the number of children in one school and therefore reduce the money at that school and give more pupils to another school that's struggling.\" Mr Chalke said: \"Educational academy boards, academy groups, need to be accountable in strong partnership with others. And if this bill delivers everything it promises, wow. I think [it] will be an extraordinary outcome.\" The bill is set to be debated further in the coming weeks as it moves through parliament. A DfE spokesperson said: \"This government is determined to drive high and rising standards for every child through our Plan for Change, to ensure every family has a good local school for their child. \"Our landmark Children's Wellbeing and Schools Bill delivers on this mission, getting high-quality teachers into every classroom, and ensuring there is a floor on pay and no ceiling. \"These measures will make sure we are giving every child an education as good as the best.\""
    },
    {
        "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
        "description": "Two Labour MPs have been denied entry to Israel and deported.",
        "url": "https://news.sky.com/story/labour-mps-yuan-yang-and-abtisam-mohamed-denied-entry-and-deported-from-israel-13343009",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:39:00",
        "Headline": "UK Foreign Secretary David Lammy reacted to news of the MPs being deported saying he had made it \"clear\" to his Israeli counterparts that it's \"no way to treat British parliamentarians\".",
        "Content": "Two Labour MPs have been denied entry to Israel and deported. Yuan Yang and Abtisam Mohamed were rejected because they were suspected of plans to \"document the activities of security forces and spread anti-Israel hatred\", according to a statement from the Israeli immigration ministry. Ms Yang, who represents Earley and Woodley, and Ms Mohamed, the MP for Sheffield Central, both flew to the country from Luton on Saturday. According to a statement from the Israeli immigration ministry, they were accompanied by two assistants and during questioning, the MPs claimed they were visiting Israel \"as part of an official parliamentary delegation\". The ministry branded their claim as \"false\", but UK Foreign Secretary David Lammy reacted to news of the MPs' detention saying their treatment while \"on a parliamentary delegation to Israel\" was \"unacceptable\". Israel's UK embassy said the MPs were denied entry to Israel \"after accusing Israel of false claims, calling for a boycott, spreading lies, and actively promoting sanctions against Israeli ministers while supporting campaigns aimed at boycotting the State of Israel\". Read more from Sky News:Major UK carmaker to 'pause' US shipments over Trump tariffsTwo people die after caravan fire at holiday park \n                  New video undermines Israel's account of aid worker deaths - and suggests cover-up somewhere along chain\n                 \n                  Video emerges of aid workers being fired on in Gaza - contradicting Israeli account of deadly attack\n                 \n                  Israeli troops expand 'security zone' in northern Gaza - after announcing plans to seize areas of south\n                 A statement added: \"The visit was intended to provoke, harm Israeli citizens, and spread falsehoods about them. It is Israel's responsibility to prevent the entry of such individuals (just as is the practice in the United Kingdom).\" Mr Lammy said in a statement to Sky News: \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities. \"I have made clear to my counterparts in the Israeli government that this is no way to treat British parliamentarians, and we have been in contact with both MPs tonight to offer our support. \"The UK government's focus remains securing a return to the ceasefire and negotiations to stop the bloodshed, free the hostages and end the conflict in Gaza.\""
    },
    {
        "title": "Defence chiefs meet in Kyiv to discuss plans for future international 'reassurance force' in Ukraine",
        "description": "Defence chiefs have met in Kyiv to discuss the size and make-up of the proposed international \"reassurance force\" to back up any future peace deal in Ukraine. ",
        "url": "https://news.sky.com/story/defence-chiefs-meet-in-kyiv-to-discuss-plans-for-future-international-reassurance-force-in-ukraine-13342272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ukraine-donetsk_6875707.jpg?20250404101556",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-05 09:52:00",
        "Headline": "Defence Secretary Join Healey is set to convene the next meeting of the so-called \"coalition of the willing\" in Brussels next week. ",
        "Content": "Defence chiefs have met in Kyiv to discuss the size and make-up of the proposed international \"reassurance force\" to back up any future peace deal in Ukraine.  The UK's chief of the defence staff Admiral Sir Tony Radakin joined his Ukrainian and French counterparts on Saturday for discussions about how to bolster the country's military. Their meetings focused on the structure, size and composition needed for any armed force to back up an eventual peace deal, the Ministry of Defence said. \"The UK is ironclad in our support for Ukraine, which is why we're stepping up for a just and lasting peace,\" Admiral Radakin said. \"Our meetings looked at how we can build on the formidable capabilities of the Ukrainian Army and put them in the strongest possible position to deter Russian aggression.\"  It comes after at least 19 people were killed in a Russian attack on Ukrainian president Volodymyr Zelenskyy's home city and as the UK's defence secretary is set to convene the next meeting of the so-called \"coalition of the willing\" on Thursday. With 30 countries expected to contribute to the coalition, John Healey will host defence ministers in Brussels alongside his French counterpart. He will then chair the Ukraine Defence Contact Group with his opposite number from Germany on Friday. \"Our coalition of nations, working at pace and willing to stand with Ukraine for the long-term, is a stark contrast to Russia who stand alone with only North Korea for a friend,\" Mr Healey said. \"As Putin prevaricates over a ceasefire, we will continue to ramp up our military planning, exploring the air, sea and land forces that could support a lasting peace in Ukraine. \"However, we will not jeopardise the peace by forgetting about the war. \"That's why in the week ahead we will also convene the Ukraine Defence Contact Group to supply Ukraine with the military equipment they need to put them in the strongest possible position as they fight back brutal, continuing Russian attacks.\" Read more: Who's in and out of coalition of the willing The UK and France have been at the forefront of the coalition, which would see armed forces from a number of European and NATO countries on the ground in Ukraine acting as peacekeepers. In theory they would deter any further Russian aggression and violations of a potential ceasefire. But since the initial Russian invasion in February 2022, Vladimir Putin has said he will not accept NATO troops in Ukraine - leaving many doubting Prime Minister Sir Keir Starmer's plan. Sir Keir hosted a virtual meeting of leaders in March after Mr Zelenskyy accepted a 30-day interim ceasefire agreement. The idea has been dismissed by the Trump administration, with US special envoy Steve Witkoff describing it as \"simplistic\" and \"posture and pose\". Downing Street has said it is still in the \"planning phase\" of how the coalition would work in practice - and has been so far unable to answer questions on operational details."
    },
    {
        "title": "Jaguar Land Rover's US exports announcement sparks anxiety in car-making hub Solihull",
        "description": "The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious.",
        "url": "https://news.sky.com/story/jaguar-land-rovers-us-exports-announcement-sparks-anxiety-in-car-making-hub-solihull-13342833",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-solihull-jaguar-land-rover_6877297.jpg?20250405181736",
        "type": "UK",
        "Author": "Becky Johnson",
        "Date Published": "2025-04-05 17:04:00",
        "Headline": "Manufacturing vehicles is in Solihull's DNA - and a warning that Donald Trump's tariffs could put 25,000 British car manufacturing jobs at risk is a real concern here.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious. The plant in the West Midlands town employs around 10,000 people. Many more work in the supply chain. On the high street, one factory worker said they had been told not to speak to journalists about the company's decision. Another asked us not to name her but said: \"Everyone's talking about it.\" Tariffs latest: Anti-Trump protests take place Referring to a move by the company earlier this year, she added: \"They've already laid off agency staff, the worry is the next jobs to go will be staff jobs.\" Richard Shuttelworth, an 81-year-old who worked for JLR for over 30 years, told us: \"An awful lot of their trade is with America. \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 \n                  Day 76: How badly will China's own US tariffs go down with Trump?\n                 \n                  A red wall on Wall Street - but President Trump appears to believe it will all work out\n                 \"There are going to be a lot of jobs lost if they don't get it sorted.\" But he's uncertain about how the UK government should respond. \"When it comes to retaliation I just don't know,\" he says. \"At the moment I think they're playing it right. \"They should kind of play it cool if you like and just see if they can get a trade deal, because I think the tit for tat is just going to do nobody any good at all.\" This is a town with car-making in its DNA. A warning from the Institute For Public Policy Research that the tariffs could put 25,000 jobs at risk across British car manufacturing is a real concern here. \"It would be devastating to people, it really would,\" says Julie, 63. \"If you wipe that off the landscape, a chunk of people that not only work there but the families that have now got no income.\" That's what is worrying John Constable, who helps run his wife's family's carousel business in the town centre. Ironically, a New York taxi is among the favourite vehicles on the children's ride. If parents aren't earning, the business could grind to a halt. \"People are going to cut back aren't they?\" John says. \"They're going to watch their pennies which we all do […] yes it will have a knock-on effect.\" More from Sky News:Labour MP arrested on suspicion of rapeTwo die in holiday park caravan fire He's worried about a \"tit for tat\" trade war - but does think the government should keep all options open. \"I would monitor it to start with to see how things start to go and what effect it's going to have on the economy,\" he says. \"Then obviously if it's going to be devastating then they need to put something in place.\""
    },
    {
        "title": "Volodymyr Zelenskyy takes swipe at US over 'weak' comment on Russian attack - as Ukrainian drones strike factory",
        "description": "Ukrainian President Volodymyr Zelenskyy has hit out at the US over its \"weak\" response to lethal Russian attacks on his hometown on Friday.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-takes-swipe-at-us-over-weak-comment-on-russian-attack-as-ukrainian-drones-strike-factory-13342331",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kryvyi-rih-ukraine_6876719.jpg?20250405134804",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 12:05:00",
        "Headline": "President Zelenskyy taunted America for its \"weak\" response to Russian strikes on his hometown, which killed 19 people.",
        "Content": "Ukrainian President Volodymyr Zelenskyy has hit out at the US over its \"weak\" response to lethal Russian attacks on his hometown on Friday. President Zelenskyy posted a lengthy and emotional statement on X about Russia's strikes on Kryvyi Rih, which killed 19 people. Meanwhile Ukrainian drones hit an explosives factory in Russia's Samara region in an overnight strike, a member of Ukraine's SBU security service told Reuters. In his post, President Zelenskyy accused the United States of being \"afraid\" to name-check Russia in its comment on the attack. \"Unfortunately, the reaction of the American Embassy is unpleasantly surprising: such a strong country, such a strong people - and such a weak reaction,\" he wrote on X. \"They are even afraid to say the word \"Russian\" when talking about the missile that killed children.\" America's ambassador to Ukraine Bridget Brink had written on X: \"Horrified that tonight a ballistic missile struck near a playground and restaurant in Kryvyi Rih. \"More than 50 people injured and 16 killed, including 6 children. This is why the war must end.\"  President Zelenskyy went on in his post to say: \"Yes, the war must end. But in order to end it, we must not be afraid to call a spade a spade. \"We must not be afraid to put pressure on the only one who continues this war and ignores all the world's proposals to end it. We must put pressure on Russia, which chooses to kill children instead of a ceasefire.\" Grandmother 'burned to death in her home' Oleksandr Vilkul, head of the city's defense council, said the missile attack, followed by a drone attack, had killed 19 people, including nine children. \"The Iskander-M missile strike with cluster munitions at the children's playground in the residential area, to make the shrapnel fly further apart, killed 18 people. \"One grandmother was burnt to death in her house after Shahed's direct hit.\" Russia's defence ministry said it had struck a military gathering in a restaurant - an assertion rebutted by the Ukrainian military as misinformation. \"The missile hit right on the street - around ordinary houses, a playground, shops, a restaurant,\" President Zelenskyy wrote. Mr Zelenskyy also detailed the child victims of the attack including \"Konstantin, who will be 16 forever\" and \"Arina, who will also be 7 forever\". The UK's chief of the defence staff Sir Tony Radakin said he had met the Ukrainian leader on Friday, along with French armed forces leader General Thierry Burkhard. \"Britain and France are coming together & Europe is stepping up in a way that is real & substantial, with 200 planners from 30 nations working to strengthen Ukraine's long term security,\" Sir Tony wrote. The UK and France have spearheaded a so-called \"coalition of the willing\" - a group of countries that have pledged to help Ukraine secure if a ceasefire deal is reached with Russia."
    },
    {
        "title": "IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked",
        "description": "The IDF has admitted to mistakenly identifying a convoy of aid workers as a threat &#8211; following the emergence of a video which proved their ambulances were clearly marked when Israeli troops opened fire on them. ",
        "url": "https://news.sky.com/story/idf-admits-mistakenly-identifying-gaza-aid-workers-as-threat-after-video-of-attack-showed-ambulances-were-marked-13342874",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-aid-workers_6876575.jpg?20250405094624",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 17:48:00",
        "Headline": "The Israeli military originally claimed the vehicles did not have any headlights or emergency signals and were therefore targeted as they looked \"suspicious\".",
        "Content": " The IDF has admitted to mistakenly identifying a convoy of aid workers as a threat – following the emergence of a video which proved their ambulances were clearly marked when Israeli troops opened fire on them.  The bodies of 15 aid workers - including eight medics working for the Palestine Red Crescent Society (PRCS) - were found in a \"mass grave\" after the incident, according to the head of the UN Office for Coordination of Humanitarian Affairs Jonathan Whittall. The Israeli military originally claimed an investigation found the vehicles did not have any headlights or emergency signals and were therefore targeted as they looked \"suspicious\". But video footage obtained by the PRCS, and verified by Sky News, showed the ambulances and a fire vehicle clearly marked with flashing red lights. In a briefing from the IDF, they said the ambulances arrived in the Tel Sultan neighbourhood in Rafah shortly after a Hamas police vehicle drove through. An IDF surveillance aircraft was watching the movement of the ambulances and notified troops on the ground. The IDF said it will not be releasing that footage. When the ambulances arrived, the soldiers opened fire, thinking the medics were a threat, according to the IDF. The soldiers were surprised by the convoy stopping on the road and several people getting out quickly and running, the IDF claimed, adding the soldiers were unaware the suspects were in fact unarmed medics. An Israeli military official would not say how far away troops were when they fired on the vehicles. The IDF acknowledged that its statement claiming that the ambulances had their lights off was incorrect, and was based on the testimony from the soldiers in the incident. The newly emerged video footage showed that the ambulances were clearly identifiable and had their lights on, the IDF said. The IDF added that there will be a re-investigation to look into this discrepancy. Addressing the fact the aid workers' bodies were buried in a mass grave, the IDF said in its briefing this is an approved and regular practice to prevent wild dogs and other animals from eating the corpses. The IDF could not explain why the ambulances were also buried. The IDF said six of the 15 people killed were linked to Hamas, but revealed no detail to support the claim.  The newly emerged footage of the incident was discovered on a phone belonging to one of the workers who was killed, PRCS president Dr Younis Al Khatib said. \"His phone was found with his body and he recorded the whole event,\" he said. \"His last words before being shot, 'Forgive me, mom. I just wanted to help people. I wanted to save lives'.\" Sky News used an aftermath video and satellite imagery to verify the location and timing of the newly emerged footage of the incident. More from Sky News:Israeli troops expand Gaza 'security zone'What happened to the ceasefire?  It was filmed on 23 March north of Rafah and shows a convoy of marked ambulances and a fire-fighting vehicle travelling south along a road towards the city centre. All the vehicles visible in the convoy have their flashing lights on. The footage was filmed early in the morning, with a satellite image seen by Sky News taken at 9.48am local time on the same day showing a group of vehicles bunched together off the road."
    },
    {
        "title": "France needs to sort its political mess - or populist winds blowing from the US will strengthen",
        "description": "Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world.",
        "url": "https://news.sky.com/story/france-needs-to-sort-its-political-mess-or-else-the-populist-winds-blowing-from-the-us-will-strengthen-13341745",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marine-le-pen-donald-trump_6876068.png?20250404162436",
        "type": "World",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "France and Europe need effective leadership from a French president - the unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty for both her friends and foes.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world. Take just the members of the G7 - so-called rich, industrialised democracies. Italy elected Giorgia Meloni in 2022, confirming the rise of the far-right. She was not only Italy's first female leader, she was also the first from a neo-fascist party since Mussolini. The arrival of Donald Trump and Sir Keir Starmer changed the complexion of politics in the US and the UK last year. Germany elected a more hawkish chancellor in waiting this spring. Barring accidents, the next potentially transformative election in what used to be called the \"Western alliance\" will not be for two years. France is due to elect a new president to succeed Emmanuel Macron in the summer of 2027. The contest is already plagued by undercurrents of disruption, conflict between politicians and the law, and populism - similar to the fires burning elsewhere in the US and Europe. This week French judges banned the frontrunner to win the presidency from running for office for the next five years. It looked as though they have knocked Marine Le Pen out of the race. Nobody, least of all her, the leader of the far-right Rassemblement National (RN), knows what is going to happen next in French politics. \n                  Donald Trump calls Marine Le Pen's conviction a 'witch hunt' - as judge given police protection \n                 \n                  Andrew and Dawn Searle: Deaths of British couple in France 'treated as murder-suicide'\n                 \n                  Marine Le Pen's political career is in tatters after being found guilty of embezzlement\n                 In opinion polls just over half of the French population, between 54% and 57%, agreed that justice had run its course. \"The law is the same for everyone,\" President Macron declared. After lengthy consideration by a tribunal of three judges, Le Pen and nine other former RN MEPs were found guilty of illegally siphoning off some €4.4m (£3.7m) of funds from the European Parliament for political operations in France, not for personal gain. Le Pen was sentenced to a five-year ban and four years in prison, not to begin before the appeals process had been concluded. Even then that sentence in France would normally amount to two years' house arrest wearing an ankle alarm.  French presidents, such as Jacques Chirac and Nicolas Sarkozy, have been convicted before. Controversy is flaring because Le Pen was given an extra punishment: the immediate ban on running for political office, starting this week. Le Pen and Jordan Bardella, her second in command at RN, likened the ban to a \"nuclear bomb\" and a \"political death penalty\". Speaking in L'Assemblee Nationale, of which she is still a member, Le Pen identified herself with Alexei Navalny, the dissident leader murdered in Russia, and Ekrem Imamoglu, the recently imprisoned Turkish opposition leader and mayor of Istanbul. The ban was imposed at the discretion of the chief judge Benedicte de Perthuis, a former business consultant, Francois Bayrou, France's Macronist prime minister admitted he was \"troubled\" by the verdict. Not surprisingly perhaps from him, since the prosecution is appealing against verdicts in a similar case of political embezzlement, in which Bayrou's party was found guilty but he was acquitted, escaping any possibility of a ban. Bayrou is expected to be a candidate for the presidency. Meanwhile, RN has the power to bring down his government since it is the largest party in the Assembly, with 37%, but was kept out of power by a coalition. Populist forces on both sides of the Atlantic rushed to support Marine Le Pen. Matteo Salvini in Italy, Geert Wilders in the Netherlands and Vladimir Putin's spokesperson Dmitry Peskov all denounced what they saw as a \"violation of democratic norms\". Hungary's Viktor Orban said on X \"Je suis Marine Le Pen\". Orban's post came on the same platform Donald Trump Jr posted that \"JD Vance was right about everything\", a reference to the US vice president's speech at the Munich Security Conference in which he claimed Europe was silencing populist opposition. President Trump weighed in: \"The Witch Hunt against Marine Le Pen is another example of European Leftists using Lawfare to silence Free Speech… it is the same 'playbook' that was used against me.\" Le Pen has called for bans and tough sentences for corrupt politicians from other parties. In France, mainstream commentators are accusing her of hypocrisy and \"Trumpisme\" for attacking the courts now. They also allege, or rather hope, that RN's anger is endangering Marine Le Pen's drive to make her party respectable with her so-called \"wear a neck-tie strategy\", designed to dispel the loutish, racist image of her father's Front National.  For all the protests, justice and politics are now inextricably mixed in France. A ban from political campaigning would be pointless for most convicts, who have no political ambitions. Any suggestion that Le Pen was just being treated like any other citizen was dispelled when it was announced that her appeal would be speeded up to take place next summer. The president of the court de cassation conceded: \"Justice knows how to adjust to circumstances... an election deadline in this case.\" The ban could be lifted in time to give Le Pen a year to stand for the presidency. At this stage, a full acquittal seems unlikely, given the weight of evidence against RN. That is awkward for her and her party because, presumably, she would be campaigning while under house arrest. The best course of action for 29-year-old Jordan Bardella, Le Pen's apparent successor, or \"Dauphin\", would be to stick with her now. He would gain little if he split RN by insisting she is fatally wounded. 👉 Listen to Sky News Daily on your podcast app 👈 If she loses her appeal in a year's time, his loyalty and indignation would be likely to boost his candidacy. Conventional wisdom is that without a lift he may be slick, but is too callow and too square to stand a chance of becoming president in 2027. The far right in France is no different from the far right elsewhere - prone to internal rivalries and in-fighting. The craggy intellectual Eric Zemmour came fourth in the first round in the last presidential contest in 2022. Back then he had the support of Marion Marechal-Le Pen, Marine Le Pen's flighty niece. The two have since fallen out and may separately bid to carry the far-right torch. Macron is riding high as an international statesman but he is unpopular at home. Even if he wanted to, he cannot stand again because of term limits. His attempts to spawn an heir apparent have failed. The 34-year-old prime minister Gabriel Attal led Ensemble to crushing defeat in last year's parliamentary elections. Current prime minister Bayrou, and former prime minister Edouard Philippe, will probably make a bid for the centre-right vote. Bruno Retailleau, the trenchantly hardline interior minister, looks a stronger candidate for the Gaullist Les Republicains. Read more: Le Pen's political career is in tattersEuropean far-right welcomes Trump 2.0 In the last presidential contest, Jean-Luc Melenchon of the hard-left La France Insoumise came third. He may fancy his chances of getting into the final two in 2027 against a right-wing candidate, unless the Socialists get it together. Or perhaps he may let through two finalists from the right and the extreme right. It is a mess. France and Europe need effective leadership from a French president. The unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty. Her supporters are outraged and her foes no longer know who they are fighting against. The French establishment thinks it will all blow over. Just as likely the controversy in France will strengthen the populist winds blowing across the continent and the US."
    },
    {
        "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
        "description": "Two Labour MPs have been denied entry to Israel and deported.",
        "url": "https://news.sky.com/story/labour-mps-yuan-yang-and-abtisam-mohamed-denied-entry-and-deported-from-israel-13343009",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:39:00",
        "Headline": "UK Foreign Secretary David Lammy reacted to news of the MPs being deported saying he had made it \"clear\" to his Israeli counterparts that it's \"no way to treat British parliamentarians\".",
        "Content": "Two Labour MPs have been denied entry to Israel and deported. Yuan Yang and Abtisam Mohamed were rejected because they were suspected of plans to \"document the activities of security forces and spread anti-Israel hatred\", according to a statement from the Israeli immigration ministry. Ms Yang, who represents Earley and Woodley, and Ms Mohamed, the MP for Sheffield Central, both flew to the country from Luton on Saturday. According to a statement from the Israeli immigration ministry, they were accompanied by two assistants and during questioning, the MPs claimed they were visiting Israel \"as part of an official parliamentary delegation\". The ministry branded their claim as \"false\", but UK Foreign Secretary David Lammy reacted to news of the MPs' detention saying their treatment while \"on a parliamentary delegation to Israel\" was \"unacceptable\". Israel's UK embassy said the MPs were denied entry to Israel \"after accusing Israel of false claims, calling for a boycott, spreading lies, and actively promoting sanctions against Israeli ministers while supporting campaigns aimed at boycotting the State of Israel\". Read more from Sky News:Major UK carmaker to 'pause' US shipments over Trump tariffsTwo people die after caravan fire at holiday park \n                  New video undermines Israel's account of aid worker deaths - and suggests cover-up somewhere along chain\n                 \n                  Video emerges of aid workers being fired on in Gaza - contradicting Israeli account of deadly attack\n                 \n                  Israeli troops expand 'security zone' in northern Gaza - after announcing plans to seize areas of south\n                 A statement added: \"The visit was intended to provoke, harm Israeli citizens, and spread falsehoods about them. It is Israel's responsibility to prevent the entry of such individuals (just as is the practice in the United Kingdom).\" Mr Lammy said in a statement to Sky News: \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities. \"I have made clear to my counterparts in the Israeli government that this is no way to treat British parliamentarians, and we have been in contact with both MPs tonight to offer our support. \"The UK government's focus remains securing a return to the ceasefire and negotiations to stop the bloodshed, free the hostages and end the conflict in Gaza.\""
    },
    {
        "title": "Spain protests: Hundreds of thousands march against housing crisis fuelled by tourism boom",
        "description": "Hundreds of thousands of people have marched in 40 Spanish cities to protest against soaring rents and a lack of affordable homes &#8211; amid a housing crisis fuelled in part by a tourism boom. ",
        "url": "https://news.sky.com/story/spain-protests-hundreds-of-thousands-march-against-housing-crisis-fuelled-by-tourism-boom-13342602",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-madrid-protest-spain_6877079.jpg?20250405171242",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 15:24:00",
        "Headline": "In Madrid, people rattled keys as they walked through the city's streets and chanted: \"Get Airbnb out of our neighbourhoods.\" ",
        "Content": "Hundreds of thousands of people have marched in 40 Spanish cities to protest against soaring rents and a lack of affordable homes – amid a housing crisis fuelled in part by a tourism boom.  Thousands took to the streets in cities including Madrid and Barcelona in demonstrations organised by housing activists and backed by Spain's main labour unions. In Madrid, more than 150,000 protesters marched through the capital's centre, according to the local tenants' union. People rattled keys as they walked through the city's streets, while some held up signs against short-term rentals and chanted: \"Get Airbnb out of our neighbourhoods.\" Average Spanish rents have doubled and house prices have swelled by over 44% in the past decade, according to data from property website Idealista. The supply of residential rentals has halved since the 2020 pandemic, while short-term rentals have increased very quickly in major cities and coastal destinations. A 65-year-old resident who lives in Madrid's popular Lavapies neighbourhood said building owners have told nearly 100 families in her block that their rental contracts are not being renewed. \"They're kicking all of us out to make tourist flats,\" Margarita Aizpuru said. The housing crisis has created a generation of disgruntled young people who say they have to stay with their parents or pay out large sums for shared apartments, with little chance of saving enough to eventually buy their own property. Even those with traditionally well-paying jobs are struggling. More world news:Video sheds new light on Gaza aid worker deathsZelenskyy makes dig at the US Mari Sanchez, a 26-year-old lawyer in Madrid, said: \"I'm living with four people and still, I allocate 30 or 40% of my salary to rent. That doesn't allow me to save. That doesn't allow me to do anything. \"It doesn't even allow me to buy a car. That's my current situation, and the one many young people are living through.\" In Mallorca, people marched in the city of Palma with placards featuring messages including \"Mallorca is not for sale\" and \"no houses without people, nor people without houses\". A record 94 million tourists visited Spain in 2024 - making it the second most-visited country in the world, behind France. Some local governments have launched their own crackdowns on short-term rentals. Last year, Barcelona's city government pledged to phase out its 10,000 permits for short-term lets, many of which are advertised on platforms such as Airbnb, by 2028."
    },
    {
        "title": "Number of deaths from Myanmar earthquake rises - as US aid workers 'laid off' after arriving to help",
        "description": "The number of deaths from last week's earthquake in Myanmar has risen to 3,354, as UN agencies and foreign donors continue to ramp up the emergency response. ",
        "url": "https://news.sky.com/story/number-of-deaths-from-myanmar-earthquake-rises-as-us-aid-workers-laid-off-after-arriving-to-help-13342489",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-amarapura-myanmar-earthquake_6876860.jpg?20250405151339",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 14:04:00",
        "Headline": "A further 4,850 people are injured and 220 missing - while rescuers have saved 653 survivors trapped under the debris, according to Myanmar state-run media.",
        "Content": "The number of deaths from last week's earthquake in Myanmar has risen to 3,354, as UN agencies and foreign donors continue to ramp up the emergency response.  Amid rescue and recovery efforts, a former US government worker has said three of the country's aid workers have lost their jobs - saying they were informed after landing in Myanmar. The 7.7 magnitude quake caused significant damage across six regions, including the capital Naypyitaw, with damage to roads and bridges making it difficult to asses the extent of the devastation. The disaster worsened the country's already dire humanitarian crisis, caused by the civil war which has displaced more than 3 million people, according to the United Nations. The state-run Global New Light of Myanmar newspaper today reported the number of deaths from last Friday's quake has reached 3,354, with 4,850 people injured and 220 missing. Rescuers have saved 653 survivors trapped under the debris, the paper added.  The updated number of deaths comes as a former official at the US Agency for International Development (USAID) said three workers who had travelled to Myanmar to help rescue and recovery efforts were this week told they are losing their jobs. \n                  Volodymyr Zelenskyy takes swipe at US over 'weak' comment on Russian attack - as Ukrainian drones strike factory\n                 \n                  IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked\n                 \n                  Global markets have given Trump a clear no-confidence vote - and his fickleness is making the problem worse  \n                 \"This team is working incredibly hard, focused on getting humanitarian aid to those in need. To get news of your imminent termination - how can that not be demoralising?\" Marcia Wong told Reuters. More from Sky News:Why the earthquake was so destructiveTeens trapped in rubble record their ordeal Ms Wong said the terminations will take effect in a few months. She said she is still in contact with remaining USAID staff and found out about the terminations after an all-staff meeting on Friday. Donald Trump's government pledged at least $9m to Myanmar after the earthquake, but the administration's massive cuts to USAID have hindered its ability to respond.  The Trump administration has fired nearly all USAID staff in recent weeks, after the Elon Musk-led Department of Government Efficiency slashed funding and dismissed contractors. Former USAID staff say most of the people who would have coordinated the Myanmar response are among those let go, while third-party partners have lost contracts."
    },
    {
        "title": "North Korea: Kim Jong Un test-fires 'new sniper rifle' while visiting special forces",
        "description": "Kim Jong Un has been pictured firing a \"new sniper rifle\" as he watched special forces training at a military base.",
        "url": "https://news.sky.com/story/north-korea-kim-jong-un-test-fires-new-sniper-rifle-while-visiting-special-forces-13342294",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-jong-un-north-korea_6876613.jpg?20250405134212",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-05 11:04:00",
        "Headline": "The North Korean leader visits the military training base of his special forces troops.",
        "Content": "Kim Jong Un has been pictured firing a \"new sniper rifle\" as he watched special forces training at a military base. The North Korean leader, 41, test-fired the weapon, which will be supplied to such units and was developed using the country's technology, according to state media. It said he learned about the rifle's results and expressed satisfaction over its performance and power. Mr Kim was also seen pointing at a hole right in the centre of a target. It was unclear whether it was from a bullet that he had fired. At the military base, the leader watched on from an observation post as heavily-camouflaged troops posed with their guns, and ran across fields to fight inside a building. The demonstration of soldiers and guns and martial arts, with troops smashing bricks, came after the US and South Korea carried out joint military exercises, which North Korea has complained about. Last month, Mr Kim's sister threatened the Trump administration with retaliatory action for stepping up \"provocations\" with the deployment of a US aircraft carrier to South Korea. The warning from Kim Yo Jong, a powerful official in her brother's regime, implies North Korea will likely ramp up weapons testing activities and maintain its confrontational posture against the US. Mr Kim said boosting the strength of special forces was a key part of his country's military strategy, as he outlined a set of major tasks aimed at increasing the army's capabilities. \"Strengthening of the special operation forces constitutes a major component of the army-building strategy at present,\" KCNA quoted Mr Kim as saying. The state news agency did not give any details of the major tasks. North Korean special operations units are among the thousands of troops that Pyongyang has sent to Russia to fight in the Ukraine war, according to South Korea. Read more from Sky News:Video emerges of aid workers being fired on in GazaHundreds of names removed from official Gaza war death list Analysts say North Korea could benefit from providing weapons and troops by getting battlefield experience. But the military has suffered heavy losses, Kyiv claims. Moscow and Pyongyang initially rejected reports of the deployment. But in October 2024, Russian President Vladimir Putin did not deny that North Korean troops were in Russia, and a North Korean official said any such move would be lawful."
    },
    {
        "title": "Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states",
        "description": "Thousands of people gathered in various cities across the US as protests against Donald Trump and Elon Musk took place in all 50 states on Saturday.",
        "url": "https://news.sky.com/story/thousands-protest-against-donald-trump-and-elon-musk-at-rallies-in-all-50-us-states-13343002",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-washington-trump-protest_6877496.jpg?20250405220504",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:08:00",
        "Headline": "The \"Hands Off!\" protests were against the Trump administration's handling of government downsizing, human rights and the economy, among other issues.",
        "Content": "Thousands of people gathered in various cities across the US as protests against Donald Trump and Elon Musk took place in all 50 states on Saturday. Around 1,200 demonstrations were planned in locations including Washington DC, New York City and West Palm Beach, Florida - just miles away from where the US president has this weekend played golf. The \"Hands Off!\" protests were against the Trump administration's handling of government downsizing, human rights and the economy, among other issues. In Washington DC, protesters streamed on the grass in front of the Washington Monument, where one person carried a banner which read: \"Make democracy great again.\" Another protester took aim at Mr Trump's handling of Russia and Ukraine, with a placard that read: \"Stop Putin's puppets from destroying America.\" Tesla boss Mr Musk also featured on many signs due to his role in controversial government cuts as head of the newly created Department of Government Efficiency (DOGE). Terry Klein, a retired biomedical scientist, said she drove to the rally to protest Mr Trump's policies on \"everything from immigration to the DOGE stuff to the tariffs this week, to education\". \n                  Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'\n                 \n                  Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 \"I mean, our whole country is under attack, all of our institutions, all the things that make America what it is,\" she added. Some at the various protests carried Ukrainian flags, while others sported rainbow attire and waved rainbow flags in support of the LGBTQ+ community. Other protesters wore Palestinian keffiyeh scarves and carried \"Free Palestine\" signs. News correspondent It was built to honour George Washington, a founding father of the United States. And in the shadow of the 555ft Washington Monument, protestors were refusing to accept Donald Trump’s policies lying down. \"Stand tall,\" they chanted, again and again. \"In every city, stand tall. In every state, stand tall. In truth, stand tall. In justice, stand tall.\" Those words, shouted by thousands on the city’s iconic mall, were reinforced by the words on their placards and t-shirts. A minister, wearing a t-shirt with 'Troublesome Priest' printed on it, told me she found what was happening in the US government \"appalling and immortal\". One man said he had won the long-distance award, having travelled 2,750 miles from Hawaii for the protest. \"I finally reached a breaking point,\" he added. \"I couldn’t take it anymore.\"  Another woman said: \"We have to speak up, we have to act, we have to do something, because this is not America.\" I asked her what she would say to those who argue the people did speak when they elected Donald Trump as president. She replied: \"Some people have spoken and then some people have not and those of us that have not, we need to speak now.\"  Thousands marched in New York City's midtown Manhattan and in Boston, Massachusetts, while hundreds gathered in the sunshine outside the Utah State Capitol building in Salt Lake City, and in the rain outside the Statehouse in Columbus, Ohio. 👉 Follow Trump 100 on your podcast app 👈 Mr Trump - who shook financial markets with his tariffs announcement this week - spent the day in Florida, playing a round of golf before returning to his Mar-a-Lago residence. Some four miles from Mar-a-Lago, more than 400 people gathered - and drivers honked their horns in support of protesters who held up signs including one which read: \"Markets tank, Trump golfs.\" The White House has said Mr Trump plans to go golfing again on Sunday."
    },
    {
        "title": "Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'",
        "description": "An artist whose official portrait of Donald Trump was publicly criticised by the president said her business is now \"in danger of not recovering\".",
        "url": "https://news.sky.com/story/artist-behind-trump-portrait-criticised-by-president-as-truly-the-worst-says-business-in-danger-of-not-recovering-13343013",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-portrait_6865704.jpg?20250324130743",
        "type": "US",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "Sarah Boardman, the artist behind an official portrait of Donald Trump which the president said was \"truly the worst\", says the viral backlash has put her 41-year-old business at risk.",
        "Content": "By Claire Gilbody Dickerson, news reporter  An artist whose official portrait of Donald Trump was publicly criticised by the president said her business is now \"in danger of not recovering\". The Republican leader made headlines at the end of last month when, in a post on his Truth Social platform, he said the portrait hanging in Colorado's State Capitol had been \"purposefully distorted\". Following the criticism, officials said the portrait would be taken down and it has since been removed. Sarah Boardman, the British artist who painted the Trump portrait, said in a statement to Sky News she felt her \"intentions, integrity, and abilities\" had been \"called into question\" when the president criticised the oil painting. In his post, Mr Trump said a portrait by the same artist of former US president Barack Obama was \"wonderful\" but \"the one on me is truly the worst\". Read more from Sky News:Thousands protest against Trump at rallies in every US stateDo Trump's numbers on tariffs really add up? Referring to Ms Boardman, whose collection of official portraits also includes one of former president George W Bush, Mr Trump said \"she must have lost her talent as she got older\". \n                  Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states\n                 \n                  Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                  He then added: \"In any event, I would much prefer not having a picture than having this one.\" 'Changed for the worst' Almost two weeks since the criticism, Ms Boardman has now responded saying her business has been detrimentally impacted. She said: \"President Trump is entitled to comment freely, as we all are, but the additional allegations that I 'purposefully distorted' the portrait, and that I 'must have lost my talent as I got older' are now directly and negatively impacting my business of over 41 years which now is in danger of not recovering.\" The artist also described how \"for the six years that the portrait hung in the Colorado State Capitol Building Rotunda, I received overwhelmingly positive reviews and feedback\". \"Since President Trump's comments, that has changed for the worst,\" she added. 👉 Follow Trump 100 on your podcast app 👈 Ms Boardman said the Colorado State Capitol Advisory Committee, Denver, commissioned her to paint the official portrait of President Trump for the Denver State Capitol Gallery of Presidents. \"The reference photograph and my subsequent 'works in progress' were all approved, throughout that process, by that committee,\" she said. \"I completed the portrait accurately, without 'purposeful distortion', political bias, or any attempt to caricature the subject, actual or implied. I fulfilled the task per my contract.\""
    },
    {
        "title": "Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs",
        "description": "Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump&#8217;s tariffs.",
        "url": "https://news.sky.com/story/jaguar-land-rover-to-pause-us-shipments-over-donald-trump-tariffs-13342440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-jaguar-land-rover_6876730.jpg?20250405140117",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-05 13:44:00",
        "Headline": "The UK carmaker exported around 38,000 cars to the country in the third quarter of 2024.",
        "Content": " Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump’s tariffs. The US president has introduced a 25% levy on all foreign cars imported into the country, which came into force on Thursday. JLR, one of the country's biggest carmakers, exported about 38,000 cars to the US in the third quarter of 2024 - almost equal to the amount sold to the UK and the EU combined. Follow live updates: Trump's baseline 10% tariff kicks in In a statement on Saturday, a spokesperson for the company behind the Jaguar, Land Rover and Range Rover brands said: \"The USA is an important market for JLR's luxury brands. \"As we work to address the new trading terms with our business partners, we are taking some short-term actions including a shipment pause in April, as we develop our mid- to longer-term plans.\" The company released a statement last week before Mr Trump announced a \"baseline\" 10% tariff on goods from around the world, which kicked in on Saturday morning, on what he called \"liberation day\". \n                  Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'\n                 \n                  Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 JLR reassured customers its business was \"resilient\" and \"accustomed to changing market conditions\". \"Our priorities now are delivering for our clients around the world and addressing these new US trading terms,\" the firm said. Trading across the world has been hit by Mr Trump's tariff announcement at the White House on Wednesday. All but one stock on the FTSE 100 fell on Friday - with Rolls-Royce, banks and miners among those to suffer the sharpest losses. Read more: A red wall on Wall Street - but Trump seems to believe it will work out Cars are the top product exported from the UK to the US, with exports worth £8.3bn in the year to the end of September 2024, according to data from the Office for National Statistics. For UK carmakers, the US is the second largest export market behind the European Union. Industry groups have previously warned the tariffs will force firms to rethink where they trade, while a report by thinktank the Institute for Public Policy Research said more than 25,000 car manufacturing jobs in the UK could be at risk."
    },
    {
        "title": "Volodymyr Zelenskyy takes swipe at US over 'weak' comment on Russian attack - as Ukrainian drones strike factory",
        "description": "Ukrainian President Volodymyr Zelenskyy has hit out at the US over its \"weak\" response to lethal Russian attacks on his hometown on Friday.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-takes-swipe-at-us-over-weak-comment-on-russian-attack-as-ukrainian-drones-strike-factory-13342331",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kryvyi-rih-ukraine_6876719.jpg?20250405134804",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-05 12:05:00",
        "Headline": "President Zelenskyy taunted America for its \"weak\" response to Russian strikes on his hometown, which killed 19 people.",
        "Content": "Ukrainian President Volodymyr Zelenskyy has hit out at the US over its \"weak\" response to lethal Russian attacks on his hometown on Friday. President Zelenskyy posted a lengthy and emotional statement on X about Russia's strikes on Kryvyi Rih, which killed 19 people. Meanwhile Ukrainian drones hit an explosives factory in Russia's Samara region in an overnight strike, a member of Ukraine's SBU security service told Reuters. In his post, President Zelenskyy accused the United States of being \"afraid\" to name-check Russia in its comment on the attack. \"Unfortunately, the reaction of the American Embassy is unpleasantly surprising: such a strong country, such a strong people - and such a weak reaction,\" he wrote on X. \"They are even afraid to say the word \"Russian\" when talking about the missile that killed children.\" America's ambassador to Ukraine Bridget Brink had written on X: \"Horrified that tonight a ballistic missile struck near a playground and restaurant in Kryvyi Rih. \"More than 50 people injured and 16 killed, including 6 children. This is why the war must end.\"  President Zelenskyy went on in his post to say: \"Yes, the war must end. But in order to end it, we must not be afraid to call a spade a spade. \"We must not be afraid to put pressure on the only one who continues this war and ignores all the world's proposals to end it. We must put pressure on Russia, which chooses to kill children instead of a ceasefire.\" Grandmother 'burned to death in her home' Oleksandr Vilkul, head of the city's defense council, said the missile attack, followed by a drone attack, had killed 19 people, including nine children. \"The Iskander-M missile strike with cluster munitions at the children's playground in the residential area, to make the shrapnel fly further apart, killed 18 people. \"One grandmother was burnt to death in her house after Shahed's direct hit.\" Russia's defence ministry said it had struck a military gathering in a restaurant - an assertion rebutted by the Ukrainian military as misinformation. \"The missile hit right on the street - around ordinary houses, a playground, shops, a restaurant,\" President Zelenskyy wrote. Mr Zelenskyy also detailed the child victims of the attack including \"Konstantin, who will be 16 forever\" and \"Arina, who will also be 7 forever\". The UK's chief of the defence staff Sir Tony Radakin said he had met the Ukrainian leader on Friday, along with French armed forces leader General Thierry Burkhard. \"Britain and France are coming together & Europe is stepping up in a way that is real & substantial, with 200 planners from 30 nations working to strengthen Ukraine's long term security,\" Sir Tony wrote. The UK and France have spearheaded a so-called \"coalition of the willing\" - a group of countries that have pledged to help Ukraine secure if a ceasefire deal is reached with Russia."
    },
    {
        "title": "US TikTok ban delayed again after China stalls on deal over tariffs",
        "description": "Donald Trump has delayed a potential ban on TikTok for a second time - after China reportedly stalled on a deal to sell its US operations in response to his \"Liberation Day\" tariffs.",
        "url": "https://news.sky.com/story/us-tiktok-ban-delayed-again-after-china-stalls-on-deal-over-tariffs-13342163",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-05 06:23:00",
        "Headline": "Donald Trump announces he is extending the deadline on a US TikTok ban again, claiming the potential deal for China to sell its US operation \"requires more work to ensure all necessary approvals are signed\".",
        "Content": "Donald Trump has delayed a potential ban on TikTok for a second time - after China reportedly stalled on a deal to sell its US operations in response to his \"Liberation Day\" tariffs. The short-form video app was set to be banned in the US the day before Mr Trump returned to the White House in January unless its Chinese owner ByteDance agreed to sell its US operations to a non-Chinese buyer. Trump's 10% tariffs kick in worldwide - follow latest But on his inauguration on 20 January Mr Trump signed an executive order delaying the deadline. On Friday, Mr Trump announced he is extending the deadline again by 75 days, claiming the potential sales deal \"requires more work to ensure all necessary approvals are signed\". \"We hope to continue working in good faith with China,\" he wrote on social media, adding he \"understands\" that Beijing is \"not very happy about our reciprocal tariffs\". As part of his \"Liberation Day\" - Mr Trump increased tariffs on Chinese goods coming into the US from 20% to 54%, prompting retaliation from China. Beijing said it would respond with its own 34% tariff on imports of all US products from 10 April. Mr Trump added on Friday: \"We look forward to working with TikTok and China to close the deal.\" ByteDance said in a statement on the Chinese social media platform WeChat on Friday: \"We are still in talks with the US government, but no agreement has been reached and the two sides still have differences on many key issues.\" It added that \"in accordance with Chinese law, any agreement is subject to the relevant review procedures\". Read moreTikTok returns to US app storesAnalysis: Trump tariffs are about powerAnalysis: Tariffs spark red wall on Wall Street  The deal would have seen TikTok's US arm run by a new US-based company - with majority owned US investors and ByteDance having a stake of less than 20%. It had been approved by existing and new investors, ByteDance, and the US government, sources told the Reuters news agency. But Chinese government approval appears to remain an issue. The Chinese embassy in Washington said in a statement on Friday: \"China has stated its position on TikTok on multiple occasions. \"China has always respected and protected the legitimate rights and interests of enterprises and opposed practices that violate the basic principles of the market economy.\" Mr Trump has said he would be willing to reduce tariffs on China to ensure a TikTok deal. His administration has said he is in touch with four different groups over the deal - but has not revealed who they are. The original law that would have imposed a ban received overwhelming bipartisan support and was signed by former US President Joe Biden. Both Democrats and Republicans were agreed on their concerns TikTok could be used by the Chinese government to spy on Americans. In the UK, TikTok remains banned on all UK government phones - despite ministers launching an official account for the government. The 'UK Gov' account was created last week and has so far posted a series of public service messages on topics including digital driving licences and Labour's plan to boost neighbourhood policing."
    },
    {
        "title": "Santander UK lines up ex-Treasury chief Scholar as new chair",
        "description": "Sir Tom Scholar, the former top Treasury civil servant sacked by Liz Truss during her premiership, is being lined up as the next chairman of Santander UK, Britain's fifth-biggest high street bank.",
        "url": "https://news.sky.com/story/santander-uk-lines-up-ex-treasury-chief-scholar-as-new-chair-13342220",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tom-scholar-tomscholar_6876514.png?20250405090759",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-05 08:02:00",
        "Headline": "Sir Tom Scholar, who was sacked as the Treasury's permanent secretary by Liz Truss, is the preferred candidate to chair Britain's fifth-biggest high street bank, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Sir Tom Scholar, the former top Treasury civil servant sacked by Liz Truss during her premiership, is being lined up as the next chairman of Santander UK, Britain's fifth-biggest high street bank. Sky News has learnt that Sir Tom, who played a pivotal role in the UK's response to the 2008 financial crisis, is the leading candidate to replace William Vereker. The appointment, which is subject to regulatory approval, could be announced later in the spring, according to insiders. Sir Tom's prospective recruitment comes amid a period of intense speculation about the future of Santander UK, which bulked up rapidly during the banking crisis by absorbing Alliance & Leicester and Bradford & Bingley. The Spanish banking giant entered the British retail market in 2004 when it bought Abbey National, setting in motion a chain of dealmaking which would result in it becoming a serious challenger to Barclays, Lloyds Banking Group and NatWest Group. If confirmed in the role, Sir Tom will follow a pattern of former senior public officials in taking on the chairmanship of Santander UK. The post has been held in the past by Baroness Vadera, a Treasury minister during the 2008 meltdown, and Lord Burns, the former Treasury permanent secretary. Sir Tom also held that latter role until his ousting during the shortlived Truss government, which led to him receiving a payoff of more than £350,000. In addition to his position during the banking crisis, he was instrumental in devising the COVID-19 furlough scheme, which protected millions of private sector jobs during the series of lockdowns imposed on the British public. He was widely respected among international banking regulators and finance ministers, and his sacking by Ms Truss sparked fury among senior civil servants. Since leaving the Treasury, he has been appointed as chair of the European operations of Nomura, the Japanese bank. At Santander UK, he will work closely with Mike Regnier, the former building society boss who has been its chief executive since 2022. In recent months, there has been growing speculation that Santander UK's parent is open to a sale of the business amid frustration about the scope and burden of British banking regulation. Both Barclays and NatWest have been sounded out about a potential merger of their UK retail businesses with that of Santander UK, although formal talks have not progressed to a meaningful stage. Ana Botin, Santander's group executive chair, has appeared to publicly rule out a disposal, saying that the UK remains a \"core market\" for the group. An attractively priced offer could yet gain Ms Botin's attention, according to people close to the earlier talks. One insider said, however, that Sir Tom's recruitment was likely to dampen further speculation about a possible sale of the British business. Shares in the Madrid-listed parent company, Banco Santander, have performed strongly in recent months, but fell by more than 8% on Friday as investors digested the fallout from President Donald Trump's global tariffs blitz. The company now has a market capitalisation of about €83.25bn (£70.7bn). City sources said the search for Mr Vereker's successor had been led by Heidrick & Struggles, the headhunter, in conjunction with Baroness Morgan, the former cabinet minister who sits on Santander UK's board as its senior independent director. This weekend, Santander UK said in a statement issued to Sky News: \"Santander UK is conducting a thorough appointment process. \"The new chair will be announced once that process has concluded, including having obtained board and regulatory approval.\" "
    },
    {
        "title": "Jaguar Land Rover to 'pause' US shipments over Donald Trump tariffs",
        "description": "Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump&#8217;s tariffs.",
        "url": "https://news.sky.com/story/jaguar-land-rover-to-pause-us-shipments-over-donald-trump-tariffs-13342440",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-jaguar-land-rover_6876730.jpg?20250405140117",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-05 13:44:00",
        "Headline": "The UK carmaker exported around 38,000 cars to the country in the third quarter of 2024.",
        "Content": " Jaguar Land Rover (JLR) has said it will \"pause\" shipments to the US as the British car firm works to \"address the new trading terms\" of Donald Trump’s tariffs. The US president has introduced a 25% levy on all foreign cars imported into the country, which came into force on Thursday. JLR, one of the country's biggest carmakers, exported about 38,000 cars to the US in the third quarter of 2024 - almost equal to the amount sold to the UK and the EU combined. Follow live updates: Trump's baseline 10% tariff kicks in In a statement on Saturday, a spokesperson for the company behind the Jaguar, Land Rover and Range Rover brands said: \"The USA is an important market for JLR's luxury brands. \"As we work to address the new trading terms with our business partners, we are taking some short-term actions including a shipment pause in April, as we develop our mid- to longer-term plans.\" The company released a statement last week before Mr Trump announced a \"baseline\" 10% tariff on goods from around the world, which kicked in on Saturday morning, on what he called \"liberation day\". \n                  Artist behind Trump portrait criticised by president as 'truly the worst' says business 'in danger of not recovering'\n                 \n                  Thousands protest against Donald Trump and Elon Musk at rallies in all 50 US states\n                 \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 JLR reassured customers its business was \"resilient\" and \"accustomed to changing market conditions\". \"Our priorities now are delivering for our clients around the world and addressing these new US trading terms,\" the firm said. Trading across the world has been hit by Mr Trump's tariff announcement at the White House on Wednesday. All but one stock on the FTSE 100 fell on Friday - with Rolls-Royce, banks and miners among those to suffer the sharpest losses. Read more: A red wall on Wall Street - but Trump seems to believe it will work out Cars are the top product exported from the UK to the US, with exports worth £8.3bn in the year to the end of September 2024, according to data from the Office for National Statistics. For UK carmakers, the US is the second largest export market behind the European Union. Industry groups have previously warned the tariffs will force firms to rethink where they trade, while a report by thinktank the Institute for Public Policy Research said more than 25,000 car manufacturing jobs in the UK could be at risk."
    },
    {
        "title": "Jaguar Land Rover's US exports announcement sparks anxiety in car-making hub Solihull",
        "description": "The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious.",
        "url": "https://news.sky.com/story/jaguar-land-rovers-us-exports-announcement-sparks-anxiety-in-car-making-hub-solihull-13342833",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-solihull-jaguar-land-rover_6877297.jpg?20250405181736",
        "type": "Business",
        "Author": "Becky Johnson",
        "Date Published": "2025-04-05 17:04:00",
        "Headline": "Manufacturing vehicles is in Solihull's DNA - and a warning that Donald Trump's tariffs could put 25,000 British car manufacturing jobs at risk is a real concern here.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  The decision by Jaguar Land Rover (JLR) to pause shipments of cars to the USA for the next month has made people in Solihull anxious. The plant in the West Midlands town employs around 10,000 people. Many more work in the supply chain. On the high street, one factory worker said they had been told not to speak to journalists about the company's decision. Another asked us not to name her but said: \"Everyone's talking about it.\" Tariffs latest: Anti-Trump protests take place Referring to a move by the company earlier this year, she added: \"They've already laid off agency staff, the worry is the next jobs to go will be staff jobs.\" Richard Shuttelworth, an 81-year-old who worked for JLR for over 30 years, told us: \"An awful lot of their trade is with America. \n                  Trump's 10% worldwide tariff kicks in as global stocks reel from crisis\n                 \n                  Day 76: How badly will China's own US tariffs go down with Trump?\n                 \n                  A red wall on Wall Street - but President Trump appears to believe it will all work out\n                 \"There are going to be a lot of jobs lost if they don't get it sorted.\" But he's uncertain about how the UK government should respond. \"When it comes to retaliation I just don't know,\" he says. \"At the moment I think they're playing it right. \"They should kind of play it cool if you like and just see if they can get a trade deal, because I think the tit for tat is just going to do nobody any good at all.\" This is a town with car-making in its DNA. A warning from the Institute For Public Policy Research that the tariffs could put 25,000 jobs at risk across British car manufacturing is a real concern here. \"It would be devastating to people, it really would,\" says Julie, 63. \"If you wipe that off the landscape, a chunk of people that not only work there but the families that have now got no income.\" That's what is worrying John Constable, who helps run his wife's family's carousel business in the town centre. Ironically, a New York taxi is among the favourite vehicles on the children's ride. If parents aren't earning, the business could grind to a halt. \"People are going to cut back aren't they?\" John says. \"They're going to watch their pennies which we all do […] yes it will have a knock-on effect.\" More from Sky News:Labour MP arrested on suspicion of rapeTwo die in holiday park caravan fire He's worried about a \"tit for tat\" trade war - but does think the government should keep all options open. \"I would monitor it to start with to see how things start to go and what effect it's going to have on the economy,\" he says. \"Then obviously if it's going to be devastating then they need to put something in place.\""
    },
    {
        "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
        "description": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences.",
        "url": "https://news.sky.com/story/labour-suspends-mp-dan-norris-after-arrest-13342856",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dan-norris-labour_6877329.jpg?20250405183946",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-05 17:24:00",
        "Headline": "Mr Norris, the MP for North East Somerset and Hanham, has been suspended by the Labour Party. ",
        "Content": "Labour MP Dan Norris has been arrested on suspicion of rape and child sex offences. A Labour Party spokesperson said: \"Dan Norris MP was immediately suspended by the Labour Party upon being informed of his arrest. \"We cannot comment further while the police investigation is ongoing.\" Police said a man in his 60s had been arrested on Friday on suspicion of sexual offences against a girl, rape, child abduction and misconduct in a public office. Sky News has contacted Mr Norris for comment. Mr Norris, 65, defeated Jacob Rees-Mogg to win the new seat of North East Somerset and Hanham in last year's general election. He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports. Avon and Somerset Police said in a statement: \"In December 2024, we received a referral from another police force relating to alleged non-recent child sex offences having been committed against a girl. \"Most of the offences are alleged to have occurred in the 2000s, but we're also investigating an alleged offence of rape from the 2020s. \"An investigation, led by officers within Operation Bluestone, our dedicated rape and serious sexual assault investigation team, remains ongoing and at an early stage. \"The victim is being supported and given access to any specialist help or support she needs. \"A man, aged in his 60s, was arrested on Friday (April 4) on suspicion of sexual offences against a girl (under the Sexual Offences Act 1956), rape (under the Sexual Offences Act 2003), child abduction and misconduct in a public office. He's been released on conditional bail for enquiries to continue. \"This is an active and sensitive investigation, so we'd respectfully ask people not to speculate on the circumstances so our enquiries can continue unhindered.\" Mr Norris first entered Parliament when Tony Blair came to power in 1997 and served as the Wansdyke MP until 2010. He was an assistant whip under Mr Blair and served as a junior minister under Gordon Brown. Mr Norris has also been West of England mayor since 2021 but is due to step down ahead of May's local elections. A spokesman for the League Against Cruel Sports, a UK-based animal welfare charity which campaigns to end sports such as fox hunting and game bird shooting, confirmed he had stepped down from his role. \"The charity cannot comment further while an investigation is ongoing,\" a statement said."
    },
    {
        "title": "Defence chiefs meet in Kyiv to discuss plans for future international 'reassurance force' in Ukraine",
        "description": "Defence chiefs have met in Kyiv to discuss the size and make-up of the proposed international \"reassurance force\" to back up any future peace deal in Ukraine. ",
        "url": "https://news.sky.com/story/defence-chiefs-meet-in-kyiv-to-discuss-plans-for-future-international-reassurance-force-in-ukraine-13342272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ukraine-donetsk_6875707.jpg?20250404101556",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-05 09:52:00",
        "Headline": "Defence Secretary Join Healey is set to convene the next meeting of the so-called \"coalition of the willing\" in Brussels next week. ",
        "Content": "Defence chiefs have met in Kyiv to discuss the size and make-up of the proposed international \"reassurance force\" to back up any future peace deal in Ukraine.  The UK's chief of the defence staff Admiral Sir Tony Radakin joined his Ukrainian and French counterparts on Saturday for discussions about how to bolster the country's military. Their meetings focused on the structure, size and composition needed for any armed force to back up an eventual peace deal, the Ministry of Defence said. \"The UK is ironclad in our support for Ukraine, which is why we're stepping up for a just and lasting peace,\" Admiral Radakin said. \"Our meetings looked at how we can build on the formidable capabilities of the Ukrainian Army and put them in the strongest possible position to deter Russian aggression.\"  It comes after at least 19 people were killed in a Russian attack on Ukrainian president Volodymyr Zelenskyy's home city and as the UK's defence secretary is set to convene the next meeting of the so-called \"coalition of the willing\" on Thursday. With 30 countries expected to contribute to the coalition, John Healey will host defence ministers in Brussels alongside his French counterpart. He will then chair the Ukraine Defence Contact Group with his opposite number from Germany on Friday. \"Our coalition of nations, working at pace and willing to stand with Ukraine for the long-term, is a stark contrast to Russia who stand alone with only North Korea for a friend,\" Mr Healey said. \"As Putin prevaricates over a ceasefire, we will continue to ramp up our military planning, exploring the air, sea and land forces that could support a lasting peace in Ukraine. \"However, we will not jeopardise the peace by forgetting about the war. \"That's why in the week ahead we will also convene the Ukraine Defence Contact Group to supply Ukraine with the military equipment they need to put them in the strongest possible position as they fight back brutal, continuing Russian attacks.\" Read more: Who's in and out of coalition of the willing The UK and France have been at the forefront of the coalition, which would see armed forces from a number of European and NATO countries on the ground in Ukraine acting as peacekeepers. In theory they would deter any further Russian aggression and violations of a potential ceasefire. But since the initial Russian invasion in February 2022, Vladimir Putin has said he will not accept NATO troops in Ukraine - leaving many doubting Prime Minister Sir Keir Starmer's plan. Sir Keir hosted a virtual meeting of leaders in March after Mr Zelenskyy accepted a 30-day interim ceasefire agreement. The idea has been dismissed by the Trump administration, with US special envoy Steve Witkoff describing it as \"simplistic\" and \"posture and pose\". Downing Street has said it is still in the \"planning phase\" of how the coalition would work in practice - and has been so far unable to answer questions on operational details."
    },
    {
        "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
        "description": "Two Labour MPs have been denied entry to Israel and deported.",
        "url": "https://news.sky.com/story/labour-mps-yuan-yang-and-abtisam-mohamed-denied-entry-and-deported-from-israel-13343009",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-05 21:39:00",
        "Headline": "UK Foreign Secretary David Lammy reacted to news of the MPs being deported saying he had made it \"clear\" to his Israeli counterparts that it's \"no way to treat British parliamentarians\".",
        "Content": "Two Labour MPs have been denied entry to Israel and deported. Yuan Yang and Abtisam Mohamed were rejected because they were suspected of plans to \"document the activities of security forces and spread anti-Israel hatred\", according to a statement from the Israeli immigration ministry. Ms Yang, who represents Earley and Woodley, and Ms Mohamed, the MP for Sheffield Central, both flew to the country from Luton on Saturday. According to a statement from the Israeli immigration ministry, they were accompanied by two assistants and during questioning, the MPs claimed they were visiting Israel \"as part of an official parliamentary delegation\". The ministry branded their claim as \"false\", but UK Foreign Secretary David Lammy reacted to news of the MPs' detention saying their treatment while \"on a parliamentary delegation to Israel\" was \"unacceptable\". Israel's UK embassy said the MPs were denied entry to Israel \"after accusing Israel of false claims, calling for a boycott, spreading lies, and actively promoting sanctions against Israeli ministers while supporting campaigns aimed at boycotting the State of Israel\". Read more from Sky News:Major UK carmaker to 'pause' US shipments over Trump tariffsTwo people die after caravan fire at holiday park \n                  New video undermines Israel's account of aid worker deaths - and suggests cover-up somewhere along chain\n                 \n                  Video emerges of aid workers being fired on in Gaza - contradicting Israeli account of deadly attack\n                 \n                  Israeli troops expand 'security zone' in northern Gaza - after announcing plans to seize areas of south\n                 A statement added: \"The visit was intended to provoke, harm Israeli citizens, and spread falsehoods about them. It is Israel's responsibility to prevent the entry of such individuals (just as is the practice in the United Kingdom).\" Mr Lammy said in a statement to Sky News: \"It is unacceptable, counterproductive, and deeply concerning that two British MPs on a parliamentary delegation to Israel have been detained and refused entry by the Israeli authorities. \"I have made clear to my counterparts in the Israeli government that this is no way to treat British parliamentarians, and we have been in contact with both MPs tonight to offer our support. \"The UK government's focus remains securing a return to the ceasefire and negotiations to stop the bloodshed, free the hostages and end the conflict in Gaza.\""
    },
    {
        "title": "France needs to sort its political mess - or populist winds blowing from the US will strengthen",
        "description": "Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world.",
        "url": "https://news.sky.com/story/france-needs-to-sort-its-political-mess-or-else-the-populist-winds-blowing-from-the-us-will-strengthen-13341745",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marine-le-pen-donald-trump_6876068.png?20250404162436",
        "type": "Politics",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-05 23:01:00",
        "Headline": "France and Europe need effective leadership from a French president - the unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty for both her friends and foes.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world. Take just the members of the G7 - so-called rich, industrialised democracies. Italy elected Giorgia Meloni in 2022, confirming the rise of the far-right. She was not only Italy's first female leader, she was also the first from a neo-fascist party since Mussolini. The arrival of Donald Trump and Sir Keir Starmer changed the complexion of politics in the US and the UK last year. Germany elected a more hawkish chancellor in waiting this spring. Barring accidents, the next potentially transformative election in what used to be called the \"Western alliance\" will not be for two years. France is due to elect a new president to succeed Emmanuel Macron in the summer of 2027. The contest is already plagued by undercurrents of disruption, conflict between politicians and the law, and populism - similar to the fires burning elsewhere in the US and Europe. This week French judges banned the frontrunner to win the presidency from running for office for the next five years. It looked as though they have knocked Marine Le Pen out of the race. Nobody, least of all her, the leader of the far-right Rassemblement National (RN), knows what is going to happen next in French politics. \n                  Donald Trump calls Marine Le Pen's conviction a 'witch hunt' - as judge given police protection \n                 \n                  Andrew and Dawn Searle: Deaths of British couple in France 'treated as murder-suicide'\n                 \n                  Marine Le Pen's political career is in tatters after being found guilty of embezzlement\n                 In opinion polls just over half of the French population, between 54% and 57%, agreed that justice had run its course. \"The law is the same for everyone,\" President Macron declared. After lengthy consideration by a tribunal of three judges, Le Pen and nine other former RN MEPs were found guilty of illegally siphoning off some €4.4m (£3.7m) of funds from the European Parliament for political operations in France, not for personal gain. Le Pen was sentenced to a five-year ban and four years in prison, not to begin before the appeals process had been concluded. Even then that sentence in France would normally amount to two years' house arrest wearing an ankle alarm.  French presidents, such as Jacques Chirac and Nicolas Sarkozy, have been convicted before. Controversy is flaring because Le Pen was given an extra punishment: the immediate ban on running for political office, starting this week. Le Pen and Jordan Bardella, her second in command at RN, likened the ban to a \"nuclear bomb\" and a \"political death penalty\". Speaking in L'Assemblee Nationale, of which she is still a member, Le Pen identified herself with Alexei Navalny, the dissident leader murdered in Russia, and Ekrem Imamoglu, the recently imprisoned Turkish opposition leader and mayor of Istanbul. The ban was imposed at the discretion of the chief judge Benedicte de Perthuis, a former business consultant, Francois Bayrou, France's Macronist prime minister admitted he was \"troubled\" by the verdict. Not surprisingly perhaps from him, since the prosecution is appealing against verdicts in a similar case of political embezzlement, in which Bayrou's party was found guilty but he was acquitted, escaping any possibility of a ban. Bayrou is expected to be a candidate for the presidency. Meanwhile, RN has the power to bring down his government since it is the largest party in the Assembly, with 37%, but was kept out of power by a coalition. Populist forces on both sides of the Atlantic rushed to support Marine Le Pen. Matteo Salvini in Italy, Geert Wilders in the Netherlands and Vladimir Putin's spokesperson Dmitry Peskov all denounced what they saw as a \"violation of democratic norms\". Hungary's Viktor Orban said on X \"Je suis Marine Le Pen\". Orban's post came on the same platform Donald Trump Jr posted that \"JD Vance was right about everything\", a reference to the US vice president's speech at the Munich Security Conference in which he claimed Europe was silencing populist opposition. President Trump weighed in: \"The Witch Hunt against Marine Le Pen is another example of European Leftists using Lawfare to silence Free Speech… it is the same 'playbook' that was used against me.\" Le Pen has called for bans and tough sentences for corrupt politicians from other parties. In France, mainstream commentators are accusing her of hypocrisy and \"Trumpisme\" for attacking the courts now. They also allege, or rather hope, that RN's anger is endangering Marine Le Pen's drive to make her party respectable with her so-called \"wear a neck-tie strategy\", designed to dispel the loutish, racist image of her father's Front National.  For all the protests, justice and politics are now inextricably mixed in France. A ban from political campaigning would be pointless for most convicts, who have no political ambitions. Any suggestion that Le Pen was just being treated like any other citizen was dispelled when it was announced that her appeal would be speeded up to take place next summer. The president of the court de cassation conceded: \"Justice knows how to adjust to circumstances... an election deadline in this case.\" The ban could be lifted in time to give Le Pen a year to stand for the presidency. At this stage, a full acquittal seems unlikely, given the weight of evidence against RN. That is awkward for her and her party because, presumably, she would be campaigning while under house arrest. The best course of action for 29-year-old Jordan Bardella, Le Pen's apparent successor, or \"Dauphin\", would be to stick with her now. He would gain little if he split RN by insisting she is fatally wounded. 👉 Listen to Sky News Daily on your podcast app 👈 If she loses her appeal in a year's time, his loyalty and indignation would be likely to boost his candidacy. Conventional wisdom is that without a lift he may be slick, but is too callow and too square to stand a chance of becoming president in 2027. The far right in France is no different from the far right elsewhere - prone to internal rivalries and in-fighting. The craggy intellectual Eric Zemmour came fourth in the first round in the last presidential contest in 2022. Back then he had the support of Marion Marechal-Le Pen, Marine Le Pen's flighty niece. The two have since fallen out and may separately bid to carry the far-right torch. Macron is riding high as an international statesman but he is unpopular at home. Even if he wanted to, he cannot stand again because of term limits. His attempts to spawn an heir apparent have failed. The 34-year-old prime minister Gabriel Attal led Ensemble to crushing defeat in last year's parliamentary elections. Current prime minister Bayrou, and former prime minister Edouard Philippe, will probably make a bid for the centre-right vote. Bruno Retailleau, the trenchantly hardline interior minister, looks a stronger candidate for the Gaullist Les Republicains. Read more: Le Pen's political career is in tattersEuropean far-right welcomes Trump 2.0 In the last presidential contest, Jean-Luc Melenchon of the hard-left La France Insoumise came third. He may fancy his chances of getting into the final two in 2027 against a right-wing candidate, unless the Socialists get it together. Or perhaps he may let through two finalists from the right and the extreme right. It is a mess. France and Europe need effective leadership from a French president. The unnecessary judicial suspension of Marine Le Pen's candidacy has simply generated uncertainty. Her supporters are outraged and her foes no longer know who they are fighting against. The French establishment thinks it will all blow over. Just as likely the controversy in France will strengthen the populist winds blowing across the continent and the US."
    },
    {
        "title": "US TikTok ban delayed again after China stalls on deal over tariffs",
        "description": "Donald Trump has delayed a potential ban on TikTok for a second time - after China reportedly stalled on a deal to sell its US operations in response to his \"Liberation Day\" tariffs.",
        "url": "https://news.sky.com/story/us-tiktok-ban-delayed-again-after-china-stalls-on-deal-over-tariffs-13342163",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-05 06:23:00",
        "Headline": "Donald Trump announces he is extending the deadline on a US TikTok ban again, claiming the potential deal for China to sell its US operation \"requires more work to ensure all necessary approvals are signed\".",
        "Content": "Donald Trump has delayed a potential ban on TikTok for a second time - after China reportedly stalled on a deal to sell its US operations in response to his \"Liberation Day\" tariffs. The short-form video app was set to be banned in the US the day before Mr Trump returned to the White House in January unless its Chinese owner ByteDance agreed to sell its US operations to a non-Chinese buyer. Trump's 10% tariffs kick in worldwide - follow latest But on his inauguration on 20 January Mr Trump signed an executive order delaying the deadline. On Friday, Mr Trump announced he is extending the deadline again by 75 days, claiming the potential sales deal \"requires more work to ensure all necessary approvals are signed\". \"We hope to continue working in good faith with China,\" he wrote on social media, adding he \"understands\" that Beijing is \"not very happy about our reciprocal tariffs\". As part of his \"Liberation Day\" - Mr Trump increased tariffs on Chinese goods coming into the US from 20% to 54%, prompting retaliation from China. Beijing said it would respond with its own 34% tariff on imports of all US products from 10 April. Mr Trump added on Friday: \"We look forward to working with TikTok and China to close the deal.\" ByteDance said in a statement on the Chinese social media platform WeChat on Friday: \"We are still in talks with the US government, but no agreement has been reached and the two sides still have differences on many key issues.\" It added that \"in accordance with Chinese law, any agreement is subject to the relevant review procedures\". Read moreTikTok returns to US app storesAnalysis: Trump tariffs are about powerAnalysis: Tariffs spark red wall on Wall Street  The deal would have seen TikTok's US arm run by a new US-based company - with majority owned US investors and ByteDance having a stake of less than 20%. It had been approved by existing and new investors, ByteDance, and the US government, sources told the Reuters news agency. But Chinese government approval appears to remain an issue. The Chinese embassy in Washington said in a statement on Friday: \"China has stated its position on TikTok on multiple occasions. \"China has always respected and protected the legitimate rights and interests of enterprises and opposed practices that violate the basic principles of the market economy.\" Mr Trump has said he would be willing to reduce tariffs on China to ensure a TikTok deal. His administration has said he is in touch with four different groups over the deal - but has not revealed who they are. The original law that would have imposed a ban received overwhelming bipartisan support and was signed by former US President Joe Biden. Both Democrats and Republicans were agreed on their concerns TikTok could be used by the Chinese government to spy on Americans. In the UK, TikTok remains banned on all UK government phones - despite ministers launching an official account for the government. The 'UK Gov' account was created last week and has so far posted a series of public service messages on topics including digital driving licences and Labour's plan to boost neighbourhood policing."
    },
    {
        "title": "SpaceX tourists return to Earth after historic flight",
        "description": "Four space tourists have safely arrived back on Earth after completing a novel space route on board one of Elon Musk's SpaceX capsules.",
        "url": "https://news.sky.com/story/spacex-tourists-return-to-earth-after-historic-flight-13342197",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-spacex-dragon-capsule_6876565.jpg?20250405093828",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-05 07:47:00",
        "Headline": "Bitcoin investor Chun Wang took three people on board his private SpaceX flight, which went on a novel journey around the Earth's poles.",
        "Content": " Four space tourists have safely arrived back on Earth after completing a novel space route on board one of Elon Musk's SpaceX capsules. Bitcoin tycoon Chun Wang, who chartered the SpaceX flight, and three others splashed down off the Southern California coast on Friday, pumping their fists in celebration of the successful voyage. After taking off on Monday, it became the first human spaceflight to circle the globe above both the North Pole and South Pole - and the first Pacific splashdown for a space crew in 50 years. The crew passed over the icy masses roughly every 40 minutes from 270 miles in the air. The Dragon capsule was kitted out with a domed window that provides 360-degree views of the polar ice caps and everything in between. The Chinese-born Mr Wang, now a citizen of Malta, had invited three associates - Norwegian filmmaker Jannicke Mikkelsen, German robotics researcher Rabea Rogge and Australian polar guide Eric Philips - to join him on his private flight. They all met in Svalbard, the Norwegian Arctic archipelago, he wrote on X. Mr Wang declined to say how much he paid for the three and a half day trip. But the price tag reportedly comes in at $55m (£42m) per person. It is the sixth fully private space mission for Elon Musk's space company. SpaceX and its Dragon craft have dominated the emerging market for private space tourism. Dragon is the world's only capsule built by a private company - rather than a state-run organisation - that routinely flies missions in orbit. Its rival, Boeing's Starliner capsule, has been held up in development. 'So epic' \"It is so epic because it is another kind of desert, so it just goes on and on and on all the way,\" said researcher Ms Rogge in a video posted by Mr Wang on X while gazing down from miles above Earth. All four suffered from space motion sickness when they first reached orbit, but adjusted by day two, according to Mr Wang. The private astronauts conducted 22 research experiments during their mission, including exiting the capsule without the normal assistance from ground crew in a bid to demonstrate how easily people could walk off a spacecraft on the moon or Mars. Spaceflight, especially on much longer missions, is known to reduce bone density and muscle mass - and have other impacts on the body that have long been studied by the likes of NASA. SpaceX said it switched splashdown sites from Florida to the Pacific on safety grounds, as it would ensure any surviving pieces of the trunk - jettisoned at the end of a flight - would fall into the ocean. The last people to return from space to the Pacific were the three NASA astronauts assigned to the 1975 Apollo-Soyuz mission."
    },
    {
        "title": "Onlookers 'strike gold' after seeing Ed Sheeran gig outside King's Cross station",
        "description": "Ed Sheeran has wowed fans, onlookers and commuters by playing in a London street.",
        "url": "https://news.sky.com/story/onlookers-strike-gold-after-seeing-ed-sheeran-gig-outside-kings-cross-station-13342258",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-sheeran-singer-kings-cross_6876589.jpg?20250405102122",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-05 09:10:00",
        "Headline": "The Shape of You and Thinking Out Loud singer shared an Instagram post after his performance and described the atmosphere as \"awesome\".",
        "Content": " Ed Sheeran has wowed fans, onlookers and commuters by playing in a London street. The British singer and songwriter, 34, performed with his acoustic guitar outside King's Cross station on Friday. Sheeran, wearing a bright pink t-shirt, sang his new track Azizam as well as hits including Perfect, Bad Habits and Shivers. The Shape of You and Thinking Out Loud singer shared an Instagram post after his performance and described the atmosphere as \"awesome\". One onlooker who had time to spare between changing trains said she \"struck gold\" and felt \"lucky\" after witnessing the star play in an intimate setting. Legal secretary Olivia Heathcote, 22, from Teesside, said: \"I didn't know he was going to be performing so I felt like I struck gold when I left King's Cross station. \"The atmosphere was amazing, everyone was singing along and it was a super fun experience. He played all of his most famous songs and I felt really lucky to be able to see it live.\" Read more from Sky News:Pete Townshend on Quadrophenia a Mod balletTom Cruise pays tribute to 'dear friend' Val Kilmer Some fans who follow Sheeran on social media had been aware of his plans. They included Ronnie Swan, 26, who \"rushed over\" at the chance of seeing him perform live. Mr Swan, who is originally from Brisbane, Australia, but now lives in Twickenham, was at King's Cross at around 1pm. He said: \"It was a dream come true to see Ed perform in that setting. I've seen him a couple of times play a stadium, but to watch him just play in the street... was incredible.\" Meanwhile, some dedicated fans even came from overseas, including 29-year-old Felix Stender who made the trip from his home town of Kiel, near Hamburg. \"I just travelled from Germany for the small gig at King's Cross as I knew today was the release day for the song Azizam,\" he said."
    }
]