[
    {
        "title": "King 'deeply touched' by reaction to cancer 'good news' - as screening sites see traffic surge",
        "description": "The King will be \"deeply touched\" by the public&#8217;s reaction to the update on his cancer treatment, Buckingham Palace has said &#8211; as screening websites saw a surge in traffic. ",
        "url": "https://news.sky.com/story/king-deeply-touched-by-reaction-to-cancer-good-news-as-screening-sites-see-traffic-surge-13482920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-charles-cancer_7108004.jpg?20251212083436",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 18:03:00",
        "Headline": "Charles credited an early diagnosis for being able to scale back treatment in the new year. ",
        "Content": "The King will be \"deeply touched\" by the public’s reaction to the update on his cancer treatment, Buckingham Palace has said – as screening websites saw a surge in traffic.  In a televised message on Friday, Charles said his treatment can be reduced in the new year thanks to an \"early diagnosis, effective intervention and adherence to doctors' orders\". The monarch, who announced he had been diagnosed with cancer in February 2024, also urged people to take up available screenings for the disease. Cancer Research UK said tens of thousands of people visited its Screening Checker website, which was launched on 5 December, after the King's message. NHS England also said its cancer-related pages saw a substantial spike in activity, with almost 4,000 views in a 24-hour period, compared to almost 8,000 over the full week.  A spokesperson for Buckingham Palace said on Saturday it has been \"delighted by the scale and sensitivity of the worldwide media reaction\", and is \"most grateful for the many kind comments we have received for the King, both from those working in cancer care and from the general public\". \"I know His Majesty will be greatly encouraged and deeply touched by the very positive reaction his message has generated,\" the spokesperson said. \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  King and Queen choose 20th wedding anniversary portrait for Christmas card\n                 \n                  King leads nation in two-minute silence during Remembrance Sunday service at Cenotaph\n                 \"He will be particularly pleased at the way it has helped to shine a light on the benefits of cancer screening programmes. \"It has long been the King's view that if some public good can come from sharing elements of his personal diagnosis and treatment journey, then it would be his pleasure and duty to do so. \"His thoughts and warmest wishes will remain with all those affected by cancer and those who care for them.\" Delivering his message in support of the Stand Up To Cancer campaign, the King said that early diagnosis had enabled him to \"continue leading a full and active life, even while undergoing treatment\". Cancer Research UK said about 100,000 people had visited its new Screening Checker since it was launched, with the majority taking place after the King's update. The tool allows visitors to quickly check the different types of cancer screenings available with the NHS, and Public Health Agency (PHA) in Northern Ireland, and helps them find out which ones apply to them. Michelle Mitchell, chief executive at the charity, said on Saturday: \"This response shows just how important open conversations about cancer can be. \"Knowing which screening you're eligible for, and what happens next, isn't always straightforward, which is why we've launched this simple new Screening Checker. \"Taking just a few minutes to check what screening you're eligible for could be an important step towards protecting your health and could ultimately save lives.\""
    },
    {
        "title": "Specialist teams and online investigators deployed across England and Wales to tackle 'national emergency' of violence against women and girls",
        "description": "Specialist investigation teams for rape and sexual offences are to be created across England and Wales as the Home Secretary declares violence against women and girls a \"national emergency\".",
        "url": "https://news.sky.com/story/specialist-teams-and-online-investigators-deployed-across-england-and-wales-to-tackle-national-emergency-of-violence-against-women-and-girls-13483076",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-domestic-abuse_6299423.jpg?20230927000914",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 18:35:00",
        "Headline": "Home Secretary Shabana Mahmood said her measures mean \"abusers will have nowhere to hide\" but the Conservatives claimed Labour had \"failed women\" and \"broken its promises\".",
        "Content": "Specialist investigation teams for rape and sexual offences are to be created across England and Wales as the Home Secretary declares violence against women and girls a \"national emergency\". Shabana Mahmood said the dedicated units will be in place across every force by 2029 as part of Labour's violence against women and girls (VAWG) strategy due to be launched later this week. The use of Domestic Abuse Protection Orders (DAPOs), which had been trialled in several areas, will also be rolled out across England and Wales. They are designed to target abusers by imposing curfews, electronic tags and exclusion zones. The orders cover all forms of domestic abuse, including economic abuse, coercive and controlling behaviour, stalking and 'honour'-based abuse. Breaching the terms can carry a prison term of up to 5 years.  Nearly £2m will also be spent funding a network of officers to target offenders operating within the online space. Teams will use covert and intelligence techniques to tackle violence against women and girls via apps and websites. A similar undercover network funded by the Home Office to examine child sexual abuse has arrested over 1,700 perpetrators. \n                  Families of women who died after violence demand reform\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 \n                  More domestic abuse victims die by suicide than homicide - but families met with 'apathy'\n                 Abuse is 'national emergency' Home Secretary Shabana Mahmood said in a statement: \"This government has declared violence against women and girls a national emergency. \"For too long, these crimes have been considered a fact of life. That's not good enough. We will halve it in a decade. \"Today we announce a range of measures to bear down on abusers, stopping them in their tracks. Rapists, sex offenders and abusers will have nowhere to hide.\"  The target to halve violence against women and girls in a decade is a Labour manifesto pledge. The government said the measures build on existing policy, including facial recognition technology to identify offenders, improving protections for stalking victims, making strangulation a criminal offence and establishing domestic abuse specialists in 999 control rooms. Read more from Sky News:Demands for violence and abuse reformsWomen still feel unsafe on streetsMinister 'clarifies' violence strategy Labour has 'failed women' But the Conservatives said Labour had \"failed women\" and \"broken its promises\" by delaying the publication of the violence against women and girls strategy. Shadow Home Secretary, Chris Philp, said that Labour \"shrinks from uncomfortable truths, voting against tougher sentences and presiding over falling sex-offender convictions. At every turn, Labour has failed women.\""
    },
    {
        "title": "Trump says US 'will retaliate' after three Americans killed in Syrian 'Islamic State attack'",
        "description": "Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria. ",
        "url": "https://news.sky.com/story/trump-says-us-will-retaliate-after-three-americans-killed-in-syrian-islamic-state-attack-13483086",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-syria_7109370.jpg?20251213215752",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 19:00:00",
        "Headline": "Two US service members and one civilian died, while three other people were injured, in an ambush by a lone gunman. ",
        "Content": " Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria.  Two US service members and one civilian died and three other people were injured in an ambush on Saturday by a lone IS - also often called ISIS in Syria and Iraq - gunman, according to the he US military's Central Command. The attack on US troops in Syria is the first to inflict fatalities since the fall of President Bashar Assad a year ago. \"This is an ISIS attack,\" the US president told reporters at the White House before leaving for the Army-Navy football game in Baltimore. He paid condolences to the three people killed and said the three others who were wounded \"seem to be doing pretty well\". In a post on his Truth Social platform, Mr Trump said \"there will be very serious retaliation\". The shooting took place near historic Palmyra, according to the state-run SANA news agency, and the casualties were taken by helicopter to the al Tanf garrison near the border with Iraq and Jordan. \n                  At least two dead and eight critically injured in US university shooting - as police hunt gunman\n                 \n                  Epstein latest: Trump says he 'knows nothing about' photos after new images released\n                 \n                  Washington state flooding forces entire city to evacuate as rivers reach historic highs\n                 The UK-based Syrian Observatory for Human Rights said the attacker was a member of the Syrian security force. Syria's Interior Ministry spokesman Nour al Din al Baba said authorities are looking into whether the gunman was an IS member or only carried its extreme ideology, and denied reports suggesting he was a security member. Read more from Sky News:Belarus pardons key opposition activistIsrael says strike kills one of the architects of the 7 October 2023 attacks Central Command earlier said in a post on X that the gunman was killed, while the identities of the service members killed wouldn't be released until 24 hours after their next of kin have been notified. Pentagon chief spokesman Sean Parnell said the civilian killed in the attack was a US interpreter. US defence secretary Pete Hegseth posted on X: \"Let it be known, if you target Americans - anywhere in the world - you will spend the rest of your brief, anxious life knowing the United States will hunt you, find you, and ruthlessly kill you.\" The US has hundreds of troops deployed in eastern Syria as part of a coalition fighting IS. The group was defeated on the battlefield in Syria in 2019 but the UN says the group still has between 5,000 and 7,000 fighters in Syria and Iraq, and its sleeper cells still carry out deadly attacks. Syria's interim president, Ahmad al Sharaa, made a historic visit to Washington DC last month as Syria signed a political cooperation agreement with the US-led coalition against IS. \"This was an ISIS attack against the US, and Syria, in a very dangerous part of Syria, that is not fully controlled by them,\" Mr Trump said in his social media post, adding that Mr al Sharaa was \"extremely angry and disturbed\"."
    },
    {
        "title": "Belarus pardons key opposition activist, among 123 prisoners, in exchange for US sanction relief",
        "description": "Belarus has pardoned 123 prisoners, including a Nobel Peace Prize laureate and a key opposition figure who challenged the presidential elections in 2020, in exchange for US sanctions relief.",
        "url": "https://news.sky.com/story/belarus-pardons-key-opposition-figure-among-123-prisoners-in-exchange-for-us-sanction-relief-13482891",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maria-kolesnikova-belarus_7109115.png?20251213173807",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 14:32:00",
        "Headline": "The release of prisoners comes as authoritarian President Alexander Lukashenko, a close ally of Russia, seeks to improve relations with Donald Trump.",
        "Content": " Belarus has pardoned 123 prisoners, including a Nobel Peace Prize laureate and a key opposition figure who challenged the presidential elections in 2020, in exchange for US sanctions relief. Human rights advocate Ales Bialiatski and Maria Kolesnikova, a key figure in the mass protests that rocked the country in 2020, were among those released. Earlier on Saturday, the Trump administration confirmed that the US was lifting sanctions on Belarus's potash sector after officials held two days of talks in Minsk. John Coale, US special envoy for Belarus, also hinted that around 1,000 remaining political prisoners in Belarus could be released in the coming months as authoritarian President Alexander Lukashenko, a close ally of Russia, seeks to improve relations with Washington. Separately, Ukraine confirmed it had received 114 prisoners released by Belarus. The other nine were received by Lithuania. Ms Kolesnikova, 43, known for her close-cropped hair and trademark gesture of forming a heart with her hands, was one of dozens of released prisoners who arrived in Ukraine by coach on Saturday. \"Of course, this feeling is incredible happiness,\" she said in a video released on X from the Military Intelligence of Ukraine. \n                  'Europe's last dictator' frees more than 50 prisoners to ease sanctions in Trump trade \n                 \n                  Belarus opposition leader Siarhei Tsikhanouski freed from jail after rare visit by top US envoy\n                 \n                  Polls close in Belarus - with Alexander Lukashenko set to extend 30-year presidential rule\n                 \"At the same time, of course, I think about those people who are not yet free. I am very much looking forward to the moment when we can all hug each other, when we can all see one another, when we will all be free,\" she added. Ms Kolesnikova became a symbol of resistance when Belarusian authorities tried to deport her to Ukraine in September 2020. She broke away from security forces at the border, tore up her passport and walked back into Belarus. The professional flautist was convicted in 2021 on charges including conspiracy to seize power and sentenced to 11 years in prison, but then fell seriously ill and underwent surgery. Mr Bialiatski, 63, who founded Viasna, Belarus' oldest and most prominent human rights group, won the Nobel Peace Prize in 2022 while awaiting trial for charges which were widely regarded as politically motivated. After arriving in Lithuania, he spoke briefly to crowds outside the US embassy in Vilnius and said in English: \"Never give up\". He was seen by authorities as especially dangerous because of what Belarus alleged were his \"extremist tendencies\". Sentenced to 10 years in 2023, he had been held at a penal colony in Gorki, notorious for beatings and hard labour, and his health was deteriorating, according to his wife. The Norwegian Nobel Committee expressed \"profound relief and heartfelt joy\" at the release of Mr Bialiatski and called on the Belarusian authorities \"to release all political prisoners\". Moscow correspondent There have been sporadic prisoner releases over the past twelve months, but this is by far the biggest and most significant. Nobel laureate Ales Bialiatski is a long-time thorn in the side of Belarus's authoritarian leader, while Maria Kolesnikova led the mass protests against Lukashenko in 2020.  Both chose incarceration over exile and as such became powerful symbols of defiance. The conditions of their detention had fuelled concerns over their health. Kolesnikova's sister, Tatsiana Khomich, told me in January that she feared for Maria's life. Their release is a massive moment for their families and the opposition movement in general. The Trump administration isn't acting out of purely altruistic motives, though. It's openly expressed hope that warmer ties with Minsk will lead to greater influence with Moscow, when it comes to Ukraine peace talks. But that might be overly optimistic from Washington. Belarus depends on Russia's support and analysts say Lukashenko's loyalty will always be to Vladimir Putin. There's a belief that the man known as Europe's last dictator will merely use this contact with Washington for his own ends - economic recovery rather than democratic transition. Even after this release, it's estimated there are still over 1,100 political prisoners behind bars. Read more from Sky News:Venezuelan oil exports 'at standstill'Far right 'emboldened' in AustraliaThailand-Cambodia fighting continues Sviatlana Tsikhanouskaya, who is an opposition leader in exile and a close ally of Ms Kolesnikova, posted her delight on X: \"Maria is free!\" She added: \"For five years, we fought for Maria Kolesnikova's freedom. I am deeply grateful to the US administration and our European partners who worked tirelessly to secure her release. \"Maria is in a safe place, and we hope to hear from her soon.\" Ukrainian officials said President Volodymyr Zelenskyy had also spoken to Ms Kolesnikova after her release, although they have not released any more details. In a statement published on the Telegram social media platform, the Military Intelligence of Ukraine confirmed more details of who had been released, including people \"imprisoned for political reasons\". Among the group were Viktar Babaryka, a former banker jailed in 2021 after challenging Mr Lukashenko at the polls, and journalist Maryna Zolatava, who was imprisoned in 2023 on a range of charges including harming national security. Critics argue both sentences were politically motivated. President Lukashenko has ruled the nation with an iron fist for more than three decades, but has been repeatedly sanctioned by Western countries both for its crackdown on human rights and for allowing Moscow to use its territory in the invasion of Ukraine. Following the two-day talks, US envoy John Coale posted on X: \"Another 156 political prisoners released thanks to President Trump's leadership! An important step in US-Belarus relations.\" It is not clear whether the figure includes previously released prisoners. Speaking to the Reuters news agency on Saturday, Mr Coale said around 1,000 remaining political prisoners in Belarus could be released in the coming months. \"I think it's more than possible that we can do that, I think it's probable... We are on the right track, the momentumis there.\" US officials eased some sanctions after meeting with President Lukashenko in September 2025. In response, Minsk freed more than 50 political prisoners into Lithuania, taking the total number freed by Belarus since July 2024 to more than 430. Mr Coale also spoke about weather balloons which have flying over the border from Belarus into Lithuania. \"He [Mr Lukashenko] agreed recently to do everything he could to stop the balloons,\" Mr Coale told the Reuters news agency. Lithuania has declared a state of emergency over the balloons, used by cigarette smugglers, which have caused over a dozen closures of Vilnius airport in recent months."
    },
    {
        "title": "Two 17-year-olds die after car crashes into tree in Rotherham",
        "description": "A 17-year-old girl and a 17-year-old boy have died after a car crashed into a tree near Rotherham. ",
        "url": "https://news.sky.com/story/two-17-year-olds-die-after-car-crashes-into-tree-in-rotherham-13483120",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-crash-rotherham_7109447.jpg?20251213211800",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 21:17:00",
        "Headline": "An 18-year-old man is also in a critical condition after the collision near Rotherham. ",
        "Content": "A 17-year-old girl and a 17-year-old boy have died after a car crashed into a tree near Rotherham.  The girl was driving a silver Toyota Carolla away from Dinnington towards Todwick, in South Yorkshire, when the car left Todwick Road, police said. Both she and a 17-year-old boy, who was a passenger, were pronounced dead at the scene. An 18-year-old man, who was also in the car, was taken to hospital, were he remains in a critical condition. South Yorkshire Police said officers want to speak to witnesses and have set up a portal for people to share footage of the crash. Sergeant John Taylor said: \"Our thoughts remain with the families of those who have died, and the man seriously injured. \"We are working to ascertain the circumstances and are keen to speak to anyone who believes they can help. \n                  Man dies after helicopter crash near Doncaster\n                 \n                  Yusuf Nazir's family welcome inquest into death \n                 \n                  National Crime Agency takes over investigation into claims police sexually abused children in Rotherham\n                 \"Footage can be shared directly with us through our portal. \"If you saw the vehicle prior to the collision, we'd like to hear from you.\""
    },
    {
        "title": "Virginia Giuffre's family 'deeply disappointed' Met Police won't open probe into claims Andrew asked officer to investigate her",
        "description": "Virginia Giuffre's family have said they are \"deeply disappointed\" by the Metropolitan Police's decision not to investigate reports Andrew Mountbatten-Windsor asked an officer to help dig up dirt on her.",
        "url": "https://news.sky.com/story/met-police-wont-launch-investigation-into-claims-andrew-mountbatten-windsor-asked-officer-to-dig-dirt-on-accuser-13482910",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 14:53:00",
        "Headline": "The former duke reportedly tried to get his personal protection officer to investigate his accuser for a smear campaign back in 2011.",
        "Content": "Virginia Giuffre's family have said they are \"deeply disappointed\" by the Metropolitan Police's decision not to investigate reports Andrew Mountbatten-Windsor asked an officer to help dig up dirt on her. The Mail on Sunday claimed in October that Andrew tried to get his personal protection officer to investigate the woman who accused him of sexual assault for a smear campaign in 2011. He reportedly passed Ms Giuffre's date of birth and social security number to his taxpayer-funded bodyguard in 2011 and emailed the late Queen's then-deputy press secretary telling him of his request. Follow live updates: Trump says he 'knows nothing about' new Epstein photos But the Met said an assessment of the allegations \"has not revealed any additional evidence of criminal acts or misconduct\" since the force last looked at the case. In a statement after the announcement, Ms Giuffre's family said they were \"deeply disappointed\" police had dropped the probe \"without explanation\", adding they had not been told the announcement was coming. Ms Giuffre, who was trafficked by the late Jeffrey Epstein and his then partner Ghislaine Maxwell, alleged she was forced to have sex with Andrew when she was 17 in 2001 - allegations he has always denied. \n                  Inquiry into Crown Estate launched after controversy over Andrew's Royal Lodge residence\n                 \n                  Andrew Mountbatten-Windsor officially stripped of two more titles\n                 \n                  Prince Andrew Way to be renamed - but council warns it won't be straightforward\n                 She died in April, aged 41, with her family saying she \"lost her life to suicide\". The Met said the force first received allegations, including one of trafficking to central London in 2001, in 2015, and Ms Giuffre was interviewed as part of an assessment of the evidence. But the force decided not to launch a full criminal investigation in 2016 after officers and prosecutors concluded other international authorities were best placed to act on the allegations, which primarily concerned events outside the UK.  Central Specialist Crime Commander Ella Marriott, said the decision was reviewed in August 2019 and again in 2021 and 2022, but the position \"remained unchanged\". \"Following recent reporting suggesting that Mr Andrew Mountbatten-Windsor asked his Met Police close protection officer to carry out checks on Ms Giuffre in 2011, the MPS has carried out a further assessment,\" she said. \"This assessment has not revealed any additional evidence of criminal acts or misconduct.\" The Met's announcement comes after Democrats on the House Oversight Committee released a tranche of images, which include Andrew, from the so-called Epstein files, which are due to be released in full by the end of next week. There is no suggestion that the pictures imply any wrongdoing. Ms Giuffre's family 'surprised' by decision Ms Giuffre's family said they were in email contact with a Met detective on Friday, who gave no indication of the decision and asked if they had any evidence they wanted to present. \"We had not yet replied. With the Epstein files about to be released by Congress since the passage of the Epstein Transparency Act, we are surprised that the Metropolitan Police didn't wait to see what further evidence might appear,\" their statement said. \"While we have hailed the UK's overall handling of the case of Andrew Mountbatten-Windsor previously, today we feel justice has not been served. \"We continue to challenge the system that protects abusers, especially as more evidence comes to light that can hold people accountable. \"Our sister, Virginia, and all survivors, are owed this much.\" Andrew was stripped of his prince title and HRH style last month over the ongoing controversy of his association with Epstein, who was found dead in his prison cell after taking his own life while facing allegations of sexually abusing underage girls. The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her."
    },
    {
        "title": "Israel says Hamas commander - who was one of the architects of the 7 October 2023 attacks - killed in strike",
        "description": "A senior Hamas commander who was one of the architects of the 7 October 2023 attacks on Israel has been killed in a strike on Gaza City, according to the country&#8217;s military. ",
        "url": "https://news.sky.com/story/israel-says-hamas-commander-who-was-one-of-the-architects-of-the-7-october-2023-attacks-killed-in-strike-13482984",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-hamas-strike-saed-raed-saed_7109184.jpg?20251213171506",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 17:11:00",
        "Headline": "Raed Saad's death is the highest-profile killing of a senior Hamas figure since the ceasefire came into effect in October. ",
        "Content": " A senior Hamas commander who was one of the architects of the 7 October 2023 attacks on Israel has been killed in a strike on Gaza City, according to the country’s military.  Raed Saad was targeted in response to an attack by Hamas in which an explosive device injured two soldiers on Saturday, Israeli Prime Minister Benjamin Netanyahu and Defence Minister Israel Katz said in a joint statement. It is the highest-profile killing of a senior Hamas figure since the Gaza ceasefire came into effect in October. Gaza health authorities said the attack on a car in Gaza City killed five people and wounded at least 25 others, but there has been no confirmation from Hamas or medics that Saed was among the dead. Hamas condemned the attack in a statement as a violation of the ceasefire agreement but stopped short of threatening retaliation. An Israeli military official described Saed as a high-ranked Hamas member who helped establish and advance the group's weapons production network. \"In recent months, he operated to re-establish Hamas' capabilities and weapons manufacturing, a blatant violation of the ceasefire,\" the official said. \n                  Rafah crossing to open 'in coming days' to let Gazans cross into Egypt, Israel says\n                 \n                  Talks begin on the next phase of Gaza ceasefire deal as Hamas and Israel hand over remains\n                 \n                  Israeli airstrike on Palestinian refugee camp kills 13, says Lebanon\n                 The 10 October ceasefire has enabled hundreds of thousands of Palestinians to return to Gaza City's ruins after a war that began after Hamas-led militants killed 1,200 people, most of them civilians, and seized 251 hostages in an attack on southern Israel. Israel's retaliatory offensive has killed more than 70,700 Palestinians, most of them civilians, according to health officials in Gaza. Israel has pulled troops back from city positions, and aid flows have increased, but violence has not completely stopped. Palestinian health authorities say Israeli forces have killed at least 386 people in strikes in Gaza since the truce, while Israel says three of its soldiers have been killed."
    },
    {
        "title": "UK has seen longest period without migrants arriving on small boats since 2018, figures show",
        "description": "Migrant arrivals in small boats have resumed after 28 days without crossings.",
        "url": "https://news.sky.com/story/uk-has-seen-longest-period-without-migrants-arriving-on-small-boats-since-2018-figures-show-13482829",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-migration-small-boat_7106191.jpg?20251210031219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-13 11:02:00",
        "Headline": "So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022.",
        "Content": " Migrant arrivals in small boats have resumed after 28 days without crossings. Home Office figures showed a stretch between 14 November and yesterday (12 December) without arrivals, making it the longest uninterrupted run since autumn 2018. However, a number of Border Force vessels were active in the English Channel on Saturday morning, and it is thought that around 160 people from two small boats have been picked up. So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022. The record that year was set at 45,774 arrivals. It comes as the government has stepped up efforts in recent months to deter people from risking their lives crossing the Channel - but measures are not expected to have an impact until next year. December is normally one of the quietest for Channel crossings, with a combination of poor visibility, low temperatures, less daylight and stormy weather making the perilous journey more difficult. The most arrivals recorded in the month of December is 3,254, in 2024. Deputy Prime Minister David Lammy met with ministers from other European countries this week as discussions over possible reform to the European Convention on Human Rights (ECHR) continue.  The issue of small boat arrivals - a very small percentage of overall UK immigration - has become a salient issue in British politics in recent years. Last month, French maritime police announced they would soon be able to intercept boats in the English Channel."
    },
    {
        "title": "End of small boats crossings pause exposes fragility of migration debate",
        "description": "The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate.",
        "url": "https://news.sky.com/story/end-of-small-boats-crossings-pause-exposes-fragility-of-migration-debate-13482893",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7025462.jpg?20250919180422",
        "type": "Home",
        "Author": "Nick Martin",
        "Date Published": "2025-12-13 15:18:00",
        "Headline": "Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space.",
        "Content": "\n          People and politics correspondent\n              @NickMartinSKY\n  The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate. For almost a month, no migrants were recorded arriving in the UK by small boat - the longest uninterrupted lull since 2018. Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space. But Saturday's new crossings have brought that pause to an abrupt end, reinforcing a long-running problem for successive governments: migration numbers are volatile, weather-dependent, and politically unforgiving. December has always been one of the quietest months for Channel crossings. Cold temperatures, poor visibility and rough seas make the journey significantly more dangerous, and arrivals typically fall. Critics argue that presenting the lull as progress risks mistaking seasonal conditions for policy success. The return of boats as soon as conditions eased underlines what campaigners describe as a \"one in, one out\" reality - any short-term dip can quickly be reversed. That matters because the political stakes are high. Small-boat crossings have become a defining symbol of government control - or lack of it - over borders. The prime minister has repeatedly promised to stop the \"vile trade\" of migrants in the Channel, while the home secretary has set out a tougher stance focused on deterrence, faster removals, international cooperation and disrupting smuggling gangs. Yet the numbers continue to test that claim. Total arrivals this year stand at 39,292, up from 36,816 at the same point last year - a rise of around seven per cent.  Read more:Convicted terrorist jailed after entering on a small boatFrance to be able to intercept boats in Channel Even with periodic lulls, the overall trajectory remains stubbornly high. For ministers, that makes it difficult to point to clear evidence that policy, rather than circumstance, is driving change. Opposition parties have seized on that tension. Labour argues that the Conservatives left behind a broken asylum system and that long-term solutions will take time. The Greens, led by Zack Polanski, reject what they see as headline-driven politics altogether, calling for a managed but more humane system - including allowing asylum seekers to work - while dismissing claims they support open borders.  What Saturday's crossings show is that migration policy rarely offers clean political wins. Governments want decisive moments - a turning point, a breakthrough - but the Channel does not operate to political timetables. As winter passes and crossings inevitably rise again, the government will be judged not on short pauses, but on whether it can deliver sustained reductions without relying on the weather to do the work for it."
    },
    {
        "title": "Specialist teams and online investigators deployed across England and Wales to tackle 'national emergency' of violence against women and girls",
        "description": "Specialist investigation teams for rape and sexual offences are to be created across England and Wales as the Home Secretary declares violence against women and girls a \"national emergency\".",
        "url": "https://news.sky.com/story/specialist-teams-and-online-investigators-deployed-across-england-and-wales-to-tackle-national-emergency-of-violence-against-women-and-girls-13483076",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-domestic-abuse_6299423.jpg?20230927000914",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 18:35:00",
        "Headline": "Home Secretary Shabana Mahmood said her measures mean \"abusers will have nowhere to hide\" but the Conservatives claimed Labour had \"failed women\" and \"broken its promises\".",
        "Content": "Specialist investigation teams for rape and sexual offences are to be created across England and Wales as the Home Secretary declares violence against women and girls a \"national emergency\". Shabana Mahmood said the dedicated units will be in place across every force by 2029 as part of Labour's violence against women and girls (VAWG) strategy due to be launched later this week. The use of Domestic Abuse Protection Orders (DAPOs), which had been trialled in several areas, will also be rolled out across England and Wales. They are designed to target abusers by imposing curfews, electronic tags and exclusion zones. The orders cover all forms of domestic abuse, including economic abuse, coercive and controlling behaviour, stalking and 'honour'-based abuse. Breaching the terms can carry a prison term of up to 5 years.  Nearly £2m will also be spent funding a network of officers to target offenders operating within the online space. Teams will use covert and intelligence techniques to tackle violence against women and girls via apps and websites. A similar undercover network funded by the Home Office to examine child sexual abuse has arrested over 1,700 perpetrators. \n                  Families of women who died after violence demand reform\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 \n                  More domestic abuse victims die by suicide than homicide - but families met with 'apathy'\n                 Abuse is 'national emergency' Home Secretary Shabana Mahmood said in a statement: \"This government has declared violence against women and girls a national emergency. \"For too long, these crimes have been considered a fact of life. That's not good enough. We will halve it in a decade. \"Today we announce a range of measures to bear down on abusers, stopping them in their tracks. Rapists, sex offenders and abusers will have nowhere to hide.\"  The target to halve violence against women and girls in a decade is a Labour manifesto pledge. The government said the measures build on existing policy, including facial recognition technology to identify offenders, improving protections for stalking victims, making strangulation a criminal offence and establishing domestic abuse specialists in 999 control rooms. Read more from Sky News:Demands for violence and abuse reformsWomen still feel unsafe on streetsMinister 'clarifies' violence strategy Labour has 'failed women' But the Conservatives said Labour had \"failed women\" and \"broken its promises\" by delaying the publication of the violence against women and girls strategy. Shadow Home Secretary, Chris Philp, said that Labour \"shrinks from uncomfortable truths, voting against tougher sentences and presiding over falling sex-offender convictions. At every turn, Labour has failed women.\""
    },
    {
        "title": "King 'deeply touched' by reaction to cancer 'good news' - as screening sites see traffic surge",
        "description": "The King will be \"deeply touched\" by the public&#8217;s reaction to the update on his cancer treatment, Buckingham Palace has said &#8211; as screening websites saw a surge in traffic. ",
        "url": "https://news.sky.com/story/king-deeply-touched-by-reaction-to-cancer-good-news-as-screening-sites-see-traffic-surge-13482920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-charles-cancer_7108004.jpg?20251212083436",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 18:03:00",
        "Headline": "Charles credited an early diagnosis for being able to scale back treatment in the new year. ",
        "Content": "The King will be \"deeply touched\" by the public’s reaction to the update on his cancer treatment, Buckingham Palace has said – as screening websites saw a surge in traffic.  In a televised message on Friday, Charles said his treatment can be reduced in the new year thanks to an \"early diagnosis, effective intervention and adherence to doctors' orders\". The monarch, who announced he had been diagnosed with cancer in February 2024, also urged people to take up available screenings for the disease. Cancer Research UK said tens of thousands of people visited its Screening Checker website, which was launched on 5 December, after the King's message. NHS England also said its cancer-related pages saw a substantial spike in activity, with almost 4,000 views in a 24-hour period, compared to almost 8,000 over the full week.  A spokesperson for Buckingham Palace said on Saturday it has been \"delighted by the scale and sensitivity of the worldwide media reaction\", and is \"most grateful for the many kind comments we have received for the King, both from those working in cancer care and from the general public\". \"I know His Majesty will be greatly encouraged and deeply touched by the very positive reaction his message has generated,\" the spokesperson said. \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  King and Queen choose 20th wedding anniversary portrait for Christmas card\n                 \n                  King leads nation in two-minute silence during Remembrance Sunday service at Cenotaph\n                 \"He will be particularly pleased at the way it has helped to shine a light on the benefits of cancer screening programmes. \"It has long been the King's view that if some public good can come from sharing elements of his personal diagnosis and treatment journey, then it would be his pleasure and duty to do so. \"His thoughts and warmest wishes will remain with all those affected by cancer and those who care for them.\" Delivering his message in support of the Stand Up To Cancer campaign, the King said that early diagnosis had enabled him to \"continue leading a full and active life, even while undergoing treatment\". Cancer Research UK said about 100,000 people had visited its new Screening Checker since it was launched, with the majority taking place after the King's update. The tool allows visitors to quickly check the different types of cancer screenings available with the NHS, and Public Health Agency (PHA) in Northern Ireland, and helps them find out which ones apply to them. Michelle Mitchell, chief executive at the charity, said on Saturday: \"This response shows just how important open conversations about cancer can be. \"Knowing which screening you're eligible for, and what happens next, isn't always straightforward, which is why we've launched this simple new Screening Checker. \"Taking just a few minutes to check what screening you're eligible for could be an important step towards protecting your health and could ultimately save lives.\""
    },
    {
        "title": "Two 17-year-olds die after car crashes into tree in Rotherham",
        "description": "A 17-year-old girl and a 17-year-old boy have died after a car crashed into a tree near Rotherham. ",
        "url": "https://news.sky.com/story/two-17-year-olds-die-after-car-crashes-into-tree-in-rotherham-13483120",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-crash-rotherham_7109447.jpg?20251213211800",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 21:17:00",
        "Headline": "An 18-year-old man is also in a critical condition after the collision near Rotherham. ",
        "Content": "A 17-year-old girl and a 17-year-old boy have died after a car crashed into a tree near Rotherham.  The girl was driving a silver Toyota Carolla away from Dinnington towards Todwick, in South Yorkshire, when the car left Todwick Road, police said. Both she and a 17-year-old boy, who was a passenger, were pronounced dead at the scene. An 18-year-old man, who was also in the car, was taken to hospital, were he remains in a critical condition. South Yorkshire Police said officers want to speak to witnesses and have set up a portal for people to share footage of the crash. Sergeant John Taylor said: \"Our thoughts remain with the families of those who have died, and the man seriously injured. \"We are working to ascertain the circumstances and are keen to speak to anyone who believes they can help. \n                  Man dies after helicopter crash near Doncaster\n                 \n                  Yusuf Nazir's family welcome inquest into death \n                 \n                  National Crime Agency takes over investigation into claims police sexually abused children in Rotherham\n                 \"Footage can be shared directly with us through our portal. \"If you saw the vehicle prior to the collision, we'd like to hear from you.\""
    },
    {
        "title": "Virginia Giuffre's family 'deeply disappointed' Met Police won't open probe into claims Andrew asked officer to investigate her",
        "description": "Virginia Giuffre's family have said they are \"deeply disappointed\" by the Metropolitan Police's decision not to investigate reports Andrew Mountbatten-Windsor asked an officer to help dig up dirt on her.",
        "url": "https://news.sky.com/story/met-police-wont-launch-investigation-into-claims-andrew-mountbatten-windsor-asked-officer-to-dig-dirt-on-accuser-13482910",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 14:53:00",
        "Headline": "The former duke reportedly tried to get his personal protection officer to investigate his accuser for a smear campaign back in 2011.",
        "Content": "Virginia Giuffre's family have said they are \"deeply disappointed\" by the Metropolitan Police's decision not to investigate reports Andrew Mountbatten-Windsor asked an officer to help dig up dirt on her. The Mail on Sunday claimed in October that Andrew tried to get his personal protection officer to investigate the woman who accused him of sexual assault for a smear campaign in 2011. He reportedly passed Ms Giuffre's date of birth and social security number to his taxpayer-funded bodyguard in 2011 and emailed the late Queen's then-deputy press secretary telling him of his request. Follow live updates: Trump says he 'knows nothing about' new Epstein photos But the Met said an assessment of the allegations \"has not revealed any additional evidence of criminal acts or misconduct\" since the force last looked at the case. In a statement after the announcement, Ms Giuffre's family said they were \"deeply disappointed\" police had dropped the probe \"without explanation\", adding they had not been told the announcement was coming. Ms Giuffre, who was trafficked by the late Jeffrey Epstein and his then partner Ghislaine Maxwell, alleged she was forced to have sex with Andrew when she was 17 in 2001 - allegations he has always denied. \n                  Inquiry into Crown Estate launched after controversy over Andrew's Royal Lodge residence\n                 \n                  Andrew Mountbatten-Windsor officially stripped of two more titles\n                 \n                  Prince Andrew Way to be renamed - but council warns it won't be straightforward\n                 She died in April, aged 41, with her family saying she \"lost her life to suicide\". The Met said the force first received allegations, including one of trafficking to central London in 2001, in 2015, and Ms Giuffre was interviewed as part of an assessment of the evidence. But the force decided not to launch a full criminal investigation in 2016 after officers and prosecutors concluded other international authorities were best placed to act on the allegations, which primarily concerned events outside the UK.  Central Specialist Crime Commander Ella Marriott, said the decision was reviewed in August 2019 and again in 2021 and 2022, but the position \"remained unchanged\". \"Following recent reporting suggesting that Mr Andrew Mountbatten-Windsor asked his Met Police close protection officer to carry out checks on Ms Giuffre in 2011, the MPS has carried out a further assessment,\" she said. \"This assessment has not revealed any additional evidence of criminal acts or misconduct.\" The Met's announcement comes after Democrats on the House Oversight Committee released a tranche of images, which include Andrew, from the so-called Epstein files, which are due to be released in full by the end of next week. There is no suggestion that the pictures imply any wrongdoing. Ms Giuffre's family 'surprised' by decision Ms Giuffre's family said they were in email contact with a Met detective on Friday, who gave no indication of the decision and asked if they had any evidence they wanted to present. \"We had not yet replied. With the Epstein files about to be released by Congress since the passage of the Epstein Transparency Act, we are surprised that the Metropolitan Police didn't wait to see what further evidence might appear,\" their statement said. \"While we have hailed the UK's overall handling of the case of Andrew Mountbatten-Windsor previously, today we feel justice has not been served. \"We continue to challenge the system that protects abusers, especially as more evidence comes to light that can hold people accountable. \"Our sister, Virginia, and all survivors, are owed this much.\" Andrew was stripped of his prince title and HRH style last month over the ongoing controversy of his association with Epstein, who was found dead in his prison cell after taking his own life while facing allegations of sexually abusing underage girls. The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her."
    },
    {
        "title": "Two men arrested after Christmas tree cut down hours after lights switch-on",
        "description": "Two men have been arrested after a beloved village Christmas tree was cut down just hours after its lights were switched on.",
        "url": "https://news.sky.com/story/two-men-arrested-after-christmas-tree-cut-down-hours-after-lights-switch-on-13482845",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-christmas-tree-shotton_7108006.jpg?20251212083807",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 13:00:00",
        "Headline": "It had grown in Shotton Colliery from a sapling into a large tree - so large that the village was planning to replace the lights.",
        "Content": "Two men have been arrested after a beloved village Christmas tree was cut down just hours after its lights were switched on. The tree had stood in Shotton Colliery, County Durham, for more than a decade. It had grown from a sapling into a large tree - so large that the village was planning to replace the lights. But it was felled sometime on Wednesday night, causing \"huge upset\", according to Durham Police. St Saviour's, a local church, posted images of lights on the tree being turned on. A message on their Facebook account said: \"May the people who caused this be caught and punished by the authorities.\" In an update on Friday afternoon, the local Peterlee policing team said two men have been arrested in connection with the incident. \n                  Specialist teams and online investigators deployed across England and Wales to tackle 'national emergency' of violence against women and girls\n                 \n                  King 'deeply touched' by reaction to cancer 'good news' - as screening sites see traffic surge\n                 \n                  Two 17-year-olds die after car crashes into tree in Rotherham\n                 \"The men, aged 23 and 26, have been taken into police custody where they will be interviewed by officers,\" the force said on Facebook. The police said they were \"in the process of charging and remanding a 26-year-old male with criminal damage to the tree\". A 23-year-old has since been released under investigation, the police said."
    },
    {
        "title": "End of small boats crossings pause exposes fragility of migration debate",
        "description": "The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate.",
        "url": "https://news.sky.com/story/end-of-small-boats-crossings-pause-exposes-fragility-of-migration-debate-13482893",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7025462.jpg?20250919180422",
        "type": "UK",
        "Author": "Nick Martin",
        "Date Published": "2025-12-13 15:18:00",
        "Headline": "Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space.",
        "Content": "\n          People and politics correspondent\n              @NickMartinSKY\n  The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate. For almost a month, no migrants were recorded arriving in the UK by small boat - the longest uninterrupted lull since 2018. Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space. But Saturday's new crossings have brought that pause to an abrupt end, reinforcing a long-running problem for successive governments: migration numbers are volatile, weather-dependent, and politically unforgiving. December has always been one of the quietest months for Channel crossings. Cold temperatures, poor visibility and rough seas make the journey significantly more dangerous, and arrivals typically fall. Critics argue that presenting the lull as progress risks mistaking seasonal conditions for policy success. The return of boats as soon as conditions eased underlines what campaigners describe as a \"one in, one out\" reality - any short-term dip can quickly be reversed. That matters because the political stakes are high. Small-boat crossings have become a defining symbol of government control - or lack of it - over borders. The prime minister has repeatedly promised to stop the \"vile trade\" of migrants in the Channel, while the home secretary has set out a tougher stance focused on deterrence, faster removals, international cooperation and disrupting smuggling gangs. Yet the numbers continue to test that claim. Total arrivals this year stand at 39,292, up from 36,816 at the same point last year - a rise of around seven per cent.  Read more:Convicted terrorist jailed after entering on a small boatFrance to be able to intercept boats in Channel Even with periodic lulls, the overall trajectory remains stubbornly high. For ministers, that makes it difficult to point to clear evidence that policy, rather than circumstance, is driving change. Opposition parties have seized on that tension. Labour argues that the Conservatives left behind a broken asylum system and that long-term solutions will take time. The Greens, led by Zack Polanski, reject what they see as headline-driven politics altogether, calling for a managed but more humane system - including allowing asylum seekers to work - while dismissing claims they support open borders.  What Saturday's crossings show is that migration policy rarely offers clean political wins. Governments want decisive moments - a turning point, a breakthrough - but the Channel does not operate to political timetables. As winter passes and crossings inevitably rise again, the government will be judged not on short pauses, but on whether it can deliver sustained reductions without relying on the weather to do the work for it."
    },
    {
        "title": "UK has seen longest period without migrants arriving on small boats since 2018, figures show",
        "description": "Migrant arrivals in small boats have resumed after 28 days without crossings.",
        "url": "https://news.sky.com/story/uk-has-seen-longest-period-without-migrants-arriving-on-small-boats-since-2018-figures-show-13482829",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-migration-small-boat_7106191.jpg?20251210031219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 11:02:00",
        "Headline": "So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022.",
        "Content": " Migrant arrivals in small boats have resumed after 28 days without crossings. Home Office figures showed a stretch between 14 November and yesterday (12 December) without arrivals, making it the longest uninterrupted run since autumn 2018. However, a number of Border Force vessels were active in the English Channel on Saturday morning, and it is thought that around 160 people from two small boats have been picked up. So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022. The record that year was set at 45,774 arrivals. It comes as the government has stepped up efforts in recent months to deter people from risking their lives crossing the Channel - but measures are not expected to have an impact until next year. December is normally one of the quietest for Channel crossings, with a combination of poor visibility, low temperatures, less daylight and stormy weather making the perilous journey more difficult. The most arrivals recorded in the month of December is 3,254, in 2024. Deputy Prime Minister David Lammy met with ministers from other European countries this week as discussions over possible reform to the European Convention on Human Rights (ECHR) continue.  The issue of small boat arrivals - a very small percentage of overall UK immigration - has become a salient issue in British politics in recent years. Last month, French maritime police announced they would soon be able to intercept boats in the English Channel."
    },
    {
        "title": "Two dead after reports of explosion in Caerphilly garden",
        "description": "Two people have died after reports of an explosion in a garden.",
        "url": "https://news.sky.com/story/two-dead-after-reports-of-explosion-in-garden-of-house-13482791",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-caerphilly-explosion_7109033.jpg?20251213145134",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-13 09:57:00",
        "Headline": "Neighbours describe seeing the two-storey property on fire after a reported explosion in the garden.",
        "Content": "Two people have died after reports of an explosion in a garden. Emergency services were called at 6.10pm on Friday to a house in Heol Fawr, Nelson, Caerphilly, south Wales. Gwent Police said officers and firefighters from South Wales Fire and Rescue Service attended the scene. A spokesman said: \"Two people have sadly been pronounced dead at the scene and their family has been informed.\" The road, close to the centre of the village, remains closed as investigations continue. Forensic teams remained at the two-storey house on Saturday, with photos showing blown-out windows and burn marks on the wall. Neighbours described seeing the home on fire and multiple emergency service vehicles on the scene in the aftermath of the incident. "
    },
    {
        "title": "Open border immigration 'not pragmatic right now', says Green Party leader",
        "description": "Greens leader Zack Polanski has rejected claims his party would push for open borders on immigration, telling Sky News it is \"not a pragmatic\" solution for a world in \"turmoil\".",
        "url": "https://news.sky.com/story/open-border-immigration-not-pragmatic-right-now-says-green-party-leader-13482491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-polanski-rogers-calais_7108478.png?20251213181712",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-12-13 00:01:00",
        "Headline": "Speaking to Sky News in Calais, the Green leader says open borders was not in his party's manifesto and is used as an \"attack line\" by opponents to try and discredit him.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Greens leader Zack Polanski has rejected claims his party would push for open borders on immigration, telling Sky News it is \"not a pragmatic\" solution for a world in \"turmoil\". Mr Polanski distanced himself from his party's \"long-range vision\" for open borders, saying it was not in his party's manifesto and was an \"attack line used by opponents\" to question his credibility. It came as Mr Polanski, who has overseen a spike in support in the polls to double figures, refused to apologise over controversial comments he made about care workers on BBC Question Time that were criticised across the political spectrum. Mr Polanski was speaking to Sky News earlier this week while in Calais, where he joined volunteers and charities to witness how French police handle the arrival of migrants in the town that is used as a departure point for those wanting to make the journey to the UK. He told Sky News he had made the journey to the French town - once home to the \"Jungle\" refugee camp before it was demolished in 2016 - to tackle \"misinformation\" about migration and to make the case for a \"compassionate, fair and managed response\" to the small boats crisis. He said that \"no manifesto ever said anything about open borders\" and that the Greens had never stood at a general election advocating for them. \"Clearly when the world is in political turmoil and we have deep inequality, that is not a situation we can move to right now,\" he said. \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 \n                  Green Party membership overtakes Liberal Democrats under Polanski\n                 \"That would also involve massive international agreements and cooperation. That clearly is not a pragmatic conversation to have right now. And very often the government try to push that attack line to make us look not pragmatic.\" The party's manifesto last year did not mention open borders, but it did call for an end to the \"hostile environment\", more safe and legal routes and for the Home Office to be abolished and replaced with a department of migration. Asked why the policy of minimal restrictions on migration had been attributed to his party, Mr Polanski said open borders was part of a \"long-range vision of what society could look like if there was a Green government and if we'd had a long time to fix some of the systemic problems\". 'We should recognise the contribution migrants make' Mr Polanski, who was elected Green Party leader in September and has been compared to Nigel Farage over his populist economic policies, said his position was one of a \"fair and managed\" migration system - although he did not specify whether that included a cap on numbers. He acknowledged that there needed to be a \"separate conversation\" about economic migration but that he did not believe any person who boarded a small boat was in a \"good situation\". While Mr Polanski stressed that he believed asylum seekers should be able to work in Britain and pay taxes, he also said he believed in the need to train British workers in sectors such as care, where one in five are foreign nationals. Asked what his proposals for a fair and managed migration system looked like, and whether he supported a cap on numbers, Mr Polanski said: \"We have 100,000 vacancies in the National Health Service. One in five care workers in the care sector are foreign nationals. \"Now, of course, that is both British workers and we should be training British workers, but we should recognise the contribution that migrants and people who come over here make.\" 'I'm not going to apologise' Mr Polanski also responded to the criticism he attracted over his comments about care workers on Question Time last week, where he told the audience: \"I don't know about you, but I don't particularly want to wipe someone's bum\" - before adding: \"I'm very grateful for the people who do this work.\" His comments have been criticised by a number of Labour MPs, including Wes Streeting, the health secretary, who said: \"Social care isn't just 'wiping someone's bum'. It is a hard, rewarding, skilled professional job. \"This is immigration as exploitation.\"  Read more:The Greens leader who wants to be the Farage of the leftWill Farage racism allegations deter voters? Asked whether he could understand why some care workers might feel he had talked down to them, the Greens leader replied: \"I care deeply about care workers. When I made those comments, it's important to give a full context. I said 'I'm very grateful to people who do this important work' and absolutely repeat that it's vital work. \"Of course, it is not part of the whole job, and I never pretended it was part of the whole job.\" Mr Polanski said he \"totally\" rejected the suggestion that he had denigrated the role of care workers in the eyes of the public and said his remarks were made in the context of a \"hostile Question Time\" where he had \"three right-wing panellists shouting at me\". Pressed on whether he wanted to apologise, he replied: \"I'm not going to apologise for being really clear that I'm really grateful to the people who do this really vital work. And yes, we should be paying them properly, too.\""
    },
    {
        "title": "Belarus pardons key opposition activist, among 123 prisoners, in exchange for US sanction relief",
        "description": "Belarus has pardoned 123 prisoners, including a Nobel Peace Prize laureate and a key opposition figure who challenged the presidential elections in 2020, in exchange for US sanctions relief.",
        "url": "https://news.sky.com/story/belarus-pardons-key-opposition-figure-among-123-prisoners-in-exchange-for-us-sanction-relief-13482891",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maria-kolesnikova-belarus_7109115.png?20251213173807",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 14:32:00",
        "Headline": "The release of prisoners comes as authoritarian President Alexander Lukashenko, a close ally of Russia, seeks to improve relations with Donald Trump.",
        "Content": " Belarus has pardoned 123 prisoners, including a Nobel Peace Prize laureate and a key opposition figure who challenged the presidential elections in 2020, in exchange for US sanctions relief. Human rights advocate Ales Bialiatski and Maria Kolesnikova, a key figure in the mass protests that rocked the country in 2020, were among those released. Earlier on Saturday, the Trump administration confirmed that the US was lifting sanctions on Belarus's potash sector after officials held two days of talks in Minsk. John Coale, US special envoy for Belarus, also hinted that around 1,000 remaining political prisoners in Belarus could be released in the coming months as authoritarian President Alexander Lukashenko, a close ally of Russia, seeks to improve relations with Washington. Separately, Ukraine confirmed it had received 114 prisoners released by Belarus. The other nine were received by Lithuania. Ms Kolesnikova, 43, known for her close-cropped hair and trademark gesture of forming a heart with her hands, was one of dozens of released prisoners who arrived in Ukraine by coach on Saturday. \"Of course, this feeling is incredible happiness,\" she said in a video released on X from the Military Intelligence of Ukraine. \n                  'Europe's last dictator' frees more than 50 prisoners to ease sanctions in Trump trade \n                 \n                  Belarus opposition leader Siarhei Tsikhanouski freed from jail after rare visit by top US envoy\n                 \n                  Polls close in Belarus - with Alexander Lukashenko set to extend 30-year presidential rule\n                 \"At the same time, of course, I think about those people who are not yet free. I am very much looking forward to the moment when we can all hug each other, when we can all see one another, when we will all be free,\" she added. Ms Kolesnikova became a symbol of resistance when Belarusian authorities tried to deport her to Ukraine in September 2020. She broke away from security forces at the border, tore up her passport and walked back into Belarus. The professional flautist was convicted in 2021 on charges including conspiracy to seize power and sentenced to 11 years in prison, but then fell seriously ill and underwent surgery. Mr Bialiatski, 63, who founded Viasna, Belarus' oldest and most prominent human rights group, won the Nobel Peace Prize in 2022 while awaiting trial for charges which were widely regarded as politically motivated. After arriving in Lithuania, he spoke briefly to crowds outside the US embassy in Vilnius and said in English: \"Never give up\". He was seen by authorities as especially dangerous because of what Belarus alleged were his \"extremist tendencies\". Sentenced to 10 years in 2023, he had been held at a penal colony in Gorki, notorious for beatings and hard labour, and his health was deteriorating, according to his wife. The Norwegian Nobel Committee expressed \"profound relief and heartfelt joy\" at the release of Mr Bialiatski and called on the Belarusian authorities \"to release all political prisoners\". Moscow correspondent There have been sporadic prisoner releases over the past twelve months, but this is by far the biggest and most significant. Nobel laureate Ales Bialiatski is a long-time thorn in the side of Belarus's authoritarian leader, while Maria Kolesnikova led the mass protests against Lukashenko in 2020.  Both chose incarceration over exile and as such became powerful symbols of defiance. The conditions of their detention had fuelled concerns over their health. Kolesnikova's sister, Tatsiana Khomich, told me in January that she feared for Maria's life. Their release is a massive moment for their families and the opposition movement in general. The Trump administration isn't acting out of purely altruistic motives, though. It's openly expressed hope that warmer ties with Minsk will lead to greater influence with Moscow, when it comes to Ukraine peace talks. But that might be overly optimistic from Washington. Belarus depends on Russia's support and analysts say Lukashenko's loyalty will always be to Vladimir Putin. There's a belief that the man known as Europe's last dictator will merely use this contact with Washington for his own ends - economic recovery rather than democratic transition. Even after this release, it's estimated there are still over 1,100 political prisoners behind bars. Read more from Sky News:Venezuelan oil exports 'at standstill'Far right 'emboldened' in AustraliaThailand-Cambodia fighting continues Sviatlana Tsikhanouskaya, who is an opposition leader in exile and a close ally of Ms Kolesnikova, posted her delight on X: \"Maria is free!\" She added: \"For five years, we fought for Maria Kolesnikova's freedom. I am deeply grateful to the US administration and our European partners who worked tirelessly to secure her release. \"Maria is in a safe place, and we hope to hear from her soon.\" Ukrainian officials said President Volodymyr Zelenskyy had also spoken to Ms Kolesnikova after her release, although they have not released any more details. In a statement published on the Telegram social media platform, the Military Intelligence of Ukraine confirmed more details of who had been released, including people \"imprisoned for political reasons\". Among the group were Viktar Babaryka, a former banker jailed in 2021 after challenging Mr Lukashenko at the polls, and journalist Maryna Zolatava, who was imprisoned in 2023 on a range of charges including harming national security. Critics argue both sentences were politically motivated. President Lukashenko has ruled the nation with an iron fist for more than three decades, but has been repeatedly sanctioned by Western countries both for its crackdown on human rights and for allowing Moscow to use its territory in the invasion of Ukraine. Following the two-day talks, US envoy John Coale posted on X: \"Another 156 political prisoners released thanks to President Trump's leadership! An important step in US-Belarus relations.\" It is not clear whether the figure includes previously released prisoners. Speaking to the Reuters news agency on Saturday, Mr Coale said around 1,000 remaining political prisoners in Belarus could be released in the coming months. \"I think it's more than possible that we can do that, I think it's probable... We are on the right track, the momentumis there.\" US officials eased some sanctions after meeting with President Lukashenko in September 2025. In response, Minsk freed more than 50 political prisoners into Lithuania, taking the total number freed by Belarus since July 2024 to more than 430. Mr Coale also spoke about weather balloons which have flying over the border from Belarus into Lithuania. \"He [Mr Lukashenko] agreed recently to do everything he could to stop the balloons,\" Mr Coale told the Reuters news agency. Lithuania has declared a state of emergency over the balloons, used by cigarette smugglers, which have caused over a dozen closures of Vilnius airport in recent months."
    },
    {
        "title": "Israel says Hamas commander - who was one of the architects of the 7 October 2023 attacks - killed in strike",
        "description": "A senior Hamas commander who was one of the architects of the 7 October 2023 attacks on Israel has been killed in a strike on Gaza City, according to the country&#8217;s military. ",
        "url": "https://news.sky.com/story/israel-says-hamas-commander-who-was-one-of-the-architects-of-the-7-october-2023-attacks-killed-in-strike-13482984",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-hamas-strike-saed-raed-saed_7109184.jpg?20251213171506",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 17:11:00",
        "Headline": "Raed Saad's death is the highest-profile killing of a senior Hamas figure since the ceasefire came into effect in October. ",
        "Content": " A senior Hamas commander who was one of the architects of the 7 October 2023 attacks on Israel has been killed in a strike on Gaza City, according to the country’s military.  Raed Saad was targeted in response to an attack by Hamas in which an explosive device injured two soldiers on Saturday, Israeli Prime Minister Benjamin Netanyahu and Defence Minister Israel Katz said in a joint statement. It is the highest-profile killing of a senior Hamas figure since the Gaza ceasefire came into effect in October. Gaza health authorities said the attack on a car in Gaza City killed five people and wounded at least 25 others, but there has been no confirmation from Hamas or medics that Saed was among the dead. Hamas condemned the attack in a statement as a violation of the ceasefire agreement but stopped short of threatening retaliation. An Israeli military official described Saed as a high-ranked Hamas member who helped establish and advance the group's weapons production network. \"In recent months, he operated to re-establish Hamas' capabilities and weapons manufacturing, a blatant violation of the ceasefire,\" the official said. \n                  Rafah crossing to open 'in coming days' to let Gazans cross into Egypt, Israel says\n                 \n                  Talks begin on the next phase of Gaza ceasefire deal as Hamas and Israel hand over remains\n                 \n                  Israeli airstrike on Palestinian refugee camp kills 13, says Lebanon\n                 The 10 October ceasefire has enabled hundreds of thousands of Palestinians to return to Gaza City's ruins after a war that began after Hamas-led militants killed 1,200 people, most of them civilians, and seized 251 hostages in an attack on southern Israel. Israel's retaliatory offensive has killed more than 70,700 Palestinians, most of them civilians, according to health officials in Gaza. Israel has pulled troops back from city positions, and aid flows have increased, but violence has not completely stopped. Palestinian health authorities say Israeli forces have killed at least 386 people in strikes in Gaza since the truce, while Israel says three of its soldiers have been killed."
    },
    {
        "title": "Trump says US 'will retaliate' after three Americans killed in Syrian 'Islamic State attack'",
        "description": "Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria. ",
        "url": "https://news.sky.com/story/trump-says-us-will-retaliate-after-three-americans-killed-in-syrian-islamic-state-attack-13483086",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-syria_7109370.jpg?20251213215752",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 19:00:00",
        "Headline": "Two US service members and one civilian died, while three other people were injured, in an ambush by a lone gunman. ",
        "Content": " Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria.  Two US service members and one civilian died and three other people were injured in an ambush on Saturday by a lone IS - also often called ISIS in Syria and Iraq - gunman, according to the he US military's Central Command. The attack on US troops in Syria is the first to inflict fatalities since the fall of President Bashar Assad a year ago. \"This is an ISIS attack,\" the US president told reporters at the White House before leaving for the Army-Navy football game in Baltimore. He paid condolences to the three people killed and said the three others who were wounded \"seem to be doing pretty well\". In a post on his Truth Social platform, Mr Trump said \"there will be very serious retaliation\". The shooting took place near historic Palmyra, according to the state-run SANA news agency, and the casualties were taken by helicopter to the al Tanf garrison near the border with Iraq and Jordan. \n                  At least two dead and eight critically injured in US university shooting - as police hunt gunman\n                 \n                  Epstein latest: Trump says he 'knows nothing about' photos after new images released\n                 \n                  Washington state flooding forces entire city to evacuate as rivers reach historic highs\n                 The UK-based Syrian Observatory for Human Rights said the attacker was a member of the Syrian security force. Syria's Interior Ministry spokesman Nour al Din al Baba said authorities are looking into whether the gunman was an IS member or only carried its extreme ideology, and denied reports suggesting he was a security member. Read more from Sky News:Belarus pardons key opposition activistIsrael says strike kills one of the architects of the 7 October 2023 attacks Central Command earlier said in a post on X that the gunman was killed, while the identities of the service members killed wouldn't be released until 24 hours after their next of kin have been notified. Pentagon chief spokesman Sean Parnell said the civilian killed in the attack was a US interpreter. US defence secretary Pete Hegseth posted on X: \"Let it be known, if you target Americans - anywhere in the world - you will spend the rest of your brief, anxious life knowing the United States will hunt you, find you, and ruthlessly kill you.\" The US has hundreds of troops deployed in eastern Syria as part of a coalition fighting IS. The group was defeated on the battlefield in Syria in 2019 but the UN says the group still has between 5,000 and 7,000 fighters in Syria and Iraq, and its sleeper cells still carry out deadly attacks. Syria's interim president, Ahmad al Sharaa, made a historic visit to Washington DC last month as Syria signed a political cooperation agreement with the US-led coalition against IS. \"This was an ISIS attack against the US, and Syria, in a very dangerous part of Syria, that is not fully controlled by them,\" Mr Trump said in his social media post, adding that Mr al Sharaa was \"extremely angry and disturbed\"."
    },
    {
        "title": "Venezuelan oil exports 'at standstill' after US tanker seizure",
        "description": "Oil exports from Venezuela have fallen significantly since the US seized a tanker this week, according to shipping data and maritime sources.",
        "url": "https://news.sky.com/story/venezuelan-oil-exports-at-standstill-after-us-tanker-seizure-13482873",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-donald-trump_7106949.png?20251210221212",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 14:14:00",
        "Headline": "About 11 million barrels of oil and fuel are said to be currently stuck in Venezuelan waters as the threat of more US seizures looms large.",
        "Content": " Oil exports from Venezuela have fallen significantly since the US seized a tanker this week, according to shipping data and maritime sources. Special forces and the coastguard raided the ship, which America said was being used to carry sanctioned oil from Venezuela and Iran. President Nicolas Maduro called Wednesday's seizure an act of \"piracy\", and Venezuelan officials claim President Trump's true motivation is regime change.  The ship was loaded with some 1.8 million barrels of Venezuela's Merey heavy crude when it was boarded about 70 miles off the coast. The US further increased pressure on Mr Maduro this week by bringing in new sanctions on six supertankers and shipping firms dealing with Venezuela, as well as three of the president's nephews. Tanker movements in and out of the South American country are now said to have ground to a virtual standstill amid fears more ships could be seized. About 11 million barrels of oil and fuel are currently stuck in Venezuelan waters, according to the Reuters news agency, which cited sources and data. \n                  Maduro's 'narco nephews' hit with sanctions as Trump tightens screw on Venezuela\n                 \n                  Would Trump really invade Venezuela?\n                 \n                  US won't 'stand by and watch sanctioned vessels', warns White House after tanker seized off Venezuela\n                 The ship seized this week, the Skipper, had carried both Iranian and Venezuelan oil, and the raid was the first on a Venezuelan tanker - although the country has been under sanctions since 2019. US company Chevron is the exception, and has special government permission to deal with state-run oil company PDVS. It has exported two Venezuelan cargoes this month, both after the seizure, and data showed two more were being prepared on Friday.  Prior to the seizure, Venezuela exported 952,000 barrels per day in November - about 80% of it bound for China. The revenues are crucial for propping up President Maduro's regime. Most Western governments regard him as a dictator who jails opponents and has cheated elections to stay in power. Read more:The US-Venezuela crisis explainedEverything we know about ship seizure The raid on the tanker took place the same day a warrant to seize the ship was due to expire, according the document, which was unsealed on Friday. It showed that Magistrate Judge Zia Faruqui last month gave the Trump administration until 10 December to seize the vessel.  The Skipper had been trying to sail unnoticed using a method called \"spoofing\", transmitting a false location to hide its movements, Sky News analysis found. The seizure followed a large US naval build-up in the region, which has destroyed multiple boats purported to be smuggling drugs to America over the last few months. However, no firm evidence to back up the claims has been provided and President Maduro denies he is involved in the narcotics trade."
    },
    {
        "title": "Lionel Messi fans cause chaos as star visits Kolkata stadium on first day of India tour",
        "description": "Lionel Messi fans have caused chaos in Kolkata after the football legend appeared at a stadium on the first day of his Indian tour.",
        "url": "https://news.sky.com/story/lionel-messi-fans-cause-chaos-as-star-visits-kolkata-stadium-on-first-day-of-india-tour-13482818",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-messi-india_7108837.jpg?20251213100034",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 11:52:00",
        "Headline": "West Bengal's chief minister says she is \"deeply disturbed and shocked\" and has  apologised to Messi and ordered an investigation.",
        "Content": " Lionel Messi fans have caused chaos in Kolkata after the football legend appeared at a stadium on the first day of his Indian tour. Seats were ripped up, the stage was trashed and people invaded the pitch after an event that was abandoned after about 20 minutes. Pictures also show a Messi billboard hanging precariously from an upper tier and people climbing the fences. The Inter Miami star was joined at Salt Lake Stadium by teammates Rodrigo De Paul and Luis Suarez. However, there was a large crowd clustered around the 5ft 7in (170cm) Argentinian, including politicians, media and at least one guard with an automatic weapon. The unrest got worse after security abandoned a lap of the stadium due to the number of people around Messi, reported India Today. Messi was scheduled for a 45-minute visit to the stadium, but only appeared for 20 minutes. \n                  At least 25 people dead after major fire at nightclub in Goa, India\n                 \n                  Narendra Modi and Vladimir Putin embrace before talking trade at India-Russia summit\n                 \n                  Dharmendra dies: Modi pays tribute to 'iconic' film star and Bollywood legend\n                 The event's chief organiser, Satadru Dutta, has been detained, Rajeev Kumar, director general of West Bengal police, said. He added Mr Dutta has \"already pledged in writing that tickets sold for the event should be refunded\". Supporters said Saturday's much-anticipated appearance fell well short of what they had paid for. \"Only leaders and actors were surrounding Messi... We have got a ticket for 12,000 rupees (£99), but we were not even able to see his face,\" a fan told news agency ANI. West Bengal state's chief minister, Mamata Banerjee, apologised to Messi and ordered an investigation. \"I am deeply disturbed and shocked by the mismanagement witnessed today at Salt Lake stadium,\" Ms Banerjee posted on X. \"I sincerely apologise to Lionel Messi, as well as to all sports lovers and his fans, for the unfortunate incident,\" she said. Organisers of Messi's three-day tour have not yet commented. The Argentinian virtually unveiled a 70ft (21m) statue of himself in Kolkata on Saturday and is also scheduled to visit Hyderabad, Mumbai and New Delhi. The 38-year-old will take in youth football events, concerts, a padel tournament, as well as launching charitable initiatives. West Bengal, Kerala and Goa states have large football followings in a country where cricket dominates the sporting agenda. Argentine legend Diego Maradona visited Kolkata twice, and in 2017 unveiled a statue there of himself holding the World Cup."
    },
    {
        "title": "Fighting between Thailand and Cambodia continues after Donald Trump claims ceasefire",
        "description": "Fighting along the border between Thailand and Cambodia continues to rage - despite US President Donald Trump claiming to have secured a ceasefire agreement.",
        "url": "https://news.sky.com/story/fighting-between-thailand-and-cambodia-continues-after-donald-trump-claims-ceasefire-13482811",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-thailand-cambodia_7108853.jpg?20251213110435",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-13 13:09:00",
        "Headline": "A number of the peace agreements US President Donald Trump has touted in his quest for a Nobel Peace Prize have come under strain.",
        "Content": "Fighting along the border between Thailand and Cambodia continues to rage - despite US President Donald Trump claiming to have secured a ceasefire agreement. Around two dozen people have been killed in the past week, according to official reports, with hundreds of thousands of others displaced from their homes. The latest clashes flared up following a skirmish last Sunday that derailed a previous ceasefire promoted by Mr Trump. On Friday, Mr Trump said the two countries \"have agreed to CEASE all shooting effective this evening, and go back to the original Peace Accord made with me\" on his Truth Social platform. But fighting has continued on Saturday, and Thai leader Anutin Charnvirakul said his nation would \"continue to perform military actions until we feel no more harm and threats to our land and people\". The Thai defence ministry said jets carried out airstrikes on Saturday morning. Cambodian Prime Minister Hun Manet also did not mention a ceasefire in comments posted on Saturday, insisting his country \"is ready to cooperate in any way that is needed\". \n                  Thailand has launched more airstrikes, claims Cambodia, as heavy fighting flares following ceasefire\n                 \n                  Fresh fighting on Thailand Cambodia border sees tens of thousands flee\n                 \n                  Thailand launches airstrikes against Cambodia as deadly border clashes reignite\n                 Why are Thai and Cambodian troops fighting? The roots of the Thai-Cambodian border conflict lie in a history of enmity over competing territorial claims. These claims largely stem from a 1907 map created while Cambodia was under French colonial rule, which Thailand argues is inaccurate. Tensions were heightened by a 1962 International Court of Justice ruling that awarded sovereignty to Cambodia, which still angers many Thais. Read more:Tens of thousands flee Thailand-Cambodia conflict  What has happened to Trump's peace 'deals'? A ceasefire in July was brokered by Malaysia and pushed through under pressure from Mr Trump, who threatened to withhold trade privileges unless the two sides agreed. It was formalised in more detail in October at a regional meeting in Malaysia that the US president attended. However, the agreement did not resolve the status of the disputed territory, instead ushering in a tenuous ceasefire that ultimately failed to hold. Fighting resumed on Sunday in a skirmish that wounded two Thai soldiers. The apparent faltering or collapse of the ceasefire deal comes as a number of the peace agreements Mr Trump has touted in his quest for a Nobel Peace Prize have come under strain. Fighting has surged in eastern Democratic Republic of Congo, less than a week after the DRC and Rwanda signed a deal in Mr Trump's presence. Meanwhile, an internationally-endorsed plan to end the Israel-Hamas war in Gaza is still not finalised and remains in limbo, with sporadic fighting continuing."
    },
    {
        "title": "Trump says US 'will retaliate' after three Americans killed in Syrian 'Islamic State attack'",
        "description": "Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria. ",
        "url": "https://news.sky.com/story/trump-says-us-will-retaliate-after-three-americans-killed-in-syrian-islamic-state-attack-13483086",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-syria_7109370.jpg?20251213215752",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-13 19:00:00",
        "Headline": "Two US service members and one civilian died, while three other people were injured, in an ambush by a lone gunman. ",
        "Content": " Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria.  Two US service members and one civilian died and three other people were injured in an ambush on Saturday by a lone IS - also often called ISIS in Syria and Iraq - gunman, according to the he US military's Central Command. The attack on US troops in Syria is the first to inflict fatalities since the fall of President Bashar Assad a year ago. \"This is an ISIS attack,\" the US president told reporters at the White House before leaving for the Army-Navy football game in Baltimore. He paid condolences to the three people killed and said the three others who were wounded \"seem to be doing pretty well\". In a post on his Truth Social platform, Mr Trump said \"there will be very serious retaliation\". The shooting took place near historic Palmyra, according to the state-run SANA news agency, and the casualties were taken by helicopter to the al Tanf garrison near the border with Iraq and Jordan. \n                  At least two dead and eight critically injured in US university shooting - as police hunt gunman\n                 \n                  Epstein latest: Trump says he 'knows nothing about' photos after new images released\n                 \n                  Washington state flooding forces entire city to evacuate as rivers reach historic highs\n                 The UK-based Syrian Observatory for Human Rights said the attacker was a member of the Syrian security force. Syria's Interior Ministry spokesman Nour al Din al Baba said authorities are looking into whether the gunman was an IS member or only carried its extreme ideology, and denied reports suggesting he was a security member. Read more from Sky News:Belarus pardons key opposition activistIsrael says strike kills one of the architects of the 7 October 2023 attacks Central Command earlier said in a post on X that the gunman was killed, while the identities of the service members killed wouldn't be released until 24 hours after their next of kin have been notified. Pentagon chief spokesman Sean Parnell said the civilian killed in the attack was a US interpreter. US defence secretary Pete Hegseth posted on X: \"Let it be known, if you target Americans - anywhere in the world - you will spend the rest of your brief, anxious life knowing the United States will hunt you, find you, and ruthlessly kill you.\" The US has hundreds of troops deployed in eastern Syria as part of a coalition fighting IS. The group was defeated on the battlefield in Syria in 2019 but the UN says the group still has between 5,000 and 7,000 fighters in Syria and Iraq, and its sleeper cells still carry out deadly attacks. Syria's interim president, Ahmad al Sharaa, made a historic visit to Washington DC last month as Syria signed a political cooperation agreement with the US-led coalition against IS. \"This was an ISIS attack against the US, and Syria, in a very dangerous part of Syria, that is not fully controlled by them,\" Mr Trump said in his social media post, adding that Mr al Sharaa was \"extremely angry and disturbed\"."
    },
    {
        "title": "Trump sued by preservation group over $300m White House ballroom",
        "description": "Donald Trump is being sued by a preservation group which wants a federal court to halt the construction of a new ballroom at the White House until it goes through multiple independent reviews and wins approval from Congress. ",
        "url": "https://news.sky.com/story/trump-sued-by-preservation-group-over-300m-white-house-ballroom-13482774",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-ballroom_7108751.jpg?20251213021211",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-13 01:54:00",
        "Headline": "The National Trust for Historic Preservation wants to change or stop plans for the new ballroom that would be nearly double the size of the White House.",
        "Content": "Donald Trump is being sued by a preservation group which wants a federal court to halt the construction of a new ballroom at the White House until it goes through multiple independent reviews and wins approval from Congress.  The National Trust for Historic Preservation's lawsuit represents the most concrete effort so far to change or stop plans for the new $300m ballroom that would be nearly double the size of the White House before the East Wing was demolished. \"No president is legally allowed to tear down portions of the White House without any review whatsoever - not President Trump, not President [Joe] Biden, and not anyone else,\" the non-profit organisation's lawsuit states. \"And no president is legally allowed to construct a ballroom on public property without giving the public the opportunity to weigh in.\" The ballroom project has drawn criticism from preservationists, architects, and President Trump's political opponents. It is among several sweeping changes Mr Trump has made to the White House since he returned to office in January. He has installed gold decorations throughout the Oval Office, and paved over the lawn of the Rose Garden to create a patio similar to the setting at his Mar-a-Lago estate in Florida. Commenting on the lawsuit, White House spokesman David Ingle said that Mr Trump is within his \"full legal authority to modernise, renovate and beautify the White House - just like all of his predecessors did\". \n                  Metropolitan police chief accuses Trump of talking 'nonsense' about London crime\n                 \n                  'I stand before you a free man', says Kilmar Abrego Garcia as judge blocks ICE from detaining him\n                 \n                  Would Trump really invade Venezuela?\n                 Mr Ingle did not specify whether the president was planning to consult Congress at any point. While nearly every president alters the White House, Mr Trump's plans are the most extensive since President Harry Truman's near-total renovation of its oldest section. Unlike Mr Trump, Mr Truman obtained explicit congressional approval and funding, consulted engineering and arts authorities, and appointed a bipartisan commission to oversee the work. Mr Trump has stressed that the project is funded with private money, including his own, but that doesn't change how federal laws and procedures apply to a US government project. Federal law cites \"express authority of Congress\" over DC projects. Read more from Sky News:Trump says Epstein photos are 'no big deal'Trump threatens Venezuela land strikes 'soon' Mr Trump has long maintained that a White House ballroom is overdue, noting that large events are held in tents and guests get wet when it rains. The lawsuit said Mr Trump never gathered public input and ignored statutes requiring consultation with the National Capital Planning Commission and the Commission of Fine Arts before tearing down the East Wing and starting work on the ballroom."
    },
    {
        "title": "Drunk raccoon behind liquor store rampage suspected of other 'break-ins'",
        "description": "A raccoon that passed out drunk after running amok in a Virginia liquor store is suspected of two other \"break-ins\".",
        "url": "https://news.sky.com/story/drunk-raccoon-behind-liquor-store-rampage-suspected-of-other-break-ins-13482797",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251204182345",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-13 10:09:00",
        "Headline": "The comatose critter slept off his wild night at the local animal shelter but was later set free.",
        "Content": " A raccoon that passed out drunk after running amok in a Virginia liquor store is suspected of two other \"break-ins\". Images of smashed bottles and the animal splayed out next to the toilet went viral last week - but the woman who found him has revealed the raccoon has form. \"This is not the first time he's been in one of the buildings. This is the third break-in he's had,\" said animal protection officer Samantha Martin. \"He was in the karate studio, I think he got into DMV (Department of Motor Vehicles) - ate some of their snacks one time.\" Ms Martin said the \"smart little critter\" had been removed both times from those businesses, which are in the same complex as the ABC liquor store in Ashland. \"Each time we'd get him out - we don't relocate him - that's a death sentence for raccoons but somehow he knows how to get back in this building,\" she told local podcast Hear in Hanover. The comatose raccoon was scooped off the floor and put in a crate to \"let him relax for a few hours\" at the animal shelter - but was later set free. \n                  Man arrested after frozen pangolins, rats and porcupines seized in London\n                 \n                  Two critically injured after bear attacks schoolchildren and teachers in Canada\n                 \n                  Shout at seagulls to stop them taking your food, research suggests\n                 \"Around one or two o'clock that afternoon he was picking his head up, he was looking good and I released him back out in the woods,\" said Ms Martin - who confirmed the raccoon was male. Racoons are well known for foraging in bins - earning them the \"trash panda\" nickname - and the animal shelter has seized the moment by partnering with a firm to sell merchandise. \"Trashed Panda\" T-shirts, hoodies, mugs and stickers have already raised more than $180,000 (£135,000) to fund improvements at the animal shelter."
    },
    {
        "title": "Actor Peter Greene, known for villainous roles in Pulp Fiction and The Mask, dies at 60",
        "description": "Peter Greene, the actor known for roles in Pulp Fiction and The Mask, has died aged 60.",
        "url": "https://news.sky.com/story/actor-peter-greene-known-for-villainous-roles-in-pulp-fiction-and-the-mask-dies-at-60-13482795",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peter-greene-the-mask_7108815.jpg?20251213090455",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-13 09:05:00",
        "Headline": "In addition to his supporting roles, Greene starred in the 1993 film Clean, Shaven in which he played a man with schizophrenia who is suspected in a murder.",
        "Content": "Peter Greene, the actor known for roles in Pulp Fiction and The Mask, has died aged 60. He was found dead at his New York City apartment on Friday, his manager confirmed. A cause of death has not been disclosed. Greene drew praise for the various villains and criminals he played in his acting career, which began in his 20s. \"Nobody played a bad guy better than Peter,\" manager Gregg Edwards told Sky News' US sister outlet NBC News. \"But he also had, you know, a gentle side that most people never saw, and a heart as big as gold.\" Greene played the character Zed, a sadistic rapist security guard in Quentin Tarantino's 1994 film Pulp Fiction. He also portrayed the villain Dorian in the Jim Carrey movie The Mask in the same year. \n                  'An enigma' to the end: John le Carré's son on his father - and how his legacy lives on\n                 \n                  Primal Scream says video with alleged antisemitic imagery shown at gig was meant to provoke debate\n                 \n                  'Beloved and inspirational' author Joanna Trollope dies\n                 In addition to his supporting roles, Greene starred in the 1993 film Clean, Shaven, in which he played a man with schizophrenia who is suspected in a murder. He is also remembered for his role in Training Day alongside Denzel Washington. Greene also appeared in The Usual Suspects. Greene was born in Montclair, New Jersey, and leaves behind a sister and a brother."
    },
    {
        "title": "Next plots swoop on family-owned shoe chain Russell & Bromley",
        "description": "Next, the high street fashion giant, is plotting a swoop on Russell & Bromley, the 145 year-old shoe retailer.",
        "url": "https://news.sky.com/story/next-plots-swoop-on-family-owned-shoe-chain-russell-bromley-13482822",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-next-shop_6978999.jpg?20250731140048",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-13 10:24:00",
        "Headline": "The £16.6bn high street giant, which also owns Joules and FatFace, is among the parties in talks with advisers to the 145 year-old high street chain as it courts investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Next, the high street fashion giant, is plotting a swoop on Russell & Bromley, the 145 year-old shoe retailer. Sky News has learnt that Next, which has a market capitalisation of £16.6bn, is among the parties in talks with Russell & Bromley's advisers about a deal. City sources said this weekend that a number of other suitors were also in the frame to make an investment in the chain, although their identities were unclear. The talks come amid the peak Christmas trading period, with retail bosses hopeful that consumer confidence holds up over the coming weeks despite the stuttering economy. Russell & Bromley confirmed several weeks ago that it had drafted in Interpath, the advisory firm, to explore options for raising new financing for the business. The chain trades from 37 stores and employs more than 450 people. It was formed in 1880 when the first Russell & Bromley store opened in Eastbourne. \n                  Why there's a 'genuine risk' we won't have coffee in the future | Money blog\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  As GDP shrinks, it is not clear where the economic jump-start will come from\n                 Seven years earlier, George Bromley and Elizabeth Russell, both of whom hailed from shoemaking families, were married, paving the way for the establishment of the business. Russell & Bromley is now run by Andrew Bromley, the fifth generation of his family to hold the reins. Billie Piper, the actress and singer, is the current face of the brand as it tries to appeal to younger consumers as part of a five-year turnaround plan. If it materialised, an acquisition or investment by Next would mark the latest in a string of brand deals struck by Britain’s most successful London-listed fashion retailer. In recent years, it has bought brands such as Cath Kidston, Joules and Seraphine, the maternitywear retailer for knockdown prices. Next also owns Made.com, the online furniture retailer, and FatFace, the high street fashion brand. Under Lord Wolfson, its veteran chief executive, Next has defied the wider high street gloom to become one of the UK's best-run businesses. Its Total Platform infrastructure solution has enabled it to plug in other retail brands in order to provide logistics, e-commerce and digital service capabilities. Both Victoria's Secret and Gap also have partnerships with Next using the Total Platform offering. It was unclear whether any deal between Next and Russell & Bromley would involve acquiring the latter's brand outright or making an investment into the business. This weekend, Next declined to comment, while neither Russell & Bromley nor Interpath could be reached for comment. In a statement in October, Mr Bromley said: \"We are currently exploring opportunities to help take Russell & Bromley into the next phase of our 'Re Boot' vision. \"Since the announcement of the ‘Re Boot’ earlier this year we have made significant progress, positioning us well to build on our momentum and continue along our journey. \"We are looking forward to working with our advisory team to secure the necessary investment to accelerate our expansion plans.\""
    },
    {
        "title": "Open border immigration 'not pragmatic right now', says Green Party leader",
        "description": "Greens leader Zack Polanski has rejected claims his party would push for open borders on immigration, telling Sky News it is \"not a pragmatic\" solution for a world in \"turmoil\".",
        "url": "https://news.sky.com/story/open-border-immigration-not-pragmatic-right-now-says-green-party-leader-13482491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-polanski-rogers-calais_7108478.png?20251213181712",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-12-13 00:01:00",
        "Headline": "Speaking to Sky News in Calais, the Green leader says open borders was not in his party's manifesto and is used as an \"attack line\" by opponents to try and discredit him.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Greens leader Zack Polanski has rejected claims his party would push for open borders on immigration, telling Sky News it is \"not a pragmatic\" solution for a world in \"turmoil\". Mr Polanski distanced himself from his party's \"long-range vision\" for open borders, saying it was not in his party's manifesto and was an \"attack line used by opponents\" to question his credibility. It came as Mr Polanski, who has overseen a spike in support in the polls to double figures, refused to apologise over controversial comments he made about care workers on BBC Question Time that were criticised across the political spectrum. Mr Polanski was speaking to Sky News earlier this week while in Calais, where he joined volunteers and charities to witness how French police handle the arrival of migrants in the town that is used as a departure point for those wanting to make the journey to the UK. He told Sky News he had made the journey to the French town - once home to the \"Jungle\" refugee camp before it was demolished in 2016 - to tackle \"misinformation\" about migration and to make the case for a \"compassionate, fair and managed response\" to the small boats crisis. He said that \"no manifesto ever said anything about open borders\" and that the Greens had never stood at a general election advocating for them. \"Clearly when the world is in political turmoil and we have deep inequality, that is not a situation we can move to right now,\" he said. \n                  Scottish Greens 'riding same wave' as Green Party as membership surge continues\n                 \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 \n                  Green Party membership overtakes Liberal Democrats under Polanski\n                 \"That would also involve massive international agreements and cooperation. That clearly is not a pragmatic conversation to have right now. And very often the government try to push that attack line to make us look not pragmatic.\" The party's manifesto last year did not mention open borders, but it did call for an end to the \"hostile environment\", more safe and legal routes and for the Home Office to be abolished and replaced with a department of migration. Asked why the policy of minimal restrictions on migration had been attributed to his party, Mr Polanski said open borders was part of a \"long-range vision of what society could look like if there was a Green government and if we'd had a long time to fix some of the systemic problems\". 'We should recognise the contribution migrants make' Mr Polanski, who was elected Green Party leader in September and has been compared to Nigel Farage over his populist economic policies, said his position was one of a \"fair and managed\" migration system - although he did not specify whether that included a cap on numbers. He acknowledged that there needed to be a \"separate conversation\" about economic migration but that he did not believe any person who boarded a small boat was in a \"good situation\". While Mr Polanski stressed that he believed asylum seekers should be able to work in Britain and pay taxes, he also said he believed in the need to train British workers in sectors such as care, where one in five are foreign nationals. Asked what his proposals for a fair and managed migration system looked like, and whether he supported a cap on numbers, Mr Polanski said: \"We have 100,000 vacancies in the National Health Service. One in five care workers in the care sector are foreign nationals. \"Now, of course, that is both British workers and we should be training British workers, but we should recognise the contribution that migrants and people who come over here make.\" 'I'm not going to apologise' Mr Polanski also responded to the criticism he attracted over his comments about care workers on Question Time last week, where he told the audience: \"I don't know about you, but I don't particularly want to wipe someone's bum\" - before adding: \"I'm very grateful for the people who do this work.\" His comments have been criticised by a number of Labour MPs, including Wes Streeting, the health secretary, who said: \"Social care isn't just 'wiping someone's bum'. It is a hard, rewarding, skilled professional job. \"This is immigration as exploitation.\"  Read more:The Greens leader who wants to be the Farage of the leftWill Farage racism allegations deter voters? Asked whether he could understand why some care workers might feel he had talked down to them, the Greens leader replied: \"I care deeply about care workers. When I made those comments, it's important to give a full context. I said 'I'm very grateful to people who do this important work' and absolutely repeat that it's vital work. \"Of course, it is not part of the whole job, and I never pretended it was part of the whole job.\" Mr Polanski said he \"totally\" rejected the suggestion that he had denigrated the role of care workers in the eyes of the public and said his remarks were made in the context of a \"hostile Question Time\" where he had \"three right-wing panellists shouting at me\". Pressed on whether he wanted to apologise, he replied: \"I'm not going to apologise for being really clear that I'm really grateful to the people who do this really vital work. And yes, we should be paying them properly, too.\""
    },
    {
        "title": "UK has seen longest period without migrants arriving on small boats since 2018, figures show",
        "description": "Migrant arrivals in small boats have resumed after 28 days without crossings.",
        "url": "https://news.sky.com/story/uk-has-seen-longest-period-without-migrants-arriving-on-small-boats-since-2018-figures-show-13482829",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-migration-small-boat_7106191.jpg?20251210031219",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-13 11:02:00",
        "Headline": "So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022.",
        "Content": " Migrant arrivals in small boats have resumed after 28 days without crossings. Home Office figures showed a stretch between 14 November and yesterday (12 December) without arrivals, making it the longest uninterrupted run since autumn 2018. However, a number of Border Force vessels were active in the English Channel on Saturday morning, and it is thought that around 160 people from two small boats have been picked up. So far, 39,292 people have crossed to the UK aboard small boats this year - already more than any other year except 2022. The record that year was set at 45,774 arrivals. It comes as the government has stepped up efforts in recent months to deter people from risking their lives crossing the Channel - but measures are not expected to have an impact until next year. December is normally one of the quietest for Channel crossings, with a combination of poor visibility, low temperatures, less daylight and stormy weather making the perilous journey more difficult. The most arrivals recorded in the month of December is 3,254, in 2024. Deputy Prime Minister David Lammy met with ministers from other European countries this week as discussions over possible reform to the European Convention on Human Rights (ECHR) continue.  The issue of small boat arrivals - a very small percentage of overall UK immigration - has become a salient issue in British politics in recent years. Last month, French maritime police announced they would soon be able to intercept boats in the English Channel."
    },
    {
        "title": "Sir Keir Starmer urges doctors to accept deal to avert Christmas strikes amid 'super flu' outbreak",
        "description": "Sir Keir Starmer has called on resident doctors to accept a deal to prevent \"reckless\" strikes next week, describing it as \"beyond belief\" that they would go ahead amid a \"super flu\" outbreak.",
        "url": "https://news.sky.com/story/sir-keir-starmer-urges-doctors-to-accept-deal-to-avert-christmas-strikes-amid-super-flu-outbreak-13482776",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-keir-starmer-downing-street_7104783.jpg?20251208133510",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-13 06:32:00",
        "Headline": "Public support for strikes is low as flu hospitalisations reach record levels and schools face closures due to illness.",
        "Content": " Sir Keir Starmer has called on resident doctors to accept a deal to prevent \"reckless\" strikes next week, describing it as \"beyond belief\" that they would go ahead amid a \"super flu\" outbreak. He warned the NHS is at its \"most precarious moment\" since the coronavirus pandemic, with flu cases at record levels for this time of year. In an op-ed for The Guardian, the prime minister said the strikes \"should not happen\". \"They are reckless. They place the NHS and patients who need it in grave danger. \"I remain hopeful they can be averted. \"A good deal is on the table, and the British Medical Association (BMA) is putting it to members this weekend. \"My message to the doctors is simple - take it,\" he wrote. Union members are currently voting on a new government offer that could prevent the planned walkout. If medics reject the deal, strikes are set to run for five consecutive days starting at 7am on 17 December. Sir Keir said the latest offer would allow the BMA to postpone strikes until after Christmas. He said: \"The 'super flu' epidemic now sweeping the country means this is the NHS's most precarious moment since the pandemic.\" This means a \"battle\" in hospitals across the country where NHS staff will work around the clock, he added. Sir Keir said: \"In fact, resident doctors' colleagues will be cancelling operations, cancelling their Christmas leave and preparing for this coming storm. \"The idea that strikes could still take place in this context is frankly beyond belief.\" Read more from Sky News:King reveals 'good news' in his battle with cancerHeavy rain and floods set to hit parts of UK this weekend A new YouGov poll shows low public support for the strikes, with 58% somewhat or strongly opposing the action, compared with 33% who somewhat or strongly back it. Health and Social Care Secretary Wes Streeting said: \"Patients are pleading with resident doctors not to abandon them this Christmas. \"With flu sweeping across the nation and the health service under enormous pressure, these cynical Christmas strikes are the very last thing the NHS needs.\" The BMA's online vote on the government's deal will end on Monday, two days ahead of the planned five-day strike. Flu outbreaks affecting school attendance Flu outbreaks are affecting student attendance and school staffing, following multiple school disruptions, officials have said. A Cornwall school closed this week due to \"unprecedented and increasing incidences\" of flu and strep, after several other recent closures. Paul Whiteman, general secretary of school leaders' union NAHT, said: \"We have seen flu outbreaks in schools having an impact on both pupil attendance and staffing levels.\" Schools will do what they can to reduce the risk of infection spreading, and closing is a last resort, he said. Radwinter Church of England Primary School in Essex will be closed on Monday due to a norovirus outbreak, according to the county council website. Last week, St Martin's School in Caerphilly closed after over 250 pupils and staff fell ill. In November, Congleton High School in Cheshire temporarily shut for a deep clean following several illness cases. NHS data released Thursday show that flu hospitalisations in England remain at a record high for this time of year, rising 55% in just one week."
    },
    {
        "title": "End of small boats crossings pause exposes fragility of migration debate",
        "description": "The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate.",
        "url": "https://news.sky.com/story/end-of-small-boats-crossings-pause-exposes-fragility-of-migration-debate-13482893",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7025462.jpg?20250919180422",
        "type": "Politics",
        "Author": "Nick Martin",
        "Date Published": "2025-12-13 15:18:00",
        "Headline": "Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space.",
        "Content": "\n          People and politics correspondent\n              @NickMartinSKY\n  The end of a 28-day pause in small boat crossings has once again exposed the fragility of the migration debate. For almost a month, no migrants were recorded arriving in the UK by small boat - the longest uninterrupted lull since 2018. Quietly, ministers welcomed the timing. Public pressure over Channel crossings has remained intense, and the absence of arrivals offered a rare moment of political breathing space. But Saturday's new crossings have brought that pause to an abrupt end, reinforcing a long-running problem for successive governments: migration numbers are volatile, weather-dependent, and politically unforgiving. December has always been one of the quietest months for Channel crossings. Cold temperatures, poor visibility and rough seas make the journey significantly more dangerous, and arrivals typically fall. Critics argue that presenting the lull as progress risks mistaking seasonal conditions for policy success. The return of boats as soon as conditions eased underlines what campaigners describe as a \"one in, one out\" reality - any short-term dip can quickly be reversed. That matters because the political stakes are high. Small-boat crossings have become a defining symbol of government control - or lack of it - over borders. The prime minister has repeatedly promised to stop the \"vile trade\" of migrants in the Channel, while the home secretary has set out a tougher stance focused on deterrence, faster removals, international cooperation and disrupting smuggling gangs. Yet the numbers continue to test that claim. Total arrivals this year stand at 39,292, up from 36,816 at the same point last year - a rise of around seven per cent.  Read more:Convicted terrorist jailed after entering on a small boatFrance to be able to intercept boats in Channel Even with periodic lulls, the overall trajectory remains stubbornly high. For ministers, that makes it difficult to point to clear evidence that policy, rather than circumstance, is driving change. Opposition parties have seized on that tension. Labour argues that the Conservatives left behind a broken asylum system and that long-term solutions will take time. The Greens, led by Zack Polanski, reject what they see as headline-driven politics altogether, calling for a managed but more humane system - including allowing asylum seekers to work - while dismissing claims they support open borders.  What Saturday's crossings show is that migration policy rarely offers clean political wins. Governments want decisive moments - a turning point, a breakthrough - but the Channel does not operate to political timetables. As winter passes and crossings inevitably rise again, the government will be judged not on short pauses, but on whether it can deliver sustained reductions without relying on the weather to do the work for it."
    },
    {
        "title": "'An enigma' to the end: John le Carré's son on his father - and how his legacy lives on",
        "description": "Writing 26 books and a memoir in his lifetime, John le Carr&#233; is widely considered to be one of the best spy novelists of all time.",
        "url": "https://news.sky.com/story/an-enigma-to-the-end-john-le-carr233s-son-on-his-father-and-how-his-legacy-lives-on-13482595",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-john-le-carre-the-spy-cold_7107982.png?20251212080221",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-12-13 00:01:00",
        "Headline": "John le Carré - the novelist behind The Spy Who Came In From The Cold - is having a moment. Bethany Minelle speaks to his son, Simon Cornwell, about his legacy.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Writing 26 books and a memoir in his lifetime, John le Carré is widely considered to be one of the best spy novelists of all time. His son, Simon Cornwell, told Sky News: \"I think there was only one thing that was more important to him than his family and that was his writing.\" First gaining attention in 1963 with his breakout novel, The Spy Who Came In From The Cold, cementing his reputation 10 years later with Tinker Tailor Soldier Spy, his work is now enjoying a resurgence. The Spy Who Came In From The Cold has been adapted for the stage for the first time, with confirmation of a TV series to follow, while another of his works, The Night Manager, premieres its second season starring Tom Hiddleston in the new year. There are further productions waiting in the wings, plus an unfinished le Carré play with the potential to be developed. And archives of le Carré's work - containing over 1,200 boxes of material - have gone on display at the Bodleian Libraries at the University of Oxford. Writing under a pen name, le Carré, who was born David Cornwell, died in December 2020. \n                  Tom Hiddleston and Zawe Ashton are engaged - and have the ring to prove it\n                 \n                  Richard E Grant on joining Loki with Tom Hiddleston: 'How can I fight when I'm like an old string bean?'\n                 \n                  Tom Hiddleston to star in Kenneth Branagh's Hamlet\n                 His elder sons, Simon and Stephen, now manage the film, TV and stage rights of his work through their studio The Ink Factory, while his youngest son, Nick, expands the George Smiley universe. Smiley's continuation 'could have gone horribly wrong' One of le Carré's most well-known creations, Smiley was the antidote to James Bond - bespectacled, balding and a little out of shape - and a recurring character in le Carré's books. Simon says Nick, who has two more Smiley books in the pipeline, was \"taking on a big risk\" developing the character, but insists, \"he is the only person who could have done it and done it that well\". He goes on: \"He could find my father's voice… he grew up talking every day to my dad, as we did, and he just knows at an instinctive level what's important… \"There are so many ways in which it could have gone horribly wrong, and it went brilliantly right.\" 'A family enterprise' Explaining how they all work together - calling it a \"family enterprise in the best of ways\" - Simon explains: \"A lot of authors, when they die, they leave very strict instructions to their children, their estate as to how things should be managed and lots of rules and restrictions and everything else. My dad didn't do that.\" Le Carré's fourth son, Tim, sadly died aged 59 in 2022, shortly after editing a collection of his father's letters, titled A Private Spy. Le Carré is by no means the only author whose legacy lives on via others. Announcing a staggered retirement, Lee Child passed his hit creation Jack Reacher on to his younger brother Andrew in 2020. PG Wodehouse's much-loved Jeeves and Wooster stories have been rewritten this Christmas by celebrity fans including Frank Skinner and Alan Titchmarsh, half a century after his death. Staying part of the conversation is key While Ian Fleming's James Bond has been continued by 15 authors so far, and spilling into the young adult genre, capturing a whole new generation of readers. Mark Edlitz, intellectual expert and author of The Many Lives Of James Bond, told Sky News such continuations are essential to the survival of the work. \"We have seen all these detectives and spies who don't have a movie series or a TV series to bolster their eyeballs, and then they fade from public view. \"These books and movies help keep the author's work present and viable and part of the public conversation.\" Sarah Baxter, senior contracts advisor for The Society of Authors, says remaining relevant and visible has another big benefit too. \"That kind of partnership can go on to give a whole new lease of life to works that may have been written many, many years ago, and it can go on to generate a lot of income for a literary estate.\" 'An enigma' More than 60 million copies of Le Carré's books have been sold worldwide, with new adaptations likely to boost those sales further. But Simon Cornwell says the investment in his father's work is about more than just profits. \"We became very, very close as a family because he was very keen to be a proper dad and we were working with him and his material as well, so it was particularly towards the end of his life. It was a beautiful, thrilling thing.\" A master storyteller, the moral ambiguity of the fictional world he constructed reflected back on to its creator. Simon says: \"He remained an enigma. I think in some ways he was probably an enigma to himself… \"He was an extraordinary man to be close with, but do you ever understand somebody like that? Probably not.\" His work more widespread than ever, but the man himself - still a mystery. The Spy Who Came In From The Cold is at @sohoplace in London's West End to 21 February before embarking on a UK Tour. John le Carré: Tradecraft is at the Bodleian Libraries at the University of Oxford until 6 April."
    },
    {
        "title": "Actor Peter Greene, known for villainous roles in Pulp Fiction and The Mask, dies at 60",
        "description": "Peter Greene, the actor known for roles in Pulp Fiction and The Mask, has died aged 60.",
        "url": "https://news.sky.com/story/actor-peter-greene-known-for-villainous-roles-in-pulp-fiction-and-the-mask-dies-at-60-13482795",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peter-greene-the-mask_7108815.jpg?20251213090455",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-13 09:05:00",
        "Headline": "In addition to his supporting roles, Greene starred in the 1993 film Clean, Shaven in which he played a man with schizophrenia who is suspected in a murder.",
        "Content": "Peter Greene, the actor known for roles in Pulp Fiction and The Mask, has died aged 60. He was found dead at his New York City apartment on Friday, his manager confirmed. A cause of death has not been disclosed. Greene drew praise for the various villains and criminals he played in his acting career, which began in his 20s. \"Nobody played a bad guy better than Peter,\" manager Gregg Edwards told Sky News' US sister outlet NBC News. \"But he also had, you know, a gentle side that most people never saw, and a heart as big as gold.\" Greene played the character Zed, a sadistic rapist security guard in Quentin Tarantino's 1994 film Pulp Fiction. He also portrayed the villain Dorian in the Jim Carrey movie The Mask in the same year. \n                  'An enigma' to the end: John le Carré's son on his father - and how his legacy lives on\n                 \n                  Primal Scream says video with alleged antisemitic imagery shown at gig was meant to provoke debate\n                 \n                  'Beloved and inspirational' author Joanna Trollope dies\n                 In addition to his supporting roles, Greene starred in the 1993 film Clean, Shaven, in which he played a man with schizophrenia who is suspected in a murder. He is also remembered for his role in Training Day alongside Denzel Washington. Greene also appeared in The Usual Suspects. Greene was born in Montclair, New Jersey, and leaves behind a sister and a brother."
    },
    {
        "title": "Drunk raccoon behind liquor store rampage suspected of other 'break-ins'",
        "description": "A raccoon that passed out drunk after running amok in a Virginia liquor store is suspected of two other \"break-ins\".",
        "url": "https://news.sky.com/story/drunk-raccoon-behind-liquor-store-rampage-suspected-of-other-break-ins-13482797",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-raccoon-california_7099187.jpg?20251204182345",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-12-13 10:09:00",
        "Headline": "The comatose critter slept off his wild night at the local animal shelter but was later set free.",
        "Content": " A raccoon that passed out drunk after running amok in a Virginia liquor store is suspected of two other \"break-ins\". Images of smashed bottles and the animal splayed out next to the toilet went viral last week - but the woman who found him has revealed the raccoon has form. \"This is not the first time he's been in one of the buildings. This is the third break-in he's had,\" said animal protection officer Samantha Martin. \"He was in the karate studio, I think he got into DMV (Department of Motor Vehicles) - ate some of their snacks one time.\" Ms Martin said the \"smart little critter\" had been removed both times from those businesses, which are in the same complex as the ABC liquor store in Ashland. \"Each time we'd get him out - we don't relocate him - that's a death sentence for raccoons but somehow he knows how to get back in this building,\" she told local podcast Hear in Hanover. The comatose raccoon was scooped off the floor and put in a crate to \"let him relax for a few hours\" at the animal shelter - but was later set free. \n                  Man arrested after frozen pangolins, rats and porcupines seized in London\n                 \n                  Two critically injured after bear attacks schoolchildren and teachers in Canada\n                 \n                  Shout at seagulls to stop them taking your food, research suggests\n                 \"Around one or two o'clock that afternoon he was picking his head up, he was looking good and I released him back out in the woods,\" said Ms Martin - who confirmed the raccoon was male. Racoons are well known for foraging in bins - earning them the \"trash panda\" nickname - and the animal shelter has seized the moment by partnering with a firm to sell merchandise. \"Trashed Panda\" T-shirts, hoodies, mugs and stickers have already raised more than $180,000 (£135,000) to fund improvements at the animal shelter."
    }
]