[
    {
        "title": "Ex-officer breaks down after Manchester bomb plotter's prison assault",
        "description": "An alleged attack by the Manchester Arena bomb plotter on prison officers at a high-security jail \"will stick with\" those impacted \"for the rest of their lives\", a former officer and colleague of the victims has said.",
        "url": "https://news.sky.com/story/nobody-is-truly-safe-ex-prison-officers-grim-warning-after-bomb-plotters-jail-attack-13351768",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hashem-abedi_6885720.jpg?20250413191200",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-19 14:36:00",
        "Headline": "The assault at HMP Frankland in Durham, which saw three prison officers attacked with cooking oil before being stabbed, has raised fresh questions about the safety of staff inside Britain's jails.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  An alleged attack by the Manchester Arena bomb plotter on prison officers at a high-security jail \"will stick with\" those impacted \"for the rest of their lives\", a former officer and colleague of the victims has said. Hashem Abedi is accused of violently assaulting officers at HMP Frankland in Durham last weekend, using hot cooking oil and an improvised, or homemade, weapon. He was serving his sentence in a separation unit, known as a \"jail within a jail\", after being found guilty of 22 counts of murder for helping his brother Salman Abedi carry out a suicide bombing at an Ariana Grande concert in 2017. The attack has raised fresh questions about the safety of prison staff. Inmates inside separation units had access to cooking facilities, which has now been suspended. 'It will stick with them for life' Matthew, who only wants to be referred to by his first name, worked with the officers who were hospitalised following the attack. \"I've spoken to ex-colleagues who I'm still friends with,\" he told Sky News. \"They've not discussed the specifics of the incident, but they've said it will stick with them for the rest of their lives.\" Matthew broke down as he described the \"obscene\" and \"ludicrous\" levels of violence that staff face inside prison. He's worked at a number of different jails. \"I've been there when you're mopping your colleagues' blood… when you've seen a serious assault, and you don't know if they're gonna be OK, and then 10 minutes later, you've got to get back on with your day, you've got to carry on running the regime,\" he said. \"It is difficult, and it is awful.\" 'No adequate protection' There were 10,496 assaults against prison staff in England and Wales in the 12 months to September - a 19% rise on the previous year. \"The reality is there's no adequate protections for prison staff, and that's a great frustration,\" the general secretary of the Prison Officers' Association union, Steve Gillan, told Sky News. Having visited HMP Frankland earlier in the week, and spoken to many of the officers who were involved, Mr Gillan described the mood among colleagues as one of \"anger, frustration, and sadness\". The association, which represents prison officers, is calling for a \"reset\" - and for staff to be given stab-proof vests and tasers in \"certain circumstances\". Read more:Prisons now 98.9% fullFewer criminals to be jailed 'The entire system needs to change' Justice Secretary Shabana Mahmood said she shared \"the country's shock and anger\" at the attack. The government has launched a review that will look at how it was able to happen, and will also consider how separation centres are run. The Prison Service is also conducting a \"snap\" review into whether protective body armour should be available to frontline staff. But ex-officer Matthew said \"nobody is ever truly safe\" in the prison service, with staff facing \"impossible challenges every day\". \"The entire system needs to change,\" he added. \"From the ground up.\""
    },
    {
        "title": "The British economy has lost out - and sucking up to Trump will only get Starmer so far",
        "description": "Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK.",
        "url": "https://news.sky.com/story/the-british-economy-has-lost-out-and-questionable-meat-and-cheese-ban-is-a-reminder-of-why-13351552",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graphic-meat-cheese_6890499.png?20250419121619",
        "type": "Home",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-19 11:09:00",
        "Headline": "A ban on bringing meat and cheese home from Europe is said to be designed to protect British livestock, but is another reminder of the bureaucratic botheration hamstringing the economy since Brexit, says Adam Boulton.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK. The luggage in which they are carrying their goodies may also be seized and destroyed - and if Border Force catch them trying to smuggle meat or dairy products without a declaration, they could face criminal charges. The new jeopardy has come about because last weekend, the government quietly \"extended\" its \"ban on personal meat imports to protect farmers from foot and mouth\". This may or may not be bureaucratic over-reaction. It's certainly just another of the barriers EU and UK authorities are busily throwing up between each other and their citizens - at a time when political leaders keep saying the two sides should be drawing together in the face of Donald Trump's attacks on European trade and security. The ban on bringing back \"cattle, sheep, goat, and pig meat, as well as dairy products, from EU countries into Great Britain for personal use\" is meant \"to protect the health of British livestock, the security of farmers, and the UK's food security.\" There are bitter memories of previous outbreaks of foot and mouth disease in this country, in 1967 and 2001. In 2001, there were more than 2,000 confirmed cases of infection resulting in six million sheep and cattle being destroyed. Footpaths were closed across the nation and the general election had to be delayed. In the EU this year, there have been five cases confirmed in Slovakia and four in Hungary. There was a single outbreak in Germany in January, though Defra, the UK agriculture department, says that's \"no longer significant\". The UK imposed bans on personal meat and dairy imports from those countries, and Austria, earlier this year. Better safe than sorry? None of the cases of infection are in the three most popular countries for UK visitors - Spain, France, and Italy - now joining the ban. Places from which travellers are most likely to bring back a bit of cheese, salami, or chorizo. Could the government be putting on a show to farmers that it's on their side at the price of the public's inconvenience, when its own measures on inheritance tax and failure to match lost EU subsidies are really doing the farming community harm? Many will say it's better to be safe than sorry, but the question remains whether the ban is proportionate or even well targeted on likely sources of infection. Read more: The products you can't bring into Britain from the EU A 'Brexit benefit'? Don't be fooled The EU has already introduced emergency measures to contain the disease where it has been found. Several thousand cattle in Hungary and Slovenia have been vaccinated or destroyed. The UK's ability to impose the ban is not \"a benefit of Brexit\". Member nations including the UK were perfectly able to ban the movement of animals and animal products during the \"mad cow disease\" outbreak in the 1990s, much to the annoyance of the British government of the day. Since leaving the EU, England, Scotland and Wales are no longer under EU veterinary regulation. Northern Ireland still is because of its open border with the Republic. The latest ban does not cover people coming into Northern Ireland, Jersey, Guernsey, or the Isle of Man. Rather than introducing further red tape of its own, the British government is supposed to be seeking closer \"alignment\" with the EU on animal and vegetable trade - SPS or \"sanitary and phytosanitary\" measures, in the jargon. UK can't shake ties to EU The reasons for this are obvious and potentially make or break for food producers in this country. The EU is the recipient of 67% of UK agri-food exports, even though this has declined by more than 5% since Brexit. The introduction of full, cumbersome, SPS checks has been delayed five times but are due to come in this October. The government estimates the cost to the industry will be £330m, food producers say it will be more like £2bn. With Brexit, the UK became a \"third country\" to the EU, just like the US or China or any other nation. The UK's ties to the European bloc, however, are much greater. Half of the UK's imports come from the EU and 41% of its exports go there. The US is the UK's single largest national trading partner, but still only accounts for around 17% of trade, in or out. The difference in the statistics for travellers are even starker - 77% of trips abroad from the UK, for business, leisure or personal reasons, are to EU countries. That is 66.7 million visits a year, compared to 4.5 million or 5% to the US. And that was in 2023, before Donald Trump and JD Vance's hostile words and actions put foreign visitors off.  More bureaucratic botheration Meanwhile, the UK and the EU are making travel between them more bothersome for their citizens and businesses. This October, the EU's much-delayed EES or Entry Exit System is due to come into force. Every foreigner will be required to provide biometric information - including fingerprints and scans - every time they enter or leave the Schengen area. From October next year, visitors from countries including the UK will have to be authorised in advance by ETIAS, the European Travel and Authorisation System. Applications will cost seven euros and will be valid for three years. Since the beginning of this month, European visitors to the UK have been subject to similar reciprocal measures. They must apply for an ETA, an Electronic Travel Authorisation. This lasts for two years or until a passport expires and costs £16. The days of freedom of movement for people, goods, and services between the UK and its neighbours are long gone. The British economy has lost out and British citizens and businesses suffer from greater bureaucratic botheration. Nor has immigration into the UK gone down since leaving the EU. The numbers have actually gone up, with people from Commonwealth countries, including India, Pakistan and Nigeria, more than compensating for EU citizens who used to come and go. Will European reset pay off? The government is talking loudly about the possible benefits of a trade \"deal\" with Trump's America. Meanwhile, minister Nick Thomas Symonds and the civil servant Mike Ellam are engaged in low-profile negotiations with Europe - which could be of far greater economic and social significance. The public will have to wait to see what progress is being made at least until the first-ever EU-UK summit, due to take place on 19 May this year. Hard-pressed British food producers and travellers - not to mention young people shut out of educational opportunities in Europe - can only hope that Sir Keir Starmer considers their interests as positively as he does sucking up to the Trump administration."
    },
    {
        "title": "Ukraine war: Putin announces 30-hour 'Easter truce' - but Zelenskyy says Russian attacks continuing",
        "description": "Vladimir Putin has announced a 30-hour \"Easter truce\" in Ukraine - but Volodymyr Zelenskyy says Russian attacks are continuing hours after it was due to begin.",
        "url": "https://news.sky.com/story/ukraine-war-putin-announces-30-hour-easter-truce-but-zelenskyy-says-russian-attacks-continuing-13351884",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-zelenskyy-ukraine_6889167.jpg?20250417170352",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-19 15:55:00",
        "Headline": "The Ukrainian president says Russia is still carrying out \"assault operations\" hours after the Kremlin claimed the ceasefire would come into effect.",
        "Content": " Vladimir Putin has announced a 30-hour \"Easter truce\" in Ukraine - but Volodymyr Zelenskyy says Russian attacks are continuing hours after it was due to begin. The Ukrainian president shared a statement on X after his Russian counterpart said a ceasefire would last from 6pm on Saturday to midnight on Easter Sunday - both Moscow time, which is two hours ahead of the UK. Ukraine war latest: Follow live updates \"Guided by humanitarian considerations... the Russian side declares an Easter truce,\" Mr Putin said at a meeting with chief of general staff Valery Gerasimov. \"I order that all military actions be stopped for this period. \"We assume that the Ukrainian side will follow our example. At the same time, our troops must be ready to repel possible violations of the truce and provocations from the enemy, any of its aggressive actions.\" Mr Zelenskyy claimed Russian attacks were continuing despite the truce announcement. He wrote: \"As of now... Russian assault operations continue on several frontline sectors, and Russian artillery fire has not subsided. \"Therefore, there is no trust in words coming from Moscow.\" Mr Zelenskyy said in the same statement that a US proposal for a \"full and unconditional 30 days ceasefire\" has gone \"unanswered\" by Russia for 39 days. He added that Ukraine \"responded positively\" to the American proposal but \"Russia ignored it\". Read more:Why Putin has suddenly offered an 'Easter truce'Rubio's tough talk shows Trump's frustration The Ukrainian president said that \"if Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly - mirroring Russia's actions\". \"If a complete ceasefire truly takes hold, Ukraine proposes extending it beyond the Easter day of April 20,\" he added. \"That is what will reveal Russia's true intentions - because 30 hours is enough to make headlines, but not for genuine confidence-building measures. Thirty days could give peace a chance.\" Shortly after the ceasefire was announced, Ukraine's foreign minister Andrii Sybiha‎ said there had been a \"long history\" of Mr Putin's words not \"matching his actions\". \"We know his words cannot be trusted and we will look at actions, not words,\" he added. The ceasefire announcement has echoes of January 2023, when Mr Putin ordered his forces in Ukraine to observe a 36-hour truce for Orthodox Christmas. At that time, Mr Zelenskyy stopped short of stating his forces would reject Mr Putin's request, but dismissed the Russian move as playing for time to regroup its invasion forces and prepare additional attacks. Prisoner exchange It comes as Ukraine and Russia conducted a swap of more than 500 prisoners of war on Saturday, the latest in a series of exchanges since Russia launched a full-scale invasion more than three years ago.  Mr Zelenskyy, in a post on the Telegram messaging app, said 277 Ukrainian service personnel had returned home from Russian captivity. Russia's defence ministry said 246 servicemen had been handed over by Kyiv. It said a further 31 injured prisoners of war had been handed over to Ukraine and 15 of its own wounded servicemen had also been returned by Kyiv. The developments come after US President Donald Trump on Friday said negotiations between Ukraine and Russia are \"coming to a head\" and insisted that neither side is \"playing\" him in his push to end the grinding three-year war. Mr Trump spoke shortly after secretary of state Marco Rubio warned that the US may \"move on\" from trying to secure a Russia-Ukraine peace deal if there is no progress in the coming days, after months of efforts have failed to bring an end to the fighting."
    },
    {
        "title": "Farage accused of peddling 'nonsense and lies' - as he predicts 'the new Brexit'",
        "description": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\".",
        "url": "https://news.sky.com/story/farage-accused-of-peddling-nonsense-and-lies-as-he-predicts-the-new-brexit-13352236",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-cheshire_6888857.jpg?20250417105010",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-19 22:43:00",
        "Headline": "The Reform UK leader also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections.",
        "Content": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\". The energy secretary said both Mr Farage's party and the Conservatives were prepared to \"make up any old nonsense and lies to pursue their ideological agenda\" ahead of next month's local elections. The former Labour leader also warned if an anti-net zero agenda was followed, it would not only risk \"climate breakdown\" but also \"forfeit the clean energy jobs of the future\" in Britain. In an article for The Observer referring to price rises that began in 2022, he wrote: \"Our exposure to fossil fuels meant that, as those markets went into meltdown and prices rocketed, family, business and public finances were devastated. \"The cost of living impacts caused back then still stalk families today.\" 'Hopelessly out of touch' After the government's decision to take control of British Steel from its Chinese owners earlier this month, Mr Farage accused Mr Miliband, whom he has repeatedly called \"Red Ed\", of pursuing \"net-zero lunacy\". He said efforts to cut carbon emissions have made it harder to source the coal required to keep blast furnaces at the company's crisis-hit Scunthorpe plant running after supplies were shipped from abroad last week. In an interview with The Sun, Mr Farage said net zero could become \"the new Brexit\", \"where parliament is so hopelessly out of touch with the country\". The Reform leader wants the government to ditch its target of achieving net zero by 2050. Since she became Tory leader, Kemi Badenoch has also cast doubt on the government's commitment to achieving net zero by 2050 - a target made by her own party. But Sir Keir Starmer is expected to double down on the government's commitment to clean power at an International Energy Agency conference in London this week. Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones  'We need a British DOGE' In his interview with The Sun, Mr Farage also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections. Mr Musk's so-called Department of Government Efficiency (DOGE) has dismantled entire US federal agencies and cut tens of thousands of jobs. The Reform leader said he would \"send in the auditors\" to every council Reform wins, adding: \"The whole thing has to change. We need a British DOGE for every county and every local authority in this country.\" That's despite the National Audit Office warning councils are facing a major funding crisis, with social care in particular putting huge strain on their budgets. Votes for 1,641 council seats across 23 authorities in England will take place on 1 May."
    },
    {
        "title": "Paria Veisi: Police investigating disappearance of woman in South Wales find her body - as man charged with murder",
        "description": "Police investigating the disappearance of a woman who was last seen leaving work have found her body - and a man has been charged with murder.",
        "url": "https://news.sky.com/story/paria-veisi-police-investigating-disappearance-of-woman-in-south-wales-find-her-body-as-man-charged-with-murder-13352114",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-paria-veisi-south-wales_6889398.jpg?20250417204304",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-19 18:53:00",
        "Headline": "Two people have been charged over the death of Paria Veisi, who was reported missing after leaving work in Cardiff on 12 April.",
        "Content": "Police investigating the disappearance of a woman who was last seen leaving work have found her body - and a man has been charged with murder. Paria Veisi, 37, was reported missing after leaving work in Cardiff at around 3pm on 12 April. Her disappearance was described by police as \"totally out of character\" and prompted a widespread search. Her Mercedes GLC 200 was later found on Dorchester Avenue in the Penylan area of Cardiff on the evening of Tuesday 15 April. Her body was discovered at an address in Penylan on Saturday, South Wales Police said. Read more from Sky News:Sky News uncovers new evidence on aid workers attackThe Godfather-style gang war gripping two cities A 41-year-old man from Penylan has been charged with murder, preventing lawful and decent burial of a dead body and assaulting a person occasioning them actual bodily harm. A 48-year-old woman from London has been charged with preventing a lawful and decent burial of a dead body and conspiring to pervert the course of justice. They both appeared at Cardiff Magistrates' Court on Saturday. \"This brings our search for Paria to a sad and tragic end,\" said Detective Chief Inspector Matt Powell. \"Paria's family, all those who knew her, and those in her local community, will be deeply saddened and shocked by these latest developments. \"Family liaison officers are continuing to support Paria's family.\""
    },
    {
        "title": "Free breakfast clubs set to open at hundreds of schools in England - but teachers voice fears over funding",
        "description": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost.",
        "url": "https://news.sky.com/story/free-breakfast-clubs-set-to-open-at-hundreds-of-schools-in-england-but-teachers-voice-fears-over-funding-13352035",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-breakfast-school_6891439.jpg?20250419213037",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-19 17:37:00",
        "Headline": "From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial ahead of an expected national rollout - but school leaders are warning the pilot may lead to budget shortfalls.",
        "Content": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost. From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial beginning at the start of the new term and running to July, ahead of an expected national rollout. Ministers expect the scheme to save parents of primary-aged children £450 per year in childcare costs. School leaders, however, are warning the pilot may lead to budget shortfalls. \"The initial feedback we are hearing from many school leaders participating in the pilot is that the funding just isn't sufficient,\" said Paul Whiteman, general secretary of NAHT, the headteachers' union. \"At a time when school budgets are already stretched, most can ill-afford to subsidise this shortfall.\" Mr Whiteman added: \"It's absolutely crucial that this is addressed before the scheme is rolled out nationally. \"We have been encouraged to receive assurance from the Department for Education that funding will be looked at carefully when this trial is being assessed.\" Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones The trial is backed by £7m of government funding and more than £30m is promised for breakfast clubs in 2025-26. The government has previously insisted there will be enough funding to deliver the programme. The 750 \"early adopter\" schools are spread across the country and include mainstream schools and alternative provision schools, which educate children with specific needs.  Academies, free schools and local authority schools are all taking part. Education Secretary Bridget Phillipson said free breakfast clubs were \"at the heart\" of the Labour government's \"Plan for Change, making working parents' lives easier and more affordable, while breaking down barriers to opportunity for every child\". To see which schools are part of the trial in your area, you can visit the Department for Education's website here."
    },
    {
        "title": "Thousands of trans rights activists gather in London after Supreme Court ruling on definition of a woman",
        "description": "Police are investigating after statues were targeted with graffiti as thousands of trans rights activists demonstrated in central London.",
        "url": "https://news.sky.com/story/thousands-of-trans-rights-activists-gather-in-london-after-supreme-court-ruling-on-definition-of-a-woman-13351664",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jan-smuts-parliament_6891090.jpg?20250419174837",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-19 13:28:00",
        "Headline": "The activists are demonstrating after five judges ruled the terms \"woman\" and \"sex\" in the 2010 Equality Act \"refer to a biological woman and biological sex\".",
        "Content": " Police are investigating after statues were targeted with graffiti as thousands of trans rights activists demonstrated in central London. The protest came days after the Supreme Court ruled the legal definition of a woman is based on biological sex. Trans rights groups, trade unions and community organisations came together for what was billed as an \"emergency demonstration\" in Parliament Square in Westminster. Activists demanded \"trans liberation\" and \"trans rights now\", with some waving flags and holding banners. Graffiti was written on the statues of suffragist leader Millicent Fawcett and South African statesman Jan Christian Smuts in Parliament Square. The Metropolitan Police said it had launched an investigation after several statues were vandalised and it was investigating the incidents as criminal damage. Chief Superintendent Stuart Bell said it was \"very disappointing to see damage to seven statues and property in the vicinity of the protest\", adding: \"We support the public's right to protest but criminality like this is completely unacceptable. \"We are now investigating this criminal damage and urge anyone with any information to come forward.\" Meanwhile, a rally and march organised by Resisting Transphobia has been taking place in Edinburgh on Saturday afternoon. In a long-awaited judgment delivered on Wednesday, the UK's highest court ruled the terms \"woman\" and \"sex\" in the Equality Act 2010 \"refer to a biological woman and biological sex\". It essentially means trans women who hold gender recognition certificates are not women in the eyes of the law. This means transgender women with one of the certificates can be excluded from single-sex spaces if \"proportionate\". Baroness Kishwer Falkner, chair of the UK's Equality and Human Rights Commission (EHRC), said on Thursday that the ruling means trans women can no longer take part in women's sport, while single-sex places, such as changing rooms, \"must be based on biological sex\". The UK government said the unanimous decision by five judges brought \"clarity and confidence\" for women and service providers. A Labour Party source said Prime Minister Sir Keir Starmer had brought the party to a \"common sense position\" on the subject from an \"activist\" stance. Among the groups supporting the London protest were Trans Kids Deserve Better, Pride In Labour, Front For The Liberation Of Intersex Non-binary And Transgender people (Flint) and TransActual. Keyne Walker, strategy director at TransActual, told Sky News the government needed to put equality laws back on a \"sound footing\". Speaking from Parliament Square, they said: \"The mood is jubilant and also angry and also people are anxious... Right now trans people are coming together to demonstrate to the country, and to everybody else, that we're not going anywhere because we don't have anywhere to go... \"Queer people have been through worse than this before, and... we'll suffer through whatever is to come in the next few years.\" Read more:How Supreme Court decision has immediate real-world consequences The activist continued: \"The government needs to immediately clarify how they are going to protect trans people and what this ruling actually means for spaces. \"It does not bring clarity... businesses and venues at the moment don't know what they can and can't do... the government needs to step in and put equalities law back on a sound footing.\" It comes as Bridgerton actress Nicola Coughlan announced she has helped raise more than £100,000 for a trans rights charity following the Supreme Court decision. Following the ruling, the Irish star said she was \"completely horrified\" and \"disgusted\" by the ruling and added she would match donations up to £10,000 to transgender charity Not A Phase. The fundraiser has since raised £103,018, with a revised target of £110,000.  Why was the case heard in court? The Supreme Court ruling followed a long-running legal challenge which centred around how sex-based rights are applied through the UK-wide Equality Act 2010. The appeal case was brought against the Scottish government by campaign group For Women Scotland (FWS) following unsuccessful challenges at the Court of Session in Edinburgh. FWS called on the court to find sex an \"immutable biological state\", arguing sex-based protections should only apply to people born female.  The Scottish government argued the protections should also include transgender people with a gender recognition certificate (GRC). The Supreme Court judges were asked to rule on what the Equality Act 2010 means by \"sex\" - whether biological sex or \"certificated\" sex as legally defined by the 2004 Gender Recognition Act. Delivering the ruling at the London court on Wednesday, Lord Hodge said: \"We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another. It is not. \"The Equality Act 2010 gives transgender people protection, not only against discrimination through the protected characteristic of gender reassignment, but also against direct discrimination, indirect discrimination and harassment in substance in their acquired gender.\""
    },
    {
        "title": "Ex-officer breaks down after Manchester bomb plotter's prison assault",
        "description": "An alleged attack by the Manchester Arena bomb plotter on prison officers at a high-security jail \"will stick with\" those impacted \"for the rest of their lives\", a former officer and colleague of the victims has said.",
        "url": "https://news.sky.com/story/nobody-is-truly-safe-ex-prison-officers-grim-warning-after-bomb-plotters-jail-attack-13351768",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hashem-abedi_6885720.jpg?20250413191200",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-19 14:36:00",
        "Headline": "The assault at HMP Frankland in Durham, which saw three prison officers attacked with cooking oil before being stabbed, has raised fresh questions about the safety of staff inside Britain's jails.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  An alleged attack by the Manchester Arena bomb plotter on prison officers at a high-security jail \"will stick with\" those impacted \"for the rest of their lives\", a former officer and colleague of the victims has said. Hashem Abedi is accused of violently assaulting officers at HMP Frankland in Durham last weekend, using hot cooking oil and an improvised, or homemade, weapon. He was serving his sentence in a separation unit, known as a \"jail within a jail\", after being found guilty of 22 counts of murder for helping his brother Salman Abedi carry out a suicide bombing at an Ariana Grande concert in 2017. The attack has raised fresh questions about the safety of prison staff. Inmates inside separation units had access to cooking facilities, which has now been suspended. 'It will stick with them for life' Matthew, who only wants to be referred to by his first name, worked with the officers who were hospitalised following the attack. \"I've spoken to ex-colleagues who I'm still friends with,\" he told Sky News. \"They've not discussed the specifics of the incident, but they've said it will stick with them for the rest of their lives.\" Matthew broke down as he described the \"obscene\" and \"ludicrous\" levels of violence that staff face inside prison. He's worked at a number of different jails. \"I've been there when you're mopping your colleagues' blood… when you've seen a serious assault, and you don't know if they're gonna be OK, and then 10 minutes later, you've got to get back on with your day, you've got to carry on running the regime,\" he said. \"It is difficult, and it is awful.\" 'No adequate protection' There were 10,496 assaults against prison staff in England and Wales in the 12 months to September - a 19% rise on the previous year. \"The reality is there's no adequate protections for prison staff, and that's a great frustration,\" the general secretary of the Prison Officers' Association union, Steve Gillan, told Sky News. Having visited HMP Frankland earlier in the week, and spoken to many of the officers who were involved, Mr Gillan described the mood among colleagues as one of \"anger, frustration, and sadness\". The association, which represents prison officers, is calling for a \"reset\" - and for staff to be given stab-proof vests and tasers in \"certain circumstances\". Read more:Prisons now 98.9% fullFewer criminals to be jailed 'The entire system needs to change' Justice Secretary Shabana Mahmood said she shared \"the country's shock and anger\" at the attack. The government has launched a review that will look at how it was able to happen, and will also consider how separation centres are run. The Prison Service is also conducting a \"snap\" review into whether protective body armour should be available to frontline staff. But ex-officer Matthew said \"nobody is ever truly safe\" in the prison service, with staff facing \"impossible challenges every day\". \"The entire system needs to change,\" he added. \"From the ground up.\""
    },
    {
        "title": "The British economy has lost out - and sucking up to Trump will only get Starmer so far",
        "description": "Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK.",
        "url": "https://news.sky.com/story/the-british-economy-has-lost-out-and-questionable-meat-and-cheese-ban-is-a-reminder-of-why-13351552",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graphic-meat-cheese_6890499.png?20250419121619",
        "type": "UK",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-19 11:09:00",
        "Headline": "A ban on bringing meat and cheese home from Europe is said to be designed to protect British livestock, but is another reminder of the bureaucratic botheration hamstringing the economy since Brexit, says Adam Boulton.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK. The luggage in which they are carrying their goodies may also be seized and destroyed - and if Border Force catch them trying to smuggle meat or dairy products without a declaration, they could face criminal charges. The new jeopardy has come about because last weekend, the government quietly \"extended\" its \"ban on personal meat imports to protect farmers from foot and mouth\". This may or may not be bureaucratic over-reaction. It's certainly just another of the barriers EU and UK authorities are busily throwing up between each other and their citizens - at a time when political leaders keep saying the two sides should be drawing together in the face of Donald Trump's attacks on European trade and security. The ban on bringing back \"cattle, sheep, goat, and pig meat, as well as dairy products, from EU countries into Great Britain for personal use\" is meant \"to protect the health of British livestock, the security of farmers, and the UK's food security.\" There are bitter memories of previous outbreaks of foot and mouth disease in this country, in 1967 and 2001. In 2001, there were more than 2,000 confirmed cases of infection resulting in six million sheep and cattle being destroyed. Footpaths were closed across the nation and the general election had to be delayed. In the EU this year, there have been five cases confirmed in Slovakia and four in Hungary. There was a single outbreak in Germany in January, though Defra, the UK agriculture department, says that's \"no longer significant\". The UK imposed bans on personal meat and dairy imports from those countries, and Austria, earlier this year. Better safe than sorry? None of the cases of infection are in the three most popular countries for UK visitors - Spain, France, and Italy - now joining the ban. Places from which travellers are most likely to bring back a bit of cheese, salami, or chorizo. Could the government be putting on a show to farmers that it's on their side at the price of the public's inconvenience, when its own measures on inheritance tax and failure to match lost EU subsidies are really doing the farming community harm? Many will say it's better to be safe than sorry, but the question remains whether the ban is proportionate or even well targeted on likely sources of infection. Read more: The products you can't bring into Britain from the EU A 'Brexit benefit'? Don't be fooled The EU has already introduced emergency measures to contain the disease where it has been found. Several thousand cattle in Hungary and Slovenia have been vaccinated or destroyed. The UK's ability to impose the ban is not \"a benefit of Brexit\". Member nations including the UK were perfectly able to ban the movement of animals and animal products during the \"mad cow disease\" outbreak in the 1990s, much to the annoyance of the British government of the day. Since leaving the EU, England, Scotland and Wales are no longer under EU veterinary regulation. Northern Ireland still is because of its open border with the Republic. The latest ban does not cover people coming into Northern Ireland, Jersey, Guernsey, or the Isle of Man. Rather than introducing further red tape of its own, the British government is supposed to be seeking closer \"alignment\" with the EU on animal and vegetable trade - SPS or \"sanitary and phytosanitary\" measures, in the jargon. UK can't shake ties to EU The reasons for this are obvious and potentially make or break for food producers in this country. The EU is the recipient of 67% of UK agri-food exports, even though this has declined by more than 5% since Brexit. The introduction of full, cumbersome, SPS checks has been delayed five times but are due to come in this October. The government estimates the cost to the industry will be £330m, food producers say it will be more like £2bn. With Brexit, the UK became a \"third country\" to the EU, just like the US or China or any other nation. The UK's ties to the European bloc, however, are much greater. Half of the UK's imports come from the EU and 41% of its exports go there. The US is the UK's single largest national trading partner, but still only accounts for around 17% of trade, in or out. The difference in the statistics for travellers are even starker - 77% of trips abroad from the UK, for business, leisure or personal reasons, are to EU countries. That is 66.7 million visits a year, compared to 4.5 million or 5% to the US. And that was in 2023, before Donald Trump and JD Vance's hostile words and actions put foreign visitors off.  More bureaucratic botheration Meanwhile, the UK and the EU are making travel between them more bothersome for their citizens and businesses. This October, the EU's much-delayed EES or Entry Exit System is due to come into force. Every foreigner will be required to provide biometric information - including fingerprints and scans - every time they enter or leave the Schengen area. From October next year, visitors from countries including the UK will have to be authorised in advance by ETIAS, the European Travel and Authorisation System. Applications will cost seven euros and will be valid for three years. Since the beginning of this month, European visitors to the UK have been subject to similar reciprocal measures. They must apply for an ETA, an Electronic Travel Authorisation. This lasts for two years or until a passport expires and costs £16. The days of freedom of movement for people, goods, and services between the UK and its neighbours are long gone. The British economy has lost out and British citizens and businesses suffer from greater bureaucratic botheration. Nor has immigration into the UK gone down since leaving the EU. The numbers have actually gone up, with people from Commonwealth countries, including India, Pakistan and Nigeria, more than compensating for EU citizens who used to come and go. Will European reset pay off? The government is talking loudly about the possible benefits of a trade \"deal\" with Trump's America. Meanwhile, minister Nick Thomas Symonds and the civil servant Mike Ellam are engaged in low-profile negotiations with Europe - which could be of far greater economic and social significance. The public will have to wait to see what progress is being made at least until the first-ever EU-UK summit, due to take place on 19 May this year. Hard-pressed British food producers and travellers - not to mention young people shut out of educational opportunities in Europe - can only hope that Sir Keir Starmer considers their interests as positively as he does sucking up to the Trump administration."
    },
    {
        "title": "Farage accused of peddling 'nonsense and lies' - as he predicts 'the new Brexit'",
        "description": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\".",
        "url": "https://news.sky.com/story/farage-accused-of-peddling-nonsense-and-lies-as-he-predicts-the-new-brexit-13352236",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-cheshire_6888857.jpg?20250417105010",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 22:43:00",
        "Headline": "The Reform UK leader also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections.",
        "Content": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\". The energy secretary said both Mr Farage's party and the Conservatives were prepared to \"make up any old nonsense and lies to pursue their ideological agenda\" ahead of next month's local elections. The former Labour leader also warned if an anti-net zero agenda was followed, it would not only risk \"climate breakdown\" but also \"forfeit the clean energy jobs of the future\" in Britain. In an article for The Observer referring to price rises that began in 2022, he wrote: \"Our exposure to fossil fuels meant that, as those markets went into meltdown and prices rocketed, family, business and public finances were devastated. \"The cost of living impacts caused back then still stalk families today.\" 'Hopelessly out of touch' After the government's decision to take control of British Steel from its Chinese owners earlier this month, Mr Farage accused Mr Miliband, whom he has repeatedly called \"Red Ed\", of pursuing \"net-zero lunacy\". He said efforts to cut carbon emissions have made it harder to source the coal required to keep blast furnaces at the company's crisis-hit Scunthorpe plant running after supplies were shipped from abroad last week. In an interview with The Sun, Mr Farage said net zero could become \"the new Brexit\", \"where parliament is so hopelessly out of touch with the country\". The Reform leader wants the government to ditch its target of achieving net zero by 2050. Since she became Tory leader, Kemi Badenoch has also cast doubt on the government's commitment to achieving net zero by 2050 - a target made by her own party. But Sir Keir Starmer is expected to double down on the government's commitment to clean power at an International Energy Agency conference in London this week. Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones  'We need a British DOGE' In his interview with The Sun, Mr Farage also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections. Mr Musk's so-called Department of Government Efficiency (DOGE) has dismantled entire US federal agencies and cut tens of thousands of jobs. The Reform leader said he would \"send in the auditors\" to every council Reform wins, adding: \"The whole thing has to change. We need a British DOGE for every county and every local authority in this country.\" That's despite the National Audit Office warning councils are facing a major funding crisis, with social care in particular putting huge strain on their budgets. Votes for 1,641 council seats across 23 authorities in England will take place on 1 May."
    },
    {
        "title": "Paria Veisi: Police investigating disappearance of woman in South Wales find her body - as man charged with murder",
        "description": "Police investigating the disappearance of a woman who was last seen leaving work have found her body - and a man has been charged with murder.",
        "url": "https://news.sky.com/story/paria-veisi-police-investigating-disappearance-of-woman-in-south-wales-find-her-body-as-man-charged-with-murder-13352114",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-paria-veisi-south-wales_6889398.jpg?20250417204304",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 18:53:00",
        "Headline": "Two people have been charged over the death of Paria Veisi, who was reported missing after leaving work in Cardiff on 12 April.",
        "Content": "Police investigating the disappearance of a woman who was last seen leaving work have found her body - and a man has been charged with murder. Paria Veisi, 37, was reported missing after leaving work in Cardiff at around 3pm on 12 April. Her disappearance was described by police as \"totally out of character\" and prompted a widespread search. Her Mercedes GLC 200 was later found on Dorchester Avenue in the Penylan area of Cardiff on the evening of Tuesday 15 April. Her body was discovered at an address in Penylan on Saturday, South Wales Police said. Read more from Sky News:Sky News uncovers new evidence on aid workers attackThe Godfather-style gang war gripping two cities A 41-year-old man from Penylan has been charged with murder, preventing lawful and decent burial of a dead body and assaulting a person occasioning them actual bodily harm. A 48-year-old woman from London has been charged with preventing a lawful and decent burial of a dead body and conspiring to pervert the course of justice. They both appeared at Cardiff Magistrates' Court on Saturday. \"This brings our search for Paria to a sad and tragic end,\" said Detective Chief Inspector Matt Powell. \"Paria's family, all those who knew her, and those in her local community, will be deeply saddened and shocked by these latest developments. \"Family liaison officers are continuing to support Paria's family.\""
    },
    {
        "title": "Elderly couple who died in Alton house fire named after murder arrest",
        "description": "An elderly couple who died in a house fire have been named by police after a teenager was arrested on suspicion of murder.",
        "url": "https://news.sky.com/story/elderly-couple-who-died-in-alton-house-fire-named-after-murder-arrest-13352179",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-stan-roma-rickman_6891432.jpg?20250419211853",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 20:01:00",
        "Headline": "Stan Rickman, 91, and Roma Rickman, 88, were found dead after a fire at their home. A 16-year-old boy arrested on suspicion of murder has been bailed.",
        "Content": "An elderly couple who died in a house fire have been named by police after a teenager was arrested on suspicion of murder. Stan Rickman, 91, and Roma Rickman, 88, of Heron Close in Alton, Hampshire, were found dead after a fire at their home on Monday. A 16-year-old boy from Alton was arrested on suspicion of murder on Thursday. Police said the boy has been bailed with conditions, pending further inquiries. Hampshire and Isle of Wight Constabulary said officers were called shortly after the fire service attended the blaze at 4am on Monday. Read more from Sky News: Eurovision star diesSuffragette statue targeted during trans rights protestMan 'on first date' admits dangerous driving after crash The force is continuing to investigate the circumstances surrounding the deaths. In a statement issued on Saturday, the couple's relatives said: \"The family would like to thank everyone who has left flowers and kind messages but please respect our privacy at this difficult time.\" Police have said they want to hear from \"anyone who could have seen any suspicious behaviour in the area of Heron Close between midnight and 5am on April 14, in particular anyone who has CCTV, doorbell or dashcam footage from these times\"."
    },
    {
        "title": "Thousands of trans rights activists gather in London after Supreme Court ruling on definition of a woman",
        "description": "Police are investigating after statues were targeted with graffiti as thousands of trans rights activists demonstrated in central London.",
        "url": "https://news.sky.com/story/thousands-of-trans-rights-activists-gather-in-london-after-supreme-court-ruling-on-definition-of-a-woman-13351664",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jan-smuts-parliament_6891090.jpg?20250419174837",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 13:28:00",
        "Headline": "The activists are demonstrating after five judges ruled the terms \"woman\" and \"sex\" in the 2010 Equality Act \"refer to a biological woman and biological sex\".",
        "Content": " Police are investigating after statues were targeted with graffiti as thousands of trans rights activists demonstrated in central London. The protest came days after the Supreme Court ruled the legal definition of a woman is based on biological sex. Trans rights groups, trade unions and community organisations came together for what was billed as an \"emergency demonstration\" in Parliament Square in Westminster. Activists demanded \"trans liberation\" and \"trans rights now\", with some waving flags and holding banners. Graffiti was written on the statues of suffragist leader Millicent Fawcett and South African statesman Jan Christian Smuts in Parliament Square. The Metropolitan Police said it had launched an investigation after several statues were vandalised and it was investigating the incidents as criminal damage. Chief Superintendent Stuart Bell said it was \"very disappointing to see damage to seven statues and property in the vicinity of the protest\", adding: \"We support the public's right to protest but criminality like this is completely unacceptable. \"We are now investigating this criminal damage and urge anyone with any information to come forward.\" Meanwhile, a rally and march organised by Resisting Transphobia has been taking place in Edinburgh on Saturday afternoon. In a long-awaited judgment delivered on Wednesday, the UK's highest court ruled the terms \"woman\" and \"sex\" in the Equality Act 2010 \"refer to a biological woman and biological sex\". It essentially means trans women who hold gender recognition certificates are not women in the eyes of the law. This means transgender women with one of the certificates can be excluded from single-sex spaces if \"proportionate\". Baroness Kishwer Falkner, chair of the UK's Equality and Human Rights Commission (EHRC), said on Thursday that the ruling means trans women can no longer take part in women's sport, while single-sex places, such as changing rooms, \"must be based on biological sex\". The UK government said the unanimous decision by five judges brought \"clarity and confidence\" for women and service providers. A Labour Party source said Prime Minister Sir Keir Starmer had brought the party to a \"common sense position\" on the subject from an \"activist\" stance. Among the groups supporting the London protest were Trans Kids Deserve Better, Pride In Labour, Front For The Liberation Of Intersex Non-binary And Transgender people (Flint) and TransActual. Keyne Walker, strategy director at TransActual, told Sky News the government needed to put equality laws back on a \"sound footing\". Speaking from Parliament Square, they said: \"The mood is jubilant and also angry and also people are anxious... Right now trans people are coming together to demonstrate to the country, and to everybody else, that we're not going anywhere because we don't have anywhere to go... \"Queer people have been through worse than this before, and... we'll suffer through whatever is to come in the next few years.\" Read more:How Supreme Court decision has immediate real-world consequences The activist continued: \"The government needs to immediately clarify how they are going to protect trans people and what this ruling actually means for spaces. \"It does not bring clarity... businesses and venues at the moment don't know what they can and can't do... the government needs to step in and put equalities law back on a sound footing.\" It comes as Bridgerton actress Nicola Coughlan announced she has helped raise more than £100,000 for a trans rights charity following the Supreme Court decision. Following the ruling, the Irish star said she was \"completely horrified\" and \"disgusted\" by the ruling and added she would match donations up to £10,000 to transgender charity Not A Phase. The fundraiser has since raised £103,018, with a revised target of £110,000.  Why was the case heard in court? The Supreme Court ruling followed a long-running legal challenge which centred around how sex-based rights are applied through the UK-wide Equality Act 2010. The appeal case was brought against the Scottish government by campaign group For Women Scotland (FWS) following unsuccessful challenges at the Court of Session in Edinburgh. FWS called on the court to find sex an \"immutable biological state\", arguing sex-based protections should only apply to people born female.  The Scottish government argued the protections should also include transgender people with a gender recognition certificate (GRC). The Supreme Court judges were asked to rule on what the Equality Act 2010 means by \"sex\" - whether biological sex or \"certificated\" sex as legally defined by the 2004 Gender Recognition Act. Delivering the ruling at the London court on Wednesday, Lord Hodge said: \"We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another. It is not. \"The Equality Act 2010 gives transgender people protection, not only against discrimination through the protected characteristic of gender reassignment, but also against direct discrimination, indirect discrimination and harassment in substance in their acquired gender.\""
    },
    {
        "title": "Free breakfast clubs set to open at hundreds of schools in England - but teachers voice fears over funding",
        "description": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost.",
        "url": "https://news.sky.com/story/free-breakfast-clubs-set-to-open-at-hundreds-of-schools-in-england-but-teachers-voice-fears-over-funding-13352035",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-breakfast-school_6891439.jpg?20250419213037",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 17:37:00",
        "Headline": "From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial ahead of an expected national rollout - but school leaders are warning the pilot may lead to budget shortfalls.",
        "Content": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost. From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial beginning at the start of the new term and running to July, ahead of an expected national rollout. Ministers expect the scheme to save parents of primary-aged children £450 per year in childcare costs. School leaders, however, are warning the pilot may lead to budget shortfalls. \"The initial feedback we are hearing from many school leaders participating in the pilot is that the funding just isn't sufficient,\" said Paul Whiteman, general secretary of NAHT, the headteachers' union. \"At a time when school budgets are already stretched, most can ill-afford to subsidise this shortfall.\" Mr Whiteman added: \"It's absolutely crucial that this is addressed before the scheme is rolled out nationally. \"We have been encouraged to receive assurance from the Department for Education that funding will be looked at carefully when this trial is being assessed.\" Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones The trial is backed by £7m of government funding and more than £30m is promised for breakfast clubs in 2025-26. The government has previously insisted there will be enough funding to deliver the programme. The 750 \"early adopter\" schools are spread across the country and include mainstream schools and alternative provision schools, which educate children with specific needs.  Academies, free schools and local authority schools are all taking part. Education Secretary Bridget Phillipson said free breakfast clubs were \"at the heart\" of the Labour government's \"Plan for Change, making working parents' lives easier and more affordable, while breaking down barriers to opportunity for every child\". To see which schools are part of the trial in your area, you can visit the Department for Education's website here."
    },
    {
        "title": "Upskirted teacher says women being 'targeted' by misogynistic attitudes in classroom",
        "description": "A teacher who was upskirted by a pupil says women are being \"specifically targeted\" by misogynistic attitudes being expressed in classrooms.",
        "url": "https://news.sky.com/story/upskirted-teacher-says-women-being-targeted-by-misogynistic-attitudes-in-classroom-13351789",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-teachers-andrew-tate_6890838.jpg?20250419160601",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-19 14:59:00",
        "Headline": "Sally Rees tells Sky News that parents and carers need to help tackle behaviour that \"starts in the home and then trickles into our schools\".",
        "Content": " A teacher who was upskirted by a pupil says women are being \"specifically targeted\" by misogynistic attitudes being expressed in classrooms. Sally Rees, now the president of teachers' union NASUWT in Northern Ireland, was visited by police officers in 2016 and told they had found a USB stick containing images filmed up her skirt by a pupil. \"You just feel so violated,\" she told  North of England correspondent Shingi Mararike. \"As a teacher, you give so much of yourself in the classroom, you want the best for your pupils and then to know that somebody has done that to you, it just completely shatters your sense of trust.\" Ms Rees was filmed multiple times over 14 months and after a \"long drawn-out legal process\", the pupil was found guilty of five counts of outraging public decency. Ms Rees spoke to Sky News as a new survey by NASWUT suggested nearly three in five (59%) teachers believe social media use has contributed to a deterioration in pupils' behaviour. At the union's annual conference this weekend, members will debate calls on the union's executive to work with teachers \"to assess the risk that far-right and populist movements pose to young people\". \"We've seen the impact that Andrew Tate and other figures are having on... young boys' reactions in the classroom,\" Ms Rees said. \"One of the things we have to remember is that the majority of our workforce is female and so they are being very specifically targeted by these attitudes, specifically things around; 'You can't tell me what to do', that a man has a right to dominate a woman and has a right to a woman's body.\" The drama teacher said schools were now expected to deal with behaviour like this without enough support. \"We need to bring parents and carers into this because it starts in the home and then trickles into our schools,\" she added. \"We end up with a blame culture that education is at fault, teachers aren't dealing with it and yet teachers are the ones that actually end up being the victims of this type of behaviour.\" Read more:Parents of boy say Adolescence 'touched a nerve'Stephen Graham on how rise of incel culture influenced Netflix show When asked about the NASWUT survey, a spokesperson for the Department for Education (DfE) said: \"Education can be the antidote to hate, and the classroom should be a safe environment for sensitive topics to be discussed and where critical thinking is encouraged. \"That's why we provide a range of resources to support teachers to navigate these challenging issues, and why our curriculum review will look at the skills children need to thrive in a fast-changing online world.\""
    },
    {
        "title": "Ukraine war: Putin announces 30-hour 'Easter truce' - but Zelenskyy says Russian attacks continuing",
        "description": "Vladimir Putin has announced a 30-hour \"Easter truce\" in Ukraine - but Volodymyr Zelenskyy says Russian attacks are continuing hours after it was due to begin.",
        "url": "https://news.sky.com/story/ukraine-war-putin-announces-30-hour-easter-truce-but-zelenskyy-says-russian-attacks-continuing-13351884",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-zelenskyy-ukraine_6889167.jpg?20250417170352",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-19 15:55:00",
        "Headline": "The Ukrainian president says Russia is still carrying out \"assault operations\" hours after the Kremlin claimed the ceasefire would come into effect.",
        "Content": " Vladimir Putin has announced a 30-hour \"Easter truce\" in Ukraine - but Volodymyr Zelenskyy says Russian attacks are continuing hours after it was due to begin. The Ukrainian president shared a statement on X after his Russian counterpart said a ceasefire would last from 6pm on Saturday to midnight on Easter Sunday - both Moscow time, which is two hours ahead of the UK. Ukraine war latest: Follow live updates \"Guided by humanitarian considerations... the Russian side declares an Easter truce,\" Mr Putin said at a meeting with chief of general staff Valery Gerasimov. \"I order that all military actions be stopped for this period. \"We assume that the Ukrainian side will follow our example. At the same time, our troops must be ready to repel possible violations of the truce and provocations from the enemy, any of its aggressive actions.\" Mr Zelenskyy claimed Russian attacks were continuing despite the truce announcement. He wrote: \"As of now... Russian assault operations continue on several frontline sectors, and Russian artillery fire has not subsided. \"Therefore, there is no trust in words coming from Moscow.\" Mr Zelenskyy said in the same statement that a US proposal for a \"full and unconditional 30 days ceasefire\" has gone \"unanswered\" by Russia for 39 days. He added that Ukraine \"responded positively\" to the American proposal but \"Russia ignored it\". Read more:Why Putin has suddenly offered an 'Easter truce'Rubio's tough talk shows Trump's frustration The Ukrainian president said that \"if Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly - mirroring Russia's actions\". \"If a complete ceasefire truly takes hold, Ukraine proposes extending it beyond the Easter day of April 20,\" he added. \"That is what will reveal Russia's true intentions - because 30 hours is enough to make headlines, but not for genuine confidence-building measures. Thirty days could give peace a chance.\" Shortly after the ceasefire was announced, Ukraine's foreign minister Andrii Sybiha‎ said there had been a \"long history\" of Mr Putin's words not \"matching his actions\". \"We know his words cannot be trusted and we will look at actions, not words,\" he added. The ceasefire announcement has echoes of January 2023, when Mr Putin ordered his forces in Ukraine to observe a 36-hour truce for Orthodox Christmas. At that time, Mr Zelenskyy stopped short of stating his forces would reject Mr Putin's request, but dismissed the Russian move as playing for time to regroup its invasion forces and prepare additional attacks. Prisoner exchange It comes as Ukraine and Russia conducted a swap of more than 500 prisoners of war on Saturday, the latest in a series of exchanges since Russia launched a full-scale invasion more than three years ago.  Mr Zelenskyy, in a post on the Telegram messaging app, said 277 Ukrainian service personnel had returned home from Russian captivity. Russia's defence ministry said 246 servicemen had been handed over by Kyiv. It said a further 31 injured prisoners of war had been handed over to Ukraine and 15 of its own wounded servicemen had also been returned by Kyiv. The developments come after US President Donald Trump on Friday said negotiations between Ukraine and Russia are \"coming to a head\" and insisted that neither side is \"playing\" him in his push to end the grinding three-year war. Mr Trump spoke shortly after secretary of state Marco Rubio warned that the US may \"move on\" from trying to secure a Russia-Ukraine peace deal if there is no progress in the coming days, after months of efforts have failed to bring an end to the fighting."
    },
    {
        "title": "Why Putin has suddenly offered an 'Easter truce' in Ukraine - and the interesting way it's being presented",
        "description": "Well it is something, but it's by no means everything - a ceasefire for 30 hours, not 30 days.",
        "url": "https://news.sky.com/story/why-putin-has-suddenly-offered-an-easter-truce-in-ukraine-and-the-interesting-way-its-being-presented-13351872",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vladimir-putin-rusia_6890997.jpg?20250419171307",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-04-19 15:57:00",
        "Headline": "Vladimir Putin is trying to cast himself as the peacemaker in the eyes of US President Donald Trump - as the one who gives solutions, not problems.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Well it is something, but it's by no means everything - a ceasefire for 30 hours, not 30 days. This feels like a diplomatic dance, rather than a military, or moral, manoeuvre. An Easter truce - announced by Vladimir Putin on Saturday - is significant in the sense that, if it holds, it'll be the first actual cessation of hostilities since the war began. Ukraine war latest: Follow live updates  And it's significant in the sense that it's the first actual concession made by Moscow since Donald Trump initiated peace negotiations two months ago. But - and there's always a \"but\" when it comes to the Kremlin - how much of a concession is it really? And how much difference will it make militarily? It's nowhere near what the White House has been asking for, and it's nowhere near what Ukraine has previously consented to. The American president's first proposal was a full 30-day ceasefire. Kyiv agreed but Moscow didn't, not without conditions. Then there was the attempted maritime truce. Again, Moscow's agreement came with strings attached, in the form of sanctions relief, so it never got off the ground.  So why suddenly suggest a truce now? America had made no secret of its growing frustration at the lack of progress in peace negotiations. Trump threatened to \"take a pass\" on attempts to reach an agreement on Friday after his secretary of state said the US might \"walk away\". I don't think that in itself would be a problem for Russia, given its military dominance. But I think it could be a problem if Trump blames Putin for the lack of progress, and then pulls the plug on their thaw in relations as well.  Read more:Zelenskyy accuses US envoy of 'spreading Russian narratives'US split on Ukraine peace talks So this feels like Putin is giving Trump just enough to keep him on side, without actually making any major concession. And the way it's being presented is interesting too - at Russia's initiative, on humanitarian grounds, Ukraine must \"follow our example\". He's trying to cast himself as the peacemaker in the eyes of the US president - as the one who gives solutions, not problems - which appears contrary to Trump's opinion of Volodymyr Zelenskyy."
    },
    {
        "title": "Netanyahu tells Israeli military to increase pressure on Hamas",
        "description": "Benjamin Netanyahu has said he has instructed Israel's military to intensify pressure on Hamas after the Palestinian militant group rejected a temporary truce proposal.",
        "url": "https://news.sky.com/story/more-than-90-palestinians-killed-by-israeli-strikes-in-48-hours-says-gaza-health-ministry-13351547",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-khan-younis_6891495.jpg?20250419232725",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-19 11:04:00",
        "Headline": "In a televised address, the Israeli prime minister says his country has \"no choice but to continue fighting for our very existence, until victory\".",
        "Content": " Benjamin Netanyahu has said he has instructed Israel's military to intensify pressure on Hamas after the Palestinian militant group rejected a temporary truce proposal. In a televised address, the Israeli prime minister said that while war came with a heavy price, Israel had \"no choice but to continue fighting for our very existence, until victory\". On Thursday, Hamas rejected an Israeli proposal for a temporary pause in fighting, describing the offer as demanding \"impossible conditions\". Hamas currently holds 59 hostages, with 24 of them believed to be alive. It says it will only return them in exchange for the release of more Palestinian prisoners, a full Israeli withdrawal from Gaza and a lasting truce, as called for in the now-defunct ceasefire agreement reached earlier this year. Mr Netanyahu's remarks came after the Hamas-run health ministry in Gaza said Israeli strikes had killed more than 90 people in 48 hours. Women and children were among 15 people who were killed overnight on Friday in the southern city of Khan Younis, according to hospital staff. At least 11 of those who were killed were sheltering in a tent in the designated humanitarian zone of al Mawasi, where hundreds of thousands of displaced people are living, the hospital workers said. A further four people were killed in separate strikes on the city of Rafah, including a mother and her daughter, according to Gaza's European Hospital, where the bodies were taken. Israel says its latest campaign is to put pressure on Hamas to release more hostages and ultimately agree to disarm and leave the territory. For weeks, Israeli troops have also blockaded Gaza, barring the entry of food and other goods. Last month, 15 aid workers were killed and buried in a shallow grave after being fired upon by Israeli troops.  Hamas's armed wing said the fate of Israeli-American hostage Edan Alexander was unknown after a guard who was holding him was found killed. On Tuesday, Hamas said it had lost contact with a group of militants holding Mr Alexander in Gaza. Read more:How Israel's deadly attack on aid workers unfoldedHundreds of names removed from official Gaza war death list 'Worst humanitarian crisis' Earlier this week, the United Nations warned that almost all of Gaza's population of more than two million people is relying on the one million prepared meals produced daily by charity kitchens. The only other way to get food in Gaza is from markets, but rising prices make them unaffordable for most, according to the World Food Programme. The UN humanitarian office, known as OCHA, called it Gaza's \"worst humanitarian crisis\" since the escalation of hostilities in October 2023. Dr Hanan Balkhy, head of the World Health Organisation's eastern Mediterranean office, urged the new US ambassador in Israel, Mike Huckabee, to push Israel to lift Gaza's blockade so medicines and other aid can enter the strip. \"I would wish for him to go in and see the situation first-hand,\" she said on Friday. In his first appearance as ambassador, Mr Huckabee visited the Western Wall, the holiest Jewish prayer site in Jerusalem's Old City. He inserted a prayer into the wall, which he said was handwritten by US President Donald Trump. Mr Huckabee said every effort was being made to bring home the remaining Israeli hostages. Hamas-led militants attacked southern Israel on 7 October 2023, killing about 1,200 people and abducting 251. Israel's offensive has since killed more than 51,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not distinguish between civilians and combatants."
    },
    {
        "title": "JD Vance has 'quick and private' meeting with the Pope during visit to Rome",
        "description": "US vice president JD Vance has met with Pope Francis.",
        "url": "https://news.sky.com/story/jd-vance-has-quick-and-private-meeting-with-the-pope-during-visit-to-rome-13351562",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jd-vance-pietro-parolin_6890669.jpg?20250419145517",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-19 11:39:00",
        "Headline": "The meeting came amid tensions between the Vatican and the Trump administration over the US president's crackdown on migrants and cuts to international aid. ",
        "Content": " US vice president JD Vance has met with Pope Francis. The \"quick and private\" meeting took place at the Pope's residence, Casa Santa Marta, in Vatican City, sources told Sky News. The meeting came amid tensions between the Vatican and the Trump administration over the US president's crackdown on migrants and cuts to international aid. No further details have been released on the meeting between the vice president and the Pope, who has been recovering following weeks in hospital with double pneumonia. Mr Vance, who is in Rome with his family, also met with the Vatican's number two, Cardinal Pietro Parolin, and the foreign minister, Archbishop Paul Gallagher. The Vatican said there had been \"an exchange of opinions\" over international conflicts, migrants and prisoners. According to a statement, the two sides had \"cordial talks\" and the Vatican expressed satisfaction with the Trump administration's commitment to protecting freedom of religion and conscience. \"There was an exchange of opinions on the international situation, especially regarding countries affected by war, political tensions and difficult humanitarian situations, with particular attention to migrants, refugees and prisoners,\" the statement said. Francis has previously called the Trump administration's deportation plans a \"disgrace\". Read more from Sky News:US VP meets Italian Prime Minister Giorgia MeloniTrump: Putin not playing me - but I might give up on peace talks Mr Vance, who became Catholic in 2019, has cited medieval-era Catholic teaching to justify the immigration crackdown. The pope rebutted the theological concept Mr Vance used to defend the crackdown in an unusual open letter to the USCatholic bishops about the Trump administration in February, and called Mr Trump's plan a \"major crisis\" for the US. \"What is built on the basis of force, and not on the truth about the equal dignity of every human being, begins badly andwill end badly,\" the Pope said in the letter. Mr Vance has acknowledged Francis's criticism but said he would continue to defend his views. During an appearance in late February at the National Catholic Prayer Breakfast in Washington, he did not address the issue specifically but called himself a \"baby Catholic\" and acknowledged there were \"things about the faith that I don't know\". While he had criticised Francis on social media in the past, recently he has posted prayers for the pontiff's recovery."
    },
    {
        "title": "China hosts world's first half-marathon race between humans and robots",
        "description": "Robots have raced against humans in a half-marathon for the first time.",
        "url": "https://news.sky.com/story/china-hosts-worlds-first-half-marathon-race-between-humans-and-robots-13351485",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-robots-china_6890426.jpg?20250419044914",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-19 03:24:00",
        "Headline": "Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing on Saturday.",
        "Content": " Robots have raced against humans in a half-marathon for the first time. Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing, China, on Saturday. Some of the robots that took part were as short as 3ft 9in, while others were as tall as 5ft 9in. They had to resemble humans and be able to walk or run - wheels were not allowed. The winning robot was Tiangong Ultra, which crossed the finishing line with a time of two hours and 40 minutes, while the men's winner of the race had a time of one hour and two minutes. Tang Jian, chief technology officer for the creator of the robot, the Beijing Innovation Centre of Human Robotics, said its performance was aided by long legs and an algorithm allowing it to imitate how humans run a marathon. \"I don't want to boast, but I think no other robotics firms in the West have matched Tiangong's sporting achievements,\" he said. He added that the robot's battery was changed just three times during the race. One robot fell at the starting line and lay on the ground for a few minutes before getting up and joining the race, while another crashed into a railing, causing its human operator to fall over. Read more:How Japan could shape the future of the NHSPlanet K2-18b may be teeming with microbial lifeScientists create lab-grown chunks of chicken The robots were accompanied by human trainers, with some physically supporting the machines during the race. Several of the robots wore running shoes, with one donning boxing gloves and another wearing a red headband saying \"Bound to Win\" in Chinese. China has dozens of robot companies and while some produce humanoid robots, others create robotic dogs. Last year China's People's Liberation Army was shown using robodogs firing weapons from their backs during training exercises."
    },
    {
        "title": "JD Vance has 'quick and private' meeting with the Pope during visit to Rome",
        "description": "US vice president JD Vance has met with Pope Francis.",
        "url": "https://news.sky.com/story/jd-vance-has-quick-and-private-meeting-with-the-pope-during-visit-to-rome-13351562",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jd-vance-pietro-parolin_6890669.jpg?20250419145517",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-19 11:39:00",
        "Headline": "The meeting came amid tensions between the Vatican and the Trump administration over the US president's crackdown on migrants and cuts to international aid. ",
        "Content": " US vice president JD Vance has met with Pope Francis. The \"quick and private\" meeting took place at the Pope's residence, Casa Santa Marta, in Vatican City, sources told Sky News. The meeting came amid tensions between the Vatican and the Trump administration over the US president's crackdown on migrants and cuts to international aid. No further details have been released on the meeting between the vice president and the Pope, who has been recovering following weeks in hospital with double pneumonia. Mr Vance, who is in Rome with his family, also met with the Vatican's number two, Cardinal Pietro Parolin, and the foreign minister, Archbishop Paul Gallagher. The Vatican said there had been \"an exchange of opinions\" over international conflicts, migrants and prisoners. According to a statement, the two sides had \"cordial talks\" and the Vatican expressed satisfaction with the Trump administration's commitment to protecting freedom of religion and conscience. \"There was an exchange of opinions on the international situation, especially regarding countries affected by war, political tensions and difficult humanitarian situations, with particular attention to migrants, refugees and prisoners,\" the statement said. Francis has previously called the Trump administration's deportation plans a \"disgrace\". Read more from Sky News:US VP meets Italian Prime Minister Giorgia MeloniTrump: Putin not playing me - but I might give up on peace talks Mr Vance, who became Catholic in 2019, has cited medieval-era Catholic teaching to justify the immigration crackdown. The pope rebutted the theological concept Mr Vance used to defend the crackdown in an unusual open letter to the USCatholic bishops about the Trump administration in February, and called Mr Trump's plan a \"major crisis\" for the US. \"What is built on the basis of force, and not on the truth about the equal dignity of every human being, begins badly andwill end badly,\" the Pope said in the letter. Mr Vance has acknowledged Francis's criticism but said he would continue to defend his views. During an appearance in late February at the National Catholic Prayer Breakfast in Washington, he did not address the issue specifically but called himself a \"baby Catholic\" and acknowledged there were \"things about the faith that I don't know\". While he had criticised Francis on social media in the past, recently he has posted prayers for the pontiff's recovery."
    },
    {
        "title": "Donald Trump's deportations explained",
        "description": "Donald Trump has made mass deportations one of his main priorities since assuming office.",
        "url": "https://news.sky.com/story/donald-trumps-deportations-explained-13351516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tren-de-aragua-ms-13_6886065.jpg?20250414072058",
        "type": "US",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-04-19 08:42:00",
        "Headline": "A Supreme Court ruling is the latest roadblock to Donald Trump's immigration crackdown - but deportations have surged since he took office. ",
        "Content": "By Bethany Minelle, news reporter  Donald Trump has made mass deportations one of his main priorities since assuming office. The crackdown has seen controversial deportations to El Salvador's mega prison, a surge in immigration arrests and plans to revamp Guantanamo Bay to hold thousands of migrants. As the US Supreme Court issues an emergency order to halt further deportations of Venezuelans, we explain the rush of Trump administration deportations. Why has the focus on deportations intensified? On 15 March, the Trump administration deported more than 130 alleged Venezuelan gang members to the notorious CECOT supermax prison in El Salvador. Many of the migrants' lawyers and family members say they were not members of the Tren de Aragua gang and had no chance to dispute the government's assertion that they were. There is a parallel legal dispute over Kilmar Abrego Garcia, a Salvadorian citizen living in Maryland, who the Justice Department admits was mistakenly deported to his home country. Mr Garcia was not charged or convicted of any crimes in the US or El Salvador. The government alleges he is a member of the MS-13 gang - something his lawyers deny. Although a judge has ordered his return, the Trump administration says he is outside their jurisdiction and that the decision on whether he is returned is solely up to El Salvador. What does an 18th-century wartime law have to do with it? The Trump administration invoked the Alien Enemies Act of 1798 to deport immigrants they identified as criminals, regardless of their immigration status. The act has only been invoked three times in US history, most recently during the Second World War to hold Japanese-American civilians in internment camps. On 9 April the Supreme Court ruled the law could be used by the Trump administration to deport Venezuelan immigrants it accused of being gang members - but only with a court hearing. The American Civil Liberties Union (ACLU) said migrants were not being given the opportunity to challenge the orders, and asked the Supreme Court to urgently intervene. On 18 April, the Supreme Court temporarily blocked the removal of Venezuelan migrants from northern Texas after the ACLU reported some of the men had been loaded onto buses and were told they would be deported without due process. The White House has yet to comment on the Supreme Court's latest ruling. Mr Trump has previously said he supports the removal of \"bad people\". Where are people being deported to? Some countries - including Venezuela - do not accept deportations from the United States. This has led the Trump administration to strike agreements with other countries - including El Salvador, Honduras, Costa Rica and Panama - to take migrants.  Other challenges to the deportation drive Human rights lawyers are suing Costa Rica, alleging the Central American nation violated the rights of dozens of migrant children - some as young as two - by detaining them in a rural camp for nearly two months after they were deported from America in February. The children are part of a group of hundreds of migrants from mostly Asian countries, including Afghanistan, China, and Russia. While Costa Rica and Panama were originally intended as a kind of deportation layover, the migrants have now spent 50 days in limbo. The same group of lawyers have filed a similar case against Panama, which was holding migrants in hotels and in remote camps near the Darien Gap, where deportees said they were stripped of their phones. Sharp criticisms prompted the Panamanian government to release the migrants on the streets of Panama City last month, leaving many migrants to fend for themselves. 👉 Follow Trump 100 on your podcast app 👈 What do the statistics say? Following Mr Trump's return to the White House, data from Customs and Border Protection shows unauthorised crossings at the southern border have plummeted. Meanwhile, Immigration and Customs Enforcement (ICE) deportations have doubled, and the number of people in detention is at an all-time high, according to Sky News' US partner, NBC News. But it's worth noting that despite Mr Trump's efforts, data obtained by NBC News shows the Trump administration's deportations during his first full month in office were running slightly behind deportations under Joe Biden at the same time last year."
    },
    {
        "title": "The British economy has lost out - and sucking up to Trump will only get Starmer so far",
        "description": "Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK.",
        "url": "https://news.sky.com/story/the-british-economy-has-lost-out-and-questionable-meat-and-cheese-ban-is-a-reminder-of-why-13351552",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graphic-meat-cheese_6890499.png?20250419121619",
        "type": "Business",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-19 11:09:00",
        "Headline": "A ban on bringing meat and cheese home from Europe is said to be designed to protect British livestock, but is another reminder of the bureaucratic botheration hamstringing the economy since Brexit, says Adam Boulton.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK. The luggage in which they are carrying their goodies may also be seized and destroyed - and if Border Force catch them trying to smuggle meat or dairy products without a declaration, they could face criminal charges. The new jeopardy has come about because last weekend, the government quietly \"extended\" its \"ban on personal meat imports to protect farmers from foot and mouth\". This may or may not be bureaucratic over-reaction. It's certainly just another of the barriers EU and UK authorities are busily throwing up between each other and their citizens - at a time when political leaders keep saying the two sides should be drawing together in the face of Donald Trump's attacks on European trade and security. The ban on bringing back \"cattle, sheep, goat, and pig meat, as well as dairy products, from EU countries into Great Britain for personal use\" is meant \"to protect the health of British livestock, the security of farmers, and the UK's food security.\" There are bitter memories of previous outbreaks of foot and mouth disease in this country, in 1967 and 2001. In 2001, there were more than 2,000 confirmed cases of infection resulting in six million sheep and cattle being destroyed. Footpaths were closed across the nation and the general election had to be delayed. In the EU this year, there have been five cases confirmed in Slovakia and four in Hungary. There was a single outbreak in Germany in January, though Defra, the UK agriculture department, says that's \"no longer significant\". The UK imposed bans on personal meat and dairy imports from those countries, and Austria, earlier this year. Better safe than sorry? None of the cases of infection are in the three most popular countries for UK visitors - Spain, France, and Italy - now joining the ban. Places from which travellers are most likely to bring back a bit of cheese, salami, or chorizo. Could the government be putting on a show to farmers that it's on their side at the price of the public's inconvenience, when its own measures on inheritance tax and failure to match lost EU subsidies are really doing the farming community harm? Many will say it's better to be safe than sorry, but the question remains whether the ban is proportionate or even well targeted on likely sources of infection. Read more: The products you can't bring into Britain from the EU A 'Brexit benefit'? Don't be fooled The EU has already introduced emergency measures to contain the disease where it has been found. Several thousand cattle in Hungary and Slovenia have been vaccinated or destroyed. The UK's ability to impose the ban is not \"a benefit of Brexit\". Member nations including the UK were perfectly able to ban the movement of animals and animal products during the \"mad cow disease\" outbreak in the 1990s, much to the annoyance of the British government of the day. Since leaving the EU, England, Scotland and Wales are no longer under EU veterinary regulation. Northern Ireland still is because of its open border with the Republic. The latest ban does not cover people coming into Northern Ireland, Jersey, Guernsey, or the Isle of Man. Rather than introducing further red tape of its own, the British government is supposed to be seeking closer \"alignment\" with the EU on animal and vegetable trade - SPS or \"sanitary and phytosanitary\" measures, in the jargon. UK can't shake ties to EU The reasons for this are obvious and potentially make or break for food producers in this country. The EU is the recipient of 67% of UK agri-food exports, even though this has declined by more than 5% since Brexit. The introduction of full, cumbersome, SPS checks has been delayed five times but are due to come in this October. The government estimates the cost to the industry will be £330m, food producers say it will be more like £2bn. With Brexit, the UK became a \"third country\" to the EU, just like the US or China or any other nation. The UK's ties to the European bloc, however, are much greater. Half of the UK's imports come from the EU and 41% of its exports go there. The US is the UK's single largest national trading partner, but still only accounts for around 17% of trade, in or out. The difference in the statistics for travellers are even starker - 77% of trips abroad from the UK, for business, leisure or personal reasons, are to EU countries. That is 66.7 million visits a year, compared to 4.5 million or 5% to the US. And that was in 2023, before Donald Trump and JD Vance's hostile words and actions put foreign visitors off.  More bureaucratic botheration Meanwhile, the UK and the EU are making travel between them more bothersome for their citizens and businesses. This October, the EU's much-delayed EES or Entry Exit System is due to come into force. Every foreigner will be required to provide biometric information - including fingerprints and scans - every time they enter or leave the Schengen area. From October next year, visitors from countries including the UK will have to be authorised in advance by ETIAS, the European Travel and Authorisation System. Applications will cost seven euros and will be valid for three years. Since the beginning of this month, European visitors to the UK have been subject to similar reciprocal measures. They must apply for an ETA, an Electronic Travel Authorisation. This lasts for two years or until a passport expires and costs £16. The days of freedom of movement for people, goods, and services between the UK and its neighbours are long gone. The British economy has lost out and British citizens and businesses suffer from greater bureaucratic botheration. Nor has immigration into the UK gone down since leaving the EU. The numbers have actually gone up, with people from Commonwealth countries, including India, Pakistan and Nigeria, more than compensating for EU citizens who used to come and go. Will European reset pay off? The government is talking loudly about the possible benefits of a trade \"deal\" with Trump's America. Meanwhile, minister Nick Thomas Symonds and the civil servant Mike Ellam are engaged in low-profile negotiations with Europe - which could be of far greater economic and social significance. The public will have to wait to see what progress is being made at least until the first-ever EU-UK summit, due to take place on 19 May this year. Hard-pressed British food producers and travellers - not to mention young people shut out of educational opportunities in Europe - can only hope that Sir Keir Starmer considers their interests as positively as he does sucking up to the Trump administration."
    },
    {
        "title": "Sports rights veteran Kogan in talks to chair Starmer's football watchdog",
        "description": "A media industry veteran who has helped negotiate a string of broadcast rights deals across English football has emerged as the frontrunner to head Sir Keir Starmer's new football watchdog.",
        "url": "https://news.sky.com/story/sports-rights-veteran-kogan-in-talks-to-chair-starmers-football-watchdog-13351501",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-luton-town-derby-championship_6890433.jpg?20250419074428",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-19 06:37:00",
        "Headline": "David Kogan, who has helped negotiate TV deals for the Premier League, EFL and Women's Super League, has emerged as the leading candidate to chair the Independent Football Regulator, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A media industry veteran who has helped negotiate a string of broadcast rights deals across English football has emerged as the frontrunner to head Sir Keir Starmer's new football watchdog. Sky News can exclusively reveal that David Kogan, whose boardroom roles have included a directorship at state-owned Channel 4, is now the leading contender to chair the Independent Football Regulator (IFR) following a drawn-out recruitment process. A Whitehall source said Mr Kogan had been interviewed for the post by a government-appointed selection panel in the last few days. He was expected to be recommended to the prime minister for the role, although they cautioned that the appointment was not yet guaranteed. Mr Kogan has had extensive experience at the top of English football, having advised clients including the Premier League, English Football League, Scottish Premier League and UEFA on television rights contracts. Last year, he acted as the lead negotiator for the Women's Super League and Championship on their latest five-year broadcasting deals with Sky - the immediate parent company of Sky News - and the BBC. Outside football, he also worked with Premier Rugby, the Six Nations, the NFL on its UK broadcasting deals and the International Olympic Committee in his capacity as chief executive of, and majority shareholder in, Reel Enterprises. \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 \n                  Money blog: 'I gambled away £1m, two marriages and tried to take my life but still see ads - the UK needs to change'\n                 \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                 Mr Kogan sold that business in 2011 to Wasserman Media Group. His other current roles include advising the chief executives of CNN, the American broadcast news network, and The New York Times Company on talks with digital platforms about the growing influence of artificial intelligence on their industries. Mr Kogan has links to Labour, having in the past donated money to a number of individual parliamentary candidates, chairing LabourList, the independent news site, and writing two books about the party. One source close to the process to appoint the IFR chair described him as \"an obvious choice\" for the position. In recent months, Sky News has disclosed the identities of the shortlisted candidates for the role, with former Aston Villa FC and Liverpool FC chief executive Christian Purslow one of three candidates who made it to a supposedly final group of contenders. The others were Sanjay Bhandari, who chairs the anti-racism football charity Kick It Out, and Professor Sir Ian Kennedy, who chaired the new parliamentary watchdog established after the MPs expenses scandal. Sky News revealed last weekend, however, that government officials had resumed contact with applicants who did not make it onto that shortlist for the £130,000-a-year post. The apparent hiatus in the appointment of the IFR's inaugural chair threatened to reignite speculation that Sir Keir was seeking to diminish its powers amid a broader clampdown on Britain's economic watchdogs. Both 10 Downing Street and the Department for Culture, Media and Sport (DCMS) have sought to dismiss those suggestions, with insiders insisting that the IFR will be established largely as originally envisaged. The creation of the IFR, which will be based in Manchester, is among the principal elements of legislation now progressing through parliament, with Royal Assent expected before the summer recess. The Football Governance Bill has completed its journey through the House of Lords and will be introduced in the Commons shortly, according to the DCMS. The regulator was conceived by the previous Conservative government in the wake of the furore over the failed European Super League project, but has triggered deep unrest in parts of English football. Steve Parish, the chairman of Premier League side Crystal Palace, told a recent sports industry conference that the watchdog \"wants to interfere in all of the things we don't need them to interfere in and help with none of the things we actually need help with\". \"We have a problem that we're constantly being told that we're not a business and [that] we're part of the fabric of communities,\" he is reported to have said. \"At the same time, we're…being treated to the nth degree like a business.\" Initial interviews for the chair of the new watchdog took place last November, with an earlier recruitment process curtailed by the calling of last year's general election. Mr Kogan is said by officials to have originally been sounded out about the IFR chairmanship under the Tory administration. Lisa Nandy, the culture secretary, will also need to approve the appointment of a preferred candidate, with the chosen individual expected to face a pre-appointment hearing in front of the Commons culture, media and sport select committee as early as next month. It forms part of a process that represents the most fundamental shake-up in the oversight of English football in the game's history. The establishment of the body comes with the top tier of the professional game gripped by civil war, with Abu Dhabi-owned Manchester City at the centre of a number of legal cases with the Premier League over its financial dealings. The Premier League is also keen to agree a long-delayed financial redistribution deal with the EFL before the regulator is formally launched, although there has been little progress towards that in the last year. The government has dropped a previous stipulation that the IFR should have regard to British foreign and trade policy when determining the appropriateness of a new club owner. \"We do not comment on speculation,\" a DCMS spokesperson said when asked about Mr Kogan's candidacy to chair the football watchdog. \"No appointment has been made and the recruitment process for [IFR] chair is ongoing.\" This weekend, Mr Kogan declined to comment."
    },
    {
        "title": "The British economy has lost out - and sucking up to Trump will only get Starmer so far",
        "description": "Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK.",
        "url": "https://news.sky.com/story/the-british-economy-has-lost-out-and-questionable-meat-and-cheese-ban-is-a-reminder-of-why-13351552",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graphic-meat-cheese_6890499.png?20250419121619",
        "type": "Politics",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-19 11:09:00",
        "Headline": "A ban on bringing meat and cheese home from Europe is said to be designed to protect British livestock, but is another reminder of the bureaucratic botheration hamstringing the economy since Brexit, says Adam Boulton.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Unwary travellers returning from the EU risk having their sandwiches and local delicacies, such as cheese, confiscated as they enter the UK. The luggage in which they are carrying their goodies may also be seized and destroyed - and if Border Force catch them trying to smuggle meat or dairy products without a declaration, they could face criminal charges. The new jeopardy has come about because last weekend, the government quietly \"extended\" its \"ban on personal meat imports to protect farmers from foot and mouth\". This may or may not be bureaucratic over-reaction. It's certainly just another of the barriers EU and UK authorities are busily throwing up between each other and their citizens - at a time when political leaders keep saying the two sides should be drawing together in the face of Donald Trump's attacks on European trade and security. The ban on bringing back \"cattle, sheep, goat, and pig meat, as well as dairy products, from EU countries into Great Britain for personal use\" is meant \"to protect the health of British livestock, the security of farmers, and the UK's food security.\" There are bitter memories of previous outbreaks of foot and mouth disease in this country, in 1967 and 2001. In 2001, there were more than 2,000 confirmed cases of infection resulting in six million sheep and cattle being destroyed. Footpaths were closed across the nation and the general election had to be delayed. In the EU this year, there have been five cases confirmed in Slovakia and four in Hungary. There was a single outbreak in Germany in January, though Defra, the UK agriculture department, says that's \"no longer significant\". The UK imposed bans on personal meat and dairy imports from those countries, and Austria, earlier this year. Better safe than sorry? None of the cases of infection are in the three most popular countries for UK visitors - Spain, France, and Italy - now joining the ban. Places from which travellers are most likely to bring back a bit of cheese, salami, or chorizo. Could the government be putting on a show to farmers that it's on their side at the price of the public's inconvenience, when its own measures on inheritance tax and failure to match lost EU subsidies are really doing the farming community harm? Many will say it's better to be safe than sorry, but the question remains whether the ban is proportionate or even well targeted on likely sources of infection. Read more: The products you can't bring into Britain from the EU A 'Brexit benefit'? Don't be fooled The EU has already introduced emergency measures to contain the disease where it has been found. Several thousand cattle in Hungary and Slovenia have been vaccinated or destroyed. The UK's ability to impose the ban is not \"a benefit of Brexit\". Member nations including the UK were perfectly able to ban the movement of animals and animal products during the \"mad cow disease\" outbreak in the 1990s, much to the annoyance of the British government of the day. Since leaving the EU, England, Scotland and Wales are no longer under EU veterinary regulation. Northern Ireland still is because of its open border with the Republic. The latest ban does not cover people coming into Northern Ireland, Jersey, Guernsey, or the Isle of Man. Rather than introducing further red tape of its own, the British government is supposed to be seeking closer \"alignment\" with the EU on animal and vegetable trade - SPS or \"sanitary and phytosanitary\" measures, in the jargon. UK can't shake ties to EU The reasons for this are obvious and potentially make or break for food producers in this country. The EU is the recipient of 67% of UK agri-food exports, even though this has declined by more than 5% since Brexit. The introduction of full, cumbersome, SPS checks has been delayed five times but are due to come in this October. The government estimates the cost to the industry will be £330m, food producers say it will be more like £2bn. With Brexit, the UK became a \"third country\" to the EU, just like the US or China or any other nation. The UK's ties to the European bloc, however, are much greater. Half of the UK's imports come from the EU and 41% of its exports go there. The US is the UK's single largest national trading partner, but still only accounts for around 17% of trade, in or out. The difference in the statistics for travellers are even starker - 77% of trips abroad from the UK, for business, leisure or personal reasons, are to EU countries. That is 66.7 million visits a year, compared to 4.5 million or 5% to the US. And that was in 2023, before Donald Trump and JD Vance's hostile words and actions put foreign visitors off.  More bureaucratic botheration Meanwhile, the UK and the EU are making travel between them more bothersome for their citizens and businesses. This October, the EU's much-delayed EES or Entry Exit System is due to come into force. Every foreigner will be required to provide biometric information - including fingerprints and scans - every time they enter or leave the Schengen area. From October next year, visitors from countries including the UK will have to be authorised in advance by ETIAS, the European Travel and Authorisation System. Applications will cost seven euros and will be valid for three years. Since the beginning of this month, European visitors to the UK have been subject to similar reciprocal measures. They must apply for an ETA, an Electronic Travel Authorisation. This lasts for two years or until a passport expires and costs £16. The days of freedom of movement for people, goods, and services between the UK and its neighbours are long gone. The British economy has lost out and British citizens and businesses suffer from greater bureaucratic botheration. Nor has immigration into the UK gone down since leaving the EU. The numbers have actually gone up, with people from Commonwealth countries, including India, Pakistan and Nigeria, more than compensating for EU citizens who used to come and go. Will European reset pay off? The government is talking loudly about the possible benefits of a trade \"deal\" with Trump's America. Meanwhile, minister Nick Thomas Symonds and the civil servant Mike Ellam are engaged in low-profile negotiations with Europe - which could be of far greater economic and social significance. The public will have to wait to see what progress is being made at least until the first-ever EU-UK summit, due to take place on 19 May this year. Hard-pressed British food producers and travellers - not to mention young people shut out of educational opportunities in Europe - can only hope that Sir Keir Starmer considers their interests as positively as he does sucking up to the Trump administration."
    },
    {
        "title": "Farage accused of peddling 'nonsense and lies' - as he predicts 'the new Brexit'",
        "description": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\".",
        "url": "https://news.sky.com/story/farage-accused-of-peddling-nonsense-and-lies-as-he-predicts-the-new-brexit-13352236",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-cheshire_6888857.jpg?20250417105010",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-19 22:43:00",
        "Headline": "The Reform UK leader also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections.",
        "Content": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\". The energy secretary said both Mr Farage's party and the Conservatives were prepared to \"make up any old nonsense and lies to pursue their ideological agenda\" ahead of next month's local elections. The former Labour leader also warned if an anti-net zero agenda was followed, it would not only risk \"climate breakdown\" but also \"forfeit the clean energy jobs of the future\" in Britain. In an article for The Observer referring to price rises that began in 2022, he wrote: \"Our exposure to fossil fuels meant that, as those markets went into meltdown and prices rocketed, family, business and public finances were devastated. \"The cost of living impacts caused back then still stalk families today.\" 'Hopelessly out of touch' After the government's decision to take control of British Steel from its Chinese owners earlier this month, Mr Farage accused Mr Miliband, whom he has repeatedly called \"Red Ed\", of pursuing \"net-zero lunacy\". He said efforts to cut carbon emissions have made it harder to source the coal required to keep blast furnaces at the company's crisis-hit Scunthorpe plant running after supplies were shipped from abroad last week. In an interview with The Sun, Mr Farage said net zero could become \"the new Brexit\", \"where parliament is so hopelessly out of touch with the country\". The Reform leader wants the government to ditch its target of achieving net zero by 2050. Since she became Tory leader, Kemi Badenoch has also cast doubt on the government's commitment to achieving net zero by 2050 - a target made by her own party. But Sir Keir Starmer is expected to double down on the government's commitment to clean power at an International Energy Agency conference in London this week. Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones  'We need a British DOGE' In his interview with The Sun, Mr Farage also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections. Mr Musk's so-called Department of Government Efficiency (DOGE) has dismantled entire US federal agencies and cut tens of thousands of jobs. The Reform leader said he would \"send in the auditors\" to every council Reform wins, adding: \"The whole thing has to change. We need a British DOGE for every county and every local authority in this country.\" That's despite the National Audit Office warning councils are facing a major funding crisis, with social care in particular putting huge strain on their budgets. Votes for 1,641 council seats across 23 authorities in England will take place on 1 May."
    },
    {
        "title": "Free breakfast clubs set to open at hundreds of schools in England - but teachers voice fears over funding",
        "description": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost.",
        "url": "https://news.sky.com/story/free-breakfast-clubs-set-to-open-at-hundreds-of-schools-in-england-but-teachers-voice-fears-over-funding-13352035",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-breakfast-school_6891439.jpg?20250419213037",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-19 17:37:00",
        "Headline": "From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial ahead of an expected national rollout - but school leaders are warning the pilot may lead to budget shortfalls.",
        "Content": "Free breakfast clubs will launch at 750 schools across England next week, but teachers have warned government funding will fall short of the cost. From Tuesday, thousands of parents can access 30 minutes of free morning childcare as part of a trial beginning at the start of the new term and running to July, ahead of an expected national rollout. Ministers expect the scheme to save parents of primary-aged children £450 per year in childcare costs. School leaders, however, are warning the pilot may lead to budget shortfalls. \"The initial feedback we are hearing from many school leaders participating in the pilot is that the funding just isn't sufficient,\" said Paul Whiteman, general secretary of NAHT, the headteachers' union. \"At a time when school budgets are already stretched, most can ill-afford to subsidise this shortfall.\" Mr Whiteman added: \"It's absolutely crucial that this is addressed before the scheme is rolled out nationally. \"We have been encouraged to receive assurance from the Department for Education that funding will be looked at carefully when this trial is being assessed.\" Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones The trial is backed by £7m of government funding and more than £30m is promised for breakfast clubs in 2025-26. The government has previously insisted there will be enough funding to deliver the programme. The 750 \"early adopter\" schools are spread across the country and include mainstream schools and alternative provision schools, which educate children with specific needs.  Academies, free schools and local authority schools are all taking part. Education Secretary Bridget Phillipson said free breakfast clubs were \"at the heart\" of the Labour government's \"Plan for Change, making working parents' lives easier and more affordable, while breaking down barriers to opportunity for every child\". To see which schools are part of the trial in your area, you can visit the Department for Education's website here."
    },
    {
        "title": "'Return hubs' get UN backing in boost for potential plans to deport failed asylum seekers",
        "description": "\"Return hubs\" that would see Britain send failed asylum seekers to another country have been endorsed by the UN's refugee agency.",
        "url": "https://news.sky.com/story/return-hubs-get-un-backing-in-boost-for-potential-plans-to-deport-failed-asylum-seekers-13351488",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-migration-dover-uk_6889111.jpg?20250419175018",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-19 03:47:00",
        "Headline": "Sir Keir Starmer has taken an interest in potentially emulating the Italian approach to tackling illegal migration, whereby those with no right to remain are deported to detention centres overseas.",
        "Content": " \"Return hubs\" that would see Britain send failed asylum seekers to another country have been endorsed by the UN's refugee agency. Home Secretary Yvette Cooper met the UN's high commissioner for refugees Fillipo Grandi last month to discuss the idea. It had been reported that the government is looking into the prospect of paying countries like the Balkans to take in failed asylum seekers - which ministers hope might discourage people from crossing the Channel in small boats. The Home Office confirmed Ms Cooper met with Mr Grandi to discuss the \"principle of returns hubs\" but said reports about \"payments and specific locations are not right\". A total of 9,099 migrants have made the journey across the Channel so far this year, including more than 700 on Tuesday this week - the highest number on a single day in 2025. Out of 253 migrants that made the crossing on Friday, one died.  The UN's refugee agency has set out how such hubs could work while meeting its legal standards in a document published earlier this week. It recommended monitoring the hubs to make sure human rights standards are \"reliably met\". The country hosting the return hub would need to grant temporary legal status for migrants, and the country sending the failed asylum seekers would need to support it to make sure there are \"adequate accommodation and reception arrangements\". A UK government source said the document was a helpful intervention that could make the legal pathway to some form of return hub model smoother. Read more from Sky News:How Japan could shape future of NHSCan the Lib Dems secure election success? It comes after the EU Commission proposed allowing EU members to set up so-called \"return hubs\" abroad, with member state Italy having already started sending illegal migrants abroad. It sends people with no right to remain to Italian-run detention centres in Albania, something Sir Keir has taken an interest in since coming to power. With Reform UK leading Labour in several opinion polls this year, the prime minister has been talking tough on immigration - but the figures around Channel crossings have made for difficult reading."
    },
    {
        "title": "Labour's plan for failed asylum seekers shows they're willing to adopt previously unpalatable policies",
        "description": "The Conservatives leapt on Labour's idea for third country migrant \"returns hubs\" as evidence that cancelling their controversial Rwanda plan was a mistake.",
        "url": "https://news.sky.com/story/labours-plan-for-failed-asylum-seekers-shows-theyre-willing-to-adopt-previously-unpalatable-policies-13351543",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-migrant-small-boats_6890534.jpg?20250419130337",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-04-19 10:48:00",
        "Headline": "The government is hoping the UN's intervention will provide a degree of legal and political cover to pursue the policy. But the details are still incredibly sketchy.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  The Conservatives leapt on Labour's idea for third country migrant \"returns hubs\" as evidence that cancelling their controversial Rwanda plan was a mistake. In fundamental terms, the Rwanda plan was very different, not least because it was implacably opposed by the United Nations Human Rights Council (UNHRC), which is now - in principle at least - backing this concept. The Tories were intending to deport everyone who arrived in the UK illegally to the central African country, regardless of whether they had a legitimate asylum claim. Labour's plan is about dealing with people who have no such claims - who have exhausted every avenue for appeal, and therefore, in the words of the UNHCR, are \"not in need of international protection\". This important distinction is unlikely to prevent real queasiness among those in Labour who see the idea as far too reminiscent of the Conservative approach. Read more:Boost for potential plans to deport failed asylum seekersMigrant dies trying to cross Channel in small boat  The government is hoping the UNHRC's intervention will provide a degree of legal and political cover to pursue the policy. But the details are still incredibly sketchy. A Home Office Source tells me \"there are some people it's very difficult to return at the moment, e.g. those from Afghanistan. \"So the idea would be a period of leave in another country which can be terminated if things change in their country of origin, but also recognises they have failed to successfully claim asylum in the UK.\" It's unclear how long that \"period of leave\" would be. Would migrants stay there indefinitely, if the situation doesn't change in their countries of origin? And if not - would deals be struck for permanent resettlement elsewhere? It's politically, diplomatically, morally and legally complex territory. Sir Keir Starmer previously talked about working closely with Italy to look at ways of processing migrants in a third country, after the Italians struck a deal with Albania and have begun sending rejected asylum seekers there (after months of legal wrangling). Would the Albanians have the appetite for more of these deals? Which other countries would be prepared to step in? How much would we be prepared to pay? It's clearly far from a fully developed policy. But the willingness of government sources to talk it up points to their political need to talk tough on migration - and sound like they do really have a plan to deal with the issue. The prime minister promised to \"smash the gangs\" and get a grip on the problem of illegal migration - and the asylum backlog. But with record numbers of people making that dangerous journey across the Channel in small boats - and under growing pressure on the right from Reform - his government is clearly prepared to countenance policies which would previously have been deeply unpalatable."
    },
    {
        "title": "PM and Trump step up trade talks - as chancellor warns it's 'foolish' not to engage with China",
        "description": "It would be \"foolish\" to stop engaging with China, the chancellor has said, as Sir Keir Starmer held his first call with Donald Trump since he put 10% tariffs on goods imported from the UK.",
        "url": "https://news.sky.com/story/pm-and-trump-step-up-trade-talks-as-chancellor-warns-its-foolish-not-to-engage-with-china-13351482",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841895.png?20250228063409",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-19 00:42:00",
        "Headline": "Rachel Reeves will hold talks with the US next week amid efforts to establish a trade deal, but also wants to maintain good economic ties with Beijing.",
        "Content": "It would be \"foolish\" to stop engaging with China, the chancellor has said, as Sir Keir Starmer held his first call with Donald Trump since he put 10% tariffs on goods imported from the UK. Rachel Reeves will hold talks with the US next week amid efforts to establish a trade deal, which the government hopes will take the sting out of the president's tariffs. There has been speculation Washington may press the government to limit its dealings with China as part of that deal, having launched a tit-for-tat trade war with its economic rival. But Ms Reeves told The Daily Telegraph:\"China is the second-biggest economy in the world, and it would be, I think, very foolish, to not engage. \"That's the approach of this government.\" She suggested she would back the fast fashion firm Shein launching an initial public offering (IPO) in the UK, saying the London Stock Exchange and Financial Conduct Authority have \"very strict standards\" and \"we do want to welcome new listings\". Shein, which was founded in China but is now based in Singapore, has faced several obstacles to its efforts to float, including UK political pressure over alleged supply chain and labour abuses. Read more from Sky News:Trump says he might give up on Ukraine peace talksPub hours extended for 80th VE Day celebrationsHow Japan could shape the future of the NHS 'Productive discussions' When it comes to a UK-US deal, The Daily Telegraph has reported officials in Washington believe an agreement could be weeks away. But on Thursday, Mr Trump said he was in \"no rush\" to reach any deals because of the revenues his new tariffs are generating. During Sir Keir's call with the US president on Friday, the two leaders talked about the \"ongoing and productive discussions\" on trade between the two nations, according to a Downing Street spokesperson. \"The prime minister reiterated his commitment to free and open trade and the importance of protecting the national interest,\" Number 10 said. As well as the 10% levy on all goods imported to America from the UK, Mr Trump enacted a 25% levy on car imports."
    },
    {
        "title": "How Japan could shape the future of the NHS",
        "description": "The health secretary is taking inspiration from Japan in his bid to change how Britons are treated by the NHS. ",
        "url": "https://news.sky.com/story/how-japan-could-shape-the-future-of-the-nhs-13351481",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nhs-hospital-ward-file-pic_6858639.jpg?20250316150711",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-19 00:38:00",
        "Headline": "To help deal with its ageing population, Japan offers super bespoke health programmes for individual citizens, which aim to do a better job at predicting and preventing illnesses and make emergency care less necessary.",
        "Content": "The health secretary is taking inspiration from Japan in his bid to change how Britons are treated by the NHS.  Wes Streeting has said he's interested in the idea of \"health MOTs\" for Britain's older citizens, evoking how the Asian island nation relies on personalised medical plans for its ageing population. Japan combines genomics and AI machine learning to offer hyper-bespoke programmes for individuals, helping to predict and prevent illnesses before they really take hold. Mr Streeting said such an approach could be a \"game-changer\" in the UK, as he prepares to publish his 10-year plan for the health service later in 2025. He has repeatedly spoken about his desire to move more of the NHS's work out of hospitals and into local communities, focusing more on preventative care than more expensive and invasive emergency treatment. Last year, NHS England - which is due to be scrapped - announced patients over 65 or those with frailty-related conditions would be given health MOTs outside emergency departments to avoid unnecessary admissions. The tests checked for blood pressure, heart health and mobility. Read more from Sky News:Why families face agonising funeral delays'Andrew Tate phenomena' sweeping schools  'A lot of opportunity' Speaking to The Telegraph, the minister said Japan was an \"interesting\" case study to follow because it's got a \"very significant ageing society\". Japan's population has been shrinking and growing older for decades as young people delay marriage and having children largely due to unstable jobs and economic difficulties. A 2023 survey found more than 1 in 10 people in Japan were aged 80 or older for the first time. Mr Streeting has reportedly been briefed by an ex-Japanese health official about the country's health programmes. He told The Telegraph while the NHS faced \"enormous challenges\", he believed advances in technology - notably around artificial intelligence - offered \"a lot of opportunity and hope\". He said he hoped personalised programmes like Japan's could eventually be offered to everyone in the UK."
    },
    {
        "title": "Farage accused of peddling 'nonsense and lies' - as he predicts 'the new Brexit'",
        "description": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\".",
        "url": "https://news.sky.com/story/farage-accused-of-peddling-nonsense-and-lies-as-he-predicts-the-new-brexit-13352236",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-cheshire_6888857.jpg?20250417105010",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-19 22:43:00",
        "Headline": "The Reform UK leader also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections.",
        "Content": "Ed Miliband has accused Nigel Farage of peddling \"nonsense and lies\" about the government's commitment to net zero, as the Reform UK leader said the issue could become the \"new Brexit\". The energy secretary said both Mr Farage's party and the Conservatives were prepared to \"make up any old nonsense and lies to pursue their ideological agenda\" ahead of next month's local elections. The former Labour leader also warned if an anti-net zero agenda was followed, it would not only risk \"climate breakdown\" but also \"forfeit the clean energy jobs of the future\" in Britain. In an article for The Observer referring to price rises that began in 2022, he wrote: \"Our exposure to fossil fuels meant that, as those markets went into meltdown and prices rocketed, family, business and public finances were devastated. \"The cost of living impacts caused back then still stalk families today.\" 'Hopelessly out of touch' After the government's decision to take control of British Steel from its Chinese owners earlier this month, Mr Farage accused Mr Miliband, whom he has repeatedly called \"Red Ed\", of pursuing \"net-zero lunacy\". He said efforts to cut carbon emissions have made it harder to source the coal required to keep blast furnaces at the company's crisis-hit Scunthorpe plant running after supplies were shipped from abroad last week. In an interview with The Sun, Mr Farage said net zero could become \"the new Brexit\", \"where parliament is so hopelessly out of touch with the country\". The Reform leader wants the government to ditch its target of achieving net zero by 2050. Since she became Tory leader, Kemi Badenoch has also cast doubt on the government's commitment to achieving net zero by 2050 - a target made by her own party. But Sir Keir Starmer is expected to double down on the government's commitment to clean power at an International Energy Agency conference in London this week. Read more from Sky News:Upskirted teacher on misogynistic attitudes in classroomWhy families are facing agonising waits to bury their loved ones  'We need a British DOGE' In his interview with The Sun, Mr Farage also vowed to be Britain's equivalent of Elon Musk by cutting excess council spending if his party claims victory in next month's local elections. Mr Musk's so-called Department of Government Efficiency (DOGE) has dismantled entire US federal agencies and cut tens of thousands of jobs. The Reform leader said he would \"send in the auditors\" to every council Reform wins, adding: \"The whole thing has to change. We need a British DOGE for every county and every local authority in this country.\" That's despite the National Audit Office warning councils are facing a major funding crisis, with social care in particular putting huge strain on their budgets. Votes for 1,641 council seats across 23 authorities in England will take place on 1 May."
    },
    {
        "title": "How Japan could shape the future of the NHS",
        "description": "The health secretary is taking inspiration from Japan in his bid to change how Britons are treated by the NHS. ",
        "url": "https://news.sky.com/story/how-japan-could-shape-the-future-of-the-nhs-13351481",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nhs-hospital-ward-file-pic_6858639.jpg?20250316150711",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-19 00:38:00",
        "Headline": "To help deal with its ageing population, Japan offers super bespoke health programmes for individual citizens, which aim to do a better job at predicting and preventing illnesses and make emergency care less necessary.",
        "Content": "The health secretary is taking inspiration from Japan in his bid to change how Britons are treated by the NHS.  Wes Streeting has said he's interested in the idea of \"health MOTs\" for Britain's older citizens, evoking how the Asian island nation relies on personalised medical plans for its ageing population. Japan combines genomics and AI machine learning to offer hyper-bespoke programmes for individuals, helping to predict and prevent illnesses before they really take hold. Mr Streeting said such an approach could be a \"game-changer\" in the UK, as he prepares to publish his 10-year plan for the health service later in 2025. He has repeatedly spoken about his desire to move more of the NHS's work out of hospitals and into local communities, focusing more on preventative care than more expensive and invasive emergency treatment. Last year, NHS England - which is due to be scrapped - announced patients over 65 or those with frailty-related conditions would be given health MOTs outside emergency departments to avoid unnecessary admissions. The tests checked for blood pressure, heart health and mobility. Read more from Sky News:Why families face agonising funeral delays'Andrew Tate phenomena' sweeping schools  'A lot of opportunity' Speaking to The Telegraph, the minister said Japan was an \"interesting\" case study to follow because it's got a \"very significant ageing society\". Japan's population has been shrinking and growing older for decades as young people delay marriage and having children largely due to unstable jobs and economic difficulties. A 2023 survey found more than 1 in 10 people in Japan were aged 80 or older for the first time. Mr Streeting has reportedly been briefed by an ex-Japanese health official about the country's health programmes. He told The Telegraph while the NHS faced \"enormous challenges\", he believed advances in technology - notably around artificial intelligence - offered \"a lot of opportunity and hope\". He said he hoped personalised programmes like Japan's could eventually be offered to everyone in the UK."
    },
    {
        "title": "China hosts world's first half-marathon race between humans and robots",
        "description": "Robots have raced against humans in a half-marathon for the first time.",
        "url": "https://news.sky.com/story/china-hosts-worlds-first-half-marathon-race-between-humans-and-robots-13351485",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-robots-china_6890426.jpg?20250419044914",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-19 03:24:00",
        "Headline": "Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing on Saturday.",
        "Content": " Robots have raced against humans in a half-marathon for the first time. Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing, China, on Saturday. Some of the robots that took part were as short as 3ft 9in, while others were as tall as 5ft 9in. They had to resemble humans and be able to walk or run - wheels were not allowed. The winning robot was Tiangong Ultra, which crossed the finishing line with a time of two hours and 40 minutes, while the men's winner of the race had a time of one hour and two minutes. Tang Jian, chief technology officer for the creator of the robot, the Beijing Innovation Centre of Human Robotics, said its performance was aided by long legs and an algorithm allowing it to imitate how humans run a marathon. \"I don't want to boast, but I think no other robotics firms in the West have matched Tiangong's sporting achievements,\" he said. He added that the robot's battery was changed just three times during the race. One robot fell at the starting line and lay on the ground for a few minutes before getting up and joining the race, while another crashed into a railing, causing its human operator to fall over. Read more:How Japan could shape the future of the NHSPlanet K2-18b may be teeming with microbial lifeScientists create lab-grown chunks of chicken The robots were accompanied by human trainers, with some physically supporting the machines during the race. Several of the robots wore running shoes, with one donning boxing gloves and another wearing a red headband saying \"Bound to Win\" in Chinese. China has dozens of robot companies and while some produce humanoid robots, others create robotic dogs. Last year China's People's Liberation Army was shown using robodogs firing weapons from their backs during training exercises."
    },
    {
        "title": "Clodagh Rodgers: Eurovision star and face of Bisto gravy dies",
        "description": "Clodagh Rodgers, a singer best known for representing the UK at the 16th Eurovision Song Contest, has died aged 78.",
        "url": "https://news.sky.com/story/clodagh-rodgers-eurovision-star-and-face-of-bisto-gravy-dies-13351655",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-clodagh-rodgers-joe_6890632.jpg?20250419143250",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-04-19 13:19:00",
        "Headline": "Singer Clodagh Rodgers shot to fame after representing the UK in Eurovision with Jack In The Box, and became a familiar face on TV throughout the 1970s and 1980s.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Clodagh Rodgers, a singer best known for representing the UK at the 16th Eurovision Song Contest, has died aged 78. The Northern Irish singer was described as \"the rock of this family\" by her son Sam, who said she died on Friday 18 April. Sam Sorbie wrote: \"With a heavy heart, my dear beautiful mum Clodagh has sadly passed away after battling an illness for the last three years. She passed away peacefully yesterday, surrounded by her family in Cobham. \"Mum has lived an incredible life, full of love and happiness. Her fantastic career performing, travelling the world, devoting her life to her two sons and being the rock of this family. \"Life will not be the same without Mum, but she will finally be at peace now with dad, nanny and pappa. We all love and miss her terribly.\" A regular face on the TV in the 1970s and 1980s, Rodgers performed Jack In The Box at the 1971 Eurovision Song Contest in Dublin, finishing in fourth place behind Germany, Spain and the winners, Monaco. Jack In The Box went on to reach number four in the UK singles chart, and although she entered the charts later that year with Lady Love Bug, the Eurovision track remained her biggest hit. Rodgers began singing as a youngster and got her first record deal aged just 15. She went on to appear on primetime shows including The Morecombe And Wise Show, The Two Ronnies, Top Of The Pops, Bruce Forsyth & The Generation Game and The Val Doonican Show. She was chosen as the face of Bisto gravy in the 70s, following her Eurovision hit. Read more from Sky News:Robots race half-marathon against humans for first timeJD Vance meets with the Pope A talented live performer, she also starred in her own West End show Talk Of The Town, and West End musical hit Blood Brothers, as well as numerous variety shows and the pantomime Cinderella, co-starring comedian Ronnie Corbett. Rodgers released six albums, five compilation records and numerous singles across her six-decade career. She insured her voice for £1m. In 2001 she appeared as a recurring character in police drama The Bill. Married twice, Rodgers leaves behind her two sons, Sam and Matt."
    },
    {
        "title": "China hosts world's first half-marathon race between humans and robots",
        "description": "Robots have raced against humans in a half-marathon for the first time.",
        "url": "https://news.sky.com/story/china-hosts-worlds-first-half-marathon-race-between-humans-and-robots-13351485",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-robots-china_6890426.jpg?20250419044914",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-04-19 03:24:00",
        "Headline": "Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing on Saturday.",
        "Content": " Robots have raced against humans in a half-marathon for the first time. Some 21 humanoid robots raced alongside thousands of runners around the 21km (13-mile) course in Beijing, China, on Saturday. Some of the robots that took part were as short as 3ft 9in, while others were as tall as 5ft 9in. They had to resemble humans and be able to walk or run - wheels were not allowed. The winning robot was Tiangong Ultra, which crossed the finishing line with a time of two hours and 40 minutes, while the men's winner of the race had a time of one hour and two minutes. Tang Jian, chief technology officer for the creator of the robot, the Beijing Innovation Centre of Human Robotics, said its performance was aided by long legs and an algorithm allowing it to imitate how humans run a marathon. \"I don't want to boast, but I think no other robotics firms in the West have matched Tiangong's sporting achievements,\" he said. He added that the robot's battery was changed just three times during the race. One robot fell at the starting line and lay on the ground for a few minutes before getting up and joining the race, while another crashed into a railing, causing its human operator to fall over. Read more:How Japan could shape the future of the NHSPlanet K2-18b may be teeming with microbial lifeScientists create lab-grown chunks of chicken The robots were accompanied by human trainers, with some physically supporting the machines during the race. Several of the robots wore running shoes, with one donning boxing gloves and another wearing a red headband saying \"Bound to Win\" in Chinese. China has dozens of robot companies and while some produce humanoid robots, others create robotic dogs. Last year China's People's Liberation Army was shown using robodogs firing weapons from their backs during training exercises."
    }
]