[
    {
        "title": "Zhenhao Zou: More than 20 new potential victims come forward after 'prolific' rapist jailed for assaulting 10 women",
        "description": "Another 23 female potential victims have reported that they may have been raped by Zhenhao Zou - the Chinese PhD student detectives believe may be one of the country's most prolific sex offenders.",
        "url": "https://news.sky.com/story/zhenhao-zou-more-than-20-new-potential-victims-come-forward-after-prolific-rapist-jailed-for-assaulting-10-women-13339807",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zhenhao-zou-met-police_6841208.png?20250303213211",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-01 13:16:00",
        "Headline": "Chinese PhD student Zhenhao Zou, 28, was convicted of drugging and raping 10 women following a trial at the Inner London Crown Court last month.",
        "Content": "Another 23 female potential victims have reported that they may have been raped by Zhenhao Zou - the Chinese PhD student detectives believe may be one of the country's most prolific sex offenders. The Metropolitan Police launched an international appeal after Zou, 28, was convicted of drugging and raping 10 women following a trial at the Inner London Crown Court last month. Detectives have not confirmed whether the 23 people who have come forward add to their estimates that more than 50 other women worldwide may have been targeted by the University College London student. Metropolitan Police commander Kevin Southworth said: \"We have victims reaching out to us from different parts of the globe. \"At the moment, the primary places where we believe offending may have occurred at this time appears to be both in England, here in London, and over in China.\" Zou lived in a student flat in Woburn Place, near Russell Square in central London, and later in a flat in the Uncle building in Churchyard Row in Elephant and Castle, south London. Read more: How a student described as 'smart and charming' was unmasked as a prolific sexual predator \n                  China calls Taiwan president 'parasite' and launches large-scale military drills around island\n                 \n                  Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US\n                 \n                  Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears\n                 He had also been a student at Queen's University Belfast, where he studied mechanical engineering from 2017 until 2019. Police say they have not had any reports from Belfast but added they were \"open-minded about that\". \"Given how active and prolific Zou appears to have been with his awful offending, there is every prospect that he could have offended anywhere in the world,\" Mr Southworth said. \"We wouldn't want anyone to write off the fact they may have been a victim of his behaviour simply by virtue of the fact that you are from a certain place. \"The bottom line is, if you think you may have been affected by Zhenhao Zou or someone you know may have been, please don't hold back. Please make contact with us.\" Zou used hidden or handheld cameras to record his attacks, and kept the footage and often the women's belongings as souvenirs. He targeted young, Chinese women, inviting them to his flat for drinks or to study, before drugging and assaulting them. Zou was convicted of 11 counts of rape, with two of the offences relating to one victim, as well as three counts of voyeurism, 10 counts of possession of an extreme pornographic image, one count of false imprisonment and three counts of possession of a controlled drug with intent to commit a sexual offence, namely butanediol.  Mr Southworth said: \"Of those 10 victims, several were not identified so as we could be sure exactly where in the world they were, but their cases, nevertheless, were sufficient to see convictions at court. \"There were also, at the time, 50 videos that were identified of further potential female victims of Zhenhao Zou's awful crimes. \"We are still working to identify all of those women in those videos. \"We have now, thankfully, had 23 victim survivors come forward through the appeal that we've conducted, some of whom may be identical with some of the females that we saw in those videos, some of whom may even turn out to be from the original indicted cases.\" Mr Southworth added: \"Ultimately, now it's the investigation team's job to professionally pick our way through those individual pieces of evidence, those individual victims' stories, to see if we can identify who may have been a victim, when and where, so then we can bring Zou to justice for the full extent of his crimes.\" Mr Southworth said more resources will be put into the investigation, and that detectives are looking to understand \"what may have happened without wishing to revisit the trauma, but in a way that enables [the potential victims] to give evidence in the best possible way.\" The Metropolitan Police is appealing to anyone who thinks they may have been targeted by Zou to contact the force either by emailing survivors@met.police.uk, or via the major incident public portal on the force's website."
    },
    {
        "title": "Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife",
        "description": "Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.&#160;",
        "url": "https://news.sky.com/story/planning-reforms-to-rewire-the-system-and-get-britain-building-all-while-protecting-wildlife-13340010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-cave-tunnel-hs2_6825202.jpg?20250211053130",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-04-01 19:29:00",
        "Headline": "A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.  A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place, while rejecting a \"bonfire of regulations\". But Mr Corry suggested there might be circumstances in which the government look at changing the wildlife and habit rules inherited from the EU, which protect individual species. Politics latest: Follow live updates These lie at the centre of the controversy of a £120m bat tunnel - the shed in Aylesbury which protects a rare breed from future high speed trains. Keir Starmer has declared war on £100m HS2 bat shed - but has he got a solution?New planning bill could be the government's most important - but will it work in practice? The government has now explicitly ruled out any such change in this parliament. \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 \n                  Payouts for departing civil servants capped at £95,000 under voluntary exit scheme\n                 \n                  Politics latest: Trump's tariffs 'a nightmare' for the UK - but Starmer could benefit from carve outs\n                 Campaigners have questioned whether the changes go far enough and will make a major difference to the rate and scale of building in the UK. Speaking to Sky News, Environment Secretary Steve Reed insisted that accepting nine of the recommendations from the Corry review would amount to wholesale reform. The minister said: \"We can get a win-win for economic growth and for nature. And that is why we are moving ahead with proposals such as appointing a lead regulator for major developments so that the developers don't have to navigate the architecture of multiple regulators. \"They just work for a single regulator who manages all the others on their behalf. Simplifying the online planning portal. \"These are huge changes that will save developers billions of pounds and speed up decisions doing damage to the environment.\" Mr Reed insisted that there would be \"no more bat tunnels\" built, even though the Corry review suggests that more work needs to be done to look again at the relevant guidance. It says: \"Rapidly reviewing the existing catalogue of compliance guidance, including on protecting bats, will identify opportunities to remove duplication, ambiguity or inconsistency. \"Natural England has already agreed to review and update their advice to Local Planning Authorities on bats to ensure there is clear, proportionate and accessible advice available.\" The review will mean: • Appointing one lead regulator for every major infrastructure project, like Heathrow expansion • A review on how nature rules are implemented - but not the rules themselves • Insisting regulators focus more on government priorities, particularly growth Economist and former charity leader Mr Corry, who led the review, said it shows that \"simply scrapping regulations isn't the answer\". \"Instead we need modern, streamlined regulation that is easier for everyone to use. While short-term trade-offs may be needed, these reforms will ultimately deliver a win-win for both nature and economic growth in the longer run.\" However, Sam Richards from Britain Remade, a thinktank trying to get Britain growing, said that while the steps are welcome, the number of regulators that report to the environment department would remain the same before and after the review. He questioned whether this would have the impact ministers claimed."
    },
    {
        "title": "Father demands protection after Gaza aid workers' deaths",
        "description": "The father of a paramedic killed by Israel in Gaza has told Sky News he would have been on the mission to rescue wounded colleagues, but was ill that day and so his son went instead.",
        "url": "https://news.sky.com/story/father-demands-protection-after-gaza-aid-workers-deaths-13339940",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-khan-younis-funeral_6873176.jpg?20250401192055",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-04-01 17:20:00",
        "Headline": "The bodies of Red Crescent and UN workers, missing for around eight days, have been found buried under sand in a mass grave. The Israel Defence Forces (IDF) has denied killing innocent medical workers.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  The father of a paramedic killed by Israel in Gaza has told Sky News he would have been on the mission to rescue wounded colleagues, but was ill that day and so his son went instead. \"It was supposed to be me, you know. I was on duty that night but fell ill and sent him in my place.\" Speaking at his son's funeral, Hassan Abu Hileh said Israel is to blame for the death of Mohammed and the other 14 men. \"We need protection from the international community. We need protection for medical teams. We are medics-soldiers of duty, not armed fighters. We carry out humanitarian work. If I see someone who needs medical attention, I'm obligated to serve them,\" he said. The bodies of the Red Crescent and United Nations workers went missing around eight days ago. Despite repeated requests to search for them, all denied by the Israel Defence Forces (IDF), the UN eventually found 14 bodies buried under sand in a mass grave. One is still missing. They were still wearing their uniforms. The director of the Palestinian Red Crescent in Gaza has accused Israel of murdering the emergency workers. \"We arrived at the scene of the crime to retrieve the bodies and found that all of them had been shot directly in the upper part of their bodies and buried,\" said Dr Bashir Murad. \n                  Gaza's orphans have lost everything - even the dream of growing up\n                 \n                  Anti-Hamas chants heard at rare protest in Gaza\n                 \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \"The ambulances were also destroyed and buried.\" The bodies were found in sand in the south of the Gaza Strip in what Jonathan Whittall, Gaza head of the UN Office for the Coordination of Humanitarian Affairs, called a \"mass grave\", marked with the emergency light from a crushed ambulance. Mr Whittall posted pictures and video of Red Crescent teams digging in the sand for the bodies and workers laying them out on the ground, covered in plastic sheets.  The Israel Defence Forces (IDF) has denied killing innocent medical workers and said Israeli forces opened fire on suspicious vehicles that were travelling without coordination and in an active combat zone. \"The IDF did not randomly attack an ambulance on March 23,\" claimed a spokesman. \"⁠Last Sunday, several uncoordinated vehicles were identified advancing suspiciously toward IDF troops without headlights or emergency signals. IDF troops then opened fire at the suspected vehicles. \"Earlier that day, cars that did not belong to terrorists were coordinated and passed safely on the same route.\" Read more from Sky News:What happened to the ceasefire?Anti-Hamas chants at Gaza protest We have asked the IDF why the bodies were found in a mass grave but have received no comment. More than 400 aid workers have been killed in Gaza since the start of the Israel-Hamas war, according to the UN. According to the UN, at least 1,060 healthcare workers have been killed in the 18 months since Israel launched its offensive in Gaza after Hamas fighters stormed southern Israel on 7 October 2023. The UN is reducing its international staff in Gaza by a third because of safety concerns."
    },
    {
        "title": "Girl, 11, who went missing after entering River Thames named",
        "description": "An 11-year-old girl who went missing after entering the River Thames has been named as Kaliyah Coa.",
        "url": "https://news.sky.com/story/girl-11-who-went-missing-after-entering-river-thames-named-13340026",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-river-thames-barge-house-causeway_6873285.jpg?20250401211817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-01 19:37:00",
        "Headline": "Police say drones and boats have been deployed to carry out a large-scale search over a wide area. Officers now say their operation has switched to a recovery mission.",
        "Content": "An 11-year-old girl who went missing after entering the River Thames has been named as Kaliyah Coa. An \"extensive search\" has been carried out after the incident in east London at around 1.30pm on Monday. Police said the child had been playing during a school inset day and entered the water near Barge House Causeway, North Woolwich. A recovery mission is now said to be under way to find Kaliyah along the Thames, with the Metropolitan Police carrying out an extensive examination of the area. Chief Superintendent Dan Card thanked members of the public and emergency teams who responded to \"carry out a large-scale search during a highly pressurised and distressing time\". He also confirmed drone technology and boats were being used to \"conduct a thorough search over a wide area\". He added: \"Our specialist officers are supporting Kaliyah's family through this deeply upsetting time and our thoughts go out to all those impacted by what has happened.\" \n                  Zhenhao Zou: More than 20 new potential victims come forward after 'prolific' rapist jailed for assaulting 10 women\n                 \n                  Royal Navy warship takes out air and sea drones in 'realistic' exercise\n                 \n                  Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife\n                 \"Equally we appreciate this has affected the wider community who have been extremely supportive. You will see extra officers in the area during the coming days.\" Read more from Sky News:What is Trump's liberation day about?Woman rescued 91 hours after quake'Exceptional' codebreaker dies at 101 On Monday, Kerry Benadjaoud, a 62-year-old resident from the area, said she heard of the incident from her next-door neighbour, who \"was outside doing her garden and there was two little kids running, and they said 'my friend's in the water'\". When she arrived at the scene with a life ring, a man told her he had called the police, \"but he said at the time he could see her hands going down\". Barge House Causeway is a concrete slope that goes directly into the River Thames and is used to transport boats. Residents pointed out that it appeared to be covered in moss and was slippery."
    },
    {
        "title": "Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours",
        "description": "A senior Democrat has broken records with a marathon speech on the Senate floor against US President Donald Trump.",
        "url": "https://news.sky.com/story/democrat-cory-booker-rails-against-trump-and-musk-in-record-breaking-senate-speech-lasting-more-than-24-hours-13339860",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cory-booker-senate_6873105.jpg?20250401164504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-01 14:53:00",
        "Headline": "Cory Booker, a New Jersey senator, said last night he intends to disrupt the \"normal business of the United States Senate for as long as I am physically able\".",
        "Content": "A senior Democrat has broken records with a marathon speech on the Senate floor against US President Donald Trump. Cory Booker, a New Jersey senator, began speaking around 7pm on Monday (just after midnight on Tuesday in the UK) and said he intended to disrupt the \"normal business of the United States Senate for as long as I am physically able\". Referring to Mr Trump's presidency, he said: \"I rise tonight because I believe sincerely that our country is in crisis.\" The 55-year-old senator has been speaking for more than 24 hours and 18 minutes - beating the record for the longest speech in Senate history. He remained standing for the entire duration, as he would lose control of the floor if he left his desk or sat down. Read more: Who is the Democrat making a marathon speech against Trump? Other Democrat senators have joined Mr Booker to ask questions so he can rest his voice, including Senate minority leader Chuck Schumer. At the start of his speech, Mr Booker said: \"These are not normal times in our nation. And they should not be treated as such in the United States Senate. \"The threats to the American people and American democracy are grave and urgent, and we all must do more to stand against them.\" Overnight, he referenced Strom Thurmond of South Carolina, the previous record-holder who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957. Read more:'Liberation day' is coming - one number to keep in mindProsecutors directed to seek death penalty for Luigi Mangione 👉 Follow Trump 100 on your podcast app 👈 \"You think we got civil rights one day because Strom Thurmond - after filibustering for 24 hours - you think we got civil rights because he came to the floor one day and said 'I've seen the light',\" he said. \"No, we got civil rights because people marched for it, sweat for it and [civil rights leader] John Lewis bled for it.\" The democrat pushed past the mark set by Republican Senator Ted Cruz - who spoke for 21 hours and 19 minutes against the Affordable Care Act in 2013 - earlier in the day."
    },
    {
        "title": "Luigi Mangione: US prosecutors directed to seek death penalty for man accused of killing healthcare boss",
        "description": "Prosecutors are being urged to seek the death penalty for Luigi Mangione, the man accused of fatally shooting the chief executive of a major healthcare company last year.",
        "url": "https://news.sky.com/story/luigi-mangione-us-prosecutors-directed-to-seek-death-penalty-for-man-accused-of-killing-healthcare-boss-13339868",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-luigi-mangione-thompson_6784180.jpg?20241223163644",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-01 15:18:00",
        "Headline": "US attorney general Pam Bondi says her intervention is part of President Trump's \"agenda to stop violent crime and Make America Safe Again\".",
        "Content": "Prosecutors are being urged to seek the death penalty for Luigi Mangione, the man accused of fatally shooting the chief executive of a major healthcare company last year. In February, Mangione pleaded not guilty to multiple counts of murder following the killing of 50-year-old Brian Thompson outside a midtown Manhattan hotel in New York in December. Mr Thompson was the CEO of UnitedHealthcare. Now, US attorney general Pam Bondi has issued a statement saying she has \"directed federal prosecutors to seek the death penalty in this case\".  She added that the murder of Mr Thompson, an \"innocent man and father of two young children\", was a \"premeditated, cold-blooded assassination that shocked America\". Ms Bondi said her intervention was part of President Donald Trump's \"agenda to stop violent crime and Make America Safe Again\". She said that because the shooting happened in a public place with \"bystanders nearby\", there could have been a \"grave risk of death to additional persons\". \n                  Villain or hero? Everyone has thoughts on alleged healthcare CEO assassin Luigi Mangione - and it's not all negative\n                 \n                  Luigi Mangione: Suspect in US healthcare boss killing 'posted about back condition on Reddit for several years'\n                 \n                  Luigi Mangione: Police say fingerprints of US gunman suspect match those found near New York crime scene\n                 The US Department of Justice said Ms Bondi's actions were in line with her \"day one memo as attorney general\" entitled \"Reviving The Federal Death Penalty And Lifting The Moratorium On Federal Executions\". Mangione, 26, is accused of ambushing and shooting Mr Thompson as he walked to an investor conference. He pleaded not guilty to New York state charges of murder and murder as an act of terrorism just before Christmas last year. The death penalty is not used in New York, meaning Mangione faces life in prison without parole if convicted in those cases. However, Mangione also faces a parallel indictment from the Manhattan federal court for Mr Thompson's killing. He has not been asked to enter a plea in that case but could face the death penalty if convicted. He also faces charges of forgery, carrying firearms without a licence, and other counts in Pennsylvania, where authorities arrested him at a McDonald's. Read more:Everyone has thoughts on Luigi - and it's not all negativeDozens turn out in support of Luigi over killing of healthcare boss 'Decision to execute is political' Karen Friedman Agnifilo, Mangione's lawyer, said the district attorney's direction to the prosecution means the justice department \"has moved from the dysfunctional to the barbaric\". She added: \"Their decision to execute Luigi is political and goes against the recommendation of the local federal prosecutors, the law, and historical precedent. \"While claiming to protect against murder, the federal government moves to commit the pre-meditated, state-sponsored murder of Luigi. By doing this, they are defending the broken, immoral, and murderous healthcare industry that continues to terrorise the American people.\" She said Mangione's lawyers are prepared to \"fight these federal charges, brought by a lawless justice department\" alongside the charges in New York State and Pennsylvania - \"and anything else they want to pile on Luigi\". Police said that upon his arrest, Mangione was in possession of a gun, bullets, multiple fake IDs and a handwritten document expressing \"ill will\" towards corporate America. The killing prompted some to voice their resentment at US health insurers, with Mangione attracting a cult following. A poll taken in the wake of the shooting showed most Americans believe health insurance profits and coverage denials were partly to blame for the incident."
    },
    {
        "title": "Zhenhao Zou: More than 20 new potential victims come forward after 'prolific' rapist jailed for assaulting 10 women",
        "description": "Another 23 female potential victims have reported that they may have been raped by Zhenhao Zou - the Chinese PhD student detectives believe may be one of the country's most prolific sex offenders.",
        "url": "https://news.sky.com/story/zhenhao-zou-more-than-20-new-potential-victims-come-forward-after-prolific-rapist-jailed-for-assaulting-10-women-13339807",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zhenhao-zou-met-police_6841208.png?20250303213211",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-01 13:16:00",
        "Headline": "Chinese PhD student Zhenhao Zou, 28, was convicted of drugging and raping 10 women following a trial at the Inner London Crown Court last month.",
        "Content": "Another 23 female potential victims have reported that they may have been raped by Zhenhao Zou - the Chinese PhD student detectives believe may be one of the country's most prolific sex offenders. The Metropolitan Police launched an international appeal after Zou, 28, was convicted of drugging and raping 10 women following a trial at the Inner London Crown Court last month. Detectives have not confirmed whether the 23 people who have come forward add to their estimates that more than 50 other women worldwide may have been targeted by the University College London student. Metropolitan Police commander Kevin Southworth said: \"We have victims reaching out to us from different parts of the globe. \"At the moment, the primary places where we believe offending may have occurred at this time appears to be both in England, here in London, and over in China.\" Zou lived in a student flat in Woburn Place, near Russell Square in central London, and later in a flat in the Uncle building in Churchyard Row in Elephant and Castle, south London. Read more: How a student described as 'smart and charming' was unmasked as a prolific sexual predator \n                  China calls Taiwan president 'parasite' and launches large-scale military drills around island\n                 \n                  Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US\n                 \n                  Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears\n                 He had also been a student at Queen's University Belfast, where he studied mechanical engineering from 2017 until 2019. Police say they have not had any reports from Belfast but added they were \"open-minded about that\". \"Given how active and prolific Zou appears to have been with his awful offending, there is every prospect that he could have offended anywhere in the world,\" Mr Southworth said. \"We wouldn't want anyone to write off the fact they may have been a victim of his behaviour simply by virtue of the fact that you are from a certain place. \"The bottom line is, if you think you may have been affected by Zhenhao Zou or someone you know may have been, please don't hold back. Please make contact with us.\" Zou used hidden or handheld cameras to record his attacks, and kept the footage and often the women's belongings as souvenirs. He targeted young, Chinese women, inviting them to his flat for drinks or to study, before drugging and assaulting them. Zou was convicted of 11 counts of rape, with two of the offences relating to one victim, as well as three counts of voyeurism, 10 counts of possession of an extreme pornographic image, one count of false imprisonment and three counts of possession of a controlled drug with intent to commit a sexual offence, namely butanediol.  Mr Southworth said: \"Of those 10 victims, several were not identified so as we could be sure exactly where in the world they were, but their cases, nevertheless, were sufficient to see convictions at court. \"There were also, at the time, 50 videos that were identified of further potential female victims of Zhenhao Zou's awful crimes. \"We are still working to identify all of those women in those videos. \"We have now, thankfully, had 23 victim survivors come forward through the appeal that we've conducted, some of whom may be identical with some of the females that we saw in those videos, some of whom may even turn out to be from the original indicted cases.\" Mr Southworth added: \"Ultimately, now it's the investigation team's job to professionally pick our way through those individual pieces of evidence, those individual victims' stories, to see if we can identify who may have been a victim, when and where, so then we can bring Zou to justice for the full extent of his crimes.\" Mr Southworth said more resources will be put into the investigation, and that detectives are looking to understand \"what may have happened without wishing to revisit the trauma, but in a way that enables [the potential victims] to give evidence in the best possible way.\" The Metropolitan Police is appealing to anyone who thinks they may have been targeted by Zou to contact the force either by emailing survivors@met.police.uk, or via the major incident public portal on the force's website."
    },
    {
        "title": "Girl, 11, who went missing after entering River Thames named",
        "description": "An 11-year-old girl who went missing after entering the River Thames has been named as Kaliyah Coa.",
        "url": "https://news.sky.com/story/girl-11-who-went-missing-after-entering-river-thames-named-13340026",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-river-thames-barge-house-causeway_6873285.jpg?20250401211817",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-01 19:37:00",
        "Headline": "Police say drones and boats have been deployed to carry out a large-scale search over a wide area. Officers now say their operation has switched to a recovery mission.",
        "Content": "An 11-year-old girl who went missing after entering the River Thames has been named as Kaliyah Coa. An \"extensive search\" has been carried out after the incident in east London at around 1.30pm on Monday. Police said the child had been playing during a school inset day and entered the water near Barge House Causeway, North Woolwich. A recovery mission is now said to be under way to find Kaliyah along the Thames, with the Metropolitan Police carrying out an extensive examination of the area. Chief Superintendent Dan Card thanked members of the public and emergency teams who responded to \"carry out a large-scale search during a highly pressurised and distressing time\". He also confirmed drone technology and boats were being used to \"conduct a thorough search over a wide area\". He added: \"Our specialist officers are supporting Kaliyah's family through this deeply upsetting time and our thoughts go out to all those impacted by what has happened.\" \n                  Zhenhao Zou: More than 20 new potential victims come forward after 'prolific' rapist jailed for assaulting 10 women\n                 \n                  Royal Navy warship takes out air and sea drones in 'realistic' exercise\n                 \n                  Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife\n                 \"Equally we appreciate this has affected the wider community who have been extremely supportive. You will see extra officers in the area during the coming days.\" Read more from Sky News:What is Trump's liberation day about?Woman rescued 91 hours after quake'Exceptional' codebreaker dies at 101 On Monday, Kerry Benadjaoud, a 62-year-old resident from the area, said she heard of the incident from her next-door neighbour, who \"was outside doing her garden and there was two little kids running, and they said 'my friend's in the water'\". When she arrived at the scene with a life ring, a man told her he had called the police, \"but he said at the time he could see her hands going down\". Barge House Causeway is a concrete slope that goes directly into the River Thames and is used to transport boats. Residents pointed out that it appeared to be covered in moss and was slippery."
    },
    {
        "title": "Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife",
        "description": "Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.&#160;",
        "url": "https://news.sky.com/story/planning-reforms-to-rewire-the-system-and-get-britain-building-all-while-protecting-wildlife-13340010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-cave-tunnel-hs2_6825202.jpg?20250211053130",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-04-01 19:29:00",
        "Headline": "A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.  A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place, while rejecting a \"bonfire of regulations\". But Mr Corry suggested there might be circumstances in which the government look at changing the wildlife and habit rules inherited from the EU, which protect individual species. Politics latest: Follow live updates These lie at the centre of the controversy of a £120m bat tunnel - the shed in Aylesbury which protects a rare breed from future high speed trains. Keir Starmer has declared war on £100m HS2 bat shed - but has he got a solution?New planning bill could be the government's most important - but will it work in practice? The government has now explicitly ruled out any such change in this parliament. \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 \n                  Payouts for departing civil servants capped at £95,000 under voluntary exit scheme\n                 \n                  Politics latest: Trump's tariffs 'a nightmare' for the UK - but Starmer could benefit from carve outs\n                 Campaigners have questioned whether the changes go far enough and will make a major difference to the rate and scale of building in the UK. Speaking to Sky News, Environment Secretary Steve Reed insisted that accepting nine of the recommendations from the Corry review would amount to wholesale reform. The minister said: \"We can get a win-win for economic growth and for nature. And that is why we are moving ahead with proposals such as appointing a lead regulator for major developments so that the developers don't have to navigate the architecture of multiple regulators. \"They just work for a single regulator who manages all the others on their behalf. Simplifying the online planning portal. \"These are huge changes that will save developers billions of pounds and speed up decisions doing damage to the environment.\" Mr Reed insisted that there would be \"no more bat tunnels\" built, even though the Corry review suggests that more work needs to be done to look again at the relevant guidance. It says: \"Rapidly reviewing the existing catalogue of compliance guidance, including on protecting bats, will identify opportunities to remove duplication, ambiguity or inconsistency. \"Natural England has already agreed to review and update their advice to Local Planning Authorities on bats to ensure there is clear, proportionate and accessible advice available.\" The review will mean: • Appointing one lead regulator for every major infrastructure project, like Heathrow expansion • A review on how nature rules are implemented - but not the rules themselves • Insisting regulators focus more on government priorities, particularly growth Economist and former charity leader Mr Corry, who led the review, said it shows that \"simply scrapping regulations isn't the answer\". \"Instead we need modern, streamlined regulation that is easier for everyone to use. While short-term trade-offs may be needed, these reforms will ultimately deliver a win-win for both nature and economic growth in the longer run.\" However, Sam Richards from Britain Remade, a thinktank trying to get Britain growing, said that while the steps are welcome, the number of regulators that report to the environment department would remain the same before and after the review. He questioned whether this would have the impact ministers claimed."
    },
    {
        "title": "Six people in hospital after huge fire at industrial estate in Cumbernauld, says Police Scotland",
        "description": "Six men have been treated in hospital after a huge fire broke out on an industrial estate in North Lanarkshire, Police Scotland has said.",
        "url": "https://news.sky.com/story/six-people-in-hospital-after-huge-fire-at-industrial-estate-says-police-scotland-13339960",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-fire-cumbernauld-lanarkshire_6873171.jpg?20250401191618",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-01 18:22:00",
        "Headline": "Six fire engines, six ambulances, and specialist teams were sent to the blaze, where emergency services found a single-storey building \"well alight\" and black smoke pouring from the industrial unit.",
        "Content": "Six men have been treated in hospital after a huge fire broke out on an industrial estate in North Lanarkshire, Police Scotland has said. The men are aged between 20 and 66 and none of their injuries are described as being life-threatening. When fire crews arrived, a single-storey building on the Blairlinn industrial estate in Cumbernauld was \"well alight\" and black smoke was pouring from the unit. Firefighters have been working to bring the blaze under control, according to Police Scotland, which added that \"a number of neighbouring business properties have been evacuated\". Emergency services \"are likely to remain at the scene for some time\" as the incident remains ongoing. Sergeant Kevin Anderson said \"the fire is contained to within the industrial premises\". He asked people in the Greenfaulds area of the town to stay indoors and keep their windows closed as a precaution due to the smoke. \n                  Grant Paterson: British tourist dies in hospital after being injured in Rome explosion\n                 \n                  Seven-figure settlement agreed in Celtic Boys Club abuse cases\n                 \n                  Police reach decision over Old Firm derby water bottle incident involving Rangers star Vaclav Cerny\n                 Six fire engines were sent to the industrial unit in Broomlee Road, Cumbernauld, northeast of Glasgow, on Tuesday afternoon, a Scottish Fire and Rescue Service (SFRS) spokesperson said. Six ambulances, a trauma team, and a resuscitation unit were also sent to the scene. The SFRS spokesperson said they were called to the fire at 2.35pm, and when two fire engines arrived, firefighters found a \"single-storey building well alight\". \"A further four appliances were mobilised to the scene. Six casualties have been passed into the care of the Scottish Ambulance Service, and firefighting crews remain in attendance.\" Read more on Sky News:Pest controllers a 'fourth emergency service'Police shoot man dead at stationScottish tourist dies in Italy A Scottish Ambulance Service spokesperson said five people were taken to Glasgow Royal Infirmary and one to University Hospital Monklands. An investigation will be carried out in due course to establish the cause of the fire, Sergeant Anderson said."
    },
    {
        "title": "Man shot dead by armed police at Milton Keynes railway station",
        "description": "A man carrying a knife who \"moved at speed\" towards police has been shot dead by officers at Milton Keynes railway station, Thames Valley Police (TVP) have said.",
        "url": "https://news.sky.com/story/man-shot-dead-by-police-in-milton-keynes-13339825",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milton-keynes-railway-station_6873182.jpg?20250401192901",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-01 13:52:00",
        "Headline": "The Independent Office for Police Conduct said Thames Valley Police had referred the incident to the watchdog.",
        "Content": "A man carrying a knife who \"moved at speed\" towards police has been shot dead by officers at Milton Keynes railway station, Thames Valley Police (TVP) have said. Officers from TVP and British Transport Police (BTP) were called to reports of a man carrying a firearm at the station at 12.55pm on Tuesday. \"Our armed officers responded and challenged a white man who was carrying a knife outside the station,\" TVP said in a later statement. They said the man \"moved at speed\" towards officers with the knife before \"a shot was fired by police\". Despite attempts to save the man, he was pronounced dead at 1.44pm. Officers are still at the scene, but there is no wider risk to the public, the force said. They said the station remains open and trains are running as usual - although there was disruption to the bus station and taxi rank outside. \"We have not yet informed the man's next of kin, so he has not been formally identified,\" the force said. The Independent Office for Police Conduct (IOPC) has said TVP had referred the incident to the watchdog. A spokesperson said it had begun an independent probe into the shooting, adding it was \"notified by TVP shortly after the incident\" and that IOPC investigators were sent to the station. The spokesperson added: \"Our thoughts are with the family of the man who died and all those who have been affected by this incident. \"Our role in these circumstances is to independently investigate all of the circumstances surrounding this incident including the actions and decisions taken by the police. \"We declared an independent investigation at 2.26pm. It is in its very early stages and no further information is available at this time.\" Read more on Sky News:Pest control a 'fourth emergency service'Scottish tourist dies in ItalySix hurt in huge fire Emily Darlington, Milton Keynes Central MP, said: \"I was shocked to hear of the events outside Milton Keynes Central Station today. My thoughts are with everybody affected, and I am grateful for the swift action taken by the emergency services to keep the public safe.\""
    },
    {
        "title": "Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs",
        "description": "Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-us-uk-trade-talks-well-advanced-and-rejects-knee-jerk-response-to-trump-tariffs-13339613",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841895.png?20250228063409",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-01 08:10:00",
        "Headline": "Donald Trump is expected to impose tariffs on \"all countries\" from Wednesday but Downing Street has admitted its negotiations have so far not managed to halt them.",
        "Content": " Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response. Speaking to Sky News political editor Beth Rigby, the prime minister said the UK is \"working hard on an economic deal\" with the US and said \"rapid progress\" has been made on it ahead of tariffs expected to be imposed on Wednesday. But, he admitted: \"Look, the likelihood is there will be tariffs. Nobody welcomes that, nobody wants a trade war. \"But I have to act in the national interest and that means all options have to remain on the table.\" Politics latest: Ministers hail 'huge' minimum wage boost as bills rise Sir Keir added: \"We are discussing economic deals. We're well advanced. \"These would normally take months or years, and in a matter of weeks, we've got well advanced in those discussions, so I think that a calm approach, a collected approach, not a knee-jerk approach, is what's needed in the best interests of our country.\" \n                  'Liberation day is here': But what will it mean for global trade?\n                 \n                  Number 10's downplaying of its Chagos win is a sign of Donald Trump's unpredictability\n                 \n                  Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours\n                 Downing Street said on Monday the UK is expecting to be hit by new US tariffs on Wednesday - branded \"liberation day\" by the US president - as a deal to exempt British goods would not be reached in time. A 25% levy on car and car parts had already been announced but the new tariffs are expected to cover all exports to the US. Jonathan Reynolds, the business and trade secretary, earlier told Sky News he is \"hopeful\" the tariffs can be reversed soon. But he warned: \"The longer we don't have a potential resolution, the more we will have to consider our own position in relation to [tariffs], precluding retaliatory tariffs.\" He added the government was taking a \"calm-headed\" approach in the hope a deal can be agreed but said it is only \"reasonable\" retaliatory tariffs are an option, echoing Sir Keir's sentiments over the weekend. Read more:Why a figure of 48% is important as Trump tariffs nearStarmer and Trump discuss US-UK 'prosperity' deal Tariff announcement on Wednesday Mr Trump has been threatening tariffs - import taxes - on countries with the biggest trade imbalances with the US. However, over the weekend, he suggested the tariffs would hit all countries, but did not name them or reveal which industries would be targeted. Read more: How Trump's tariffs could affect the UK  Mr Trump will unveil his tariff plan on Wednesday afternoon at the first Rose Garden news conference of his second term, the White House press secretary said. \"Wednesday, it will be Liberation Day in America, as President Trump has so proudly dubbed it,\" Karoline Leavitt said. \"The president will be announcing a tariff plan that will roll back the unfair trade practices that have been ripping off our country for decades. He's doing this in the best interest of the American worker.\"  Tariffs would cut UK economy by 1% UK government forecaster the Office for Budget Responsibility (OBR) said a 20 percentage point increase in tariffs on UK goods and services would cut the size of the British economy by 1% and force tax rises this autumn. Global markets remained flat or down on Monday in anticipation of the tariffs, with the FTSE 100 stock exchange trading about 1.3% lower on Monday, closing with a 0.9% loss. On Wall Street, the S&P 500 rose 0.6% after a volatile day which saw it down as much as 1.7% in the morning. However, the FTSE 100 is expected to open about 0.4% higher on Tuesday, while Asian markets also steadied, with Tokyo's Nikkei 225 broadly unchanged after a 4% slump yesterday."
    },
    {
        "title": "Birmingham bin strike: Pest controllers 'feel like fourth emergency service' as rat populations 'triple'",
        "description": "As we drive around Birmingham, the first thing we notice is that, to some extent, every street is affected by the rubbish problem.",
        "url": "https://news.sky.com/story/birmingham-bin-strike-pest-controllers-feel-like-fourth-emergency-service-as-rat-populations-triple-13339916",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-birmingham-bin-strike_6873133.jpg?20250401172655",
        "type": "UK",
        "Author": "Amelia Harper",
        "Date Published": "2025-04-01 15:57:00",
        "Headline": "A day after the city council declared a major incident, Sky's Amelia Harper spent the morning at one mound, which was over 20m (66ft) long and topped with bed frames and the front bonnet of a hatchback car.",
        "Content": "\n          Home news correspondent\n       As we drive around Birmingham, the first thing we notice is that, to some extent, every street is affected by the rubbish problem. If there aren't huge piles of bags and items left by fly-tippers, there is litter all over the kerbside. Bottles, takeaway cups, and other items mark the places where there once was a huge mound of rubbish. These are the lucky spots, if you like, where some of it has been cleaned up. Birmingham bin workers strike explained The strikes have clearly become an opportunity for fly-tippers. The day after the city council declared a major incident, I spent the morning at one mound, which was over 20m (66ft) long and topped with bed frames and the front bonnet of a hatchback car. Another consequence of the growing rubbish problem is rats. Pest controllers across Birmingham are in such demand at the moment, they told me \"we feel like the fourth emergency service\", with rat populations \"tripling\" since the industrial action began. \n                  Birmingham bin strike: Why are workers striking and how long will it last?\n                 \n                  Birmingham bin strikes: Government urged to hold COBRA meeting over dispute\n                 \n                  Man killed after collision with police car in Birmingham was 'beloved' father-of-two\n                 I spent the day with Hullternative Pest Control Services, who say they've seen a 60-70% increase in calls from people having rodent problems. When I arrive at their HQ, I'm struck by how many calls they are taking - the phone is ringing regularly as people report issues with rats. The firm's service manager, Martin Hull, takes us into town in their van to show us the worst spots. We pull up at Gillott Road in Edgbaston, west of the city centre, where we find piles of bin bags that have been torn open. A 'buffet' for rats Martin tells me it's evidence of the rats chewing through the bags to get to what he calls their \"buffet\". We take a closer look and see ants and flies within the rotting food, too. These piles are causing a headache for people in the area - and Martin's seen an extra 20-30 new customer calls on top of their usual clients. They'd usually only get 5-10 calls daily, so the increased demand is clear. We then drive into the city centre to have a look at some of the firm's bait boxes. Read more on Sky News:Police shoot man dead at stationTV star and Olympian honouredSee how much your bills are going up Martin opens one up, and we see the remnants of a small blue sachet. This is the bag of poison called a pasta bait sachet… or \"tea bags\" in the trade. It's been completely eaten, and pest controllers are having to turn to more effective, \"deadly\" ways of dealing with the rodent infestation. More rubbish means more calls He shows me how they lay a physical rat trap, after filling it with paste to attract the rodents. In a typical week, the family-run business gets through 20 traps in the area, but now, they are using around 200. Martin says that now the rats are here in such numbers, they are going to be much harder to get rid of. It's clear that this is going to take a long time to clear up."
    },
    {
        "title": "Bodies still remain among the 'collapsed and inclining' buildings in quake-hit Mandalay",
        "description": "A man inside Mandalay has told Sky News bodies remain under \"collapsed and inclining\" buildings after the Myanmar earthquake - as a woman was freed from rubble after 91 hours.",
        "url": "https://news.sky.com/story/woman-rescued-91-hours-after-myanmar-quake-as-number-of-dead-rises-to-more-than-2700-13339643",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-myanmar-naypyitaw-earthquake_6872754.jpg?20250401094741",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-01 08:05:00",
        "Headline": "A local in Mandalay tells Sky News that many of the buildings in the city are \"collapsed or inclining\", adding: \"There are some bodies, some dead bodies, that still remain and other destruction.\"",
        "Content": " A man inside Mandalay has told Sky News bodies remain under \"collapsed and inclining\" buildings after the Myanmar earthquake - as a woman was freed from rubble after 91 hours. The local inside Myanmar said many of the structures in the city were wrecked or badly damaged after the 7.7 magnitude quake on Friday, adding: \"There are some bodies, some dead bodies, that still remain and other destruction\". Meanwhile, in a televised address, Myanmar's military leader Min Aung Hlaing said the number of dead had risen to 2,719 and is expected to exceed 3,000. Some 4,521 people have been injured, while a further 441 are missing. More than 10,000 buildings are known to have collapsed or been severely damaged in central and northwest Myanmar, the World Health Organisation said.  Smell of dead bodies near destroyed buildings In Mandalay, Myanmar's second-largest city, which was close to the quake's epicentre, 50 children and two teachers were killed when their preschool collapsed, the United Nations said. The local in the city told Sky News that \"a lot of local assistance associations like charity groups are still struggling with digging out the corpses, the dead bodies, from the destruction\". He said that \"when we pass near the destructions, the collapsed building or very damaged building, we can smell\" dead bodies. \"The smell of the dead bodies after four days... it still remains,\" he said, before adding: \"For the social assistance association... they need permission [to give aid] especially from the government. \"If they don't have permission, then they cannot do anything.\" He also said others in Mandalay are struggling after the earthquake, which followed the city being affected by cyclones, the COVID-19 pandemic, and the civil war in Myanmar - where a junta seized power in a coup in 2021. \"Some people, they say they have nothing at all,\" the local added. \"They have no more home, they have no more belongings, because its already damaged.\" Woman freed after 91 hours under rubble It comes after the fire department in Myanmar's capital freed a woman trapped under rubble 91 hours after the building collapsed. The 63-year-old woman was freed early on Tuesday in Naypyidaw. As the country continues to recover, a worker from the International Rescue Committee said people fear aftershocks and are sleeping outside on roads or in open fields. Communities are struggling to meet basic needs such as access to clean water and sanitation, and emergency teams are working \"tirelessly\" to locate survivors and provide aid, the UN said in a report. Rescue efforts have been complicated by the civil war, as rebel groups say the junta has conducted airstrikes, even after the quake, while NGOs fear that certain areas could be denied vital supplies. \"Myanmar's military has a longstanding practice of denying aid to areas where groups who resist it are active,\" said Joe Freeman, a researcher with Amnesty Myanmar. \"It must immediately allow unimpeded access to all humanitarian organisations and remove administrative barriers delaying needs assessments.\" Read more:Military regime targeting 'civilian areas' in 'wake of disaster'Myanmar earthquake leaves some areas almost completely destroyed The quake was the strongest to hit the southeast Asian country in more than a century. In neighbouring Thailand, rescuers are still scouring the ruins of a collapsed, unfinished skyscraper for any signs of life. \"There are about 70 bodies underneath, and we hope by some miracle one or two are still alive,\" volunteer rescue leader Bin Bunluerit said. Six human-shaped figures have been detected by scanners, said Bangkok's deputy governor, Tavida Kamolvej. Thirteen deaths have been confirmed at the building site, with 74 people still missing, while Thailand's national number of dead stands at 20."
    },
    {
        "title": "Father demands protection after Gaza aid workers' deaths",
        "description": "The father of a paramedic killed by Israel in Gaza has told Sky News he would have been on the mission to rescue wounded colleagues, but was ill that day and so his son went instead.",
        "url": "https://news.sky.com/story/father-demands-protection-after-gaza-aid-workers-deaths-13339940",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-khan-younis-funeral_6873176.jpg?20250401192055",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-04-01 17:20:00",
        "Headline": "The bodies of Red Crescent and UN workers, missing for around eight days, have been found buried under sand in a mass grave. The Israel Defence Forces (IDF) has denied killing innocent medical workers.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  The father of a paramedic killed by Israel in Gaza has told Sky News he would have been on the mission to rescue wounded colleagues, but was ill that day and so his son went instead. \"It was supposed to be me, you know. I was on duty that night but fell ill and sent him in my place.\" Speaking at his son's funeral, Hassan Abu Hileh said Israel is to blame for the death of Mohammed and the other 14 men. \"We need protection from the international community. We need protection for medical teams. We are medics-soldiers of duty, not armed fighters. We carry out humanitarian work. If I see someone who needs medical attention, I'm obligated to serve them,\" he said. The bodies of the Red Crescent and United Nations workers went missing around eight days ago. Despite repeated requests to search for them, all denied by the Israel Defence Forces (IDF), the UN eventually found 14 bodies buried under sand in a mass grave. One is still missing. They were still wearing their uniforms. The director of the Palestinian Red Crescent in Gaza has accused Israel of murdering the emergency workers. \"We arrived at the scene of the crime to retrieve the bodies and found that all of them had been shot directly in the upper part of their bodies and buried,\" said Dr Bashir Murad. \n                  Gaza's orphans have lost everything - even the dream of growing up\n                 \n                  Anti-Hamas chants heard at rare protest in Gaza\n                 \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \"The ambulances were also destroyed and buried.\" The bodies were found in sand in the south of the Gaza Strip in what Jonathan Whittall, Gaza head of the UN Office for the Coordination of Humanitarian Affairs, called a \"mass grave\", marked with the emergency light from a crushed ambulance. Mr Whittall posted pictures and video of Red Crescent teams digging in the sand for the bodies and workers laying them out on the ground, covered in plastic sheets.  The Israel Defence Forces (IDF) has denied killing innocent medical workers and said Israeli forces opened fire on suspicious vehicles that were travelling without coordination and in an active combat zone. \"The IDF did not randomly attack an ambulance on March 23,\" claimed a spokesman. \"⁠Last Sunday, several uncoordinated vehicles were identified advancing suspiciously toward IDF troops without headlights or emergency signals. IDF troops then opened fire at the suspected vehicles. \"Earlier that day, cars that did not belong to terrorists were coordinated and passed safely on the same route.\" Read more from Sky News:What happened to the ceasefire?Anti-Hamas chants at Gaza protest We have asked the IDF why the bodies were found in a mass grave but have received no comment. More than 400 aid workers have been killed in Gaza since the start of the Israel-Hamas war, according to the UN. According to the UN, at least 1,060 healthcare workers have been killed in the 18 months since Israel launched its offensive in Gaza after Hamas fighters stormed southern Israel on 7 October 2023. The UN is reducing its international staff in Gaza by a third because of safety concerns."
    },
    {
        "title": "China calls Taiwan president 'parasite' and launches large-scale military drills around island",
        "description": "China's military has said it's begun joint army, navy and rocket force exercises around Taiwan.",
        "url": "https://news.sky.com/story/china-launches-large-scale-military-drills-around-taiwan-and-calls-its-president-a-parasite-13339556",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-china-taiwan_6872610.jpg?20250401040431",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-01 02:06:00",
        "Headline": "Beijing says the exercises are intended to \"serve as a stern warning and powerful deterrent against Taiwanese independence\".",
        "Content": " China's military has said it's begun joint army, navy and rocket force exercises around Taiwan. It said the exercises were intended to \"serve as a stern warning and powerful deterrent against Taiwanese independence\", and called the self-governed island's president a \"parasite\". China considers Taiwan to be its own territory and has threatened to use force to gain control. Its military released a poster entitled \"Closing In\", showing Chinese ships and fighter jets circling the island and the words \"sinister moves of Taiwan separatists courting disaster upon themselves\". It comes after the Taiwanese president, President Lai Ching-Te, called China a \"foreign hostile force\" last month. He announced measures including a proposal to re-instate a military court system in response to a perceived growth in Chinese infiltration of Taiwanese society and \"grey-zone\" tactics. Announcing the joint exercises, China's eastern theatre command depicted the president as a cartoon bug held by a pair of chopsticks above a burning Taiwan. \"Parasite poisoning Taiwan island. Parasite hollowing Island out. Parasite courting ultimate destruction,\" the animation said. Footage also showed the capital Taipei being aimed at from above and military vehicles patrolling the streets. The eastern theatre command said on its official WeChat social media account: \"The focus is on exercises such as combat readiness patrols at sea and in the air, seizing comprehensive control, striking maritime and land targets and imposing blockade controls on key areas and routes.\" Taiwan's defence ministry said China's Shandong aircraft carrier group had entered its response area and it had tracked 19 Chinese navy vessels in the waters surrounding the island in a 24-hour period. It said the group had dispatched military aircraft and ships and activated land-based missile systems in response. Read more:China says US 'gravely backpedalled' over TaiwanHow Trump will deal with Taiwan remains uncertain Asia correspondent There is no doubt Beijing is seizing an opportunity here.  The recent hardening of both rhetoric and policy from Taiwan's president provides an opening for China, not just to practise blockade scenarios and sow feelings of insecurity among Taiwanese, but crucially also to test the resolve of the island's longstanding backer, the US. It has been a nervous few months in Taipei as they've watched President Trump row back support for Ukraine.  An initial reluctance from the new administration to provide clear condemnation or pushback will have ultimately emboldened Beijing.\n However, there have been a few hints in recent days that Washington may ultimately be coming back in behind Taiwan; the hardening of language in a few key statements, a visit by Alaska's governor and the quiet release of $870m of previously frozen military aid, to name just a few. Exactly where Trump stands on the Taiwan question is still unclear, he remains a volatile and transactional actor.  It is not impossible, for instance, that Taiwan's future could be used as a bargaining chip within some future wide-reaching deal with China. Today's drills will serve as a test for all involved. Is US resolve indeed hardening, to what extent, and how publicly?  Either way, an intense period of cross-strait relations feels inevitable.  \"The Chinese Communist Party has continued to increase its military activities around Taiwan and in the Indo-Pacificregion... and has become the biggest 'troublemaker' in the international community,\" the statement added. The drills come two weeks after a large exercise in mid-March, when Beijing sent a large number of drones and ships towards the island."
    },
    {
        "title": "Virginia Giuffre 'overwhelmed' with support after saying she had days to live",
        "description": "Virginia Giuffre has said she is \"overwhelmed with gratitude\" for the support she received after saying she had days to live.",
        "url": "https://news.sky.com/story/virginia-giuffre-overwhelmed-with-support-after-saying-she-had-days-to-live-13340074",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-01 20:41:00",
        "Headline": "Ms Giuffre's family release a statement after reports on Monday said she was suffering renal failure and only had four days to live after a school bus hit her car. It says she was \"banged up and bruised and returned home\" but her condition \"worsened and she was admitted to the hospital\".",
        "Content": "Virginia Giuffre has said she is \"overwhelmed with gratitude\" for the support she received after saying she had days to live. The woman - who accused Prince Andrew of sexual assault - said in a post on Instagram on Monday she was told she had \"four days to live\" after her vehicle was hit by a school bus. In a statement seen by Sky News on Tuesday, her family said Ms Giuffre was \"overwhelmed with gratitude\" and \"remains in serious condition while receiving medical care\". Her family said a school bus hit her car in rural western Australia on 24 March, adding: \"The police were called but said that there was no one available to come to the scene. \"They asked if anyone was injured and suggested that if they were, they should make their way to the hospital. \"The school bus driver had a bus full of distraught children and left the scene to get them back, saying he would file a police report, which he did later.\" The family added that Ms Giuffre was \"banged up and bruised and returned home\" but her condition \"worsened and she was admitted to the hospital\". \n                  Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash\n                 \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 \n                  Prince Andrew's former senior adviser made 'bad decision' when he provided legal statement in alleged Chinese spy case, tribunal hears\n                 Regarding her post, the family said she \"thought that she had posted on her private Facebook page\". Ms Giuffre originally said she was told \"I've gone into kidney renal failure\" and that \"I'm ready to go, just not until I see my babies one last time\". Read more from Sky News:Girl, 11, who went missing in River Thames namedFather demands protection after Gaza aid workers' deaths Australian police said after Ms Giuffre's post that they received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles north of Perth, on 24 March. A spokesperson for the East Metropolitan Health Service, which runs Royal Perth Hospital, told the Australian Broadcasting Corporation, however, that Ms Giuffre was not at any of their facilities. A Western Australia Public Transport Authority spokesperson also told ABC that they were unaware of any such bus crashes. Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "Powerful storm brings flooding to Greek islands Paros and Mykonos",
        "description": "A powerful storm in the Aegean Sea has triggered flash flooding on the Greek holiday island of Paros. ",
        "url": "https://news.sky.com/story/powerful-storm-brings-flooding-to-greek-holiday-islands-paros-and-mykonos-13339738",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-greece-paros-flood_6872811.jpg?20250401103109",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-01 10:46:00",
        "Headline": "The tourist towns of Parikia and Naousa, on Paros, were hardest hit as floodwaters carried cars and debris through the streets. ",
        "Content": " A powerful storm in the Aegean Sea has triggered flash flooding on the Greek holiday island of Paros.  Torrential rain in the tourist towns of Parikia and Naousa caused floodwaters that surged through streets, carrying cars and debris past whitewashed buildings late on Monday. The flooding was less severe on nearby Mykonos, also a popular holiday destination, where excavators were used to clear a path for floodwater, and it gushed past seafront cafes and restaurants. Hailstorms saw grasslands blanketed with white balls of ice. An emergency travel ban has been imposed on all traffic except emergency vehicles on both islands, and schools have been closed. The severe weather continued on Tuesday, with heavy rainfall also reported on the islands of Chios, Samos and Crete, with roads flooded, vehicles swept away, and property damaged, according to local media. Read more from Sky News:Three people die in crash between car and busLine-up for Beatles films revealed  On Paros, 13 people stranded in the storm were taken home by firefighters, but no one was reported injured or missing, while authorities are struggling to remove vehicles left stranded by the muddy waters. Almost the entire road network has been heavily disrupted, shops near the coast are flooded, and boats and nets have been swept away, according to public broadcaster ERT. The island's mayor Costas Bizas told the broadcaster: \"All this catastrophe happened in two hours. \"Roads have been damaged, and we need help with more machines so that we can clear the streets.\" Christos Veronis, the mayor of Mykonos, told ERT he wanted a state of emergency to be declared on the island. Greece has been ravaged by floods in recent years, with scientists blaming the extreme weather on warming waters amid rising global temperatures. A devastating storm killed 17 people and caused extensive damage across the central agricultural region of Thessaly in 2023."
    },
    {
        "title": "Grant Paterson: British tourist dies in hospital after being injured in Rome explosion",
        "description": "A British tourist who was seriously injured after a suspected gas explosion destroyed a three-storey B&B in Rome has died.",
        "url": "https://news.sky.com/story/grant-paterson-british-tourist-injured-in-rome-explosion-dies-in-hospital-13339774",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-grant-paterson-rome_6873071.jpg?20250401162017",
        "type": "World",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-04-01 13:13:00",
        "Headline": "Grant Paterson, 54, from East Kilbride in South Lanarkshire, was left severely burned after the blast on 23 March.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A British tourist who was seriously injured after a suspected gas explosion destroyed a three-storey B&B in Rome has died. Grant Paterson, 54, from East Kilbride in South Lanarkshire, was left severely burned following the blast in the Monteverde area of the Italian city on 23 March. Mr Paterson, an employee with Scottish ferry operator CalMac, was pulled out of the ruins by firefighters and was taken to Sant'Eugenio Hospital for treatment. Hospital officials told Sky News that Mr Paterson died on Tuesday morning. Diane Burke, CalMac's chief operating officer, said: \"Everyone at CalMac is distraught that Grant has passed away. \"He was a true gentleman and a credit to MV Clansman, the vessel he served aboard. \"During a distinguished 12-year career with us, he embodied the very best of CalMac and, with his larger-than-life character, he was much-loved by colleagues and passengers alike. \n                  British tourist in hospital seriously injured after Rome explosion\n                 \n                  Pope Francis arrives home to the Vatican after five-week hospital stay\n                 \n                  King and Queen set to meet Pope next month despite pontiff's ill health\n                 \"Our thoughts are with Grant's friends and family at this extremely difficult time.\" A post-mortem examination is set to be ordered by the prosecutor. A criminal investigation is currently under way and is probing potential culpable disaster and manslaughter. The Foreign, Commonwealth and Development Office (FCDO) said: \"We are supporting the family of a British man who died in Italy and are in touch with the local authorities.\" Mr Paterson was said to have suffered third-degree burns to at least 70% of his body. A neighbour reported that the explosion made his house windows shake, while another witness thought it had been a bomb or an earthquake. Read more from Sky News:Woman rescued 91 hours after Myanmar quakeThree killed as car and bus catch fire in crash It is understood Mr Paterson arrived in Rome on 17 March and was due to return home on 24 March. The B&B, named Mamma Roma, was on Via Vitellia in the busy neighbourhood of Monteverde, in the southwest part of Rome. Flying debris from the explosion, which occurred at around 8.40am and led to evacuations, damaged several cars and part of the wall of Villa Doria Pamphili - a seventeenth-century villa which also serves as the representative seat of the Italian government. Rome's Public Prosecutors' Offices has opened an investigation into the case. At the moment, it is a suspected gas leak. A crowdfunder for Mr Paterson's family was launched following the incident, with more than £11,000 raised so far."
    },
    {
        "title": "Luigi Mangione: US prosecutors directed to seek death penalty for man accused of killing healthcare boss",
        "description": "Prosecutors are being urged to seek the death penalty for Luigi Mangione, the man accused of fatally shooting the chief executive of a major healthcare company last year.",
        "url": "https://news.sky.com/story/luigi-mangione-us-prosecutors-directed-to-seek-death-penalty-for-man-accused-of-killing-healthcare-boss-13339868",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-luigi-mangione-thompson_6784180.jpg?20241223163644",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-01 15:18:00",
        "Headline": "US attorney general Pam Bondi says her intervention is part of President Trump's \"agenda to stop violent crime and Make America Safe Again\".",
        "Content": "Prosecutors are being urged to seek the death penalty for Luigi Mangione, the man accused of fatally shooting the chief executive of a major healthcare company last year. In February, Mangione pleaded not guilty to multiple counts of murder following the killing of 50-year-old Brian Thompson outside a midtown Manhattan hotel in New York in December. Mr Thompson was the CEO of UnitedHealthcare. Now, US attorney general Pam Bondi has issued a statement saying she has \"directed federal prosecutors to seek the death penalty in this case\".  She added that the murder of Mr Thompson, an \"innocent man and father of two young children\", was a \"premeditated, cold-blooded assassination that shocked America\". Ms Bondi said her intervention was part of President Donald Trump's \"agenda to stop violent crime and Make America Safe Again\". She said that because the shooting happened in a public place with \"bystanders nearby\", there could have been a \"grave risk of death to additional persons\". \n                  Villain or hero? Everyone has thoughts on alleged healthcare CEO assassin Luigi Mangione - and it's not all negative\n                 \n                  Luigi Mangione: Suspect in US healthcare boss killing 'posted about back condition on Reddit for several years'\n                 \n                  Luigi Mangione: Police say fingerprints of US gunman suspect match those found near New York crime scene\n                 The US Department of Justice said Ms Bondi's actions were in line with her \"day one memo as attorney general\" entitled \"Reviving The Federal Death Penalty And Lifting The Moratorium On Federal Executions\". Mangione, 26, is accused of ambushing and shooting Mr Thompson as he walked to an investor conference. He pleaded not guilty to New York state charges of murder and murder as an act of terrorism just before Christmas last year. The death penalty is not used in New York, meaning Mangione faces life in prison without parole if convicted in those cases. However, Mangione also faces a parallel indictment from the Manhattan federal court for Mr Thompson's killing. He has not been asked to enter a plea in that case but could face the death penalty if convicted. He also faces charges of forgery, carrying firearms without a licence, and other counts in Pennsylvania, where authorities arrested him at a McDonald's. Read more:Everyone has thoughts on Luigi - and it's not all negativeDozens turn out in support of Luigi over killing of healthcare boss 'Decision to execute is political' Karen Friedman Agnifilo, Mangione's lawyer, said the district attorney's direction to the prosecution means the justice department \"has moved from the dysfunctional to the barbaric\". She added: \"Their decision to execute Luigi is political and goes against the recommendation of the local federal prosecutors, the law, and historical precedent. \"While claiming to protect against murder, the federal government moves to commit the pre-meditated, state-sponsored murder of Luigi. By doing this, they are defending the broken, immoral, and murderous healthcare industry that continues to terrorise the American people.\" She said Mangione's lawyers are prepared to \"fight these federal charges, brought by a lawless justice department\" alongside the charges in New York State and Pennsylvania - \"and anything else they want to pile on Luigi\". Police said that upon his arrest, Mangione was in possession of a gun, bullets, multiple fake IDs and a handwritten document expressing \"ill will\" towards corporate America. The killing prompted some to voice their resentment at US health insurers, with Mangione attracting a cult following. A poll taken in the wake of the shooting showed most Americans believe health insurance profits and coverage denials were partly to blame for the incident."
    },
    {
        "title": "Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours",
        "description": "A senior Democrat has broken records with a marathon speech on the Senate floor against US President Donald Trump.",
        "url": "https://news.sky.com/story/democrat-cory-booker-rails-against-trump-and-musk-in-record-breaking-senate-speech-lasting-more-than-24-hours-13339860",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cory-booker-senate_6873105.jpg?20250401164504",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-01 14:53:00",
        "Headline": "Cory Booker, a New Jersey senator, said last night he intends to disrupt the \"normal business of the United States Senate for as long as I am physically able\".",
        "Content": "A senior Democrat has broken records with a marathon speech on the Senate floor against US President Donald Trump. Cory Booker, a New Jersey senator, began speaking around 7pm on Monday (just after midnight on Tuesday in the UK) and said he intended to disrupt the \"normal business of the United States Senate for as long as I am physically able\". Referring to Mr Trump's presidency, he said: \"I rise tonight because I believe sincerely that our country is in crisis.\" The 55-year-old senator has been speaking for more than 24 hours and 18 minutes - beating the record for the longest speech in Senate history. He remained standing for the entire duration, as he would lose control of the floor if he left his desk or sat down. Read more: Who is the Democrat making a marathon speech against Trump? Other Democrat senators have joined Mr Booker to ask questions so he can rest his voice, including Senate minority leader Chuck Schumer. At the start of his speech, Mr Booker said: \"These are not normal times in our nation. And they should not be treated as such in the United States Senate. \"The threats to the American people and American democracy are grave and urgent, and we all must do more to stand against them.\" Overnight, he referenced Strom Thurmond of South Carolina, the previous record-holder who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957. Read more:'Liberation day' is coming - one number to keep in mindProsecutors directed to seek death penalty for Luigi Mangione 👉 Follow Trump 100 on your podcast app 👈 \"You think we got civil rights one day because Strom Thurmond - after filibustering for 24 hours - you think we got civil rights because he came to the floor one day and said 'I've seen the light',\" he said. \"No, we got civil rights because people marched for it, sweat for it and [civil rights leader] John Lewis bled for it.\" The democrat pushed past the mark set by Republican Senator Ted Cruz - who spoke for 21 hours and 19 minutes against the Affordable Care Act in 2013 - earlier in the day."
    },
    {
        "title": "Virginia Giuffre 'overwhelmed' with support after saying she had days to live",
        "description": "Virginia Giuffre has said she is \"overwhelmed with gratitude\" for the support she received after saying she had days to live.",
        "url": "https://news.sky.com/story/virginia-giuffre-overwhelmed-with-support-after-saying-she-had-days-to-live-13340074",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-01 20:41:00",
        "Headline": "Ms Giuffre's family release a statement after reports on Monday said she was suffering renal failure and only had four days to live after a school bus hit her car. It says she was \"banged up and bruised and returned home\" but her condition \"worsened and she was admitted to the hospital\".",
        "Content": "Virginia Giuffre has said she is \"overwhelmed with gratitude\" for the support she received after saying she had days to live. The woman - who accused Prince Andrew of sexual assault - said in a post on Instagram on Monday she was told she had \"four days to live\" after her vehicle was hit by a school bus. In a statement seen by Sky News on Tuesday, her family said Ms Giuffre was \"overwhelmed with gratitude\" and \"remains in serious condition while receiving medical care\". Her family said a school bus hit her car in rural western Australia on 24 March, adding: \"The police were called but said that there was no one available to come to the scene. \"They asked if anyone was injured and suggested that if they were, they should make their way to the hospital. \"The school bus driver had a bus full of distraught children and left the scene to get them back, saying he would file a police report, which he did later.\" The family added that Ms Giuffre was \"banged up and bruised and returned home\" but her condition \"worsened and she was admitted to the hospital\". \n                  Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash\n                 \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 \n                  Prince Andrew's former senior adviser made 'bad decision' when he provided legal statement in alleged Chinese spy case, tribunal hears\n                 Regarding her post, the family said she \"thought that she had posted on her private Facebook page\". Ms Giuffre originally said she was told \"I've gone into kidney renal failure\" and that \"I'm ready to go, just not until I see my babies one last time\". Read more from Sky News:Girl, 11, who went missing in River Thames namedFather demands protection after Gaza aid workers' deaths Australian police said after Ms Giuffre's post that they received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles north of Perth, on 24 March. A spokesperson for the East Metropolitan Health Service, which runs Royal Perth Hospital, told the Australian Broadcasting Corporation, however, that Ms Giuffre was not at any of their facilities. A Western Australia Public Transport Authority spokesperson also told ABC that they were unaware of any such bus crashes. Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "Who is Cory Booker? The Democrat making a marathon speech against Trump (and why it's not a filibuster)",
        "description": "A Democratic senator is delivering a marathon speech in the US Senate&#160;in protest against Donald Trump.",
        "url": "https://news.sky.com/story/who-is-cory-booker-the-democrat-making-a-marathon-speech-against-trump-and-why-its-not-a-filibuster-13339858",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cory-booker-us-senate_6873122.jpg?20250401170818",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-01 14:54:00",
        "Headline": "The New Jersey senator has been speaking for more than 17 hours and has said he will remain on the floor as long as he is \"physically able\".",
        "Content": " A Democratic senator is delivering a marathon speech in the US Senate in protest against Donald Trump. Cory Booker, 55, took to the floor at 7pm local time on Monday (midnight in the UK), saying he would remain there as long as he was \"physically able\". As of 5pm in the UK, Mr Booker was still going - more than 17 hours after he started. The senator for New Jersey said his goal is to \"uplift the stories of Americans who are being harmed by the Trump administration's reckless actions, attempts to undermine our institutions, and disregard for the rule of law\". Trump latest: Follow live updates During his speech, Mr Booker has only taken brief breaks from speaking, giving the floor instead to questions from his Democratic colleagues, according to Sky News' US partner network, NBC News. According to the rules of the Senate, as long as he stays at the podium Mr Booker will hold the floor - meaning he cannot leave at any point, even to go to the toilet or to eat. So who exactly is the Democratic senator, and what is his multi-hour speech all about? Rising star of Democratic Party  Mr Booker was born in Washington DC and moved to northern New Jersey when he was a boy. He is a graduate of Stanford University and Yale Law and started his career as a lawyer for charities. Entering politics, he was considered a rising star in the Democratic Party. He was elected to serve on the city council of New Jersey's biggest state, Newark, and then as mayor, a position he held until 2013. He was first elected to the US Senate in 2013 during a special election held after the death of politician and businessman Frank Lautenberg. He went on to win his first full term in 2014 and was re-elected in 2020. 2020 presidential bid In February 2019 Mr Booker launched his bid for the US presidency from the steps of his home in Newark. At the time, he played on his personal ties to the \"low-income, inner city community\" and urged for the US to return to a \"common sense of purpose\". He later dropped out of the race after struggling to raise the money required to make a bid for the White House. Why is he speaking in the Senate? By holding the floor in the Senate, Mr Booker is protesting against the Trump administration. Before he began, the senator said he had the intention of \"getting in some good trouble\", NBC News reported. He read letters from constituents about how Mr Trump's cuts were already taking a toll on their lives. As he reached 16 hours of speaking, Mr Booker already had the sixth-longest speech in Senate history. However, he still has a while to go to beat the all-time record for the longest individual speech. According to the Senate's website, this belongs to Strom Thurmond of South Carolina, who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957.  Only one other sitting senator has spoken for longer than Mr Booker. In 2013, Senator Ted Cruz, a Republican from Texas, held the floor for 21 hours and 19 minutes to contest Barack Obama's healthcare reform law. As well as speaking about health law, Mr Cruz's speech made headlines as he read the entirety of the Dr Seuss book Green Eggs And Ham, which he said at the time was a bedtime story to his children. He claimed the US was giving up being a global leader, citing Mr Trump's proposals to take over Greenland and Canada while feuding with longtime allies. He also occasionally took aim at Elon Musk, the richest person in the world, who is advising Mr Trump and leading the Department of Government Efficiency (DOGE). \"In just 71 days, the president of the United States has inflicted so much harm on Americans' safety; financial stability; the core foundations of our democracy,\" Mr Booker said on the floor. \"These are not normal times in America. And they should not be treated as such in the United States Senate.\" Appearing to waver slightly on Tuesday morning, Mr Booker was accompanied by Senator Chris Murphy. In 2016, Mr Booker joined the Connecticut Democrat when he held the floor for almost 15 hours to argue for gun control legislation. Read more:Could Donald Trump run for a third term? Why he is not a filibuster Some reports have referred to Mr Booker's speech as a filibuster, but technically it is not. A filibuster is a speech meant to halt the advance of a specific piece of legislation. Mr Booker's performance is instead a broader critique of Mr Trump's agenda, meant to hold up any business scheduled to take place in the Senate and draw attention to what Democrats are doing to contest the president. Democrats have been forced to use these types of opposition methods as they do not hold a majority in either congressional chamber."
    },
    {
        "title": "Number 10's downplaying of its Chagos win is a sign of Donald Trump's unpredictability",
        "description": "Getting Donald Trump to sign off the Chagos Islands deal is a big win for Number 10 and a vindication of Sir Keir Starmer's softly, softly approach to the unpredictable president.&#160;",
        "url": "https://news.sky.com/story/number-10s-downplaying-of-its-chagos-win-is-a-sign-of-donald-trumps-unpredictability-13339924",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-fuel-tanks-diego-garcia_6704950.jpg?20241003121439",
        "type": "US",
        "Author": "Liz Bates",
        "Date Published": "2025-04-01 16:14:00",
        "Headline": "Donald Trump has signed off the controversial Chagos deal - but you won't hear the government shouting about it, in case the volatile president changes his mind.",
        "Content": "\n          Political correspondent\n              @wizbates\n Getting Donald Trump to sign off the Chagos Islands deal is a big win for Number 10 and a vindication of Sir Keir Starmer's softly, softly approach to the unpredictable president.  So, why is this significant step forward being downplayed by government officials? Getting the prime minister's spokesperson to confirm their achievement became a guessing game that began in the morning and carried on into the afternoon, as journalists attempted to read between the lines of the carefully crafted statement. Politics latest: PM admits cost of living crisis 'ongoing' Asked repeatedly if President Trump had rubber-stamped the plan to hand back Chagos - including the UK-US military base Diaego Garcia - to Mauritius, the same limited response came back. \"We are working with the Mauritian government to finalise the deal and will put it before parliament when it's done.\" The distinct lack of fanfare surely gives us a glimpse into the delicate situation that the government is dealing with in Washington. \n                  'Liberation day is here': But what will it mean for global trade?\n                 \n                  Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours\n                 \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 The calm approach on the surface belies a tension beneath, within which normal diplomatic rules are suspended and things could change drastically with no warning. Read more on Sky News:Private school VAT has had 'damaging effect' on childrenPayouts for departing civil servants capped at £95,000  It may be that in the middle of negotiations over tariffs and other areas of trade, celebrating wins for the UK is deemed imprudent. It may also be that the president's decisions can be overturned on a whim without warning or explanation. Whatever the reason, it's clear that Washington's boldness and swagger is being met with the opposite strategy here - take the wins where you can but don't celebrate if you want to hang on to them."
    },
    {
        "title": "Car manufacturers fined £461m for collusion",
        "description": "Major car manufacturers and two trade bodies are to pay a total of &#163;461m for \"colluding to restrict competition\" over vehicle recycling, UK and European regulators have announced.",
        "url": "https://news.sky.com/story/car-manufacturers-fined-16378m-in-collusion-case-13339902",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-car-scrap_6873128.jpg?20250401171855",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-01 15:39:00",
        "Headline": "The UK's CMA and European Union rule the firms broke the law because they agreed not to compete with each other when advertising what percentage of their cars can be recycled.",
        "Content": "Major car manufacturers and two trade bodies are to pay a total of £461m for \"colluding to restrict competition\" over vehicle recycling, UK and European regulators have announced. The UK's Competition and Markets Authority (CMA) said they illegally agreed not to compete against one another when advertising what percentage of their cars can be recycled. They also colluded to avoid paying third parties to recycle their customers' scrap cars, the watchdog said. Money latest: The many household bills rising today It explained that those involved were BMW, Ford, Jaguar Land Rover, Peugeot Citroen, Mitsubishi, Nissan, Renault, Toyota, Vauxhall and Volkswagen. Mercedes-Benz, was also party to the agreements, the CMA said, but it escaped a financial penalty because the German company alerted it to its participation. The European Automobile Manufacturers' Association (Acea) and the Society of Motor Manufacturers & Traders (SMMT) were also involved in the illegal agreements. \n                  What are Donald Trump's tariffs, what is 'liberation day' and how does it all affect the UK?\n                 \n                  Money blog: Major boost for holidaymakers amid 'Awful April' bill hikes\n                 \n                  Customers 'protected' as household energy supplier exits market\n                 The CMA imposed a combined penalty of almost £78m while the European Commission handed out fines totalling €458m (£382.7m). The penalties were announced at a time of wider turmoil for Europe's car industry. Manufacturers across the continent are bracing for the threatened impact of tariffs on all their exports to the United States as part of Donald Trump's trade war. Within the combined fine settlements of £77.7m issued by the CMA, Ford was to pay £18.5m, VW £14.8m, BMW £11.1m and Jaguar Land Rover £4.6m. Lucilia Falsarella Pereira, senior director of competition enforcement at the CMA, said: \"Agreeing with competitors the prices you'll pay for a service or colluding to restrict competition is illegal and this can extend to how you advertise your products. \"This kind of collusion can limit consumers' ability to make informed choices and lower the incentive for companies to invest in new initiatives. \"We recognise that competing businesses may want to work together to help the environment, in those cases our door is open to help them do so.\""
    },
    {
        "title": "Customers 'protected' as household energy supplier exits market",
        "description": "A household energy supplier has failed, weeks after it attracted attention from regulators.",
        "url": "https://news.sky.com/story/customers-protected-as-household-energy-supplier-exits-market-13339839",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-winter-fuel-payment_6800247.jpg?20250115150939",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-01 14:09:00",
        "Headline": "Rebel Energy, which had been the subject of a provisional compliance order last month, has given no reason for its decision to \"cease trading\".",
        "Content": "A household energy supplier has failed, weeks after it attracted attention from regulators. Rebel Energy, which has around 80,000 domestic customers and 10,000 others, had been the subject of a provisional order last month related to compliance with rules around renewable energy obligations. The company's website said it was \"ceasing to trade\" but gave no reason. Money latest: The many household bills rising today Industry watchdog Ofgem said on Tuesday that those affected by Rebel's demise did not need to take any action and would be \"protected\". Customers, Ofgem said, would soon be appointed a new provider under its supplier of last resort (SoLR) mechanism. This was deployed widely in 2021 when dozens of energy suppliers collapsed while failing to get to grips with a spike in wholesale energy costs. \n                  What are Donald Trump's tariffs, what is 'liberation day' and how does it all affect the UK?\n                 \n                  Money blog: Major boost for holidaymakers amid 'Awful April' bill hikes\n                 \n                  Car manufacturers fined £461m for collusion\n                  The last supplier to go under was in July 2022. Ofgem said new rules governing supplier business practices since then had bolstered resilience. These include minimum capital requirements and the ringfencing of customer credit balances. The exit from the market by Bedford-based Rebel was announced on the same day that the energy price cap rose again to take account of soaring wholesale costs between December and January. Try the Sky News cost of living calculator Tim Jarvis, director general for markets at Ofgem, said: \"Rebel Energy customers do not need to worry, and I want to reassure them that they will not see any disruption to their energy supply, and any credit they may have on their accounts remains protected under Ofgem's rules. \"We are working quickly to appoint new suppliers for all impacted customers. We'd advise customers not to try to switch supplier in the meantime, and a new supplier will be in touch in the coming weeks with further information. \"We have worked hard to improve the financial resilience of suppliers in recent years, implementing a series of rules to make sure they can weather unexpected shocks. But like any competitive market, some companies will still fail from time to time, and our priority is making sure consumers are protected if that happens.\""
    },
    {
        "title": "Harrods challenges survivors' law firm's compensation cut",
        "description": "Harrods is urging lawyers acting for the largest group of survivors of abuse perpetrated by its former owner to reconsider plans to swallow a significant chunk of claimants' compensation payouts in fees.",
        "url": "https://news.sky.com/story/harrods-challenges-survivors8217-law-firm8217s-compensation-cut-13339822",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20241025145441",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-01 13:44:00",
        "Headline": "The Knightsbridge department store is urging KP Law, which is acting for Justice for Harrods victims, to amend the financial terms of its work for victims of Mohamed al Fayed, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods is urging lawyers acting for the largest group of survivors of abuse perpetrated by its former owner to reconsider plans to swallow a significant chunk of claimants' compensation payouts in fees. Sky News has learnt that KP Law, which is acting for hundreds of potential clients under the banner Justice for Harrods, is proposing to take up to 25% of compensation awards in exchange for handling their cases. In many cases, that is likely to mean survivors foregoing sums worth of tens of thousands of pounds to KP Law, which says it is working for hundreds of people who suffered abuse committed by Mohamed al Fayed. Money latest: Boost for holidaymakers amid 'awful April' bill hikes Under a redress scheme outlined by the London-based department store on Monday, which confirmed earlier reports by Sky News, claimants will be eligible for general damages awards of up to £200,000, depending upon whether they agree to a psychiatric assessment arranged by Harrods. In addition, other payments could take the maximum award to an individual under the scheme to £385,000. A document published online names several law firms which have agreed to represent Mr al Fayed's victims without absorbing any of their compensation payments. \n                  Harrods revises compensation payouts for al Fayed abuse victims\n                 \n                  Harrods proposes six-figure payouts to victims of al Fayed abuse\n                 \n                  Former Harrods employee accuses Mohamed al Fayed and his brother Salah of assaulting her in 1990s\n                 KP Law is not among those firms. Theoretically, if Justice for Harrods members are awarded compensation in excess of the sums proposed by the company, KP Law could stand to earn many millions of pounds from its share of the payouts.  A Harrods spokesperson told Sky News on Tuesday: \"The purpose of the Harrods Redress Scheme is to offer financial and psychological support to those who choose to enter the scheme, rather than as a route to criminal justice. \"With a survivor-first approach, it has been designed by personal injury experts with the input of several legal firms currently representing survivors. \"Although Harrods tabled the scheme, control of the claim is in the hands of the survivors who can determine at any point to continue, challenge, opt out or seek alternative routes such as mediation or litigation. \"Our hope is that everyone receives 100% of the compensation awarded to them but we understand there is one exception among these law firms currently representing survivors who is proposing to take up to 25% of survivors' compensation. \"We hope they will reconsider given we have already committed to paying reasonable legal costs.\"  Responding to the publication of the scheme on Monday, KP Law criticised it as inadequate, saying it \"does not go far enough to deliver the justice and accountability demanded by our clients\". \"This is not solely a question of compensation but about justice and exposing the systematic abuse and the many people who helped to operate it for the benefit of Mohamed al Fayed and others.\" Seeking to rebut the questions raised by Harrods about its fee structure, KP Law told Sky News: \"KP Law is committed to supporting our clients through the litigation process to obtain justice first and foremost as well as recovering the maximum possible damages for them. \"This will cover all potential outcomes for the case. \"Despite the Harrods scheme seeking to narrow the potential issues, we believe that there are numerous potential defendants in a number of jurisdictions that are liable for what our clients went through, and we are committed to securing justice for our client group. \"KP Law is confident that it will recover more for its clients than what could be achieved through the redress scheme established by Harrods, which in our view is inadequate and does not go far enough to compensate victims of Mr al Fayed.\" The verbal battle between Harrods and KP Law underlines the fact that the battle for compensation and wider justice for survivors of Mr al Fayed remains far from complete. The billionaire, who died in 2023, is thought to have sexually abused hundreds of women during a 25-year reign of terror at Harrods. He also owned Fulham Football Club and Paris's Ritz Hotel. Harrods is now owned by a Qatari sovereign wealth fund controlled by the Gulf state's ruling family. The redress scheme commissioned by the department store is being coordinated by MPL Legal, an Essex-based law firm. Last October, lawyers acting for victims of Mr al Fayed said they had received more than 420 enquiries about potential claims, although it is unclear how many more have come forward in the six months since."
    },
    {
        "title": "Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs",
        "description": "Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-us-uk-trade-talks-well-advanced-and-rejects-knee-jerk-response-to-trump-tariffs-13339613",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841895.png?20250228063409",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-01 08:10:00",
        "Headline": "Donald Trump is expected to impose tariffs on \"all countries\" from Wednesday but Downing Street has admitted its negotiations have so far not managed to halt them.",
        "Content": " Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response. Speaking to Sky News political editor Beth Rigby, the prime minister said the UK is \"working hard on an economic deal\" with the US and said \"rapid progress\" has been made on it ahead of tariffs expected to be imposed on Wednesday. But, he admitted: \"Look, the likelihood is there will be tariffs. Nobody welcomes that, nobody wants a trade war. \"But I have to act in the national interest and that means all options have to remain on the table.\" Politics latest: Ministers hail 'huge' minimum wage boost as bills rise Sir Keir added: \"We are discussing economic deals. We're well advanced. \"These would normally take months or years, and in a matter of weeks, we've got well advanced in those discussions, so I think that a calm approach, a collected approach, not a knee-jerk approach, is what's needed in the best interests of our country.\" \n                  'Liberation day is here': But what will it mean for global trade?\n                 \n                  Number 10's downplaying of its Chagos win is a sign of Donald Trump's unpredictability\n                 \n                  Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours\n                 Downing Street said on Monday the UK is expecting to be hit by new US tariffs on Wednesday - branded \"liberation day\" by the US president - as a deal to exempt British goods would not be reached in time. A 25% levy on car and car parts had already been announced but the new tariffs are expected to cover all exports to the US. Jonathan Reynolds, the business and trade secretary, earlier told Sky News he is \"hopeful\" the tariffs can be reversed soon. But he warned: \"The longer we don't have a potential resolution, the more we will have to consider our own position in relation to [tariffs], precluding retaliatory tariffs.\" He added the government was taking a \"calm-headed\" approach in the hope a deal can be agreed but said it is only \"reasonable\" retaliatory tariffs are an option, echoing Sir Keir's sentiments over the weekend. Read more:Why a figure of 48% is important as Trump tariffs nearStarmer and Trump discuss US-UK 'prosperity' deal Tariff announcement on Wednesday Mr Trump has been threatening tariffs - import taxes - on countries with the biggest trade imbalances with the US. However, over the weekend, he suggested the tariffs would hit all countries, but did not name them or reveal which industries would be targeted. Read more: How Trump's tariffs could affect the UK  Mr Trump will unveil his tariff plan on Wednesday afternoon at the first Rose Garden news conference of his second term, the White House press secretary said. \"Wednesday, it will be Liberation Day in America, as President Trump has so proudly dubbed it,\" Karoline Leavitt said. \"The president will be announcing a tariff plan that will roll back the unfair trade practices that have been ripping off our country for decades. He's doing this in the best interest of the American worker.\"  Tariffs would cut UK economy by 1% UK government forecaster the Office for Budget Responsibility (OBR) said a 20 percentage point increase in tariffs on UK goods and services would cut the size of the British economy by 1% and force tax rises this autumn. Global markets remained flat or down on Monday in anticipation of the tariffs, with the FTSE 100 stock exchange trading about 1.3% lower on Monday, closing with a 0.9% loss. On Wall Street, the S&P 500 rose 0.6% after a volatile day which saw it down as much as 1.7% in the morning. However, the FTSE 100 is expected to open about 0.4% higher on Tuesday, while Asian markets also steadied, with Tokyo's Nikkei 225 broadly unchanged after a 4% slump yesterday."
    },
    {
        "title": "Former parliamentary watchdog pitches for football regulator job",
        "description": "The first chair of the parliamentary watchdog established after the MPs expenses scandal is in the frame to become the inaugural head of English football's new regulator.",
        "url": "https://news.sky.com/story/former-parliamentary-watchdog-pitches-for-football-regulator-job-13339680",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-sir-keir-starmer-manchester-city_6690094.jpg?20240919114647",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-01 09:20:00",
        "Headline": "Professor Sir Ian Kennedy, who chaired IPSA until 2016, is among the candidates being considered by government officials as the inaugural chair of the Independent Football Regulator, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The first chair of the parliamentary watchdog established after the MPs expenses scandal is in the frame to become the inaugural head of English football's new regulator. Sky News has learnt that Professor Sir Ian Kennedy, who chaired the Independent Parliamentary Standards Authority (IPSA) between 2009 and 2016, is among a small number of candidates being considered in Whitehall to chair the Independent Football Regulator (IFR). Professor Sir Ian, who is in his 80s and has led a string of public inquiries and government-commissioned reviews, is emeritus professor of health law, ethics and policy at University College London. Money blog: Most household bills rising today Government insiders said he had been shortlisted because of his lengthy credentials as a regulator. Last month, Sky News revealed that Christian Purslow, the former chief executive of Aston Villa and Liverpool football clubs, and Sanjay Bhandari, who chairs the football anti-racism charity Kick It Out, are also in the frame for the Manchester-based position. In recent weeks, there have been suggestions in media reports that Sir Keir Starmer is preparing to pare back the powers of the new football regulator amid a broader curtailment of regulation as a means of jumpstarting the economy. \n                  What are Donald Trump's tariffs, what is 'liberation day' and how does it all affect the UK?\n                 \n                  Money blog: Major boost for holidaymakers amid 'Awful April' bill hikes\n                 \n                  Car manufacturers fined £461m for collusion\n                 Both 10 Downing Street and the Department for Culture, Media and Sport (DCMS) have sought to dismiss the speculation, with insiders instating that the IFR will be established as originally envisaged. The establishment of the regulator, whose chair will be paid £130,000 a year, is among the principal elements of legislation progressing through parliament. The Football Governance Bill has just completed its journey through the House of Lords and will be introduced in the Commons shortly, according to a DCMS spokesman. The establishment of the regulator, which was conceived by the previous Conservative government in the wake of the furore over the failed European Super League project, has triggered deep unrest in English football. Steve Parish, the chairman of Premier League side Crystal Palace, told a recent sports industry conference that the watchdog \"wants to interfere in all of the things we don't need them to interfere in and help with none of the things we actually need help with\". \"We have a problem that we're constantly being told that we're not a business and [that] we're part of the fabric of communities,\" he is reported to have said. \"At the same time, we're...being treated to the nth degree like a business.\" Interviews for the chair of the football regulator took place in November, with a previous recruitment process curtailed by the calling of last year's general election. Lisa Nandy, the culture secretary, will sign off on the appointment of a preferred candidate, with the chosen individual expected to face a pre-appointment hearing in front of the Commons culture, media and sport select committee. It forms part of a process that represents the most fundamental shake-up in the oversight of English football in the game's history. The establishment of the body comes with the top tier of the professional game wracked by civil war, with Abu Dhabi-owned Manchester City at the centre of a number of legal cases over its financial dealings. The government has dropped a previous stipulation that the regulator should have regard to British foreign and trade policy when determining the appropriateness of a new club owner. \"We do not comment on speculation,\" the DCMS said on Tuesday when asked by Sky News about Professor Sir Ian's candidacy to chair the football watchdog. \"No appointment has been made and the recruitment process for [IFR] chair is ongoing.\""
    },
    {
        "title": "Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife",
        "description": "Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.&#160;",
        "url": "https://news.sky.com/story/planning-reforms-to-rewire-the-system-and-get-britain-building-all-while-protecting-wildlife-13340010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bat-cave-tunnel-hs2_6825202.jpg?20250211053130",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-04-01 19:29:00",
        "Headline": "A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Major developers will only deal with one regulator under planning reforms which ministers say will \"rewire the system\" to get Britain building - all while protecting the environment.  A review by former Labour adviser Dan Corry into Britain's sluggish system of green regulation has concluded that existing environmental regulators should remain in place, while rejecting a \"bonfire of regulations\". But Mr Corry suggested there might be circumstances in which the government look at changing the wildlife and habit rules inherited from the EU, which protect individual species. Politics latest: Follow live updates These lie at the centre of the controversy of a £120m bat tunnel - the shed in Aylesbury which protects a rare breed from future high speed trains. Keir Starmer has declared war on £100m HS2 bat shed - but has he got a solution?New planning bill could be the government's most important - but will it work in practice? The government has now explicitly ruled out any such change in this parliament. \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 \n                  Payouts for departing civil servants capped at £95,000 under voluntary exit scheme\n                 \n                  Politics latest: Trump's tariffs 'a nightmare' for the UK - but Starmer could benefit from carve outs\n                 Campaigners have questioned whether the changes go far enough and will make a major difference to the rate and scale of building in the UK. Speaking to Sky News, Environment Secretary Steve Reed insisted that accepting nine of the recommendations from the Corry review would amount to wholesale reform. The minister said: \"We can get a win-win for economic growth and for nature. And that is why we are moving ahead with proposals such as appointing a lead regulator for major developments so that the developers don't have to navigate the architecture of multiple regulators. \"They just work for a single regulator who manages all the others on their behalf. Simplifying the online planning portal. \"These are huge changes that will save developers billions of pounds and speed up decisions doing damage to the environment.\" Mr Reed insisted that there would be \"no more bat tunnels\" built, even though the Corry review suggests that more work needs to be done to look again at the relevant guidance. It says: \"Rapidly reviewing the existing catalogue of compliance guidance, including on protecting bats, will identify opportunities to remove duplication, ambiguity or inconsistency. \"Natural England has already agreed to review and update their advice to Local Planning Authorities on bats to ensure there is clear, proportionate and accessible advice available.\" The review will mean: • Appointing one lead regulator for every major infrastructure project, like Heathrow expansion • A review on how nature rules are implemented - but not the rules themselves • Insisting regulators focus more on government priorities, particularly growth Economist and former charity leader Mr Corry, who led the review, said it shows that \"simply scrapping regulations isn't the answer\". \"Instead we need modern, streamlined regulation that is easier for everyone to use. While short-term trade-offs may be needed, these reforms will ultimately deliver a win-win for both nature and economic growth in the longer run.\" However, Sam Richards from Britain Remade, a thinktank trying to get Britain growing, said that while the steps are welcome, the number of regulators that report to the environment department would remain the same before and after the review. He questioned whether this would have the impact ministers claimed."
    },
    {
        "title": "Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs",
        "description": "Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-us-uk-trade-talks-well-advanced-and-rejects-knee-jerk-response-to-trump-tariffs-13339613",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841895.png?20250228063409",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-01 08:10:00",
        "Headline": "Donald Trump is expected to impose tariffs on \"all countries\" from Wednesday but Downing Street has admitted its negotiations have so far not managed to halt them.",
        "Content": " Sir Keir Starmer has said US-UK trade talks are \"well advanced\" ahead of tariffs expected to be imposed by Donald Trump on the UK this week - but rejected a \"knee-jerk\" response. Speaking to Sky News political editor Beth Rigby, the prime minister said the UK is \"working hard on an economic deal\" with the US and said \"rapid progress\" has been made on it ahead of tariffs expected to be imposed on Wednesday. But, he admitted: \"Look, the likelihood is there will be tariffs. Nobody welcomes that, nobody wants a trade war. \"But I have to act in the national interest and that means all options have to remain on the table.\" Politics latest: Ministers hail 'huge' minimum wage boost as bills rise Sir Keir added: \"We are discussing economic deals. We're well advanced. \"These would normally take months or years, and in a matter of weeks, we've got well advanced in those discussions, so I think that a calm approach, a collected approach, not a knee-jerk approach, is what's needed in the best interests of our country.\" \n                  'Liberation day is here': But what will it mean for global trade?\n                 \n                  Number 10's downplaying of its Chagos win is a sign of Donald Trump's unpredictability\n                 \n                  Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours\n                 Downing Street said on Monday the UK is expecting to be hit by new US tariffs on Wednesday - branded \"liberation day\" by the US president - as a deal to exempt British goods would not be reached in time. A 25% levy on car and car parts had already been announced but the new tariffs are expected to cover all exports to the US. Jonathan Reynolds, the business and trade secretary, earlier told Sky News he is \"hopeful\" the tariffs can be reversed soon. But he warned: \"The longer we don't have a potential resolution, the more we will have to consider our own position in relation to [tariffs], precluding retaliatory tariffs.\" He added the government was taking a \"calm-headed\" approach in the hope a deal can be agreed but said it is only \"reasonable\" retaliatory tariffs are an option, echoing Sir Keir's sentiments over the weekend. Read more:Why a figure of 48% is important as Trump tariffs nearStarmer and Trump discuss US-UK 'prosperity' deal Tariff announcement on Wednesday Mr Trump has been threatening tariffs - import taxes - on countries with the biggest trade imbalances with the US. However, over the weekend, he suggested the tariffs would hit all countries, but did not name them or reveal which industries would be targeted. Read more: How Trump's tariffs could affect the UK  Mr Trump will unveil his tariff plan on Wednesday afternoon at the first Rose Garden news conference of his second term, the White House press secretary said. \"Wednesday, it will be Liberation Day in America, as President Trump has so proudly dubbed it,\" Karoline Leavitt said. \"The president will be announcing a tariff plan that will roll back the unfair trade practices that have been ripping off our country for decades. He's doing this in the best interest of the American worker.\"  Tariffs would cut UK economy by 1% UK government forecaster the Office for Budget Responsibility (OBR) said a 20 percentage point increase in tariffs on UK goods and services would cut the size of the British economy by 1% and force tax rises this autumn. Global markets remained flat or down on Monday in anticipation of the tariffs, with the FTSE 100 stock exchange trading about 1.3% lower on Monday, closing with a 0.9% loss. On Wall Street, the S&P 500 rose 0.6% after a volatile day which saw it down as much as 1.7% in the morning. However, the FTSE 100 is expected to open about 0.4% higher on Tuesday, while Asian markets also steadied, with Tokyo's Nikkei 225 broadly unchanged after a 4% slump yesterday."
    },
    {
        "title": "Payouts for departing civil servants capped at £95,000 under voluntary exit scheme",
        "description": "The most senior and long-serving civil servants could be offered a maximum of &#163;95,000 to quit their jobs as part of a government efficiency drive.",
        "url": "https://news.sky.com/story/payouts-for-departing-civil-servants-capped-at-16395000-under-voluntary-exit-scheme-13339835",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-whitehall-civil-service_6773916.jpg?20241212090449",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-04-01 14:16:00",
        "Headline": "Departing staff will be offered the maximum amount as the government looks to reduce department headcount in a bid to cut costs.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n The most senior and long-serving civil servants could be offered a maximum of £95,000 to quit their jobs as part of a government efficiency drive. Sky News reported last week that several government departments had started voluntary exit schemes for staff in a bid to make savings, including the Department for Environment and Rural Affairs, the Foreign Office and the Cabinet Office. The Department for Health and Social Care and the Ministry of Housing and Local Government have yet to start schemes but it is expected they will, with the former already set to lose staff following the abolition of NHS England that was announced earlier this month. Politics latest: PM admits cost of living crisis 'ongoing' Rachel Reeves, the chancellor, confirmed in last week's spring statement that the government was setting aside £150m to fund the voluntary exit schemes, which differ from voluntary redundancy in that they offer departments more flexibility around the terms offered to departing staff. Ms Reeves said the funding would enable departments to reduce staffing numbers over the next two years, creating \"significant savings\" on staff employment costs. A maximum limit for departing staff is usually set at one month per year of service capped at 21 months of pay or £95,000. \n                  Planning reforms to 'rewire the system' and get Britain building - all while protecting wildlife\n                 \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 \n                  Politics latest: Trump's tariffs 'a nightmare' for the UK - but Starmer could benefit from carve outs\n                 Whitehall sources stressed the figure was \"very much the maximum that could be offered\" given that the average civil service salary is just over £30,000 per year. Whitehall departments will need to bid for the money provided at the spring statement and match the £150m from their own budgets, bringing the total funding to £300m.  The Cabinet Office is understood to be targeting 400 employees in a scheme that was announced last year and will continue to run over this year. A spokesman said each application to the scheme would be examined on a case-by-case basis to ensure \"we retain critical skills and experience\". It is up to each government department to decide how they operate their scheme. The voluntary exit schemes form part of the government's ambition to reduce bureaucracy and make the state more efficient amid a gloomy economic backdrop. Ahead of the spring statement, Ms Reeves announced plans to cut civil service running costs by 15% by 2030, which ministers have said will save £2.2bn. Read more from Sky News:Sentencing guidelines for ethnic minority suspects delayedMajor incident declared as '17,000 tonnes' of rubbish piles up The move could result in 10,000 civil service jobs being axed after numbers ballooned during the pandemic. Ms Reeves hopes the cuts, which she said will be to \"back office jobs\" rather than frontline services, but civil service unions have raised concerns that government departments will inevitably lose skilled and experienced staff. The cuts form part of a wider government agenda to streamline the civil service and the size of the British state, which Sir Keir Starmer criticised as \"weaker than it has ever been\". During the same speech, he announced that NHS England, the administrative body that runs the NHS, would also be scrapped to eliminate duplication and cut costs."
    },
    {
        "title": "Number 10's downplaying of its Chagos win is a sign of Donald Trump's unpredictability",
        "description": "Getting Donald Trump to sign off the Chagos Islands deal is a big win for Number 10 and a vindication of Sir Keir Starmer's softly, softly approach to the unpredictable president.&#160;",
        "url": "https://news.sky.com/story/number-10s-downplaying-of-its-chagos-win-is-a-sign-of-donald-trumps-unpredictability-13339924",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-fuel-tanks-diego-garcia_6704950.jpg?20241003121439",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-04-01 16:14:00",
        "Headline": "Donald Trump has signed off the controversial Chagos deal - but you won't hear the government shouting about it, in case the volatile president changes his mind.",
        "Content": "\n          Political correspondent\n              @wizbates\n Getting Donald Trump to sign off the Chagos Islands deal is a big win for Number 10 and a vindication of Sir Keir Starmer's softly, softly approach to the unpredictable president.  So, why is this significant step forward being downplayed by government officials? Getting the prime minister's spokesperson to confirm their achievement became a guessing game that began in the morning and carried on into the afternoon, as journalists attempted to read between the lines of the carefully crafted statement. Politics latest: PM admits cost of living crisis 'ongoing' Asked repeatedly if President Trump had rubber-stamped the plan to hand back Chagos - including the UK-US military base Diaego Garcia - to Mauritius, the same limited response came back. \"We are working with the Mauritian government to finalise the deal and will put it before parliament when it's done.\" The distinct lack of fanfare surely gives us a glimpse into the delicate situation that the government is dealing with in Washington. \n                  'Liberation day is here': But what will it mean for global trade?\n                 \n                  Democrat Cory Booker rails against Trump and Musk in record-breaking Senate speech lasting more than 24 hours\n                 \n                  Sir Keir Starmer says US-UK trade talks 'well advanced' and rejects 'knee-jerk' response to Donald Trump tariffs\n                 The calm approach on the surface belies a tension beneath, within which normal diplomatic rules are suspended and things could change drastically with no warning. Read more on Sky News:Private school VAT has had 'damaging effect' on childrenPayouts for departing civil servants capped at £95,000  It may be that in the middle of negotiations over tariffs and other areas of trade, celebrating wins for the UK is deemed imprudent. It may also be that the president's decisions can be overturned on a whim without warning or explanation. Whatever the reason, it's clear that Washington's boldness and swagger is being met with the opposite strategy here - take the wins where you can but don't celebrate if you want to hang on to them."
    },
    {
        "title": "Step to legally prevent new 'two-tier' sentencing guidelines begins today, justice secretary says",
        "description": "A bill to legally prevent new sentencing guidelines on how ethnic minority criminals should be punished will be introduced today, the justice secretary said.",
        "url": "https://news.sky.com/story/step-to-legally-prevent-new-two-tier-sentencing-guidelines-begins-today-justice-secretary-says-13339855",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-shabana-mahmood-downing-street_6867257.jpg?20250326090547",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-01 14:50:00",
        "Headline": "Guidance, which had been due to come into effect today, said judges should request pre-sentence reports, which can influence sentences, for criminals from ethnic, cultural or faith minorities.",
        "Content": "A bill to legally prevent new sentencing guidelines on how ethnic minority criminals should be punished will be introduced today, the justice secretary said. Shabana Mahmood told MPs in the House of Commons the Sentencing Guidelines (Pre-sentence reports) Bill would be presented on Tuesday to stop the guidance coming into effect. The independent Sentencing Council said a pre-sentence report, the results of which are taken into account when considering a criminal's sentence, will \"usually be necessary\" before handing out punishment for someone from an ethnic, cultural or faith minority. Politics latest: PM admits cost of living crisis 'ongoing' However, Ms Mahmood called the guidance \"unacceptable\" and said it amounted to \"differential treatment before the law\" as she urged the council to reverse it. The council refused so she said she would legislate to overturn the guidance - which is what she is now doing.  After Downing Street said on Monday the government planned to introduce legislation on Tuesday and to push it through quickly, the Sentencing Council suspended the guidance, due to come in today. \n                  How Elon Musk took over British politics\n                 \n                  Previous govt 'wasted' £15m on asbestos-contaminated derelict prison to house asylum seekers\n                 \n                  What 'truths' will Kemi Badenoch be telling?\n                 Ms Mahmood also announced on Tuesday the government would carry out a review of the Sentencing Council \"in the coming months\". \"Should further legislation be required, I shall propose it as part of the upcoming Sentencing Bill,\" she added. The justice secretary acknowledged the council \"holds an important position\" within the justice system. She also said pre-sentence reports are \"an incredibly vital tool for judges before passing sentence\". Read more:Are you in the right cabinet gang?Starmer says US-UK trade talks 'well advanced' Conservative justice secretary Robert Jenrick claimed magistrates and judges were only informed of the guidance suspension at midday, so said some may have used the guidance in sentencing that morning. He accused Ms Mahmood of having \"completely lost control of the justice system\" and said her \"incompetence took this down to the wire\". But she dismissed his criticisms, saying he had never raised these issues while in government and said communication of the suspension was up to the Sentencing Council. Mr Jenrick had previously called the guidance \"two-tier justice\" as he said it would lead to \"blatant bias\" against Christians and straight white men. He also argued that it would make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\" - something the council denied."
    },
    {
        "title": "VAT on private school fees has had 'damaging effect' on children, court hears",
        "description": "Several private schools, as well as some pupils and their parents, have launched a legal challenge over the government imposing VAT on private schools.",
        "url": "https://news.sky.com/story/vat-on-private-school-fees-has-had-damaging-effect-on-children-court-hears-13339764",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-education-vat-private-schools_6872910.jpg?20250401123019",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-01 11:22:00",
        "Headline": "The claimants say the policy threatens their children's access to suitable education, particularly for those with complex special educational needs and disabilities.",
        "Content": "Several private schools, as well as some pupils and their parents, have launched a legal challenge over the government imposing VAT on private schools. The claimants, which include children and families at faith schools and families who have sent their children with special educational needs (SEN) to private school, are taking the legal action against the Treasury. They claim the policy of applying VAT to fees is discriminatory and a breach of human rights law. The Treasury is defending the challenges, with HMRC and the Department for Education (DfE) also taking part. Dozens of supporters of the challenge appeared at the High Court in London for the first day of the hearing on Tuesday. Lord David Pannick KC, representing one group of children and their parents, said that for some children currently in private schools, their needs are not met by state schools in their area, or at all, but the new law applies \"irrespective\" of a family's need. \"The application of the law does have a damaging effect on individual children and their families,\" he added. \n                  Zhenhao Zou: More than 20 new potential victims come forward after 'prolific' rapist jailed for assaulting 10 women\n                 \n                  Royal Navy warship takes out air and sea drones in 'realistic' exercise\n                 \n                  Girl, 11, who went missing after entering River Thames named\n                 As well as religious beliefs and SEN, the High Court was told some children are privately educated because of a need for a single-sex environment because of previous abuse, or because they are only temporarily in the UK and need to be educated in line with their home national curriculum. Jeremy Hyam KC, representing two children with SEN in private schools, told the court that at least 35,000 children could be displaced from private schools and into state institutions because of increased costs. He continued in written submissions: \"That displacement will have a particularly prejudicial impact for displaced SEN children compared with those entering the state sector who do not have SEN.\" He said that provision for SEN pupils in the state system \"is in crisis\" and that the transition \"is likely to have a highly detrimental effect\" on pupils who have to move schools. Read more from Sky News:Three people die in crash near HeathrowUK to be hotter than Greece and Spain'Extensive' search for girl, 11, who fell into Thames Bruno Quintavalle, representing four small Christian schools and parents who have sent their children to them, said the \"ill thought-out proposal introduced in haste\" placed parents in \"impossible positions\". He said in written submissions: \"The small independent schools that are likely to suffer most from this are those that serve minority religious communities.\" He continued: \"The claimant parents are not prepared to send their children to state schools, because the secular education provided by the state sector would oblige the children to be educated in a way contrary to the parents' religious convictions or would otherwise expose their children to risks which they cannot in conscience assume.\" But Sir James Eadie KC, representing the Treasury, HMRC and the DfE, said abolishing the VAT exemption for private school fees was a prominent feature of Labour's manifesto at the last general election and is expected to yield between £1.5bn and £1.7bn per year. He continued in written submissions: \"Parents wishing to opt out of the system of universally accessible state-funded education are free to choose any private education for their child that they can afford, or to educate their child at home. \"The fact that measures of general application, such as taxes, minimum wage laws, national insurance, etc, affect the cost of providing such a service, and therefore its purchase price, does not make those measures an interference with freedom to offer or receive private education.\" The hearing before Dame Victoria Sharp, Lord Justice Newey and Mr Justice Chamberlain is due to conclude on Thursday. A decision is expected in writing at a later date."
    },
    {
        "title": "Are you in the right cabinet gang?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>   ",
        "url": "https://news.sky.com/story/are-you-in-the-right-cabinet-gang-13339590",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-01 05:56:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy look ahead to the day in British politics. There's a cabinet meeting this morning - so it's a good time to discuss the dynamics around that table and why who is in what WhatsApp group matters. And what are the potential repercussions of one gang being in favour and another being out of favour? Meanwhile, as Donald Trump's tariffs \"liberation day\" looms, what sort of expectation management is the UK government conducting? Are ministers having to water down some of their more hopeful signals on what deal they'll get?"
    },
    {
        "title": "Bitcoin tycoon Chun Wang blasts off on polar SpaceX flight to achieve world first",
        "description": "A Bitcoin tycoon has blasted off on a SpaceX rocket in what is the first manned spacecraft to circle Earth over the North and South poles.",
        "url": "https://news.sky.com/story/bitcoin-tycoon-chun-wang-blasts-off-on-polar-spacex-flight-to-achieve-world-first-13339726",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-spacex-space_6872865.jpg?20250401113726",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-01 10:18:00",
        "Headline": "The quartet of space tourists will get a unique view of Earth's poles as they repeatedly orbit nearly 300 miles above the planet.",
        "Content": "A Bitcoin tycoon has blasted off on a SpaceX rocket in what is the first manned spacecraft to circle Earth over the North and South poles. The fully automated Dragon capsule will take about 46 minutes to fly its pole-to-pole trajectory and roughly 90 minutes to go around the Earth completely. It launched from Kennedy Space Centre in Florida on Monday night on SpaceX's sixth private mission - and is now orbiting 272 miles above Earth at 17,000mph. China-born Chun Wang, who made his fortune mining Bitcoin, paid an undisclosed amount for the bespoke mission. However, a spot in the reusable Dragon spacecraft reportedly cost $55m (£42m) per seat. Mr Wang, who is bankrolling the trip, has taken along three friends. German robotics researcher Rabea Rogge, Norwegian filmmaker Jannicke Mikkelsen, and Australian polar guide Eric Philips are also on board. The crew will conduct 22 experiments, including the first human X-rays in space and growing mushrooms in microgravity, during a trip of between three and five days. \n                  First orbital rocket launched from Europe crashes into sea - but company says test 'met all expectations'\n                 \n                  British-built Mars rover stuck on Earth could soon be on its way to the Red Planet\n                 \n                  NASA news conference as astronauts return to Earth after months in space\n                 No space traveller has - until now - gone beyond 65 degrees latitude north and south - just shy of the Arctic and Antarctic Circles. The first woman in space, the Soviet Union's Valentina Tereshkova, set that mark in 1963. Mikkelsen also flew the route , but at a much lower altitude in a Gulfstream jet, in 2019. Read more from Sky News:NASA astronaut 'partly to blame' for getting strandedEclipse chasers in awe as moon takes a nibble from the sun The mission is named Fram2, a nod to a pioneering Norwegian polar research ship from more than 100 years ago. As the space tourists headed to the launchpad under police escort, they also witnessed SpaceX launching another Falcon 9 rocket in an unrelated mission for the Starlink internet project. \"We're gonna watch a rocket launch while on our way to a rocket launch,\" Wang wrote on X. He said he had scheduled the space trip to be his 1,000th total flight as he tries to complete an ambition to visit every country on Earth."
    },
    {
        "title": "Campaigners say analysis shows illegal sewage spills in Lake Windermere reach record levels",
        "description": "Sewage was illegally poured into the Lake District's famous Lake Windermere for a record number of days last year, campaigners say, citing new analysis.",
        "url": "https://news.sky.com/story/campaigners-say-analysis-shows-illegal-sewage-spills-in-lake-windermere-reach-record-levels-13339669",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lake-windermere-uk_6872802.jpg?20250401102411",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-01 08:58:00",
        "Headline": "Campaigners want water company United Utilities to be taken to court over sewage spills in Lake Windermere.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Sewage was illegally poured into the Lake District's famous Lake Windermere for a record number of days last year, campaigners say, citing new analysis. They looked at official data released by United Utilities to identify times the water company had released untreated sewage into England's longest lake, when legally it should have been treating some of it. The Save Windermere and Windrush Against Sewage Pollution (WASP) groups counted 140 days of what they deemed illegal spills in 2024 across six sites on the lake. This was more than the previous record of 110 days in 2023, and higher than in any other of the three previous years, Professor Peter Hammond from WASP found. United Utilities disputed the findings, saying some of the data was \"erroneous\" and that the method was different to that used by the regulator. The company has earmarked £200m of investment to treat wastewater more thoroughly and stem the flow of the six overflow sites in question. The news comes as water bills in England and Wales rise by an average of £10 per month. United Utilities customers are set to pay 23% more than they were. \n                  Water bills in England and Wales to rise by average of £10 per month\n                 \n                  Thames Water sewage spills spike as crucial bill decision looms\n                 \n                  Environment secretary Steve Reed 'didn't know' company that gave him £1,700 football ticket was linked to water firm\n                 Water companies are allowed to release untreated sewage into waterways when the network risks being overwhelmed, to avoid sewage backing up into people's homes.  The campaigners say United Utilities discharged sewage into the lake before that threshold had been breached. Other water companies in the country have faced similar accusations. Last week, Environment Secretary Steve Reed said the amount of sewage being dumped into English rivers remained \"disgraceful\", despite some improvements. Campaigners call for legal action Matt Staniek, founder of Save Windermere, said: \"What's happened in Windermere is clear: shareholder profits have been prioritised over the ecological health of one of our most iconic and culturally important landscapes. \"Bill-payers are being forced to cover the cost of a broken privatised system, yet even now, the proposed investment falls short of what's needed.\" The group is calling for United Utilities to be prosecuted. England's Lake District is designated a UNESCO World Heritage Site, based on the \"universal value\" of its scenic landscape that \"everyone has a right to appreciate and enjoy\". But the landscape has turned bright green as algal blooms, fuelled by the nutrients in large sewage releases, swamp the waters, campaigners say. United Utilities declined to provide more accurate figures when asked by Sky News, but said the campaigners had wrongly labelled spills at one of the sites, Ambleside, as illegal when the site had in fact complied with its permit. A spokesperson said they were \"extremely disappointed\" that the campaigners \"refused the opportunity to talk through the data so that they can get a better understanding of it\". \"The methodology used by the campaigners is different to that used by the Environment Agency for its compliance assessments. \"On top of that, erroneous data has been used, tags and naming conventions in data sets appear to have been misunderstood, and assumptions seem to have been made on whether different types of flow meters have been installed. \"The methodology fails to use other corroborating information from the sites which would prove that spills did not occur. As a result, the numbers quoted are inaccurate.\" \"We're committed to playing our part in continuing to improve the water quality in Windermere.\" It previously invested £75m to cut the amount of phosphorus entering the lake, which has cut the duration of such spills by 28% in the last year, they added."
    },
    {
        "title": "Stalker who believed Strictly Come Dancing judge Shirley Ballas was his aunt avoids jail",
        "description": "A man who stalked Strictly Come Dancing judge Shirley Ballas for six years has avoided jail.",
        "url": "https://news.sky.com/story/stalker-who-believed-strictly-come-dancing-judge-shirley-ballas-was-his-aunt-avoids-jail-13339783",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shirley-ballas_6872996.jpg?20250401135626",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-01 13:40:00",
        "Headline": "The judge said the stalking stemmed from Shaw's mother telling him in his teens that Ballas's brother was his father.",
        "Content": "A man who stalked Strictly Come Dancing judge Shirley Ballas for six years has avoided jail. Kyle Shaw, 37, got a 20-month suspended sentence and a lifetime restraining order on contacting Ballas, her mother, niece, and former partner. Liverpool Crown Court heard that he thought Ballas was his aunt and \"began a persistent campaign of contact\". \"He believed, and it's evident from what he was told by his mother, that her late brother was his father,\" said prosecutor Nicola Daley. The court heard there was no evidence he was wrong, and \"limited evidence\" he was correct. Ms Daley said Shaw's messages had accused Ballas of being to blame for the death of her brother, who took his own life in 2003 aged 44. He also set up social media accounts in his name. Shaw had pleaded guilty to stalking the former dancer between August 2017 and November 2023 at a hearing in February. Incidents included following Ballas's 86-year-old mother, Audrey Rich, while she was shopping and telling her she was his grandmother. The court heard in messages to Mrs Rich, Shaw had asked: \"Where's my dad?\" Ballas was so worried for her mother's safety that she moved her from Merseyside to London. In October 2020, Ballas called police after Shaw messaged her and said: \"Do you want me to kill myself, Shirley?\" Posts on X included one alongside an image of her home address that warned: \"You ruined my life, I'll ruin yours and everyone's around you.\" Another referenced a book signing and said: \"I can't wait to meet you for the first time Aunty Shirley. Hopefully I can get an autograph.\" The court was told Ballas's niece Mary Assall, former partner Daniel Taylor and colleagues from Strictly Come Dancing and ITV's Loose Women were also sent messages. 'I know where you live' On one occasion in late 2023, Shaw called Mr Taylor and told him he knew where the couple lived and described Ballas's movements. The court heard the 64-year-old TV star become wary of socialising and stopped using public transport. Prosecutor Ms Daley said: \"She described having sleepless nights worrying about herself and her family's safety and being particularly distressed when suggestions were made to her that she and her mother were responsible for her brother taking his own life.\" Shaw cried and wiped away tears as he was sentenced on Tuesday. The judge said the stalking stemmed from his mother telling him Ballas's brother, David Rich, was his biological father. \"I'm satisfied that your motive for this offending was a desire to seek contact with people you genuinely believed were your family,\" he said. \"Whether in fact there's any truth in that belief is difficult, if not impossible, to determine.\" Read more from Sky News:Cast of Beatles films revealedTractor crashes into houses in Cheshire Defence lawyer John Weate said Shaw had been told the story by his mother \"in his mid to late teens\" and had suffered \"complex mental health issues\" since he was a child. He added: \"He now accepts that Miss Ballas and her family don't wish to have any contact with him and, importantly, he volunteered the information that he has no intention of contacting them again.\" Shaw, of Whetstone Lane in Birkenhead, also admitted possessing cannabis and was ordered to undertake a rehab programme."
    },
    {
        "title": "Paul Mescal and Barry Keoghan revealed in line-up for Sam Mendes' four Beatles films ",
        "description": "Paul Mescal and Barry Keoghan will play Paul McCartney and Ringo Starr in the upcoming Beatles films - with a Stranger Things star also portraying one of the Fab Four.",
        "url": "https://news.sky.com/story/paul-mescal-and-barry-keoghan-revealed-in-line-up-for-sam-mendes-four-beatles-films-13339659",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-beatles-films-dickinson_6872766.jpg?20250401112610",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-01 09:50:00",
        "Headline": "The ambitious project will see four movies made - one for each band member - with all planned to be released the same month.",
        "Content": "Paul Mescal and Barry Keoghan will play Paul McCartney and Ringo Starr in the upcoming Beatles films - with a Stranger Things star also portraying one of the Fab Four. The two Irish actors will be joined by London-born performers Harris Dickinson as John Lennon, and Joseph Quinn as George Harrison. The cast for the Sam Mendes project was revealed at the CinemaCon event in Las Vegas, with all four appearing on stage and taking a bow together in Beatles style. Mendes is making four interconnected films - one from the perspective of each of the band members - and they are all set to be released \"in proximity\" to each other in April 2028. It marks the first time The Beatles and the families of John Lennon and George Harrison have granted full life story and music rights for a scripted film. Playing McCartney is another big role for 29-year-old Mescal, who recently starred in the Gladiator sequel and was nominated for an Oscar in 2023 for Aftersun. Barry Keoghan - who also got an Oscar nod for The Banshees of Inisherin - will portray the other surviving Beatles member, Ringo Starr. \n                  Paul McCartney and Ringo Starr back on stage together at London show\n                 \n                  Beatles fans can 'eat, sleep and party' in Liverpool club turned into B&B by original member Pete Best\n                 \n                  Taylor Swift v The Beatles: As the Eras tour hits the UK, how does the star compare against the biggest band of all time?\n                 Meanwhile, Stranger Things star Joseph Quinn, who appeared with long hair as Eddie Munson in the fourth series, takes up the role of George Harrison. Harris Dickinson has the challenge of stepping into the shoes of perhaps the most famous Beatle, John Lennon. The 28-year-old recently starred in erotic thriller Babygirl with Nicole Kidman and also appeared in satire Triangle of Sadness. Mendes told the industry audience at CinemaCon there is \"still plenty to explore\" despite the Beatles' rise having being well chronicled. Read more from Sky News:Prince Andrew accuser has 'days to live'NASA astronaut takes some blame for getting stranded The Oscar-winning British director is known for films including American Beauty, First World War movie 1917, and Bond outings Skyfall and Spectre. Sony Pictures boss Tom Rothman said the close release of all four films in three years' time will be \"the first bingeable theatrical experience\". \"We are going to dominate the culture that month,\" he added."
    },
    {
        "title": "Gary Glitter made bankrupt after failing to pay £500k compensation to victim",
        "description": "Gary Glitter has been made bankrupt after failing to pay more than &#163;500,000 in damages to a woman he abused when she was 12 years old. ",
        "url": "https://news.sky.com/story/gary-glitter-made-bankrupt-after-failing-to-pay-163500k-compensation-to-victim-13339684",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-paul-gadd-gary-glitter_6578504.jpg?20240611102917",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-01 10:32:00",
        "Headline": "The woman sued the disgraced singer after he was found guilty of sexually assaulting her and two other schoolgirls in 2015. ",
        "Content": "Gary Glitter has been made bankrupt after failing to pay more than £500,000 in damages to a woman he abused when she was 12 years old.  She sued the disgraced singer, whose real name is Paul Gadd, after he was found guilty of attacking her and two other schoolgirls between 1975 and 1980. Glitter, 80, was jailed for 16 years in 2015 and released in 2023 but was recalled to prison less than six weeks later after breaching his parole conditions. A judge awarded the woman £508,800, including £381,000 in lost earnings and £7,800 for future therapy and treatment, saying she was subjected to abuse \"of the most serious kind\". The court heard she had not worked for decades due to the trauma of being repeatedly raped and \"humiliated\" by the singer. Glitter was made bankrupt last month at the County Court at Torquay and Newton Abbot, in Devon - the county where he is reportedly serving his sentence in Channings Wood prison, in Newton Abbot. Richard Scorer, head of abuse law at Slater and Gordon, the law firm representing the woman, said: \"We confirm that Gadd has been made bankrupt following our client's application. \n                  CCTV shows moment shoplifters tackled in police sting in London\n                 \n                  Alexander Dighton admits attempted murder of police officer in Wales\n                 \n                  Nasen Saadi: Criminology student with 'grievance against women' jailed for murdering personal trainer on beach\n                 \"As he has done throughout, Gadd has refused to cooperate with the process and continues to treat his victims with contempt. \"We hope and trust that the parole board will take his behaviour into account in any future parole applications, as it clearly demonstrates that he has never changed, shows no remorse and remains a serious risk to the public.\" Glitter was first jailed for four months in 1999 after he admitted possessing around 4,000 indecent images of children. He was expelled from Cambodia in 2002, and in March 2006 was convicted of sexually abusing two girls, aged 10 and 11, in Vietnam where he spent two-and-a-half years in prison. Read more from Sky News:UK set to be hotter than Greece or SpainMother killed by drunk-driver still on road over test delays  His sentence for the 2016 convictions expires in February 2031. Glitter was automatically released from HMP The Verne, a low-security prison in Portland, Dorset, in February 2023 after serving half of his fixed-term determinate sentence. But he was back behind bars weeks later after reportedly trying to access the dark web and images of children."
    }
]