[
    {
        "title": "Ukraine is turning warfare into a sci-fi battle of machines - and the West has work to do",
        "description": "Ukrainians say they are in danger of losing the drone arms race with Russia and need more help.",
        "url": "https://news.sky.com/story/ukraine-is-turning-warfare-into-a-sci-fi-battle-of-machines-and-the-west-has-work-to-do-13418216",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-drone_6918050.jpg?20250516101020",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-25 12:35:00",
        "Headline": "Sky News has been given exclusive access to a Ukrainian drone factory to watch its start-up ingenuity at work. Ukrainians have turned the drone into their most effective weapon against the invaders, but Russia is no slouch either.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Ukrainians say they are in danger of losing the drone arms race with Russia and need more help. And that is worrying not just for Ukraine, because the drone is becoming the likely weapon of choice in other future conflicts. Sky News has been given exclusive access to a Ukrainian drone factory to watch its start up ingenuity at work. Ukrainians have turned the drone into their most effective weapon against the invaders. But they are now, we are told, losing the upper hand in the skies over Ukraine. General Cherry Drones was started by volunteers at the beginning of the war, making a 100 a month, but is now producing 1,000 times that. The company's Andriy Lavrenovych said it is never enough. \"The Russians have a lot of troops, a lot of vehicles and our soldiers every day tell us we need more, we need more weapons, we need better, we need faster, we need higher.\" The comments echo the words of Ukraine's leader, President Volodymyr Zelenskyy, who told reporters this week \"the Russians have increased the number of drones, while due to a lack of funding, we have not yet been able to scale up.\" The factory's location is a closely-guarded secret, moved often. Russia strikes weapons factories when it can. In a nondescript office building we watched drones being assembled and stacked in their thousands. Put together like toys, they are hand assembled and customised. The quadcopters vary in size, some carry explosives to attack the enemy. Others fly as high as six kilometres to ambush Russian surveillance drones. A $1,000 (£743) Ukrainian drone can bring down an enemy aircraft worth 300 times as much. Downstairs each drone is tested before it's sent to the front. Nineteen-year-old Dima - not his real name - used to play with drones at home before it was occupied in Kherson Oblast. Now he works here using his skills to check the drones are fit for battle. But Russia is catching up. Sinister propaganda released this week filmed at one of its vast new drone factories shows hundreds of Geranium delta wing attack drones lined up ready to be launched at Ukraine. Russia has refined the technology provided by Iranians to produce faster, more lethal versions of their Shahed drones. They have wreaked havoc and carnage, coming in their hundreds every night and killing scores of civilians. Ukraine expects 1,000 a night in the months ahead. Russia is using scale and quantity to turn the tables on Ukrainians. And it is mastering drones controlled by fibre optic thread, trailing in their wake, that cannot be jammed. Read more:Trump sets red line on Ukraine peace deal supportWhat would US-backed security guarantees look like? Oleksandr \"Drakar\", head of new product development, showed us his company's prototype fibre optic model. It is more effective than the Russians, he told us, but added: \"The Russians began using the technology earlier and have scaled up production. \"They've had considerable help from the Chinese - entire factories there are under contract to supply fibre exclusively to Russia, producing it in vast quantities.\" Russia's Chinese allies, who claim to be neutral in this conflict, are also throttling the supply of microchips and other parts vital to drone production. The West is not doing enough, say Ukrainians, to counterbalance the threat.  It is a constant race to beat the other side, innovation met by more innovation. This conflict is revolutionising warfare into a sci-fi battle of machines. Ukrainians say 80% of battlefield strikes are now carried out by drones. Whoever has the upper hand with them in this conflict is likely to have the edge in future wars. If the West wants to be on the winning side, it will need to give Zelenskyy and his drone start-up companies more help to maintain their edge."
    },
    {
        "title": "Israel may not be targeting journalists but it is certainly killing a lot of them",
        "description": "It is an innocuous term for a horrible tactic. A \"double tap\" sounds so innocent and unthreatening. In fact, it is a term saved for a particularly brutal kind of attack.",
        "url": "https://news.sky.com/story/israel-may-not-be-targeting-journalists-but-it-is-certainly-killing-a-lot-of-them-13418435",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_7001075.jpg?20250825192826",
        "type": "Home",
        "Author": "Adam Parsons, Middle East correspondent, in Israel",
        "Date Published": "2025-08-25 20:14:00",
        "Headline": "This is a crucial moment in this conflict. Parts of Gaza have been designated as suffering from famine, just as Israel's military might is readied for a huge operation to encircle and overwhelm Gaza City.",
        "Content": "By Adam Parsons, Middle East correspondent, in Israel   It is an innocuous term for a horrible tactic. A \"double tap\" sounds so innocent and unthreatening. In fact, it is a term saved for a particularly brutal kind of attack. And so it seems was the fate of those who died in the Nasser hospital in Khan Younis, Gaza. First one strike hit the building, ripping away a chunk of the wall and injuring the people inside. Fifteen minutes later, as rescuers and journalists rushed in, and as the scene was being broadcast live, a second explosion ripped through the courtyard, killing those who had come to help. Latest updates: Israel strikes Nasser hospital So the first tap causes harm and brings people to the scene; the second inflicts yet more devastation upon the people who came to help. It's a tactic that's been used by a variety of countries over the years, most recently by Russia in Ukraine and, enthusiastically, by Bashar al Assad while he was president of Syria. This time, it left more than 20 people dead, among them medics, patients, and five journalists. The scenes of carnage were horrendous - we saw images of death and destruction. One man, a journalist who survived the explosions, was filmed sitting in the hospital, his head, and body soaked in blood, utterly dazed. Nasser is the last fully functioning hospital in southern Gaza. To see it struck again was, in the words of British surgeon Professor Nick Maynard, \"barbarism in the extreme\". He told Sky News: \"This hospital has been bombed several times over the last 22 months. It is murder. These are war crimes killing innocent civilians. As barbaric as anything I have seen in Gaza.\" Among the dead was photographer Mariam Daqqa. Hours before her death, her name appeared on the front page of a leading Israeli newspaper, a credit for a haunting photo she had taken of an emaciated child. Her press vest, recovered from the rubble, was later laid across her coffin while her camera, still marked by her own blood, was held aloft.  Amanda Nasser, an American emergency nurse who had been working inside the hospital, survived by chance. \"We were told to leave for [a] training session,\" she said. \"Thirty minutes later, the hospital was hit twice. Mariam was a dear friend. Getting that news broke me down.\" Israeli Prime Minister Benjamin Netanyahu has described the attack as \"a tragic mishap\" and an investigation has been opened. The Israel Defence Forces (IDF) insists it does not deliberately target civilians; Mr Netanyahu says that Israel values the work of \"journalists, health workers and all citizens\". But it's also a fact that Nasser hospital is a popular place for media workers to gather, to use the internet and to chase and trade stories. And if we know that, so does the Israeli military. It would be naive to think that the chance of killing journalists, as well as, obviously, health workers, was not obvious to those who launched this attack. \"We do not intentionally target civilians,\" says the IDF's spokesperson Effie Defrin. \"We regret any harm to uninvolved individuals.\" And yet, somehow, it happened. Not just one explosion, but two. Read more:Israel pounds outskirts of Gaza CityPro-Palestine Australians protest after week of tension with Israel There are at least five different groups who try to keep track of how many journalists have been killed in Gaza. They all come up with different figures, but they agree that the total is above 200, and may even be more than 300. And remember - foreign journalists are barred from entering Gaza, so the ability of the world to scrutinise what is actually happening on the ground in Gaza is largely dependent upon the work of these people, hundreds of whom are now dead. Israel may not be targeting them, but it is certainly killing a lot of journalists along the way. This is a crucial moment in this conflict. Parts of Gaza have been designated as suffering from famine, just as Israel's military might is readied for a huge operation to encircle and overwhelm Gaza City. A ceasefire proposal is on the table, but Netanyahu seems reluctant to negotiate. On Tuesday, once again, Israel will face protests and strikes from those, including the families of hostages, demanding that their prime minister stop the war. It is a volatile time, and Israel is a volatile country."
    },
    {
        "title": "Trump wants a reunion with Kim Jong Un - the timing is curious",
        "description": "It was Donald Trump's first meeting with the new president of South Korea.",
        "url": "https://news.sky.com/story/kim-possible-why-trump-wants-another-meeting-with-north-korean-dictator-13418486",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-kim-north-korea_7001447.jpg?20250826014454",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-08-25 22:58:00",
        "Headline": "Fresh off a meeting with Vladimir Putin, Donald Trump now wants to set up another eyebrow-raising meeting with a world leader - Kim Jong Un of North Korea. The pair have met before, and in historic circumstances.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It was Donald Trump's first meeting with the new president of South Korea. A highly unconventional platform for glowing words about the North Korean one. As he sat across from Lee Jae Myung, Mr Trump said he got along \"great\" with Kim Jong Un and would like to meet him again \"this year\". He said he would like to help the relationship between the two Koreas. Curious timing The US president's renewed interest in North Korea appears less about policy and more about theatrics. The historic image of Trump stepping on to North Korean soil in 2019 gave him global headlines. The timing is curious - North Korea has been busy polishing its nuclear credentials and vowing not to disarm without serious concessions. In other words, Pyongyang is holding the same cards it held four years ago, only now they're shinier. 'Hermit Kingdom' But since Trump's first-term meetings with Kim ended, North Korea has shown no interest in returning to talks. But these attempts at rapprochement come after the election in South Korea of Lee, who has pledged to reopen dialogue with North Korea. Trump seems eager to revive his image as the only US president bold, or brash, enough to break bread with the ruler of the \"Hermit Kingdom\". Supporters call it visionary diplomacy; critics call it reality TV masquerading as foreign policy. Either way, Trump clearly sees value in the spectacle. Whether Kim Jong Un does is another story."
    },
    {
        "title": "Three die and a fourth in serious condition in hospital after helicopter crash on Isle of Wight",
        "description": "Three people have died following a helicopter crash during a flying lesson on the Isle of Wight.",
        "url": "https://news.sky.com/story/three-die-and-a-fourth-in-serious-condition-in-hospital-after-helicopter-crash-on-isle-of-wight-13418150",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-helicopter-isle-of-wight_7001165.jpg?20250825190948",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-25 10:01:00",
        "Headline": "Emergency services were scrambled to a field near Ventnor on the island at 9.24am on Monday, Hampshire Police said.",
        "Content": " Three people have died following a helicopter crash during a flying lesson on the Isle of Wight. A fourth person is in hospital in a serious condition following the incident, according to Hampshire Police. Officers were called to the scene of a \"helicopter that had come down\" off Shanklin Road near Ventnor at 9.24am on Monday, the force said. A spokesman for the aircraft's owner Northumbria Helicopters said G-OCLV - which is listed as a Robinson R44 II helicopter - was involved in the accident during a flying lesson.  Four people, including the pilot, were on board the aircraft, which departed nearby Sandown Airport at 9am, the company also said in a statement. A critical care team, including a doctor and specialist paramedic, was also sent to the crash site, Hants and Isle of Wight Air Ambulance added, alongside fire engines and other emergency vehicles. The Air Accidents Investigation Branch confirmed it was alerted to the incident and was sending a team to investigate. A major incident was declared but has since been stood down. A spokesperson for Hampshire and Isle of Wight Air Ambulance said in a statement: \"We have treated and airlifted one patient to the Major Trauma Centre, University Hospital Southampton. Our thoughts are with them, and everyone involved in today's incident.\" Darren Toogood, editor and publisher at the Island Echo, told Sky News presenter Kamali Melbourne the helicopter crashed on a \"significantly busy, high-speed road\" between the village of Godshill and the seaside town of Shanklin. \"It was on one of the first flights of the day,\" he said. \"It's a bank holiday weekend in August on the Isle of Wight. It's an incredibly busy area. Lots of tourists down at the moment. It appears no vehicles were involved, which is incredible, given how busy this road would have been this morning.\" A witness, Leigh Goldsmith, told the Isle of Wight County Press she saw the helicopter \"spiralling\" before crashing into a hedge as she drove along the road. Read more from Sky News:Bands pull out from festival after group 'cut off' over flagOfwat probes payments to water bosses after Yorkshire row Police have closed Shanklin Road, blocking it off with several emergency vehicles, and are warning people to avoid the area. Northumbria Helicopters said it is \"giving its full cooperation to the authorities investigating this incident\". Joe Robertson, the MP for Isle of Wight East, said the local community was in shock. \"My heart goes out to the families of those who lost their lives in the helicopter crash outside Shanklin today,\" he said in a statement. \"It is very sad and tragic news during what should have been a happy Bank Holiday helicopter flight from Sandown Airport. The whole community is in shock. \"My sincere thanks to all the emergency services personnel who have been involved and to the investigators for their work ahead.\""
    },
    {
        "title": "'Headphone dodgers' targeted by new TfL campaign",
        "description": "A campaign encouraging people to use headphones when playing music on public transport is being rolled out in London from today.",
        "url": "https://news.sky.com/story/headphone-dodgers-targeted-by-new-tfl-campaign-13418491",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-phone-train-london_7001452.jpg?20250826021003",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-25 23:24:00",
        "Headline": "Shadow transport secretary Richard Holden said passengers should not have to \"endure somebody else's choice of crap music\".",
        "Content": "A campaign encouraging people to use headphones when playing music on public transport is being rolled out in London from today. Posters will begin appearing on the Elizabeth line on Tuesday reminding travellers not to play music out loud or to have conversations on speaker mode, as it may disturb other passengers. It is the latest part of Transport for London's Travel Kind campaign, which is being rolled out across the wider transport network. Rules around train travel already make playing music out loud an offence. But like other issues, such as fare evasion, this is subject to being enforced by the British Transport Police or the train operators themselves. People using their phones for loud content has become a political issue in recent months, with both the Liberal Democrats and Conservatives urging ministers to take action on it. Earlier this year, the Lib Dems called for fines of up to £1,000 for \"headphone dodgers\" who play music out loud on buses and trains, while Tory shadow transport secretary Richard Holden said passengers should not have to \"endure somebody else's choice of crap music\". Seb Dance, deputy mayor of London for transport, said the small minority who \"play music or videos out loud can be a real nuisance to other passengers and directly disturb their journeys\". \"However Londoners spend their journey, whether catching up on their favourite series or listening to music, we want everyone to have a pleasant journey.\" Read more from Sky News:Why Trump wants to meet KimImpact of online safety rules revealed Posters will also encourage people to look up from their phones and to be aware that others travelling may be in need of a seat. Previously, the Travel kind campaign included calls for vigilance about sexual harassment and urged travellers to move down inside London's Tube carriages to ensure others can get on."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador detained by ICE again",
        "description": "A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-detained-by-ice-again-13418237",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kilmar-abrego-garcia_7000993.jpg?20250825143431",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-25 13:28:00",
        "Headline": "The 30-year-old is charged with conspiring to transport illegal immigrants into the US, and has been threatened with deportation to Uganda.",
        "Content": " A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again. Kilmar Abrego Garcia, a 30-year-old originally from El Salvador, handed himself into the ICE field office in Baltimore, Maryland, for a check-in on Monday. The visit was a mandatory condition of his release from federal custody earlier this weekend. However, in a court filing on Saturday, his lawyers said they expected Garcia would be detained again upon attending. Garcia is charged in an indictment, filed in federal court in Tennessee, with conspiring to transport illegal immigrants into the US.  According to a court filing by his lawyers, immigration officials made an offer to Garcia to be deported to Costa Rica in exchange for pleading guilty to the charges. Otherwise, they would seek to deport him to Uganda. Speaking at a news conference outside the ICE office on Monday morning, Garcia said via a translator: \"This administration has hit us hard, but I want to tell you guys something: God is with us, and God will never leave us. \"God will bring justice to all the injustice we are suffering.\" Simon Sandoval-Moshenberg, one of Garcia's lawyers, also said: \"There was no need to take him into ICE detention... the only reason they took him into detention was to punish him.\" A judge later ruled Garcia could not be deported after he filed a challenge asking to be allowed due process to fight any removal attempt. Judge Paula Xinis ruled the 30-year-old must remain detained in the US until she can hold an evidentiary hearing - set for Wednesday. She added there appeared to be \"several grounds\" for her to have jurisdiction to exercise relief, including that Uganda has not agreed to offer Garcia protections, such as being able to walk freely, being given refugee status, and not being re-deported to El Salvador. After initially being detained in Maryland - where he lived with his American wife and children - by ICE in March, Garcia was sent to El Salvador, where he was then imprisoned in the country's maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. The Trump administration admitted deporting Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Garcia on criminal charges that were filed in May. The criminal indictment alleges Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Minutes after his release on Friday, officials notified Garcia they intended to deport him to Uganda. Read more from Sky News:National Guard will carry firearms in Washington DC, official saysDeadly flesh-eating parasite found in person in US for first timeBlack cab rapist investigated over alleged rape 25 years ago Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Lil Nas X pleads not guilty after being charged with assaulting police officer",
        "description": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear.",
        "url": "https://news.sky.com/story/lil-nas-x-pleads-not-guilty-after-being-charged-with-assaulting-police-officer-13418434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lil-nas-x-montero-lamar-hill_7001360.jpg?20250825221451",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-25 20:36:00",
        "Headline": "The musician, real name Montero Lamar Hill, faces three counts of battery with injury on a police officer and one count of resisting an executive officer.",
        "Content": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear. The musician, real name Montero Lamar Hill, was taken to hospital and arrested after police responded to reports of a naked man shortly before 6am on Thursday. The district attorney's office said on Monday that Lil Nas X faces three counts of battery with injury on a police officer and one count of resisting an executive officer. He was being held on a $75,000 (£55,457) bail, conditional on attending drug treatment. It is not immediately clear whether he had posted it and been released yet. He is set to return to court on 15 September for his next pre-trial hearing. During the hearing on Monday, Hill's lawyer Christy O'Connor told the judge he had led a \"remarkable\" life, adding: \"Assuming the allegations here are true, this is an absolute aberration in this person's life. \"Nothing like this has ever happened to him.\" A law enforcement source told Sky's US partner network, NBC News, on Thursday that the Old Town Road and Industry Baby hitmaker punched an officer twice in the face during the encounter. The source added officers were unsure whether he was on any substances or in mental distress. Read more from Sky News:Black cab rapist under investigationNational Guard to begin carrying firearms in DCTrump says he wants to meet Kim Jong Un again NBC News cited TMZ footage where Hill was seen walking down the middle of Ventura Boulevard at 4am on Thursday in a pair of white briefs and cowboy boots. In the videos, Hill tells a driver to \"come to the party\" in one clip and in another tells the person: \"Didn't I tell you to put the phone down?\" \"Uh oh, someone's going to have to pay for that,\" Hill says as he continues to walk away. In some clips, Hill struts as if he's on a catwalk, posing for onlookers, and at one point he places an orange traffic cone on his head."
    },
    {
        "title": "Hundreds of thousands evacuated and airports closed due to Vietnam typhoon",
        "description": "Hundreds of thousands of people have been evacuated, and airports and schools closed after a typhoon made landfall in Vietnam.",
        "url": "https://news.sky.com/story/hundreds-of-thousands-evacuated-and-airports-closed-due-to-vietnam-typhoon-13418122",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-typhoon-kajiki-vietnam_7000845.jpg?20250825101531",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-25 09:02:00",
        "Headline": "Typhoon Kajiki, which has winds of up to 103mph, hit Vietnam's north central coast on Monday, toppling trees, flooding homes, and cutting power supplies.",
        "Content": "Hundreds of thousands of people have been evacuated, and airports and schools closed after a typhoon made landfall in Vietnam. Typhoon Kajiki, which has winds of up to 103mph, hit Vietnam's north central coast on Monday, toppling trees, flooding homes, and cutting power supplies, state media reported. It has already caused devastation in southern China, with strong winds and heavy rain on Hainan Island and parts of Guangdong province on Sunday. Some 20,000 people were evacuated from high-risk areas, according to China's Xinhua News Agency. In Vietnam, there were plans to evacuate 600,000 people and 152,000 homes across Thanh Hoa, Quang Tri, and Danang provinces, state media reported. The government has also mobilised 16,500 soldiers and 107,000 paramilitary personnel to assist with evacuations and rescue missions. \"This is an extremely dangerous, fast-moving storm,\" a government spokesman said on Sunday. One man died in Nghe An province on Friday after being electrocuted while trying to secure his roof, according to state media. In Ha Tinh province on Monday, roofs were blown off and floating fishing farms were washed away. Dang Xuan Phuong, a 48-year-old resident of Cua Lo, a tourist town in Nghe An, described the storm as \"terrifying\". \"When I look down from the higher floors, I could see waves as tall as two metres, and the water has flooded the roads around us,\" he told Reuters. Two airports, one in Thanh Hoa and the other in Quang Binh province, were closed, the country's civil aviation authority said, and boats were ordered not to leave their ports. Vietnam Airlines and Vietjet also cancelled dozens of flights in the region, the operators confirmed. Read more from Sky NewsFive killed at Niagara FallsWorkers dead after bridge collapses17 dead after car bombing and helicopter attack After moving through Vietnam, it is expected to move inland across Laos and northern Thailand. Vietnam's coastline on the South China Sea is particularly prone to storms that often trigger deadly flooding and landslides. Kajiki is due to be more powerful than Typhoon Yagi, which killed 300 people and caused £2.4bn in damage last year. Cyclones forming closer to land A study published last year warned that climate change will cause southeast Asian cyclones to form closer to land, strengthening faster and lasting for longer, putting more lives at risk. Professor of Earth Science Benjamin P. Horton, of City University Hong Kong, said: \"It's frightening to see our projections from just last year already materialising. We are no longer predicting the future - we are living it.\" China's southernmost province downgraded its emergency response alert on Monday morning but warned of further disruption and damage. People in the holiday resort of Sanya on Hainan Island were forced to take shelter on Sunday evening, with broken trees and damaged buildings reported on Monday."
    },
    {
        "title": "Three die and a fourth in serious condition in hospital after helicopter crash on Isle of Wight",
        "description": "Three people have died following a helicopter crash during a flying lesson on the Isle of Wight.",
        "url": "https://news.sky.com/story/three-die-and-a-fourth-in-serious-condition-in-hospital-after-helicopter-crash-on-isle-of-wight-13418150",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-helicopter-isle-of-wight_7001165.jpg?20250825190948",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-25 10:01:00",
        "Headline": "Emergency services were scrambled to a field near Ventnor on the island at 9.24am on Monday, Hampshire Police said.",
        "Content": " Three people have died following a helicopter crash during a flying lesson on the Isle of Wight. A fourth person is in hospital in a serious condition following the incident, according to Hampshire Police. Officers were called to the scene of a \"helicopter that had come down\" off Shanklin Road near Ventnor at 9.24am on Monday, the force said. A spokesman for the aircraft's owner Northumbria Helicopters said G-OCLV - which is listed as a Robinson R44 II helicopter - was involved in the accident during a flying lesson.  Four people, including the pilot, were on board the aircraft, which departed nearby Sandown Airport at 9am, the company also said in a statement. A critical care team, including a doctor and specialist paramedic, was also sent to the crash site, Hants and Isle of Wight Air Ambulance added, alongside fire engines and other emergency vehicles. The Air Accidents Investigation Branch confirmed it was alerted to the incident and was sending a team to investigate. A major incident was declared but has since been stood down. A spokesperson for Hampshire and Isle of Wight Air Ambulance said in a statement: \"We have treated and airlifted one patient to the Major Trauma Centre, University Hospital Southampton. Our thoughts are with them, and everyone involved in today's incident.\" Darren Toogood, editor and publisher at the Island Echo, told Sky News presenter Kamali Melbourne the helicopter crashed on a \"significantly busy, high-speed road\" between the village of Godshill and the seaside town of Shanklin. \"It was on one of the first flights of the day,\" he said. \"It's a bank holiday weekend in August on the Isle of Wight. It's an incredibly busy area. Lots of tourists down at the moment. It appears no vehicles were involved, which is incredible, given how busy this road would have been this morning.\" A witness, Leigh Goldsmith, told the Isle of Wight County Press she saw the helicopter \"spiralling\" before crashing into a hedge as she drove along the road. Read more from Sky News:Bands pull out from festival after group 'cut off' over flagOfwat probes payments to water bosses after Yorkshire row Police have closed Shanklin Road, blocking it off with several emergency vehicles, and are warning people to avoid the area. Northumbria Helicopters said it is \"giving its full cooperation to the authorities investigating this incident\". Joe Robertson, the MP for Isle of Wight East, said the local community was in shock. \"My heart goes out to the families of those who lost their lives in the helicopter crash outside Shanklin today,\" he said in a statement. \"It is very sad and tragic news during what should have been a happy Bank Holiday helicopter flight from Sandown Airport. The whole community is in shock. \"My sincere thanks to all the emergency services personnel who have been involved and to the investigators for their work ahead.\""
    },
    {
        "title": "'Headphone dodgers' targeted by new TfL campaign",
        "description": "A campaign encouraging people to use headphones when playing music on public transport is being rolled out in London from today.",
        "url": "https://news.sky.com/story/headphone-dodgers-targeted-by-new-tfl-campaign-13418491",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-phone-train-london_7001452.jpg?20250826021003",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-25 23:24:00",
        "Headline": "Shadow transport secretary Richard Holden said passengers should not have to \"endure somebody else's choice of crap music\".",
        "Content": "A campaign encouraging people to use headphones when playing music on public transport is being rolled out in London from today. Posters will begin appearing on the Elizabeth line on Tuesday reminding travellers not to play music out loud or to have conversations on speaker mode, as it may disturb other passengers. It is the latest part of Transport for London's Travel Kind campaign, which is being rolled out across the wider transport network. Rules around train travel already make playing music out loud an offence. But like other issues, such as fare evasion, this is subject to being enforced by the British Transport Police or the train operators themselves. People using their phones for loud content has become a political issue in recent months, with both the Liberal Democrats and Conservatives urging ministers to take action on it. Earlier this year, the Lib Dems called for fines of up to £1,000 for \"headphone dodgers\" who play music out loud on buses and trains, while Tory shadow transport secretary Richard Holden said passengers should not have to \"endure somebody else's choice of crap music\". Seb Dance, deputy mayor of London for transport, said the small minority who \"play music or videos out loud can be a real nuisance to other passengers and directly disturb their journeys\". \"However Londoners spend their journey, whether catching up on their favourite series or listening to music, we want everyone to have a pleasant journey.\" Read more from Sky News:Why Trump wants to meet KimImpact of online safety rules revealed Posters will also encourage people to look up from their phones and to be aware that others travelling may be in need of a seat. Previously, the Travel kind campaign included calls for vigilance about sexual harassment and urged travellers to move down inside London's Tube carriages to ensure others can get on."
    },
    {
        "title": "Thousands attend Notting Hill Carnival - with Met Police reporting 'far fewer' violent incidents this year",
        "description": "Thousands have taken to the streets of west London for this year's Notting Hill Carnival.",
        "url": "https://news.sky.com/story/thousands-attend-notting-hill-carnival-with-met-police-reporting-far-fewer-violent-incidents-this-year-13418358",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-notting-hill-carnival_7001192.jpg?20250825195819",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-25 17:58:00",
        "Headline": "More than a million people were expected to attend this year's event, with around 7,000 police officers on duty across the capital on Sunday and Monday.",
        "Content": " Thousands have taken to the streets of west London for this year's Notting Hill Carnival. Sunny skies and temperatures up to 26C (79F) were out for the third and final day of Carnival, Europe's biggest street party, which celebrated its 57th year. More than a million people were expected to attend this year's event, with around 7,000 police officers on duty across the capital on Sunday and Monday.    Carnival traces its roots to the hundreds of thousands of migrants from the Caribbean - the Windrush generation - who came to the UK between 1948 and 1971 to help rebuild the country after the Second World War. Groups performing included Bajan Raw Licquer, Mahogany, Chocolate Nation, Mas Africa, Vincy Alliance and United Kreyol, reflecting traditions from Trinidad & Tobago, Barbados, St Lucia, Grenada, Jamaica, Dominica and Haiti. Brazilian performers from Paraiso Samba School, Batala and Dende Nation added to the line-up, alongside long-established UK community bands. Read more about Carnival:Family of mother killed at carnival say it's 'unsafe'Face-recognition tech will be used without bias - Met bossReason behind Notting Hill Carnival as important as ever Carnival has been facing financial challenges, with chair Ian Comfort telling The Guardian that the event came close to not happening this year. Just weeks before the event, nearly £1m in funding was granted to organisers by the London mayor's office and two local councils. Kim Taylor-Smith, deputy leader of Kensington and Chelsea Council, said the extra funding his authority provided would apply \"for this year only\". He called on the government to support the event financially. 'Far fewer' violent incidents, police say In the run-up to the event, the Metropolitan Police arrested more than 100 people who had planned to go, and seized dozens of knives and firearms. On Sunday, the force said there had been 140 arrests, including 105 at the event itself while 35 took place \"on the approaches to carnival as a result of proactive policing interventions\". In an update after 8pm on Monday, the Met Police said there had been a total of 423 arrests over the two main days of Notting Hill Carnival. Last year, there were 334 arrests in total. The force added that officers \"have seen far fewer incidents of serious violence than in recent years\", noting two stabbing incidents. One incident was reported in Powis Terrace, and the other was in Oxford Gardens. Neither incident resulted in life-threatening injuries. Read more from Sky News:Bands pull out from festival after group 'cut off' over flagDeadly flesh-eating parasite found in person in US for first time Assistant Commissioner Matt Ward, policing commander for Notting Hill Carnival, said in statement that the force had \"proactively targeted those who have attempted to come to Carnival to cause harm to others\". \"We have used live facial recognition, knife arches and our stop and search powers to identify and arrest more than 400 suspects,\" he added. \"These arrests have prevented some of the serious violence we have seen at previous Carnivals. \"We thank the organisers and others who spoke out in the days and weeks ahead of the event to emphasise what Carnival stands for, to reject violence and to urge anyone planning to come for conflict or confrontation to stay at home. \"All of this joint effort has helped to make this this year's Carnival a safer event for all.\""
    },
    {
        "title": "Ofwat probes payments to water bosses after Yorkshire row",
        "description": "The water industry watchdog is probing payments to the bosses of a string of suppliers following the revelation that Yorkshire Water's offshore parent company had handed its chief executive more than &#163;1m in previously undisclosed fees.",
        "url": "https://news.sky.com/story/ofwat-probes-payments-to-water-bosses-after-yorkshire-row-13418238",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-water-taps-drink-glass_6362222.jpg?20231116083058",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-25 13:39:00",
        "Headline": "The regulator, which is due to be abolished by the government, has written to water companies to investigate whether they have paid executives via offshore vehicles, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The water industry watchdog is probing payments to the bosses of a string of suppliers following the revelation that Yorkshire Water's offshore parent company had handed its chief executive more than £1m in previously undisclosed fees. Sky News has learnt that Ofwat, which is to be abolished by the government in the coming years, wrote to a number of water companies earlier this month to scrutinise similar remuneration arrangements to those employed by Yorkshire Water and its holding company, Kelda Holdings. Industry sources said on Monday that some of the biggest operators in the sector were among the recipients of Ofwat's letter. Disclosure of the regulator's enquiries comes in the wake of a report in The Guardian which said Nicola Shaw, the Yorkshire Water boss, had received payments of £660,00 from Jersey-registered Kelda in each of the last two financial years.  Read more from Sky NewsTikTok puts hundreds of UK jobs at riskCoca Cola brews up sale of CostaGupta struggles to fund bid for UK steel arm A source close to Ofwat insisted that its investigation of similar pay arrangements had been planned prior to the reporting of Ms Shaw's remuneration. \"We are currently reviewing water companies' compliance with the performance-related pay prohibition rule. \"As part of this assessment, we have written to several companies to request more information on the remuneration decisions they have set out in their annual accounts. \"Where we find evidence that a company has breached the rule, we have powers to direct companies to take remedial actions which, if not complied with, can result in companies facing enforcement action - including financial penalties.\" Water industry pay has become an increasingly incendiary topic in recent months amid a slew of fines levied against operators across Britain for their failure to prevent leaks and major pollution incidents. Sky News revealed earlier this month that David Black, the Ofwat chief executive, would step down following the publication of a government-commissioned review calling for the body to be scrapped."
    },
    {
        "title": "Far right 'emboldened' says MP as Starmer faces mounting pressure over immigration",
        "description": "Sir Keir Starmer faces mounting pressure over the small boats crisis after protests outside asylum hotels continued over the bank holiday weekend.",
        "url": "https://news.sky.com/story/starmer-facing-mounting-pressure-over-immigration-as-mp-says-far-right-emboldened-13418054",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-starmer-white-house_6994974.jpg?20250819042226",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-25 05:24:00",
        "Headline": "A poll suggested that voters believe the prime minister is failing to grip the problem, despite his government setting out measures to speed up removals.",
        "Content": "Sir Keir Starmer faces mounting pressure over the small boats crisis after protests outside asylum hotels continued over the bank holiday weekend. A poll suggested that voters believe the prime minister is failing to grip the problem, despite his government setting out measures to speed up removals. It comes as Green Party co-leader Carla Denyer warned that \"the far right feels emboldened and validated\" by other political parties. So far this year a record 28,076 people have made the perilous journey across the English Channel in small boats, 46% more than in the same period in 2024. Like many other European countries, immigration has increasingly become a flashpoint in recent years as the UK deals with an influx of people fleeing war-torn and poorer countries seeking a better life. Official figures released earlier this month showed a total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001. There were 32,059 asylum seekers in UK hotels by the end of the same month. Protests and counterprotests at sites housing asylum seekers continued over the weekend and the government is braced for further legal fights over the use of hotels. Read more:Fast-track asylum appeals process to be introduced A YouGov poll for The Times found that 71% per cent of voters believe Sir Keir is handling the asylum hotel issue badly, including 56% of Labour supporters. The survey of 2,153 people carried out on August 20-21 found 37% of voters viewed immigration and asylum as the most important issue facing the country, ahead of 25% who said the economy and 7% who said the health service. Ms Denyer, who is MP for Bristol Central, condemned threats of violence in the charged atmosphere around immigration. \"The far right feels emboldened and validated by other political parties dancing to their tune. \"The abuse I've been sent has got noticeably worse in the last few months, escalating in some cases to violent threats, which are reported to the police. \"It doesn't matter how much you disagree with someone, threats of violence are never, ever OK. And they won't silence me.\"  Chief political correspondent Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem. The former director of public prosecutions would appear to see overhauling court procedures and the legal process as the answer to any tricky situation. Yes, the proposed fast-track asylum appeals process is fine as far as it goes. But for a government confronted with a massive migrant crisis, opponents claim it's mere tinkering. And welcome and worthy as it is, it isn't going to \"smash the gangs\", stop the boats or act as a powerful deterrent to the people smugglers plying their trade in the Channel. Read more"
    },
    {
        "title": "Ukraine is turning warfare into a sci-fi battle of machines - and the West has work to do",
        "description": "Ukrainians say they are in danger of losing the drone arms race with Russia and need more help.",
        "url": "https://news.sky.com/story/ukraine-is-turning-warfare-into-a-sci-fi-battle-of-machines-and-the-west-has-work-to-do-13418216",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ukraine-drone_6918050.jpg?20250516101020",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-25 12:35:00",
        "Headline": "Sky News has been given exclusive access to a Ukrainian drone factory to watch its start-up ingenuity at work. Ukrainians have turned the drone into their most effective weapon against the invaders, but Russia is no slouch either.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Ukrainians say they are in danger of losing the drone arms race with Russia and need more help. And that is worrying not just for Ukraine, because the drone is becoming the likely weapon of choice in other future conflicts. Sky News has been given exclusive access to a Ukrainian drone factory to watch its start up ingenuity at work. Ukrainians have turned the drone into their most effective weapon against the invaders. But they are now, we are told, losing the upper hand in the skies over Ukraine. General Cherry Drones was started by volunteers at the beginning of the war, making a 100 a month, but is now producing 1,000 times that. The company's Andriy Lavrenovych said it is never enough. \"The Russians have a lot of troops, a lot of vehicles and our soldiers every day tell us we need more, we need more weapons, we need better, we need faster, we need higher.\" The comments echo the words of Ukraine's leader, President Volodymyr Zelenskyy, who told reporters this week \"the Russians have increased the number of drones, while due to a lack of funding, we have not yet been able to scale up.\" The factory's location is a closely-guarded secret, moved often. Russia strikes weapons factories when it can. In a nondescript office building we watched drones being assembled and stacked in their thousands. Put together like toys, they are hand assembled and customised. The quadcopters vary in size, some carry explosives to attack the enemy. Others fly as high as six kilometres to ambush Russian surveillance drones. A $1,000 (£743) Ukrainian drone can bring down an enemy aircraft worth 300 times as much. Downstairs each drone is tested before it's sent to the front. Nineteen-year-old Dima - not his real name - used to play with drones at home before it was occupied in Kherson Oblast. Now he works here using his skills to check the drones are fit for battle. But Russia is catching up. Sinister propaganda released this week filmed at one of its vast new drone factories shows hundreds of Geranium delta wing attack drones lined up ready to be launched at Ukraine. Russia has refined the technology provided by Iranians to produce faster, more lethal versions of their Shahed drones. They have wreaked havoc and carnage, coming in their hundreds every night and killing scores of civilians. Ukraine expects 1,000 a night in the months ahead. Russia is using scale and quantity to turn the tables on Ukrainians. And it is mastering drones controlled by fibre optic thread, trailing in their wake, that cannot be jammed. Read more:Trump sets red line on Ukraine peace deal supportWhat would US-backed security guarantees look like? Oleksandr \"Drakar\", head of new product development, showed us his company's prototype fibre optic model. It is more effective than the Russians, he told us, but added: \"The Russians began using the technology earlier and have scaled up production. \"They've had considerable help from the Chinese - entire factories there are under contract to supply fibre exclusively to Russia, producing it in vast quantities.\" Russia's Chinese allies, who claim to be neutral in this conflict, are also throttling the supply of microchips and other parts vital to drone production. The West is not doing enough, say Ukrainians, to counterbalance the threat.  It is a constant race to beat the other side, innovation met by more innovation. This conflict is revolutionising warfare into a sci-fi battle of machines. Ukrainians say 80% of battlefield strikes are now carried out by drones. Whoever has the upper hand with them in this conflict is likely to have the edge in future wars. If the West wants to be on the winning side, it will need to give Zelenskyy and his drone start-up companies more help to maintain their edge."
    },
    {
        "title": "Five journalists among 20 killed in Israeli strikes on hospital, Gaza health ministry says",
        "description": "Israeli strikes on a hospital in southern Gaza have killed at least 20 people, including five journalists, according to the Gaza health ministry and the media organisations the journalists worked for.",
        "url": "https://news.sky.com/story/five-journalists-among-20-killed-in-israeli-strikes-on-hospital-gaza-health-ministry-says-13418236",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasser-hospital-gaza_7001330.jpg?20250825214724",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-25 13:26:00",
        "Headline": "Israel has opened an investigation after Gaza's health ministry said at least 20 people, including at least five journalists, were killed in two strikes on a hospital in the south of the territory. ",
        "Content": " Israeli strikes on a hospital in southern Gaza have killed at least 20 people, including five journalists, according to the Gaza health ministry and the media organisations the journalists worked for. Nasser Hospital in Khan Younis was struck twice on Monday in what has been described as a \"double-tap\" attack. The initial strike hit the top floor of a building at Nasser Hospital. Minutes later, as journalists and rescue workers rushed to the scene, a second missile struck the same location, according to Dr Ahmed al Farra, head of the hospital's paediatrics department. Al Jazeera, the Associated Press (AP), and Reuters said their journalists were among those killed. Israeli Prime Minister Benjamin Netanyahu said he \"deeply regrets\" the incident, calling it a \"tragic mishap\". \"Israel values the work of journalists, medical staff, and all civilians,\" he added. \"The military authorities are conducting a thorough investigation.\" A British consultant surgeon, who worked at the Nasser Hospital earlier this summer, described the attack on Monday morning as \"barbarism in the extreme\". \n                  Israel may not be targeting journalists but it is certainly killing a lot of them\n                 \n                  Israel pounds outskirts of Gaza City overnight as military offensive plans continue\n                 \n                  Pro-Palestine Australians protest after week of tension with Israel\n                 Consultant surgeon Professor Nick Maynard told Sky News it was a \"typical double strike that the Israelis use frequently\". It targets an area, then hits it shortly afterwards, often when emergency services respond, he explained. The Israeli military said its troops carried out a strike in the area of Nasser Hospital in Khan Younis and that it would conduct an investigation into the incident. The military said it \"regrets any harm to uninvolved individuals and does not target journalists as such\". In a further statement, Israel Defense Forces (IDF) spokesman Effie Defrin said: \"We are aware of reports that harm was caused to civilians, including journalists. I would like to be clear from the start - the IDF does not intentionally target civilians. \"The IDF makes every effort to mitigate harm to civilians, while ensuring the safety of our troops.\" He said forces were \"operating in an extremely complex reality\" and that Hamas \"deliberately use civilian infrastructure, including hospitals, as shields\". He said the findings of Israel's investigation will be presented \"as transparently as possible\". Who are the journalists? Mariam Dagga, 33, a visual journalist who freelanced for AP during the war, as well as other news outlets, was killed in Monday's strike. AP said in a statement that it was shocked and saddened by the death of Dagga and the loss of other journalists. Dagga, a mother of a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, the news agency said. Most recently, she reported on the hospital's doctors struggling to save starving and malnourished children. \"We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,\" AP said. Independent Arabia, the Arabic-language edition of The Independent, said it also collaborated with Dagga. Al Jazeera confirmed cameraman Mohammed Salama was among those killed. Mohamed Moawad, managing editor of Al Jazeera, spoke to Sky News from Doha, Qatar, after Mr Salama was killed. \"They were reporting closer to the hospital, knowing that was somehow safer than the frontline,\" he said. \"We're talking about a crime against journalism.\" Reuters said in a statement that it was \"devastated\" after two of its journalists were killed at the Nasser Hospital, and one was injured. Contractor cameraman Hussam al Masri was also killed in the strikes on Nasser Hospital, Reuters said. Moaz Abu Taha, a freelance journalist whose work had been occasionally published by Reuters, was also killed. Photographer Hatem Khaled, a Reuters contractor, was wounded. A fifth journalist, Ahmed Abu Aziz, who worked as a freelance reporter, succumbed to his wounds following the strikes at the Nasser Hospital. One of the bloodiest conflicts for media workers The Israel-Hamas war has been among the deadliest conflicts for journalists, with the Committee to Protect Journalists (CPJ) reporting at least 192 media workers killed in Gaza during the 22-month-long conflict. The CPJ says that 18 journalists have died so far in Russia's war in Ukraine. Thibaut Bruttin, director general of Reporters Without Borders, said press freedom advocates have never witnessed such a significant decline in journalist safety. He said journalists had been killed in both indiscriminate bombings and deliberate attacks. \"They are doing everything they can to silence independent voices that are trying to report on Gaza,\" said Mr Bruttin. Israel has accused journalists in Gaza of ties to militant groups, as in the case of Al Jazeera correspondent Anas al Sharif, who was targeted and killed by Israeli forces earlier this month. The Israeli military claimed Sharif led a Hamas cell, a charge both Al Jazeera and Sharif rejected as unfounded. In the absence of direct access, news organisations largely depend on Palestinian journalists and local residents in Gaza to document and provide first-hand accounts of the events unfolding on the ground.  Many journalists reporting from Gaza are enduring the same hardships as those they cover, including the daily struggle to secure food for themselves and their families. \"It is a particular burden that they carry, as well as living in a war zone,\" Sky Middle East correspondent Adam Parsons said. Additional casualties on Monday In addition to the casualties at Nasser Hospital, medical officials in northern Gaza reported further fatalities resulting from strikes and gunfire along routes leading to aid distribution sites. According to Shifa Hospital in Gaza City, an airstrike on a neighbourhood claimed the lives of three Palestinians, including a child. Al Awda Hospital in Deir al Balah reported six people attempting to reach a central Gaza aid distribution point were shot and killed in Israeli gunfire. The hospital said 15 others were wounded in the incident. The IDF has previously \"strongly rejected\" accusations it targets civilians - and maintained its forces operate near aid sites to stop supplies from falling into the hands of militants."
    },
    {
        "title": "Israel may not be targeting journalists but it is certainly killing a lot of them",
        "description": "It is an innocuous term for a horrible tactic. A \"double tap\" sounds so innocent and unthreatening. In fact, it is a term saved for a particularly brutal kind of attack.",
        "url": "https://news.sky.com/story/israel-may-not-be-targeting-journalists-but-it-is-certainly-killing-a-lot-of-them-13418435",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_7001075.jpg?20250825192826",
        "type": "World",
        "Author": "Adam Parsons, Middle East correspondent, in Israel",
        "Date Published": "2025-08-25 20:14:00",
        "Headline": "This is a crucial moment in this conflict. Parts of Gaza have been designated as suffering from famine, just as Israel's military might is readied for a huge operation to encircle and overwhelm Gaza City.",
        "Content": "By Adam Parsons, Middle East correspondent, in Israel   It is an innocuous term for a horrible tactic. A \"double tap\" sounds so innocent and unthreatening. In fact, it is a term saved for a particularly brutal kind of attack. And so it seems was the fate of those who died in the Nasser hospital in Khan Younis, Gaza. First one strike hit the building, ripping away a chunk of the wall and injuring the people inside. Fifteen minutes later, as rescuers and journalists rushed in, and as the scene was being broadcast live, a second explosion ripped through the courtyard, killing those who had come to help. Latest updates: Israel strikes Nasser hospital So the first tap causes harm and brings people to the scene; the second inflicts yet more devastation upon the people who came to help. It's a tactic that's been used by a variety of countries over the years, most recently by Russia in Ukraine and, enthusiastically, by Bashar al Assad while he was president of Syria. This time, it left more than 20 people dead, among them medics, patients, and five journalists. The scenes of carnage were horrendous - we saw images of death and destruction. One man, a journalist who survived the explosions, was filmed sitting in the hospital, his head, and body soaked in blood, utterly dazed. Nasser is the last fully functioning hospital in southern Gaza. To see it struck again was, in the words of British surgeon Professor Nick Maynard, \"barbarism in the extreme\". He told Sky News: \"This hospital has been bombed several times over the last 22 months. It is murder. These are war crimes killing innocent civilians. As barbaric as anything I have seen in Gaza.\" Among the dead was photographer Mariam Daqqa. Hours before her death, her name appeared on the front page of a leading Israeli newspaper, a credit for a haunting photo she had taken of an emaciated child. Her press vest, recovered from the rubble, was later laid across her coffin while her camera, still marked by her own blood, was held aloft.  Amanda Nasser, an American emergency nurse who had been working inside the hospital, survived by chance. \"We were told to leave for [a] training session,\" she said. \"Thirty minutes later, the hospital was hit twice. Mariam was a dear friend. Getting that news broke me down.\" Israeli Prime Minister Benjamin Netanyahu has described the attack as \"a tragic mishap\" and an investigation has been opened. The Israel Defence Forces (IDF) insists it does not deliberately target civilians; Mr Netanyahu says that Israel values the work of \"journalists, health workers and all citizens\". But it's also a fact that Nasser hospital is a popular place for media workers to gather, to use the internet and to chase and trade stories. And if we know that, so does the Israeli military. It would be naive to think that the chance of killing journalists, as well as, obviously, health workers, was not obvious to those who launched this attack. \"We do not intentionally target civilians,\" says the IDF's spokesperson Effie Defrin. \"We regret any harm to uninvolved individuals.\" And yet, somehow, it happened. Not just one explosion, but two. Read more:Israel pounds outskirts of Gaza CityPro-Palestine Australians protest after week of tension with Israel There are at least five different groups who try to keep track of how many journalists have been killed in Gaza. They all come up with different figures, but they agree that the total is above 200, and may even be more than 300. And remember - foreign journalists are barred from entering Gaza, so the ability of the world to scrutinise what is actually happening on the ground in Gaza is largely dependent upon the work of these people, hundreds of whom are now dead. Israel may not be targeting them, but it is certainly killing a lot of journalists along the way. This is a crucial moment in this conflict. Parts of Gaza have been designated as suffering from famine, just as Israel's military might is readied for a huge operation to encircle and overwhelm Gaza City. A ceasefire proposal is on the table, but Netanyahu seems reluctant to negotiate. On Tuesday, once again, Israel will face protests and strikes from those, including the families of hostages, demanding that their prime minister stop the war. It is a volatile time, and Israel is a volatile country."
    },
    {
        "title": "Donald Trump says he wants to meet North Korea's Kim Jong Un again - as soon as 'this year'",
        "description": "Donald Trump has said he wants to meet North Korean leader Kim Jong Un again.",
        "url": "https://news.sky.com/story/donald-trump-says-he-wants-to-meet-north-koreas-kim-jong-un-again-as-soon-as-this-year-13418373",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-kim-jong-un_7001189.jpg?20250825195540",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-25 18:30:00",
        "Headline": "The two leaders held three meetings during Mr Trump's first term in office and exchanged a number of, what the president called, \"beautiful\" letters.",
        "Content": " Donald Trump has said he wants to meet North Korean leader Kim Jong Un again. Speaking at the White House as he held talks with the new South Korean president Lee Jae Myung, Mr Trump told reporters: \"I'd like to meet him this year... I look forward to meeting with Kim Jong Un in the appropriate future.\" \"I'd like to have a meeting. I got along great with him,\" President Trump said, adding they \"became very friendly\" during his first term in office. \"We think we can do something in that regard,\" he said, adding that he would like to help the relationship between the two Koreas.  Mr Trump and Mr Kim held three meetings between 2018 and 2019 during Mr Trump's first term and exchanged a number of, what the president called, \"beautiful\" letters. In June 2019, Mr Trump briefly stepped into North Korea from the demilitarized zone (DMZ) with South Korea. The US president on Monday responded to a question about whether he would return to the DMZ by fondly recalling the last time he did so. \"Remember when I walked across the line and everyone went crazy?\" especially the Secret Service, Mr Trump told reporters in the Oval Office. But \"I loved it\", Mr Trump said. He added he felt safe because he had a good relationship with Mr Kim. Mr Trump became the first sitting American president to set foot on North Korean soil six years ago. However, little progress was made in curbing North Korea's nuclear programme, and Mr Trump acknowledged in March this year that Pyongyang is a \"nuclear power\". US correspondent It was Donald Trump's first meeting with the new president of South Korea. A highly unconventional platform for glowing words about the North Korean one. He said he got along \"great\" with Kim Jong Un and would like to meet him again \"this year\". The US president's renewed interest in North Korea appears less about policy and more about theatrics. The historic image of President Trump stepping on to North Korean soil in 2018 gave him global headlines. The timing is curious - North Korea has been busy polishing its nuclear credentials and vowing not to disarm without serious concessions. In other words, Pyongyang is holding the same cards it held four years ago, only now they're shinier. But Trump seems eager to revive his image as the only US president bold, or brash, enough to break bread with the ruler of the \"Hermit Kingdom\". Supporters call it visionary diplomacy; critics call it reality TV masquerading as foreign policy. Either way, President Trump clearly sees value in the spectacle. Whether Kim Jong Un does is another story. Read more from Sky News:Temperature records broken in Wales and Northern IrelandEx-champion expecting 'big fine' after outburst at US Open Since Mr Trump's first-term meetings with Mr Kim ended, North Korea has shown no interest in returning to talks. The White House said in June that Mr Trump would welcome communications with Mr Kim. The attempts at rapprochement come after the election in South Korea of Mr Lee, who has pledged to reopen dialogue with North Korea. As a gesture of engagement in June, Mr Lee suspended South Korean loudspeakers blasting music and messages into the North at the DMZ along their shared border. Analysts say, however, that engaging North Korea will likely be more difficult for both Mr Lee and Mr Trump than it was in the president's first term. Since then, North Korea has significantly expanded its nuclear weapons and ballistic missile programmes. And it has developed close ties with Russia through direct support for Moscow's war in Ukraine, with Pyongyang providing both troops and weaponry. Mr Kim told Russian President Vladimir Putin that his country will always stand with Moscow, state media reported in June."
    },
    {
        "title": "Trump wants a reunion with Kim Jong Un - the timing is curious",
        "description": "It was Donald Trump's first meeting with the new president of South Korea.",
        "url": "https://news.sky.com/story/kim-possible-why-trump-wants-another-meeting-with-north-korean-dictator-13418486",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-kim-north-korea_7001447.jpg?20250826014454",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-08-25 22:58:00",
        "Headline": "Fresh off a meeting with Vladimir Putin, Donald Trump now wants to set up another eyebrow-raising meeting with a world leader - Kim Jong Un of North Korea. The pair have met before, and in historic circumstances.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It was Donald Trump's first meeting with the new president of South Korea. A highly unconventional platform for glowing words about the North Korean one. As he sat across from Lee Jae Myung, Mr Trump said he got along \"great\" with Kim Jong Un and would like to meet him again \"this year\". He said he would like to help the relationship between the two Koreas. Curious timing The US president's renewed interest in North Korea appears less about policy and more about theatrics. The historic image of Trump stepping on to North Korean soil in 2019 gave him global headlines. The timing is curious - North Korea has been busy polishing its nuclear credentials and vowing not to disarm without serious concessions. In other words, Pyongyang is holding the same cards it held four years ago, only now they're shinier. 'Hermit Kingdom' But since Trump's first-term meetings with Kim ended, North Korea has shown no interest in returning to talks. But these attempts at rapprochement come after the election in South Korea of Lee, who has pledged to reopen dialogue with North Korea. Trump seems eager to revive his image as the only US president bold, or brash, enough to break bread with the ruler of the \"Hermit Kingdom\". Supporters call it visionary diplomacy; critics call it reality TV masquerading as foreign policy. Either way, Trump clearly sees value in the spectacle. Whether Kim Jong Un does is another story."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador detained by ICE again",
        "description": "A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-detained-by-ice-again-13418237",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kilmar-abrego-garcia_7000993.jpg?20250825143431",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-25 13:28:00",
        "Headline": "The 30-year-old is charged with conspiring to transport illegal immigrants into the US, and has been threatened with deportation to Uganda.",
        "Content": " A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again. Kilmar Abrego Garcia, a 30-year-old originally from El Salvador, handed himself into the ICE field office in Baltimore, Maryland, for a check-in on Monday. The visit was a mandatory condition of his release from federal custody earlier this weekend. However, in a court filing on Saturday, his lawyers said they expected Garcia would be detained again upon attending. Garcia is charged in an indictment, filed in federal court in Tennessee, with conspiring to transport illegal immigrants into the US.  According to a court filing by his lawyers, immigration officials made an offer to Garcia to be deported to Costa Rica in exchange for pleading guilty to the charges. Otherwise, they would seek to deport him to Uganda. Speaking at a news conference outside the ICE office on Monday morning, Garcia said via a translator: \"This administration has hit us hard, but I want to tell you guys something: God is with us, and God will never leave us. \"God will bring justice to all the injustice we are suffering.\" Simon Sandoval-Moshenberg, one of Garcia's lawyers, also said: \"There was no need to take him into ICE detention... the only reason they took him into detention was to punish him.\" A judge later ruled Garcia could not be deported after he filed a challenge asking to be allowed due process to fight any removal attempt. Judge Paula Xinis ruled the 30-year-old must remain detained in the US until she can hold an evidentiary hearing - set for Wednesday. She added there appeared to be \"several grounds\" for her to have jurisdiction to exercise relief, including that Uganda has not agreed to offer Garcia protections, such as being able to walk freely, being given refugee status, and not being re-deported to El Salvador. After initially being detained in Maryland - where he lived with his American wife and children - by ICE in March, Garcia was sent to El Salvador, where he was then imprisoned in the country's maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. The Trump administration admitted deporting Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Garcia on criminal charges that were filed in May. The criminal indictment alleges Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Minutes after his release on Friday, officials notified Garcia they intended to deport him to Uganda. Read more from Sky News:National Guard will carry firearms in Washington DC, official saysDeadly flesh-eating parasite found in person in US for first timeBlack cab rapist investigated over alleged rape 25 years ago Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Mushroom murderer Erin Patterson left me 'half alive', sole survivor says",
        "description": "The sole surviving guest of a lunch where three others died after being served food laced with toxic mushrooms has told an Australian court that the actions of murderer Erin Patterson have left him feeling \"half alive\".",
        "url": "https://news.sky.com/story/mushroom-murderer-erin-patterson-left-me-half-alive-sole-survivor-says-13418045",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mushroom-poisoner-erin-patterson_7000697.jpg?20250825072157",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-25 03:05:00",
        "Headline": "Ian Wilkinson was speaking at the pre-sentencing hearing for Erin Patterson, who was convicted of murdering Mr Wilkinson's wife, Heather, her sister Gail Patterson, and Gail's husband Don with a toxic lunch in July 2023.",
        "Content": "The sole surviving guest of a lunch where three others died after being served food laced with toxic mushrooms has told an Australian court that the actions of murderer Erin Patterson have left him feeling \"half alive\". Ian Wilkinson, who received a liver transplant and spent months in hospital after the poisoning in July 2023, described how he had been left traumatised as he delivered his victim impact statement at Patterson's pre-sentencing hearing in Melbourne. Patterson, 50, was found guilty last month of luring her mother-in-law Gail Patterson, father-in-law Donald Patterson and Gail's sister, Heather Wilkinson, to lunch at her home in Leongatha and poisoning them with individual portions of Beef Wellington that contained toxic death cap mushrooms. A jury also found her guilty of the attempted murder of Mr Wilkinson, Heather's husband.  Speaking at the start of the two-day hearing, Mr Wilkinson, a Baptist pastor, said the death of his wife had left him bereft. \"It's a truly horrible thought to live with that somebody could decide to take her life. I only feel half alive without her,\" he said, breaking down in tears. \"It's one of the distressing shortcomings of our society that so much attention is showered on those who do evil and so little on those who do good.\" \n                  Pro-Palestine Australians protest after week of tension with Israel\n                 \n                  Emma Lovell: Killer of British mother in Australia eligible for earlier release after appeal\n                 \n                  British backpacker pleads guilty after fatally crashing into a father while under influence of alcohol in Australia\n                 'I bear her no ill will' He described Gail and Don Patterson, the parents of Erin Patterson's estranged husband Simon Patterson, as the closest people to him after his wife and family. \"My life is greatly impoverished without them,\" Mr Wilkinson said. \"I'm distressed that Erin has acted with callous and calculated disregard for my life and the lives of those I love. What foolishness possesses a person to think that murder could be the solution to their problems, especially the murder of people who have only good intentions towards her?\" He called on Patterson, who said the poisonings were accidental and continues to maintain her innocence, to confess to her crimes. \"I encourage Erin to receive my offer of forgiveness for those harms done to me with full confession and repentance. I bear her no ill will,\" he said. \"I am no longer Erin Patterson's victim and she has become the victim of my kindness.\" Read more from Sky News:National Guard will begin carrying firearms in Washington DCFlesh-eating screwworm parasite detected in person in US for first time The court received a total of 28 victim impact statements, of which seven were read publicly. 'An irreparably broken home' Patterson's estranged husband Simon Patterson - who was invited to the lunch but declined - spoke of the devastating impact on the couple's two children. \"The grim reality is they live in an irreparably broken home with only a solo parent, when almost everyone else knows their mother murdered their grandparents,\" he said in a statement that was read out on his behalf. Patterson attended the court in person on Monday rather than watch via a video link from prison which she did during a hearing earlier this month. The hearing is scheduled to continue on Tuesday. Patterson faces a potential life sentence for each of the murders and 25 years for attempted murder. She has 28 days from the day of her sentencing to appeal, but has not yet indicated whether she will do so."
    },
    {
        "title": "Hundreds of thousands evacuated and airports closed due to Vietnam typhoon",
        "description": "Hundreds of thousands of people have been evacuated, and airports and schools closed after a typhoon made landfall in Vietnam.",
        "url": "https://news.sky.com/story/hundreds-of-thousands-evacuated-and-airports-closed-due-to-vietnam-typhoon-13418122",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-typhoon-kajiki-vietnam_7000845.jpg?20250825101531",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-25 09:02:00",
        "Headline": "Typhoon Kajiki, which has winds of up to 103mph, hit Vietnam's north central coast on Monday, toppling trees, flooding homes, and cutting power supplies.",
        "Content": "Hundreds of thousands of people have been evacuated, and airports and schools closed after a typhoon made landfall in Vietnam. Typhoon Kajiki, which has winds of up to 103mph, hit Vietnam's north central coast on Monday, toppling trees, flooding homes, and cutting power supplies, state media reported. It has already caused devastation in southern China, with strong winds and heavy rain on Hainan Island and parts of Guangdong province on Sunday. Some 20,000 people were evacuated from high-risk areas, according to China's Xinhua News Agency. In Vietnam, there were plans to evacuate 600,000 people and 152,000 homes across Thanh Hoa, Quang Tri, and Danang provinces, state media reported. The government has also mobilised 16,500 soldiers and 107,000 paramilitary personnel to assist with evacuations and rescue missions. \"This is an extremely dangerous, fast-moving storm,\" a government spokesman said on Sunday. One man died in Nghe An province on Friday after being electrocuted while trying to secure his roof, according to state media. In Ha Tinh province on Monday, roofs were blown off and floating fishing farms were washed away. Dang Xuan Phuong, a 48-year-old resident of Cua Lo, a tourist town in Nghe An, described the storm as \"terrifying\". \"When I look down from the higher floors, I could see waves as tall as two metres, and the water has flooded the roads around us,\" he told Reuters. Two airports, one in Thanh Hoa and the other in Quang Binh province, were closed, the country's civil aviation authority said, and boats were ordered not to leave their ports. Vietnam Airlines and Vietjet also cancelled dozens of flights in the region, the operators confirmed. Read more from Sky NewsFive killed at Niagara FallsWorkers dead after bridge collapses17 dead after car bombing and helicopter attack After moving through Vietnam, it is expected to move inland across Laos and northern Thailand. Vietnam's coastline on the South China Sea is particularly prone to storms that often trigger deadly flooding and landslides. Kajiki is due to be more powerful than Typhoon Yagi, which killed 300 people and caused £2.4bn in damage last year. Cyclones forming closer to land A study published last year warned that climate change will cause southeast Asian cyclones to form closer to land, strengthening faster and lasting for longer, putting more lives at risk. Professor of Earth Science Benjamin P. Horton, of City University Hong Kong, said: \"It's frightening to see our projections from just last year already materialising. We are no longer predicting the future - we are living it.\" China's southernmost province downgraded its emergency response alert on Monday morning but warned of further disruption and damage. People in the holiday resort of Sanya on Hainan Island were forced to take shelter on Sunday evening, with broken trees and damaged buildings reported on Monday."
    },
    {
        "title": "Donald Trump says he wants to meet North Korea's Kim Jong Un again - as soon as 'this year'",
        "description": "Donald Trump has said he wants to meet North Korean leader Kim Jong Un again.",
        "url": "https://news.sky.com/story/donald-trump-says-he-wants-to-meet-north-koreas-kim-jong-un-again-as-soon-as-this-year-13418373",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-kim-jong-un_7001189.jpg?20250825195540",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-25 18:30:00",
        "Headline": "The two leaders held three meetings during Mr Trump's first term in office and exchanged a number of, what the president called, \"beautiful\" letters.",
        "Content": " Donald Trump has said he wants to meet North Korean leader Kim Jong Un again. Speaking at the White House as he held talks with the new South Korean president Lee Jae Myung, Mr Trump told reporters: \"I'd like to meet him this year... I look forward to meeting with Kim Jong Un in the appropriate future.\" \"I'd like to have a meeting. I got along great with him,\" President Trump said, adding they \"became very friendly\" during his first term in office. \"We think we can do something in that regard,\" he said, adding that he would like to help the relationship between the two Koreas.  Mr Trump and Mr Kim held three meetings between 2018 and 2019 during Mr Trump's first term and exchanged a number of, what the president called, \"beautiful\" letters. In June 2019, Mr Trump briefly stepped into North Korea from the demilitarized zone (DMZ) with South Korea. The US president on Monday responded to a question about whether he would return to the DMZ by fondly recalling the last time he did so. \"Remember when I walked across the line and everyone went crazy?\" especially the Secret Service, Mr Trump told reporters in the Oval Office. But \"I loved it\", Mr Trump said. He added he felt safe because he had a good relationship with Mr Kim. Mr Trump became the first sitting American president to set foot on North Korean soil six years ago. However, little progress was made in curbing North Korea's nuclear programme, and Mr Trump acknowledged in March this year that Pyongyang is a \"nuclear power\". US correspondent It was Donald Trump's first meeting with the new president of South Korea. A highly unconventional platform for glowing words about the North Korean one. He said he got along \"great\" with Kim Jong Un and would like to meet him again \"this year\". The US president's renewed interest in North Korea appears less about policy and more about theatrics. The historic image of President Trump stepping on to North Korean soil in 2018 gave him global headlines. The timing is curious - North Korea has been busy polishing its nuclear credentials and vowing not to disarm without serious concessions. In other words, Pyongyang is holding the same cards it held four years ago, only now they're shinier. But Trump seems eager to revive his image as the only US president bold, or brash, enough to break bread with the ruler of the \"Hermit Kingdom\". Supporters call it visionary diplomacy; critics call it reality TV masquerading as foreign policy. Either way, President Trump clearly sees value in the spectacle. Whether Kim Jong Un does is another story. Read more from Sky News:Temperature records broken in Wales and Northern IrelandEx-champion expecting 'big fine' after outburst at US Open Since Mr Trump's first-term meetings with Mr Kim ended, North Korea has shown no interest in returning to talks. The White House said in June that Mr Trump would welcome communications with Mr Kim. The attempts at rapprochement come after the election in South Korea of Mr Lee, who has pledged to reopen dialogue with North Korea. As a gesture of engagement in June, Mr Lee suspended South Korean loudspeakers blasting music and messages into the North at the DMZ along their shared border. Analysts say, however, that engaging North Korea will likely be more difficult for both Mr Lee and Mr Trump than it was in the president's first term. Since then, North Korea has significantly expanded its nuclear weapons and ballistic missile programmes. And it has developed close ties with Russia through direct support for Moscow's war in Ukraine, with Pyongyang providing both troops and weaponry. Mr Kim told Russian President Vladimir Putin that his country will always stand with Moscow, state media reported in June."
    },
    {
        "title": "Trump wants a reunion with Kim Jong Un - the timing is curious",
        "description": "It was Donald Trump's first meeting with the new president of South Korea.",
        "url": "https://news.sky.com/story/kim-possible-why-trump-wants-another-meeting-with-north-korean-dictator-13418486",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-kim-north-korea_7001447.jpg?20250826014454",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-25 22:58:00",
        "Headline": "Fresh off a meeting with Vladimir Putin, Donald Trump now wants to set up another eyebrow-raising meeting with a world leader - Kim Jong Un of North Korea. The pair have met before, and in historic circumstances.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It was Donald Trump's first meeting with the new president of South Korea. A highly unconventional platform for glowing words about the North Korean one. As he sat across from Lee Jae Myung, Mr Trump said he got along \"great\" with Kim Jong Un and would like to meet him again \"this year\". He said he would like to help the relationship between the two Koreas. Curious timing The US president's renewed interest in North Korea appears less about policy and more about theatrics. The historic image of Trump stepping on to North Korean soil in 2019 gave him global headlines. The timing is curious - North Korea has been busy polishing its nuclear credentials and vowing not to disarm without serious concessions. In other words, Pyongyang is holding the same cards it held four years ago, only now they're shinier. 'Hermit Kingdom' But since Trump's first-term meetings with Kim ended, North Korea has shown no interest in returning to talks. But these attempts at rapprochement come after the election in South Korea of Lee, who has pledged to reopen dialogue with North Korea. Trump seems eager to revive his image as the only US president bold, or brash, enough to break bread with the ruler of the \"Hermit Kingdom\". Supporters call it visionary diplomacy; critics call it reality TV masquerading as foreign policy. Either way, Trump clearly sees value in the spectacle. Whether Kim Jong Un does is another story."
    },
    {
        "title": "Lil Nas X pleads not guilty after being charged with assaulting police officer",
        "description": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear.",
        "url": "https://news.sky.com/story/lil-nas-x-pleads-not-guilty-after-being-charged-with-assaulting-police-officer-13418434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lil-nas-x-montero-lamar-hill_7001360.jpg?20250825221451",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-25 20:36:00",
        "Headline": "The musician, real name Montero Lamar Hill, faces three counts of battery with injury on a police officer and one count of resisting an executive officer.",
        "Content": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear. The musician, real name Montero Lamar Hill, was taken to hospital and arrested after police responded to reports of a naked man shortly before 6am on Thursday. The district attorney's office said on Monday that Lil Nas X faces three counts of battery with injury on a police officer and one count of resisting an executive officer. He was being held on a $75,000 (£55,457) bail, conditional on attending drug treatment. It is not immediately clear whether he had posted it and been released yet. He is set to return to court on 15 September for his next pre-trial hearing. During the hearing on Monday, Hill's lawyer Christy O'Connor told the judge he had led a \"remarkable\" life, adding: \"Assuming the allegations here are true, this is an absolute aberration in this person's life. \"Nothing like this has ever happened to him.\" A law enforcement source told Sky's US partner network, NBC News, on Thursday that the Old Town Road and Industry Baby hitmaker punched an officer twice in the face during the encounter. The source added officers were unsure whether he was on any substances or in mental distress. Read more from Sky News:Black cab rapist under investigationNational Guard to begin carrying firearms in DCTrump says he wants to meet Kim Jong Un again NBC News cited TMZ footage where Hill was seen walking down the middle of Ventura Boulevard at 4am on Thursday in a pair of white briefs and cowboy boots. In the videos, Hill tells a driver to \"come to the party\" in one clip and in another tells the person: \"Didn't I tell you to put the phone down?\" \"Uh oh, someone's going to have to pay for that,\" Hill says as he continues to walk away. In some clips, Hill struts as if he's on a catwalk, posing for onlookers, and at one point he places an orange traffic cone on his head."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador detained by ICE again",
        "description": "A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-detained-by-ice-again-13418237",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kilmar-abrego-garcia_7000993.jpg?20250825143431",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-25 13:28:00",
        "Headline": "The 30-year-old is charged with conspiring to transport illegal immigrants into the US, and has been threatened with deportation to Uganda.",
        "Content": " A man who was wrongly deported from the US to El Salvador has been detained by Immigration and Customs Enforcement (ICE) again. Kilmar Abrego Garcia, a 30-year-old originally from El Salvador, handed himself into the ICE field office in Baltimore, Maryland, for a check-in on Monday. The visit was a mandatory condition of his release from federal custody earlier this weekend. However, in a court filing on Saturday, his lawyers said they expected Garcia would be detained again upon attending. Garcia is charged in an indictment, filed in federal court in Tennessee, with conspiring to transport illegal immigrants into the US.  According to a court filing by his lawyers, immigration officials made an offer to Garcia to be deported to Costa Rica in exchange for pleading guilty to the charges. Otherwise, they would seek to deport him to Uganda. Speaking at a news conference outside the ICE office on Monday morning, Garcia said via a translator: \"This administration has hit us hard, but I want to tell you guys something: God is with us, and God will never leave us. \"God will bring justice to all the injustice we are suffering.\" Simon Sandoval-Moshenberg, one of Garcia's lawyers, also said: \"There was no need to take him into ICE detention... the only reason they took him into detention was to punish him.\" A judge later ruled Garcia could not be deported after he filed a challenge asking to be allowed due process to fight any removal attempt. Judge Paula Xinis ruled the 30-year-old must remain detained in the US until she can hold an evidentiary hearing - set for Wednesday. She added there appeared to be \"several grounds\" for her to have jurisdiction to exercise relief, including that Uganda has not agreed to offer Garcia protections, such as being able to walk freely, being given refugee status, and not being re-deported to El Salvador. After initially being detained in Maryland - where he lived with his American wife and children - by ICE in March, Garcia was sent to El Salvador, where he was then imprisoned in the country's maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. The Trump administration admitted deporting Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Garcia on criminal charges that were filed in May. The criminal indictment alleges Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Minutes after his release on Friday, officials notified Garcia they intended to deport him to Uganda. Read more from Sky News:National Guard will carry firearms in Washington DC, official saysDeadly flesh-eating parasite found in person in US for first timeBlack cab rapist investigated over alleged rape 25 years ago Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Former champion Daniil Medvedev expecting 'big fine' after outburst at US Open",
        "description": "Daniil Medvedev has said he is expecting a \"big fine\" after a meltdown at the US Open as his opponent was serving for the match.",
        "url": "https://news.sky.com/story/former-champion-daniil-medvedev-expecting-big-fine-after-outburst-at-us-open-13418271",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-daniil-medvedev-us-open_7001092.jpg?20250825173924",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-25 16:09:00",
        "Headline": "The Russian tennis player was enraged by the chair umpire's decision to award his French opponent a first serve after a photographer prematurely entered the court on match point.",
        "Content": " Daniil Medvedev has said he is expecting a \"big fine\" after a meltdown at the US Open as his opponent was serving for the match. The former champion's first round clash was delayed by nearly seven minutes after a photographer prematurely entered the court on match point between Benjamin Bonzi's first and second serve. The Russian tennis player, who won the tournament in 2021, was enraged by the chair umpire's decision to award his French opponent a first serve following the incident, which happened when Bonzi was serving at 6-3 7-5 5-4 with the advantage, at Louis Armstrong Stadium. A photographer entered the court, prompting chair umpire Greg Allensworth to shout: \"Wait please, not now. Get off the court, please,\" before announcing that Bonzi would get another first serve because of the delay.  \"First serve. Ladies and gentlemen, because of the delay caused by an onside interference, first serve has been granted,\" Allensworth announced. A furious Medvedev then approached the chair to complain about the decision and whipping up the booing crowd. He shouted: \"Are you a man? Why are you shaking? He wants to go home guys, he doesn't like to be here. He gets paid by the match, not by the hour.\" Although Medvedev then returned to the baseline, he continued to encourage the reaction of the crowd and it was more than six minutes before Bonzi finally hit his serve. When Bonzi finally did, he double-faulted. Medvedev won the game and then took the set in a tie-breaker to prolong the clash. However, the Frenchman eventually sealed a 6-3 7-5 6-7 (5-7) 0-6 6-4 victory with a visibly emotional Medvedev smashing his racket against his chair as Bonzi celebrated. Medvedev placed the blame on the crowd after the defeat, saying: \"What I say and what I do, in my head, I want to do worse, and I cannot because there are rules, because we're on a tennis court. \"So I just expressed my emotions, my unhappiness with the decision, and then the crowd did what they did without me asking them too much, and it was fun to witness.\" Read more from Sky News:Warmest August bank holiday Monday on record in Wales and Northern IrelandOfwat probes payments to water bosses after Yorkshire row The 29-year-old Russian declined to speak more about Allensworth, adding: \"I'm getting a big fine enough, so if I speak, I'm in big trouble, so I'm not going to speak.\" Bonzi was unhappy with Medvedev's behaviour, saying: \"Daniil started it, and he put oil on the fire. He went crazy with the crowd. Honestly, I never saw that.\""
    },
    {
        "title": "Ofwat probes payments to water bosses after Yorkshire row",
        "description": "The water industry watchdog is probing payments to the bosses of a string of suppliers following the revelation that Yorkshire Water's offshore parent company had handed its chief executive more than &#163;1m in previously undisclosed fees.",
        "url": "https://news.sky.com/story/ofwat-probes-payments-to-water-bosses-after-yorkshire-row-13418238",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-water-taps-drink-glass_6362222.jpg?20231116083058",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-25 13:39:00",
        "Headline": "The regulator, which is due to be abolished by the government, has written to water companies to investigate whether they have paid executives via offshore vehicles, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The water industry watchdog is probing payments to the bosses of a string of suppliers following the revelation that Yorkshire Water's offshore parent company had handed its chief executive more than £1m in previously undisclosed fees. Sky News has learnt that Ofwat, which is to be abolished by the government in the coming years, wrote to a number of water companies earlier this month to scrutinise similar remuneration arrangements to those employed by Yorkshire Water and its holding company, Kelda Holdings. Industry sources said on Monday that some of the biggest operators in the sector were among the recipients of Ofwat's letter. Disclosure of the regulator's enquiries comes in the wake of a report in The Guardian which said Nicola Shaw, the Yorkshire Water boss, had received payments of £660,00 from Jersey-registered Kelda in each of the last two financial years.  Read more from Sky NewsTikTok puts hundreds of UK jobs at riskCoca Cola brews up sale of CostaGupta struggles to fund bid for UK steel arm A source close to Ofwat insisted that its investigation of similar pay arrangements had been planned prior to the reporting of Ms Shaw's remuneration. \"We are currently reviewing water companies' compliance with the performance-related pay prohibition rule. \"As part of this assessment, we have written to several companies to request more information on the remuneration decisions they have set out in their annual accounts. \"Where we find evidence that a company has breached the rule, we have powers to direct companies to take remedial actions which, if not complied with, can result in companies facing enforcement action - including financial penalties.\" Water industry pay has become an increasingly incendiary topic in recent months amid a slew of fines levied against operators across Britain for their failure to prevent leaks and major pollution incidents. Sky News revealed earlier this month that David Black, the Ofwat chief executive, would step down following the publication of a government-commissioned review calling for the body to be scrapped."
    },
    {
        "title": "Far right 'emboldened' says MP as Starmer faces mounting pressure over immigration",
        "description": "Sir Keir Starmer faces mounting pressure over the small boats crisis after protests outside asylum hotels continued over the bank holiday weekend.",
        "url": "https://news.sky.com/story/starmer-facing-mounting-pressure-over-immigration-as-mp-says-far-right-emboldened-13418054",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-starmer-white-house_6994974.jpg?20250819042226",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-25 05:24:00",
        "Headline": "A poll suggested that voters believe the prime minister is failing to grip the problem, despite his government setting out measures to speed up removals.",
        "Content": "Sir Keir Starmer faces mounting pressure over the small boats crisis after protests outside asylum hotels continued over the bank holiday weekend. A poll suggested that voters believe the prime minister is failing to grip the problem, despite his government setting out measures to speed up removals. It comes as Green Party co-leader Carla Denyer warned that \"the far right feels emboldened and validated\" by other political parties. So far this year a record 28,076 people have made the perilous journey across the English Channel in small boats, 46% more than in the same period in 2024. Like many other European countries, immigration has increasingly become a flashpoint in recent years as the UK deals with an influx of people fleeing war-torn and poorer countries seeking a better life. Official figures released earlier this month showed a total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001. There were 32,059 asylum seekers in UK hotels by the end of the same month. Protests and counterprotests at sites housing asylum seekers continued over the weekend and the government is braced for further legal fights over the use of hotels. Read more:Fast-track asylum appeals process to be introduced A YouGov poll for The Times found that 71% per cent of voters believe Sir Keir is handling the asylum hotel issue badly, including 56% of Labour supporters. The survey of 2,153 people carried out on August 20-21 found 37% of voters viewed immigration and asylum as the most important issue facing the country, ahead of 25% who said the economy and 7% who said the health service. Ms Denyer, who is MP for Bristol Central, condemned threats of violence in the charged atmosphere around immigration. \"The far right feels emboldened and validated by other political parties dancing to their tune. \"The abuse I've been sent has got noticeably worse in the last few months, escalating in some cases to violent threats, which are reported to the police. \"It doesn't matter how much you disagree with someone, threats of violence are never, ever OK. And they won't silence me.\"  Chief political correspondent Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem. The former director of public prosecutions would appear to see overhauling court procedures and the legal process as the answer to any tricky situation. Yes, the proposed fast-track asylum appeals process is fine as far as it goes. But for a government confronted with a massive migrant crisis, opponents claim it's mere tinkering. And welcome and worthy as it is, it isn't going to \"smash the gangs\", stop the boats or act as a powerful deterrent to the people smugglers plying their trade in the Channel. Read more"
    },
    {
        "title": "Lil Nas X pleads not guilty after being charged with assaulting police officer",
        "description": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear.",
        "url": "https://news.sky.com/story/lil-nas-x-pleads-not-guilty-after-being-charged-with-assaulting-police-officer-13418434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lil-nas-x-montero-lamar-hill_7001360.jpg?20250825221451",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-25 20:36:00",
        "Headline": "The musician, real name Montero Lamar Hill, faces three counts of battery with injury on a police officer and one count of resisting an executive officer.",
        "Content": "US rapper Lil Nas X has pleaded not guilty after being charged with assaulting a police officer while walking in downtown Los Angeles in his underwear. The musician, real name Montero Lamar Hill, was taken to hospital and arrested after police responded to reports of a naked man shortly before 6am on Thursday. The district attorney's office said on Monday that Lil Nas X faces three counts of battery with injury on a police officer and one count of resisting an executive officer. He was being held on a $75,000 (£55,457) bail, conditional on attending drug treatment. It is not immediately clear whether he had posted it and been released yet. He is set to return to court on 15 September for his next pre-trial hearing. During the hearing on Monday, Hill's lawyer Christy O'Connor told the judge he had led a \"remarkable\" life, adding: \"Assuming the allegations here are true, this is an absolute aberration in this person's life. \"Nothing like this has ever happened to him.\" A law enforcement source told Sky's US partner network, NBC News, on Thursday that the Old Town Road and Industry Baby hitmaker punched an officer twice in the face during the encounter. The source added officers were unsure whether he was on any substances or in mental distress. Read more from Sky News:Black cab rapist under investigationNational Guard to begin carrying firearms in DCTrump says he wants to meet Kim Jong Un again NBC News cited TMZ footage where Hill was seen walking down the middle of Ventura Boulevard at 4am on Thursday in a pair of white briefs and cowboy boots. In the videos, Hill tells a driver to \"come to the party\" in one clip and in another tells the person: \"Didn't I tell you to put the phone down?\" \"Uh oh, someone's going to have to pay for that,\" Hill says as he continues to walk away. In some clips, Hill struts as if he's on a catwalk, posing for onlookers, and at one point he places an orange traffic cone on his head."
    }
]