[
    {
        "title": "England warned it faces six million new cancer cases by 2040 - with these areas worst hit",
        "description": "More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities.",
        "url": "https://news.sky.com/story/england-warned-it-faces-six-million-new-cancer-cases-by-2040-with-these-areas-worst-hit-13418850",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cancer-doctor_7001975.jpg?20250826190700",
        "type": "Home",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-08-26 17:16:00",
        "Headline": "A coalition of more than 60 cancer charities is warning the government must take urgent steps to tackle cancer care in England.",
        "Content": "By Laura Bundock, health correspondent  More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities. This would equate to a diagnosis every two minutes, which is up from one every four minutes in the 1970s. A coalition of more than 60 cancer charities, known as One Cancer Voice, is warning the government must take urgent steps to tackle cancer care in England - including faster diagnosis targets and better prevention policies. The analysis carried out by the charities is based largely on pre-pandemic data and suggests cases will increase by 14.2% over the next 15 years, with diagnoses of some of the most common cancers reaching all-time highs. This includes over a million new prostate cancer diagnoses, and more than 900,000 for breast cancer by 2040. The research also finds regional variations: • South East - over a million diagnoses • North East - 865,000 • East of England and the South West - 722,000 • London - 714,000  Six key demands These figures starkly set out the need for change, and the timing of their release is significant. Later this autumn, the government is expected to publish its long-awaited National Cancer Plan. These leading charities have combined forces to put pressure on ministers ahead of its publication, demanding six measures which they say must be implemented if cancer outcomes are to improve: • A pledge to meet all cancer waiting times by the end of parliament in 2029 • A new earlier diagnosis target, with improved screening programmes • The introduction of strong cancer prevention policies • Addressing inequalities in patient care • Improving access to clinical trials for cancer patients • Better support for people to live well with and beyond cancer 'A defining moment' The pandemic had a huge impact on cancer care in the country, and an ageing population adds further pressures. But the most recently available data, which is around a decade old, suggests the NHS is still lagging behind many comparable countries. The chief executive of Cancer Research UK, Michelle Mitchell, described the national plan as a \"defining moment\". \"If the UK government delivers an ambitious fully funded strategy, we could save more lives and transform cancer outcomes, propelling England from world lagging to among world leading when it comes to tackling this disease,\" she said. Read more:Are we are entering 'golden age' of cancer treatment? A Department of Health and Social Care spokesperson said: \"This government is prioritising cancer care as we turn around more than a decade of neglect of our NHS. \"We're already making an impact, with 95,000 more people having cancer diagnosed or ruled out within 28 days between July 2024 and May 2025, compared to the same period the previous year. \"This will soon be supported by our new National Cancer Plan, setting out how cancer care will improve over the coming years. \"We're also making it easier for people to get tests, checks, and scans with DIY screening kits for cervical cancer, new radiotherapy machines in every region, and by creating the first smoke-free generation.\""
    },
    {
        "title": "Air India crash: Families prepared for court fight over disaster which left 241 dead",
        "description": "\"Our world has fallen apart, and we want justice,\" says Nehal, her eyes welling up.",
        "url": "https://news.sky.com/story/air-india-crash-families-prepared-for-court-fight-over-disaster-which-left-241-dead-13418767",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-girish-airindia_7001892.png?20250826194057",
        "type": "Home",
        "Author": "Neville Lazarus",
        "Date Published": "2025-08-26 14:06:00",
        "Headline": "Indian and British families have consented to American law firm Beasley Allen to represent them in US courts following the crash that killed 241 people on board and a further 19 on the ground.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  \"Our world has fallen apart, and we want justice,\" says Nehal, her eyes welling up. \"We lost four members of our family. I can't even tell you what we've been through. Just thinking of it makes me cry.\" Nehal's 32-year-old brother Girish, a British resident from Wembley, had travelled with his wife, their three-year-old son and infant daughter to meet his ailing mum in Diu, India. They were on that fateful flight back to the UK: the Air India flight from Ahmedabad to Gatwick, which went down just 32 seconds after take off on 12 June.  The Boeing aircraft, with 230 passengers and 12 crew members, crashed into a hostel block of the BJ Medical college, just about a mile from the runway. A total of 241 people on board were killed, while a further 19 people died on the ground. There were 53 UK citizens on the plane and only one miraculously survived: 39-year-old Vishwas Kumar Ramesh. 'We want justice' Nehal says her family's world has been crushed, as her brother supported the family financially by paying the rent and for their mother's medication. Two garlanded frames of the young couple and their children take centre place in her small home. Nehal's mother is bedridden and has fallen into depression. Nehal says: \"Whatever happened to us must not happen to any other family. And those responsible must accept their mistake. We want justice.\" She is among 90 Indian and British families who have consented to US law firm Beasley Allen to represent them in American courts. It is gathering evidence regarding the root cause of the crash and is prepared to take legal action. 'We're going to fight for the truth' Trupti Soni lost her brother, his wife, and sister-in-law. She wants an independent investigation to uncover any \"technical snag, design faults\" or other issues may have contributed to the disaster. \"Our loss is massive - nothing can reverse the loss of our dear ones. I feel the truth must come out,\" she says. Her brother Swapnil was travelling to the UK for work, and also to welcome the eldest brother who was driving from Ahmedabad to London - a lifelong dream. \"We're going to fight for the truth and whoever fights for the truth, God is with them,\" Trupti says. 'No one should suffer what we have been through' Harsad is another who is grieving, having lost his parents Devji Lacmane and Vanita in the crash. \"We definitely want justice; we want to know whose fault caused the crash. Thousands of aircraft are in the skies - are they safe? No one should suffer what our family has been through.\" Fourteen of those who died in the crash had their roots in Diu - a tiny sliver of land on the Gujarat coast. Survivor Vishwas Kumar Ramesh is also from here. Diu, a former Portuguese colony, was liberated in 1961, its residents offered citizenship of Portugal. Many took it and then made their way to Britain. With just over 50,000 people, almost everyone here has been touched by this tragedy. At night, a gathering of families of the crash came to pay their last respects. Vishwas was there for the rituals of his younger brother Ajay, who was sitting beside him on that fateful flight.  Questions unanswered The preliminary investigative report into the crash threw up more questions than answers. It indicated pilot error, and the cutting off of fuel to the engines. It also said there were no safety recommendations to the makers of the aircraft, which led to a backlash from the pilot community. Mike Andrews, the principal attorney of Beasley Allen, told Sky News: \"I think it is more likely at this point that it is a technological or an electrical issue rather than human error. \"But anyone who speculates too far either way is doing so without all the necessary evidence. \"That data that is needed is contained within the flight data recorder.\" Sky News has approached Boeing for comment and has not received a response yet. Read more:Plane suffered 'no mechanical fault' before crashAnger growing as Air India families wait for relatives' remains  Citing published directives on the plane's airworthiness from Federal Aviation Authority bulletins, and Boeing documents available online, Mr Andrews said the 787 \"apparently has issues with leaks in water lines\" which feed the front and rear restrooms, toilets, and kitchen areas. Those leaks can affect areas in which electrical and computer equipment are housed, he said, adding: \"Anyone who's ever had an iPhone which gets wet understands that electronics and water typically don't mix very well.\" Mr Andrews drew attention to what's known as the TCMA, or throttle control malfunction accommodation. It is \"essentially a safety system that looks at the speed of the engine relative to the position of the throttle and determines if the engine is overspeeding while the plane is on the ground\", he explained. \"It has the ability to shut off or control the engines autonomously if it makes that decision in its logic or sensors. So obviously if it becomes wet, and you develop an electrical short, you have a short in this system. \"The issue is we know there are various computer systems on the 787 which can call for uncommanded inputs or controls to the plane. We are very concerned that could lead to the sort of problem we see here.\" Investigations are ongoing, and a final report is due in a year's time. But families want answers and so far, they have none - in one of the deadliest aviation disasters India has seen."
    },
    {
        "title": "Nigel Farage has a new 'leave' campaign - here's how it could work and how it might impact you",
        "description": "Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election.",
        "url": "https://news.sky.com/story/nigel-farage-has-another-leave-campaign-how-would-it-work-and-how-might-you-be-impacted-13418933",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-echr_7002337.jpg?20250826235508",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-08-26 19:51:00",
        "Headline": "Not content with Britain having left the EU, Nigel Farage now wants to see the country leave the European Convention on Human Rights. But what even is it, how could we actually leave, and how would our rights be impacted? Sky News explains.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election. The party's leader also reaffirmed his pledge to repeal the Human Rights Act and disapply three other international treaties acting as \"roadblocks\" to deporting anyone entering the UK illegally. In a speech about tackling illegal migration, he said a Reform government would detain and deport any migrants arriving illegally, including women and children, and they would \"never, ever be allowed to stay\". Sky News looks at what the ECHR is, how the UK could leave, and what could happen to human rights protections if it does. What is the ECHR? On 4 November 1950, the 12 member states of the newly formed Council of Europe (different to the EU) signed the Convention for the Protection of Human Rights and Fundamental Freedoms - otherwise known as the ECHR. It came into force on 3 September 1953 and has since been signed by an additional 34 Council of Europe members who have joined, bringing the total to 46 signatories. The treaty was drafted in the aftermath of the Second World War and the Holocaust to protect people from the most serious human rights violations. It was also in response to the growth of Stalinism in central and Eastern Europe to protect members from communist subversion. The treaty was the first time fundamental human rights were guaranteed in law. Sir Winston Churchill helped establish the Council of Europe and was a driving force behind the ECHR, which came from the Charter of Human Rights that he championed and was drafted by British lawyers. To be a signatory of the ECHR, a state has to be a member of the Council of Europe - and they must \"respect pluralist democracy, the rule of law and human rights\". There are 18 sections, including the most well-known: Article 1 (the right to life), Article 3 (prohibition of torture), Article 6 (right to a fair trial), Article 8 (right to private and family life) and Article 10 (right to freedom of expression). The ECHR has been used to halt the deportation of migrants in 13 out of 29 UK cases since 1980. ECHR protections are enforced in the UK through the Human Rights Act 1998, which incorporates most ECHR rights into domestic law. This means individuals can bring cases to UK courts to argue their ECHR rights have been violated, instead of having to take their case to the European Court of Human Rights. Article 8 is the main section that has been used to stop illegal migrant deportations, but Article 3 has also been successfully used. Read more:Why Farage's small boats plan is not actually about policyLegal expert explains if Farage deportation plan would work How is it actually used? The ECHR is interpreted by the European Court of Human Rights (ECtHR) - you'll have to bear with us on the confusingly similar acronyms. The convention is interpreted under the \"living instrument doctrine\", meaning it must be considered in the light of present-day conditions. The number of full-time judges corresponds to the number of ECHR signatories, so there are currently 46 - each nominated by their state for a non-renewable nine-year term. But they are prohibited from having any institutional ties with the state they come from. An individual, group of individuals, or one or more of the signatory states can lodge an application alleging one of the signatory states has breached their human rights. Anyone who have exhausted their human rights case in UK courts can apply to the ECtHR to have their case heard in Strasbourg. All ECtHR hearings must be heard in public, unless there are exceptional circumstances to be heard in private, which happens most of the time following written pleadings. The court may award damages, typically no more than £1,000 plus legal costs, but it lacks enforcement powers, so some states have ignored verdicts and continued practices judged to be human rights violations. Read more: Asylum seekers in charts and numbers How could the UK leave? A country can leave the convention by formally denouncing it, but it would likely have to also leave the Council of Europe as the two are dependent on each other. At the international level, a state must formally notify the Council of Europe of its intention to withdraw with six months' notice, when the UK would still have to implement any ECtHR rulings and abide by ECHR laws. The UK government would have to seek parliament's approval before notifying the ECtHR, and would have to repeal the Human Rights Act 1998 - which would also require parliamentary approval. Would the UK leaving breach any other agreements? Leaving the ECHR would breach the 1998 Good Friday Agreement, a deal between the British and Irish governments on how Northern Ireland should be governed, which could threaten the peace settlement. It would also put the UK's relationship with the EU under pressure as the Brexit deal commits both to the ECHR. The EU has said if the UK leaves the ECHR it would terminate part of the agreement, halting the extradition of criminal suspects from the EU to face trial in the UK. How would the UK's human rights protections change? Certain rights under the ECHR are also recognised in British common law, but the ECHR has a more extensive protection of human rights. For example, it was the ECHR that offered redress to victims of the Hillsborough disaster and the victims of \"black cab rapist\" John Worboys after state investigations failed. Before cases were taken to the ECtHR and the Human Rights Act came into force, the common law did not prevent teachers from hitting children or protect gay people from being banned from serving in the armed forces. Repealing the ECHR would also mean people in the UK would no longer be able to take their case to the ECtHR if the UK courts do not remedy a violation of their rights. The UK's human rights record would then not be subject to the same scrutiny as it is under the ECHR, where states review each other's actions. How human rights in the UK would be impacted depends partly on what would replace the Human Rights Act. Mr Farage has said he would introduce a British Bill of Rights, which would apply only to UK citizens and lawful British citizens. He has said it would not mention \"human rights\" but would include \"the freedom to do everything, unless there's a law that says you can't\" - which is how common law works. Legal commentator Joshua Rozenberg said this would simply confirm the rights to which people are already entitled, but would also remove rights enjoyed by people visiting the UK."
    },
    {
        "title": "Gaza hospital rejects Israel's claim troops 'saw Hamas camera' before deadly attack",
        "description": "A hospital in Gaza that was hit in an Israeli strike, killing 20 people including five journalists, has rejected the Israeli military's claim it struck the facility because it was targeting what it believed was a Hamas surveillance camera as well as people identified as militants.",
        "url": "https://news.sky.com/story/gaza-hospital-rejects-israels-claim-troops-saw-hamas-camera-before-deadly-attack-13418939",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasser-hospital-gaza_7001901.jpg?20250826173207",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-26 19:58:00",
        "Headline": "The IDF claim follows its initial inquiry into the attack on Nasser hospital, which Benjamin Netanyahu has called a \"tragic mishap\".",
        "Content": "A hospital in Gaza that was hit in an Israeli strike, killing 20 people including five journalists, has rejected the Israeli military's claim it struck the facility because it was targeting what it believed was a Hamas surveillance camera as well as people identified as militants. The statement was part of the military's initial inquiry into the attack on Nasser hospital in Khan Younis, which Prime Minister Benjamin Netanyahu has called a \"tragic mishap\". The Israel Defense Forces (IDF) said the back-to-back strikes on the largest hospital in southern Gaza were ordered because soldiers believed militants were using the camera to observe Israeli forces.    It also said it was because Israel has long believed Hamas and other militant groups are present at hospitals - though Israeli officials have rarely provided evidence to support such claims. \"This conclusion was further supported, among other reasons, by the documented military use of hospitals by the terrorist organisations throughout the war,\" the IDF claimed. \n                  Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?\n                 \n                  Home Secretary agrees special biometric check arrangements for Gaza students\n                 \n                  Israel may say it is not targeting journalists - but it is certainly killing a lot of them\n                 It said six of those killed in the strike were \"terrorists\". The military chief of general staff acknowledged several \"gaps\" in the investigation so far, including the kind of ammunition used to take out the camera. The military also said there is an ongoing investigation into the chain of command that approved the strike. However, the army added: \"The chief of the general staff emphasised that the IDF directs its activities solely toward military targets.\" In a statement, the hospital said: \"Nasser hospital categorically reject these claims and any claims made by Israeli authorities to justify attacks on hospital premises.\" Among those killed was 33-year-old Mariam Dagga, a journalist who worked for the Associated Press, Al Jazeera cameraman Mohammed Salama, Reuters contractor Hussam al Masri, Reuters photographer Moaz Abu Taha and Middle East Eye freelancer Ahmed Abu Aziz. The IDF said journalists working for Reuters and the Associated Press \"were not a target of the strike\". Read more: Who are the journalists killed in the attack? The strikes have been condemned by international leaders and human rights groups. \"The killing of journalists in Gaza should shock the world,\" said United Nations Human Rights Office spokesperson Thameen Al-Kheetan. \"Not into stunned silence but into action, demanding accountability and justice.\"  The attack was described as a \"double-tap\" attack, which sees civilians or medical workers rushing to help those injured hit in a second strike. They have previously been seen in the wars in Ukraine and Syria. Hospitals have been repeatedly attacked by Israeli forces throughout the 22-month war in Gaza. The war began on 7 October 2023 when Hamas-led militants stormed into southern Israel, killing some 1,200 people and taking 251 hostage. Israel's military offensive against Hamas has killed at least 62,000 Palestinians, mostly civilians, according to the Hamas-run health ministry, which does not differentiate between civilians and militants in its count but says the majority are women and children."
    },
    {
        "title": "Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?",
        "description": "Nadav is tired, frustrated and haunted, yet he smiles when we meet. For 690 days, he has been waiting for the world to change, and he's still waiting, and hoping.",
        "url": "https://news.sky.com/story/israeli-protesters-demand-netanyahu-does-whatever-it-takes-to-bring-hostages-home-but-is-he-listening-13418951",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tel-aviv-protest-israel_7002180.jpg?20250826214701",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-08-26 20:19:00",
        "Headline": "Israelis are protesting in the streets of Tel Aviv to pressure the government into doing more to prioritise the return of the hostages being held captive in Gaza.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Nadav is tired, frustrated and haunted, yet he smiles when we meet. For 690 days, he has been waiting for the world to change, and he's still waiting, and hoping. Back on 7 October 2023, his father Tal was seized by Hamas and taken to Gaza. Tal is now dead - it's not clear when he died, but the simple, brutal fact of his death is not in doubt. What is unknown - indeed, what cannot be known - is when Tal's body will be returned to Israel. \"My dad is still being held captive, although he is not alive. My life is stuck,\" Nadav tells me. \"In order to continue living and start the healing process, we need them home and we need the war to be over.\"  Around him, banners, signs and the sounds of another day of national protest. Motorways were brought to a halt, huge numbers of people went on strike, all in the name of demanding that the Israeli government do more to prioritise the return of all the hostages. In Nadav's mind, that means searching for compromise and negotiating a ceasefire that ends the war and allows for the return of all the hostages - believed to number 20 who are still alive, and a further 30 who have died. \"We have seen that just using military strength is not enough,\" he says. \"We now have to do whatever it takes, even if it's not perfect.\" \"Even if that means negotiating with Hamas?\" I ask. He nods. \"This war has to come to an end.\" It is a theme we hear again and again. In the crowds that pour into Hostages Square, there is almost unanimity.  \"The prime minister is acting like a tyrant,\" declares one man as he marches down the street. \"He doesn't listen to us - his subjects. He just listens to the people in his cabinet who think that war is always the answer.\" Around us, we regularly see people wearing T-shirts with the slogan \"Stam Wars\", written in the familiar Star Wars style. It is a biting comment dressed up as a joke - stam is a derogatory slang word, basically meaning pointless. \"Our soldiers are being sacrificed,\" says Yoram, as he strolls down the road towards the square. This, of course, is no random sample. Among the crowd are many who viscerally dislike Benjamin Netanyahu, and the truth is that his supporters would be unlikely to join this crowd. Read more:Analysis: Israel says it's not targeting journalists - but it is certainly killing a lot of themAustralia accuses Iran of organising antisemitic attacks And yet they all want the same thing. The prime minister insists that the return of the hostages is his driving motivation, just as the people we spoke to told us that getting back the hostages was their ambition. The difference is that Netanyahu seems unwilling to negotiate, and is convinced that the way to push Hamas into submission is to attack them relentlessly. Those on the protest, including relatives and loved ones of the hostages, are calling for talks to be placed ahead of tanks. Is Netanyahu worried? Probably not. Just as the protesters were gathering in Hostages Square, Israel's security cabinet was meeting to discuss the future of the war. Plans to encircle and occupy Gaza City were discussed. Proposals for a ceasefire were, apparently, not even mentioned."
    },
    {
        "title": "Where are the UK's asylum seekers from?",
        "description": "Based on the 1951 Convention on Refugees, anyone who has a well-founded fear of persecution can claim asylum in the UK, be that based on their race, religion, nationality, sexuality or other reason. They must be in the UK to do so.",
        "url": "https://news.sky.com/story/asylum-seekers-in-charts-and-numbers-who-are-the-people-that-politicians-are-talking-about-deporting-from-uk-13418861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-asylum-seekers-deportations_7001978.png?20250826191426",
        "type": "Home",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-08-26 17:31:00",
        "Headline": "With rising numbers of people claiming asylum, the government and some opposition parties say that more people should be 'returned'. But who are the people they are talking about deporting?",
        "Content": "\n          Data journalist\n              @joelysantacruz\n Based on the 1951 Convention on Refugees, anyone who has a well-founded fear of persecution can claim asylum in the UK, be that based on their race, religion, nationality, sexuality or other reason. They must be in the UK to do so. A record 111,084 people claimed asylum in the UK in the latest year to June 2025, the highest number in figures collected since 2002. Around two in five - 41,870 - of those were made by people who arrived in small boats. The increase in claims has mostly been driven by people seeking asylum from countries in South Asia, the Middle East, and sub-Saharan Africa. The number of claims was relatively low between 2006 and 2021, before increasing rapidly in recent years. Over the whole period from 2002 to 2025, the top five nationalities of those claiming asylum were Iran, Afghanistan, Pakistan, Iraq and Eritrea. Asylum claims from Middle Eastern countries were highest between 2022 and 2023, while asylum claims from Eritreans and Pakistanis have continued to increase in recent years. The most common nationalities of those seeking asylum are often those from countries experiencing war and violent persecution, seen, for example, in the surge in refugees coming from Afghanistan following the Taliban's takeover in 2021. Increasing numbers of asylum seekers have arrived in the UK by irregular routes, mostly on small boats across the English Channel - with Afghans and Eritreans making up the largest proportion of small boat arrivals in the last year. In the latest year to June 2025, the greatest number of asylum claims were from people from Pakistan, at 11,234, followed by Afghanistan at 8,281, Iran at 7,746, and Eritrea at 7,433. The majority of asylum claims come from younger men aged under 50, who represented 59% of asylum seekers in the latest figures, followed by children, at 22%. There were 19,471 children among people claiming asylum, more than double from 7,672 a decade earlier, while the number of men under 30 quadrupled to 41,553 over the same period. Prime Minister Sir Keir Starmer says he wants to 'smash the gangs' and disrupt the networks of organised criminals who make small boat journeys possible. But as with the Conservative government that came before him, he has not been successful. The number of small boat crossings so far this year, at just under 29,000, is higher than by the same point in any previous year. But while half of asylum seekers arrived irregularly by small boat or without documentation, the rest arrive by more conventional routes. At 41,100, an almost identical number of people claimed asylum who initially arrived on a work, study, or other valid visa as the 41,870 who arrived 'irregularly'. Another government promise on immigration is increasing the number of deportations and removals of people who have no legal status in the UK, which they also say will act as a deterrent to others. This includes the 'one-in-one-out' scheme recently agreed with France, under which, on a trial basis, a small number of people who arrive in small boats are returned to France in exchange for asylum seekers on safe and legal routes. The government say that 100 people have been detained in preparation to be sent to France. Who gets asylum in the UK? In the year to June 2025, 51,997 people were given a grant of protection or other leave, 39% of 134,037 initial asylum decisions made. This is compared to the higher figure of 57,905 who were refused asylum, 43% of the total. The rest either withdrew their claim or it was closed for other administrative reasons. Nigel Farage's Reform UK say that if it is elected, it plans to deport everyone who has arrived irregularly in the UK, such as by crossing the channel in a small boat or concealed in a lorry. However, asylum claims from those who arrived in small boats are more likely to be approved compared with those made by people who overstayed their visa. At 53%, more than half of the asylum claims by people who arrived in small boats were granted in the latest year, of those where an initial decision has been made, greater than the 39% grant rate overall for all asylum applications. This is based on initial decisions - though some of those whose asylum has been rejected may go on to appeal the decision. The government has not recently published figures on asylum appeals, but based on historic figures, around half of appeals are successful. The country with the most refused asylum claims in the latest year was Pakistan, at 6,313, closely followed by Afghanistan, at 6,066, Bangladesh at 4,614 and Iran at 4,223. Rejected asylum seekers are currently unlikely to be deported, based on current returns figures. Doing so would require an agreement with the countries involved, says Dr Peter Walsh, a senior researcher at the Migration Observatory, a research institute at the University of Oxford. \"This is a challenge that's been getting more difficult in recent years, and it's largely due to [rejected asylum seekers] countries of origin. If you have an Afghan asylum claimant who's been refused, we don't currently have relationships with the Taliban or any kind of returns agreements,\" he said. Germany recently returned a small number of Iranian nationals to Iran, deporting 14 people there in 2024 and a further 11 in the first half of 2025. \"It's not impossible, but certainly there would be a lot of diplomatic work that would have to be carried out to secure that kind of returns deal. Iran is currently under sanction. You can imagine the diplomatic challenges in trying to secure a returns agreement with the Iranian regime.\" \"And, you have to imagine that actually quite a decent share of individuals who have left those countries would be at risk of persecution,\" he added. Who is deported from the UK? The government has been successful in its aim to increase the number of returns and deportations from the UK. In the latest year to June 2025, there were 35,833 people returned. Most of those people were either voluntarily or forcibly returned to their home country. This is greater than the 30,939 returned in the year before, and the highest it's been since 2016, though below a peak of over 47,000 returns in the year to June 2012. Around one in six of the people returned were foreign national offenders. However, with limited detail in the figures, it is not possible to say exactly what proportion of the rest of the people returned were failed asylum seekers or not. Three-quarters of those returned left voluntarily, while the remaining 9,072 were forcibly removed. Almost all of them were sent from detention centres, which may include foreign national offenders, or people who never made an asylum claim and were detained by immigration enforcement. More than two-thirds of the 35,833 returns in the latest year were to seven countries: India, Brazil, Albania, Romania, China, Nigeria, and Pakistan. \"Labour is deciding more asylum cases, and success rates are in line with EU neighbours,\" Professor Nando Sigona of the University of Birmingham told Sky News. \"It is difficult to remove people to countries with political unrest and human rights crises. Removals are increasing, but mostly towards countries with which we have better diplomatic relations. Most of those removed are not the irregular crossers but visa overstayers.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Scientists hail 'sci-fi' treatment for babies with rare condition",
        "description": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition.",
        "url": "https://news.sky.com/story/scientists-hail-sci-fi-treatment-for-babies-with-rare-condition-13418660",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-amelia-turner_7001738.jpg?20250826132339",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-26 23:01:00",
        "Headline": "Researchers have developed a system to deliver treatment for severe congenital diaphragmatic hernia (CDH) straight to a baby while in their mother's womb.",
        "Content": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition. Amelia Turner was given life-saving surgery at Great Ormond Street Hospital (GOSH) when she was a few days old. She suffered from severe congenital diaphragmatic hernia (CDH) - a potentially fatal condition affecting one in every 3,000 babies. The condition means the diaphragm - the muscle between the abdomen and the chest - has not fully developed. As a result, organs that are supposed to sit within the abdomen could move into the chest space and crush fragile growing lungs. It means babies don't have enough space to grow fully formed lungs. Current treatment for severe CDH involves surgery while the baby is in the womb, with surgeons delicately placing a surgical balloon into the baby's windpipe to stimulate the lungs to grow. This only increases survival odds to 50%. 'A complete whirlwind' Amelia's mother, Georgia Turner, 26, from London, said finding out she had the condition made her pregnancy \"a complete whirlwind\". \"The team hoped Amelia's condition would only be moderate,\" she said. \"Unfortunately, after Amelia was born, the clinical team told me how serious her condition was as her bowel and stomach had moved into her chest.\" Amelia spent four months recovering on the neonatal unit at GOSH, then another three months at her local hospital, before she could go home for the first time. The \"cheeky\" 17-month-old needed a second surgery after her CDH reoccurred when she was 15 months old. It's hoped new research will not only make treatment less invasive and significantly increase survival rates but also lower the chances of relapses. Read more from Sky News:TikTok puts hundreds of UK jobs at risk'Headphone dodgers' targeted by new TfL campaign Science-fiction made real A system developed by experts at GOSH and University College London in the UK, and KU Leuven in Belgium, would see treatment delivered straight to a baby while still in their mother's womb. It would see nanodiamonds used to transfer a hormone, known as vascular endothelial growth factor (VEGF), which stimulates lung growth. It was tested on lab-grown mini-lungs, using 3D printing to simulate compression, as well as rats with the condition. One of the experts, Dr Stavros Loukogeorgakis, a GOSH surgeon, said: \"Nanodiamonds, 3D-printing and growth hormones in the womb all sounds a bit science-fiction. But this research is really showing us what is possible.\" He said the treatment could be available to families in as little as five years. Ms Turner said: \"New research like this is great to see how experts are trying to make the treatment for CDH more successful for all children, and less invasive. \"Hopefully better treatments will also prevent relapse cases like Amelia.\""
    },
    {
        "title": "Taylor Swift announces engagement to boyfriend Travis Kelce",
        "description": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce.",
        "url": "https://news.sky.com/story/taylor-swift-announces-engagement-to-boyfriend-travis-kelce-13418848",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-taylor-swift-travis-kelce_7001935.jpg?20250826181351",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-26 17:11:00",
        "Headline": "Swift and Kelce started their relationship in 2023, after the NFL player said he tried and failed to meet the singer at an Eras Tour concert.",
        "Content": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce. The pop star and Kansas City Chiefs tight end shared the news in a joint post on Instagram, with the caption: \"Your English teacher and your gym teacher are getting married.\" The announcement was liked more than 1.7 million times just over 30 minutes after it was posted. Swift and Kelce started their relationship in 2023, after the three-time Super Bowl winner said on his podcast New Heights that he tried and failed to meet the singer at her Eras Tour concert in Kansas City. Rumours grew that the couple were dating after Swift was spotted at a number of Chiefs games. On her seventh time in the stands, she brought her father, Scott Kingsley Swift, along. Kelce told the Wall Street Journal in November 2023: \"There were definitely people she knew that knew who I was, in her corner [who said]: 'Yo! Did you know he was coming [to the Eras Tour]?' \"I had somebody playing Cupid... She told me exactly what was going on and how I got lucky enough to get her to reach out.\" \n                  Boy, 16, convicted in Germany over supporting failed terror plot at Taylor Swift concert\n                 \n                  Taylor Swift reveals release date for new album\n                 \n                  Taylor Swift cements place as 'hardest-working star in pop' with announcement of 12th studio album\n                  Earlier this month, Swift appeared on Kelce's podcast, New Heights, and announced her 12th album, titled The Life Of A Showgirl. Speaking to Kelce and his brother Jason, Swift said it was inspired by the Eras Tour - and also talked about his attempt at meeting her two years ago. While she said his plan to give her his number on a friendship bracelet was a \"wild, romantic gesture,\" she joked he \"didn't do any proper logistical planning\" and thought he would be allowed backstage. \"Because he knows the elevator lady, he thought he could talk to her about just getting down to my dressing room,\" she added. \"That's how it works in 1973.\" Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record The new album, which will be released on 3 October, marks her first release since she took back control over her entire back catalogue from private equity firm Shamrock Capital. Sky News culture and entertainment reporter Gemma Peplow said after her globe-trotting tour and a swathe of re-releases over recent years, the new album cemented Swift's reputation \"as the hardest-working star in pop\". Despite rumours he would retire after losing this year's Super Bowl, Kelce will play for the Kansas City Chiefs again this season. He told GQ magazine his on-field performances \"slipped a little bit\" as he started acting, and added: \"I'm just saying that my work ethic is such that I have so much pride in how I do things that I never want the product to tail off, and I feel like these past two years haven't been to my standard.\""
    },
    {
        "title": "Three victims of Isle of Wight helicopter crash named",
        "description": "The three people killed in a helicopter crash on the Isle of Wight have been named.",
        "url": "https://news.sky.com/story/two-victims-of-isle-of-wight-helicopter-crash-named-13418333",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-justyna-czoska-wojtek-kowalkowski_7002071.jpg?20250826203728",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-26 11:10:00",
        "Headline": "Justyna Czoska and Wojtek Kowalkowski, from Poland, and pilot Simon Hewitt died in Monday's crash during a flying lesson, near the A3020 Shanklin Road.",
        "Content": " The three people killed in a helicopter crash on the Isle of Wight have been named. Emergency services were called to the site of the crash, which took place during a flying lesson, near the A3020 Shanklin Road, at 9.24am on Monday morning. By the evening, Hampshire and Isle of Wight Constabulary confirmed that four people in total were onboard the helicopter, three of whom had died, and one person who had been taken to hospital in a serious condition. Justyna Czoska, 52, and Wojtek Kowalkowski, 49, from Bloxham, Oxfordshire, died in the crash, along with pilot Simon Hewitt, 54, from Barton-upon-Humber. In a Facebook post, Justyna's daughter, Julia Buzar, said: \"I have no words. The world took my mum too soon, she was the best mum you could ask for, loved by everyone. I never thought I'd be writing something like this. \"Please, if anyone could help bring them back to Poland so they can be with their families, it would mean the world to me. Rest in peace, mum and Wojtek.\" In a post on fundraising site GoFundMe, Julia's partner, Jacob Butler, wrote that the \"sudden and devastating event has left all of us heartbroken and struggling to cope with the loss\". The appeal is aimed at raising sufficient funds to \"bring them both back to Poland so they can be laid to rest with their families, in the place they called home\". Whatever is raised will help cover the cost of \"repatriation, funeral arrangements and travel\", the message said. By Tuesday afternoon, pledges had reached more than £3,000. Mr Hewitt's partner and family said: \"Simon was the most wonderful, intelligent, kind man and father. He brought so much joy and light into our lives. We are absolutely broken.\"+ A spokesperson for Adventure 001, which owns the helicopter, said: \"At this very sad time, our thoughts and prayers are with the family and friends of all those involved in a crash yesterday morning on the Isle of Wight.\" They added: \"Tragically also lost on board was our devoted pilot, Captain Simon Hewitt, who was not only an immensely respected member of our team, but also a truly wonderful family man, a much-loved friend and a highly regarded colleague. Simon will be truly missed.\" A fourth person in the helicopter, a man in his 30s, was taken to hospital, where he remains in a stable condition. Darren Toogood, editor and publisher at the Island Echo, told Sky News presenter Kamali Melbourne the Robinson R44 II helicopter crashed on a \"significantly busy, high-speed road\" between the village of Godshill and the seaside town of Shanklin. \"It was on one of the first flights of the day,\" he said. \"It's an incredibly busy area.\" The Air Accident Investigation Branch is looking into the causes of the crash. A spokesman for Northumbria Helicopters said that its aircraft G-OCLV - which is listed as a Robinson R44 II helicopter - was involved in the accident during a flying lesson and was carrying four passengers. It set out from Sandown Airport at approximately 9am, the company said. Witness Leigh Goldsmith told the Isle of Wight County Press she was driving towards Shanklin when she saw the helicopter \"spiralling\" before it went out of sight and came down in a hedge. Read more on Sky News:Russia masters new dronesIsrael 'killing a lot of journalists'What Meghan misses about UK Local fire crews also attended. Joe Robertson, Conservative MP for Isle of Wight East, told Times Radio the incident was \"heartbreaking\", saying what should have been a fun morning out turned to \"tragedy\"."
    },
    {
        "title": "England warned it faces six million new cancer cases by 2040 - with these areas worst hit",
        "description": "More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities.",
        "url": "https://news.sky.com/story/england-warned-it-faces-six-million-new-cancer-cases-by-2040-with-these-areas-worst-hit-13418850",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cancer-doctor_7001975.jpg?20250826190700",
        "type": "UK",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-08-26 17:16:00",
        "Headline": "A coalition of more than 60 cancer charities is warning the government must take urgent steps to tackle cancer care in England.",
        "Content": "By Laura Bundock, health correspondent  More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities. This would equate to a diagnosis every two minutes, which is up from one every four minutes in the 1970s. A coalition of more than 60 cancer charities, known as One Cancer Voice, is warning the government must take urgent steps to tackle cancer care in England - including faster diagnosis targets and better prevention policies. The analysis carried out by the charities is based largely on pre-pandemic data and suggests cases will increase by 14.2% over the next 15 years, with diagnoses of some of the most common cancers reaching all-time highs. This includes over a million new prostate cancer diagnoses, and more than 900,000 for breast cancer by 2040. The research also finds regional variations: • South East - over a million diagnoses • North East - 865,000 • East of England and the South West - 722,000 • London - 714,000  Six key demands These figures starkly set out the need for change, and the timing of their release is significant. Later this autumn, the government is expected to publish its long-awaited National Cancer Plan. These leading charities have combined forces to put pressure on ministers ahead of its publication, demanding six measures which they say must be implemented if cancer outcomes are to improve: • A pledge to meet all cancer waiting times by the end of parliament in 2029 • A new earlier diagnosis target, with improved screening programmes • The introduction of strong cancer prevention policies • Addressing inequalities in patient care • Improving access to clinical trials for cancer patients • Better support for people to live well with and beyond cancer 'A defining moment' The pandemic had a huge impact on cancer care in the country, and an ageing population adds further pressures. But the most recently available data, which is around a decade old, suggests the NHS is still lagging behind many comparable countries. The chief executive of Cancer Research UK, Michelle Mitchell, described the national plan as a \"defining moment\". \"If the UK government delivers an ambitious fully funded strategy, we could save more lives and transform cancer outcomes, propelling England from world lagging to among world leading when it comes to tackling this disease,\" she said. Read more:Are we are entering 'golden age' of cancer treatment? A Department of Health and Social Care spokesperson said: \"This government is prioritising cancer care as we turn around more than a decade of neglect of our NHS. \"We're already making an impact, with 95,000 more people having cancer diagnosed or ruled out within 28 days between July 2024 and May 2025, compared to the same period the previous year. \"This will soon be supported by our new National Cancer Plan, setting out how cancer care will improve over the coming years. \"We're also making it easier for people to get tests, checks, and scans with DIY screening kits for cervical cancer, new radiotherapy machines in every region, and by creating the first smoke-free generation.\""
    },
    {
        "title": "Nigel Farage has a new 'leave' campaign - here's how it could work and how it might impact you",
        "description": "Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election.",
        "url": "https://news.sky.com/story/nigel-farage-has-another-leave-campaign-how-would-it-work-and-how-might-you-be-impacted-13418933",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-echr_7002337.jpg?20250826235508",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-08-26 19:51:00",
        "Headline": "Not content with Britain having left the EU, Nigel Farage now wants to see the country leave the European Convention on Human Rights. But what even is it, how could we actually leave, and how would our rights be impacted? Sky News explains.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election. The party's leader also reaffirmed his pledge to repeal the Human Rights Act and disapply three other international treaties acting as \"roadblocks\" to deporting anyone entering the UK illegally. In a speech about tackling illegal migration, he said a Reform government would detain and deport any migrants arriving illegally, including women and children, and they would \"never, ever be allowed to stay\". Sky News looks at what the ECHR is, how the UK could leave, and what could happen to human rights protections if it does. What is the ECHR? On 4 November 1950, the 12 member states of the newly formed Council of Europe (different to the EU) signed the Convention for the Protection of Human Rights and Fundamental Freedoms - otherwise known as the ECHR. It came into force on 3 September 1953 and has since been signed by an additional 34 Council of Europe members who have joined, bringing the total to 46 signatories. The treaty was drafted in the aftermath of the Second World War and the Holocaust to protect people from the most serious human rights violations. It was also in response to the growth of Stalinism in central and Eastern Europe to protect members from communist subversion. The treaty was the first time fundamental human rights were guaranteed in law. Sir Winston Churchill helped establish the Council of Europe and was a driving force behind the ECHR, which came from the Charter of Human Rights that he championed and was drafted by British lawyers. To be a signatory of the ECHR, a state has to be a member of the Council of Europe - and they must \"respect pluralist democracy, the rule of law and human rights\". There are 18 sections, including the most well-known: Article 1 (the right to life), Article 3 (prohibition of torture), Article 6 (right to a fair trial), Article 8 (right to private and family life) and Article 10 (right to freedom of expression). The ECHR has been used to halt the deportation of migrants in 13 out of 29 UK cases since 1980. ECHR protections are enforced in the UK through the Human Rights Act 1998, which incorporates most ECHR rights into domestic law. This means individuals can bring cases to UK courts to argue their ECHR rights have been violated, instead of having to take their case to the European Court of Human Rights. Article 8 is the main section that has been used to stop illegal migrant deportations, but Article 3 has also been successfully used. Read more:Why Farage's small boats plan is not actually about policyLegal expert explains if Farage deportation plan would work How is it actually used? The ECHR is interpreted by the European Court of Human Rights (ECtHR) - you'll have to bear with us on the confusingly similar acronyms. The convention is interpreted under the \"living instrument doctrine\", meaning it must be considered in the light of present-day conditions. The number of full-time judges corresponds to the number of ECHR signatories, so there are currently 46 - each nominated by their state for a non-renewable nine-year term. But they are prohibited from having any institutional ties with the state they come from. An individual, group of individuals, or one or more of the signatory states can lodge an application alleging one of the signatory states has breached their human rights. Anyone who have exhausted their human rights case in UK courts can apply to the ECtHR to have their case heard in Strasbourg. All ECtHR hearings must be heard in public, unless there are exceptional circumstances to be heard in private, which happens most of the time following written pleadings. The court may award damages, typically no more than £1,000 plus legal costs, but it lacks enforcement powers, so some states have ignored verdicts and continued practices judged to be human rights violations. Read more: Asylum seekers in charts and numbers How could the UK leave? A country can leave the convention by formally denouncing it, but it would likely have to also leave the Council of Europe as the two are dependent on each other. At the international level, a state must formally notify the Council of Europe of its intention to withdraw with six months' notice, when the UK would still have to implement any ECtHR rulings and abide by ECHR laws. The UK government would have to seek parliament's approval before notifying the ECtHR, and would have to repeal the Human Rights Act 1998 - which would also require parliamentary approval. Would the UK leaving breach any other agreements? Leaving the ECHR would breach the 1998 Good Friday Agreement, a deal between the British and Irish governments on how Northern Ireland should be governed, which could threaten the peace settlement. It would also put the UK's relationship with the EU under pressure as the Brexit deal commits both to the ECHR. The EU has said if the UK leaves the ECHR it would terminate part of the agreement, halting the extradition of criminal suspects from the EU to face trial in the UK. How would the UK's human rights protections change? Certain rights under the ECHR are also recognised in British common law, but the ECHR has a more extensive protection of human rights. For example, it was the ECHR that offered redress to victims of the Hillsborough disaster and the victims of \"black cab rapist\" John Worboys after state investigations failed. Before cases were taken to the ECtHR and the Human Rights Act came into force, the common law did not prevent teachers from hitting children or protect gay people from being banned from serving in the armed forces. Repealing the ECHR would also mean people in the UK would no longer be able to take their case to the ECtHR if the UK courts do not remedy a violation of their rights. The UK's human rights record would then not be subject to the same scrutiny as it is under the ECHR, where states review each other's actions. How human rights in the UK would be impacted depends partly on what would replace the Human Rights Act. Mr Farage has said he would introduce a British Bill of Rights, which would apply only to UK citizens and lawful British citizens. He has said it would not mention \"human rights\" but would include \"the freedom to do everything, unless there's a law that says you can't\" - which is how common law works. Legal commentator Joshua Rozenberg said this would simply confirm the rights to which people are already entitled, but would also remove rights enjoyed by people visiting the UK."
    },
    {
        "title": "Scientists hail 'sci-fi' treatment for babies with rare condition",
        "description": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition.",
        "url": "https://news.sky.com/story/scientists-hail-sci-fi-treatment-for-babies-with-rare-condition-13418660",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-amelia-turner_7001738.jpg?20250826132339",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 23:01:00",
        "Headline": "Researchers have developed a system to deliver treatment for severe congenital diaphragmatic hernia (CDH) straight to a baby while in their mother's womb.",
        "Content": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition. Amelia Turner was given life-saving surgery at Great Ormond Street Hospital (GOSH) when she was a few days old. She suffered from severe congenital diaphragmatic hernia (CDH) - a potentially fatal condition affecting one in every 3,000 babies. The condition means the diaphragm - the muscle between the abdomen and the chest - has not fully developed. As a result, organs that are supposed to sit within the abdomen could move into the chest space and crush fragile growing lungs. It means babies don't have enough space to grow fully formed lungs. Current treatment for severe CDH involves surgery while the baby is in the womb, with surgeons delicately placing a surgical balloon into the baby's windpipe to stimulate the lungs to grow. This only increases survival odds to 50%. 'A complete whirlwind' Amelia's mother, Georgia Turner, 26, from London, said finding out she had the condition made her pregnancy \"a complete whirlwind\". \"The team hoped Amelia's condition would only be moderate,\" she said. \"Unfortunately, after Amelia was born, the clinical team told me how serious her condition was as her bowel and stomach had moved into her chest.\" Amelia spent four months recovering on the neonatal unit at GOSH, then another three months at her local hospital, before she could go home for the first time. The \"cheeky\" 17-month-old needed a second surgery after her CDH reoccurred when she was 15 months old. It's hoped new research will not only make treatment less invasive and significantly increase survival rates but also lower the chances of relapses. Read more from Sky News:TikTok puts hundreds of UK jobs at risk'Headphone dodgers' targeted by new TfL campaign Science-fiction made real A system developed by experts at GOSH and University College London in the UK, and KU Leuven in Belgium, would see treatment delivered straight to a baby while still in their mother's womb. It would see nanodiamonds used to transfer a hormone, known as vascular endothelial growth factor (VEGF), which stimulates lung growth. It was tested on lab-grown mini-lungs, using 3D printing to simulate compression, as well as rats with the condition. One of the experts, Dr Stavros Loukogeorgakis, a GOSH surgeon, said: \"Nanodiamonds, 3D-printing and growth hormones in the womb all sounds a bit science-fiction. But this research is really showing us what is possible.\" He said the treatment could be available to families in as little as five years. Ms Turner said: \"New research like this is great to see how experts are trying to make the treatment for CDH more successful for all children, and less invasive. \"Hopefully better treatments will also prevent relapse cases like Amelia.\""
    },
    {
        "title": "Palestine Action: More than 60 people charged with showing support for proscribed group, police say",
        "description": "More than 60 people have been charged with showing support for Palestine Action, the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/palestine-action-more-than-60-people-charged-with-showing-support-for-proscribed-group-police-say-13418885",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-action-guardtech_6954445.jpg?20250815204847",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 18:29:00",
        "Headline": "Met Police Commander Dominic Murphy says that those who think supporting Palestine Action en masse \"will overwhelm us\" are \"completely misguided\".",
        "Content": "More than 60 people have been charged with showing support for Palestine Action, the Metropolitan Police has said. A total of 64 people have been charged in relation to protests in central London on 5 and 12 July. They will appear in court throughout October and face a maximum sentence of six months in prison. The force said more than 700 people have been arrested for showing support for the group since it was proscribed on 5 July.  So far, a total of 67 have been charged with supporting Palestine Action, after two women and a man were charged at the start of August in relation to the 5 July protest. Palestine Action was banned after the group claimed responsibility for damage to jets at RAF Brize Norton and was also linked to \"allegations of a serious assault on staff and police officers at a business premises in South Gloucestershire\", the Met Police said. Membership of, or support for, the group is a criminal offence punishable by up to 14 years in prison under the Terrorism Act 2000. Wearing a T-shirt or badge with the group's name on could attract a maximum six-month sentence. Met Police Commander Dominic Murphy said in a statement about the new charges that those who think supporting Palestine Action en masse \"will overwhelm us\" are \"completely misguided\". He added: \"The reality for those who have carried out this action is that they are now facing serious charges under the Terrorism Act. \"If convicted of such an offence, it can have a severe impact on your life or career, potentially restricting your ability to travel overseas or work in certain professions. \"My message to anyone thinking about carrying out similar action in the coming weeks is to reconsider.\" Read more from Sky News:Epping migrant hotel resident appears in courtSix injured after dog attacksThree victims of Isle of Wight helicopter crash named Cdr Murphy added: \"Thousands continue to attend protests where they freely express their views in support of Palestine, without breaking counter-terrorism laws. \"But where we do see offences, people will very likely be arrested and will certainly be swiftly investigated, working closely with the CPS to bring about prosecutions.\""
    },
    {
        "title": "Three victims of Isle of Wight helicopter crash named",
        "description": "The three people killed in a helicopter crash on the Isle of Wight have been named.",
        "url": "https://news.sky.com/story/two-victims-of-isle-of-wight-helicopter-crash-named-13418333",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-justyna-czoska-wojtek-kowalkowski_7002071.jpg?20250826203728",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 11:10:00",
        "Headline": "Justyna Czoska and Wojtek Kowalkowski, from Poland, and pilot Simon Hewitt died in Monday's crash during a flying lesson, near the A3020 Shanklin Road.",
        "Content": " The three people killed in a helicopter crash on the Isle of Wight have been named. Emergency services were called to the site of the crash, which took place during a flying lesson, near the A3020 Shanklin Road, at 9.24am on Monday morning. By the evening, Hampshire and Isle of Wight Constabulary confirmed that four people in total were onboard the helicopter, three of whom had died, and one person who had been taken to hospital in a serious condition. Justyna Czoska, 52, and Wojtek Kowalkowski, 49, from Bloxham, Oxfordshire, died in the crash, along with pilot Simon Hewitt, 54, from Barton-upon-Humber. In a Facebook post, Justyna's daughter, Julia Buzar, said: \"I have no words. The world took my mum too soon, she was the best mum you could ask for, loved by everyone. I never thought I'd be writing something like this. \"Please, if anyone could help bring them back to Poland so they can be with their families, it would mean the world to me. Rest in peace, mum and Wojtek.\" In a post on fundraising site GoFundMe, Julia's partner, Jacob Butler, wrote that the \"sudden and devastating event has left all of us heartbroken and struggling to cope with the loss\". The appeal is aimed at raising sufficient funds to \"bring them both back to Poland so they can be laid to rest with their families, in the place they called home\". Whatever is raised will help cover the cost of \"repatriation, funeral arrangements and travel\", the message said. By Tuesday afternoon, pledges had reached more than £3,000. Mr Hewitt's partner and family said: \"Simon was the most wonderful, intelligent, kind man and father. He brought so much joy and light into our lives. We are absolutely broken.\"+ A spokesperson for Adventure 001, which owns the helicopter, said: \"At this very sad time, our thoughts and prayers are with the family and friends of all those involved in a crash yesterday morning on the Isle of Wight.\" They added: \"Tragically also lost on board was our devoted pilot, Captain Simon Hewitt, who was not only an immensely respected member of our team, but also a truly wonderful family man, a much-loved friend and a highly regarded colleague. Simon will be truly missed.\" A fourth person in the helicopter, a man in his 30s, was taken to hospital, where he remains in a stable condition. Darren Toogood, editor and publisher at the Island Echo, told Sky News presenter Kamali Melbourne the Robinson R44 II helicopter crashed on a \"significantly busy, high-speed road\" between the village of Godshill and the seaside town of Shanklin. \"It was on one of the first flights of the day,\" he said. \"It's an incredibly busy area.\" The Air Accident Investigation Branch is looking into the causes of the crash. A spokesman for Northumbria Helicopters said that its aircraft G-OCLV - which is listed as a Robinson R44 II helicopter - was involved in the accident during a flying lesson and was carrying four passengers. It set out from Sandown Airport at approximately 9am, the company said. Witness Leigh Goldsmith told the Isle of Wight County Press she was driving towards Shanklin when she saw the helicopter \"spiralling\" before it went out of sight and came down in a hedge. Read more on Sky News:Russia masters new dronesIsrael 'killing a lot of journalists'What Meghan misses about UK Local fire crews also attended. Joe Robertson, Conservative MP for Isle of Wight East, told Times Radio the incident was \"heartbreaking\", saying what should have been a fun morning out turned to \"tragedy\"."
    },
    {
        "title": "Six injured after Leicestershire dog attacks",
        "description": "Six people are believed to have been injured after dog attacks in Leicestershire, police have said.",
        "url": "https://news.sky.com/story/six-injured-after-leicestershire-dog-attacks-13418769",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-caucasian-shepherd_7001865.jpg?20250826165351",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 14:06:00",
        "Headline": "Two people, a girl aged 17 and a man aged 47, were arrested on suspicion of being in charge of a dangerously out of control dog in a public place.",
        "Content": "Six people are believed to have been injured after dog attacks in Leicestershire, police have said. Officers received two calls regarding dog attacks in the area of Beveridge Lane, Bardon Hill, on Thursday morning - one at 6.30am and the other at 7.44am. Leicestershire Police said that in the first call to police, a person reported seeing a man being attacked by two dogs.   Upon arrival, no dogs were located, but a victim was identified. Later, in the second call to the force, three people were reported to have been bitten in the same location. Two dogs - confirmed to be Caucasian shepherds - were then discovered after firearms officers, a police dog and its handler were deployed. The force added that both dogs were safely removed and are now being held in secure kennels. In an update on Tuesday, officers said that two further people had come forward to report they were bitten by a dog in the same location at the time, bringing the total to six. Read more from Sky News:'Headphone dodgers' targeted by new TfL campaignEpping migrant hotel resident appears in courtWomen and children will be detained under Farage deportation plans Two people, a girl aged 17 and a man aged 47, were arrested on suspicion of being in charge of a dangerously out of control dog in a public place. The man was also arrested for a further two offences under the Animal Welfare Act. Both have been released under investigation. Leicestershire Police also said it made a referral to the Independent Office for Police Conduct because of a prior report made about the dogs."
    },
    {
        "title": "Sex offender murdered in 'brutal and sustained' attack after recent release from prison",
        "description": "An elderly man who had recently been released from prison after serving a sentence for sexual offences was found dead outside his home after a \"brutal and sustained\" attack, police have said.",
        "url": "https://news.sky.com/story/sex-offender-murdered-in-brutal-and-sustained-attack-after-recent-release-from-prison-13418806",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-newcastle-co-down-sean-small_7001910.jpg?20250826174821",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 17:44:00",
        "Headline": "Detectives launched a murder investigation after Sean Small, 84, was found outside the property in Newcastle in County Down, Northern Ireland, late on Sunday night.",
        "Content": "An elderly man who had recently been released from prison after serving a sentence for sexual offences was found dead outside his home after a \"brutal and sustained\" attack, police have said. Detectives launched a murder investigation after Sean Small, 84, was found outside the property in Newcastle in County Down, Northern Ireland, late on Sunday night. A man in his 40s has since been arrested on suspicion of murder and remains in custody. Small's house and another property have been sealed off by police carrying out forensic examinations. The victim had last been seen alive on 19 August, said Detective Chief Inspector Kerrie Foreman, who added that the investigation was ongoing and appealed for anyone with information to come forward. She said police received a report around 1.30pm on Sunday 24 August that a man in his 80s had been found outside a property in Newcastle and was pronounced dead at the scene. \"This was a brutal and sustained attack and while our investigation is at a very early stage, detectives are working at pace to determine the circumstances around this murder,\" she said. Ms Foreman said she would not comment on how Small died or whether there was more than one person involved in the attack. She said a post-mortem examination is ongoing. Asked if the victim's past was a potential line of inquiry, she said police were maintaining an open mind. \"We are pursuing all possible lines of inquiry at this time,\" she added. Read more:Ukrainians warn they're in danger of losing drone arms raceSix injured after dog attacks Ms Foreman said she would not comment on any potential threats against the victim. She confirmed there had been an incident of criminal damage at his address several weeks ago. In 2022, Small pleaded guilty to a number of sexual offences against a woman and a teenage girl."
    },
    {
        "title": "Strictly Come Dancing star arrested on suspicion of rape",
        "description": "A Strictly Come Dancing star has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/strictly-come-dancing-star-arrested-on-suspicion-of-rape-13418783",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-strictly-come-dancing_7001870.jpg?20250826170125",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-26 14:57:00",
        "Headline": "It is understood the arrest is not related to the upcoming production of Strictly Come Dancing - the 23rd series, which is in the rehearsal stage and is due to launch in September.",
        "Content": "A Strictly Come Dancing star has been arrested on suspicion of rape. The unnamed man, who is in his 30s, was also detained over a separate allegation of \"non-consensual intimate image abuse\". The Met Police said an arrest was made in east London on Friday in a joint investigation with Hertfordshire Constabulary, following a \"third-party allegation of sexual and drug-related offences\". It is understood the arrest is not related to the upcoming production of Strictly Come Dancing - the 23rd series, which is in the rehearsal stage and is due to launch in September.  \"On Friday 22 August, officers arrested a man in his 30s in east London on suspicion of rape and non-consensual intimate image abuse,\" a spokesperson for the Met said in a statement. The investigation is in its early stages and inquiries are ongoing, the spokesperson added. The man was released on bail on Saturday until a date in November, the force said. Hertfordshire Constabulary did not add anything further. A spokesperson for the BBC said: \"It would not be appropriate to comment on an ongoing police investigation.\" Earlier this month, it was reported the broadcaster had called in lawyers to investigate following claims two of its stars had used cocaine."
    },
    {
        "title": "Nigel Farage's deportation plan relies on these conditions - legal expert explains if it could work",
        "description": "Explaining how they plan to tackle what they described as illegal migration, Nigel Farage and his Reform UK colleague Zia Yusuf were happy to disclose some of the finer details - how much money migrants would be offered to leave and what punishments they would receive if they returned.",
        "url": "https://news.sky.com/story/nigel-farages-deportation-plan-relies-on-these-conditions-legal-expert-explains-if-it-could-work-13418742",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nigel-farage-zia-yusuf_7001793.jpg?20250826153054",
        "type": "UK",
        "Author": "Joshua Rozenberg, legal commentator",
        "Date Published": "2025-08-26 13:20:00",
        "Headline": "How would Reform win a Commons majority, at least another 320 seats, in four years' time - or sooner if, as Mr Farage implied, Labour was forced to call an early election? How would his party win an election at all if, as its leader suggested, other parties began to adopt his policies?",
        "Content": "By Joshua Rozenberg, legal commentator  Explaining how they plan to tackle what they described as illegal migration, Nigel Farage and his Reform UK colleague Zia Yusuf were happy to disclose some of the finer details - how much money migrants would be offered to leave and what punishments they would receive if they returned. But the bigger picture was less clear. How would Reform win a Commons majority, at least another 320 seats, in four years' time - or sooner if, as Mr Farage implied, Labour was forced to call an early election? How would his party win an election at all if, as its leader suggested, other parties began to adopt his policies? Politics latest: Starmer 'angry' about Farage's language on migrant hotels Highly detailed legislation would be needed - what Mr Farage calls his Illegal Migration (Mass Deportation) Bill. But Reform would not have a majority in the House of Lords and, given the responsibilities of the upper house to scrutinise legislation in detail, it could take a year or more from the date of an election for his bill to become law. Reform's four-page policy document says the legislation would have to disapply: • The United Nations refugee convention of 1951, extended in 1967, which says people who have a well-founded fear of persecution must not be sent back to a country where they face serious threats to their life or freedom • The United Nations convention against torture, whose signatories agree not expel, return or extradite anyone to a country where there are substantial grounds to believe the returned person would be in danger of being tortured • The Council of Europe anti-trafficking convention, which requires states to provide assistance for victims  According to the policy document, derogation from these treaties is \"justified under the Vienna Convention doctrine of state necessity\". That's odd, because there's no mention of necessity in the Vienna Convention on the law of treaties - and because member states can already \"denounce\" (leave) the three treaties by giving notice. 👉 Listen to Sky News Daily on your podcast app 👈 It would take up to a year - but so would the legislation. Only six months' notice would be needed to leave the European Convention on Human Rights, another of Reform's objectives. Read more:Women and children will be detained under Farage plansFar right 'emboldened' says MP as Starmer faces mounting pressure over immigration Mr Farage acknowledged that other European states were having to cope with an influx of migrants. Why weren't those countries trying to give up their international obligations? His answer was to blame UK judges for applying the law. Once his legislation had been passed, Mr Farage promised, there would be nothing the courts could do to stop people being deported to countries that would take them. His British Bill of Rights would make that clear. Courts will certainly give effect to the will of parliament as expressed in legislation. But the meaning of that legislation is for the judiciary to decide. Did parliament really intend to send migrants back to countries where they are likely to face torture or death, the judges may be asking themselves in the years to come. They will answer questions such as that by examining the common law that Mr Farage so much admires - the wisdom expressed in past decisions that have not been superseded by legislation. He cannot be confident that the courts will see the problem in quite the same way that he does."
    },
    {
        "title": "Gaza hospital rejects Israel's claim troops 'saw Hamas camera' before deadly attack",
        "description": "A hospital in Gaza that was hit in an Israeli strike, killing 20 people including five journalists, has rejected the Israeli military's claim it struck the facility because it was targeting what it believed was a Hamas surveillance camera as well as people identified as militants.",
        "url": "https://news.sky.com/story/gaza-hospital-rejects-israels-claim-troops-saw-hamas-camera-before-deadly-attack-13418939",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nasser-hospital-gaza_7001901.jpg?20250826173207",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-26 19:58:00",
        "Headline": "The IDF claim follows its initial inquiry into the attack on Nasser hospital, which Benjamin Netanyahu has called a \"tragic mishap\".",
        "Content": "A hospital in Gaza that was hit in an Israeli strike, killing 20 people including five journalists, has rejected the Israeli military's claim it struck the facility because it was targeting what it believed was a Hamas surveillance camera as well as people identified as militants. The statement was part of the military's initial inquiry into the attack on Nasser hospital in Khan Younis, which Prime Minister Benjamin Netanyahu has called a \"tragic mishap\". The Israel Defense Forces (IDF) said the back-to-back strikes on the largest hospital in southern Gaza were ordered because soldiers believed militants were using the camera to observe Israeli forces.    It also said it was because Israel has long believed Hamas and other militant groups are present at hospitals - though Israeli officials have rarely provided evidence to support such claims. \"This conclusion was further supported, among other reasons, by the documented military use of hospitals by the terrorist organisations throughout the war,\" the IDF claimed. \n                  Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?\n                 \n                  Home Secretary agrees special biometric check arrangements for Gaza students\n                 \n                  Israel may say it is not targeting journalists - but it is certainly killing a lot of them\n                 It said six of those killed in the strike were \"terrorists\". The military chief of general staff acknowledged several \"gaps\" in the investigation so far, including the kind of ammunition used to take out the camera. The military also said there is an ongoing investigation into the chain of command that approved the strike. However, the army added: \"The chief of the general staff emphasised that the IDF directs its activities solely toward military targets.\" In a statement, the hospital said: \"Nasser hospital categorically reject these claims and any claims made by Israeli authorities to justify attacks on hospital premises.\" Among those killed was 33-year-old Mariam Dagga, a journalist who worked for the Associated Press, Al Jazeera cameraman Mohammed Salama, Reuters contractor Hussam al Masri, Reuters photographer Moaz Abu Taha and Middle East Eye freelancer Ahmed Abu Aziz. The IDF said journalists working for Reuters and the Associated Press \"were not a target of the strike\". Read more: Who are the journalists killed in the attack? The strikes have been condemned by international leaders and human rights groups. \"The killing of journalists in Gaza should shock the world,\" said United Nations Human Rights Office spokesperson Thameen Al-Kheetan. \"Not into stunned silence but into action, demanding accountability and justice.\"  The attack was described as a \"double-tap\" attack, which sees civilians or medical workers rushing to help those injured hit in a second strike. They have previously been seen in the wars in Ukraine and Syria. Hospitals have been repeatedly attacked by Israeli forces throughout the 22-month war in Gaza. The war began on 7 October 2023 when Hamas-led militants stormed into southern Israel, killing some 1,200 people and taking 251 hostage. Israel's military offensive against Hamas has killed at least 62,000 Palestinians, mostly civilians, according to the Hamas-run health ministry, which does not differentiate between civilians and militants in its count but says the majority are women and children."
    },
    {
        "title": "Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?",
        "description": "Nadav is tired, frustrated and haunted, yet he smiles when we meet. For 690 days, he has been waiting for the world to change, and he's still waiting, and hoping.",
        "url": "https://news.sky.com/story/israeli-protesters-demand-netanyahu-does-whatever-it-takes-to-bring-hostages-home-but-is-he-listening-13418951",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tel-aviv-protest-israel_7002180.jpg?20250826214701",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-08-26 20:19:00",
        "Headline": "Israelis are protesting in the streets of Tel Aviv to pressure the government into doing more to prioritise the return of the hostages being held captive in Gaza.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Nadav is tired, frustrated and haunted, yet he smiles when we meet. For 690 days, he has been waiting for the world to change, and he's still waiting, and hoping. Back on 7 October 2023, his father Tal was seized by Hamas and taken to Gaza. Tal is now dead - it's not clear when he died, but the simple, brutal fact of his death is not in doubt. What is unknown - indeed, what cannot be known - is when Tal's body will be returned to Israel. \"My dad is still being held captive, although he is not alive. My life is stuck,\" Nadav tells me. \"In order to continue living and start the healing process, we need them home and we need the war to be over.\"  Around him, banners, signs and the sounds of another day of national protest. Motorways were brought to a halt, huge numbers of people went on strike, all in the name of demanding that the Israeli government do more to prioritise the return of all the hostages. In Nadav's mind, that means searching for compromise and negotiating a ceasefire that ends the war and allows for the return of all the hostages - believed to number 20 who are still alive, and a further 30 who have died. \"We have seen that just using military strength is not enough,\" he says. \"We now have to do whatever it takes, even if it's not perfect.\" \"Even if that means negotiating with Hamas?\" I ask. He nods. \"This war has to come to an end.\" It is a theme we hear again and again. In the crowds that pour into Hostages Square, there is almost unanimity.  \"The prime minister is acting like a tyrant,\" declares one man as he marches down the street. \"He doesn't listen to us - his subjects. He just listens to the people in his cabinet who think that war is always the answer.\" Around us, we regularly see people wearing T-shirts with the slogan \"Stam Wars\", written in the familiar Star Wars style. It is a biting comment dressed up as a joke - stam is a derogatory slang word, basically meaning pointless. \"Our soldiers are being sacrificed,\" says Yoram, as he strolls down the road towards the square. This, of course, is no random sample. Among the crowd are many who viscerally dislike Benjamin Netanyahu, and the truth is that his supporters would be unlikely to join this crowd. Read more:Analysis: Israel says it's not targeting journalists - but it is certainly killing a lot of themAustralia accuses Iran of organising antisemitic attacks And yet they all want the same thing. The prime minister insists that the return of the hostages is his driving motivation, just as the people we spoke to told us that getting back the hostages was their ambition. The difference is that Netanyahu seems unwilling to negotiate, and is convinced that the way to push Hamas into submission is to attack them relentlessly. Those on the protest, including relatives and loved ones of the hostages, are calling for talks to be placed ahead of tanks. Is Netanyahu worried? Probably not. Just as the protesters were gathering in Hostages Square, Israel's security cabinet was meeting to discuss the future of the war. Plans to encircle and occupy Gaza City were discussed. Proposals for a ceasefire were, apparently, not even mentioned."
    },
    {
        "title": "Boy, 16, convicted in Germany over supporting failed terror plot at Taylor Swift concert",
        "description": "A 16-year-old has been convicted in Germany for supporting a foiled plot to attack Taylor Swift concerts in Austria last year.",
        "url": "https://news.sky.com/story/boy-16-convicted-in-germany-over-supporting-failed-terror-plot-at-taylor-swift-concert-13418789",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-taylor-swift-eras-tour_6771083.jpg?20241209000914",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-26 15:15:00",
        "Headline": "The teenager, who confessed to preparing a serious act of violence and supporting a terrorist act of violence abroad, was handed a suspended 18-month sentence.",
        "Content": "A 16-year-old has been convicted in Germany for supporting a foiled plot to attack Taylor Swift concerts in Austria last year. The teenager, named Mohammad A, who cannot be fully identified under Germany's privacy laws, was convicted of preparing a serious act of violence and supporting a terrorist act of violence abroad. He was handed a suspended 18-month sentence on Tuesday. According to the court, he made a \"comprehensive confession\" at his trial, which was held behind closed doors because of his age. German judges found that the defendant, a Syrian national then aged 14, supported the ideology of the Islamic State group at the time. The court heard he was also in contact via social media with a young man in Austria who planned to attack a Swift concert in Vienna, had sent him a video with bomb-building instructions, and organised contact with an IS member. All three of Swift's concerts at Vienna's Ernst Happel Stadium were cancelled in August last year after a terror plot was uncovered by authorities.  Concert organisers had expected up to 65,000 fans inside the stadium at each concert and as many as 30,000 onlookers outside. \n                  Two married couples found dead in British car after crash in Germany\n                 \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 \n                  Legal protection for Scapa Flow site where German fleet was scuttled during First World War\n                 Authorities said the main suspect, now 20, planned to target those outside of the stadium and hoped to \"kill as many people as possible\". Omar Haijawi-Pirchner, head of the directorate of state security and intelligence, added at the time that the suspect was \"clearly radicalised in the direction of the Islamic State and thinks it is right to kill infidels\". Read more from Sky News:'Headphone dodgers' targeted by new TfL campaignImpact of new online safety rules revealedTwo victims of Isle of Wight helicopter crash named Swift later called the decision to cancel her shows in Austria \"devastating,\" and said: \"The reason for the cancellations filled me with a new sense of fear, and a tremendous amount of guilt because so many people had planned on coming to those shows. \"But I was also so grateful to the authorities because thanks to them, we were grieving concerts and not lives.\""
    },
    {
        "title": "Manhunt after two police officers shot dead and third seriously injured in Australia",
        "description": "A manhunt is under way for a gunman who shot and killed two officers and seriously injured another at a rural property in a remote part of Australia, police have said.",
        "url": "https://news.sky.com/story/active-incident-under-way-after-reports-of-shooting-in-rural-australian-town-13418533",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-australia-victoria_7001500.jpg?20250826071905",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-26 05:15:00",
        "Headline": "Ten armed officers tried to execute a search warrant in a remote part of Victoria on Tuesday morning, police say, and after the suspected shooter opened fire, the man, who was known to police, escaped into \"rugged\" bush.",
        "Content": " A manhunt is under way for a gunman who shot and killed two officers and seriously injured another at a rural property in a remote part of Australia, police have said. The wounded officer was \"shot in the lower body\" in the incident near Porepunkah, a town of around 1,000 people roughly 300km (190 miles) northeast of Melbourne, shortly after 10.30am, Victoria Police said in a statement. No other officers were wounded in the incident on Tuesday morning, local time, but they remain at the property. The statement said \"it's believed ten police attended the property on Rayner Track\" while the offender \"has since left the property and at this time his whereabouts are unknown. A significant search is actively underway to locate the man.\" While police have not named the suspect, media have identified the man as Dezi Freeman, also known as Dezi Bird Freeman. Speaking to reporters at around 6am, local time, (9am, GMT), Victoria Police Commissioner Mike Bush paid tribute to the \"brave\" officers who died, confirming one was a 59-year-old detective and the other a senior constable aged 35. A second detective who was shot was in surgery after being airifted to hospital, but was not in a life-threatening state, he said. The suspect, who was known to police, was \"heavily armed and dangerous\", and had \"escaped into the bush on foot\". Detectives were trying to locate the suspect's wife and two children and find out if they are with him, Mr Bush said. He described the \"semi-rural\" search area as \"large\" and said hundreds of officers, helped by sniffer dogs and helicopters, were involved in the search of the area which \"can be\" rugged. Ten armed officers went to execute a search warrant at the suspect's address, where they \"were met by the offender and killed in cold blood\". Mr Bush said the man had several firearms at least. He did not confirm if officers had discharged their weapons or whether reports that the suspect had taken officers' guns were true or not. He said a risk assessment was carried out beforehand and the fact that there were 10 officers involved \"does talk to the gravity of the situation\". Wayne Gatt, from the Victoria Police Association, said police stations \"have fallen silent\" after two officers \"paid the ultimate price\". Thanking \"these courageous officers\", he said \"our hearts go out to you\" and promised to \"do everything to look after\" their families. Police Federation of Australia president Kevin Morton said union members were shocked and saddened by \"the callous murder of two Victorian police officers and the serious wounding of another\". In a statement on the X social media platform, Jacinta Allan, the Premier of Victoria, said: \"Victoria Police officers, and all our first responders, show extraordinary bravery and courage every single day. \"They are the best of us - and the thoughts of all Victorians are with them today.\" The Australian Broadcasting Corporation (ABC) said officers believe the shooter is a so-called \"sovereign citizen\" and that police were serving a warrant from the sexual crimes squad, known as SOCIT. Sovereign citizens believe the government is illegitimate. 10 News Melbourne said earlier that \"heavy gunfire has stopped officers from entering the property as they await the arrival of the Special Operations Group\". Read more on Sky News:Russia masters new dronesIsrael 'killing a lot of journalists'Three die in helicopter crash The outlet quoted three police sources who spoke on condition of anonymity, that the dead officers \"were killed in an ambush attack\". Police urged residents to stay indoors and told the public not to travel to the area. Public buildings, including libraries, information centres and depots and the nearby airfield were closed until further notice, Porepunkah mayor Sarah Nicholas said. Porepunkah Primary School, which has more than 100 students, was in lockdown for hours before the children were allowed to go home. The Porepunkah Pub has said on Facebook it will be closed on Tuesday evening \"following advice from Victorian Police\". Porepunkah, known for its vineyards and scenic vistas, is a gateway to Victoria's alpine tourist region."
    },
    {
        "title": "Three people killed and more than a dozen injured as Typhoon Kajiki hits Vietnam",
        "description": "Three people have been killed and at least 13 others injured in a typhoon in Vietnam, authorities said.",
        "url": "https://news.sky.com/story/three-people-killed-and-more-than-a-dozen-injured-as-typhoon-kajiki-hits-vietnam-13418583",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vietnam-flood-typhoon_7001608.jpg?20250826095617",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-26 08:37:00",
        "Headline": "Among the three victims are a 90-year-old man whose house collapsed in the rain, according to state media.",
        "Content": "Three people have been killed and at least 13 others injured in a typhoon in Vietnam, authorities said. Typhoon Kajiki hit Vietnam's north central coast on Monday, damaging nearly 7,000 homes, felling 18,000 trees and flooding thousands of hectares of rice plantings. Among the three victims are a 90-year-old man whose house collapsed in the rain, and a man who died in Nghe An province on Friday after being electrocuted while trying to secure his roof, according to state media. The typhoon also brought down 331 electricity poles, causing widespread blackouts in several provinces, the Vietnamese government said in a statement. Heavy rain continued to fall on Tuesday morning, causing flooding in the streets of the capital, Hanoi. Cars were seen submerged up to their roofs in water, and the city's largest lake overflowed its banks. Several villages in Bac Ninh province have been cut off due to flooding, Vietnamese state media reports. Two airports, one in Thanh Hoa and the other in Quang Binh province, remained closed on Tuesday after flights were grounded on Monday, the country's civil aviation authority said. \n                  Massive dust storm leaves thousands without power and blinds drivers in southwest US\n                 \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  More than 280 dead after flash floods hit India and Pakistan\n                 There were plans to evacuate 600,000 people and 152,000 homes across Thanh Hoa, Quang Tri, and Danang provinces, state media reported. The government also mobilised 16,500 soldiers and 107,000 paramilitary personnel to assist with evacuations and rescue missions. Vietnam's coastline on the South China Sea is particularly prone to storms that often trigger deadly flooding and landslides. Kajiki was set to be more powerful than Typhoon Yagi, which killed 300 people and caused £2.4bn in damage last year. After making landfall on Monday afternoon, Kajiki has since weakened into a tropical depression as it moved across to Laos on Tuesday morning, according to Vietnam's national weather agency. The agency, however, warned that some areas in northern Vietnam are likely to get up to 150 millimetres (six inches) of rain in six hours, which could cause flash floods and landslides. Read more from Sky News:Manhunt after two police officers shot dead in AustraliaAustralia accuses Iran of organising antisemitic attacks China's southernmost province downgraded its emergency response alert on Monday morning after people in the holiday resort of Sanya on Hainan Island were forced to take shelter on Sunday evening as the storm damaged trees and buildings. In Thailand, residents in foothills and low-lying areas near waterways were warned about possible flash floods and landslides due to forecasted heavy rain into Wednesday."
    },
    {
        "title": "Air India crash: Families prepared for court fight over disaster which left 241 dead",
        "description": "\"Our world has fallen apart, and we want justice,\" says Nehal, her eyes welling up.",
        "url": "https://news.sky.com/story/air-india-crash-families-prepared-for-court-fight-over-disaster-which-left-241-dead-13418767",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-girish-airindia_7001892.png?20250826194057",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-08-26 14:06:00",
        "Headline": "Indian and British families have consented to American law firm Beasley Allen to represent them in US courts following the crash that killed 241 people on board and a further 19 on the ground.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  \"Our world has fallen apart, and we want justice,\" says Nehal, her eyes welling up. \"We lost four members of our family. I can't even tell you what we've been through. Just thinking of it makes me cry.\" Nehal's 32-year-old brother Girish, a British resident from Wembley, had travelled with his wife, their three-year-old son and infant daughter to meet his ailing mum in Diu, India. They were on that fateful flight back to the UK: the Air India flight from Ahmedabad to Gatwick, which went down just 32 seconds after take off on 12 June.  The Boeing aircraft, with 230 passengers and 12 crew members, crashed into a hostel block of the BJ Medical college, just about a mile from the runway. A total of 241 people on board were killed, while a further 19 people died on the ground. There were 53 UK citizens on the plane and only one miraculously survived: 39-year-old Vishwas Kumar Ramesh. 'We want justice' Nehal says her family's world has been crushed, as her brother supported the family financially by paying the rent and for their mother's medication. Two garlanded frames of the young couple and their children take centre place in her small home. Nehal's mother is bedridden and has fallen into depression. Nehal says: \"Whatever happened to us must not happen to any other family. And those responsible must accept their mistake. We want justice.\" She is among 90 Indian and British families who have consented to US law firm Beasley Allen to represent them in American courts. It is gathering evidence regarding the root cause of the crash and is prepared to take legal action. 'We're going to fight for the truth' Trupti Soni lost her brother, his wife, and sister-in-law. She wants an independent investigation to uncover any \"technical snag, design faults\" or other issues may have contributed to the disaster. \"Our loss is massive - nothing can reverse the loss of our dear ones. I feel the truth must come out,\" she says. Her brother Swapnil was travelling to the UK for work, and also to welcome the eldest brother who was driving from Ahmedabad to London - a lifelong dream. \"We're going to fight for the truth and whoever fights for the truth, God is with them,\" Trupti says. 'No one should suffer what we have been through' Harsad is another who is grieving, having lost his parents Devji Lacmane and Vanita in the crash. \"We definitely want justice; we want to know whose fault caused the crash. Thousands of aircraft are in the skies - are they safe? No one should suffer what our family has been through.\" Fourteen of those who died in the crash had their roots in Diu - a tiny sliver of land on the Gujarat coast. Survivor Vishwas Kumar Ramesh is also from here. Diu, a former Portuguese colony, was liberated in 1961, its residents offered citizenship of Portugal. Many took it and then made their way to Britain. With just over 50,000 people, almost everyone here has been touched by this tragedy. At night, a gathering of families of the crash came to pay their last respects. Vishwas was there for the rituals of his younger brother Ajay, who was sitting beside him on that fateful flight.  Questions unanswered The preliminary investigative report into the crash threw up more questions than answers. It indicated pilot error, and the cutting off of fuel to the engines. It also said there were no safety recommendations to the makers of the aircraft, which led to a backlash from the pilot community. Mike Andrews, the principal attorney of Beasley Allen, told Sky News: \"I think it is more likely at this point that it is a technological or an electrical issue rather than human error. \"But anyone who speculates too far either way is doing so without all the necessary evidence. \"That data that is needed is contained within the flight data recorder.\" Sky News has approached Boeing for comment and has not received a response yet. Read more:Plane suffered 'no mechanical fault' before crashAnger growing as Air India families wait for relatives' remains  Citing published directives on the plane's airworthiness from Federal Aviation Authority bulletins, and Boeing documents available online, Mr Andrews said the 787 \"apparently has issues with leaks in water lines\" which feed the front and rear restrooms, toilets, and kitchen areas. Those leaks can affect areas in which electrical and computer equipment are housed, he said, adding: \"Anyone who's ever had an iPhone which gets wet understands that electronics and water typically don't mix very well.\" Mr Andrews drew attention to what's known as the TCMA, or throttle control malfunction accommodation. It is \"essentially a safety system that looks at the speed of the engine relative to the position of the throttle and determines if the engine is overspeeding while the plane is on the ground\", he explained. \"It has the ability to shut off or control the engines autonomously if it makes that decision in its logic or sensors. So obviously if it becomes wet, and you develop an electrical short, you have a short in this system. \"The issue is we know there are various computer systems on the 787 which can call for uncommanded inputs or controls to the plane. We are very concerned that could lead to the sort of problem we see here.\" Investigations are ongoing, and a final report is due in a year's time. But families want answers and so far, they have none - in one of the deadliest aviation disasters India has seen."
    },
    {
        "title": "Australia accuses Iran of organising antisemitic attacks",
        "description": "Australian Prime Minister Anthony Albanese has accused Iran of organising two antisemitic attacks in Australia.",
        "url": "https://news.sky.com/story/australia-accuses-iran-of-organising-antisemitic-attacks-13418544",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-australia-albanese_7001540.jpg?20250826084346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-26 06:20:00",
        "Headline": "Australia claimed Tehran directed \"extraordinary and dangerous acts of aggression\" in Sydney and Melbourne last year and says it will sever diplomatic relations with Iran",
        "Content": "Australian Prime Minister Anthony Albanese has accused Iran of organising two antisemitic attacks in Australia. Mr Albanese said the Australian security intelligence organisation (ASIO) found that the Iranian government had directed arson attacks on a kosher food company in Sydney and on a Melbourne synagogue in October and December last year. \"Iran has sought to disguise its involvement, but ASIO assesses it was behind the attacks,\" Mr Albanese said on Tuesday. There has been a large increase in antisemitic incidents in Sydney and Melbourne since the start of the Israel-Hamas war in 2023. Mr Albanese called the conclusion that Iran was behind \"at least two\" of these attacks \"deeply disturbing\". ASIO director-general Mike Burgess said no Iranian diplomats in Australia were involved, adding that Iran's Revolutionary Guard directed the attacks \"through a series of overseas cut-out facilitators to coordinators that found their way to tasking Australians\". \"These were extraordinary and dangerous acts of aggression orchestrated by a foreign nation on Australian soil. They were attempts to undermine social cohesion and sow discord in our community. It is totally unacceptable,\" Mr Albanese said. \n                  Gaza hospital rejects Israel's claim troops 'saw Hamas camera' before deadly attack\n                 \n                  Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?\n                 \n                  Russia is mastering a new type of drone that cannot be jammed - and the West has work to do\n                 In response, Australia said it was severing diplomatic relations with Tehran, with the prime minister telling Iran's ambassador to Australia, Ahmad Sadeghi, that he would be expelled. Mr Albanese added that Australia withdrew Australian diplomats posted to Iran to a third country. This is the first time Australia has expelled an ambassador since World War II, according to Foreign Minister Penny Wong. Iran's government had no immediate reaction to Mr Albanese's announcement. The Australian government alerted Australians in Iran that its embassy in the country was closed and urged them to \"strongly consider leaving as soon as possible\". It said foreigners in Iran \"are at a high risk of arbitrary detention or arrest\". Iran is known to detain Westerners or those with ties abroad to use as bargaining chips in negotiations. Australia also upgraded its warning to travellers to the highest level, urging them not to travel to Iran. Read more from Sky News:Two police officers shot dead in AustraliaJournalists among those killed in Israeli strikes Mr Albanese said Australia will pass a law to list the Revolutionary Guard as a terrorist organisation. The paramilitary group has long been accused of carrying out attacks abroad, but it broadly denies any involvement. Western nations have previously accused the Guard's expeditionary arm of using local militants and criminals to target dissidents and Israelis abroad. Israel has arrested several people since the start of the war with Hamas on charges that they had been paid or encouraged by Iran to carry out vandalism and monitor potential targets in Israel."
    },
    {
        "title": "Trump seeks to fire Fed governor, triggering fresh independence crisis",
        "description": "President Donald Trump says he is firing a governor of the US central bank, a move seen as intensifying his bid for control over the setting of interest rates.",
        "url": "https://news.sky.com/story/trump-seeks-to-fire-fed-governor-triggering-fresh-independence-crisis-13418524",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lisa-cook-fed_7001481.jpg?20250826061115",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-08-26 04:24:00",
        "Headline": "The president says he is firing Lisa Cook for alleged mortgage fraud but she argues he has no cause or authority to do so.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n President Donald Trump says he is firing a governor of the US central bank, a move seen as intensifying his bid for control over the setting of interest rates. He posted a letter on his Truth Social platform on Monday night declaring that Lisa Cook - the first black woman to be appointed a Federal Reserve governor - was to be removed from her post on alleged mortgage fraud grounds. She has responded, insisting he has no authority over her job and vowed to continue in the role, threatening a legal battle that could potentially go all the way to the Supreme Court. On Monday afternoon, a legal representative for Ms Cook said she would file a lawsuit challenging the removal. Money latest: 'RAC left me stranded on a busy motorway for four hours - then gave me £8' The president's threat is significant as he has consistently demanded that the central bank cut interest rates to help boost the US economy. Growth has sagged since he returned to office on the back of US trade war gloom and hiring has slowed sharply in more recent months. Mr Trump has previously directed his ire over rates at Jay Powell, the chair of the Federal Reserve, blaming him for the economic jitters, and has repeatedly called for him to be fired. \n                  Health and beauty chain Bodycare in race to avert collapse\n                 \n                  Dozens of job losses as Guardian-backed research firm Streetbees collapse\n                 \n                  Money latest: Another streaming service hikes price - here's how to beat it\n                 The Fed, as it is known, has long been considered an institution independent from politics and question marks over that independence has previously shaken financial markets. The dollar was hit overnight while stock markets in Europe and Asia were widely down globally on Tuesday. US stocks rose as the trading day wore on. Investors also demanded a higher premium to hold US debt while bond yields were also up across Europe, with the UK's 30-year figure at its highest since April. Mr Powell's term is due to end next spring and the president is expected to soon nominate his replacement. The Fed has 12 people with a right to vote on monetary policy, which includes the setting of interest rates and some regulatory powers. Those 12 include the seven members of the Board of Governors, of which Ms Cook is one. Replacing her would give Mr Trump appointees a 4-3 majority on the board.  He has previously said he would only appoint Fed officials who support lower borrowing costs. Ms Cook was appointed to the Fed's board by then-president Joe Biden in 2022. Her nomination was opposed by most Senate Republicans at the time and was only approved on a 50-50 vote, with the tie broken by then-vice president Kamala Harris. It was alleged last week by a Trump appointed regulator that Ms Cook had claimed two primary residences in 2021 to get better mortgage terms. Mortgage rates are often higher on second homes or those purchased to rent. She responded to the president's letter: \"President Trump purported to fire me 'for cause' when no cause exists under the law, and he has no authority to do so,\" she said in an emailed statement. \"I will not resign.\" Legal experts said it was for the White House to argue its case. But Lev Menand, a law professor at Columbia law school, said of the situation: \"This is a procedurally invalid removal under the statute. \"This is not someone convicted of a crime. This is not someone who is not carrying out their duties.\" Speaking at the White House on Tuesday, the president claimed Ms Cook \"seems to have had an infraction\". He added: \"And she can't have an infraction, especially that infraction, because she's in charge of... mortgages, and we need people that are 100% above board, and it doesn't seem like she was.\" The Fed was yet to comment. It has held off from interest rate cuts this year, largely over fears that the president's trade war will result in a surge of inflation due to higher import duties being passed on in the world's largest economy. However, Mr Powell hinted last week that a cut could now be justified due to risks of rising unemployment."
    },
    {
        "title": "Taylor Swift announces engagement to boyfriend Travis Kelce",
        "description": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce.",
        "url": "https://news.sky.com/story/taylor-swift-announces-engagement-to-boyfriend-travis-kelce-13418848",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-taylor-swift-travis-kelce_7001935.jpg?20250826181351",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-26 17:11:00",
        "Headline": "Swift and Kelce started their relationship in 2023, after the NFL player said he tried and failed to meet the singer at an Eras Tour concert.",
        "Content": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce. The pop star and Kansas City Chiefs tight end shared the news in a joint post on Instagram, with the caption: \"Your English teacher and your gym teacher are getting married.\" The announcement was liked more than 1.7 million times just over 30 minutes after it was posted. Swift and Kelce started their relationship in 2023, after the three-time Super Bowl winner said on his podcast New Heights that he tried and failed to meet the singer at her Eras Tour concert in Kansas City. Rumours grew that the couple were dating after Swift was spotted at a number of Chiefs games. On her seventh time in the stands, she brought her father, Scott Kingsley Swift, along. Kelce told the Wall Street Journal in November 2023: \"There were definitely people she knew that knew who I was, in her corner [who said]: 'Yo! Did you know he was coming [to the Eras Tour]?' \"I had somebody playing Cupid... She told me exactly what was going on and how I got lucky enough to get her to reach out.\" \n                  Boy, 16, convicted in Germany over supporting failed terror plot at Taylor Swift concert\n                 \n                  Taylor Swift reveals release date for new album\n                 \n                  Taylor Swift cements place as 'hardest-working star in pop' with announcement of 12th studio album\n                  Earlier this month, Swift appeared on Kelce's podcast, New Heights, and announced her 12th album, titled The Life Of A Showgirl. Speaking to Kelce and his brother Jason, Swift said it was inspired by the Eras Tour - and also talked about his attempt at meeting her two years ago. While she said his plan to give her his number on a friendship bracelet was a \"wild, romantic gesture,\" she joked he \"didn't do any proper logistical planning\" and thought he would be allowed backstage. \"Because he knows the elevator lady, he thought he could talk to her about just getting down to my dressing room,\" she added. \"That's how it works in 1973.\" Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record The new album, which will be released on 3 October, marks her first release since she took back control over her entire back catalogue from private equity firm Shamrock Capital. Sky News culture and entertainment reporter Gemma Peplow said after her globe-trotting tour and a swathe of re-releases over recent years, the new album cemented Swift's reputation \"as the hardest-working star in pop\". Despite rumours he would retire after losing this year's Super Bowl, Kelce will play for the Kansas City Chiefs again this season. He told GQ magazine his on-field performances \"slipped a little bit\" as he started acting, and added: \"I'm just saying that my work ethic is such that I have so much pride in how I do things that I never want the product to tail off, and I feel like these past two years haven't been to my standard.\""
    },
    {
        "title": "With Love, Meghan: What we learnt from second series of Duchess of Sussex's lifestyle show",
        "description": "The second season of the Duchess of Sussex's lifestyle show With Love, Meghan, has been released.",
        "url": "https://news.sky.com/story/meghan-reveals-who-said-i-love-you-first-with-harry-and-what-she-misses-about-the-uk-13418553",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-meghan-prince-harry_7001523.jpg?20250826084402",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-26 07:04:00",
        "Headline": "In the second series of the Duchess of Sussex's lifestyle show, she gives an insight into her life with Prince Harry and their two children, Archie and Lilibet.",
        "Content": "The second season of the Duchess of Sussex's lifestyle show With Love, Meghan, has been released. Over the eight-episode series, which features celebrity guests including US model and TV personality Chrissy Teigen and Queer Eye's Tan France, Meghan opens up about what she misses most about the UK, the meal she cooked on the night Prince Harry proposed, and who said \"I love you\" first. The premiere of the second series comes two weeks after Harry and Meghan announced a watered-down deal with the streaming giant Netflix. Despite Harry not making a cameo in the show, Meghan does give some insight into her life in California with the prince, and their two children, Archie and Lilibet. Here is what we learnt from the duchess. Harry saying 'I love you'  In one episode, with British fashion designer Tan France, Meghan says it was Harry who first said he loved her. \"He told me,\" she says before blushing and flicking her ponytail with her hand and saying: \"She's still got it.\" She adds that she fell in love with him while camping in Botswana, the pair's third date. \"We met in Botswana, and we camped for five days together,\" she says, adding: \"You really get to know someone when you are in a little tent.\" Missing one particular UK radio station  After first getting married, Meghan had planned to apply for British citizenship. But the pair later moved to the US after stepping down from their roles as working royals. In episode three, with Tan France, Meghan admits one of the things she \"misses the most\" about the UK, after leaving five years ago. She says: \"Honestly, one of the things I miss the most about the UK is the radio station called Magic.\" To which France quips: \"Magic FM. Wow! Now, sorry to say this to you publicly, but that's such a grandma station.\" A laughing Meghan replies: \"I'll be that grandma.\" Duchess 'not well' when away from her children Later in episode three, when the pair are crafting aprons for their children, Meghan says she \"always wanted to be a mum\", which is now \"better than she expected\" after the birth of Archie, in 2019, and Lilibet - who they call Lili for short - in 2021. Sympathising with France, who explained he gets heartbroken if away from his two young children for more than a couple of days, the duchess says the longest she and Harry have ever been without seeing their children is almost three weeks. \"I was... not well,\" Meghan says about the separation. In Harry's 2023 memoir, Spare, he wrote of the \"difficult days\" after Queen Elizabeth II's death and how he and Meghan were separated from Archie and Lili for \"longer than we'd ever been\". He said when they reunited at their home in Montecito, \"for days and days we couldn't stop hugging the children, couldn't let them out of our sight\". 'Terrible' chicken In the fourth episode with American chef and TV host Samin Nosrat, Meghan reveals she tried to make a roast chicken on the night Harry proposed in 2017, but it didn't turn out how she expected. \"I will say when I made a roast chicken for my now-husband I was still having a lot of challenges with the conversion of Celsius and Fahrenheit. I made a horrible chicken that night. I mean, truly terrible,\" she says. \"The point is you can make a terrible chicken and someone is still going to appreciate the thought.\" Read more from Sky News:Impact of new online safety rules revealed one month onMedvedev expecting 'big fine' after outburst at US Open Harry and Meghan's wedding menu When chatting with British chef Clare Smyth, who cooked the food at Harry and Meghan's Windsor wedding in 2018, the duchess says \"everyone still talks\" about the meal - which included roast chicken. \"Remember, we had the map where everything was sourced? We really wanted people to appreciate where every ingredient was coming from,\" she says. The three-Michelin-starred chef revealed that she also devised a special fried chicken recipe to serve as a \"late-night bite\" at the wedding, which she now serves as an \"off-menu\" item at her restaurant Core. \"Our off-menu item is the fried chicken at Core,\" Meghan says, adding: \"If that's my claim to fame. I'm thrilled.\" Archie and Lili use both British and American words In another part of the sixth episode, Smyth says she always has to think about the American names for certain foods, including eggplant (aubergine) and cilantro (coriander). The duchess then says: \"My kids will say a little bit of both, but never cooking terms, because I guess papa is not cooking as much. \"They both say zebra instead of zee-bra.\" Her time on Deal Or No Deal In the episode with Chrissy Teigen, Meghan reminisces about her time working on the US version of the game show Deal Or No Deal as a briefcase model. Teigen, who is married to singer John Legend, also appeared on the show and described it as a \"really important, funny\" chapter in their lives. \"I remember being a back-up girl,\" Teigen says, before Megan laughs, adding: \"I remember us all standing in line to get our lashes put on. \"I was just so happy to get health insurance... How far we have come.\" The duchess appeared on the show in 2006 and 2007, before landing the role she is most known for, Rachel Zane in the legal drama series, Suits. 'PH 40' hats and portable family photos In one of the later episodes in the series, Meghan packs a bag for a trip to Malibu, to see her friend and pilates instructor, Heather Dorak. Explaining what she is putting in her bag, the duchess shows a baseball cap with 'PH 40' on the front, which she says she made for Harry's 40th birthday last year. She goes on to say she \"always, always brings photos of my family\" when she goes away, holding up a small selection of three framed black and white photos. She says: \"I went on a girls' trip recently and my girlfriends were like 'Oh my God, that's so sweet, you keep it by your bed!' \"You could just look at your phone, but I am just sentimental in that way.\""
    },
    {
        "title": "Kilmar Abrego Garcia: The wrongly deported man who has become a flashpoint in Trump's deportations blitz",
        "description": "The case of Kilmar Abrego Garcia, who was accidentally deported from the US because of an \"administrative error\", has become a flashpoint in the Trump administration's aggressive anti-immigration efforts.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-the-wrongly-deported-man-who-has-become-a-flashpoint-in-trumps-deportations-blitz-13418498",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-kilmar-abrego-garcia_7001469.jpg?20250826035314",
        "type": "US",
        "Author": "Megan Harwood-Baynes, news reporter",
        "Date Published": "2025-08-26 00:37:00",
        "Headline": "He was labelled a terrorist and alleged gang member, despite having no criminal convictions, and deported to El Salvador. But his lawyers argue the claims were made based on his clothing and an unnamed informant.",
        "Content": "By Megan Harwood-Baynes, news reporter   The case of Kilmar Abrego Garcia, who was accidentally deported from the US because of an \"administrative error\", has become a flashpoint in the Trump administration's aggressive anti-immigration efforts. Labelled a terrorist and alleged gang member, claims denied by him and his lawyers, he was temporarily removed to El Salvador earlier this year and now faces yet another deportation order. The case symbolises Donald Trump's hardline immigration agenda. He has signed executive orders ending birthright citizenship and declaring a national emergency at the southern border. Mass deportations, immigration raids and arrests have increased, sparking protests. But officials have said Garcia's case shows the administration's resolve. Here's everything you need to know. Why Trump says he is a gang member Court documents show Garcia entered the US illegally from El Salvador in 2012, when he was 16 - neither side disputes this. Garcia claims the Barrio 18 street gang terrorised his family, so he travelled to Maryland, where his brother (a US citizen) lives. He found work in construction and in 2016 he married Jennifer Vasquez Sura, also a US citizen. They have one child together and another two from her previous relationship. Three years later, he was arrested alongside three other men in the car park of a Home Depot in Maryland. Police said they were \"loitering\". Garcia was wearing a Chicago Bulls hat, a hoodie, and an unnamed informant identified him. The clothing, police said, \"represents that [he is] a member in good standing with MS-13\", while the informant confirmed his membership of the gang with the \"westerns clique\". After his arrest, the White House said the tattoos on his hands are consistent with MS-13 associations. MS-13 is a notorious international criminal gang that was formed in LA, but has roots in El Salvador. How Garcia disputes these claims Lawyers for Garcia have strongly refuted the claims of gang associations. In court filings, they argued the \"evidence\" amounted to nothing more than his outfit as well as uncorroborated allegation from the unnamed informant. The \"western clique\" operates out of New York, they said - a place Garcia has never lived. But in 2019, a judge ruled the information from the source was enough to prove his gang membership - this was later upheld by another judge. So Garcia was held in custody while he applied for asylum. He was granted a \"withholding of removal\" order, which prevented the government from deporting him back to El Salvador. This was granted on the basis of a \"well-founded\" fear of persecution by Barrio-18, the main rival gang of MS-13. For the next four years, Garcia attended his annual ICE (Immigration and Customs Enforcement) reporting check-ins \"without fail and without incident\", his lawyers say. Read more:'This is our city': Furious immigrants vow to 'defend' LAHow Trump's immigration crackdown has changed livesWhat we know about the Los Angeles immigration raids Further allegations In 2021, Garcia's wife, Jennifer Vasquez Sura, filed a protective order, alleging Garcia had physically attacked her, the details of which came to light after his deportation in 2025. The Department of Homeland Security shared details of the incident online, saying: \"This MS-13 gang member is not a sympathetic figure.\" But Sura said in a statement she and her husband \"were able to work through this situation privately as a family, including by going to counselling\". She denied her husband was a member of MS-13. Garcia was also accused of human trafficking following a traffic stop in 2022. He was stopped in Tennessee for speeding, with a report by the Department of Homeland Security saying the eight other people in the car without luggage raised suspicions of human trafficking. But his wife said he worked in construction and sometimes transported workers between job sites. Why was Garcia arrested? On 12 March 2025, Garcia was pulled over by ICE officers while driving his disabled son, a US citizen. He was taken into custody and three days later called his wife to say he was being deported to El Salvador, where he was imprisoned in the country's maximum security Terrorism Confinement Center (CECOT). This was despite that aforementioned 2019 order protecting him from deportation. The Trump administration later admitted it had been an \"administrative error\" to remove him, but said they could not bring him back as they do not have jurisdiction over El Salvador. Return to the US - and detained again After he was eventually returned to the US in June, the Trump administration detained Garcia on criminal charges that were filed in May. The criminal indictment alleges Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Minutes after his release on Friday, 22 August, officials notified Garcia they intended to deport him to Uganda. According to a court filing by his lawyers, immigration officials made an offer to Garcia to be deported to Costa Rica in exchange for pleading guilty to the charges. He was detained during a scheduled check-in with ICE in Baltimore. \"This administration has hit us hard,\" he said outside the ICE office on Monday, but added: \"God is with us, and God will never leave us. God will bring justice to all the injustice we are suffering.\" He will remain detained until a hearing on Wednesday."
    },
    {
        "title": "Massive dust storm leaves thousands without power and blinds drivers in southwest US",
        "description": "A powerful dust storm, known as a haboob, has struck the southwestern state of Arizona, bringing dangerous driving conditions, knocking out power and closing airports.",
        "url": "https://news.sky.com/story/massive-dust-storm-leaves-thousands-without-power-and-blinds-drivers-in-southwest-us-13418561",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-arizona-dust-storm_7001560.jpg?20250826141543",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-26 09:40:00",
        "Headline": "Flights were grounded and power supplies disrupted by the dust storm, which swept across parts of Arizona on Monday.",
        "Content": "A powerful dust storm, known as a haboob, has struck the southwestern state of Arizona, bringing dangerous driving conditions, knocking out power and closing airports. The skies above Arizona's state capital, Phoenix, turned dark on Monday as the weather system rolled in. More than 15,000 people lost power, most in Maricopa County, which includes Phoenix, according to the tracking website PowerOutage.us Heavy rain and wind followed the haboob, delaying flights at Phoenix Sky Harbor International Airport and damaging a terminal roof. Arizona City, about 60 miles (95km) southeast of Phoenix also experienced the towering wall of dust. Bernae Boykin Hitesman was driving her son and daughter, nine and 11, home from school when she was forced to quickly pull her car over as the storm engulfed her vehicle. \"I couldn't see my hand in front of my face if I put my hand outside,\" she said. \n                  Three people killed and more than a dozen injured as Typhoon Kajiki hits Vietnam\n                 \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  More than 280 dead after flash floods hit India and Pakistan\n                 \"My kids were really, really scared, so I was trying to be brave for them. She added she could taste the dust and feel the strong wind rattling her car until it finally passed about 15 minutes later. by Joanna Robinson, Sky News weather producer A sandstorm or duststorm is often referred to as a haboob. The name originates from northern Sudan and comes from the Arabic word 'habb', which means \"to blow\". Now the term is used across the world to describe any wind-driven sandstorm or dust storm in arid or semi-arid regions, like Phoenix in the Sonoran Desert. Haboobs often occur as a result of a microburst within a thunderstorm, when a strong downdraught of air hits the ground and spreads out in all directions. \n In desert regions, the microburst outflow can carry sand and dust particles at great speeds, reaching heights of up to 5,000ft.\n Richard Filley, a retired university professor who lives in the Phoenix suburb of Gilbert, said the dust storm caused the trees to sway and knocked bird feeders to the ground. Fine dust found its way through \"every little crack and space\" into his house, he said. \"You look at the photos of haboobs and they are a spectacular natural phenomenon. They are kind of beautiful in their own way,\" he added. Read more from Sky News:Trump seeks to fire Fed governorMeghan's show gives personal insightsTrump wants to meet Kim Jong Un On Saturday, in the neighbouring state of Nevada, strong dust storms and 50mph winds ripped through Black Rock City, a temporary city erected in the Black Rock Desert as part of the Burning Man festival. The storm wreaked havoc on campsites and caused major travel delays in the area, with festival organisers confirming there were four minor injuries, according to Sky's US partner, NBC News. The National Weather Service had issued a dust storm advisory over the weekend, saying \"a wall of blowing dust\" was tracking northward. An estimated 70,000 people are expected to travel to Black Rock City for the festival, which runs through 1 September. Dust storms can prove extremely dangerous for motorists as they reduce visibility. At least eight people were killed in Kansas in March after a pile-up involving more than 70 vehicles caught in a dust storm."
    },
    {
        "title": "Health and beauty chain Bodycare in race to avert collapse",
        "description": "A health and beauty retailer founded on a Lancashire market stall more than half a century ago is facing collapse amid a race to find a rescue deal.",
        "url": "https://news.sky.com/story/health-and-beauty-chain-bodycare-in-race-to-avert-collapse-13418656",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-bodycare-merseyside_5784556.jpg?20220526110321",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-26 10:33:00",
        "Headline": "Hundreds of jobs are at risk at the health and beauty retail chain, which employs about 1,500 people, as advisors race to avert its collapse as early as next week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A health and beauty retailer founded on a Lancashire market stall more than half a century ago is facing collapse amid a race to find a rescue deal. Sky News has learnt that Bodycare, which employs about 1,500 people, could fall into administration as soon as next week unless a buyer is found. City sources said that Interpath, the advisory firm which has been working with Bodycare and its owners for several months, was continuing to explore options for the business. Money latest: Three items drive food price surge The company is owned by Baaj Capital, a family office run by Jas Singh. Its other investments have included In The Style, which underwent a pre-pack administration earlier this year, and party products supplier Amscan International. Baaj also attempted to take over The Original Factory Shop earlier this year before its offer was trumped by Modella Capital, another specialist retail investor. \n                  Dozens of job losses as Guardian-backed research firm Streetbees collapse\n                 \n                  Trump seeks to fire Fed governor, triggering fresh independence crisis\n                 \n                  Money latest: Another streaming service hikes price - here's how to beat it\n                 News of Bodycare's travails comes just weeks after the retailer secured a £7m debt facility to buy it short-term breathing space. The facility was secured against Bodycare's retail inventory, according to a statement last month. Bodycare was established by Graham and Margaret Blackledge in Skelmersdale in 1970, and sells branded products made by the likes of L'Oreal, Nivea and Elizabeth Arden. The chain was profitable before the pandemic, but like many retailers lost millions of pounds in the financial years immediately after it hit. Bodycare received financial support from the taxpayer in the form of a multimillion-pound loan issued under one of the Treasury's pandemic funding schemes. The chain is run by retail veteran Tony Brown, who held senior roles at BHS and Beales, the now-defunct department store groups. If Bodycare does fall into insolvency proceedings, it would be the latest high street chain to face collapse this year, amid intensifying complaints from the industry about tax increases announced in last autumn's budget. In recent weeks, River Island narrowly avoided administration after winning creditor approval for a restructuring involving store closures and job losses. Later this week, the struggling discount giant Poundland will seek similar approval from the courts for a radical overhaul that will entail dozens of shop closures. Bodycare could not be reached for comment on Tuesday, while Baaj has been contacted for comment and Interpath declined to comment."
    },
    {
        "title": "Dozens of job losses as Guardian-backed research firm Streetbees collapse",
        "description": "An AI-powered market research firm backed by The Guardian's publisher and once valued at $200m has collapsed, triggering dozens of job losses.",
        "url": "https://news.sky.com/story/scores-of-job-losses-as-guardian-backed-research-firm-streetbees-collapse-13418779",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-streetbees-ap-google-play_6994331.jpg?20250818112109",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-26 14:47:00",
        "Headline": "The AI-led market research firm has collapsed with all of its employees being made redundant after last-ditch talks to secure a rescue deal proved unsuccessful, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An AI-powered market research firm backed by The Guardian's publisher and once valued at $200m has collapsed, triggering dozens of job losses. Sky News has learnt that Streetbees, which has counted Unilever and Vodafone among its clients, fell into administration on Monday after last-ditch efforts to find a buyer proved unsuccessful. The professional services firm FRP Advisory has been appointed as administrator. Streetbees, which has also worked with Heineken, Ferrero and Avon, raised tens of millions of pounds in funding from blue-chip backers. It landed a $40m Series B funding round from investors including Lakestar, LocalGlobe and GMG Ventures - the early-stage investment arm of Guardian Media Group - in 2020. That funding round reportedly valued the company at $200m. Responding to an enquiry from Sky News, a spokesperson for Streetbees said: \"Streetbees confirms that it has now entered administration after exhaustive efforts to secure additional investment have proved unsuccessful. \n                  Health and beauty chain Bodycare in race to avert collapse\n                 \n                  Trump seeks to fire Fed governor, triggering fresh independence crisis\n                 \n                  Money latest: Another streaming service hikes price - here's how to beat it\n                 \"Despite strong interest from multiple parties, we were unable to conclude a transaction that would provide the necessary capital to continue operations. \"Streetbees, which pioneered human intelligence gathering through its innovative platform, had seen strong traction with its new AI-first product SBX. \"However, the legacy challenges of the business, compounded by current market conditions, created obstacles they have been unable to overcome. \"Unfortunately, all staff will be made redundant.\""
    },
    {
        "title": "Trump seeks to fire Fed governor, triggering fresh independence crisis",
        "description": "President Donald Trump says he is firing a governor of the US central bank, a move seen as intensifying his bid for control over the setting of interest rates.",
        "url": "https://news.sky.com/story/trump-seeks-to-fire-fed-governor-triggering-fresh-independence-crisis-13418524",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lisa-cook-fed_7001481.jpg?20250826061115",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-08-26 04:24:00",
        "Headline": "The president says he is firing Lisa Cook for alleged mortgage fraud but she argues he has no cause or authority to do so.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n President Donald Trump says he is firing a governor of the US central bank, a move seen as intensifying his bid for control over the setting of interest rates. He posted a letter on his Truth Social platform on Monday night declaring that Lisa Cook - the first black woman to be appointed a Federal Reserve governor - was to be removed from her post on alleged mortgage fraud grounds. She has responded, insisting he has no authority over her job and vowed to continue in the role, threatening a legal battle that could potentially go all the way to the Supreme Court. On Monday afternoon, a legal representative for Ms Cook said she would file a lawsuit challenging the removal. Money latest: 'RAC left me stranded on a busy motorway for four hours - then gave me £8' The president's threat is significant as he has consistently demanded that the central bank cut interest rates to help boost the US economy. Growth has sagged since he returned to office on the back of US trade war gloom and hiring has slowed sharply in more recent months. Mr Trump has previously directed his ire over rates at Jay Powell, the chair of the Federal Reserve, blaming him for the economic jitters, and has repeatedly called for him to be fired. \n                  Health and beauty chain Bodycare in race to avert collapse\n                 \n                  Dozens of job losses as Guardian-backed research firm Streetbees collapse\n                 \n                  Money latest: Another streaming service hikes price - here's how to beat it\n                 The Fed, as it is known, has long been considered an institution independent from politics and question marks over that independence has previously shaken financial markets. The dollar was hit overnight while stock markets in Europe and Asia were widely down globally on Tuesday. US stocks rose as the trading day wore on. Investors also demanded a higher premium to hold US debt while bond yields were also up across Europe, with the UK's 30-year figure at its highest since April. Mr Powell's term is due to end next spring and the president is expected to soon nominate his replacement. The Fed has 12 people with a right to vote on monetary policy, which includes the setting of interest rates and some regulatory powers. Those 12 include the seven members of the Board of Governors, of which Ms Cook is one. Replacing her would give Mr Trump appointees a 4-3 majority on the board.  He has previously said he would only appoint Fed officials who support lower borrowing costs. Ms Cook was appointed to the Fed's board by then-president Joe Biden in 2022. Her nomination was opposed by most Senate Republicans at the time and was only approved on a 50-50 vote, with the tie broken by then-vice president Kamala Harris. It was alleged last week by a Trump appointed regulator that Ms Cook had claimed two primary residences in 2021 to get better mortgage terms. Mortgage rates are often higher on second homes or those purchased to rent. She responded to the president's letter: \"President Trump purported to fire me 'for cause' when no cause exists under the law, and he has no authority to do so,\" she said in an emailed statement. \"I will not resign.\" Legal experts said it was for the White House to argue its case. But Lev Menand, a law professor at Columbia law school, said of the situation: \"This is a procedurally invalid removal under the statute. \"This is not someone convicted of a crime. This is not someone who is not carrying out their duties.\" Speaking at the White House on Tuesday, the president claimed Ms Cook \"seems to have had an infraction\". He added: \"And she can't have an infraction, especially that infraction, because she's in charge of... mortgages, and we need people that are 100% above board, and it doesn't seem like she was.\" The Fed was yet to comment. It has held off from interest rate cuts this year, largely over fears that the president's trade war will result in a surge of inflation due to higher import duties being passed on in the world's largest economy. However, Mr Powell hinted last week that a cut could now be justified due to risks of rising unemployment."
    },
    {
        "title": "Nigel Farage has a new 'leave' campaign - here's how it could work and how it might impact you",
        "description": "Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election.",
        "url": "https://news.sky.com/story/nigel-farage-has-another-leave-campaign-how-would-it-work-and-how-might-you-be-impacted-13418933",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-echr_7002337.jpg?20250826235508",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-08-26 19:51:00",
        "Headline": "Not content with Britain having left the EU, Nigel Farage now wants to see the country leave the European Convention on Human Rights. But what even is it, how could we actually leave, and how would our rights be impacted? Sky News explains.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Nigel Farage has said he would take the UK out of the European Convention on Human Rights (ECHR) if Reform win the next election. The party's leader also reaffirmed his pledge to repeal the Human Rights Act and disapply three other international treaties acting as \"roadblocks\" to deporting anyone entering the UK illegally. In a speech about tackling illegal migration, he said a Reform government would detain and deport any migrants arriving illegally, including women and children, and they would \"never, ever be allowed to stay\". Sky News looks at what the ECHR is, how the UK could leave, and what could happen to human rights protections if it does. What is the ECHR? On 4 November 1950, the 12 member states of the newly formed Council of Europe (different to the EU) signed the Convention for the Protection of Human Rights and Fundamental Freedoms - otherwise known as the ECHR. It came into force on 3 September 1953 and has since been signed by an additional 34 Council of Europe members who have joined, bringing the total to 46 signatories. The treaty was drafted in the aftermath of the Second World War and the Holocaust to protect people from the most serious human rights violations. It was also in response to the growth of Stalinism in central and Eastern Europe to protect members from communist subversion. The treaty was the first time fundamental human rights were guaranteed in law. Sir Winston Churchill helped establish the Council of Europe and was a driving force behind the ECHR, which came from the Charter of Human Rights that he championed and was drafted by British lawyers. To be a signatory of the ECHR, a state has to be a member of the Council of Europe - and they must \"respect pluralist democracy, the rule of law and human rights\". There are 18 sections, including the most well-known: Article 1 (the right to life), Article 3 (prohibition of torture), Article 6 (right to a fair trial), Article 8 (right to private and family life) and Article 10 (right to freedom of expression). The ECHR has been used to halt the deportation of migrants in 13 out of 29 UK cases since 1980. ECHR protections are enforced in the UK through the Human Rights Act 1998, which incorporates most ECHR rights into domestic law. This means individuals can bring cases to UK courts to argue their ECHR rights have been violated, instead of having to take their case to the European Court of Human Rights. Article 8 is the main section that has been used to stop illegal migrant deportations, but Article 3 has also been successfully used. Read more:Why Farage's small boats plan is not actually about policyLegal expert explains if Farage deportation plan would work How is it actually used? The ECHR is interpreted by the European Court of Human Rights (ECtHR) - you'll have to bear with us on the confusingly similar acronyms. The convention is interpreted under the \"living instrument doctrine\", meaning it must be considered in the light of present-day conditions. The number of full-time judges corresponds to the number of ECHR signatories, so there are currently 46 - each nominated by their state for a non-renewable nine-year term. But they are prohibited from having any institutional ties with the state they come from. An individual, group of individuals, or one or more of the signatory states can lodge an application alleging one of the signatory states has breached their human rights. Anyone who have exhausted their human rights case in UK courts can apply to the ECtHR to have their case heard in Strasbourg. All ECtHR hearings must be heard in public, unless there are exceptional circumstances to be heard in private, which happens most of the time following written pleadings. The court may award damages, typically no more than £1,000 plus legal costs, but it lacks enforcement powers, so some states have ignored verdicts and continued practices judged to be human rights violations. Read more: Asylum seekers in charts and numbers How could the UK leave? A country can leave the convention by formally denouncing it, but it would likely have to also leave the Council of Europe as the two are dependent on each other. At the international level, a state must formally notify the Council of Europe of its intention to withdraw with six months' notice, when the UK would still have to implement any ECtHR rulings and abide by ECHR laws. The UK government would have to seek parliament's approval before notifying the ECtHR, and would have to repeal the Human Rights Act 1998 - which would also require parliamentary approval. Would the UK leaving breach any other agreements? Leaving the ECHR would breach the 1998 Good Friday Agreement, a deal between the British and Irish governments on how Northern Ireland should be governed, which could threaten the peace settlement. It would also put the UK's relationship with the EU under pressure as the Brexit deal commits both to the ECHR. The EU has said if the UK leaves the ECHR it would terminate part of the agreement, halting the extradition of criminal suspects from the EU to face trial in the UK. How would the UK's human rights protections change? Certain rights under the ECHR are also recognised in British common law, but the ECHR has a more extensive protection of human rights. For example, it was the ECHR that offered redress to victims of the Hillsborough disaster and the victims of \"black cab rapist\" John Worboys after state investigations failed. Before cases were taken to the ECtHR and the Human Rights Act came into force, the common law did not prevent teachers from hitting children or protect gay people from being banned from serving in the armed forces. Repealing the ECHR would also mean people in the UK would no longer be able to take their case to the ECtHR if the UK courts do not remedy a violation of their rights. The UK's human rights record would then not be subject to the same scrutiny as it is under the ECHR, where states review each other's actions. How human rights in the UK would be impacted depends partly on what would replace the Human Rights Act. Mr Farage has said he would introduce a British Bill of Rights, which would apply only to UK citizens and lawful British citizens. He has said it would not mention \"human rights\" but would include \"the freedom to do everything, unless there's a law that says you can't\" - which is how common law works. Legal commentator Joshua Rozenberg said this would simply confirm the rights to which people are already entitled, but would also remove rights enjoyed by people visiting the UK."
    },
    {
        "title": "Women and children will be detained under Farage deportation plans ",
        "description": "Women and children would be detained and deported under Nigel Farage's plans to stop small boat crossings in the Channel.",
        "url": "https://news.sky.com/story/women-and-children-will-be-detained-under-farage-deportation-plans-13418609",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nigel-farage-reform_7001641.jpg?20250826112901",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-08-26 09:26:00",
        "Headline": "The Reform UK leaders tells a news conference that small boat crossings in the Channel have created a \"genuine threat to public order\".",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Women and children would be detained and deported under Nigel Farage's plans to stop small boat crossings in the Channel. Addressing a news conference in Oxford, Mr Farage admitted that the question of \"how we deal with children is much more complicated\", but insisted: \"Women and children, everybody on arrival will be detained.\" Politics latest: Farage asks: Whose side are you on? The Reform UK leader laid out his plans to deport hundreds of thousands of illegal migrants if he wins the next election in 2029 - saying the small boats crisis in the English Channel was fuelling \"rising anger\" among the public and creating a \"genuine threat to public order\". 'The boats will stop coming within days' \"The only way we will stop the boats is by detaining and deporting absolutely anyone that comes via that route,\" Mr Farage said. \"And if we do that, the boats will stop coming within days, because there will be no incentive to pay a trafficker to get into this country. \n                  Is it time for a different approach to stop the people smugglers?\n                 \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \"If you come to the UK illegally, you will be detained and deported and never, ever allowed to stay, period. That is our big message from today.\" The news conference followed a weekend in which hundreds of people made the dangerous crossing to Britain via the Channel. Labour says it is tackling the issue by signing its \"one in, one out\" pilot scheme with France, which came into force earlier this month. It allows the UK to send some people who have crossed the Channel back to France in exchange for asylum seekers with ties to Britain, but Reform and the Conservatives have said it will make little difference, given that more than 28,000 people had made the crossing to the UK in 2025 alone. Under Reform's \"operation restoring justice programme\" - which has been denounced by opposition parties as \"inflammatory\" and \"unworkable\" - anyone who arrives in the UK illegally via small boat would be detained and deported, and refused permission to stay. Mr Farage said he believed the party would be able to deport around 600,000 asylum seekers in the first parliament of a potential Reform UK government, at an estimated cost of £10bn over the five-year period.  Illegal migrants would be forced to return to their home countries, something the Reform leader said could be achieved by the UK by choosing not to follow certain human rights laws. The party is planning to repeal the 1998 Human Rights Act and leave the European Convention on Human Rights (ECHR), arguing that such laws have allowed foreign offenders to challenge their own deportation orders through the courts and remain in the UK. 👉 Listen to Sky News Daily on your podcast app 👈 It would also disapply the 1951 Refugee Convention and the UN Convention Against Torture, and the Council of Europe's anti-trafficking convention. Instead, under its own Illegal Migration (Mass Deportation) Bill, those who come to the UK on small boats will be barred from claiming asylum, and held in detention centres on spare RAF bases rather than taxpayer-funded hotels, which have been subject to a number of protests from local communities in recent months. 'The alternative is to do nothing' Reform is also seeking to sign return deals with countries, including Afghanistan, despite its poor human rights record and the threat that those sent back would be subject to torture and ill treatment. Mr Farage faced a number of questions about the human rights abuses perpetuated by Afghanistan and Eritrea, another country he is seeking to send illegal migrants to if they arrive in Britain. Asked whether he was \"comfortable\" with the prospect of people being tortured if they were sent back after entering the UK illegally, Mr Farage said: \"What really bothers me is what is happening on the streets of our country. What really bothers me is what is happening to British citizens.\" Read more:Far right 'emboldened' says MPMore than 80% of shoplifting offences result in no charge He added: \"The alternative, of course, is to do nothing. That's the very clear alternative, is that we just do nothing. We just allow this problem to magnify and grow.\" Responding to Mr Farage's plans, the prime minister's official spokesperson said the Labour government would \"ramp up returns\" and that \"ripping up international agreements will only make it harder\". They said the prime minister disagreed with Mr Farage's assessment that the country was at risk of civil disorder. \"What the prime minister is focused on is dealing with the concerns that people have,\" they said. \"People have understandably have felt like their living standards have stagnated over the last 15 years, and that's why growing the economy and raising living standards is the government's number one priority.\" The Liberal Democrats criticised the plans for mass deportations, saying they risked \"ripping up\" human rights and potentially paying autocratic regimes to take people back. Green Party MP Ellie Chowns accused Mr Farage of \"inflammatory rhetoric\" and accused him of \"whipping up anger, hatred and even disorder\"."
    },
    {
        "title": "Farage's small boats plan not about policy but putting Labour and Tories on the spot",
        "description": "If you want a dissection of whether the &#163;10bn cost of Reform UK's new deportation policy is an underestimate, the analysis that follows is going to disappoint.",
        "url": "https://news.sky.com/story/farages-small-boats-plan-not-about-policy-but-putting-labour-and-tories-on-the-spot-13418831",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nigel-farage-reform_7001650.jpg?20250826104543",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-08-26 16:28:00",
        "Headline": "Nigel Farage's speech was not so much about presenting real policy proposals but about putting Labour and the Tories on the backfoot, Sam Coates writes.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n If you want a dissection of whether the £10bn cost of Reform UK's new deportation policy is an underestimate, the analysis that follows is going to disappoint. Likewise, if you are here to hear chapter and verse about the unacknowledged difficulties in striking international migrant returns agreements - which are at the heart of Nigel Farage's latest plan - or a piece that dwells on how he seemed to hand over questions of substance and detail to a colleague, again, prepare to be let down. Like a magician's prestige, if you laser focus on the policy specifics of Tuesday's Farage small boat plan - outlined in a vast hangar outside Oxford, striking for its scale and echo - you risk misunderstanding the real trick, and Reform's objective for the day. Politics latest: Farage told to apologise for small boats crisis  For Farage has been around long enough in British politics that we should acknowledge upfront how he pulls the wool over his opponents' eyes, and hence why he seems to wrongfoot them so regularly. The intent was not to present proposals that will turn into policy reality in 2029. \n                  Four things we learned from Sir Mel Stride's Electoral Dysfunction interview\n                 \n                  Conservatives v Reform: Battle for the right\n                 \n                  Kemi Badenoch suggests asylum seekers should be housed in 'Nightingale' camps \n                  Nor was it about converting voters in any great number to Reform - if you warmed to Farage before, you might like him a bit more after this, in your view, straight-talking press conference. If you detested him, you will likely feel that more strongly and draw comparisons with Enoch Powell. I suspect he will be unbothered by either. Instead, his announcement was about two things: seizing the agenda (ensuring more coverage of an issue redolent of the failure of the two biggest parties in British politics); and then putting both those other parties on the spot. Success or failure for Farage, in other words, will come in how the Labour and Tory parties respectively respond in the coming days. Look what he's done to the Tories. The real policy meat of his speech comes in the Farage promise to rip up the post-Second World War settlement for refugees, drawn up with fresh memories of persecuted hordes fleeing the Nazis. Along with an exit from the European Convention on Human Rights, the Reform UK leader would pause Britain's membership of the 1951 Refugee Convention, the UN Convention Against Torture, and the Council of Europe Anti-Trafficking Convention. Read more: Is it time for a different approach to stop people smugglers? The pause of British membership of these treaties and conventions may even turn out to be temporary, he said. \"We do think there is hope that the 1951 Refugee Convention of the UN can be revisited and redefined for the modern world,\" he said. But action, he argues, is needed now because the 1951 UN Refugee Convention obliges signatories to settle anyone with a \"well-founded fear\" of persecution. That, critics say, has become the \"founding charter\" of today's people-smuggling industry and allows traffickers the right to offer a legal guarantee that if their clients make it to shore they're covered - and boast this works in 98% of cases for the Sudanese and Syrians, and 87% for Eritreans - the recently updated approval rates. A big moment for a major party.  Yet this is almost - but not quite - the Conservative position. On 6 June this year, Kemi Badenoch gave a speech saying she was minded to pull out of the European Convention of Human Rights, and had commissioned a review led by Lord Woolfson to examine whether and how ECHR withdrawal, and pulling out of the Refugee Convention and the European Convention Against Trafficking, might help. So she added: \"I won't commit my party to leaving the ECHR or other treaties without a clear plan to do so and without a full understanding of all the consequences. \"We saw that holding a referendum without a plan to get Brexit done, led to years of wrangling and endless arguments until we got it sorted in 2019. We cannot go through that again. \"I want us to fully understand and debate what the unintended consequences of that decision might be and understand what issues will still remain unresolved even if we leave. \"It is very important for our country that we get this right. We must look before we leap.\"  👉 Listen to Sky News Daily on your podcast app 👈  In other words, what Reform UK did was steal a march on a likely Tory decision at conference. Farage has eaten Badenoch's homework. And she has been left accusing him of being a copycat of a policy she hadn't quite adopted. Then there is Labour. They accept the ends of Farage's argument, but not, it seems, the means. Home Secretary Yvette Cooper is reviewing parts of the European Convention on Human Rights - Article 3 (which prohibits torture, inhuman, or degrading treatment or punishment) and Article 8 (which protects the right to a family life). But that hasn't emerged yet, and will not, at its maximalist outcome, recommend the UK withdrawal from the convention. And will Labour strategists really want the spectre of ministers having to repeatedly argue in favour of ECHR membership in interviews, given that is likely to be the position of two of their biggest opponents? Another conundrum for Labour, which has Farage as the author.  Then there is the question of language for both Labour and the Tories. Dare they go as far as Reform UK and adopt a tone more aggressive than anything seen in recent years - one which talks of \"invasions\" and \"fighting age males\" and sending people back to \"where they came from\"? Will both political parties hold that line that this language, in their view, goes too far? Tuesday's speech was less about voters, more about Westminster politics as we enter political season. All done at an hour-long press conference that gave Farage a platform. Can the other party leaders now look like they're ignoring him and wrestle back the microphone? Or can they not help themselves and respond in kind?"
    },
    {
        "title": "Nigel Farage's deportation plan relies on these conditions - legal expert explains if it could work",
        "description": "Explaining how they plan to tackle what they described as illegal migration, Nigel Farage and his Reform UK colleague Zia Yusuf were happy to disclose some of the finer details - how much money migrants would be offered to leave and what punishments they would receive if they returned.",
        "url": "https://news.sky.com/story/nigel-farages-deportation-plan-relies-on-these-conditions-legal-expert-explains-if-it-could-work-13418742",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nigel-farage-zia-yusuf_7001793.jpg?20250826153054",
        "type": "Politics",
        "Author": "Joshua Rozenberg, legal commentator",
        "Date Published": "2025-08-26 13:20:00",
        "Headline": "How would Reform win a Commons majority, at least another 320 seats, in four years' time - or sooner if, as Mr Farage implied, Labour was forced to call an early election? How would his party win an election at all if, as its leader suggested, other parties began to adopt his policies?",
        "Content": "By Joshua Rozenberg, legal commentator  Explaining how they plan to tackle what they described as illegal migration, Nigel Farage and his Reform UK colleague Zia Yusuf were happy to disclose some of the finer details - how much money migrants would be offered to leave and what punishments they would receive if they returned. But the bigger picture was less clear. How would Reform win a Commons majority, at least another 320 seats, in four years' time - or sooner if, as Mr Farage implied, Labour was forced to call an early election? How would his party win an election at all if, as its leader suggested, other parties began to adopt his policies? Politics latest: Starmer 'angry' about Farage's language on migrant hotels Highly detailed legislation would be needed - what Mr Farage calls his Illegal Migration (Mass Deportation) Bill. But Reform would not have a majority in the House of Lords and, given the responsibilities of the upper house to scrutinise legislation in detail, it could take a year or more from the date of an election for his bill to become law. Reform's four-page policy document says the legislation would have to disapply: • The United Nations refugee convention of 1951, extended in 1967, which says people who have a well-founded fear of persecution must not be sent back to a country where they face serious threats to their life or freedom • The United Nations convention against torture, whose signatories agree not expel, return or extradite anyone to a country where there are substantial grounds to believe the returned person would be in danger of being tortured • The Council of Europe anti-trafficking convention, which requires states to provide assistance for victims  According to the policy document, derogation from these treaties is \"justified under the Vienna Convention doctrine of state necessity\". That's odd, because there's no mention of necessity in the Vienna Convention on the law of treaties - and because member states can already \"denounce\" (leave) the three treaties by giving notice. 👉 Listen to Sky News Daily on your podcast app 👈 It would take up to a year - but so would the legislation. Only six months' notice would be needed to leave the European Convention on Human Rights, another of Reform's objectives. Read more:Women and children will be detained under Farage plansFar right 'emboldened' says MP as Starmer faces mounting pressure over immigration Mr Farage acknowledged that other European states were having to cope with an influx of migrants. Why weren't those countries trying to give up their international obligations? His answer was to blame UK judges for applying the law. Once his legislation had been passed, Mr Farage promised, there would be nothing the courts could do to stop people being deported to countries that would take them. His British Bill of Rights would make that clear. Courts will certainly give effect to the will of parliament as expressed in legislation. But the meaning of that legislation is for the judiciary to decide. Did parliament really intend to send migrants back to countries where they are likely to face torture or death, the judges may be asking themselves in the years to come. They will answer questions such as that by examining the common law that Mr Farage so much admires - the wisdom expressed in past decisions that have not been superseded by legislation. He cannot be confident that the courts will see the problem in quite the same way that he does."
    },
    {
        "title": "Where are the UK's asylum seekers from?",
        "description": "Based on the 1951 Convention on Refugees, anyone who has a well-founded fear of persecution can claim asylum in the UK, be that based on their race, religion, nationality, sexuality or other reason. They must be in the UK to do so.",
        "url": "https://news.sky.com/story/asylum-seekers-in-charts-and-numbers-who-are-the-people-that-politicians-are-talking-about-deporting-from-uk-13418861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-asylum-seekers-deportations_7001978.png?20250826191426",
        "type": "Politics",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-08-26 17:31:00",
        "Headline": "With rising numbers of people claiming asylum, the government and some opposition parties say that more people should be 'returned'. But who are the people they are talking about deporting?",
        "Content": "\n          Data journalist\n              @joelysantacruz\n Based on the 1951 Convention on Refugees, anyone who has a well-founded fear of persecution can claim asylum in the UK, be that based on their race, religion, nationality, sexuality or other reason. They must be in the UK to do so. A record 111,084 people claimed asylum in the UK in the latest year to June 2025, the highest number in figures collected since 2002. Around two in five - 41,870 - of those were made by people who arrived in small boats. The increase in claims has mostly been driven by people seeking asylum from countries in South Asia, the Middle East, and sub-Saharan Africa. The number of claims was relatively low between 2006 and 2021, before increasing rapidly in recent years. Over the whole period from 2002 to 2025, the top five nationalities of those claiming asylum were Iran, Afghanistan, Pakistan, Iraq and Eritrea. Asylum claims from Middle Eastern countries were highest between 2022 and 2023, while asylum claims from Eritreans and Pakistanis have continued to increase in recent years. The most common nationalities of those seeking asylum are often those from countries experiencing war and violent persecution, seen, for example, in the surge in refugees coming from Afghanistan following the Taliban's takeover in 2021. Increasing numbers of asylum seekers have arrived in the UK by irregular routes, mostly on small boats across the English Channel - with Afghans and Eritreans making up the largest proportion of small boat arrivals in the last year. In the latest year to June 2025, the greatest number of asylum claims were from people from Pakistan, at 11,234, followed by Afghanistan at 8,281, Iran at 7,746, and Eritrea at 7,433. The majority of asylum claims come from younger men aged under 50, who represented 59% of asylum seekers in the latest figures, followed by children, at 22%. There were 19,471 children among people claiming asylum, more than double from 7,672 a decade earlier, while the number of men under 30 quadrupled to 41,553 over the same period. Prime Minister Sir Keir Starmer says he wants to 'smash the gangs' and disrupt the networks of organised criminals who make small boat journeys possible. But as with the Conservative government that came before him, he has not been successful. The number of small boat crossings so far this year, at just under 29,000, is higher than by the same point in any previous year. But while half of asylum seekers arrived irregularly by small boat or without documentation, the rest arrive by more conventional routes. At 41,100, an almost identical number of people claimed asylum who initially arrived on a work, study, or other valid visa as the 41,870 who arrived 'irregularly'. Another government promise on immigration is increasing the number of deportations and removals of people who have no legal status in the UK, which they also say will act as a deterrent to others. This includes the 'one-in-one-out' scheme recently agreed with France, under which, on a trial basis, a small number of people who arrive in small boats are returned to France in exchange for asylum seekers on safe and legal routes. The government say that 100 people have been detained in preparation to be sent to France. Who gets asylum in the UK? In the year to June 2025, 51,997 people were given a grant of protection or other leave, 39% of 134,037 initial asylum decisions made. This is compared to the higher figure of 57,905 who were refused asylum, 43% of the total. The rest either withdrew their claim or it was closed for other administrative reasons. Nigel Farage's Reform UK say that if it is elected, it plans to deport everyone who has arrived irregularly in the UK, such as by crossing the channel in a small boat or concealed in a lorry. However, asylum claims from those who arrived in small boats are more likely to be approved compared with those made by people who overstayed their visa. At 53%, more than half of the asylum claims by people who arrived in small boats were granted in the latest year, of those where an initial decision has been made, greater than the 39% grant rate overall for all asylum applications. This is based on initial decisions - though some of those whose asylum has been rejected may go on to appeal the decision. The government has not recently published figures on asylum appeals, but based on historic figures, around half of appeals are successful. The country with the most refused asylum claims in the latest year was Pakistan, at 6,313, closely followed by Afghanistan, at 6,066, Bangladesh at 4,614 and Iran at 4,223. Rejected asylum seekers are currently unlikely to be deported, based on current returns figures. Doing so would require an agreement with the countries involved, says Dr Peter Walsh, a senior researcher at the Migration Observatory, a research institute at the University of Oxford. \"This is a challenge that's been getting more difficult in recent years, and it's largely due to [rejected asylum seekers] countries of origin. If you have an Afghan asylum claimant who's been refused, we don't currently have relationships with the Taliban or any kind of returns agreements,\" he said. Germany recently returned a small number of Iranian nationals to Iran, deporting 14 people there in 2024 and a further 11 in the first half of 2025. \"It's not impossible, but certainly there would be a lot of diplomatic work that would have to be carried out to secure that kind of returns deal. Iran is currently under sanction. You can imagine the diplomatic challenges in trying to secure a returns agreement with the Iranian regime.\" \"And, you have to imagine that actually quite a decent share of individuals who have left those countries would be at risk of persecution,\" he added. Who is deported from the UK? The government has been successful in its aim to increase the number of returns and deportations from the UK. In the latest year to June 2025, there were 35,833 people returned. Most of those people were either voluntarily or forcibly returned to their home country. This is greater than the 30,939 returned in the year before, and the highest it's been since 2016, though below a peak of over 47,000 returns in the year to June 2012. Around one in six of the people returned were foreign national offenders. However, with limited detail in the figures, it is not possible to say exactly what proportion of the rest of the people returned were failed asylum seekers or not. Three-quarters of those returned left voluntarily, while the remaining 9,072 were forcibly removed. Almost all of them were sent from detention centres, which may include foreign national offenders, or people who never made an asylum claim and were detained by immigration enforcement. More than two-thirds of the 35,833 returns in the latest year were to seven countries: India, Brazil, Albania, Romania, China, Nigeria, and Pakistan. \"Labour is deciding more asylum cases, and success rates are in line with EU neighbours,\" Professor Nando Sigona of the University of Birmingham told Sky News. \"It is difficult to remove people to countries with political unrest and human rights crises. Removals are increasing, but mostly towards countries with which we have better diplomatic relations. Most of those removed are not the irregular crossers but visa overstayers.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Home Secretary agrees special biometric check arrangements for Gaza students",
        "description": "The home secretary has approved special arrangements for students in Gaza who have been offered fully-funded scholarships at UK universities.",
        "url": "https://news.sky.com/story/home-secretary-agrees-special-biometric-check-arrangements-for-gaza-students-13418559",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israeli-strike_7001551.jpg?20250826085259",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-26 07:30:00",
        "Headline": "Even with Yvette Cooper's approval, Israel will still need to agree that each individual student can leave Gaza.",
        "Content": "The home secretary has approved special arrangements for students in Gaza who have been offered fully-funded scholarships at UK universities. Politics latest: Nigel Farage to unveil deportation plans Yvette Cooper will allow a cohort of students to have their biometric checks carried out in a third country before they travel to the UK to take up their university places in September. It comes after Sky News reported that more than 70 Labour MPs had signed a letter asking the government to delay biometric checks for the students. In order to obtain a UK visa, applicants must provide a photo of their face, as well as their fingerprints. The Home Office guidance says these data points \"play a significant role in delivering security and facilitation in the border and immigration system\". Earlier this month, Labour MPs Abtisam Mohamed and Barry Gardiner asked Ms Cooper to defer the requirement so the students can take up their university places in September. A number of Chevening scholar students in Gaza have already been informed that they will be supported to travel to a third country to give their biometrics before coming to the UK to start their studies in the coming weeks. \n                  Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?\n                 \n                  Gaza hospital rejects Israel's claim troops 'saw Hamas camera' before deadly attack\n                 \n                  Israel may say it is not targeting journalists - but it is certainly killing a lot of them\n                 The UK did have an authorised centre in Gaza that was able to process biometric data, but it was closed in October 2023 after the Hamas attack, and as Israel's war in response to the atrocity got under way, according to The Guardian. Read more:Five journalists among 20 killed in Israeli strikes on hospitalIsrael may not be targeting journalists - but it is certainly killing a lot of them As a result, the letter by the Labour MPs called on the government to \"defer biometric data screening for student visa applicants based in Gaza and open a safe passage to enable these young people to fulfil their academic dreams\", pointing out that other countries in Europe \"have taken proactive steps to ensure safe evacuation routes for students bound for their countries\". However, even with these assurances from the UK, the Israeli government still needs to agree that each individual student can leave Gaza. A Home Office source said: \"This remains a complex and challenging task, but the home secretary has made it crystal clear to her officials that she wants no stone unturned in efforts to ensure there are arrangements in place to allow this cohort of talented students to take up their places at UK universities as soon as possible.\" Liberal Democrat MP Christine Jardine posted on X: \"I could've cried this morning at the news that the Foreign Office is allowing 50 students from Gaza to come to UK. Our universities - including Edinburgh - offers them the opportunity to change their lives and help rebuild their communities.\""
    },
    {
        "title": "England warned it faces six million new cancer cases by 2040 - with these areas worst hit",
        "description": "More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities.",
        "url": "https://news.sky.com/story/england-warned-it-faces-six-million-new-cancer-cases-by-2040-with-these-areas-worst-hit-13418850",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cancer-doctor_7001975.jpg?20250826190700",
        "type": "Technology",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-08-26 17:16:00",
        "Headline": "A coalition of more than 60 cancer charities is warning the government must take urgent steps to tackle cancer care in England.",
        "Content": "By Laura Bundock, health correspondent  More than six million new cancer cases could be diagnosed in England between now and 2040, according to leading charities. This would equate to a diagnosis every two minutes, which is up from one every four minutes in the 1970s. A coalition of more than 60 cancer charities, known as One Cancer Voice, is warning the government must take urgent steps to tackle cancer care in England - including faster diagnosis targets and better prevention policies. The analysis carried out by the charities is based largely on pre-pandemic data and suggests cases will increase by 14.2% over the next 15 years, with diagnoses of some of the most common cancers reaching all-time highs. This includes over a million new prostate cancer diagnoses, and more than 900,000 for breast cancer by 2040. The research also finds regional variations: • South East - over a million diagnoses • North East - 865,000 • East of England and the South West - 722,000 • London - 714,000  Six key demands These figures starkly set out the need for change, and the timing of their release is significant. Later this autumn, the government is expected to publish its long-awaited National Cancer Plan. These leading charities have combined forces to put pressure on ministers ahead of its publication, demanding six measures which they say must be implemented if cancer outcomes are to improve: • A pledge to meet all cancer waiting times by the end of parliament in 2029 • A new earlier diagnosis target, with improved screening programmes • The introduction of strong cancer prevention policies • Addressing inequalities in patient care • Improving access to clinical trials for cancer patients • Better support for people to live well with and beyond cancer 'A defining moment' The pandemic had a huge impact on cancer care in the country, and an ageing population adds further pressures. But the most recently available data, which is around a decade old, suggests the NHS is still lagging behind many comparable countries. The chief executive of Cancer Research UK, Michelle Mitchell, described the national plan as a \"defining moment\". \"If the UK government delivers an ambitious fully funded strategy, we could save more lives and transform cancer outcomes, propelling England from world lagging to among world leading when it comes to tackling this disease,\" she said. Read more:Are we are entering 'golden age' of cancer treatment? A Department of Health and Social Care spokesperson said: \"This government is prioritising cancer care as we turn around more than a decade of neglect of our NHS. \"We're already making an impact, with 95,000 more people having cancer diagnosed or ruled out within 28 days between July 2024 and May 2025, compared to the same period the previous year. \"This will soon be supported by our new National Cancer Plan, setting out how cancer care will improve over the coming years. \"We're also making it easier for people to get tests, checks, and scans with DIY screening kits for cervical cancer, new radiotherapy machines in every region, and by creating the first smoke-free generation.\""
    },
    {
        "title": "Scientists hail 'sci-fi' treatment for babies with rare condition",
        "description": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition.",
        "url": "https://news.sky.com/story/scientists-hail-sci-fi-treatment-for-babies-with-rare-condition-13418660",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-amelia-turner_7001738.jpg?20250826132339",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-26 23:01:00",
        "Headline": "Researchers have developed a system to deliver treatment for severe congenital diaphragmatic hernia (CDH) straight to a baby while in their mother's womb.",
        "Content": "The mother of a baby whose stomach and bowel \"moved into her chest\" has hailed new research aimed at treating her daughter's rare condition. Amelia Turner was given life-saving surgery at Great Ormond Street Hospital (GOSH) when she was a few days old. She suffered from severe congenital diaphragmatic hernia (CDH) - a potentially fatal condition affecting one in every 3,000 babies. The condition means the diaphragm - the muscle between the abdomen and the chest - has not fully developed. As a result, organs that are supposed to sit within the abdomen could move into the chest space and crush fragile growing lungs. It means babies don't have enough space to grow fully formed lungs. Current treatment for severe CDH involves surgery while the baby is in the womb, with surgeons delicately placing a surgical balloon into the baby's windpipe to stimulate the lungs to grow. This only increases survival odds to 50%. 'A complete whirlwind' Amelia's mother, Georgia Turner, 26, from London, said finding out she had the condition made her pregnancy \"a complete whirlwind\". \"The team hoped Amelia's condition would only be moderate,\" she said. \"Unfortunately, after Amelia was born, the clinical team told me how serious her condition was as her bowel and stomach had moved into her chest.\" Amelia spent four months recovering on the neonatal unit at GOSH, then another three months at her local hospital, before she could go home for the first time. The \"cheeky\" 17-month-old needed a second surgery after her CDH reoccurred when she was 15 months old. It's hoped new research will not only make treatment less invasive and significantly increase survival rates but also lower the chances of relapses. Read more from Sky News:TikTok puts hundreds of UK jobs at risk'Headphone dodgers' targeted by new TfL campaign Science-fiction made real A system developed by experts at GOSH and University College London in the UK, and KU Leuven in Belgium, would see treatment delivered straight to a baby while still in their mother's womb. It would see nanodiamonds used to transfer a hormone, known as vascular endothelial growth factor (VEGF), which stimulates lung growth. It was tested on lab-grown mini-lungs, using 3D printing to simulate compression, as well as rats with the condition. One of the experts, Dr Stavros Loukogeorgakis, a GOSH surgeon, said: \"Nanodiamonds, 3D-printing and growth hormones in the womb all sounds a bit science-fiction. But this research is really showing us what is possible.\" He said the treatment could be available to families in as little as five years. Ms Turner said: \"New research like this is great to see how experts are trying to make the treatment for CDH more successful for all children, and less invasive. \"Hopefully better treatments will also prevent relapse cases like Amelia.\""
    },
    {
        "title": "Massive dust storm leaves thousands without power and blinds drivers in southwest US",
        "description": "A powerful dust storm, known as a haboob, has struck the southwestern state of Arizona, bringing dangerous driving conditions, knocking out power and closing airports.",
        "url": "https://news.sky.com/story/massive-dust-storm-leaves-thousands-without-power-and-blinds-drivers-in-southwest-us-13418561",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-arizona-dust-storm_7001560.jpg?20250826141543",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-26 09:40:00",
        "Headline": "Flights were grounded and power supplies disrupted by the dust storm, which swept across parts of Arizona on Monday.",
        "Content": "A powerful dust storm, known as a haboob, has struck the southwestern state of Arizona, bringing dangerous driving conditions, knocking out power and closing airports. The skies above Arizona's state capital, Phoenix, turned dark on Monday as the weather system rolled in. More than 15,000 people lost power, most in Maricopa County, which includes Phoenix, according to the tracking website PowerOutage.us Heavy rain and wind followed the haboob, delaying flights at Phoenix Sky Harbor International Airport and damaging a terminal roof. Arizona City, about 60 miles (95km) southeast of Phoenix also experienced the towering wall of dust. Bernae Boykin Hitesman was driving her son and daughter, nine and 11, home from school when she was forced to quickly pull her car over as the storm engulfed her vehicle. \"I couldn't see my hand in front of my face if I put my hand outside,\" she said. \n                  Three people killed and more than a dozen injured as Typhoon Kajiki hits Vietnam\n                 \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  More than 280 dead after flash floods hit India and Pakistan\n                 \"My kids were really, really scared, so I was trying to be brave for them. She added she could taste the dust and feel the strong wind rattling her car until it finally passed about 15 minutes later. by Joanna Robinson, Sky News weather producer A sandstorm or duststorm is often referred to as a haboob. The name originates from northern Sudan and comes from the Arabic word 'habb', which means \"to blow\". Now the term is used across the world to describe any wind-driven sandstorm or dust storm in arid or semi-arid regions, like Phoenix in the Sonoran Desert. Haboobs often occur as a result of a microburst within a thunderstorm, when a strong downdraught of air hits the ground and spreads out in all directions. \n In desert regions, the microburst outflow can carry sand and dust particles at great speeds, reaching heights of up to 5,000ft.\n Richard Filley, a retired university professor who lives in the Phoenix suburb of Gilbert, said the dust storm caused the trees to sway and knocked bird feeders to the ground. Fine dust found its way through \"every little crack and space\" into his house, he said. \"You look at the photos of haboobs and they are a spectacular natural phenomenon. They are kind of beautiful in their own way,\" he added. Read more from Sky News:Trump seeks to fire Fed governorMeghan's show gives personal insightsTrump wants to meet Kim Jong Un On Saturday, in the neighbouring state of Nevada, strong dust storms and 50mph winds ripped through Black Rock City, a temporary city erected in the Black Rock Desert as part of the Burning Man festival. The storm wreaked havoc on campsites and caused major travel delays in the area, with festival organisers confirming there were four minor injuries, according to Sky's US partner, NBC News. The National Weather Service had issued a dust storm advisory over the weekend, saying \"a wall of blowing dust\" was tracking northward. An estimated 70,000 people are expected to travel to Black Rock City for the festival, which runs through 1 September. Dust storms can prove extremely dangerous for motorists as they reduce visibility. At least eight people were killed in Kansas in March after a pile-up involving more than 70 vehicles caught in a dust storm."
    },
    {
        "title": "Taylor Swift announces engagement to boyfriend Travis Kelce",
        "description": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce.",
        "url": "https://news.sky.com/story/taylor-swift-announces-engagement-to-boyfriend-travis-kelce-13418848",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-taylor-swift-travis-kelce_7001935.jpg?20250826181351",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-26 17:11:00",
        "Headline": "Swift and Kelce started their relationship in 2023, after the NFL player said he tried and failed to meet the singer at an Eras Tour concert.",
        "Content": "Taylor Swift has announced she is getting married to her NFL star boyfriend, Travis Kelce. The pop star and Kansas City Chiefs tight end shared the news in a joint post on Instagram, with the caption: \"Your English teacher and your gym teacher are getting married.\" The announcement was liked more than 1.7 million times just over 30 minutes after it was posted. Swift and Kelce started their relationship in 2023, after the three-time Super Bowl winner said on his podcast New Heights that he tried and failed to meet the singer at her Eras Tour concert in Kansas City. Rumours grew that the couple were dating after Swift was spotted at a number of Chiefs games. On her seventh time in the stands, she brought her father, Scott Kingsley Swift, along. Kelce told the Wall Street Journal in November 2023: \"There were definitely people she knew that knew who I was, in her corner [who said]: 'Yo! Did you know he was coming [to the Eras Tour]?' \"I had somebody playing Cupid... She told me exactly what was going on and how I got lucky enough to get her to reach out.\" \n                  Boy, 16, convicted in Germany over supporting failed terror plot at Taylor Swift concert\n                 \n                  Taylor Swift reveals release date for new album\n                 \n                  Taylor Swift cements place as 'hardest-working star in pop' with announcement of 12th studio album\n                  Earlier this month, Swift appeared on Kelce's podcast, New Heights, and announced her 12th album, titled The Life Of A Showgirl. Speaking to Kelce and his brother Jason, Swift said it was inspired by the Eras Tour - and also talked about his attempt at meeting her two years ago. While she said his plan to give her his number on a friendship bracelet was a \"wild, romantic gesture,\" she joked he \"didn't do any proper logistical planning\" and thought he would be allowed backstage. \"Because he knows the elevator lady, he thought he could talk to her about just getting down to my dressing room,\" she added. \"That's how it works in 1973.\" Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record The new album, which will be released on 3 October, marks her first release since she took back control over her entire back catalogue from private equity firm Shamrock Capital. Sky News culture and entertainment reporter Gemma Peplow said after her globe-trotting tour and a swathe of re-releases over recent years, the new album cemented Swift's reputation \"as the hardest-working star in pop\". Despite rumours he would retire after losing this year's Super Bowl, Kelce will play for the Kansas City Chiefs again this season. He told GQ magazine his on-field performances \"slipped a little bit\" as he started acting, and added: \"I'm just saying that my work ethic is such that I have so much pride in how I do things that I never want the product to tail off, and I feel like these past two years haven't been to my standard.\""
    },
    {
        "title": "Strictly Come Dancing star arrested on suspicion of rape",
        "description": "A Strictly Come Dancing star has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/strictly-come-dancing-star-arrested-on-suspicion-of-rape-13418783",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-strictly-come-dancing_7001870.jpg?20250826170125",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-26 14:57:00",
        "Headline": "It is understood the arrest is not related to the upcoming production of Strictly Come Dancing - the 23rd series, which is in the rehearsal stage and is due to launch in September.",
        "Content": "A Strictly Come Dancing star has been arrested on suspicion of rape. The unnamed man, who is in his 30s, was also detained over a separate allegation of \"non-consensual intimate image abuse\". The Met Police said an arrest was made in east London on Friday in a joint investigation with Hertfordshire Constabulary, following a \"third-party allegation of sexual and drug-related offences\". It is understood the arrest is not related to the upcoming production of Strictly Come Dancing - the 23rd series, which is in the rehearsal stage and is due to launch in September.  \"On Friday 22 August, officers arrested a man in his 30s in east London on suspicion of rape and non-consensual intimate image abuse,\" a spokesperson for the Met said in a statement. The investigation is in its early stages and inquiries are ongoing, the spokesperson added. The man was released on bail on Saturday until a date in November, the force said. Hertfordshire Constabulary did not add anything further. A spokesperson for the BBC said: \"It would not be appropriate to comment on an ongoing police investigation.\" Earlier this month, it was reported the broadcaster had called in lawyers to investigate following claims two of its stars had used cocaine."
    },
    {
        "title": "Boy, 16, convicted in Germany over supporting failed terror plot at Taylor Swift concert",
        "description": "A 16-year-old has been convicted in Germany for supporting a foiled plot to attack Taylor Swift concerts in Austria last year.",
        "url": "https://news.sky.com/story/boy-16-convicted-in-germany-over-supporting-failed-terror-plot-at-taylor-swift-concert-13418789",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-taylor-swift-eras-tour_6771083.jpg?20241209000914",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-26 15:15:00",
        "Headline": "The teenager, who confessed to preparing a serious act of violence and supporting a terrorist act of violence abroad, was handed a suspended 18-month sentence.",
        "Content": "A 16-year-old has been convicted in Germany for supporting a foiled plot to attack Taylor Swift concerts in Austria last year. The teenager, named Mohammad A, who cannot be fully identified under Germany's privacy laws, was convicted of preparing a serious act of violence and supporting a terrorist act of violence abroad. He was handed a suspended 18-month sentence on Tuesday. According to the court, he made a \"comprehensive confession\" at his trial, which was held behind closed doors because of his age. German judges found that the defendant, a Syrian national then aged 14, supported the ideology of the Islamic State group at the time. The court heard he was also in contact via social media with a young man in Austria who planned to attack a Swift concert in Vienna, had sent him a video with bomb-building instructions, and organised contact with an IS member. All three of Swift's concerts at Vienna's Ernst Happel Stadium were cancelled in August last year after a terror plot was uncovered by authorities.  Concert organisers had expected up to 65,000 fans inside the stadium at each concert and as many as 30,000 onlookers outside. \n                  Two married couples found dead in British car after crash in Germany\n                 \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 \n                  Legal protection for Scapa Flow site where German fleet was scuttled during First World War\n                 Authorities said the main suspect, now 20, planned to target those outside of the stadium and hoped to \"kill as many people as possible\". Omar Haijawi-Pirchner, head of the directorate of state security and intelligence, added at the time that the suspect was \"clearly radicalised in the direction of the Islamic State and thinks it is right to kill infidels\". Read more from Sky News:'Headphone dodgers' targeted by new TfL campaignImpact of new online safety rules revealedTwo victims of Isle of Wight helicopter crash named Swift later called the decision to cancel her shows in Austria \"devastating,\" and said: \"The reason for the cancellations filled me with a new sense of fear, and a tremendous amount of guilt because so many people had planned on coming to those shows. \"But I was also so grateful to the authorities because thanks to them, we were grieving concerts and not lives.\""
    },
    {
        "title": "With Love, Meghan: What we learnt from second series of Duchess of Sussex's lifestyle show",
        "description": "The second season of the Duchess of Sussex's lifestyle show With Love, Meghan, has been released.",
        "url": "https://news.sky.com/story/meghan-reveals-who-said-i-love-you-first-with-harry-and-what-she-misses-about-the-uk-13418553",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-meghan-prince-harry_7001523.jpg?20250826084402",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-26 07:04:00",
        "Headline": "In the second series of the Duchess of Sussex's lifestyle show, she gives an insight into her life with Prince Harry and their two children, Archie and Lilibet.",
        "Content": "The second season of the Duchess of Sussex's lifestyle show With Love, Meghan, has been released. Over the eight-episode series, which features celebrity guests including US model and TV personality Chrissy Teigen and Queer Eye's Tan France, Meghan opens up about what she misses most about the UK, the meal she cooked on the night Prince Harry proposed, and who said \"I love you\" first. The premiere of the second series comes two weeks after Harry and Meghan announced a watered-down deal with the streaming giant Netflix. Despite Harry not making a cameo in the show, Meghan does give some insight into her life in California with the prince, and their two children, Archie and Lilibet. Here is what we learnt from the duchess. Harry saying 'I love you'  In one episode, with British fashion designer Tan France, Meghan says it was Harry who first said he loved her. \"He told me,\" she says before blushing and flicking her ponytail with her hand and saying: \"She's still got it.\" She adds that she fell in love with him while camping in Botswana, the pair's third date. \"We met in Botswana, and we camped for five days together,\" she says, adding: \"You really get to know someone when you are in a little tent.\" Missing one particular UK radio station  After first getting married, Meghan had planned to apply for British citizenship. But the pair later moved to the US after stepping down from their roles as working royals. In episode three, with Tan France, Meghan admits one of the things she \"misses the most\" about the UK, after leaving five years ago. She says: \"Honestly, one of the things I miss the most about the UK is the radio station called Magic.\" To which France quips: \"Magic FM. Wow! Now, sorry to say this to you publicly, but that's such a grandma station.\" A laughing Meghan replies: \"I'll be that grandma.\" Duchess 'not well' when away from her children Later in episode three, when the pair are crafting aprons for their children, Meghan says she \"always wanted to be a mum\", which is now \"better than she expected\" after the birth of Archie, in 2019, and Lilibet - who they call Lili for short - in 2021. Sympathising with France, who explained he gets heartbroken if away from his two young children for more than a couple of days, the duchess says the longest she and Harry have ever been without seeing their children is almost three weeks. \"I was... not well,\" Meghan says about the separation. In Harry's 2023 memoir, Spare, he wrote of the \"difficult days\" after Queen Elizabeth II's death and how he and Meghan were separated from Archie and Lili for \"longer than we'd ever been\". He said when they reunited at their home in Montecito, \"for days and days we couldn't stop hugging the children, couldn't let them out of our sight\". 'Terrible' chicken In the fourth episode with American chef and TV host Samin Nosrat, Meghan reveals she tried to make a roast chicken on the night Harry proposed in 2017, but it didn't turn out how she expected. \"I will say when I made a roast chicken for my now-husband I was still having a lot of challenges with the conversion of Celsius and Fahrenheit. I made a horrible chicken that night. I mean, truly terrible,\" she says. \"The point is you can make a terrible chicken and someone is still going to appreciate the thought.\" Read more from Sky News:Impact of new online safety rules revealed one month onMedvedev expecting 'big fine' after outburst at US Open Harry and Meghan's wedding menu When chatting with British chef Clare Smyth, who cooked the food at Harry and Meghan's Windsor wedding in 2018, the duchess says \"everyone still talks\" about the meal - which included roast chicken. \"Remember, we had the map where everything was sourced? We really wanted people to appreciate where every ingredient was coming from,\" she says. The three-Michelin-starred chef revealed that she also devised a special fried chicken recipe to serve as a \"late-night bite\" at the wedding, which she now serves as an \"off-menu\" item at her restaurant Core. \"Our off-menu item is the fried chicken at Core,\" Meghan says, adding: \"If that's my claim to fame. I'm thrilled.\" Archie and Lili use both British and American words In another part of the sixth episode, Smyth says she always has to think about the American names for certain foods, including eggplant (aubergine) and cilantro (coriander). The duchess then says: \"My kids will say a little bit of both, but never cooking terms, because I guess papa is not cooking as much. \"They both say zebra instead of zee-bra.\" Her time on Deal Or No Deal In the episode with Chrissy Teigen, Meghan reminisces about her time working on the US version of the game show Deal Or No Deal as a briefcase model. Teigen, who is married to singer John Legend, also appeared on the show and described it as a \"really important, funny\" chapter in their lives. \"I remember being a back-up girl,\" Teigen says, before Megan laughs, adding: \"I remember us all standing in line to get our lashes put on. \"I was just so happy to get health insurance... How far we have come.\" The duchess appeared on the show in 2006 and 2007, before landing the role she is most known for, Rachel Zane in the legal drama series, Suits. 'PH 40' hats and portable family photos In one of the later episodes in the series, Meghan packs a bag for a trip to Malibu, to see her friend and pilates instructor, Heather Dorak. Explaining what she is putting in her bag, the duchess shows a baseball cap with 'PH 40' on the front, which she says she made for Harry's 40th birthday last year. She goes on to say she \"always, always brings photos of my family\" when she goes away, holding up a small selection of three framed black and white photos. She says: \"I went on a girls' trip recently and my girlfriends were like 'Oh my God, that's so sweet, you keep it by your bed!' \"You could just look at your phone, but I am just sentimental in that way.\""
    }
]