[
    {
        "title": "Giving up territory would be 'unjust peace', says Ukraine's armed forces chief",
        "description": "It would be \"unacceptable\" for Ukraine to \"simply give up territory\" in any peace deal with Russia, the head of the Ukrainian armed forces has told Sky News.&#160;",
        "url": "https://news.sky.com/story/giving-up-territory-would-be-unacceptable-says-ukraines-armed-forces-chief-13479634",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-deborah-haynes-ukraine_7101680.jpg?20251205110744",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-05 10:10:00",
        "Headline": "In a rare interview, General Oleksandr Syrskyi warns Russia is using US-brokered peace talks as a \"cover\" to try to grab more land by force on the battlefield.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  It would be \"unacceptable\" for Ukraine to \"simply give up territory\" in any peace deal with Russia, the head of the Ukrainian armed forces has told Sky News.  General Oleksandr Syrskyi said a \"just peace\" can only be achieved if fighting is halted along current frontlines and then for negotiations to take place. Signalling a complete lack of trust in claims by the Kremlin that it wants to end its war, he accused Vladimir Putin of using an attempt by Donald Trump to broker peace talks as \"cover\" while Russian troops try to capture more land by force on the battlefield. Ukraine peace talks - latest  The rare intervention offers the clearest indication yet of the Ukrainian military's red lines as Washington tries to negotiate a settlement that - according to an initial draft - would require Kyiv to surrender the whole of the Donbas region in the east of the country to Moscow. President Volodymyr Zelenskyy, backed by the UK and other European allies, has been trying on the diplomatic front to strengthen Ukraine's position. But President Putin has said Russia would either seize the Donbas militarily or Ukrainian troops would have to withdraw. Europe's fate at stake Speaking frankly, General Syrskyi, commander-in-chief of the armed forces of Ukraine, signalled that his country's soldiers would fight on if diplomacy fails - and he warned that the fate of the whole of Europe is at stake. \"Our main mission is to defend our land, our country, and our population,\" he said in an exclusive interview in the basement of a building in eastern Ukraine. Sky News has been asked not to disclose the location for security reasons. \"Naturally, for us it is unacceptable to simply give up territory. What does it even mean - to hand over our land? This is precisely why we are fighting; so we do not give up our territory.\" Many troops have died fighting for Ukraine since Russia first seized the peninsula of Crimea and attacked the regions of Donetsk and Luhansk, which comprise the Donbas, in 2014. Hundreds of thousands of Ukrainian civilians were then mobilised to fight alongside professional soldiers following Putin's full-scale invasion in February 2022. Russia well short of original goal Nearly four years on, Russia occupies almost a fifth of Ukraine, including large parts of the Donbas, but well short of an original goal of imposing a pro-Kremlin government in Kyiv. Asked whether the sacrifice of those people who gave their lives defending their country would be in vain if Ukraine is forced to hand over the land it still controls in the Donbas to Moscow, General Syrskyi, speaking in Ukrainian through a translator, said: \"You know, I do not even allow myself to consider such a scenario. \"All wars eventually end, and of course we hope ours will end as well. And when it does, a just peace must be established. \"In my understanding, a just peace is peace without preconditions, without giving up territory. It means stopping along the current line of contact.\"  The commander then broke into English to say that this means: \"Stop. A ceasefire. And after that negotiations, without any conditions.\" Switching back into Ukrainian, he said: \"Any other format would be an unjust peace, and for us it is unacceptable.\" Ukraine's contingency plans While Ukraine's will and ability to fight are key in confronting Russia's much larger army, so too is the supply of weapons, ammunition and other assistance from Kyiv's allies, most significantly the US. But, with the White House under Donald Trump, becoming less predictable, the Ukrainian military appears to be considering contingency plans in case US aid stops. Asked whether Ukraine would be able to continue fighting if President Trump did halt support, General Syrskyi said: \"We are very grateful to our American partners and all our allies who have been supporting us throughout this war with weapons and equipment. \"We hope they will continue providing full support. But we also hope that our European partners and allies, if necessary, will be ready to provide everything required for our just war against the aggressor. \"Because right now we are defending not only ourselves, but all of Europe. And it is crucial for all Europeans that we continue doing so, because if we are not here, others will be forced to fight in Europe.\" General's assessment of fighting on ground A decorated commander, with the call sign \"snow leopard\", General Syrskyi has been conducting combat operations against Russia's invasion for more than a decade. He was made military chief in February 2024 after President Volodymyr Zelenskyy sacked the previous top commander. General Valerii Zaluzhnyi is now Kyiv's ambassador to London. General Syrskyi offered his assessment of the fight on the ground, saying: • Ukrainian troops still control the northern part of the fortress city of Pokrovsk in the Donbas and will keep battling to retake the rest of it, contrary to Russian claims to have captured what has been a key target for Moscow for the past 16 months. • Russia is firing between 4,000 to 5,000 one-way attack drones at Ukrainian positions along the frontline every day as well as 1,500 to 2,000 drones that drop bombs. But Ukraine is firing the same volume - and even more - back. \"In terms of drones, there is roughly parity. At the moment, we are deploying slightly more FPV [first person view] drones than the Russians.\" • Russia's armed forces still have double the volume of artillery rounds of Ukraine's, but the range and lethality of drone warfare mean it is harder to use artillery effectively. Now, 60% of strikes are carried out by drones. • More than 710,000 Russian soldiers are deployed along a frontline that stretches some 780 miles (1,255km), with the Russian side losing around 1,000 to 1,100 soldiers a day, killed or wounded \"and a majority are killed\". \"At this stage the Russian army is attempting to advance along virtually the entire frontline,\" General Syrskyi said. Where are the harshest battles? The fiercest battles are around Pokrovsk, as well as the northeastern city of Kupiansk, in Kharkiv region, the Lyman area, also in the Donbas, and near a small city called Huliaipole, in the Zaporizhzhia region of southeastern Ukraine. \"The Ukrainian army is conducting a strategic defensive operation, aiming to contain the enemy's advance, prevent them from breaking deeper, inflict maximum losses, and carry out counter-offensive actions in those sectors where we see the enemy is vulnerable,\" the commander said. \"Our strategy is to exhaust the Russian army as much as possible, prevent its advance, hold our territory, while simultaneously striking the enemy in the near rear, the operational depth, and… into Russia itself, with the aim of undermining its defence capability and industrial capacity.\"  He is referring to a capability Ukraine has developed to launch long-range drones, laden with explosives, deep into Russia to strike military targets as well as oil refineries. The operation is aimed at destroying fuel for the tanks, warships and jets that are attacking Ukraine and - crucially - reducing oil revenues that help to fund Russia's war machine. Sea drones crash into Russia's warships The Ukrainian military is also deploying explosive sea drones that are smashed into Russian warships as well as tankers used to transport sanctioned Russian oil. Asked if his forces were ready - and had sufficient manpower - to keep fighting if necessary, General Syrskyi said: \"We have the resources to continue conducting military operations.\" Yet Ukraine is suffering from a shortage of troops on the frontline. Soldiers and wider society are also exhausted and facing another winter of war. No sign of Moscow winding down war effort President Putin has an advantage when it comes to troop numbers and firepower over time, which makes continued support to Kyiv from its allies more vital than ever. General Syrskyi cautioned that Moscow showed no sign of winding down its war effort despite the Russian leader telling President Trump he is prepared to negotiate. Read more on Sky News:Hugs ahead of India-Russia talks New Russia sanctions 'pointless' \"So we do everything so that if the enemy continues the war, and you can see that although we want peace, a fair peace, the enemy continues its offensive, using these peace talks as cover,\" he said. \"There are no pauses, no delays in their operations. They keep pushing their troops forward to seize as much of our territory as possible under the cover of negotiations.\" He added: \"So we are just forced to wage this war… protecting our people, our cities and towns, and our land.\" The commander said this is what motivates his soldiers. \"If we do not do this, we can see clearly what the Russian army leaves behind, only ruins, only deaths.\" As for whether the UK and other European nations should be preparing their people for the possibility of a wider war with Russia, the general said: \"Of course, the armed forces of every country ensure reliable protection of their citizens, their children, and their territory. \"With the existence of aggressive states, above all the Russian Federation and its allies, this issue is extremely urgent. \"Everything must be done to ensure the capability to maintain a level of defence, and armed forces modern enough to repel aggression, both individually and in support of the allies.\""
    },
    {
        "title": "World Cup  2026 - who England, Scotland, Wales, Northern Ireland and the Republic of Ireland will play",
        "description": "Scotland and England now know who they will face in the group stage of the next summer's world cup. ",
        "url": "https://news.sky.com/story/world-cup-2026-who-england-scotland-wales-northern-ireland-and-the-republic-of-ireland-will-play-13479848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-football-world-cup_7086757.jpg?20251120132244",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 19:18:00",
        "Headline": "Friday's draw means countries who have qualified for the 48 team tournament in North America now know who they will play in their opening matches.",
        "Content": "Scotland and England now know who they will face in the group stage of the next summer's world cup.  But the fates of Northern Ireland, the Republic of Ireland and Wales won't be determined until they compete in pre-tournament play-off matches in March. England are in Group L along with Croatia, Panama and Ghana. Their first match will be against Croatia, who beat them in the semi-finals of the 2018 World Cup in Russia. Scotland's first match will be against Haiti, in Group C. Brazil and Morocco are the other Group C teams - both countries were also in the same opening group as Scotland in the 1998 World Cup in France. Wales have yet to find out if they will qualify as they must face a play-off against Bosnia and Herzegovina in Cardiff, and then either Italy or Northern Ireland, if they are victorious. Read more:EasyJet staff at Luton Airport to strike over Christmas \n                  Former doctor charged over alleged sexual assaults on 38 patients\n                 \n                  Duchess of Sussex 'reaches out' to estranged father after reports of leg amputation\n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 If they can overcome these play-off opponents then they will secure their place in Group B along with Canada, Qatar and Switzerland. But Northern Ireland will also be vying and hoping to guarantee their spot in the same group if they can beat Italy and then either Wales or Bosnia and Herzegovina.  The Republic of Ireland also need to get through the play-offs first and are paired against the Czech Republic for their semi-final. Should Ireland win that match, they will need to beat either North Macedonia or Denmark to get to the finals where an opening group containing joint hosts Mexico, South Africa and South Korea awaits."
    },
    {
        "title": "Russia denies being behind Salisbury poisonings and warns of danger of war with Europe    ",
        "description": "Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018.",
        "url": "https://news.sky.com/story/russia-denies-being-behind-salisbury-poisonings-and-warns-of-danger-of-war-with-europe-13479780",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/putin-dawn-sturgess-uk-news_7101206.jpg?20251204193523",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-12-05 15:21:00",
        "Headline": "Putin's ambassador to London accuses UK of 'Agatha Christie' staging the novichok  crimes, that killed Dawn Sturgess, and says Russia is ready for war 'right now'. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018. The report concluded Vladimir Putin \"must have\" authorised the use of a nerve agent in the attack and was therefore \"morally responsible\" for the British woman's death. Ambassador Andrei Kelin dismissed those claims and said he did not have a message for her family because Moscow was not involved. \"It's a tragic death, it is of course sad and Russia has nothing to do with it,\" he said. The poisonings of Sergei Skripal - a former Russian spy - and his daughter were, he insisted, staged by the British government and secret services. \"The script is very elaborated,\" he said. \"It has been done by very talented professionals. It reminds me of Ian Fleming or even Agatha Christie\" \n                  Giving up territory would be 'unjust peace', says Ukraine's armed forces chief\n                 \n                  Narendra Modi and Vladimir Putin embrace before talking trade at India-Russia summit\n                 \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 But the ambassador offered no evidence to support his claim. In contrast the British government and independent investigative journalists have produced abundant evidence to show the poisonings were the work of Russia military intelligence agents. The Organisation for the Prohibition of Chemical Weapons, of which Russia is a member, verified British claims novichok was used, a nerve agent invented and used only by Russia. A public inquiry found two agents from Russia's GRU spy agency, using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury from Moscow. The officers came to London on 2 March with a third agent, known as Sergey Fedotov, to kill Mr Skripal - a former Russian spy who worked as a double agent for the UK. In its report, the inquiry said Petrov and Boshirov had likely used this same bottle to apply the nerve agent to Mr Skripal's door before it was \"carelessly discarded\". Read more:Putin 'morally responsible' for Briton's deathSalisbury novichok poisonings: Seven questions to be answered Charlie Rowley, 52, found the bottle and gave it to Ms Sturgess, 44, who sprayed herself with its contents on 30 June 2018, and died just over a week later. Mr Skripal, 74, his daughter Yulia, 41, and Mr Rowley, 52, all survived, but were left seriously ill. Ambassador Kelin said the report had been timed to upset delicate peace talks over Ukraine. He said: \"By this I think the British government would like to derail talks that are very interesting and in a high stage.\" The ambassador said he was personally worried about the possibility of a wider conflict erupting from the war in Ukraine. Asked if there was a greater chance now of war between Europe and Russia than he had seen in his career, he answered there was. \"Yes, of course, listening to all these statements, about the need to prepare for the war, like our president has said, recently, two days ago that, we do not want to wage a war against Europe. \"But if Europe would like to wage a war against Russia, then we are prepared. Right now.\""
    },
    {
        "title": "Former doctor charged over alleged sexual assaults on 38 patients",
        "description": "A former doctor has been charged over alleged sexual assaults on 38 patients in his care.",
        "url": "https://news.sky.com/story/former-doctor-charged-over-alleged-sexual-assaults-on-38-patients-13479747",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-royal-stoke-university-hospital_7101938.jpg?20251205144610",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:19:00",
        "Headline": "Nathaniel Spencer, 38, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration, nine counts of sexual assault of a child under 13, three counts of assault of a child under 13 by penetration and one count of attempting to assault by penetration.",
        "Content": "A former doctor has been charged over alleged sexual assaults on 38 patients in his care. Nathaniel Spencer, 38, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration, nine counts of sexual assault of a child under 13, three counts of assault of a child under 13 by penetration and one count of attempted assault by penetration. It follows a police investigation into alleged sexual offences between 2017 and 2021. Staffordshire Police said in a statement the charges come after a complex investigation by the Public Protection Unit into sexual offences at the Royal Stoke University Hospital, in Stoke-on-Trent, and Russells Hall Hospital, in Dudley. Ben Samples, deputy chief crown prosecutor for the West Midlands CPS Complex Casework Unit and Serious Violence, Organised Crime and Exploitation Unit, said: \"We have decided to prosecute Nathaniel Spencer for a number of serious sexual offences allegedly carried out against patients while he was working as a doctor - including assault by penetration and sexual assault against a child. \"Our prosecutors have worked at length to support a detailed and complex investigation by Staffordshire Police, carefully reviewing the available evidence to establish that there is sufficient evidence to bring the case to trial and that it is in the public interest to pursue criminal proceedings.\" Spencer, from Birmingham, will appear at North Staffordshire Justice Centre on 20 January 2026."
    },
    {
        "title": "Duchess of Sussex 'reaches out' to estranged father after reports of leg amputation",
        "description": "Meghan Markle has \"reached out\" to her estranged father after reports he had his leg amputated, her spokesperson has said.",
        "url": "https://news.sky.com/story/duchess-of-sussex-reaches-out-to-estranged-father-after-reports-of-leg-amputation-13479764",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-harry-meghan_7047633.jpg?20251010111334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:49:00",
        "Headline": "Thomas Markle, a retired television lighting director and director of photography, made headlines across the globe after he was caught staging paparazzi photographs in the days ahead of his daughter's wedding.",
        "Content": "Meghan Markle has \"reached out\" to her estranged father after reports he had his leg amputated, her spokesperson has said. Thomas Markle, 81, reportedly had his leg amputated following surgery in the Philippines, where he moved to this year. Meghan has been estranged from her father since around the time of her wedding to Prince Harry in May 2018. Mr Markle, a retired television lighting director and director of photography, made headlines across the globe after he was caught staging paparazzi photographs in the days ahead of the ceremony. A spokesperson for the Duchess of Sussex said: \"I can confirm she has reached out to her father.\" Meghan is said to have previously tried to reach out to him in the past. Mr Markle has never met his grandchildren Prince Archie and Princess Lilibet. \n                  Former doctor charged over alleged sexual assaults on 38 patients\n                 \n                  World Cup  2026 - who England, Scotland, Wales, Northern Ireland and the Republic of Ireland will play\n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 At the start of this year, Mr Markle told of how he dreamed of bringing his \"whole family together\" and wished his daughter \"no ill-will\". Mr Markle revealed that he didn't \"like some of the things\" Meghan had done but would \"always love her\". Read more:Prince Harry apologises to Canada for wearing cap at World SeriesPrince Harry and Meghan named Humanitarians of the Year His interview with the Mail on Sunday came amid the duchess' return to Instagram and the release of a trailer for her lifestyle show on Netflix. Mr Markle said: \"I'm not running away. I am going in search of a more positive life. \"Every day I see something about Meghan. This week it has been the new TV show.\" In his first interview after his daughter's wedding, Mr Markle said he didn't attend the big day because he was embarrassed about staging the photos. \"The truth is I couldn't get over the fact that that had happened. All that stuff was working on me, I had a bit of a heart condition. \"This pushed me a little further to the part where I had heart palpitations. I had to drive at 2am to a hospital. They sent me to another little hospital and then they sent me to a bigger hospital and I had a heart attack.\" A day-and-a-half later he said he felt better and checked himself out against doctors' wishes in a bid to make it to the wedding, but the heart palpitations returned when he got home, which at the time was in Mexico. \"At that time I started getting chest pains and I said I have to cancel because I didn't take care of the heart problem before. I had a good friend take me back to a hospital across the border to the States where I was told that my condition was very bad and they had to operate, and I had heart surgery.\""
    },
    {
        "title": "Netflix agrees blockbuster $72bn deal for Warner Bros studios ",
        "description": "Netflix has agreed a $72bn (&#163;54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones.",
        "url": "https://news.sky.com/story/netflix-agrees-blockbuster-72bn-deal-for-warner-bros-studios-13479683",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-warner-bros-logo-film_7101743.jpg?20251205122842",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 11:09:00",
        "Headline": "The agreement means Warner Bros Discovery's library of film and TV successes including Harry Potter and Game Of Thrones will come under the same roof as Stranger Things and Squid Game.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Netflix has agreed a $72bn (£54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones. It had been reported that the US streaming giant was in exclusive talks over the deal following a bidding war for the assets. Paramount Skydance and Comcast, the ultimate owner of Sky News, were the rival suitors for the bulk of WBD that also includes HBO, the HBO Max streaming platform and DC Studios. Money latest: Budget airline launches six new routes While Netflix has agreed a $27.75 per share price with WBD, which equates to the $72bn purchase figure, the deal gives the assets a total value of $82.7bn. It will see WBD come under Netflix ownership once its remaining Discovery Global division, mostly legacy cable networks including CNN and the TNT sports channels, is separated. However, the agreement is set to attract scrutiny from competition regulators, particularly in the United States and Europe. \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 Both WBD and Netflix do not see the prospect of the deal being completed until late 2026 or 2027. The main stumbling block is likely to be the fact that Netflix, which has hits including Stranger Things and Squid Game, is already the world's biggest streaming service. Further drama could come in the form of a complaint by Paramount, which had previously made a bid for the whole company. CNBC reported this week that Paramount had claimed the auction process was biased in favour of Netflix. Entertainment news provider Variety has also reported that major studios fear an institutional crisis for Hollywood unless the move is blocked. Ted Sarandos, the co-chief executive of Netflix, said: \"By combining Warner Bros' incredible library of shows and movies - from timeless classics like Casablanca and Citizen Kane to modern favourites like Harry Potter and Friends - with our culture-defining titles like Stranger Things, KPop Demon Hunters and Squid Game, we'll be able to do that even better. \"Together, we can give audiences more of what they love and help define the next century of storytelling.\" Netflix shares were trading down more than 3% in pre-market deals but recovered much of that loss when Wall Street opened. Those for WBD were up by more than 2%.  David O'Hara, managing director at the advisory firm MKI Global Partners, said of the proposed deal: \"The 12-18 month timeline signals a long antitrust review, but despite the overlap between Netflix and HBO Max, there is a path to approval through possible HBO divestment. \"Netflix would not accept a $5.8bn break fee if it didn't see at least a small chance of the deal closing.\""
    },
    {
        "title": "Germany introduces controversial new military service law, with powers including needs-based conscription",
        "description": "Germany will reintroduce voluntary military service after a controversial new law was passed through the Bundestag.",
        "url": "https://news.sky.com/story/germany-introduces-controversial-new-military-service-law-with-powers-including-needs-based-conscription-13479746",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-germany-ahlen-military_7101929.jpg?20251205144120",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:25:00",
        "Headline": "The bill introduces a dual-track system, offering a more lucrative voluntary service intended to attract young recruits. But if enlistment falls short, the bill also allows for needs-based conscription.",
        "Content": "Germany will reintroduce voluntary military service after a controversial new law was passed through the Bundestag. The legislation approved by the German parliament on Friday introduces a dual-track system, offering a more lucrative voluntary military service intended to attract young recruits. However, if enlistment falls short, the bill allows for needs-based conscription to be introduced. This would require a separate vote in parliament, and could involve random selection if more citizens are eligible than needed. All 18-year-olds in Germany will now be sent a request in January asking if they are interested and willing to join the country's army.  It's planned to be mandatory for men to respond and, in a move not seen since Germany suspended conscription in 2011, will see all men born after 1 January 2008 undergo medical evaluation, phased in as capacity allows. The bill sets expansion goals for the Bundeswehr, meaning federal defence, with a target of up to 260,000 active soldiers - up from 183,000 currently - and at least 200,000 reservists by 2035. German defence minister Boris Pistorius told lawmakers that \"our allies are looking at Germany\" and argued that the country has become a \"pacesetter for defence in Europe\". \n                  Direct trains from UK to Germany 'one step closer', but nothing yet on journeys to Berlin\n                 \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 \n                  The Kessler twins, German dance stars in the 50s and 60s, die in 'joint suicide', police say\n                 He added that with the new legislation, \"we are taking a further decisive step for our defence capability\". However, the decision has already been met with protests by young people, with opposition politicians calling for further action. The Left Party's Desiree Becker said young people should \"strike against the reintroduction of conscription\" and inform themselves about conscientious objection. Read more from Sky News:Teenager fatally hit by car on motorway had been tasered by policeUK military to be given powers to shoot down threatening drones It comes after French president Emmanuel Macron unveiled a new military service plan to boost its armed forces in response to the threat posed by Russia. Volunteers aged 18 and 19 will start serving next year in a 10-month military service programme, in France's mainland and overseas territories only. France had ended conscription in 1996 and is not considering reintroducing it.  Mr Macron told French media: \"There is a generation ready to rise up for the fatherland. We cannot go back to the time of conscription, but we need mobilisation. \"Our young people will have to participate in at least one commemorative ceremony per year in each school. \"We will encourage students to complete their second-year internships in our armed forces.\""
    },
    {
        "title": "Teenager fatally hit by car on motorway had been tasered by police, watchdog says",
        "description": "The police watchdog says it is investigating after a teenager who was tasered by an officer on a motorway was fatally hit by a car. ",
        "url": "https://news.sky.com/story/police-watchdog-investigating-after-teen-who-was-tasered-by-officer-on-motorway-was-fatally-hit-by-car-13478799",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-m5-somerset_7101735.jpg?20251205121111",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 00:01:00",
        "Headline": "Logan Smith, 18, got out of an ambulance on the M5 in Somerset, and was struck and killed by a car after being tasered by police.",
        "Content": "The police watchdog says it is investigating after a teenager who was tasered by an officer on a motorway was fatally hit by a car.  Logan Smith, 18, was being taken to hospital in an ambulance at about 11pm on Sunday when the vehicle stopped on the hard shoulder of the M5 in Somerset. The Independent Office for Police Conduct (IOPC) said the vehicle stopped on the northbound carriageway \"due to the concerns of ambulance staff\". Mr Smith got out of the ambulance near the junction for Weston-super-Mare and \"entered the live lanes of the motorway\", the watchdog added. Police were called and an officer arrived at the scene, with bodycam footage showing the officer discharging their Taser, causing the teenager to fall to the ground. \"Soon afterwards\" Mr Smith was struck by a car travelling on the southbound carriageway, the IOPC said. The watchdog said it was investigating the \"actions and decisions taken by Avon and Somerset Police prior to the death of a teenager\". IOPC Director Derrick Campbell said: \"My thoughts and sympathies are with Logan's family and friends and everyone affected by this shocking and tragic incident.  \"We want to reassure everyone that we will independently investigate all the circumstances surrounding this incident, including the use of a Taser. \"After being notified by the force, we sent our investigators to the police post incident procedure to begin gathering evidence. \"We have taken initial accounts from the officer and ambulance staff involved. \"We met with Logan's family on Tuesday, to give our condolences, explain our role and to provide some further detail about our investigation, including a Taser being discharged during the incident. \"We will continue to keep them updated and they request that their privacy be respected at such a difficult time.\" The coroner has been informed and formal identification and a post-mortem have taken place."
    },
    {
        "title": "Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers",
        "description": "The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.  ",
        "url": "https://news.sky.com/story/celebrities-join-the-princess-of-wales-for-a-carol-service-to-thank-britains-volunteers-13479909",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-royals-carol_7102238.jpg?20251205210016",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-05 22:14:00",
        "Headline": "Before the service, Kate met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor.",
        "Content": " The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.   But the focus of Kate's annual service at Westminster Abbey was the UK's local communities and the princess took the time beforehand to thank volunteers from across the country. Her smartly-dressed children Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, hung loops of red paper bearing their handwritten names on a \"Connection Tree\". The tree represents togetherness and the importance of moments of connection, and was covered with paper chains, created as each guest left a loop with their name. It tied in with theme of this year's service which was celebrating love in all its forms. Kate arrived at the abbey without her family before the service and met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor and singer Katie Melua. The royal children were later pictured holding candles with churchgoers during the service. Among the congregation were Kate's parents, Carole and Michael Middleton, her brother James Middleton and wife Alizee Thevenet; Zara and Mike Tindall; the Duchess of Edinburgh; and Prince Michael of Kent, who arrived in a wheelchair. Royal correspondent The Prince and Princess of Wales and their children have joined a congregation of celebrities, sporting stars and community stalwarts to celebrate love in all its forms at Christmas. Kate is presiding over her annual Together at Christmas carol service at Westminster Abbey, with about 1,600 guests filling the pews where the princess and her husband married in 2011. She arrived before the service to meet some of the stars performing or giving readings, including actress Kate Winslet and singer Katie Melua. She told Dan Smith, lead singer with Bastille, that her children had been looking forward to the service: \"They're really excited, it's become such a tradition.\" When Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, arrived with their father, Kate was there to meet them. Outside the Abbey's great west door the family stopped at a \"Connection Tree\" decorated with paper chains bearing the names of guests. The children added their names to the tree, a symbol of togetherness and the importance of moments of connection. The service recognised individuals from across the UK who may have dedicated or volunteered their time to others, led initiatives that bring people in their community together, or offered a helping hand to those around them. Celebrity chef Dame Mary Berry, who created a Christmas wreath on display in the abbey, was also among the guests, alongside members of the Lionesses and the Red Roses - England's women's football and rugby union teams. Kate expressed her appreciation to the performers when they met before the service, and she thanked Ms Winslet and Mr Ejiofor, who both later gave readings, and told Cornish folk singers Fisherman's Friends: \"I'm sure you'll be brilliant, thank you so much.\" The Princess added: \"It's a busy time I know for everybody.\" Kate also shared a joke with Schitt's Creek star Eugene Levy at the service. \"I should stand. Lovely to meet you, Catherine,\" said Mr Levy, as they continued to hold hands. \"You know my husband very well then,\" said Kate. Mr Levy replied: \"I spent a lovely day with your husband.\" Fisherman's Friends band member Jeremy Brown, who is a lobster fisherman, praised Kate for staging the event, now in its fifth year. He said: \"She does fantastic work for all these people and and we like to think we can just be part of that. If we can make somebody smile, we're happy to do that.\" Among the community stalwarts invited was Ann Davies, 81, a volunteer cook for almost a decade with the Moses Project, a charity providing mentoring and support for men with past and current addictions to drugs and alcohol. Ms Davies from Teesside also volunteers as a responsible adult at Middlesbrough police station, supporting vulnerable people who have been arrested. She said: \"The thing about volunteer work is you do it without expecting anything in return, you do it because you love it.\""
    },
    {
        "title": "Former doctor charged over alleged sexual assaults on 38 patients",
        "description": "A former doctor has been charged over alleged sexual assaults on 38 patients in his care.",
        "url": "https://news.sky.com/story/former-doctor-charged-over-alleged-sexual-assaults-on-38-patients-13479747",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-royal-stoke-university-hospital_7101938.jpg?20251205144610",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:19:00",
        "Headline": "Nathaniel Spencer, 38, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration, nine counts of sexual assault of a child under 13, three counts of assault of a child under 13 by penetration and one count of attempting to assault by penetration.",
        "Content": "A former doctor has been charged over alleged sexual assaults on 38 patients in his care. Nathaniel Spencer, 38, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration, nine counts of sexual assault of a child under 13, three counts of assault of a child under 13 by penetration and one count of attempted assault by penetration. It follows a police investigation into alleged sexual offences between 2017 and 2021. Staffordshire Police said in a statement the charges come after a complex investigation by the Public Protection Unit into sexual offences at the Royal Stoke University Hospital, in Stoke-on-Trent, and Russells Hall Hospital, in Dudley. Ben Samples, deputy chief crown prosecutor for the West Midlands CPS Complex Casework Unit and Serious Violence, Organised Crime and Exploitation Unit, said: \"We have decided to prosecute Nathaniel Spencer for a number of serious sexual offences allegedly carried out against patients while he was working as a doctor - including assault by penetration and sexual assault against a child. \"Our prosecutors have worked at length to support a detailed and complex investigation by Staffordshire Police, carefully reviewing the available evidence to establish that there is sufficient evidence to bring the case to trial and that it is in the public interest to pursue criminal proceedings.\" Spencer, from Birmingham, will appear at North Staffordshire Justice Centre on 20 January 2026."
    },
    {
        "title": "World Cup  2026 - who England, Scotland, Wales, Northern Ireland and the Republic of Ireland will play",
        "description": "Scotland and England now know who they will face in the group stage of the next summer's world cup. ",
        "url": "https://news.sky.com/story/world-cup-2026-who-england-scotland-wales-northern-ireland-and-the-republic-of-ireland-will-play-13479848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-football-world-cup_7086757.jpg?20251120132244",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 19:18:00",
        "Headline": "Friday's draw means countries who have qualified for the 48 team tournament in North America now know who they will play in their opening matches.",
        "Content": "Scotland and England now know who they will face in the group stage of the next summer's world cup.  But the fates of Northern Ireland, the Republic of Ireland and Wales won't be determined until they compete in pre-tournament play-off matches in March. England are in Group L along with Croatia, Panama and Ghana. Their first match will be against Croatia, who beat them in the semi-finals of the 2018 World Cup in Russia. Scotland's first match will be against Haiti, in Group C. Brazil and Morocco are the other Group C teams - both countries were also in the same opening group as Scotland in the 1998 World Cup in France. Wales have yet to find out if they will qualify as they must face a play-off against Bosnia and Herzegovina in Cardiff, and then either Italy or Northern Ireland, if they are victorious. Read more:EasyJet staff at Luton Airport to strike over Christmas \n                  Former doctor charged over alleged sexual assaults on 38 patients\n                 \n                  Duchess of Sussex 'reaches out' to estranged father after reports of leg amputation\n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 If they can overcome these play-off opponents then they will secure their place in Group B along with Canada, Qatar and Switzerland. But Northern Ireland will also be vying and hoping to guarantee their spot in the same group if they can beat Italy and then either Wales or Bosnia and Herzegovina.  The Republic of Ireland also need to get through the play-offs first and are paired against the Czech Republic for their semi-final. Should Ireland win that match, they will need to beat either North Macedonia or Denmark to get to the finals where an opening group containing joint hosts Mexico, South Africa and South Korea awaits."
    },
    {
        "title": "Duchess of Sussex 'reaches out' to estranged father after reports of leg amputation",
        "description": "Meghan Markle has \"reached out\" to her estranged father after reports he had his leg amputated, her spokesperson has said.",
        "url": "https://news.sky.com/story/duchess-of-sussex-reaches-out-to-estranged-father-after-reports-of-leg-amputation-13479764",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-harry-meghan_7047633.jpg?20251010111334",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:49:00",
        "Headline": "Thomas Markle, a retired television lighting director and director of photography, made headlines across the globe after he was caught staging paparazzi photographs in the days ahead of his daughter's wedding.",
        "Content": "Meghan Markle has \"reached out\" to her estranged father after reports he had his leg amputated, her spokesperson has said. Thomas Markle, 81, reportedly had his leg amputated following surgery in the Philippines, where he moved to this year. Meghan has been estranged from her father since around the time of her wedding to Prince Harry in May 2018. Mr Markle, a retired television lighting director and director of photography, made headlines across the globe after he was caught staging paparazzi photographs in the days ahead of the ceremony. A spokesperson for the Duchess of Sussex said: \"I can confirm she has reached out to her father.\" Meghan is said to have previously tried to reach out to him in the past. Mr Markle has never met his grandchildren Prince Archie and Princess Lilibet. \n                  Former doctor charged over alleged sexual assaults on 38 patients\n                 \n                  World Cup  2026 - who England, Scotland, Wales, Northern Ireland and the Republic of Ireland will play\n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 At the start of this year, Mr Markle told of how he dreamed of bringing his \"whole family together\" and wished his daughter \"no ill-will\". Mr Markle revealed that he didn't \"like some of the things\" Meghan had done but would \"always love her\". Read more:Prince Harry apologises to Canada for wearing cap at World SeriesPrince Harry and Meghan named Humanitarians of the Year His interview with the Mail on Sunday came amid the duchess' return to Instagram and the release of a trailer for her lifestyle show on Netflix. Mr Markle said: \"I'm not running away. I am going in search of a more positive life. \"Every day I see something about Meghan. This week it has been the new TV show.\" In his first interview after his daughter's wedding, Mr Markle said he didn't attend the big day because he was embarrassed about staging the photos. \"The truth is I couldn't get over the fact that that had happened. All that stuff was working on me, I had a bit of a heart condition. \"This pushed me a little further to the part where I had heart palpitations. I had to drive at 2am to a hospital. They sent me to another little hospital and then they sent me to a bigger hospital and I had a heart attack.\" A day-and-a-half later he said he felt better and checked himself out against doctors' wishes in a bid to make it to the wedding, but the heart palpitations returned when he got home, which at the time was in Mexico. \"At that time I started getting chest pains and I said I have to cancel because I didn't take care of the heart problem before. I had a good friend take me back to a hospital across the border to the States where I was told that my condition was very bad and they had to operate, and I had heart surgery.\""
    },
    {
        "title": "Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers",
        "description": "The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.  ",
        "url": "https://news.sky.com/story/celebrities-join-the-princess-of-wales-for-a-carol-service-to-thank-britains-volunteers-13479909",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-royals-carol_7102238.jpg?20251205210016",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 22:14:00",
        "Headline": "Before the service, Kate met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor.",
        "Content": " The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.   But the focus of Kate's annual service at Westminster Abbey was the UK's local communities and the princess took the time beforehand to thank volunteers from across the country. Her smartly-dressed children Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, hung loops of red paper bearing their handwritten names on a \"Connection Tree\". The tree represents togetherness and the importance of moments of connection, and was covered with paper chains, created as each guest left a loop with their name. It tied in with theme of this year's service which was celebrating love in all its forms. Kate arrived at the abbey without her family before the service and met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor and singer Katie Melua. The royal children were later pictured holding candles with churchgoers during the service. Among the congregation were Kate's parents, Carole and Michael Middleton, her brother James Middleton and wife Alizee Thevenet; Zara and Mike Tindall; the Duchess of Edinburgh; and Prince Michael of Kent, who arrived in a wheelchair. Royal correspondent The Prince and Princess of Wales and their children have joined a congregation of celebrities, sporting stars and community stalwarts to celebrate love in all its forms at Christmas. Kate is presiding over her annual Together at Christmas carol service at Westminster Abbey, with about 1,600 guests filling the pews where the princess and her husband married in 2011. She arrived before the service to meet some of the stars performing or giving readings, including actress Kate Winslet and singer Katie Melua. She told Dan Smith, lead singer with Bastille, that her children had been looking forward to the service: \"They're really excited, it's become such a tradition.\" When Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, arrived with their father, Kate was there to meet them. Outside the Abbey's great west door the family stopped at a \"Connection Tree\" decorated with paper chains bearing the names of guests. The children added their names to the tree, a symbol of togetherness and the importance of moments of connection. The service recognised individuals from across the UK who may have dedicated or volunteered their time to others, led initiatives that bring people in their community together, or offered a helping hand to those around them. Celebrity chef Dame Mary Berry, who created a Christmas wreath on display in the abbey, was also among the guests, alongside members of the Lionesses and the Red Roses - England's women's football and rugby union teams. Kate expressed her appreciation to the performers when they met before the service, and she thanked Ms Winslet and Mr Ejiofor, who both later gave readings, and told Cornish folk singers Fisherman's Friends: \"I'm sure you'll be brilliant, thank you so much.\" The Princess added: \"It's a busy time I know for everybody.\" Kate also shared a joke with Schitt's Creek star Eugene Levy at the service. \"I should stand. Lovely to meet you, Catherine,\" said Mr Levy, as they continued to hold hands. \"You know my husband very well then,\" said Kate. Mr Levy replied: \"I spent a lovely day with your husband.\" Fisherman's Friends band member Jeremy Brown, who is a lobster fisherman, praised Kate for staging the event, now in its fifth year. He said: \"She does fantastic work for all these people and and we like to think we can just be part of that. If we can make somebody smile, we're happy to do that.\" Among the community stalwarts invited was Ann Davies, 81, a volunteer cook for almost a decade with the Moses Project, a charity providing mentoring and support for men with past and current addictions to drugs and alcohol. Ms Davies from Teesside also volunteers as a responsible adult at Middlesbrough police station, supporting vulnerable people who have been arrested. She said: \"The thing about volunteer work is you do it without expecting anything in return, you do it because you love it.\""
    },
    {
        "title": "Convicted terrorist from Iraq jailed after entering UK illegally on a small boat",
        "description": "A convicted terrorist from Iraq who entered the UK illegally has been sentenced to more than two years in jail.",
        "url": "https://news.sky.com/story/convicted-terrorist-from-iraq-jailed-after-entering-uk-illegally-on-a-small-boat-13479772",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-small-boats-migrant_7030656.jpg?20250924180405",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:51:00",
        "Headline": "Rebwar Hamad was extradited to Italy from the UK after being convicted of terrorist offences there. He was investigated when he tried to re-enter Britain.",
        "Content": "A convicted terrorist from Iraq who entered the UK illegally has been sentenced to more than two years in jail. Rebwar Hamad, 48, from Iraq, arrived with other migrants on 19 September and later pleaded guilty to entering the country without valid entry clearance, the Crown Prosecution Service (CPS) has said. He was sentenced at Canterbury Crown Court on Friday to two years and three months in prison. Hamad originally came to the UK in 2001 and was granted indefinite leave to remain, the CPS said. In 2019, he was convicted in his absence in Italy of terrorism offences and extradited to the country the following year to serve his sentence. After his release, Hamad said he was told to leave Italy within a week. Read more from Sky News: Inside the operation to smuggle people across the ChannelUK looking at Denmark model to cut illegal migration He then applied for visa to come to the UK for a second time but his application was rejected, so he paid €1,200 (around £1,050) for a place on a small boat that was later intercepted off Dover, the CPS said. \n                  171 arrests in gig economy crackdown - with 60 delivery drivers to be deported\n                 \n                  France will soon be able to intercept suspected migrant taxi boats in the Channel\n                 \n                  More children to face deportation under government's asylum crackdown\n                 Peter Cockrill from the CPS said: \"Rebwar Hamad showed a blatant disregard for immigration rules by coming to the UK illegally for a second time and after serving a prison sentence for terrorism offences in Italy. \"The CPS argued in court that for these reasons he should receive the toughest sentence possible. \"The Crown Prosecution Service will continue to work tirelessly with law enforcement and international partners, including the Border Security Command, to disrupt people smuggling networks and bring those who profit from this exploitative trade to justice.\""
    },
    {
        "title": "David Lammy suggests UK would benefit from rejoining an EU customs union",
        "description": "Deputy Prime Minister David Lammy has suggested it could be beneficial for the UK to consider re-entering a customs union with the EU.",
        "url": "https://news.sky.com/story/david-lammy-suggests-uk-would-benefit-from-rejoining-an-eu-customs-union-13479777",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-david-lammy-downing-street_7098187.jpg?20251202092026",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 15:04:00",
        "Headline": "But Keir Starmer, responding to his deputy's intervention, stresses the government wants to strengthen ties with Europe without a customs union.",
        "Content": "Deputy Prime Minister David Lammy has suggested it could be beneficial for the UK to consider re-entering a customs union with the EU. He said that although doing so was not the government's current policy, he could see how other countries outside the EU had benefited from such arrangements. \"It's self-evident that leaving the European Union badly damaged our economy, took us out of an important marketplace and created serious friction, that untruths were being peddled by those that thought exiting the EU would be a good thing,\" Mr Lammy told the News Agents podcast. \"And it's why every single day that I was foreign secretary, I returned to the subject of our relationship with the European Union.\" Asked repeatedly if he would like to see the UK in a customs union, he said: \"That is not currently our policy. That's not currently where we are. \"But you can see countries like Turkey with a customs union seemingly benefiting and seeing growth in their economy, and again, that's self-evident.\" The Prime Minister's economic adviser Minouche Shafik has also reportedly advocated behind the scenes for joining a customs union. \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 \n                  More border checks for Britons travelling to Europe under new rules\n                 Mr Lammy's comments were being taken as the clearest indication yet that the government is considering bringing the UK further back in line with the European Union. But when Sir Keir Starmer was asked to respond and say why he was not advocating for membership given that growth is an ongoing priority for his government, he was quick to dampen down the speculation. The prime minister said Labour would be sticking to its manifesto, which pledged to deepen ties with the EU without returning to the customs union, single market or freedom of movement. \"Well, the position that we are taking has been clearly set out in the manifesto, and then we've been following it,\" Sir Keir said. \"And earlier this year, we had the first UK-EU summit ever, and we had 10 strands for a closer relationship. \"So we've totally reset relations with the EU. \"That's good for our economy, good for defence and security, good for the work that we need to do on energy. Earlier a spokesperson for Number 10 said: \"We are strengthening relations with the EU whilst sticking to our red lines.\" \"The prime minister reiterated that on Monday evening at the Lady Mayor's Banquet.\"  Sir Keir set out his foreign policy vision at the banquet, as is tradition. He said the Brexit vote was a \"fair, democratic expression\" but the way it was \"sold and delivered was wrong\". \"There's no credible economic vision for Britain not positioning us as an open trading economy,\" the Number 10 spokesman said. \"We have to be grown up about trade-offs. We have redefined bonds with EU and stuck to our red lines.\" On Mr Lammy's comments, the spokesman added: \"That is not our current policy or where we are.\""
    },
    {
        "title": "EasyJet staff at Luton Airport to strike over Christmas",
        "description": "EasyJet flights to major holiday destinations over the Christmas period could be delayed or cancelled after baggage handling and check-in staff at Luton Airport voted to go on strike.",
        "url": "https://news.sky.com/story/easyjet-staff-at-luton-airport-to-strike-over-christmas-13479782",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-luggage-baggage-conveyor_7086414.jpg?20251120061419",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 15:36:00",
        "Headline": "EasyJet passengers are set to face festive disruption after check-in and baggage handling staff voted to go on strike over Christmas.",
        "Content": "EasyJet flights to major holiday destinations over the Christmas period could be delayed or cancelled after baggage handling and check-in staff at Luton Airport voted to go on strike. Around 200 workers, who are members of the Unite union and who work on easyJet's Luton check-in desks and as baggage handlers, have rejected an offer of a 4.5 per cent pay rise from their employer, DHL, which outsources its staff to easyJet. They say the increase fails to address the sharp rise in the cost of living, including food, fuel and heating bills. The union said DHL workers at Gatwick Airport earn around £3 an hour more for doing the same job. One worker said: \"I was in debt from a previous low-paid job, but this hasn't ended as my pay isn't enough. I have the same routine of dedicating myself to a job where I can only cover rent and food. I can't afford to save to give a better life to my child or spend enough time with my child.\" Unite General Secretary Sharon Graham said: \"DHL and easyJet can comfortably afford to offer these workers an above-inflation pay rise. It is shameful that hardworking members can't afford the basics and they are paid less than their counterparts. \"These companies must stop putting profits over people and come back to the table with a fair pay offer to avoid this disruptive strike, which is entirely of their making.\" \n                  Former doctor charged over alleged sexual assaults on 38 patients\n                 \n                  World Cup  2026 - who England, Scotland, Wales, Northern Ireland and the Republic of Ireland will play\n                 \n                  Duchess of Sussex 'reaches out' to estranged father after reports of leg amputation\n                 Unite regional officer Jeff Hodge echoed the call, warning the strike could still be avoided if DHL returns with a \"sensible offer\" that meets workers' needs. The strike is scheduled to start at 3am on 19 December and continue until 3am on 22 December. It will then resume at 3am on Boxing Day and run until 3am on 29 December, covering two of the busiest travel weekends of the festive season. If the strike goes ahead, hundreds of easyJet flights at the Bedfordshire airport are estimated to be disrupted over the six-day action. Read more:IT issue affects flights at Edinburgh AirportAirbus fleet returns to service after software issue An EasyJet spokesperson said: \"We are disappointed to hear of the planned industrial action by Unite ground handlers employed by DHL at London Luton Airport on 19th to 21st and 26th to 28th December. \"Should this action go ahead, we will work closely with the airport and DHL to ensure that robust contingency plans are in place to minimise any disruption, so we are currently expecting to operate our full flying programme on these dates. In the meantime we urge DHL and Unite to reach an agreement as soon as possible.\" A DHL spokesperson said: \"We are deeply disappointed that 57% of Unite members have voted in favour of industrial action at our London Luton Airport operation. \"Our current pay offer is above inflation and continues to build on four consecutive years of above-inflation pay increases. \"We remain committed to constructive talks to reach a solution that recognises the value of our colleagues while safeguarding the long-term competitiveness of the operation. \"However, robust contingency plans are in place to minimise any potential disruption should the action go ahead.\" EasyJet passengers booked to fly from Luton during the affected period are being advised to check their flight status - and prepare for potential delays, cancellations or lengthy queues at check-in and baggage drop."
    },
    {
        "title": "Teenager fatally hit by car on motorway had been tasered by police, watchdog says",
        "description": "The police watchdog says it is investigating after a teenager who was tasered by an officer on a motorway was fatally hit by a car. ",
        "url": "https://news.sky.com/story/police-watchdog-investigating-after-teen-who-was-tasered-by-officer-on-motorway-was-fatally-hit-by-car-13478799",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-m5-somerset_7101735.jpg?20251205121111",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 00:01:00",
        "Headline": "Logan Smith, 18, got out of an ambulance on the M5 in Somerset, and was struck and killed by a car after being tasered by police.",
        "Content": "The police watchdog says it is investigating after a teenager who was tasered by an officer on a motorway was fatally hit by a car.  Logan Smith, 18, was being taken to hospital in an ambulance at about 11pm on Sunday when the vehicle stopped on the hard shoulder of the M5 in Somerset. The Independent Office for Police Conduct (IOPC) said the vehicle stopped on the northbound carriageway \"due to the concerns of ambulance staff\". Mr Smith got out of the ambulance near the junction for Weston-super-Mare and \"entered the live lanes of the motorway\", the watchdog added. Police were called and an officer arrived at the scene, with bodycam footage showing the officer discharging their Taser, causing the teenager to fall to the ground. \"Soon afterwards\" Mr Smith was struck by a car travelling on the southbound carriageway, the IOPC said. The watchdog said it was investigating the \"actions and decisions taken by Avon and Somerset Police prior to the death of a teenager\". IOPC Director Derrick Campbell said: \"My thoughts and sympathies are with Logan's family and friends and everyone affected by this shocking and tragic incident.  \"We want to reassure everyone that we will independently investigate all the circumstances surrounding this incident, including the use of a Taser. \"After being notified by the force, we sent our investigators to the police post incident procedure to begin gathering evidence. \"We have taken initial accounts from the officer and ambulance staff involved. \"We met with Logan's family on Tuesday, to give our condolences, explain our role and to provide some further detail about our investigation, including a Taser being discharged during the incident. \"We will continue to keep them updated and they request that their privacy be respected at such a difficult time.\" The coroner has been informed and formal identification and a post-mortem have taken place."
    },
    {
        "title": "Russia denies being behind Salisbury poisonings and warns of danger of war with Europe    ",
        "description": "Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018.",
        "url": "https://news.sky.com/story/russia-denies-being-behind-salisbury-poisonings-and-warns-of-danger-of-war-with-europe-13479780",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/putin-dawn-sturgess-uk-news_7101206.jpg?20251204193523",
        "type": "UK",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-12-05 15:21:00",
        "Headline": "Putin's ambassador to London accuses UK of 'Agatha Christie' staging the novichok  crimes, that killed Dawn Sturgess, and says Russia is ready for war 'right now'. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018. The report concluded Vladimir Putin \"must have\" authorised the use of a nerve agent in the attack and was therefore \"morally responsible\" for the British woman's death. Ambassador Andrei Kelin dismissed those claims and said he did not have a message for her family because Moscow was not involved. \"It's a tragic death, it is of course sad and Russia has nothing to do with it,\" he said. The poisonings of Sergei Skripal - a former Russian spy - and his daughter were, he insisted, staged by the British government and secret services. \"The script is very elaborated,\" he said. \"It has been done by very talented professionals. It reminds me of Ian Fleming or even Agatha Christie\" \n                  Giving up territory would be 'unjust peace', says Ukraine's armed forces chief\n                 \n                  Narendra Modi and Vladimir Putin embrace before talking trade at India-Russia summit\n                 \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 But the ambassador offered no evidence to support his claim. In contrast the British government and independent investigative journalists have produced abundant evidence to show the poisonings were the work of Russia military intelligence agents. The Organisation for the Prohibition of Chemical Weapons, of which Russia is a member, verified British claims novichok was used, a nerve agent invented and used only by Russia. A public inquiry found two agents from Russia's GRU spy agency, using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury from Moscow. The officers came to London on 2 March with a third agent, known as Sergey Fedotov, to kill Mr Skripal - a former Russian spy who worked as a double agent for the UK. In its report, the inquiry said Petrov and Boshirov had likely used this same bottle to apply the nerve agent to Mr Skripal's door before it was \"carelessly discarded\". Read more:Putin 'morally responsible' for Briton's deathSalisbury novichok poisonings: Seven questions to be answered Charlie Rowley, 52, found the bottle and gave it to Ms Sturgess, 44, who sprayed herself with its contents on 30 June 2018, and died just over a week later. Mr Skripal, 74, his daughter Yulia, 41, and Mr Rowley, 52, all survived, but were left seriously ill. Ambassador Kelin said the report had been timed to upset delicate peace talks over Ukraine. He said: \"By this I think the British government would like to derail talks that are very interesting and in a high stage.\" The ambassador said he was personally worried about the possibility of a wider conflict erupting from the war in Ukraine. Asked if there was a greater chance now of war between Europe and Russia than he had seen in his career, he answered there was. \"Yes, of course, listening to all these statements, about the need to prepare for the war, like our president has said, recently, two days ago that, we do not want to wage a war against Europe. \"But if Europe would like to wage a war against Russia, then we are prepared. Right now.\""
    },
    {
        "title": "Jamie Oliver revives high street Italian restaurant chain, six years after collapse",
        "description": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses.",
        "url": "https://news.sky.com/story/jamie-oliver-revives-high-street-italian-restaurant-chain-six-years-after-collapse-13479723",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jamies-italian-chef-jamie-oliver_7101816.jpg?20251205134306",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-05 13:30:00",
        "Headline": "Oliver will start with a Jamie's Italian in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs Prezzo, another chain of Italian restaurants.",
        "Content": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses. The TV chef will start by opening a restaurant in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs another Italian eatery chain, Prezzo. Oliver, 50, has presented a host of TV shows since first appearing on screen in The Naked Chef in 1999 and has written more than two dozen cookery books. He said the relaunch carried risk and opportunity, as \"in theory it's not the easiest time to return but conversely, I think it's the perfect time\". \"I believe the mid-market needs excitement, surprise and delight and that's exactly what I am planning on delivering,\" he said. \"I will drive the menus, make sure the sourcing is right, the staff training, and ensure the look and feel of the restaurant is brought to life in the right way.\" Jamie's Italian was launched in 2008 in Oxford after Oliver went into partnership with his Italian mentor, chef Gennaro Contaldo. The chain eventually grew to around 40 sites. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 \n                  Israel allowed to take part in Eurovision 2026 - as several countries withdraw\n                 But it went into administration in 2019, leading to the closure of its remaining UK sites and hundreds of job losses. The chain continued to operate overseas and has more than 30 restaurants in 25 countries. Brava will relaunch the brand in the UK. Read more on Sky News:Scarlett was groomed from 14Ex-doctor charged over alleged sex assaults Ed Loftus, global director of Jamie Oliver Restaurants, called it an \"exciting next chapter\" for the business in the UK, bringing together \"one of the world's most recognised chefs with a highly capable operator and the long-term investment to build something with real longevity\". James Brown, chief executive of Brava, said the company wanted to \"bring world-class Italian dining to the heart of the UK high street\". \"A lot of time and energy has gone into evolving the Jamie's Italian concept to make that vision a reality,\" he said. \"This marks an exciting new chapter for both Jamie's Italian and Brava, and reflects our commitment to reimagining the high street with exceptional, modern hospitality.\""
    },
    {
        "title": "Giving up territory would be 'unjust peace', says Ukraine's armed forces chief",
        "description": "It would be \"unacceptable\" for Ukraine to \"simply give up territory\" in any peace deal with Russia, the head of the Ukrainian armed forces has told Sky News.&#160;",
        "url": "https://news.sky.com/story/giving-up-territory-would-be-unacceptable-says-ukraines-armed-forces-chief-13479634",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-deborah-haynes-ukraine_7101680.jpg?20251205110744",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-05 10:10:00",
        "Headline": "In a rare interview, General Oleksandr Syrskyi warns Russia is using US-brokered peace talks as a \"cover\" to try to grab more land by force on the battlefield.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  It would be \"unacceptable\" for Ukraine to \"simply give up territory\" in any peace deal with Russia, the head of the Ukrainian armed forces has told Sky News.  General Oleksandr Syrskyi said a \"just peace\" can only be achieved if fighting is halted along current frontlines and then for negotiations to take place. Signalling a complete lack of trust in claims by the Kremlin that it wants to end its war, he accused Vladimir Putin of using an attempt by Donald Trump to broker peace talks as \"cover\" while Russian troops try to capture more land by force on the battlefield. Ukraine peace talks - latest  The rare intervention offers the clearest indication yet of the Ukrainian military's red lines as Washington tries to negotiate a settlement that - according to an initial draft - would require Kyiv to surrender the whole of the Donbas region in the east of the country to Moscow. President Volodymyr Zelenskyy, backed by the UK and other European allies, has been trying on the diplomatic front to strengthen Ukraine's position. But President Putin has said Russia would either seize the Donbas militarily or Ukrainian troops would have to withdraw. Europe's fate at stake Speaking frankly, General Syrskyi, commander-in-chief of the armed forces of Ukraine, signalled that his country's soldiers would fight on if diplomacy fails - and he warned that the fate of the whole of Europe is at stake. \"Our main mission is to defend our land, our country, and our population,\" he said in an exclusive interview in the basement of a building in eastern Ukraine. Sky News has been asked not to disclose the location for security reasons. \"Naturally, for us it is unacceptable to simply give up territory. What does it even mean - to hand over our land? This is precisely why we are fighting; so we do not give up our territory.\" Many troops have died fighting for Ukraine since Russia first seized the peninsula of Crimea and attacked the regions of Donetsk and Luhansk, which comprise the Donbas, in 2014. Hundreds of thousands of Ukrainian civilians were then mobilised to fight alongside professional soldiers following Putin's full-scale invasion in February 2022. Russia well short of original goal Nearly four years on, Russia occupies almost a fifth of Ukraine, including large parts of the Donbas, but well short of an original goal of imposing a pro-Kremlin government in Kyiv. Asked whether the sacrifice of those people who gave their lives defending their country would be in vain if Ukraine is forced to hand over the land it still controls in the Donbas to Moscow, General Syrskyi, speaking in Ukrainian through a translator, said: \"You know, I do not even allow myself to consider such a scenario. \"All wars eventually end, and of course we hope ours will end as well. And when it does, a just peace must be established. \"In my understanding, a just peace is peace without preconditions, without giving up territory. It means stopping along the current line of contact.\"  The commander then broke into English to say that this means: \"Stop. A ceasefire. And after that negotiations, without any conditions.\" Switching back into Ukrainian, he said: \"Any other format would be an unjust peace, and for us it is unacceptable.\" Ukraine's contingency plans While Ukraine's will and ability to fight are key in confronting Russia's much larger army, so too is the supply of weapons, ammunition and other assistance from Kyiv's allies, most significantly the US. But, with the White House under Donald Trump, becoming less predictable, the Ukrainian military appears to be considering contingency plans in case US aid stops. Asked whether Ukraine would be able to continue fighting if President Trump did halt support, General Syrskyi said: \"We are very grateful to our American partners and all our allies who have been supporting us throughout this war with weapons and equipment. \"We hope they will continue providing full support. But we also hope that our European partners and allies, if necessary, will be ready to provide everything required for our just war against the aggressor. \"Because right now we are defending not only ourselves, but all of Europe. And it is crucial for all Europeans that we continue doing so, because if we are not here, others will be forced to fight in Europe.\" General's assessment of fighting on ground A decorated commander, with the call sign \"snow leopard\", General Syrskyi has been conducting combat operations against Russia's invasion for more than a decade. He was made military chief in February 2024 after President Volodymyr Zelenskyy sacked the previous top commander. General Valerii Zaluzhnyi is now Kyiv's ambassador to London. General Syrskyi offered his assessment of the fight on the ground, saying: • Ukrainian troops still control the northern part of the fortress city of Pokrovsk in the Donbas and will keep battling to retake the rest of it, contrary to Russian claims to have captured what has been a key target for Moscow for the past 16 months. • Russia is firing between 4,000 to 5,000 one-way attack drones at Ukrainian positions along the frontline every day as well as 1,500 to 2,000 drones that drop bombs. But Ukraine is firing the same volume - and even more - back. \"In terms of drones, there is roughly parity. At the moment, we are deploying slightly more FPV [first person view] drones than the Russians.\" • Russia's armed forces still have double the volume of artillery rounds of Ukraine's, but the range and lethality of drone warfare mean it is harder to use artillery effectively. Now, 60% of strikes are carried out by drones. • More than 710,000 Russian soldiers are deployed along a frontline that stretches some 780 miles (1,255km), with the Russian side losing around 1,000 to 1,100 soldiers a day, killed or wounded \"and a majority are killed\". \"At this stage the Russian army is attempting to advance along virtually the entire frontline,\" General Syrskyi said. Where are the harshest battles? The fiercest battles are around Pokrovsk, as well as the northeastern city of Kupiansk, in Kharkiv region, the Lyman area, also in the Donbas, and near a small city called Huliaipole, in the Zaporizhzhia region of southeastern Ukraine. \"The Ukrainian army is conducting a strategic defensive operation, aiming to contain the enemy's advance, prevent them from breaking deeper, inflict maximum losses, and carry out counter-offensive actions in those sectors where we see the enemy is vulnerable,\" the commander said. \"Our strategy is to exhaust the Russian army as much as possible, prevent its advance, hold our territory, while simultaneously striking the enemy in the near rear, the operational depth, and… into Russia itself, with the aim of undermining its defence capability and industrial capacity.\"  He is referring to a capability Ukraine has developed to launch long-range drones, laden with explosives, deep into Russia to strike military targets as well as oil refineries. The operation is aimed at destroying fuel for the tanks, warships and jets that are attacking Ukraine and - crucially - reducing oil revenues that help to fund Russia's war machine. Sea drones crash into Russia's warships The Ukrainian military is also deploying explosive sea drones that are smashed into Russian warships as well as tankers used to transport sanctioned Russian oil. Asked if his forces were ready - and had sufficient manpower - to keep fighting if necessary, General Syrskyi said: \"We have the resources to continue conducting military operations.\" Yet Ukraine is suffering from a shortage of troops on the frontline. Soldiers and wider society are also exhausted and facing another winter of war. No sign of Moscow winding down war effort President Putin has an advantage when it comes to troop numbers and firepower over time, which makes continued support to Kyiv from its allies more vital than ever. General Syrskyi cautioned that Moscow showed no sign of winding down its war effort despite the Russian leader telling President Trump he is prepared to negotiate. Read more on Sky News:Hugs ahead of India-Russia talks New Russia sanctions 'pointless' \"So we do everything so that if the enemy continues the war, and you can see that although we want peace, a fair peace, the enemy continues its offensive, using these peace talks as cover,\" he said. \"There are no pauses, no delays in their operations. They keep pushing their troops forward to seize as much of our territory as possible under the cover of negotiations.\" He added: \"So we are just forced to wage this war… protecting our people, our cities and towns, and our land.\" The commander said this is what motivates his soldiers. \"If we do not do this, we can see clearly what the Russian army leaves behind, only ruins, only deaths.\" As for whether the UK and other European nations should be preparing their people for the possibility of a wider war with Russia, the general said: \"Of course, the armed forces of every country ensure reliable protection of their citizens, their children, and their territory. \"With the existence of aggressive states, above all the Russian Federation and its allies, this issue is extremely urgent. \"Everything must be done to ensure the capability to maintain a level of defence, and armed forces modern enough to repel aggression, both individually and in support of the allies.\""
    },
    {
        "title": "Germany introduces controversial new military service law, with powers including needs-based conscription",
        "description": "Germany will reintroduce voluntary military service after a controversial new law was passed through the Bundestag.",
        "url": "https://news.sky.com/story/germany-introduces-controversial-new-military-service-law-with-powers-including-needs-based-conscription-13479746",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-germany-ahlen-military_7101929.jpg?20251205144120",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:25:00",
        "Headline": "The bill introduces a dual-track system, offering a more lucrative voluntary service intended to attract young recruits. But if enlistment falls short, the bill also allows for needs-based conscription.",
        "Content": "Germany will reintroduce voluntary military service after a controversial new law was passed through the Bundestag. The legislation approved by the German parliament on Friday introduces a dual-track system, offering a more lucrative voluntary military service intended to attract young recruits. However, if enlistment falls short, the bill allows for needs-based conscription to be introduced. This would require a separate vote in parliament, and could involve random selection if more citizens are eligible than needed. All 18-year-olds in Germany will now be sent a request in January asking if they are interested and willing to join the country's army.  It's planned to be mandatory for men to respond and, in a move not seen since Germany suspended conscription in 2011, will see all men born after 1 January 2008 undergo medical evaluation, phased in as capacity allows. The bill sets expansion goals for the Bundeswehr, meaning federal defence, with a target of up to 260,000 active soldiers - up from 183,000 currently - and at least 200,000 reservists by 2035. German defence minister Boris Pistorius told lawmakers that \"our allies are looking at Germany\" and argued that the country has become a \"pacesetter for defence in Europe\". \n                  Direct trains from UK to Germany 'one step closer', but nothing yet on journeys to Berlin\n                 \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 \n                  The Kessler twins, German dance stars in the 50s and 60s, die in 'joint suicide', police say\n                 He added that with the new legislation, \"we are taking a further decisive step for our defence capability\". However, the decision has already been met with protests by young people, with opposition politicians calling for further action. The Left Party's Desiree Becker said young people should \"strike against the reintroduction of conscription\" and inform themselves about conscientious objection. Read more from Sky News:Teenager fatally hit by car on motorway had been tasered by policeUK military to be given powers to shoot down threatening drones It comes after French president Emmanuel Macron unveiled a new military service plan to boost its armed forces in response to the threat posed by Russia. Volunteers aged 18 and 19 will start serving next year in a 10-month military service programme, in France's mainland and overseas territories only. France had ended conscription in 1996 and is not considering reintroducing it.  Mr Macron told French media: \"There is a generation ready to rise up for the fatherland. We cannot go back to the time of conscription, but we need mobilisation. \"Our young people will have to participate in at least one commemorative ceremony per year in each school. \"We will encourage students to complete their second-year internships in our armed forces.\""
    },
    {
        "title": "Donald Trump awarded FIFA peace prize at World Cup draw",
        "description": "US President Donald Trump has been awarded FIFA's new peace prize at the draw for next year's World Cup.",
        "url": "https://news.sky.com/story/donald-trump-awarded-fifa-peace-prize-at-world-cup-draw-13479828",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-fifa_7102102.jpg?20251205174647",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 17:40:00",
        "Headline": "World football's governing body, which announced the annual award last month, said it would be given to \"individuals who have taken exceptional and extraordinary actions for peace\".",
        "Content": "US President Donald Trump has been awarded FIFA's new peace prize at the draw for next year's World Cup. FIFA President Gianni Infantino presented Mr Trump with a large golden trophy - formed of hands holding the earth - and a gold medal, which he wore around his neck. The certificate, which Mr Infantino handed over at Washington DC's Kennedy Center on Friday, recognises the US president for his actions to \"promote peace and unity around the world\". World football's governing body, which announced the annual award last month, said it would be given to \"individuals who have taken exceptional and extraordinary actions for peace\". World Cup draw latest: Home nations and Republic of Ireland await fate Mr Trump said it was \"truly one of the greatest honours of my life\". He said: \"We saved millions and millions of lives. The Congo is an example - over 10 million people killed. It was heading for another 10 million very quickly.\" He also pointed to India and Pakistan, saying, \"so many wars that we were able to end, in some cases a little before they started\". Ahead of the draw, Mr Trump told reporters he did not care about the prize, but noted that he had \"settled eight wars\" in nearly 11 months in office. The United States, along with Canada and Mexico, will host the tournament in 2026.Mr Infantino, who has built up a strong relationship with the US president, backed him for the Nobel Peace Prize earlier this year. Read more from Sky News:Netflix agrees blockbuster $72bn deal for Warner Bros studiosSeveral sites go down after Cloudfare outage \"This is what we want from a leader - a leader that cares about the people,\" Mr Infantino said of Mr Trump. The FIFA leader said to Mr Trump, \"this is your prize, this is your peace prize\". Mr Trump thanked his family, including his wife, first lady Melania Trump, and praised the leaders of the other two host nations - Canadian Prime Minister Mark Carney and Mexican President Claudia Sheinbaum - in his brief remarks. Mr Infantino has often spoken about football as a unifier for the world, but the prize is a departure from the federation's traditional focus on sport. FIFA has described the prize as one that rewards \"individuals who have taken exceptional and extraordinary actions for peace, and by doing so have united people across the world\". The award comes during a week where Mr Trump's administration has been under scrutiny for lethal strikes on alleged drug boats in the Caribbean and as Mr Trump hardens his rhetoric against immigrants. The Nobel Peace Prize this year was eventually awarded to Venezuelan opposition leader Maria Corina Machado, who said shortly after receiving the prize that she was dedicating it in part to Mr Trump for \"his decisive support of our cause\"."
    },
    {
        "title": "Russia denies being behind Salisbury poisonings and warns of danger of war with Europe    ",
        "description": "Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018.",
        "url": "https://news.sky.com/story/russia-denies-being-behind-salisbury-poisonings-and-warns-of-danger-of-war-with-europe-13479780",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/putin-dawn-sturgess-uk-news_7101206.jpg?20251204193523",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-12-05 15:21:00",
        "Headline": "Putin's ambassador to London accuses UK of 'Agatha Christie' staging the novichok  crimes, that killed Dawn Sturgess, and says Russia is ready for war 'right now'. ",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Russia's ambassador to the UK has rejected the findings of an official investigation into the death of Dawn Sturgess, killed after the Salisbury poisoning attack in 2018. The report concluded Vladimir Putin \"must have\" authorised the use of a nerve agent in the attack and was therefore \"morally responsible\" for the British woman's death. Ambassador Andrei Kelin dismissed those claims and said he did not have a message for her family because Moscow was not involved. \"It's a tragic death, it is of course sad and Russia has nothing to do with it,\" he said. The poisonings of Sergei Skripal - a former Russian spy - and his daughter were, he insisted, staged by the British government and secret services. \"The script is very elaborated,\" he said. \"It has been done by very talented professionals. It reminds me of Ian Fleming or even Agatha Christie\" \n                  Giving up territory would be 'unjust peace', says Ukraine's armed forces chief\n                 \n                  Narendra Modi and Vladimir Putin embrace before talking trade at India-Russia summit\n                 \n                  Fresh sanctions on Russia seem futile - Putin is more belligerent than ever\n                 But the ambassador offered no evidence to support his claim. In contrast the British government and independent investigative journalists have produced abundant evidence to show the poisonings were the work of Russia military intelligence agents. The Organisation for the Prohibition of Chemical Weapons, of which Russia is a member, verified British claims novichok was used, a nerve agent invented and used only by Russia. A public inquiry found two agents from Russia's GRU spy agency, using the aliases Alexander Petrov, 46, and Ruslan Boshirov, 47, had brought the Nina Ricci bottle containing the novichok to Salisbury from Moscow. The officers came to London on 2 March with a third agent, known as Sergey Fedotov, to kill Mr Skripal - a former Russian spy who worked as a double agent for the UK. In its report, the inquiry said Petrov and Boshirov had likely used this same bottle to apply the nerve agent to Mr Skripal's door before it was \"carelessly discarded\". Read more:Putin 'morally responsible' for Briton's deathSalisbury novichok poisonings: Seven questions to be answered Charlie Rowley, 52, found the bottle and gave it to Ms Sturgess, 44, who sprayed herself with its contents on 30 June 2018, and died just over a week later. Mr Skripal, 74, his daughter Yulia, 41, and Mr Rowley, 52, all survived, but were left seriously ill. Ambassador Kelin said the report had been timed to upset delicate peace talks over Ukraine. He said: \"By this I think the British government would like to derail talks that are very interesting and in a high stage.\" The ambassador said he was personally worried about the possibility of a wider conflict erupting from the war in Ukraine. Asked if there was a greater chance now of war between Europe and Russia than he had seen in his career, he answered there was. \"Yes, of course, listening to all these statements, about the need to prepare for the war, like our president has said, recently, two days ago that, we do not want to wage a war against Europe. \"But if Europe would like to wage a war against Russia, then we are prepared. Right now.\""
    },
    {
        "title": "Frank Gehry, one of the world's most innovative architects, dies aged 96",
        "description": "Frank Gehry, who won global acclaim for designing some of the world's most imaginative buildings has died aged 96.",
        "url": "https://news.sky.com/story/frank-gehry-one-of-the-worlds-most-innovative-architects-dies-aged-96-13479887",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-frank-gehry-architecture_7102255.jpg?20251205215721",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 21:08:00",
        "Headline": "His famous buildings include the Guggenheim Museum in Bilbao, Spain. Gehry won every major prize architecture.",
        "Content": "Frank Gehry, who won global acclaim for designing some of the world's most imaginative buildings has died aged 96. His triumphs included the Guggenheim Museum in Bilbao, Spain; the Walt Disney Concert Hall in Los Angeles and Berlin's DZ Bank Building. During his lifetime he was awarded every major prize architecture, including the field's top honour, the Pritzker Prize, for what was described as \"refreshingly original and totally American\" work. Gehry died at his home in Santa Monica following a short period of respiratory illness, Meaghan Lloyd, his chief of staff said. As a child he enjoyed art and constructing model cities, but Gehry said it was not until the age of twenty he considered having a career in architecture, after a college teacher identified his gift. \"It was like the first thing in my life that I'd done well in,\" he said. He went on to study architecture at the University of Southern California in 1954 where he later became a professor. He also taught at Yale and Columbia University. \n                  Giving up territory would be 'unjust peace', says Ukraine's armed forces chief\n                 \n                  Germany introduces controversial new military service law, with powers including needs-based conscription\n                 \n                  Donald Trump awarded FIFA peace prize at World Cup draw\n                 In 2005 Gehry appeared in an episode of The Simpsons cartoon series as himself, in which he agreed to design a concert hall that was later converted into a prison. He came up with the idea for the design, which looked a lot like the Disney Hall, after crumpling Marge Simpson's letter to him and throwing it on the ground. Read more:Former doctor charged over alleged sexual assaultsDuchess of Sussex 'reaches out' to estranged father After taking a look at it, he declared: \"Frank Gehry, you've done it again!\" He is survived by his wife, Berta; daughter, Brina; sons Alejandro and Samuel. Another daughter, Leslie Gehry Brenner, died of cancer in 2008."
    },
    {
        "title": "EU hands €120m fine to Elon Musk's X for breaking social media rules",
        "description": "Elon Musk's social media platform X, formerly Twitter, has been fined &#8364;120m (&#163;105m) by the EU after it found rule breaches had left users vulnerable to scams and manipulation.",
        "url": "https://news.sky.com/story/eu-hands-8364120m-fine-to-elon-musks-x-for-breaking-social-media-rules-13479732",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-x-elonmusk_6980438.jpg?20250802034931",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:01:00",
        "Headline": "The European Commission highlighted breaches including X's policy of allowing anyone to buy a verified blue checkmark.",
        "Content": "Elon Musk's social media platform X, formerly Twitter, has been fined €120m (£105m) by the EU after it found rule breaches had left users vulnerable to scams and manipulation. The European Commission started investigating X under the Digital Services Act (DSA) two years ago and has now issued its first non-compliance decision against the site. In a decision that could anger the US President Donald Trump the commission censured Elon Musk's platform for three different breaches of DSA transparency requirements. The Trump administration has previously criticised Brussels' digital regulations, saying that they target US tech companies and had vowed to retaliate. One of X's breaches highlighted by the EU concerned the \"deceptive design practices\" of the platform's blue checkmarks, which exposed users to scams and manipulation, regulators said. Before Mr Musk acquired the site for $44bn (£33bn) in 2022, the checkmarks indicated the accounts of notable users with verified identities. Under the tech billionaire's changes, however, the badge could be bought by anyone willing to pay $8 (£6) a month. \n                  Next week, one of the world's toughest social media bans will come into force\n                 \n                  More than 800,000 young children seeing social media content 'designed to hook adults', figures show\n                 \n                  Teenagers launch legal challenge over Australia's ban on social media for children\n                  The commission said, it was therefore \"difficult for users to judge the authenticity of accounts and content they engage with\". X also fell short of transparency requirements for its database of advertisements, regulators said. Read more:The X Effect: How Elon Musk is boosting the British rightElon Musk's $1trn pay package approved by Tesla In the EU, platforms are required to provide a database of all the digital ads they have carried, with details such as who paid for them and the intended audience. But the commission said X had created \"access barriers\" to its database, which lacked \"critical information\" and imposed \"excessive delays in processing, which undermine the purpose of ad repositories\". It also found X had failed to meet its DSA obligations to provide researchers with its public data, the commission said. The EU's executive vice-president for tech sovereignty, security and democracy, Henna Virkkunen, said: \"Deceiving users with blue checkmarks, obscuring information on ads and shutting out researchers have no place online in the EU. \"The DSA protects users. The DSA gives researchers the way to uncover potential threats. The DSA restores trust in the online environment. \"With the DSA's first non-compliance decision, we are holding X responsible for undermining users' rights and evading accountability.\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈 X now has 60 working days to inform the commission of how it will bring its blue checkmarks into compliance, and 90 days to address the other two breaches. The commission says it can impose \"periodic penalty payments\" on Musk's platform if it fails to comply."
    },
    {
        "title": "Convicted terrorist from Iraq jailed after entering UK illegally on a small boat",
        "description": "A convicted terrorist from Iraq who entered the UK illegally has been sentenced to more than two years in jail.",
        "url": "https://news.sky.com/story/convicted-terrorist-from-iraq-jailed-after-entering-uk-illegally-on-a-small-boat-13479772",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-small-boats-migrant_7030656.jpg?20250924180405",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:51:00",
        "Headline": "Rebwar Hamad was extradited to Italy from the UK after being convicted of terrorist offences there. He was investigated when he tried to re-enter Britain.",
        "Content": "A convicted terrorist from Iraq who entered the UK illegally has been sentenced to more than two years in jail. Rebwar Hamad, 48, from Iraq, arrived with other migrants on 19 September and later pleaded guilty to entering the country without valid entry clearance, the Crown Prosecution Service (CPS) has said. He was sentenced at Canterbury Crown Court on Friday to two years and three months in prison. Hamad originally came to the UK in 2001 and was granted indefinite leave to remain, the CPS said. In 2019, he was convicted in his absence in Italy of terrorism offences and extradited to the country the following year to serve his sentence. After his release, Hamad said he was told to leave Italy within a week. Read more from Sky News: Inside the operation to smuggle people across the ChannelUK looking at Denmark model to cut illegal migration He then applied for visa to come to the UK for a second time but his application was rejected, so he paid €1,200 (around £1,050) for a place on a small boat that was later intercepted off Dover, the CPS said. \n                  171 arrests in gig economy crackdown - with 60 delivery drivers to be deported\n                 \n                  France will soon be able to intercept suspected migrant taxi boats in the Channel\n                 \n                  More children to face deportation under government's asylum crackdown\n                 Peter Cockrill from the CPS said: \"Rebwar Hamad showed a blatant disregard for immigration rules by coming to the UK illegally for a second time and after serving a prison sentence for terrorism offences in Italy. \"The CPS argued in court that for these reasons he should receive the toughest sentence possible. \"The Crown Prosecution Service will continue to work tirelessly with law enforcement and international partners, including the Border Security Command, to disrupt people smuggling networks and bring those who profit from this exploitative trade to justice.\""
    },
    {
        "title": "Netflix agrees blockbuster $72bn deal for Warner Bros studios ",
        "description": "Netflix has agreed a $72bn (&#163;54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones.",
        "url": "https://news.sky.com/story/netflix-agrees-blockbuster-72bn-deal-for-warner-bros-studios-13479683",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-warner-bros-logo-film_7101743.jpg?20251205122842",
        "type": "World",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 11:09:00",
        "Headline": "The agreement means Warner Bros Discovery's library of film and TV successes including Harry Potter and Game Of Thrones will come under the same roof as Stranger Things and Squid Game.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Netflix has agreed a $72bn (£54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones. It had been reported that the US streaming giant was in exclusive talks over the deal following a bidding war for the assets. Paramount Skydance and Comcast, the ultimate owner of Sky News, were the rival suitors for the bulk of WBD that also includes HBO, the HBO Max streaming platform and DC Studios. Money latest: Budget airline launches six new routes While Netflix has agreed a $27.75 per share price with WBD, which equates to the $72bn purchase figure, the deal gives the assets a total value of $82.7bn. It will see WBD come under Netflix ownership once its remaining Discovery Global division, mostly legacy cable networks including CNN and the TNT sports channels, is separated. However, the agreement is set to attract scrutiny from competition regulators, particularly in the United States and Europe. \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 Both WBD and Netflix do not see the prospect of the deal being completed until late 2026 or 2027. The main stumbling block is likely to be the fact that Netflix, which has hits including Stranger Things and Squid Game, is already the world's biggest streaming service. Further drama could come in the form of a complaint by Paramount, which had previously made a bid for the whole company. CNBC reported this week that Paramount had claimed the auction process was biased in favour of Netflix. Entertainment news provider Variety has also reported that major studios fear an institutional crisis for Hollywood unless the move is blocked. Ted Sarandos, the co-chief executive of Netflix, said: \"By combining Warner Bros' incredible library of shows and movies - from timeless classics like Casablanca and Citizen Kane to modern favourites like Harry Potter and Friends - with our culture-defining titles like Stranger Things, KPop Demon Hunters and Squid Game, we'll be able to do that even better. \"Together, we can give audiences more of what they love and help define the next century of storytelling.\" Netflix shares were trading down more than 3% in pre-market deals but recovered much of that loss when Wall Street opened. Those for WBD were up by more than 2%.  David O'Hara, managing director at the advisory firm MKI Global Partners, said of the proposed deal: \"The 12-18 month timeline signals a long antitrust review, but despite the overlap between Netflix and HBO Max, there is a path to approval through possible HBO divestment. \"Netflix would not accept a $5.8bn break fee if it didn't see at least a small chance of the deal closing.\""
    },
    {
        "title": "Cloudflare: 'Large number of empty pages' on several websites after internet outage",
        "description": "Several websites, including Linkedin, Zoom and Canva, went down after new issues with internet provider Cloudflare.",
        "url": "https://news.sky.com/story/cloudflare-large-number-of-empty-pages-on-several-websites-after-internet-outage-13479620",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cloudflare-internet_7101702.jpg?20251205114031",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-05 09:32:00",
        "Headline": "The web infrastructure company said at around 9am that it was \"investigating issues with Cloudflare Dashboard\" after reports of \"a large number of empty pages\".",
        "Content": "Several websites, including Linkedin, Zoom and Canva, went down after new issues with internet provider Cloudflare. The web infrastructure company said at around 9am that it was \"investigating issues with Cloudflare Dashboard and related APIs (application programming interfaces)\" after reports of \"a large number of empty pages\". Shortly after the announcement, Cloudflare said it had implemented a fix and was monitoring to see if it had worked, but several websites remained blank throughout the morning. DownDetector, a site used to monitor online service issues, also went down as a result of the issue. When it came back online, it recorded more than 4,500 reports related to issues at Cloudflare. Cloudflare, which provides network and security services for many online businesses, claims that around a fifth of all websites use some form of its services. Issues also affected the company in November, when more than 10,000 people reported issues with outages for X, Spotify, ChatGPT, Facebook, AWS (Amazon Web Services), bet365, Canva, BrightHR and the multi-player game League of Legends - all of which use Cloudflare services. The company said in a server update at the time that it was \"experiencing an internal service degradation\" and that some services may be intermittently affected. \n                  EU hands €120m fine to Elon Musk's X for breaking social media rules\n                 \n                  Next week, one of the world's toughest social media bans will come into force\n                 \n                  Major city may have to evacuate as water supplies run low\n                 Read more from Sky News:Apple's AI chief steps down as company falls behind in tech raceWhistleblowers say hundreds of UK moderators have left TikTok That came after a major outage affected thousands of websites in October, as a result of issues originating from AWS. And last year, more than eight million computers crashed worldwide - knocking Sky News off the air and causing significant backlogs for GPs - after a software update from cyber security company CrowdStrike went wrong. In response to Friday's outage, Jake Moore, global cybersecurity adviser at internet security company ESET, said: \"If a major provider like Cloudflare goes down for any reason, thousands of websites instantly become unreachable. \"The problems often lie with the fact we are using an old network to direct internet users around the world to websites, but it simply highlights there is one huge single point of failure in this legacy design.\""
    },
    {
        "title": "Donald Trump awarded FIFA peace prize at World Cup draw",
        "description": "US President Donald Trump has been awarded FIFA's new peace prize at the draw for next year's World Cup.",
        "url": "https://news.sky.com/story/donald-trump-awarded-fifa-peace-prize-at-world-cup-draw-13479828",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-fifa_7102102.jpg?20251205174647",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-05 17:40:00",
        "Headline": "World football's governing body, which announced the annual award last month, said it would be given to \"individuals who have taken exceptional and extraordinary actions for peace\".",
        "Content": "US President Donald Trump has been awarded FIFA's new peace prize at the draw for next year's World Cup. FIFA President Gianni Infantino presented Mr Trump with a large golden trophy - formed of hands holding the earth - and a gold medal, which he wore around his neck. The certificate, which Mr Infantino handed over at Washington DC's Kennedy Center on Friday, recognises the US president for his actions to \"promote peace and unity around the world\". World football's governing body, which announced the annual award last month, said it would be given to \"individuals who have taken exceptional and extraordinary actions for peace\". World Cup draw latest: Home nations and Republic of Ireland await fate Mr Trump said it was \"truly one of the greatest honours of my life\". He said: \"We saved millions and millions of lives. The Congo is an example - over 10 million people killed. It was heading for another 10 million very quickly.\" He also pointed to India and Pakistan, saying, \"so many wars that we were able to end, in some cases a little before they started\". Ahead of the draw, Mr Trump told reporters he did not care about the prize, but noted that he had \"settled eight wars\" in nearly 11 months in office. The United States, along with Canada and Mexico, will host the tournament in 2026.Mr Infantino, who has built up a strong relationship with the US president, backed him for the Nobel Peace Prize earlier this year. Read more from Sky News:Netflix agrees blockbuster $72bn deal for Warner Bros studiosSeveral sites go down after Cloudfare outage \"This is what we want from a leader - a leader that cares about the people,\" Mr Infantino said of Mr Trump. The FIFA leader said to Mr Trump, \"this is your prize, this is your peace prize\". Mr Trump thanked his family, including his wife, first lady Melania Trump, and praised the leaders of the other two host nations - Canadian Prime Minister Mark Carney and Mexican President Claudia Sheinbaum - in his brief remarks. Mr Infantino has often spoken about football as a unifier for the world, but the prize is a departure from the federation's traditional focus on sport. FIFA has described the prize as one that rewards \"individuals who have taken exceptional and extraordinary actions for peace, and by doing so have united people across the world\". The award comes during a week where Mr Trump's administration has been under scrutiny for lethal strikes on alleged drug boats in the Caribbean and as Mr Trump hardens his rhetoric against immigrants. The Nobel Peace Prize this year was eventually awarded to Venezuelan opposition leader Maria Corina Machado, who said shortly after receiving the prize that she was dedicating it in part to Mr Trump for \"his decisive support of our cause\"."
    },
    {
        "title": "Netflix agrees blockbuster $72bn deal for Warner Bros studios ",
        "description": "Netflix has agreed a $72bn (&#163;54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones.",
        "url": "https://news.sky.com/story/netflix-agrees-blockbuster-72bn-deal-for-warner-bros-studios-13479683",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-warner-bros-logo-film_7101743.jpg?20251205122842",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 11:09:00",
        "Headline": "The agreement means Warner Bros Discovery's library of film and TV successes including Harry Potter and Game Of Thrones will come under the same roof as Stranger Things and Squid Game.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Netflix has agreed a $72bn (£54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones. It had been reported that the US streaming giant was in exclusive talks over the deal following a bidding war for the assets. Paramount Skydance and Comcast, the ultimate owner of Sky News, were the rival suitors for the bulk of WBD that also includes HBO, the HBO Max streaming platform and DC Studios. Money latest: Budget airline launches six new routes While Netflix has agreed a $27.75 per share price with WBD, which equates to the $72bn purchase figure, the deal gives the assets a total value of $82.7bn. It will see WBD come under Netflix ownership once its remaining Discovery Global division, mostly legacy cable networks including CNN and the TNT sports channels, is separated. However, the agreement is set to attract scrutiny from competition regulators, particularly in the United States and Europe. \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 Both WBD and Netflix do not see the prospect of the deal being completed until late 2026 or 2027. The main stumbling block is likely to be the fact that Netflix, which has hits including Stranger Things and Squid Game, is already the world's biggest streaming service. Further drama could come in the form of a complaint by Paramount, which had previously made a bid for the whole company. CNBC reported this week that Paramount had claimed the auction process was biased in favour of Netflix. Entertainment news provider Variety has also reported that major studios fear an institutional crisis for Hollywood unless the move is blocked. Ted Sarandos, the co-chief executive of Netflix, said: \"By combining Warner Bros' incredible library of shows and movies - from timeless classics like Casablanca and Citizen Kane to modern favourites like Harry Potter and Friends - with our culture-defining titles like Stranger Things, KPop Demon Hunters and Squid Game, we'll be able to do that even better. \"Together, we can give audiences more of what they love and help define the next century of storytelling.\" Netflix shares were trading down more than 3% in pre-market deals but recovered much of that loss when Wall Street opened. Those for WBD were up by more than 2%.  David O'Hara, managing director at the advisory firm MKI Global Partners, said of the proposed deal: \"The 12-18 month timeline signals a long antitrust review, but despite the overlap between Netflix and HBO Max, there is a path to approval through possible HBO divestment. \"Netflix would not accept a $5.8bn break fee if it didn't see at least a small chance of the deal closing.\""
    },
    {
        "title": "Netflix flexes its muscles and could yet get its way in Trump's America",
        "description": "Netflix&#8217;s $72bn takeover of Warner Brothers is a blockbuster in every sense.",
        "url": "https://news.sky.com/story/netflix-flexes-its-muscles-and-could-yet-get-its-way-in-trumps-america-13479731",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-blog-youtube_7001804.jpg?20250826150202",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-05 13:51:00",
        "Headline": "Sky's Paul Kelso says this blockbuster deal reflects a fundamental change in the way we consume entertainment and it's no wonder that Hollywood is frightened.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Netflix’s $72bn takeover of Warner Brothers is a blockbuster in every sense. It is less than 30 years since Reed Hastings and Marc Randolph began their mail order DVD rental business, barely 20 since Netflix began streaming content online, and just over a decade since its first wave of original content, including House Of Cards. Yet, if approved, this deal will see the upstart swallow one of the giants of Hollywood's Golden Era. Warner Brothers, the studio that made Casablanca, finds itself a subplot in the dramatic transformation of 21st-century entertainment, working title: The Triumph Of The Streamers. Money latest: Budget airline launches six new routes The deal will bring together Netflix's existing content, technology, and a subscription base of more than 300 million people generating close to $40bn of annual revenue, with Warner's deep library of beloved movies and TV shows, and the studios and production capacity to make more of the same. As well as a movie catalogue that includes the Harry Potter and DC Universe franchises, Netflix is buying HBO, the standout television production house responsible for The Sopranos, Game Of Thrones and Succession, and its streaming service HBO Max, due to launch in the UK next spring. Netflix will hope HBO can add creative depth to a portfolio which churns out remarkable volume and has triumphed in the teen market with hits such as Stranger Things. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 The tie-up will give Netflix extraordinary muscle in the entertainment industry, bringing together the first and third-largest streaming service in the US, and two of the largest creators of original content. Little wonder that the creative branch of Hollywood has enormous misgivings. In a letter to industry bible Variety, leading industry producers and directors, writing anonymously for fear of repercussions, have warned of an \"institutional crisis\" for Hollywood. They may be fighting yesterday's battles. This deal reflects a fundamental change in the way we consume entertainment. The in-person event of going to the cinema still has its place but, like linear television it has been usurped by the convenience and mind-boggling choice offered online. Legacy studios and broadcasters have in turn found themselves trying to compete not just with Netflix, but the financial might of Amazon and Apple. In that environment size matters, leaving even Warner Brothers to conclude they were not big enough to fight alone. The deal may yet be challenged. Netflix defeated Comcast, owners of Universal Studios and Sky, and Paramount Skydance, in a three-way bidding war, and CNBC reports that Paramount, backed by Larry Ellison's billions, may complain about the process. US regulators will inevitably scrutinise the deal, though quite where regulatory power lies in Donald Trump's America is moot, given his willingness to leverage presidential influence over major deals."
    },
    {
        "title": "Four killed in latest US strike on alleged drug boat",
        "description": "Four people have been killed in the latest US strike on an alleged drug boat amid growing unease at the legality of the attacks.",
        "url": "https://news.sky.com/story/four-killed-in-latest-us-strike-on-alleged-drug-boat-13479594",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-narcotics-narco-drug_7101498.jpg?20251205081347",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-05 07:58:00",
        "Headline": "At least 87 people have been killed during President Trump's \"war\" with drug cartels, after the attack on the vessel in the eastern Pacific Ocean.",
        "Content": " Four people have been killed in the latest US strike on an alleged drug boat amid growing unease at the legality of the attacks. The small vessel, which was hit in the eastern Pacific Ocean on Thursday, is the 22nd destroyed by the US military on suspicion of drug trafficking. It is the first such attack after a pause of nearly three weeks. At least 87 people have now been killed during Donald Trump's \"war\" with drug cartels, which has also seen vessels targeted in the Caribbean Sea, including near Venezuela. Video of the strike shows a small boat moving across the water before it is suddenly hit by a large explosion. The boat is then seen engulfed in flames and billowing smoke as the camera zooms out. On X, formerly known as Twitter, US Southern Command described those killed as \"four male narco-terrorists\". \n                  Donald Trump awarded FIFA peace prize at World Cup draw\n                 \n                  Giving up territory would be 'unjust peace', says Ukraine's armed forces chief\n                 \n                  Is Trump's latest peace deal a total sham?\n                 \"Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the Eastern Pacific,\" the post said. The Trump administration has been weighing options to combat what it has portrayed as Venezuelan President Nicolas Maduro's role in supplying illegal drugs that have killed Americans. The socialist leader has denied having any links to the illegal drug trade. Venezuela has said the boat attacks amount to murder - and that President Trump's true motivation is to oust Mr Maduro and access its oil. It comes as an investigation in Washington DC has started looking into the very first strike on an alleged drug boat on 2 September in international waters near Venezuela. On that occasion, US navy admiral Frank \"Mitch\" Bradley is accused of ordering a follow-up strike to kill the survivors. This reportedly followed demands from defence secretary Pete Hegseth that the navy \"kill them all\". The admiral briefed politicians in a series of closed-door briefings at the US Capitol on Thursday, and denied there was any such order from Mr Hegseth. Mr Hegseth said the admiral \"made the correct decision to ultimately sink the boat and eliminate the threat\". But speaking on Air Force One last Sunday, the president said he was unaware of the second strike and would not have wanted it, though he backed Mr Hegseth. Read more:Hegseth blames 'fog of war' for second strike on 'drug boat'UK stops some intelligence sharing with US over 'drug boat' strikes A video of the 2 September strike, which killed 11 people, has been shown to politicians, but accounts of its contents split along party lines. Republican Senator Tom Cotton of Arkansas said the survivors were \"trying to flip a boat loaded with drugs bound for United States back over so they could stay in the fight\". His party colleague, representative Rick Crawford of Arkansas, issued a statement saying the strikes were legal. But representative Jim Himes of Connecticut, the top Democrat on the House Intelligence Committee, said: \"What I saw in that room was one of the most troubling things I've seen in my time in public service. \"You have two individuals in clear distress, without any means of locomotion, with a destroyed vessel.\" They \"were killed by the United States\", he said. Representative Adam Smith of Washington, the top Democrat on the House Armed Services Committee, echoed his account. He said the survivors were \"basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water - until the missiles come and kill them\". Likewise, Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, said he was \"deeply disturbed\" by the video, and called for it to be made public. \"This briefing confirmed my worst fears about the nature of the Trump Administration's military activities,\" he said in a statement. 👉 Tap here to follow Trump100 wherever you get your podcasts👈 Even if the campaign against the suspected drug-trafficking boats had been authorised by Congress, ex-military lawyers said the strike against survivors would be a war crime if the military knowingly killed survivors. Attacks on combatants who are incapacitated, unconscious or shipwrecked are forbidden by the defence department's law of war manual - provided the survivors abstain from hostilities and do not attempt to escape. Firing upon shipwreck survivors is cited as an example of a \"clearly illegal\" order that should be refused."
    },
    {
        "title": "Releasing Epstein files could jeopardise my appeal, claims Ghislaine Maxwell",
        "description": "Releasing the Epstein files would harm Ghislaine Maxwell's bid for a retrial, her lawyers have claimed.",
        "url": "https://news.sky.com/story/releasing-epstein-files-could-jeopardise-my-appeal-claims-ghislaine-maxwell-13479622",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ghislaine-maxwell-mugshot_7083787.jpg?20251117081034",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-05 09:32:00",
        "Headline": "A court filing from her lawyers argues releasing the documents would \"prejudice\" her chances of a \"fair retrial\" should her request for one succeed.",
        "Content": "Releasing the Epstein files would harm Ghislaine Maxwell's bid for a retrial, her lawyers have claimed. Maxwell, a disgraced British socialite and ex-girlfriend of the convicted paedophile Jeffrey Epstein, is serving a 20-year sentence for sex trafficking. The US Department of Justice has until mid-December to release thousands of documents linked to civil and criminal cases involving Epstein. Donald Trump previously opposed the move, but changed his mind last month after US Congress overwhelmingly voted in favour. After weeks of attacking Democrats and Republicans for calling for the release of the files, the US president eventually signed the Epstein Transparency Act on 20 November. A court document filed by Maxwell's lawyers to a New York district court on Wednesday, and seen by Sky News, shows they are planning to file a petition calling for a retrial. Addressed to Southern District Judge Paul A Engelmayer, her lawyers say Maxwell \"does not take a position regarding the government's request to unseal the grand jury transcripts and modify the protective order\" sealing them.  The grand jury transcripts refer to materials on Epstein in Florida in 2005 and 2007, which a judge denied releasing in July. However, Maxwell's lawyers argue the release of grand jury files from her case would \"foreclose the possibility of a fair\" hearing. \"Ms Maxwell respectfully notes that shortly she will be filing a habeas petition pro se [for herself],\" her lawyers say in the court filing. \"Releasing the grand jury materials from her case, which contain untested and unproven allegations, would create undue prejudice so severe that it would foreclose the possibility of a fair retrial should Ms Maxwell's habeas petition succeed.\" According to the US Congress's website, a habeas corpus petition is a procedure where \"a federal court may review the legality of an individual's incarceration\". Essentially, it is a challenge to determine whether a court proceeding was fair and lawful.  Roughly translated from Latin, the phrase means \"you should have the body\" - interpreted as so that a person must be able to appear before a court so that a judge can assess if that person has been lawfully detained. It's mentioned in Article One of the US Constitution and cannot be suspended, \"unless when in cases of rebellion or invasion the public safety may require it\". Earlier this year, however, White House deputy chief of staff Stephen Miller said Mr Trump is \"actively looking at\" suspending the principle in order to make it easier to detain and deport immigrants. Maxwell was jailed in 2022 for sex trafficking after recruiting young girls for Epstein during the 1990s and early 2000s. Epstein died by suicide while awaiting trial on sex trafficking charges in 2019. Read more from Sky News:Analysis: Trump may get the one thing he craves todayMajor city may have to evacuate as water supplies run low  In October, the US Supreme Court rejected Maxwell's attempts to appeal against her sentence. That means a presidential pardon from Mr Trump is now her best shot at being freed before her projected release date in 2037. Sky's US partner NBC News reported in November that according to a whistleblower - Maxwell, 63, was planning to ask the US president to commute her sentence. Mr Trump said in August \"nobody has asked\" him to pardon Maxwell, but said he had \"the right to do it\". This week, images and video of Epstein's private Caribbean island were released by politicians in the US.  Democrats on the House Oversight Committee said they were \"a harrowing look behind Epstein's closed doors\". \"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes,\" Representative Robert Garcia said. The images were from Little Saint James, part of the US Virgin Islands, where the disgraced financier is believed to have abused underage girls.  "
    },
    {
        "title": "Is Trump's latest peace deal a total sham?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160;",
        "url": "https://news.sky.com/story/is-trumps-latest-peace-deal-a-total-sham-13479545",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-05 04:32:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    The leaders of Rwanda and the Democratic Republic of the Congo come to Washington DC to sign a peace deal. They don't look at each other, don't shake hands, and all the while fighting carries on in eastern Congo. Is this all just business masquerading as peace? Plus - a report shows defence secretary Pete Hegseth (now styled as war secretary) risked endangering the lives of servicemen and women by texting operational details on his personal and non-secure phone. How much pressure is he now under? Martha reports from California and a town nicknamed \"Little Kabul\", where Afghan immigrants are now in the crosshairs of Donald Trump's anti-immigration push. And the FIFA World Cup draw is here. But as the president continues to threaten to move matches away from Democratic-run cities, how politicised has this global football event become? You can also watch all episodes on our YouTube channel. You can watch Martha's piece from Fremont here: Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Ed Bambas: 88-year-old veteran who worked full-time at supermarket given £1.2m to help him retire ",
        "description": "An 88-year-old US army veteran who works full time at a grocery store to make ends meet will receive over $1.7m (&#163;1.2m) to help him retire.",
        "url": "https://news.sky.com/story/ed-bambas-88-year-old-veteran-who-worked-full-time-at-supermarket-given-16312m-to-help-him-retire-13479543",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-insta-bambas_7101391.jpg?20251205045326",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-05 04:19:00",
        "Headline": "Ed Bambas looked after his sick wife for almost 10 years and rising medical bills after she died forced him back into full-time work.",
        "Content": "An 88-year-old US army veteran who works full time at a grocery store to make ends meet will receive over $1.7m (£1.2m) to help him retire. Ed Bambas went viral after Australian influencer Samuel Weidenhofer shared a video of Bambas opening up about his financial struggles on social media. In the video, which has received over 269,000 likes on Facebook, Bambas explains how he retired from General Motors in 1999, but lost his pension in 2012 after the company went bankrupt. He also lost his healthcare coverage - just as his wife was sick. She died seven years ago. Bambas was left with just $10,000 (£7,500) of his life insurance. He tears up as he says: \"So I sold my house, sold the property I had, we made it through.\" Weidenhofer, who uses his platform to help raise money for people in need, set up a GoFundMe page after speaking with Bambas. His son Michael said he didn't know his dad had gone viral until he received messages from friends and family. Speaking to Sky's sister company, NBC News, Michael said that his dad had lost himself after his mother's death. \"Right after my mum passed away, I'd go over to the house and I'd find him basically walking around in circles, not knowing what to do with himself.\" He added that: \"He took care of my mum for almost 10 years as her primary caretaker.\" Michael explained that his dad started looking for work due to mounting medical bills and that he had been working eight-hour shifts, five days a week, for five years. Read more from Sky News:Trump pardons Democrat congressman charged in bribery caseWhite House Christmas decorations revealed Meijer, the Michigan grocery store where Ed Bambas works, said he was a valued team member who connects with customers and adds joy and warmth to the store. The store said it would offer additional support to Bambas considering recent events. Weidenhofer says he plans to present Bambas with the money at a ceremony later today. His son said the money raised means his dad can \"start living and doing things for himself.\" \"I don't know how to thank everyone for what they're doing for my dad. It's just amazing.\""
    },
    {
        "title": "Netflix agrees blockbuster $72bn deal for Warner Bros studios ",
        "description": "Netflix has agreed a $72bn (&#163;54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones.",
        "url": "https://news.sky.com/story/netflix-agrees-blockbuster-72bn-deal-for-warner-bros-studios-13479683",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-warner-bros-logo-film_7101743.jpg?20251205122842",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 11:09:00",
        "Headline": "The agreement means Warner Bros Discovery's library of film and TV successes including Harry Potter and Game Of Thrones will come under the same roof as Stranger Things and Squid Game.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Netflix has agreed a $72bn (£54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones. It had been reported that the US streaming giant was in exclusive talks over the deal following a bidding war for the assets. Paramount Skydance and Comcast, the ultimate owner of Sky News, were the rival suitors for the bulk of WBD that also includes HBO, the HBO Max streaming platform and DC Studios. Money latest: Budget airline launches six new routes While Netflix has agreed a $27.75 per share price with WBD, which equates to the $72bn purchase figure, the deal gives the assets a total value of $82.7bn. It will see WBD come under Netflix ownership once its remaining Discovery Global division, mostly legacy cable networks including CNN and the TNT sports channels, is separated. However, the agreement is set to attract scrutiny from competition regulators, particularly in the United States and Europe. \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 Both WBD and Netflix do not see the prospect of the deal being completed until late 2026 or 2027. The main stumbling block is likely to be the fact that Netflix, which has hits including Stranger Things and Squid Game, is already the world's biggest streaming service. Further drama could come in the form of a complaint by Paramount, which had previously made a bid for the whole company. CNBC reported this week that Paramount had claimed the auction process was biased in favour of Netflix. Entertainment news provider Variety has also reported that major studios fear an institutional crisis for Hollywood unless the move is blocked. Ted Sarandos, the co-chief executive of Netflix, said: \"By combining Warner Bros' incredible library of shows and movies - from timeless classics like Casablanca and Citizen Kane to modern favourites like Harry Potter and Friends - with our culture-defining titles like Stranger Things, KPop Demon Hunters and Squid Game, we'll be able to do that even better. \"Together, we can give audiences more of what they love and help define the next century of storytelling.\" Netflix shares were trading down more than 3% in pre-market deals but recovered much of that loss when Wall Street opened. Those for WBD were up by more than 2%.  David O'Hara, managing director at the advisory firm MKI Global Partners, said of the proposed deal: \"The 12-18 month timeline signals a long antitrust review, but despite the overlap between Netflix and HBO Max, there is a path to approval through possible HBO divestment. \"Netflix would not accept a $5.8bn break fee if it didn't see at least a small chance of the deal closing.\""
    },
    {
        "title": "Netflix flexes its muscles and could yet get its way in Trump's America",
        "description": "Netflix&#8217;s $72bn takeover of Warner Brothers is a blockbuster in every sense.",
        "url": "https://news.sky.com/story/netflix-flexes-its-muscles-and-could-yet-get-its-way-in-trumps-america-13479731",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-blog-youtube_7001804.jpg?20250826150202",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-05 13:51:00",
        "Headline": "Sky's Paul Kelso says this blockbuster deal reflects a fundamental change in the way we consume entertainment and it's no wonder that Hollywood is frightened.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Netflix’s $72bn takeover of Warner Brothers is a blockbuster in every sense. It is less than 30 years since Reed Hastings and Marc Randolph began their mail order DVD rental business, barely 20 since Netflix began streaming content online, and just over a decade since its first wave of original content, including House Of Cards. Yet, if approved, this deal will see the upstart swallow one of the giants of Hollywood's Golden Era. Warner Brothers, the studio that made Casablanca, finds itself a subplot in the dramatic transformation of 21st-century entertainment, working title: The Triumph Of The Streamers. Money latest: Budget airline launches six new routes The deal will bring together Netflix's existing content, technology, and a subscription base of more than 300 million people generating close to $40bn of annual revenue, with Warner's deep library of beloved movies and TV shows, and the studios and production capacity to make more of the same. As well as a movie catalogue that includes the Harry Potter and DC Universe franchises, Netflix is buying HBO, the standout television production house responsible for The Sopranos, Game Of Thrones and Succession, and its streaming service HBO Max, due to launch in the UK next spring. Netflix will hope HBO can add creative depth to a portfolio which churns out remarkable volume and has triumphed in the teen market with hits such as Stranger Things. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 The tie-up will give Netflix extraordinary muscle in the entertainment industry, bringing together the first and third-largest streaming service in the US, and two of the largest creators of original content. Little wonder that the creative branch of Hollywood has enormous misgivings. In a letter to industry bible Variety, leading industry producers and directors, writing anonymously for fear of repercussions, have warned of an \"institutional crisis\" for Hollywood. They may be fighting yesterday's battles. This deal reflects a fundamental change in the way we consume entertainment. The in-person event of going to the cinema still has its place but, like linear television it has been usurped by the convenience and mind-boggling choice offered online. Legacy studios and broadcasters have in turn found themselves trying to compete not just with Netflix, but the financial might of Amazon and Apple. In that environment size matters, leaving even Warner Brothers to conclude they were not big enough to fight alone. The deal may yet be challenged. Netflix defeated Comcast, owners of Universal Studios and Sky, and Paramount Skydance, in a three-way bidding war, and CNBC reports that Paramount, backed by Larry Ellison's billions, may complain about the process. US regulators will inevitably scrutinise the deal, though quite where regulatory power lies in Donald Trump's America is moot, given his willingness to leverage presidential influence over major deals."
    },
    {
        "title": "Oil prices are down but fuel prices aren't - here's why",
        "description": "It's a debate that has raged since the end of the COVID pandemic but, despite regulatory scrutiny, it's fair to say there's been no clear answer to accusations that UK drivers pay over the odds for fuel.",
        "url": "https://news.sky.com/story/oil-prices-are-down-but-petrol-prices-are-clearly-not-whats-going-on-and-will-it-get-better-13478646",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-diesel-fuel-knutsford_5770354.jpg?20220513112143",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 03:08:00",
        "Headline": "Sky's James Sillars explains the issues as retailers continue to push back against claims of profiteering - with some justification.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n It's a debate that has raged since the end of the COVID pandemic but, despite regulatory scrutiny, it's fair to say there's been no clear answer to accusations that UK drivers pay over the odds for fuel. What was once a promotional loss leader for supermarkets desperate for drivers to fill their car boots with groceries, unleaded and diesel costs have been unusually high for years. Fuel retailers say there is a simple explanation: rising costs being passed on to motorists. But critics argue there is a reason why the Competition and Markets Authority (CMA) has consistently found that we're paying more than we should be - and that the disparity between wholesale costs and pump prices has got worse in recent months. So: who's right? What the oil data tells us Oil prices are well down on levels seen in January (between $75 and $82 a barrel) but fuel prices are clearly not. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Poundland reveals more store closures - here's the full list\n                 As the chart shows, petrol and diesel have been largely on the rise since mid-June when Brent crude hit $78 per barrel. Despite a couple of wobbles, oil costs have dipped sharply since, to a range of $62 to $64 per barrel and yet drivers are currently, on average, paying £1.37 a litre for petrol and £1.46 for diesel. Compare those fuel costs to average pump prices in January, for example, (£1.39 for petrol and £1.45 for diesel) and a disparity is notable. Prices can be affected by all sorts of factors including the value of the pound versus the oil-priced dollar and squeezes in supply of refined products on global markets. It all makes for a complicated supply chain.  There is another, emerging, factor to consider It might surprise you to learn that the UK now has only four operational refineries to produce petrol and diesel after two major sites shut this year. The decline has sparked an industry warning of a crisis due to high UK carbon charges, imposed by the government, that have made domestic fuel producers uncompetitive versus imports. The loss of the refinery at Grangemouth this spring has been particularly acute as it left Scotland without domestic production and at the mercy of a more complicated and expensive delivery structure. Fuel retailers say the impact has been minimal so far, mainly due to remaining UK refineries raising production.  The case for the prosecution Quite simply, fuel price campaigners and motoring groups have long accused the industry of raising its profit margins. Supermarkets focused price investment elsewhere as the cost of living crisis took hold but the days of Asda (before it was bought by the fuel-focused Issa brothers and private equity) leading a sector-wide fuel price war are long gone. Reports by both the AA and RAC this week highlight price spikes despite a 5p slump in wholesale costs a fortnight ago. This chart shows how the prices paid by retailers compare to pump costs this year, though wholesale costs could lag those on forecourts by a few days. The AA said of the November movement: \"At the height of the spike, it matched what had been seen in mid June. Then, the petrol pump average reached a maximum of 135.8p by late July. It said that government data had since shown pump prices at levels not seen since March. The body questioned the reasons behind that disparity and also pointed towards, what it called, a postcode lottery for pump costs with gaps of up to 9p a litre between towns only 10 miles apart. The RAC declared on Thursday that pump prices rose at their fastest pace in 18 months during November, with diesel at a 15-month high. The critics have also included regulators as monitoring of fuel retailers by the CMA since its original market study has consistently found that drivers have been excessively charged.  What's the fuel industry's position? It pleads \"not guilty\". The bodies representing retailers make the point that the CMA and its wider critics fail to take into account huge rises in costs they have faced over the past four years - costs which are being/have been passed on across the economy. These include those for energy, business rates, minimum wage, employer national insurance costs and record sums arising from forecourt crime. The Petrol Retailers' Association (PRA), which represents the majority of forecourts, told Sky News that average margins across the sector are the same today as they were a year ago at between 3% to 4% after costs. It suggests no fuel for the fire surrounding those profiteering allegations but that rising costs have been passed on in full. What has the regulator done? The CMA's road fuel market study committed to monitor the market and recommended a compulsory fuel finder scheme to help bolster competition. That was two-and-a-half years ago. Limited data has been widely available via motoring apps ahead of the start of the official scheme, expected in spring next year, which will bring real-time pricing into a driver's view for the first time. The CMA hopes that by forcing each retailer to divulge their prices in real time, customers will vote with their feet. In the regulator's defence The CMA could argue that government has dragged its heels in implementing its fuel finder recommendation. While the Conservatives accepted it, Labour is now pushing it through parliament. The regulator can only act within the powers it has been given. It would say that it can't threaten or hand out fines until its recommendations are in play and they have been clearly flouted.  So who's right? This is a debate all about transparency but we clearly don't have a full view on the complicated, and shifting, supply chain which can influence pump prices. The CMA hopes that postcode lotteries for pump costs will ease once more drivers are aware of the ability to compare and shop around. But the main reason why this issue remains unresolved is that the CMA's findings have been incomplete to date. Its determinations that pump costs have been excessive have all been made without taking retailers' operating costs into full account. Why we are closer to an answer The CMA's next market update is expected within weeks and will, for the first time, take more extensive cost data into account. A spokesperson told Sky News: \"We recommended the Fuel Finder scheme to help drivers avoid paying more than they should at the pump, and the government intends to launch it by spring 2026. \"The scheme will give drivers real-time price information, helping them find the cheapest fuel and putting pressure on retailers to compete. \"We looked closely at operating costs during our review of the market, and they formed a key part of our final report in 2023. \"As we confirmed in June, we've been examining claims that these costs have risen and will set out our assessment in our annual report later this month.\" The hope must be that both sides involved can accept the report's findings for the first time, to bring this bitter debate to an end once and for all.\""
    },
    {
        "title": "Poundland reveals more store closures - here's the full list",
        "description": "Discount retailer Poundland has revealed another wave of store closures over the winter as part of turnaround efforts by the new owners.",
        "url": "https://news.sky.com/story/poundland-reveals-more-store-closures-is-yours-affected-13479697",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-money-poundland_6944222.jpg?20250617113739",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-05 12:06:00",
        "Headline": "In February, a further 14 stores will close down as part of a restructuring programme. By early next year, the budget chain will have shut more than 100 stores.",
        "Content": "Discount retailer Poundland has revealed another wave of store closures over the winter as part of turnaround efforts by the new owners. A further 14 stores will close down by early February, on top of the 19 already set to shut down over the coming months. By early next year, the budget chain will have shut more than 100 stores after it kicked off a restructuring programme. In those stores set to close, clearance sales with reductions of up to 40% have been launched on a wide range of stock. Money latest: Is property still a good investment? Poundland has previously announced another 40 shops that were clearing out goods ahead of closure. This was in addition to the 57 that had already shut by the end of September as a result of Poundland targeting its least profitable shops. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 It expects the UK chain to have reduced from around 800 shops at the start of the restructuring programme, to between 650 and 700 once the process is complete. Poundland was sold for £1 to investment firm Gordon Brothers in June. The company avoided entering administration after a restructuring plan was approved in the High Court in August - days before the company was due to run out of money. Recovery efforts have since focused on simplifying the business, including cutting stores and by returning to a £1, £2 and £3 grocery pricing structure across all UK shops. Read more from Sky News:Modella continues high street spree with WynsorsIT issue affects flights at Edinburgh Airport Darren MacDonald, Poundland's UK country manager, said the company knows \"how disappointing it is when we leave a store, but before we close our doors for a final time, we're determined to say goodbye by offering even more amazing value to customers\". \"The special reductions, on top of the value we provide in every store, will help us leave locations we're leaving with pride,\" he added. \"And when we close our doors, we look forward to welcoming customers to one of the hundreds of Poundland stores we'll continue to operate right across the UK.\" List of latest Poundland store closures, and when: • Lancaster, Lancashire - 19 December• Northampton Sixfields, Northamptonshire - 31 December• Weston-Super-Mare, Somerset - 24 December• Hammersmith, Greater London - 24 December• Prestatyn, Denbighshire - 31 December• Faversham, Kent - 6 January• Liverpool, Merseyside - 15 January• Yeovil, Somerset - 16 January• Nottingham Eastpoint, Nottinghamshire - 22 January• Lymington, Hampshire - 23 January• Christchurch (47 High Street), Dorset - 23 January• Bristol Avon Meads, Bristol - 29 January• Winton, Dorset - 6 February• Coatbridge, North Lanarkshire, Scotland - 8 February List of stores still set to close, and when: • Christchurch (Meteor Retail Park), Dorset - 5 December• Arnold, Nottinghamshire - 6 December• Worthing, West Sussex - 6 December• Droitwich, Worcestershire - 9 December• Ballymena, County Antrim, Northern Ireland - 13 December• Oldham, Greater Manchester - 13 December• Weston Favell, Northamptonshire - 19 December• Portishead, Somerset - 24 December• Grantham, Lincolnshire - 24 December• Portadown, County Armagh, Northern Ireland - 31 December• Farnham, Surrey - 31 December• Brighton, East Sussex - 31 December• Hempstead Valley, Kent - 31 December• Bexhill, East Sussex - 5 January• Ponders End, Greater London - 5 January• Kilmarnock, East Ayrshire, Scotland - 5 January• Mitcham, Greater London - 14 January• Cameron Toll, Edinburgh, Scotland - 20 January"
    },
    {
        "title": "Jamie Oliver revives high street Italian restaurant chain, six years after collapse",
        "description": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses.",
        "url": "https://news.sky.com/story/jamie-oliver-revives-high-street-italian-restaurant-chain-six-years-after-collapse-13479723",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jamies-italian-chef-jamie-oliver_7101816.jpg?20251205134306",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-05 13:30:00",
        "Headline": "Oliver will start with a Jamie's Italian in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs Prezzo, another chain of Italian restaurants.",
        "Content": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses. The TV chef will start by opening a restaurant in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs another Italian eatery chain, Prezzo. Oliver, 50, has presented a host of TV shows since first appearing on screen in The Naked Chef in 1999 and has written more than two dozen cookery books. He said the relaunch carried risk and opportunity, as \"in theory it's not the easiest time to return but conversely, I think it's the perfect time\". \"I believe the mid-market needs excitement, surprise and delight and that's exactly what I am planning on delivering,\" he said. \"I will drive the menus, make sure the sourcing is right, the staff training, and ensure the look and feel of the restaurant is brought to life in the right way.\" Jamie's Italian was launched in 2008 in Oxford after Oliver went into partnership with his Italian mentor, chef Gennaro Contaldo. The chain eventually grew to around 40 sites. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 \n                  Israel allowed to take part in Eurovision 2026 - as several countries withdraw\n                 But it went into administration in 2019, leading to the closure of its remaining UK sites and hundreds of job losses. The chain continued to operate overseas and has more than 30 restaurants in 25 countries. Brava will relaunch the brand in the UK. Read more on Sky News:Scarlett was groomed from 14Ex-doctor charged over alleged sex assaults Ed Loftus, global director of Jamie Oliver Restaurants, called it an \"exciting next chapter\" for the business in the UK, bringing together \"one of the world's most recognised chefs with a highly capable operator and the long-term investment to build something with real longevity\". James Brown, chief executive of Brava, said the company wanted to \"bring world-class Italian dining to the heart of the UK high street\". \"A lot of time and energy has gone into evolving the Jamie's Italian concept to make that vision a reality,\" he said. \"This marks an exciting new chapter for both Jamie's Italian and Brava, and reflects our commitment to reimagining the high street with exceptional, modern hospitality.\""
    },
    {
        "title": "Child poverty strategy unveiled - but not everyone's happy",
        "description": "A new long-awaited child poverty strategy is promising to lift half a million children out of poverty by the end of this parliament - but critics have branded it unambitious.&#160;",
        "url": "https://news.sky.com/story/starmer-wants-to-lift-half-a-million-children-out-of-poverty-but-does-his-plan-go-far-enough-13479419",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-child-poverty-children_7101455.jpg?20251205072511",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-12-05 01:45:00",
        "Headline": "Removing the two-child benefit cap is central to the government's new plan. But charities warn it has missed an opportunity to do more and the Conservatives argue work is a better way out. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  A new long-awaited child poverty strategy is promising to lift half a million children out of poverty by the end of this parliament - but critics have branded it unambitious.  The headline announcement in the government's plan is the pledge to lift the two-child benefit cap, announced in Rachel Reeves's budget last week. It also includes: • Providing upfront childcare support for parents on universal credit returning to work• An £8m fund to end the placement of families in bed and breakfasts beyond a six-week limit• Reforms to cut the cost of baby formula• A new legal duty on councils to notify schools, health visitors, and GPs when a child is placed in temporary accommodation Many of the measures have previously been announced.  The government also pointed to its plan in the budget to cut energy bills by £150 a year, and its previously promised £950m boost to a local authority housing fund, which it says will deliver 5,000 high-quality homes for better temporary accommodation. Downing Street said the strategy would lift 550,000 children out of poverty by 2030, saying that would be the biggest reduction in a single parliament since records began. \n                  Inside the town where 6 out of 7 children grow up in poverty - and live in fear of homelessness\n                 \n                  John Swinney says 'progress' being made to eradicate child poverty in Scotland but there is still 'more to do'\n                 \n                  Big Issue founder on the 'great distraction' stopping Britain tackling 'emergency' crisis\n                 But charities had been hoping for a 10-year strategy and argue the plan lacks ambition. A record 4.5 million children (about 31%) are living in poverty in the UK - 900,000 more since 2010/11, according to government figures. Phillip Anderson, the Strategic Director for External Affairs at the National Children's Bureau (NCB), told Sky News: \"Abolishing the two-child limit is a hell of a centre piece, but beyond that it's mainly a summary of previously announced policies and commitments. \"The really big thing for me is it misses the opportunity to talk about the longer term. It was supposed to be a 10-year strategy, we wanted to see real ambition and ideally legally binding targets for reducing poverty. \"The government itself says there will still be around four million children living in poverty after these measures and the strategy has very little to say to them.\"  'Budget for benefits street' row The biggest measure in the strategy is the plan to lift the two-child benefit cap from April. This is estimated to lift 450,000 children out of poverty by 2030, at a cost of £3bn. The government has long been under pressure from backbench Labour MPs to scrap the cap, with most experts arguing that it is the quickest, most cost-effective way to drive-down poverty this parliament. The cap, introduced by Conservative chancellor George Osborne in 2017, means parents can only claim universal credit or tax credits for their first two children. It meant the average affected household losing £4,300 per year, the Institute for Fiscal Studies calculated in 2024. The government argues that a failure to tackle child poverty holds back the economy, and young people at school, cutting their employment and earning prospects in later life. However, the Conservatives argue parents on benefits should have to make the same financial choices about children as everyone else. Shadow chancellor Mel Stride said: \"Work is the best way out poverty but since this government took office, unemployment has risen every single month and this budget for Benefits Street will only make the situation worse. \"  'Bring back Sure Start' Lord Bird, a crossbench peer who founded the Big Issue and grew up in poverty, said while he supported the lifting of the cap there needed to be \"more joined up thinking\" across government for a longer-term strategy. He has been pushing for the creation of a government ministry of \"poverty prevention and cure\", and for legally binding targets on child poverty. Anne Frances, who has three children aged five, eight and 13, spoke to Sky News about how she would benefit from some of the measures.  Married and working full-time as an executive assistant, she never expected to be in poverty, until a marriage breakdown and caring for her ill parents changed everything. \"I had a really good job, I had a good salary, and I was able to take care of all of our needs.  \"But that kind of change meant I just felt like I was in free fall. \"I had no idea about benefit or what I was entitled to. I then had to make a lot of changes and a lot of sacrifices to be able to take care of my children and  my parents. That was never part of my plan.\" She was referred to the North Paddington Food Bank, a West London-based charity which mostly gives out cash and vouchers for groceries and household items rather than food parcels.  Anne received no benefits for her youngest child, due to the two-child cap, but that will now change.\n \"The food bank never made me feel guilty - or like I was going to misuse the money.  You're constantly paying for uniforms, for shoes, clothing.  \"My youngest daughter was having to receive milk and nappies, and these were things that I'd never really considered.  \"Oh yeah, you know, I'm going to be stuck one day. You just always think you're just going to keep providing for your family.  \"It was really difficult to kind of manage those eventualities that would just kind of come out of nowhere, a bill, or you're trying to maintain your car, or just celebrate your child's birthday or just make them feel special in some way.  \"You're really constantly having to think about money, especially during the winter with the heating costs.\" Anne has taken courses, through the charity, to improve her job skills and is feeling more hopeful.\n  \"We feel like we're turning a page, we're finally turning a corner. And I think with the lifting of the two-child benefit cap, that's going just to only make things even better for them.  \"Children need help, children need support. You want them to be healthy and thriving, but how can you do that on such a limited budget?  \"And I think particularly when families or parents have been working and paying into the system, I think that needs to be recognised.\"\n \"You have to be able to measure yourself, you can't have the government marking its own homework,\" he told Sky News. Lord Bird also said he was a \"great believer\" in resurrecting Sure Start centres and expanding them beyond early years. The New Labour programme offered support services for pre-school children and their parents and is widely seen to have improved health and educational outcomes. By its peak in 2009-2010 there were 3,600 centres - the majority of which closed following cuts by the subsequent Conservative government.  PM to meet families  Sir Keir Starmer's government have since announced 1,000 Best Start Family Hubs - but many Labour MPs feel this announcement went under the radar and ministers missed a trick in not calling them \"Sure Starts\" as it is a name people are familiar with. The prime minister is expected to meet families and children in Wales on Friday, alongside the Welsh First Minister, to make the case for his strategy and meet those he hopes will benefit from it. Several other charities have urged ministers to go further. Both Crisis and Shelter called for the government to unfreeze housing benefit and build more social rent homes, while the Children's Commissioner for England, Dame Rachel de Souza, said that \"if we are to end child poverty - not just reduce it\" measures like free bus travel for school-age children would be needed. The strategy comes after the government set up a child poverty taskforce in July 2024, which was initially due to report back in May. The taskforce's findings have not yet been published - only the government's response. Sir Keir said: \"Too many children are growing up in poverty, held back from getting on in life, and too many families are struggling without the basics: a secure home, warm meals and the support they need to make ends meet. \"I will not stand by and watch that happen, because the cost of doing nothing is too high for children, for families and for Britain.\""
    },
    {
        "title": "Revealed: Britain's happiest places to live ",
        "description": "The lively market town of Skipton in North Yorkshire has been crowned the happiest place to live in 2025, according to an annual study by Rightmove. ",
        "url": "https://news.sky.com/story/revealed-britains-happiest-places-to-live-13479542",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-housing-house_7101386.jpg?20251205022003",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-05 01:53:00",
        "Headline": "People who live in a rural location are more likely to say they feel happy where they lived than urban and suburban dwellers. Riverside, woodland or coastal locations are also more likely to have happy residents.",
        "Content": "The lively market town of Skipton in North Yorkshire has been crowned the happiest place to live in 2025, according to an annual study by Rightmove.  With a well-preserved medieval castle overlooking its centre, Skipton is surrounded by scenic views and is a jumping off point for the Yorkshire Dales. Rightmove said residents of Skipton ranked it particularly highly for its access to nature and green spaces, the friendliness of the people, and access to essential services such as schools. Residents also praised Skipton for feeling they can be themselves there, and for the affordability of the area, feeling they earn enough to live comfortably. However, the town was ranked less highly for its access to employment opportunities and desirable jobs, and residents living nearby to friends and family. The average asking price for a home in Skipton is £326,093, which is lower than the current national average of £364,833, Rightmove said. Attractions within the town include a traditional high street marketplace, a shopping arcade, a museum, and independent shops. \n                  Desperate councils spending £630m on middlemen 'cashing in' on housing crisis\n                 \n                  Govt forced to water down affordable housing targets as London property market 'in crisis', minister says\n                 \n                  'Don't tell anyone': Manager at UK's largest housing association told staff how to fake fire safety notice\n                 The town finally took the top spot after being placed at number six in last year's study, and in second place in 2020. Ian Rigarlsford, who works in corporate affairs at Skipton Building Society, said: \"Skipton is a place where community genuinely means something, and that's what makes living and working here so special.\" Where were the runners-up?  Richmond-upon-Thames and Camden, both in London, were placed second and third respectively in Rightmove's 2025 \"happy at home\" index. Residents of Richmond also ranked it highly for its access to nature and essential local services, as well as non-essential amenities such as restaurants and shops, Rightmove said. It added that this year's study marks the first time Camden has taken a \"podium spot\" in 14 years of the research being collected. Stirling was named as the happiest place in Scotland, with Anglesey topping the list in Wales. More than 19,500 people took part in Rightmove's 2025 happy at home survey, which was self-selecting. Rightmove sent the survey to people across the UK who had opted in to receive its communications. This year's index showed that on average residents in the South West are the happiest with where they live, and those in the East Midlands are least happy. Read more from Sky News:Several countries withdraw from EurovisionDoes Starmer's child poverty plans go far enough? 1. Skipton, Yorkshire and the Humber 2. Richmond upon Thames, London\n 3. Camden, London 4. Harrogate, Yorkshire and the Humber 5. Woodbridge, East of England 6. Altrincham, North West 7. Macclesfield, North West 8. Stirling, Scotland 9. Cirencester, South West 10. Hexham, North East Keys to happiness: Nature and age  People who live in a rural location are more likely to say they feel happy where they lived than urban and suburban dwellers. Riverside, woodland or coastal locations are also more likely to have happy residents. The study also revealed residents who live close to a national park or an area of outstanding natural beauty are typically happier than people who do not. The study also indicated being happy with where you live tends to increase with age, perhaps partly because people tend to have bigger housing budgets as they grow older."
    },
    {
        "title": "Bridgepoint weighs £550m bid for London-listed medical group AMS",
        "description": "The private equity backer of Burger King UK is weighing a takeover bid for Advanced Medical Solutions Group, a London-listed producer of surgical products.",
        "url": "https://news.sky.com/story/bridgepoint-weighs-163550m-bid-for-london-listed-medical-group-ams-13479641",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cityscape-london_6928636.jpg?20250527115240",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-05 10:22:00",
        "Headline": "The London-listed buyout firm has become the latest investor to explore a potential takeover offer for Advanced Medical Solutions Group, a maker of specialist surgical products, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of Burger King UK is weighing a takeover bid for Advanced Medical Solutions Group, a London-listed producer of surgical products. Sky News has learnt that Bridgepoint is exploring an offer for AMS which could value the target at somewhere in the region of £550m-£600m. Banking sources said the buyout firm was examining a bid valuing AMS at between 270p and 280p per share, a premium of more than 30% to its current share price. Money latest: The 10 happiest places to live in the UK It was unclear on Friday morning whether it had made a formal approach to the board of AMS. News of Bridgepoint's interest comes months after Montagu Private Equity abandoned its interest in a bid for the company. Inflexion, another private equity investor, had also been studying a potential offer last year. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 AMS Group manufactures surgical brands including LiquiBand and Resorba. Listed on London's junior AIM stock market, the company reported interim results in September showing a 49% rise in pre-tax profit. Its shares have been broadly flat over the last year, and on Friday morning were trading at around 208.5p, giving it a market capitalisation of £455m. Bridgepoint and AMS both declined to comment."
    },
    {
        "title": "171 arrests in gig economy crackdown - with 60 delivery drivers to be deported",
        "description": "The UK is deporting 60 delivery riders found to be working illegally after an immigration crackdown.",
        "url": "https://news.sky.com/story/dozens-of-delivery-drivers-to-be-deported-amid-crackdown-to-deter-illegal-migrants-13479540",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dan-whitehead-delivery-driver_6961476.jpg?20250710050616",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-05 01:01:00",
        "Headline": "The moves are part of the government's attempts to deter people from illegally entering the UK.",
        "Content": "The UK is deporting 60 delivery riders found to be working illegally after an immigration crackdown. Targeted action against workers in the so-called gig economy led to 171 arrests nationwide last month, the Home Office said. Those arrested included Chinese nationals working in a restaurant in Solihull, Bangladeshi and Indian riders in east London, and Indian delivery riders in Norwich. The drive comes as ministers try to crack down on illegal working in the UK, as part of efforts to deter those coming to the country illegally. Home Office figures show there were 8,232 arrests of illegal workers in the year to September, up 63% compared with the previous 12 months.  Home Secretary Shabana Mahmood set out reforms to the asylum system last month, aimed at making the UK less attractive for illegal migration and making it easier to deport people. Border security minister Alex Norris said the government was rooting out the criminality of illegal working in the delivery sector from communities. \n                  Revamped British passports rolling out this month - can you spot what's changed?\n                 \n                  These changes are gigantic - but they will be controversial\n                 \n                  A Danish style asylum system? How the UK and Denmark's immigration policies compare\n                 He went on to say: \"These results should send a clear message, if you are working illegally in this country, you will be arrested and removed. \"This action is part of the most sweeping changes to illegal migration in modern times to reduce the incentives that draw illegal migrations here and scale up removals.\" Read more:France will soon be able to intercept suspected migrant taxi boatsHow is Britain's immigration system actually changing?  Ministers have also been working with firms Deliveroo, Just Eat and Uber Eats to address concerns of abuse in the sector and ramping up identity checks to tackle account-sharing. The Home Office also agreed in July to share asylum hotel locations with food delivery companies, to tackle suspected hot spots of illegal working. The action also comes as the government's new Border Security, Asylum and Immigration Act became law on Tuesday, which includes measures to close a \"loophole\" for casual, temporary or subcontracted workers to also have to prove their status. Employers who fail to carry out checks could face up to five years in prison, fines of £60,000 for each illegal worker they have employed, and having their business closed."
    },
    {
        "title": "Child poverty strategy unveiled - but not everyone's happy",
        "description": "A new long-awaited child poverty strategy is promising to lift half a million children out of poverty by the end of this parliament - but critics have branded it unambitious.&#160;",
        "url": "https://news.sky.com/story/starmer-wants-to-lift-half-a-million-children-out-of-poverty-but-does-his-plan-go-far-enough-13479419",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-child-poverty-children_7101455.jpg?20251205072511",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-12-05 01:45:00",
        "Headline": "Removing the two-child benefit cap is central to the government's new plan. But charities warn it has missed an opportunity to do more and the Conservatives argue work is a better way out. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  A new long-awaited child poverty strategy is promising to lift half a million children out of poverty by the end of this parliament - but critics have branded it unambitious.  The headline announcement in the government's plan is the pledge to lift the two-child benefit cap, announced in Rachel Reeves's budget last week. It also includes: • Providing upfront childcare support for parents on universal credit returning to work• An £8m fund to end the placement of families in bed and breakfasts beyond a six-week limit• Reforms to cut the cost of baby formula• A new legal duty on councils to notify schools, health visitors, and GPs when a child is placed in temporary accommodation Many of the measures have previously been announced.  The government also pointed to its plan in the budget to cut energy bills by £150 a year, and its previously promised £950m boost to a local authority housing fund, which it says will deliver 5,000 high-quality homes for better temporary accommodation. Downing Street said the strategy would lift 550,000 children out of poverty by 2030, saying that would be the biggest reduction in a single parliament since records began. \n                  Inside the town where 6 out of 7 children grow up in poverty - and live in fear of homelessness\n                 \n                  John Swinney says 'progress' being made to eradicate child poverty in Scotland but there is still 'more to do'\n                 \n                  Big Issue founder on the 'great distraction' stopping Britain tackling 'emergency' crisis\n                 But charities had been hoping for a 10-year strategy and argue the plan lacks ambition. A record 4.5 million children (about 31%) are living in poverty in the UK - 900,000 more since 2010/11, according to government figures. Phillip Anderson, the Strategic Director for External Affairs at the National Children's Bureau (NCB), told Sky News: \"Abolishing the two-child limit is a hell of a centre piece, but beyond that it's mainly a summary of previously announced policies and commitments. \"The really big thing for me is it misses the opportunity to talk about the longer term. It was supposed to be a 10-year strategy, we wanted to see real ambition and ideally legally binding targets for reducing poverty. \"The government itself says there will still be around four million children living in poverty after these measures and the strategy has very little to say to them.\"  'Budget for benefits street' row The biggest measure in the strategy is the plan to lift the two-child benefit cap from April. This is estimated to lift 450,000 children out of poverty by 2030, at a cost of £3bn. The government has long been under pressure from backbench Labour MPs to scrap the cap, with most experts arguing that it is the quickest, most cost-effective way to drive-down poverty this parliament. The cap, introduced by Conservative chancellor George Osborne in 2017, means parents can only claim universal credit or tax credits for their first two children. It meant the average affected household losing £4,300 per year, the Institute for Fiscal Studies calculated in 2024. The government argues that a failure to tackle child poverty holds back the economy, and young people at school, cutting their employment and earning prospects in later life. However, the Conservatives argue parents on benefits should have to make the same financial choices about children as everyone else. Shadow chancellor Mel Stride said: \"Work is the best way out poverty but since this government took office, unemployment has risen every single month and this budget for Benefits Street will only make the situation worse. \"  'Bring back Sure Start' Lord Bird, a crossbench peer who founded the Big Issue and grew up in poverty, said while he supported the lifting of the cap there needed to be \"more joined up thinking\" across government for a longer-term strategy. He has been pushing for the creation of a government ministry of \"poverty prevention and cure\", and for legally binding targets on child poverty. Anne Frances, who has three children aged five, eight and 13, spoke to Sky News about how she would benefit from some of the measures.  Married and working full-time as an executive assistant, she never expected to be in poverty, until a marriage breakdown and caring for her ill parents changed everything. \"I had a really good job, I had a good salary, and I was able to take care of all of our needs.  \"But that kind of change meant I just felt like I was in free fall. \"I had no idea about benefit or what I was entitled to. I then had to make a lot of changes and a lot of sacrifices to be able to take care of my children and  my parents. That was never part of my plan.\" She was referred to the North Paddington Food Bank, a West London-based charity which mostly gives out cash and vouchers for groceries and household items rather than food parcels.  Anne received no benefits for her youngest child, due to the two-child cap, but that will now change.\n \"The food bank never made me feel guilty - or like I was going to misuse the money.  You're constantly paying for uniforms, for shoes, clothing.  \"My youngest daughter was having to receive milk and nappies, and these were things that I'd never really considered.  \"Oh yeah, you know, I'm going to be stuck one day. You just always think you're just going to keep providing for your family.  \"It was really difficult to kind of manage those eventualities that would just kind of come out of nowhere, a bill, or you're trying to maintain your car, or just celebrate your child's birthday or just make them feel special in some way.  \"You're really constantly having to think about money, especially during the winter with the heating costs.\" Anne has taken courses, through the charity, to improve her job skills and is feeling more hopeful.\n  \"We feel like we're turning a page, we're finally turning a corner. And I think with the lifting of the two-child benefit cap, that's going just to only make things even better for them.  \"Children need help, children need support. You want them to be healthy and thriving, but how can you do that on such a limited budget?  \"And I think particularly when families or parents have been working and paying into the system, I think that needs to be recognised.\"\n \"You have to be able to measure yourself, you can't have the government marking its own homework,\" he told Sky News. Lord Bird also said he was a \"great believer\" in resurrecting Sure Start centres and expanding them beyond early years. The New Labour programme offered support services for pre-school children and their parents and is widely seen to have improved health and educational outcomes. By its peak in 2009-2010 there were 3,600 centres - the majority of which closed following cuts by the subsequent Conservative government.  PM to meet families  Sir Keir Starmer's government have since announced 1,000 Best Start Family Hubs - but many Labour MPs feel this announcement went under the radar and ministers missed a trick in not calling them \"Sure Starts\" as it is a name people are familiar with. The prime minister is expected to meet families and children in Wales on Friday, alongside the Welsh First Minister, to make the case for his strategy and meet those he hopes will benefit from it. Several other charities have urged ministers to go further. Both Crisis and Shelter called for the government to unfreeze housing benefit and build more social rent homes, while the Children's Commissioner for England, Dame Rachel de Souza, said that \"if we are to end child poverty - not just reduce it\" measures like free bus travel for school-age children would be needed. The strategy comes after the government set up a child poverty taskforce in July 2024, which was initially due to report back in May. The taskforce's findings have not yet been published - only the government's response. Sir Keir said: \"Too many children are growing up in poverty, held back from getting on in life, and too many families are struggling without the basics: a secure home, warm meals and the support they need to make ends meet. \"I will not stand by and watch that happen, because the cost of doing nothing is too high for children, for families and for Britain.\""
    },
    {
        "title": "David Lammy suggests UK would benefit from rejoining an EU customs union",
        "description": "Deputy Prime Minister David Lammy has suggested it could be beneficial for the UK to consider re-entering a customs union with the EU.",
        "url": "https://news.sky.com/story/david-lammy-suggests-uk-would-benefit-from-rejoining-an-eu-customs-union-13479777",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-david-lammy-downing-street_7098187.jpg?20251202092026",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-05 15:04:00",
        "Headline": "But Keir Starmer, responding to his deputy's intervention, stresses the government wants to strengthen ties with Europe without a customs union.",
        "Content": "Deputy Prime Minister David Lammy has suggested it could be beneficial for the UK to consider re-entering a customs union with the EU. He said that although doing so was not the government's current policy, he could see how other countries outside the EU had benefited from such arrangements. \"It's self-evident that leaving the European Union badly damaged our economy, took us out of an important marketplace and created serious friction, that untruths were being peddled by those that thought exiting the EU would be a good thing,\" Mr Lammy told the News Agents podcast. \"And it's why every single day that I was foreign secretary, I returned to the subject of our relationship with the European Union.\" Asked repeatedly if he would like to see the UK in a customs union, he said: \"That is not currently our policy. That's not currently where we are. \"But you can see countries like Turkey with a customs union seemingly benefiting and seeing growth in their economy, and again, that's self-evident.\" The Prime Minister's economic adviser Minouche Shafik has also reportedly advocated behind the scenes for joining a customs union. \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 \n                  More border checks for Britons travelling to Europe under new rules\n                 Mr Lammy's comments were being taken as the clearest indication yet that the government is considering bringing the UK further back in line with the European Union. But when Sir Keir Starmer was asked to respond and say why he was not advocating for membership given that growth is an ongoing priority for his government, he was quick to dampen down the speculation. The prime minister said Labour would be sticking to its manifesto, which pledged to deepen ties with the EU without returning to the customs union, single market or freedom of movement. \"Well, the position that we are taking has been clearly set out in the manifesto, and then we've been following it,\" Sir Keir said. \"And earlier this year, we had the first UK-EU summit ever, and we had 10 strands for a closer relationship. \"So we've totally reset relations with the EU. \"That's good for our economy, good for defence and security, good for the work that we need to do on energy. Earlier a spokesperson for Number 10 said: \"We are strengthening relations with the EU whilst sticking to our red lines.\" \"The prime minister reiterated that on Monday evening at the Lady Mayor's Banquet.\"  Sir Keir set out his foreign policy vision at the banquet, as is tradition. He said the Brexit vote was a \"fair, democratic expression\" but the way it was \"sold and delivered was wrong\". \"There's no credible economic vision for Britain not positioning us as an open trading economy,\" the Number 10 spokesman said. \"We have to be grown up about trade-offs. We have redefined bonds with EU and stuck to our red lines.\" On Mr Lammy's comments, the spokesman added: \"That is not our current policy or where we are.\""
    },
    {
        "title": "EU hands €120m fine to Elon Musk's X for breaking social media rules",
        "description": "Elon Musk's social media platform X, formerly Twitter, has been fined &#8364;120m (&#163;105m) by the EU after it found rule breaches had left users vulnerable to scams and manipulation.",
        "url": "https://news.sky.com/story/eu-hands-8364120m-fine-to-elon-musks-x-for-breaking-social-media-rules-13479732",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-x-elonmusk_6980438.jpg?20250802034931",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-05 14:01:00",
        "Headline": "The European Commission highlighted breaches including X's policy of allowing anyone to buy a verified blue checkmark.",
        "Content": "Elon Musk's social media platform X, formerly Twitter, has been fined €120m (£105m) by the EU after it found rule breaches had left users vulnerable to scams and manipulation. The European Commission started investigating X under the Digital Services Act (DSA) two years ago and has now issued its first non-compliance decision against the site. In a decision that could anger the US President Donald Trump the commission censured Elon Musk's platform for three different breaches of DSA transparency requirements. The Trump administration has previously criticised Brussels' digital regulations, saying that they target US tech companies and had vowed to retaliate. One of X's breaches highlighted by the EU concerned the \"deceptive design practices\" of the platform's blue checkmarks, which exposed users to scams and manipulation, regulators said. Before Mr Musk acquired the site for $44bn (£33bn) in 2022, the checkmarks indicated the accounts of notable users with verified identities. Under the tech billionaire's changes, however, the badge could be bought by anyone willing to pay $8 (£6) a month. \n                  Next week, one of the world's toughest social media bans will come into force\n                 \n                  More than 800,000 young children seeing social media content 'designed to hook adults', figures show\n                 \n                  Teenagers launch legal challenge over Australia's ban on social media for children\n                  The commission said, it was therefore \"difficult for users to judge the authenticity of accounts and content they engage with\". X also fell short of transparency requirements for its database of advertisements, regulators said. Read more:The X Effect: How Elon Musk is boosting the British rightElon Musk's $1trn pay package approved by Tesla In the EU, platforms are required to provide a database of all the digital ads they have carried, with details such as who paid for them and the intended audience. But the commission said X had created \"access barriers\" to its database, which lacked \"critical information\" and imposed \"excessive delays in processing, which undermine the purpose of ad repositories\". It also found X had failed to meet its DSA obligations to provide researchers with its public data, the commission said. The EU's executive vice-president for tech sovereignty, security and democracy, Henna Virkkunen, said: \"Deceiving users with blue checkmarks, obscuring information on ads and shutting out researchers have no place online in the EU. \"The DSA protects users. The DSA gives researchers the way to uncover potential threats. The DSA restores trust in the online environment. \"With the DSA's first non-compliance decision, we are holding X responsible for undermining users' rights and evading accountability.\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈 X now has 60 working days to inform the commission of how it will bring its blue checkmarks into compliance, and 90 days to address the other two breaches. The commission says it can impose \"periodic penalty payments\" on Musk's platform if it fails to comply."
    },
    {
        "title": "Cloudflare: 'Large number of empty pages' on several websites after internet outage",
        "description": "Several websites, including Linkedin, Zoom and Canva, went down after new issues with internet provider Cloudflare.",
        "url": "https://news.sky.com/story/cloudflare-large-number-of-empty-pages-on-several-websites-after-internet-outage-13479620",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cloudflare-internet_7101702.jpg?20251205114031",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-05 09:32:00",
        "Headline": "The web infrastructure company said at around 9am that it was \"investigating issues with Cloudflare Dashboard\" after reports of \"a large number of empty pages\".",
        "Content": "Several websites, including Linkedin, Zoom and Canva, went down after new issues with internet provider Cloudflare. The web infrastructure company said at around 9am that it was \"investigating issues with Cloudflare Dashboard and related APIs (application programming interfaces)\" after reports of \"a large number of empty pages\". Shortly after the announcement, Cloudflare said it had implemented a fix and was monitoring to see if it had worked, but several websites remained blank throughout the morning. DownDetector, a site used to monitor online service issues, also went down as a result of the issue. When it came back online, it recorded more than 4,500 reports related to issues at Cloudflare. Cloudflare, which provides network and security services for many online businesses, claims that around a fifth of all websites use some form of its services. Issues also affected the company in November, when more than 10,000 people reported issues with outages for X, Spotify, ChatGPT, Facebook, AWS (Amazon Web Services), bet365, Canva, BrightHR and the multi-player game League of Legends - all of which use Cloudflare services. The company said in a server update at the time that it was \"experiencing an internal service degradation\" and that some services may be intermittently affected. \n                  EU hands €120m fine to Elon Musk's X for breaking social media rules\n                 \n                  Next week, one of the world's toughest social media bans will come into force\n                 \n                  Major city may have to evacuate as water supplies run low\n                 Read more from Sky News:Apple's AI chief steps down as company falls behind in tech raceWhistleblowers say hundreds of UK moderators have left TikTok That came after a major outage affected thousands of websites in October, as a result of issues originating from AWS. And last year, more than eight million computers crashed worldwide - knocking Sky News off the air and causing significant backlogs for GPs - after a software update from cyber security company CrowdStrike went wrong. In response to Friday's outage, Jake Moore, global cybersecurity adviser at internet security company ESET, said: \"If a major provider like Cloudflare goes down for any reason, thousands of websites instantly become unreachable. \"The problems often lie with the fact we are using an old network to direct internet users around the world to websites, but it simply highlights there is one huge single point of failure in this legacy design.\""
    },
    {
        "title": "Next week, one of the world's toughest social media bans will come into force",
        "description": "Australia will introduce one of the world's toughest social media policies for children next week, with a ban that comes into effect on Wednesday.",
        "url": "https://news.sky.com/story/i-dont-know-how-im-going-to-cope-teens-will-be-banned-from-social-media-in-australia-next-week-13479370",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-media-app_7101389.jpg?20251205024039",
        "type": "Technology",
        "Author": "Nicole Johnston",
        "Date Published": "2025-12-05 02:37:00",
        "Headline": "Emma Mason has campaigned for Australia's under-16s ban on TikTok, Instagram, Facebook and other platforms since her daughter Tilly took her own life. But the new law is dividing opinion.",
        "Content": "\n          News correspondent\n              @nicole_reporter\n  Australia will introduce one of the world's toughest social media policies for children next week, with a ban that comes into effect on Wednesday. Technology giant Meta has already started locking children under the age of 16 out of Instagram and Facebook, as it runs age checks on its users. Other platforms have started contacting underage users - advising them to download their photos and contacts, and offering the choice of deleting their accounts or freezing them until they turn 16. The age-restricted ban also includes TikTok, Snapchat, YouTube, Reddit, Twitch, Kick, Threads and X. Impact on influencers In the town of Umina on the New South Wales central coast, 14-year-old skateboarders Vespa Eding and Indy Conwell post photos and videos of their latest tricks in the skate bowl. Their accounts are managed by their mums. The girls also coach young skaters and have corporate sponsors. \"I see both sides to it,\" Indy explains. \"It's sad because I'm probably going to lose my account that I use to contact my sponsors and do my business.\" \"But I think it's a good idea [to ban it] for people getting bullied or if they're getting addicted to it.\" Read more:Teens launch legal challenge over ban on social media for childrenHow will ban work and could the UK bring in a similar law? Mental health crises Lawyer and mother Emma Mason knows how damaging social media can be. Her daughter Matilda Rosewarne, who was called \"Tilly\", suffered from years of online abuse as a teenager in the regional city of Bathurst. Tilly took her own life on 16 February 2022. She was 15 years old. \"When Tilly was about 14, a fake nude was sent around by a friend of hers at school in Bathurst,\" Ms Mason said. \"It spread to about 300 children, then it went to about 1,000 kids and by 6pm she had attempted suicide.\" Ms Mason has campaigned for Australia's social media ban since she lost her daughter, and spoke at an event on the sidelines of the UN General Assembly in New York this year. Psychologist Danielle Einstein, co-author of the book Raising Anxiety, says there is clearly a link between anxiety, uncertainty and social media. \"Now is the time to get contact numbers and to see who your good friends are,\" Dr Einstein said. \"Who are the people you have fun with and who are the people you talk to when things aren't going well.\" Under the ban, children will still be able to use messaging services. Life off the apps At Brigidine College in Sydney, students are preparing to get off the apps. Teenager Sophia Benson says: \"I'm on the fence about it. I think it's good for kids' mental health. But I also think it encourages the younger generation to find ways around it because obviously if you're told you can't do something, you want to do it more.\" Elsie Ord is 15 years old and will spend the next seven months without social media access. \"I signed up at such a young age I was already using fake ages,\" Elsie says. \"I'm on social media around eight hours a day. I don't know how I'm going to cope. I'm one of the people thinking how am I going to escape this, but it's inevitable.\" Some 96% of Australia's teenagers under 16 have social media accounts, according to Australia's internet regulator. The Australian government says the new social media laws are necessary to protect children from addiction and cyberbullying. However, there is opposition as well. Social media 'whack a mole' John Riddick is a member of the NSW Parliament and the Libertarian Party. He's also president of the Digital Freedom Project, which is backing a High Court challenge against the ban. Mr Riddick says it should be up to parents to decide what is good for their children, not the government. \"Kids are tech savvy. You say 'you can't do this, and you can't do that' and you're going to play whack-a-mole, the kids are going to get around it,\" he argues. The government has warned it may expand its list of banned apps. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. Alternatively, you can call Mind's support line on 0300 102 1234, or NHS on 111."
    },
    {
        "title": "Major city may have to evacuate as water supplies run low",
        "description": "Iran's capital is counting down to \"day zero\" - the day the water runs out and the taps run dry.",
        "url": "https://news.sky.com/story/the-countdown-to-day-zero-major-city-may-have-to-evacuate-as-water-supplies-run-low-13479538",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-iran-water_7101383.jpg?20251205001512",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-12-05 03:37:00",
        "Headline": "Tehran is not alone. Cape Town in South Africa narrowly avoided taps running dry eight years ago. Even London, known for its rain, is at risk. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Iran's capital is counting down to \"day zero\" - the day the water runs out and the taps run dry. Reservoirs that supply Tehran's 15 million residents are almost empty. The Karaj dam, which supplies a quarter of the city's drinking water, is just 8% full. Water rationing has begun in some areas, with the flow from taps reduced or even stopped altogether overnight. President Masoud Pezeshkian has urged people to use water sparingly - or the city, or at least parts of it, may even have to evacuate. So what's going on? Rain should start falling in the autumn after Iran's hot dry summer. But according to the country's National Weather Forecasting Centre, this has been the driest September to November period in half a century, with rainfall 89% below the long-term average. The combination of low rainfall and high heat has lasted for more than five years, leaving the country parched. But the weather - and the shadow of climate change - aren't the only factors in Tehran's water crisis. According to the Centre for Strategic and International Studies, the population of the metropolitan area of the city has almost doubled from 4.9 million in 1979 to 9.7 million today. But water consumption has risen even faster, quadrupling from 346 million cubic metres in 1976 to 1.2 billion cubic metres now. Increasing wealth has allowed more people to buy washing machines and dishwashers. To supplement supplies from reservoirs, Tehran has had to turn to natural aquifers underground, which provide between 30% and 60% of its tap water in recent years. But that puts the city in direct competition with farmers who draw on the water to irrigate crops. Levels are falling by 101 million cubic metres a year around Tehran, according to analysis in the journal Science Advances. That's water that has accumulated from many decades of rain - and will take at least as long to replenish. Read more from Sky News:Could a volcanic eruption have spread the Black Death?The words you have mispronounced all year - and how to say them Professor Kaveh Madani, the former deputy head of Iran's environment department and now director of the United Nations University Institute for Water, Environment and Health, said chronic mismanagement of natural resources has led to what he calls water bankruptcy. He told Sky News: \"These things were not created overnight. \"They're the product of decades of bad management, lack of foresight, overreliance and false confidence in how much infrastructure and engineering projects can do in a country that is relatively water short.\" Government ministers blame the water shortage on climate change, water leaks from pipes and the 12-day war with Israel. Whatever the reason, it underlines the threat of water scarcity to global cities. Tehran is not alone.  Cape Town in South Africa narrowly avoided taps running dry eight years ago after a city-wide effort to save water. Even London, known for its rain, is at risk of drought. Supplies haven't kept up with population growth and booming demand. As Tehran has found, droughts that are being made more likely and more severe with climate change can expose the fragility of water supply."
    },
    {
        "title": "Netflix agrees blockbuster $72bn deal for Warner Bros studios ",
        "description": "Netflix has agreed a $72bn (&#163;54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones.",
        "url": "https://news.sky.com/story/netflix-agrees-blockbuster-72bn-deal-for-warner-bros-studios-13479683",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-warner-bros-logo-film_7101743.jpg?20251205122842",
        "type": "Entertainment",
        "Author": "James Sillars",
        "Date Published": "2025-12-05 11:09:00",
        "Headline": "The agreement means Warner Bros Discovery's library of film and TV successes including Harry Potter and Game Of Thrones will come under the same roof as Stranger Things and Squid Game.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Netflix has agreed a $72bn (£54bn) deal to secure Warner Bros Discovery's film and TV studios and supercharge its library through rights to top franchises including Harry Potter and Game Of Thrones. It had been reported that the US streaming giant was in exclusive talks over the deal following a bidding war for the assets. Paramount Skydance and Comcast, the ultimate owner of Sky News, were the rival suitors for the bulk of WBD that also includes HBO, the HBO Max streaming platform and DC Studios. Money latest: Budget airline launches six new routes While Netflix has agreed a $27.75 per share price with WBD, which equates to the $72bn purchase figure, the deal gives the assets a total value of $82.7bn. It will see WBD come under Netflix ownership once its remaining Discovery Global division, mostly legacy cable networks including CNN and the TNT sports channels, is separated. However, the agreement is set to attract scrutiny from competition regulators, particularly in the United States and Europe. \n                  Netflix flexes its muscles and could yet get its way in Trump's America\n                 \n                  Oil prices are down but fuel prices aren't - here's why\n                 \n                  Poundland reveals more store closures - here's the full list\n                 Both WBD and Netflix do not see the prospect of the deal being completed until late 2026 or 2027. The main stumbling block is likely to be the fact that Netflix, which has hits including Stranger Things and Squid Game, is already the world's biggest streaming service. Further drama could come in the form of a complaint by Paramount, which had previously made a bid for the whole company. CNBC reported this week that Paramount had claimed the auction process was biased in favour of Netflix. Entertainment news provider Variety has also reported that major studios fear an institutional crisis for Hollywood unless the move is blocked. Ted Sarandos, the co-chief executive of Netflix, said: \"By combining Warner Bros' incredible library of shows and movies - from timeless classics like Casablanca and Citizen Kane to modern favourites like Harry Potter and Friends - with our culture-defining titles like Stranger Things, KPop Demon Hunters and Squid Game, we'll be able to do that even better. \"Together, we can give audiences more of what they love and help define the next century of storytelling.\" Netflix shares were trading down more than 3% in pre-market deals but recovered much of that loss when Wall Street opened. Those for WBD were up by more than 2%.  David O'Hara, managing director at the advisory firm MKI Global Partners, said of the proposed deal: \"The 12-18 month timeline signals a long antitrust review, but despite the overlap between Netflix and HBO Max, there is a path to approval through possible HBO divestment. \"Netflix would not accept a $5.8bn break fee if it didn't see at least a small chance of the deal closing.\""
    },
    {
        "title": "Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers",
        "description": "The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.  ",
        "url": "https://news.sky.com/story/celebrities-join-the-princess-of-wales-for-a-carol-service-to-thank-britains-volunteers-13479909",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-royals-carol_7102238.jpg?20251205210016",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-05 22:14:00",
        "Headline": "Before the service, Kate met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor.",
        "Content": " The Prince and Princess of Wales and their children have attended the Together at Christmas carol service where they were joined by Hollywood stars.   But the focus of Kate's annual service at Westminster Abbey was the UK's local communities and the princess took the time beforehand to thank volunteers from across the country. Her smartly-dressed children Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, hung loops of red paper bearing their handwritten names on a \"Connection Tree\". The tree represents togetherness and the importance of moments of connection, and was covered with paper chains, created as each guest left a loop with their name. It tied in with theme of this year's service which was celebrating love in all its forms. Kate arrived at the abbey without her family before the service and met some of the stars performing or giving readings, including Hollywood actors Kate Winslet and Chiwetel Ejiofor and singer Katie Melua. The royal children were later pictured holding candles with churchgoers during the service. Among the congregation were Kate's parents, Carole and Michael Middleton, her brother James Middleton and wife Alizee Thevenet; Zara and Mike Tindall; the Duchess of Edinburgh; and Prince Michael of Kent, who arrived in a wheelchair. Royal correspondent The Prince and Princess of Wales and their children have joined a congregation of celebrities, sporting stars and community stalwarts to celebrate love in all its forms at Christmas. Kate is presiding over her annual Together at Christmas carol service at Westminster Abbey, with about 1,600 guests filling the pews where the princess and her husband married in 2011. She arrived before the service to meet some of the stars performing or giving readings, including actress Kate Winslet and singer Katie Melua. She told Dan Smith, lead singer with Bastille, that her children had been looking forward to the service: \"They're really excited, it's become such a tradition.\" When Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven, arrived with their father, Kate was there to meet them. Outside the Abbey's great west door the family stopped at a \"Connection Tree\" decorated with paper chains bearing the names of guests. The children added their names to the tree, a symbol of togetherness and the importance of moments of connection. The service recognised individuals from across the UK who may have dedicated or volunteered their time to others, led initiatives that bring people in their community together, or offered a helping hand to those around them. Celebrity chef Dame Mary Berry, who created a Christmas wreath on display in the abbey, was also among the guests, alongside members of the Lionesses and the Red Roses - England's women's football and rugby union teams. Kate expressed her appreciation to the performers when they met before the service, and she thanked Ms Winslet and Mr Ejiofor, who both later gave readings, and told Cornish folk singers Fisherman's Friends: \"I'm sure you'll be brilliant, thank you so much.\" The Princess added: \"It's a busy time I know for everybody.\" Kate also shared a joke with Schitt's Creek star Eugene Levy at the service. \"I should stand. Lovely to meet you, Catherine,\" said Mr Levy, as they continued to hold hands. \"You know my husband very well then,\" said Kate. Mr Levy replied: \"I spent a lovely day with your husband.\" Fisherman's Friends band member Jeremy Brown, who is a lobster fisherman, praised Kate for staging the event, now in its fifth year. He said: \"She does fantastic work for all these people and and we like to think we can just be part of that. If we can make somebody smile, we're happy to do that.\" Among the community stalwarts invited was Ann Davies, 81, a volunteer cook for almost a decade with the Moses Project, a charity providing mentoring and support for men with past and current addictions to drugs and alcohol. Ms Davies from Teesside also volunteers as a responsible adult at Middlesbrough police station, supporting vulnerable people who have been arrested. She said: \"The thing about volunteer work is you do it without expecting anything in return, you do it because you love it.\""
    },
    {
        "title": "Jamie Oliver revives high street Italian restaurant chain, six years after collapse",
        "description": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses.",
        "url": "https://news.sky.com/story/jamie-oliver-revives-high-street-italian-restaurant-chain-six-years-after-collapse-13479723",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jamies-italian-chef-jamie-oliver_7101816.jpg?20251205134306",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-05 13:30:00",
        "Headline": "Oliver will start with a Jamie's Italian in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs Prezzo, another chain of Italian restaurants.",
        "Content": "Jamie Oliver is relaunching his high street chain, Jamie's Italian, six years after the business collapsed, causing hundreds of job losses. The TV chef will start by opening a restaurant in London's Leicester Square next spring in partnership with Brava Hospitality Group, which runs another Italian eatery chain, Prezzo. Oliver, 50, has presented a host of TV shows since first appearing on screen in The Naked Chef in 1999 and has written more than two dozen cookery books. He said the relaunch carried risk and opportunity, as \"in theory it's not the easiest time to return but conversely, I think it's the perfect time\". \"I believe the mid-market needs excitement, surprise and delight and that's exactly what I am planning on delivering,\" he said. \"I will drive the menus, make sure the sourcing is right, the staff training, and ensure the look and feel of the restaurant is brought to life in the right way.\" Jamie's Italian was launched in 2008 in Oxford after Oliver went into partnership with his Italian mentor, chef Gennaro Contaldo. The chain eventually grew to around 40 sites. \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 \n                  Israel allowed to take part in Eurovision 2026 - as several countries withdraw\n                 But it went into administration in 2019, leading to the closure of its remaining UK sites and hundreds of job losses. The chain continued to operate overseas and has more than 30 restaurants in 25 countries. Brava will relaunch the brand in the UK. Read more on Sky News:Scarlett was groomed from 14Ex-doctor charged over alleged sex assaults Ed Loftus, global director of Jamie Oliver Restaurants, called it an \"exciting next chapter\" for the business in the UK, bringing together \"one of the world's most recognised chefs with a highly capable operator and the long-term investment to build something with real longevity\". James Brown, chief executive of Brava, said the company wanted to \"bring world-class Italian dining to the heart of the UK high street\". \"A lot of time and energy has gone into evolving the Jamie's Italian concept to make that vision a reality,\" he said. \"This marks an exciting new chapter for both Jamie's Italian and Brava, and reflects our commitment to reimagining the high street with exceptional, modern hospitality.\""
    },
    {
        "title": "Stolen Fabergé pendant passed to police - quite literally",
        "description": "A Faberg&#233; pendant has been recovered - after police spent six days closely monitoring the man accused of swallowing it.",
        "url": "https://news.sky.com/story/police-recover-bond-inspired-faberg233-pendant-six-days-after-it-was-swallowed-by-a-suspect-13479544",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-custody-new-zealand_7101390.jpg?20251205043210",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-12-05 04:28:00",
        "Headline": "The egg - one of only 50 ever made - was crafted from gold, painted with green enamel and encrusted with 183 diamonds and two sapphires.",
        "Content": "A Fabergé pendant has been recovered - after police spent six days closely monitoring the man accused of swallowing it. The limited-edition jewellery was inspired by the 1983 film Octopussy, where a smuggling operation involves a fake Fabergé egg. Detectives say the pendant exited the suspect's gastrointestinal tract naturally without medical intervention - after all, diamonds are forever. A photo has been released showing the collector's item reunited with police, and a gloved hand can be seen around the pendant and its long, gold chain. The price tag - showing it was on sale for £14,250 - remained intact. According to a statement, the 32-year-old was arrested at Partridge Jewellers in Auckland on 28 November and had been in police custody ever since. Officers were stationed around the clock waiting for the evidence to re-emerge. \n                  Spirit animal: Raccoon gets drunk as a skunk in a booze store - and sleeps off hangover in the toilet \n                 \n                  Is Die Hard a Christmas film? The public have spoken - and you might not like the result \n                 \n                  'Drop and cover'  earthquake alert turns out to be false alarm\n                 The Fabergé egg - one of only 50 ever made - was crafted from gold, painted with green enamel and encrusted with 183 diamonds and two sapphires. It opens to reveal an 18-carat yellow gold octopus nestled inside, adorned with white diamond suckers and black diamond eyes."
    }
]