[
    {
        "title": "Morgan McSweeney's exit shows No 10 in full-blown survival mode",
        "description": "In the end, the PM had little option.",
        "url": "https://news.sky.com/story/morgan-mcsweeneys-exit-shows-no-10-in-full-blown-survival-mode-13504982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-morgan-mcsweeney-labour_7159197.jpg?20260208143657",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-08 16:12:00",
        "Headline": "This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post.",
        "Content": "\n          Political editor\n              @BethRigby\n In the end, the PM had little option. Faced with an escalating crisis and ever-louder calls from his MPs that someone had to take responsibility for the Mandelson scandal, the PM's chief of staff, Morgan McSweeney, is gone. Politics latest: Starmer reacts as chief of staff Morgan McSweeney resigns It will be a bitter blow for Starmer, who had repeatedly said all week he had full confidence in McSweeney. No 10 was trying to hold on to the PM's right-hand man, who had worked with Starmer from opposition, through the election campaign and into power. As late as Sunday morning, cabinet minister Pat McFadden was saying that he did not think McSweeney should go over the Mandelson appointment. Read more: From Svengali to sacked, who is Morgan McSweeney? \n                  Politics latest: Chief of staff Morgan McSweeney was 'in two minds' about resigning - as Sir Keir Starmer reacts to exit\n                 \n                  From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?\n                 \n                  Starmer's chief of staff quits over Mandelson row\n                 That the government changed course reveals the deep peril Starmer is in. Faced with a chorus of anger from MPs that showed no sign of abating, No 10 offered a scalp. The hope will be that Mr McSweeney's departure from the heart of the No 10 operation will go some way to satisfying some of his MPs who were demanding a reset. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Baroness Harman, typically a government loyalist, led the charge on our Electoral Dysfunction podcast when she warned the prime minister that blaming Mandelson for misleading him was not enough. She argued that to save his premiership, he had to take responsibility by clearing out those who had advised Starmer to appoint Mandelson to Washington, embarking on a genuine programme to clean up politics as he promised in the manifesto and bringing forward action tackling violence against women and girls. Former prime minister Gordon Brown, backing Starmer as a \"man of integrity\" on Saturday, said the situation was \"serious\" and suggested the Labour leader had been \"too slow to do the right things\" to clean up politics in the wake of the Peter Mandelson row. This weekend, the PM has clearly heeded some of the unsolicited advice, but make no mistake that the departure of McSweeney comes from a position of acute weakness. This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post. In the longer-term, it might only serve to weaken him further now that his key ally and fixer has gone. He has just lost the backbone of his operation. There will undoubtedly be more blood-letting, and allies of McSweeney say he was one of a number of people to advise the PM on Mandelson's appointment - he provided advice but was not the one who made the decision. McSweeney was a powerful force in the party, with a great many allies across the whole of government. There will be anger from many that the man who masterminded the election win and got Keir Starmer into the Labour leader position and then into No 10 has been cut adrift. As one former colleague of McSweeney texted me soon after the news broke, \"[Morgan] was not just a brilliant colleague but a moral and decent man who supported his staff through thick and thin. The PM should have put this down as a mistake and rejected his resignation\". Read more:Mandelson could be made to hand back 'five-figure' payoffGordon Brown on former ally Peter Mandelson Senior Labour sources told me McSweeney had been wrestling with what to do over the weekend and was feeling \"very down\", but the decision became \"inevitable\" due to the \"gravity of the situation\". McSweeney said in his resignation statement that he took \"full responsibility\" for advising the PM to appoint Mandelson. \"In public life, responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside.\" There will be some in his party who believe the PM cannot recover from this scandal, that it has gone too far to be repaired with the country and with the Labour Party. McSweeney's departure will not solve that. One minister told me after McSweeney's departure that the mood remained \"frenetic\" with MPs unsure how this would all play out, although the minister also thought it would \"help Keir for a bit\". Starmer will attempt this week to enact advice from Baroness Harman and former PM Brown, with one No 10 source saying the PM \"recognises the need for government to address the issues highlighted by the Mandelson revelations\". The PM instructed officials to move at pace to deliver on the PM's election pledge to \"clean up politics\", and will say more next week, starting with an address to his PLP on Monday night. But one senior figure told me that the reset in No 10 and scale of change will have to be really significant if Starmer wants to hold on: \"I don't think they appreciate how big a move will be needed to rebuild and stabilise the party.\" What is clearer is that the No 10 operation is now in full-blown survival mode. But past experience shows that when that operation goes into freefall, it's near impossible to stabilise."
    },
    {
        "title": "Should Lindsey Vonn have even been at the Winter Olympics?",
        "description": "Lindsey Vonn, 41, said she was willing to risk everything to become the oldest Alpine skiing medallist.",
        "url": "https://news.sky.com/story/should-lindsey-vonn-have-even-been-at-the-winter-olympics-13505059",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsey-vonn-winter-olympics_7159046.jpg?20260208121053",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2026-02-08 21:17:00",
        "Headline": "She came out of retirement last year at the age of 41, chasing the dream of a second Olympic gold to add to her 2010 downhill title.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Lindsey Vonn, 41, said she was willing to risk everything to become the oldest Alpine skiing medallist. Not even rupturing the ACL in her left knee racing nine days before the event was going to stop the 41-year-old American. \"As long as there's a chance,\" she said after arriving in Italy, \"I will try.\" Hers was the most-anticipated event. It would have been even without the drama of the injury in Switzerland. Even if you are not the biggest Winter Olympics fan, you probably know her name. She came out of retirement last year at the age of 41, chasing the dream of a second Olympic gold to add to her 2010 downhill title. Could her body cope? Not only with the fresh injury, but racing on a right knee that was rebuilt from an injury in 2013. There was shock and despair in Cortina when she crashed 13 seconds out of the starting gate. The fall may have been softened by the mandatory safety airbag that inflated after losing control, but screams could be heard from Vonn after landing awkwardly at high speed. And in a repeat of the scenes witnessed nine days earlier in Crans-Montana, she was taken to hospital on a stretcher dangling from the bottom of a helicopter. Medics will now be assessing the long-term damage caused following surgery on her broken left leg. It could be a dramatic and horrific end to the career of one of the most successful female skiers of all time. Read more:Water cannon and tear gas fired at Olympics protestersOpening ceremony crowd ignored plea not to boo And questions will be asked whether the American team should have allowed Vonn to compete and whether it was a risk too far."
    },
    {
        "title": "Briton Jimmy Lai sentenced to 20 years after national security conviction in Hong Kong",
        "description": "Pro-democracy campaigner Jimmy Lai has been sentenced to 20 years in prison after being convicted of national security offences in Hong Kong.",
        "url": "https://news.sky.com/story/briton-jimmy-lai-sentenced-to-20-years-after-national-security-conviction-in-hong-kong-13505129",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jimmy-lai-court-of-final-appeal_7159679.jpg?20260209002717",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 23:50:00",
        "Headline": "The pro-democracy campaigner was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong.",
        "Content": "Pro-democracy campaigner Jimmy Lai has been sentenced to 20 years in prison after being convicted of national security offences in Hong Kong. The media tycoon and British citizen was found guilty ​of two counts of conspiracy to collude with foreign forces and one ​count of publishing seditious materials in December last year. The 78-year-old had denied all the charges against him, ‌saying in court he was a \"political prisoner\" facing persecution from Beijing. His lawyer gave no comment when asked if he would appeal his sentence. Lai, who founded the now-defunct pro-democracy newspaper Apple Daily, was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong. The longstanding critic of ⁠the Chinese Communist Party had previously been sentenced for several lesser offences during his five years in prison. Lai's plight has been criticised by world leaders including US President Donald Trump and UK ‍Prime Minister Sir KeirStarmer. \n                  Labour MPs urge Home Office to ensure settled status changes do not pull support for Hong Kongers\n                 \n                  Trump says he has asked Xi Jinping to free Briton Jimmy Lai\n                 \n                  Briton Jimmy Lai found guilty of national security offences in Hong Kong\n                 Sir Keir discussed the case with ‌Chinese leader Xi Jinping last month in Beijing's Great Hall of the People, according to people briefed on the talks. Britain's national security adviser, Jonathan Powell, and China's foreign minister, Wang ​Yi, were also present. \"I raised the case of Jimmy Lai and called for his release,\" Sir Keir told MPs in parliament after his trip. \"Those discussions will continue, and the foreign secretary is in touch with Mr Lai's family.\" Several Western diplomats told Reuters news agency that negotiations to free Lai would likely start in earnest after his sentencing and depending on whether he will appeal. Lai was born in mainland China but fled to Hong Kong at the age of 12, after stowing away on a fishing boat. Here, he began working as a child labourer in a garment factory. He went on to build a fortune with the fashion empire Giordano and, after the 1989 Tiananmen Square massacre, when thousands of people protested for political reforms in Beijing, he became a democracy advocate and turned his hand to newspapers.\n\n Ahead of the 1997 handover of Hong Kong from the UK to China, he started the Chinese-language newspaper Apple Daily in an attempt to maintain freedom of speech. The paper was staunchly pro-democratic and did not shy away from criticising authorities in Beijing. Around the same time, in 1994, he became a full British citizen. He has never held a Chinese or Hong Kong passport, but is seen as a Chinese citizen by Hong Kong authorities. It was his pro-democratic beliefs that led to Lai becoming a key figure in the 2019 protests in Hong Kong, spurred by Beijing's tightening squeeze on wide-ranging freedoms. Lai's Apple Daily newspaper backed the protesters, criticising the government reforms. Lai and his sons were arrested in August 2020 after police raided the offices of the Apple Daily publisher, Next Digital. He was granted bail, but this was overturned in December of the same year, when Lai was charged with fraud. He was charged under the very national security laws, put in place in 2020, that he had protested. On 15 December, he was found guilty of collusion with foreign forces, as well as conspiracy to print and distribute seditious publications. Read more about Jimmy Lai here This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Super Bowl 60 LIVE: New England Patriots face Seattle Seahawks in California",
        "description": null,
        "url": "https://news.sky.com/story/super-bowl-60-live-new-england-patriots-face-seattle-seahawks-in-california-13505122",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-superbowl-new-england-patriots_7159676.jpg?20260209002114",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 22:54:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "'China is watching': Election victory for Japan's PM Sanae Takaichi could threaten stability of region",
        "description": "However you cut it, this is a one-woman story.",
        "url": "https://news.sky.com/story/china-is-watching-election-victory-for-japans-pm-sanae-takaichi-could-threaten-stability-of-region-13505093",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-takaichi-japan_7159625.jpg?20260208214700",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-02-08 20:57:00",
        "Headline": "Sanae Takaichi has landed a mandate, a landslide so decisive that just a few months ago it would barely have been believed.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n However you cut it, this is a one-woman story. Sanae Takaichi has landed a mandate, a landslide so decisive that just a few months ago it would barely have been believed. And it could well change Japan and this region. When she assumed the leadership of the ruling Liberal Democratic Party (LDP) in October, following the resignation of her unpopular predecessor, the government she inherited was floundering; losing seats, losing trust and struggling to recover from a financial scandal. In just four months, she's managed to turn this into a supermajority, winning more seats than her party ever has since it was founded in the 1950s. Alongside her coalition partner, she now has the numbers to not only change the constitution but override any challenge from the consultative upper house of Japan's National Diet. It is, in essence, a carte blanche for her to see through her vision. And see it through, she almost certainly will. Indeed, many people we spoke to here cited her straight talking, consistent and \"get-it-done\" approach as being one of her biggest attractions. \"I think Japan will get better and better,\" smiled one man enthusiastically at an LDP candidate's watch party. But Takaichi also comes with clear convictions about what it is she stands for and what she wants to achieve. Indeed, behind the drum-playing, selfie-taking and motorbike-riding force that has undoubtedly livened up a normally pretty dry political scene, she has an ultra conservative vision and a resolutely nationalist outlook. Among the changes she is most likely to make are increasing Japan's defence spending and altering the constitution to explicitly recognise its armed forces. Read more:Japan's China-provoking PM raises the stakesCan Japan's first female PM tighten her grip on power? This is controversial, as officially Japan is still a pacifist country whose forces are only meant to defend. But support for these changes seems remarkably broad, even among younger voters. Indeed, at a gathering of students watching the results together in Tokyo, the idea that Japan should be more confident, even assertive, was clearly a motivating factor, a sense, perhaps, that post-war apologism is now somewhat outdated. \"She used the catchphrase 'strong and prosperous Japan', and until now Japan's prime ministers had not taken such a clear stance on national defence\", says one young woman. \"By using the word 'strong', I feel like it kind of broke through that sense of stagnation and cleared it away.\" But be in no doubt, China is watching, and it does not like what it sees. Aside from having suffered enormously under Japanese aggression during the Second World War, Takaichi has also made comments about the so-called Taiwan question that China finds deeply provoking. The result has been a plunge in relations to their lowest ebb in over a decade. Her victory will do nothing to fix that. In the end, there could hardly have been a more decisive endorsement of everything Takaichi stands for: her conservatism, her nationalism, her vision for a more confident, more militarised Japan. It matters not just because of what it says about changing sentiments here - a notable shift to the right - but also because of what it might mean for the stability of this region."
    },
    {
        "title": "Russian citizen detained in Dubai over shooting of general in Moscow",
        "description": "A Russian citizen has been detained in Dubai over the shooting of a general in Moscow.",
        "url": "https://news.sky.com/story/russian-citizen-detained-in-dubai-over-shooting-of-general-in-moscow-13504947",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vladimir-alexeyev_7157374.jpg?20260206125557",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 17:29:00",
        "Headline": "A Russian citizen named Lyubomir Korba was arrested on suspicion of carrying out the shooting targeting Lieutenant General Vladimir ‍Alexeyev on Friday, Russia's Federal Security Service (FSB) said.",
        "Content": "A Russian citizen has been detained in Dubai over the shooting of a general in Moscow. The Federal Security Service (FSB), the main successor to the Soviet-era KGB secret police, said in a statement that a Russian citizen named Lyubomir Korba was arrested on suspicion of shooting Lieutenant General Vladimir ‍Alexeyev on Friday. \"With the assistance of partners from the United Arab Emirates... [he] was detained in Dubai and handed over to the Russian side,\" the security service said. Korba has since been flown back to Russia, according to security officials. Lt Gen Alexeyev was shot three times with a Makarov pistol equipped with a silencer in an apartment block on the Volokolamsk highway in northern Moscow, according to investigators. The perpetrator then fled the scene. The 64-year-old was rushed to hospital and underwent surgery, Russian media said. Russian investigators have accused Ukraine of planning the shooting, but Kyiv has denied involvement. Investigators said Korba, born in the Ternopil region of Soviet Ukraine in 1960, was tasked by Ukrainian intelligence to carry out the shooting. \n                  Mystery as Russian general shot at close range - with equally curious response from the Kremlin\n                 \n                  We have entered a world without nuclear arms control as US-Russia treaty expires\n                 \n                  'I still would like to meet Putin': Epstein's unrequited love for Russian leader\n                 The FSB said it had identified two accomplices, also Russian citizens. One, Viktor Vasin, was detained in Moscow, while another, Zinaida Serebritskaya, escaped to Ukraine. Sky News was unable to immediately verify the details of the suspects. The UAE did not give any details about how Korba was detained. Vladimir Putin called the UAE leader, Mohammed bin Zayed Al Nahyan, after the detention of Korba and thanked him for his country's help in the operation, according to Kremlin spokesman Dmitry Peskov. Meanwhile, Russia launched an attack on several Ukrainian regions overnight. Ukraine's air force said 101 attack drones were fired towards the country, with the force repelling the majority. Apartments in the Donetsk region and nearby cars caught fire after a drone strike. One person died, and two others have been injured. The overnight attack came almost 24 hours after Russia launched a large-scale attack on Ukraine's energy infrastructure. More than 400 drones and 40 missiles were fired in that attack as the harshest winter in the near four-year war grips Ukraine. Volodymyr Zelenskyy introduced new sanctions in response to the strikes on Ukraine's energy infrastructure. Read more:Mystery as Russian general shot at close rangeRussian drone strike on bus in Ukraine kills 12 \"Producing this weaponry would be impossible without critical foreign components, which the Russians continue to obtain by circumventing sanctions,\" the Ukrainian leader wrote in a social media post. \"We are introducing new sanctions precisely against such companies - component suppliers, as well as missile and drone manufacturers. I have signed the relevant decisions.\""
    },
    {
        "title": "Lindsey Vonn 'in stable condition' after terrifying crash at Winter Olympics",
        "description": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final.",
        "url": "https://news.sky.com/story/lindsey-vonn-crashes-in-downhill-skiing-final-at-winter-olympics-13504857",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winter-olympics-skiing_7159025.jpg?20260208113427",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 11:18:00",
        "Headline": "US skiing legend Vonn, 41, was competing despite rupturing her ACL less than two weeks ago in Switzerland.",
        "Content": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final. The 41-year-old American had already ruptured her ACL in a crash at a World Cup race in Switzerland on 30 January but was determined to compete at the Winter Olympics on Sunday nevertheless. Just 13 seconds into her final run in Cortina, northern Italy, on Sunday, Vonn crashed on the piste, having clipped a slalom gate while mid-air. The Team USA athlete was heard screaming after the crash as she was surrounded by medical personnel for several minutes. Read more: Analysis - Should Lindsey Vonn have even been at the Winter Olympics? Vonn was then strapped to a gurney and flown to a hospital in Cortina by helicopter. She was later transferred to a larger hospital in Treviso. In a statement, quoted on olympics.com on Sunday night, Ca' Foncello Hospital in Treviso said Vonn \"underwent orthopaedic surgery to stabilise a fracture in her left leg\". Her team confirmed she was \"in stable condition and in good hands with a team of American and Italian physicians\". Anouk Patty, chief of sport for US Ski and Snowboard, said: \"She'll be OK, but it's going to be a bit of a process. \"This sport's brutal and people need to remember when they're watching (that) these athletes are throwing themselves down a mountain and going really, really fast.\" People in the crowd, including rapper Snoop Dogg, watched as Vonn crashed and was taken away from the course. The skier's father was also in the stands and stared at the ground while she was being treated. Vonn's teammate, Breezy Johnson, won the women's downhill, becoming the second American woman to take the Olympic downhill gold. Vonn was the first US woman to accomplish the feat. Vonn was considered a medal hopeful despite her ruptured ACL and completed two impressive training runs earlier this week. She had returned to elite ski racing last season after nearly six years in retirement, having had a partial titanium knee replacement in her right knee. As well as the ruptured ACL, she also had a bone bruise and meniscus damage."
    },
    {
        "title": "Japan's ultra conservative prime minister set to seize more power, exit poll shows",
        "description": "Japan's ultra conservative prime minister is set to seize more power after an exit poll suggested she has secured a big majority in the lower house following a snap election.",
        "url": "https://news.sky.com/story/japans-ultra-conservative-prime-minister-set-to-seize-more-power-exit-poll-shows-13504853",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-takaichi-japan_7157766.jpg?20260206194849",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 11:02:00",
        "Headline": "Sanae Takaichi's coalition is predicted to win between 302 and 366 of the 465 seats in the lower house.",
        "Content": "Japan's ultra conservative prime minister is set to seize more power after an exit poll suggested she has secured a big majority in the lower house following a snap election. Sanae Takaichi's coalition is predicted to win between 302 and 366 of the 465 seats in the chamber, according to national broadcaster NHK. That is well above the 233 needed for a majority. In tandem with their coalition partners, her government is actually projected to have a two-thirds majority in the house, the NHK decision desk says. It comes after Ms Takaichi, 64, called the winter election, seeking to capitalise on her own high approval ratings. Betting on herself, she pledged to secure a majority or step down. A former heavy metal drummer, she says immigration and tourism has led to \"foreigner fatigue\" in Japan, and her nationalist rhetoric has stoked tensions with China. \n                  'China is watching': Election victory for Japan's PM Sanae Takaichi could threaten stability of region\n                 \n                  Japan's drum-playing, Trump-hugging, China-provoking PM Sanae Takaichi raises the stakes\n                 \n                  Can Japan's first female PM, ultra conservative Sanae Takaichi, tighten her grip on power?\n                 She's also anti-gay marriage and a vocal defender of traditional gender roles, and sees late British prime minister Margaret Thatcher as a role model. Furthermore, her government plans to step away from Japan's post-war pacifist principles, bolstering the military and lifting a ban on weapons exports. Ms Takaichi became the nation's first female prime minister in October, pledging to \"work, work, work\" and nurturing an upbeat image. She's won support among younger voters and her personal style has been praised by fans, with admirers now facing a nine-month wait to purchase her signature Hamano black bag. And she's curried favour with Donald Trump; he appeared alongside her during a visit last year, gave her his endorsement, and called her a \"winner\", before saying they were \"very close friends\". Read more:Japan's drum-playing, Trump-hugging, China-provoking PMCan Japan's first female PM tighten her grip on power She became prime minister after taking charge of the struggling Liberal Democratic Party (LDP), whose fortunes she is credited with transforming. The party had grown accustomed to power, having governed almost continuously since its foundation in 1955, except for two brief windows - from 1993 to 1996, and from 2009 to 2012. But it suffered setbacks in recent years, enduring one of its worst electoral performances ever in 2024 amid a backdrop of a financial scandal and economic stagnation, and losing its majority in the lower house. The lower house, or House of Representatives, is the more powerful of the two chambers that comprise the National Diet - the Japanese equivalent of parliament. Since last year, Ms Taikichi's LDP has governed in coalition with its junior partner, the Japan Innovation Party, also known as Ishin. A stronger hand in the lower house will empower her government to make progress on its right-wing agenda, including passing a record-setting 122.3 trillion yen (£571bn) budget. And with the projected two-thirds majority, she can override the Diet's upper chamber, the House of Councillors, which she does not control. US treasury secretary Scott Bessent, reacting to the result on Fox News, called the prime minster \"a great ally\" and said she had a \"great ‍relationship with the president\". Lai Ching-te, president of Taiwan, offered his \"heartfelt congratulations\" in a post on X, formerly Twitter. He added: \"May your victory bring an even more prosperous and secure future for Japan and its regional partners.\""
    },
    {
        "title": "Man arrested after student found dead in her university accommodation",
        "description": "A man has been arrested on suspicion of the murder of a 19-year-old student.",
        "url": "https://news.sky.com/story/man-arrested-after-student-found-dead-in-her-university-accommodation-13505096",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-university-of-lancashire_7159602.png?20260208224932",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-08 20:35:00",
        "Headline": "Ms Georgescu was in her second year at the university studying clinical psychology.",
        "Content": "A man has been arrested on suspicion of the murder of a 19-year-old student. Carla Georgescu was found dead at her University of Lancashire accommodation in Victoria Street, Preston, on Thursday afternoon, Lancashire Constabulary said. Officers attended the address after reports of a \"sudden death\". Her death is being treated as suspicious. Ms Georgescu was in her second year, studying clinical psychology. A 34-year-old man, known to Ms Georgescu, has been arrested and remains in custody on suspicion of murder. Read more UK news:Fresh heavy rain warning issued amid hundreds of flood alertsMoped rider killed in alleged hit-and-run with car \"We know that news of this young woman's death and the police activity will be concerning to many, but we want to tell you that we have a team of detectives and uniformed officers working hard to try and establish the circumstances,\" said a police spokesperson. The force said they are not looking for anyone else in connection with the investigation. A University of Lancashire spokesperson said staff and students were \"deeply saddened by the tragic loss\". \"The wellbeing and safety of our students and staff is our priority,\" said their statement. \"Support is being offered to anyone within our university community who is affected by this devastating incident, and our thoughts are very much with loved ones, friends and all those who knew our student at this incredibly distressing time.\""
    },
    {
        "title": "Morgan McSweeney's exit shows No 10 in full-blown survival mode",
        "description": "In the end, the PM had little option.",
        "url": "https://news.sky.com/story/morgan-mcsweeneys-exit-shows-no-10-in-full-blown-survival-mode-13504982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-morgan-mcsweeney-labour_7159197.jpg?20260208143657",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-08 16:12:00",
        "Headline": "This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post.",
        "Content": "\n          Political editor\n              @BethRigby\n In the end, the PM had little option. Faced with an escalating crisis and ever-louder calls from his MPs that someone had to take responsibility for the Mandelson scandal, the PM's chief of staff, Morgan McSweeney, is gone. Politics latest: Starmer reacts as chief of staff Morgan McSweeney resigns It will be a bitter blow for Starmer, who had repeatedly said all week he had full confidence in McSweeney. No 10 was trying to hold on to the PM's right-hand man, who had worked with Starmer from opposition, through the election campaign and into power. As late as Sunday morning, cabinet minister Pat McFadden was saying that he did not think McSweeney should go over the Mandelson appointment. Read more: From Svengali to sacked, who is Morgan McSweeney? \n                  Politics latest: Chief of staff Morgan McSweeney was 'in two minds' about resigning - as Sir Keir Starmer reacts to exit\n                 \n                  From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?\n                 \n                  Starmer's chief of staff quits over Mandelson row\n                 That the government changed course reveals the deep peril Starmer is in. Faced with a chorus of anger from MPs that showed no sign of abating, No 10 offered a scalp. The hope will be that Mr McSweeney's departure from the heart of the No 10 operation will go some way to satisfying some of his MPs who were demanding a reset. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Baroness Harman, typically a government loyalist, led the charge on our Electoral Dysfunction podcast when she warned the prime minister that blaming Mandelson for misleading him was not enough. She argued that to save his premiership, he had to take responsibility by clearing out those who had advised Starmer to appoint Mandelson to Washington, embarking on a genuine programme to clean up politics as he promised in the manifesto and bringing forward action tackling violence against women and girls. Former prime minister Gordon Brown, backing Starmer as a \"man of integrity\" on Saturday, said the situation was \"serious\" and suggested the Labour leader had been \"too slow to do the right things\" to clean up politics in the wake of the Peter Mandelson row. This weekend, the PM has clearly heeded some of the unsolicited advice, but make no mistake that the departure of McSweeney comes from a position of acute weakness. This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post. In the longer-term, it might only serve to weaken him further now that his key ally and fixer has gone. He has just lost the backbone of his operation. There will undoubtedly be more blood-letting, and allies of McSweeney say he was one of a number of people to advise the PM on Mandelson's appointment - he provided advice but was not the one who made the decision. McSweeney was a powerful force in the party, with a great many allies across the whole of government. There will be anger from many that the man who masterminded the election win and got Keir Starmer into the Labour leader position and then into No 10 has been cut adrift. As one former colleague of McSweeney texted me soon after the news broke, \"[Morgan] was not just a brilliant colleague but a moral and decent man who supported his staff through thick and thin. The PM should have put this down as a mistake and rejected his resignation\". Read more:Mandelson could be made to hand back 'five-figure' payoffGordon Brown on former ally Peter Mandelson Senior Labour sources told me McSweeney had been wrestling with what to do over the weekend and was feeling \"very down\", but the decision became \"inevitable\" due to the \"gravity of the situation\". McSweeney said in his resignation statement that he took \"full responsibility\" for advising the PM to appoint Mandelson. \"In public life, responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside.\" There will be some in his party who believe the PM cannot recover from this scandal, that it has gone too far to be repaired with the country and with the Labour Party. McSweeney's departure will not solve that. One minister told me after McSweeney's departure that the mood remained \"frenetic\" with MPs unsure how this would all play out, although the minister also thought it would \"help Keir for a bit\". Starmer will attempt this week to enact advice from Baroness Harman and former PM Brown, with one No 10 source saying the PM \"recognises the need for government to address the issues highlighted by the Mandelson revelations\". The PM instructed officials to move at pace to deliver on the PM's election pledge to \"clean up politics\", and will say more next week, starting with an address to his PLP on Monday night. But one senior figure told me that the reset in No 10 and scale of change will have to be really significant if Starmer wants to hold on: \"I don't think they appreciate how big a move will be needed to rebuild and stabilise the party.\" What is clearer is that the No 10 operation is now in full-blown survival mode. But past experience shows that when that operation goes into freefall, it's near impossible to stabilise."
    },
    {
        "title": "From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?",
        "description": "For those wishing to understand the Starmer project, it is hard to overstate how crucial a role Morgan McSweeney played.",
        "url": "https://news.sky.com/story/from-svengali-to-sacked-who-is-morgan-mcsweeney-the-prime-ministers-departed-chief-of-staff-13432116",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-morgan-mcsweeney-labour_7159221.jpg?20260208145126",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-08 14:13:00",
        "Headline": "He was credited with winning the 2024 general election for Labour after years in the wilderness - but he now joins a long list of aides Sir Keir Starmer has lost since that landslide victory.",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n For those wishing to understand the Starmer project, it is hard to overstate how crucial a role Morgan McSweeney played. Born in Macroom, County Cork, Mr McSweeney got his big break for Labour working at Lambeth Council with Steve Reed, the current housing secretary, who would later introduce him to the man who would go on to be Labour leader. Working at the south London council gave McSweeney his first taste of taking on his opponents of the left - a theme that would come to define his ascent to the very top of the Labour Party. Latest updates from Politics HubStarmer's top aide Morgan McSweeney resigns A central component of Labour winning back control of Lambeth in 2006 under Mr Reed was Mr McSweeney's campaign to remove all traces of the hard left from the party, which had dominated in the 1980s and 1990s under \"Red\" Ted Knight, who had been expelled from Labour in the 1950s as it carried out a purge of Trotskyists. Fast forward to 2017, and Labour was under the leadership of Jeremy Corbyn - someone Mr McSweeney regarded as equally unsuited to power as the hard left figures in Lambeth. That same year, he became director of Labour Together, a thinktank that challenged the narrative and ideology of the left under Mr Corbyn and which later helped Sir Keir win the 2020 Labour leadership election. After running Sir Keir's leadership bid, Mr McSweeney was appointed as his chief of staff, where he was accused of marginalising the left further, for example, by hampering their ability to stand for parliament by controlling shortlists. It was at this time that concerns about Mr McSweeney's influence and control over Sir Keir began to surface. The criticism directed at Sir Keir was that, with his lack of political background and instincts (he did not, for instance, work his way up through the Labour Party or the trade union movement), he created a vacuum for decision-making that could be occupied for better or worse by Mr McSweeney. I remain fully supportive of the Prime Minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. The decision to appoint Peter Mandelson was wrong. He has damaged our party, our country and trust in politics itself. \n When asked, I advised the prime minister to make that appointment and I take full responsibility for that advice. In public life responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside. This has not been an easy decision. Much has been written and said about me over the years but my motivations have always been simple: I have worked every day to elect and support a government that puts the lives of ordinary people first and leads us to a better future for our great country. Only a Labour government will do that. I leave with pride in all we have achieved mixed with regret at the circumstances of my departure. But I have always believed there are moments when you must accept your responsibility and step aside for the bigger cause. As I leave I have two further reflections:\n Firstly, and most importantly, we must remember the women and girls whose lives were ruined by Jeffrey Epstein and whose voices went unheard for far too long.\n Secondly, while I did not oversee the due diligence and vetting process, I believe that process must now be fundamentally overhauled. This cannot simply be a gesture but a safeguard for the future.\n I remain fully supportive of the prime minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. It is through this lens that some have viewed Peter Mandelson's appointment as US ambassador and the subsequent scandal that resulted in him quitting the House of Lords following the release of the Epstein files. They appeared to show that, as business secretary, Peter Mandelson forwarded sensitive market information to Epstein and that he had received $75,000 from the disgraced financier. Lord Mandelson's representatives have been contacted for comment. The prime minister was said to be not sold on the former spin doctor becoming his US ambassador, but that Mr McSweeney - a close ally of the Labour peer - pushed for his appointment. In light of the scandal surrounding Lord Mandelson anger against Mr McSweeney intensified, as did the political pressure to remove him. But Number 10 stuck by Sir Keir's chief of staff, with a spokesperson saying the prime minister had confidence in Mr McSweeney even as the scandal deepened. Even before that, Mr McSweeney became the target of frustration and anger among Labour MPs at the botched handling of welfare reforms. He was accused of treating MPs with disdain and of failing to grasp the extent of their concerns. In the end, it was only with the involvement of now departed Angela Rayner that MPs eventually decided to back a much watered-down version of cuts. And although these were attributed to \"allies\" of Sir Keir, Labour MPs demanded his head after briefings to journalists that the prime minister was facing an imminent coup attempt by Health Secretary Wes Streeting, which plunged No 10 into crisis. The real power behind the throne? Despite his success in making Labour electorally viable after years in opposition, Mr McSweeney encountered multiple bumps in the road. The most major was the fallout of the 2021 Hartlepool by-election, which saw the Tories win a seat that had been under Labour's control since it was created in the 1970s - a moment so devastating for the party that Sir Keir later admitted he considered resigning.  The Hartlepool by-election was also a major setback for Mr McSweeney, who was demoted as Sir Keir's chief of staff back to a campaign role. For his critics, the by-election saga was proof that Mr McSweeney, for all his campaigning prowess, was not suited to the role of chief of staff, with all of the administrative responsibilities and management skills required. However, it did not stop Sir Keir from moving Mr McSweeney back into the role to replace Sue Gray - the partygate investigator who was appointed shortly before Labour's election win - following a bitter power struggle inside Number 10. Again, for critics of the prime minister's operation, this episode stands out as one that revealed the extent of Mr McSweeney's influence over Sir Keir. The brutal nature of Ms Gray's departure, which came after weeks of anonymous negative briefings in the newspapers, seemed to some to provide a warning about Mr McSweeney's ruthlessness. Ms Gray was a close ally of Sir Keir and his pick for chief of staff - so for some, the way she was discarded acted as a foreshadowing of what the prime minister could expect to face if he ever found his leadership in peril - as he does now. The danger for Sir Keir is that he now has two former allies with an axe to grind - a spin doctor of the past and one of the present."
    },
    {
        "title": "Fresh heavy rain warning issued amid hundreds of flood alerts",
        "description": "The Met Office has issued a fresh weather warning for heavy rain, with more than 200 flood alerts still in place.",
        "url": "https://news.sky.com/story/met-office-issues-fresh-weather-warning-amid-hundreds-of-flood-alerts-13504847",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-fordingbridge-hampshire_7159079.jpg?20260208123521",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-08 10:29:00",
        "Headline": "There are also 89 flood warnings in place, according to the Environment Agency.",
        "Content": "The Met Office has issued a fresh weather warning for heavy rain, with more than 200 flood alerts still in place. The new yellow warning is for large parts of southern England and South Wales, and lasts from 12pm on Monday to midnight. Up to 30mm of rain is predicted to fall in some places. Affected areas include Hampshire, the Isle of Wight, Portsmouth, Southampton and West Sussex. In southwest England, areas include Cornwall, Devon, and Dorset, with Cardiff, Swansea and Newport among affected areas in Wales. See the weather forecast in your area The Met Office said: \"Bands of rain and heavy showers will move east across southern parts of England and Wales during Monday afternoon and evening.\" It added: \"10-15mm of rain is likely fairly widely with 20-30mm in some places exposed to the strong south to southeasterly winds.\" \n                  Politics latest: Chief of staff Morgan McSweeney was 'in two minds' about resigning - as Sir Keir Starmer reacts to exit\n                 \n                  Morgan McSweeney's exit shows No 10 in full-blown survival mode\n                 \n                  From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?\n                 The warning forecasts spray and flooding on roads \"probably making journey times longer\". Bus and train services will probably be impacted with flooding of a few homes and businesses possible, it added. Broadcast meteorologist • Aberdeen has had zero hours of sunshine since 21 January. It's the longest sunless period there since 1957. • Sheffield has had zero hours of sunshine so far this month.\n • Katesbridge had its wettest February day on record on 5 February - 67.2mm in 24 hours, beating the previous February site record of 42.2mm in 1985. • It's rained every day for the last 37 days in the UK - every day so far this year.\n • Several sites across the UK haven't had an entirely dry day since 30 December, which would mean rain on Sunday would be the 40th consecutive day. • Exeter Airport has not had a dry day since 31 December. • The UK as a whole has had below-average sunshine hours for winter so far. • Rainfall has been quite varied depending on where you live. For example, Eastern Scotland has been very wet, Western Scotland very dry. There will also be a chance of some interruption to power supplies and other services, it continued. Meanwhile, the Environment Agency has 89 flood warnings in place, mostly across southwest England and the East and West Midlands. There are also 218 flood alerts. A flood warning means flooding is expected, and an alert means flooding is possible. The Met Office said on Thursday that rain had fallen every day of 2026 so far in southwest England and South Wales. There has been 50% more rainfall than usual in both, the forecaster added. Both have experienced a far wetter than average January. Broadcast meteorologist So far, February is continuing where January left off - grey and wet. Cornwall had its wettest January on record and other parts of the British Isles weren't far behind. If you feel the rain has been relentless, you'd be right. Many places, including Exeter Airport, have recorded rainfall every single day this year. And all that cloud means very little sunshine, adding to the gloomy feel. Aberdeen went nearly two weeks without a glimmer of brightness, and at the moment eastern Scotland has recorded just 1% of their monthly sunshine for February. In just the first five days of February, the city of Aberdeen has also recorded more than their usual monthly rainfall. And the Isle of Wight isn't far behind, currently at 97% of their February rainfall and rising. For context, you would expect them to be around 18% at this stage of the month. So what's going on? The culprit, as it often the case with our weather, is the jet stream. This fast-moving ribbon of air high in our atmosphere steers areas of low pressure around on the ground. Instead of flowing nicely from west to east, it's currently meandering down to the south and this wavy jet has led to blocked weather patterns. Scandinavia is under a large area of high pressure, with settled and largely dry conditions, but we've been stuck with low after low, and a dominant southeasterly airflow has sent bands of showery rain northwards across the country. The jet stream's southerly position has also meant a lot more rain across southern parts of the UK. It turns out northwest Scotland has been quietly enjoying the best of the dry and bright weather. When is it going to improve? There will be some drier and brighter spells between the rainbands but the overall unsettled outlook continues right into next month, not good news for those places already struggling. Until the weather pattern \"unblocks\", there is more rain to come. And things could turn colder with a risk of wintry hazards towards the end of next week. If it's any consolation, we're not alone with these exceptional rainfall totals. A succession of storms has battered Iberia, with Storm Marta the latest to affect Portugal, Spain and Gibraltar this weekend, following on a very wet January which saw some places receive three times the normal rainfall. Sarah Cook, flood duty manager at the Environment Agency, said: \"Our thoughts are with all those affected by the ongoing impacts of Storm Chandra, including those whose homes and businesses have sadly been flooded. \"Significant ongoing groundwater flooding impacts remain probable in parts of Dorset and Wiltshire, with minor impacts probable for parts of Hampshire for the next five days, and West Sussex from Saturday. \"Environment Agency teams are out on the ground, to reduce the impact of flooding and support those communities affected. We urge people not to drive through flood water - it is often deeper than it looks and just 30cm of flowing water is enough to float your car.\""
    },
    {
        "title": "'Kids do love reading, if you give them the right stuff': Campaign to get children back into books",
        "description": "How to get children reading again has become one of the highly debated questions in education.",
        "url": "https://news.sky.com/story/kids-do-love-reading-if-you-give-them-the-right-stuff-campaign-to-get-children-back-into-books-13504178",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anjum-peerbacos-literature-in-colour_7158900.jpg?20260208033512",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-02-08 00:01:00",
        "Headline": "Research carried out by Public First for Lit in Colour suggests 33% of young people say the books they read at school put them off reading, while 68% want an English curriculum that better reflects modern Britain.",
        "Content": "\n          Education reporter\n       How to get children reading again has become one of the highly debated questions in education. At the centre of it sits an argument over what young people should be reading at school, with the campaigners behind the Lit in Colour movement suggesting that the answer lies in reforming English Literature education. They argue that GCSE reading lists are out of step with modern Britain and fail to reflect the diversity of the society in which students live. Calling for a broader balance of voices, including more writers of colour, Lit in Colour claims changes could help reignite a love of reading among students who currently feel disengaged. Some pupils at The Swan School in Oxfordshire say they are already seeing the impact of the campaign. Saba told Sky News: \"Difference and diversity is important in literature because I think it helps everyone deepen that understanding of the world. \"It's also important that everyone can see themselves in literature.\" \n                  Julia Donaldson reveals new character for third Gruffalo\n                 \n                  An uncomfortable truth must be confronted to turn the tide on foster care\n                 \n                  New batch of Nestle baby formula recalled due to toxin\n                 The campaign has gained momentum as concerns grow about falling reading engagement. Research carried out by Public First for Lit in Colour suggests 33% of young people say the books they read at school put them off reading, while 68% want an English curriculum that better reflects modern Britain. Caspar, another student, said exposure to a wider range of voices has changed how he sees the world. \"I think it's made me more empathetic and open to other people's lives and what's going on,\" he told Sky News. \"You never really understand what's going through someone's life until you actually see what's happening.\" Caleb added that diverse voices in reading can make \"us aware that we can do anything, especially for me, being a young black man in this generation\". \"It makes me aware that I can do so much,\" he added And Bana said: \"It just leads on to different perspectives that some students might not be able to see or are not familiar with.\" On getting kids reading, Harriet Hintzer, head of English at The Swan School, told Sky News that campaigns like Lit in colour \"shows you once again that kids do love reading, if you give them the right stuff\". \"I think campaigns like Lit in Colour make it far easier than it used to be,\" she added. \"There are now a lot of resources available, and we're prepared to share them.\" The government's recent Curriculum and Assessment Review has recommended that schools ensure pupils study diverse books and poems, but campaigners argue the pace of change remains too slow. Critics warn however that expanding the curriculum risks diluting academic rigour, insisting that classic writers such as Shakespeare and Dickens should remain central pillars of English literature. Dr Alka Sehgal Cuthbert, educator and director at the anti-identity politics group Don't Divide Us, told Sky News: \"Shakespeare or Dickens are not just personifications of literary talent; they are human beings in a particular time and place. \"Their social and cultural experiences inform their work, but what makes them still of value today is their unique literary talent.\" Dr Cuthbert also argues that students are being \"sold short\" if literary quality is compromised, adding that diverse books \"might be what you want to read in your own time, for pleasure at home\". \"But,\" she said, \"they are simply not of sufficient literary quality to be on the curriculum.\" Currently, some exam boards include works by former Children's Laureate Malorie Blackman, Dame Meera Syal, Kit De Waal and Nobel Prize winner Kazuo Ishiguro. Some curricula also include works by the authors Chinua Achebe, Zadie Smith and Vikram Seth. Read more from Sky News:Doctors warn of 'horrific' impact of tech and devices on childrenNearly a third of kids can't use books when starting school The spokesperson for the Department for Education said: \"High and rising standards are at the heart of the government's mission to break down barriers to opportunity and ensure all children can achieve and thrive. \"As part of the government's response to the Curriculum and Assessment Review, we will ensure that alongside classic English literature, the curriculum will allow space for teachers to choose a wider range of texts and authors.\""
    },
    {
        "title": "Man arrested after student found dead in her university accommodation",
        "description": "A man has been arrested on suspicion of the murder of a 19-year-old student.",
        "url": "https://news.sky.com/story/man-arrested-after-student-found-dead-in-her-university-accommodation-13505096",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-university-of-lancashire_7159602.png?20260208224932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-08 20:35:00",
        "Headline": "Ms Georgescu was in her second year at the university studying clinical psychology.",
        "Content": "A man has been arrested on suspicion of the murder of a 19-year-old student. Carla Georgescu was found dead at her University of Lancashire accommodation in Victoria Street, Preston, on Thursday afternoon, Lancashire Constabulary said. Officers attended the address after reports of a \"sudden death\". Her death is being treated as suspicious. Ms Georgescu was in her second year, studying clinical psychology. A 34-year-old man, known to Ms Georgescu, has been arrested and remains in custody on suspicion of murder. Read more UK news:Fresh heavy rain warning issued amid hundreds of flood alertsMoped rider killed in alleged hit-and-run with car \"We know that news of this young woman's death and the police activity will be concerning to many, but we want to tell you that we have a team of detectives and uniformed officers working hard to try and establish the circumstances,\" said a police spokesperson. The force said they are not looking for anyone else in connection with the investigation. A University of Lancashire spokesperson said staff and students were \"deeply saddened by the tragic loss\". \"The wellbeing and safety of our students and staff is our priority,\" said their statement. \"Support is being offered to anyone within our university community who is affected by this devastating incident, and our thoughts are very much with loved ones, friends and all those who knew our student at this incredibly distressing time.\""
    },
    {
        "title": "D-Day survivor 'dedicated' to 'fallen comrades' dies aged 100",
        "description": "A veteran who survived the D-Day landings has died at the age of 100. ",
        "url": "https://news.sky.com/story/d-day-survivor-dedicated-to-fallen-comrades-dies-aged-100-13504960",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-stan-ford-dday_7159246.jpg?20260208152546",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-08 15:49:00",
        "Headline": "Stan Ford, of Bath, suffered life-changing injuries onboard the HMS Fratton when it was sunk off the coast of Normandy on 18 August 1944. ",
        "Content": "A veteran who survived the D-Day landings has died at the age of 100.  Stan Ford \"dedicated himself to keeping alive the memory of his fallen comrades\", according to the Normandy Memorial Trust. Mr Ford, of Bath, suffered life-changing injuries onboard the HMS Fratton when it was sunk off the coast of Normandy on 18 August 1944. It is believed the ship was sunk by a midget submarine. He became an ambassador for the British Normandy Memorial, helping to remember more than 22,442 servicemen and women who died on D-Day and during the Normandy campaign. The Normandy Memorial Trust said in tribute that it was \"deeply saddened\" to share the news of Mr Ford's death. It extended \"sincere condolences\" to his daughters, Lorraine and Julie, and to Mr Ford's family and friends. \"We were so fortunate that he visited the Memorial multiple times, all thanks to the support of Spirit of Normandy Trust. \"He dedicated himself to keeping alive the memory of his fallen comrades and was a true friend of the Memorial. \"Stan, we will miss you.\" The Taxi Charity For Military Veterans said Mr Ford was a \"man who lived a life of profound service and courage\". \"A survivor of the sinking of HMS Fratton in 1944, Stan spent his life keeping the memory of his 31 fallen comrades alive. \"From being a British Normandy Memorial Ambassador to his involvement with the Bristol Normandy Veterans, Stan's legacy is one of unwavering strength.\" It added: \"Fair winds and following seas, Stan. You will never be forgotten.\" Read more on D-Day:The story of 24 hours that changed the worldD-Day veterans share their stories of fighting on the beaches Thirty-one crew members died in the HMS Fratton attack on D-Day, with 38 surviving the explosion. Mr Ford was blasted into the water along with the gun platform he was operating at the time. He was pulled from the sea and taken to a field hospital on Gold Beach, but he had to walk with leg callipers ever since and fractured his spine due to the force of the explosion. In 2024, after the Royal British Legion's march past the Cenotaph, Mr Ford said: \"It's always a great honour to be back on occasions like this but I remember the guys that never came home on my ship when it was torpedoed. \"They never came home, and I always feel it's my duty to put in an appearance and thank God for those that did survive, and to pray for the ones who didn't.\" He added: \"I thank God every day that on the day the boat was sinking, I wasn't strapped in.\""
    },
    {
        "title": "Moped rider killed in alleged hit-and-run with car",
        "description": "A moped rider has died in an alleged hit-and-run in southwest London.",
        "url": "https://news.sky.com/story/moped-rider-killed-in-alleged-hit-and-run-with-car-13504893",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-crime-scene_7143300.jpg?20260123092345",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-08 15:48:00",
        "Headline": "Police are appealing for witnesses after a driver allegedly failed to stop at the scene of a deadly collision on Saturday night in Kingston.",
        "Content": "A moped rider has died in an alleged hit-and-run in southwest London. The rider collided with a car in Kingston, and the vehicle's driver failed to stop, according to the Metropolitan Police. The crash happened on Saturday at 11.37pm on Wood Street at the junction with Horse Fair. Police said the moped rider, a 22-year-old man, died at the scene. But the driver of the car, which is described as dark-coloured, allegedly drove off. Police are now trying to find the motorist. No arrests have been made at this stage, and specialist officers are supporting the victim's family. Detectives are appealing for witnesses, or anyone with information, including dash cam footage, to come forward."
    },
    {
        "title": "Convicted robber who absconded prison is found ",
        "description": "A convicted robber who absconded from prison has been found, police confirmed.",
        "url": "https://news.sky.com/story/convicted-robber-who-absconded-prison-is-found-13504965",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-northern-ireland-police_7000583.jpg?20250824215036",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-08 18:13:00",
        "Headline": "Scott Warner, 37, was reported missing from a roll call at Hollesley Bay.",
        "Content": "A convicted robber who absconded from prison has been found, police confirmed. Scott Warner, 37, was reported missing from a roll call at HMP Hollesley Bay, Woodbridge, Suffolk. He had been serving a sentence of four years and seven months for robbery and other offences. Essex Police confirmed on Sunday that Warner, who has links to Essex, was arrested in the Colchester area on Saturday evening. He has been taken into police custody and will be returned to the prison system. Read more:Michelin-star restaurant owner spiked woman's cocktail'Suffolk Strangler' told he'll die in prison Police thanked members of the public for their assistance after issuing appeals. HMP Hollesley Bay is a Category D open prison. Detainees are typically allowed to spend most of their day off-site for work, education or other resettlement purposes in these facilities."
    },
    {
        "title": "Japan's ultra conservative prime minister set to seize more power, exit poll shows",
        "description": "Japan's ultra conservative prime minister is set to seize more power after an exit poll suggested she has secured a big majority in the lower house following a snap election.",
        "url": "https://news.sky.com/story/japans-ultra-conservative-prime-minister-set-to-seize-more-power-exit-poll-shows-13504853",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-takaichi-japan_7157766.jpg?20260206194849",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-08 11:02:00",
        "Headline": "Sanae Takaichi's coalition is predicted to win between 302 and 366 of the 465 seats in the lower house.",
        "Content": "Japan's ultra conservative prime minister is set to seize more power after an exit poll suggested she has secured a big majority in the lower house following a snap election. Sanae Takaichi's coalition is predicted to win between 302 and 366 of the 465 seats in the chamber, according to national broadcaster NHK. That is well above the 233 needed for a majority. In tandem with their coalition partners, her government is actually projected to have a two-thirds majority in the house, the NHK decision desk says. It comes after Ms Takaichi, 64, called the winter election, seeking to capitalise on her own high approval ratings. Betting on herself, she pledged to secure a majority or step down. A former heavy metal drummer, she says immigration and tourism has led to \"foreigner fatigue\" in Japan, and her nationalist rhetoric has stoked tensions with China. \n                  'China is watching': Election victory for Japan's PM Sanae Takaichi could threaten stability of region\n                 \n                  Japan's drum-playing, Trump-hugging, China-provoking PM Sanae Takaichi raises the stakes\n                 \n                  Can Japan's first female PM, ultra conservative Sanae Takaichi, tighten her grip on power?\n                 She's also anti-gay marriage and a vocal defender of traditional gender roles, and sees late British prime minister Margaret Thatcher as a role model. Furthermore, her government plans to step away from Japan's post-war pacifist principles, bolstering the military and lifting a ban on weapons exports. Ms Takaichi became the nation's first female prime minister in October, pledging to \"work, work, work\" and nurturing an upbeat image. She's won support among younger voters and her personal style has been praised by fans, with admirers now facing a nine-month wait to purchase her signature Hamano black bag. And she's curried favour with Donald Trump; he appeared alongside her during a visit last year, gave her his endorsement, and called her a \"winner\", before saying they were \"very close friends\". Read more:Japan's drum-playing, Trump-hugging, China-provoking PMCan Japan's first female PM tighten her grip on power She became prime minister after taking charge of the struggling Liberal Democratic Party (LDP), whose fortunes she is credited with transforming. The party had grown accustomed to power, having governed almost continuously since its foundation in 1955, except for two brief windows - from 1993 to 1996, and from 2009 to 2012. But it suffered setbacks in recent years, enduring one of its worst electoral performances ever in 2024 amid a backdrop of a financial scandal and economic stagnation, and losing its majority in the lower house. The lower house, or House of Representatives, is the more powerful of the two chambers that comprise the National Diet - the Japanese equivalent of parliament. Since last year, Ms Taikichi's LDP has governed in coalition with its junior partner, the Japan Innovation Party, also known as Ishin. A stronger hand in the lower house will empower her government to make progress on its right-wing agenda, including passing a record-setting 122.3 trillion yen (£571bn) budget. And with the projected two-thirds majority, she can override the Diet's upper chamber, the House of Councillors, which she does not control. US treasury secretary Scott Bessent, reacting to the result on Fox News, called the prime minster \"a great ally\" and said she had a \"great ‍relationship with the president\". Lai Ching-te, president of Taiwan, offered his \"heartfelt congratulations\" in a post on X, formerly Twitter. He added: \"May your victory bring an even more prosperous and secure future for Japan and its regional partners.\""
    },
    {
        "title": "Briton Jimmy Lai sentenced to 20 years after national security conviction in Hong Kong",
        "description": "Pro-democracy campaigner Jimmy Lai has been sentenced to 20 years in prison after being convicted of national security offences in Hong Kong.",
        "url": "https://news.sky.com/story/briton-jimmy-lai-sentenced-to-20-years-after-national-security-conviction-in-hong-kong-13505129",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jimmy-lai-court-of-final-appeal_7159679.jpg?20260209002717",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-08 23:50:00",
        "Headline": "The pro-democracy campaigner was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong.",
        "Content": "Pro-democracy campaigner Jimmy Lai has been sentenced to 20 years in prison after being convicted of national security offences in Hong Kong. The media tycoon and British citizen was found guilty ​of two counts of conspiracy to collude with foreign forces and one ​count of publishing seditious materials in December last year. The 78-year-old had denied all the charges against him, ‌saying in court he was a \"political prisoner\" facing persecution from Beijing. His lawyer gave no comment when asked if he would appeal his sentence. Lai, who founded the now-defunct pro-democracy newspaper Apple Daily, was arrested in August 2020 after China imposed a national security law following massive anti-government protests in Hong Kong. The longstanding critic of ⁠the Chinese Communist Party had previously been sentenced for several lesser offences during his five years in prison. Lai's plight has been criticised by world leaders including US President Donald Trump and UK ‍Prime Minister Sir KeirStarmer. \n                  Labour MPs urge Home Office to ensure settled status changes do not pull support for Hong Kongers\n                 \n                  Trump says he has asked Xi Jinping to free Briton Jimmy Lai\n                 \n                  Briton Jimmy Lai found guilty of national security offences in Hong Kong\n                 Sir Keir discussed the case with ‌Chinese leader Xi Jinping last month in Beijing's Great Hall of the People, according to people briefed on the talks. Britain's national security adviser, Jonathan Powell, and China's foreign minister, Wang ​Yi, were also present. \"I raised the case of Jimmy Lai and called for his release,\" Sir Keir told MPs in parliament after his trip. \"Those discussions will continue, and the foreign secretary is in touch with Mr Lai's family.\" Several Western diplomats told Reuters news agency that negotiations to free Lai would likely start in earnest after his sentencing and depending on whether he will appeal. Lai was born in mainland China but fled to Hong Kong at the age of 12, after stowing away on a fishing boat. Here, he began working as a child labourer in a garment factory. He went on to build a fortune with the fashion empire Giordano and, after the 1989 Tiananmen Square massacre, when thousands of people protested for political reforms in Beijing, he became a democracy advocate and turned his hand to newspapers.\n\n Ahead of the 1997 handover of Hong Kong from the UK to China, he started the Chinese-language newspaper Apple Daily in an attempt to maintain freedom of speech. The paper was staunchly pro-democratic and did not shy away from criticising authorities in Beijing. Around the same time, in 1994, he became a full British citizen. He has never held a Chinese or Hong Kong passport, but is seen as a Chinese citizen by Hong Kong authorities. It was his pro-democratic beliefs that led to Lai becoming a key figure in the 2019 protests in Hong Kong, spurred by Beijing's tightening squeeze on wide-ranging freedoms. Lai's Apple Daily newspaper backed the protesters, criticising the government reforms. Lai and his sons were arrested in August 2020 after police raided the offices of the Apple Daily publisher, Next Digital. He was granted bail, but this was overturned in December of the same year, when Lai was charged with fraud. He was charged under the very national security laws, put in place in 2020, that he had protested. On 15 December, he was found guilty of collusion with foreign forces, as well as conspiracy to print and distribute seditious publications. Read more about Jimmy Lai here This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "'China is watching': Election victory for Japan's PM Sanae Takaichi could threaten stability of region",
        "description": "However you cut it, this is a one-woman story.",
        "url": "https://news.sky.com/story/china-is-watching-election-victory-for-japans-pm-sanae-takaichi-could-threaten-stability-of-region-13505093",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-takaichi-japan_7159625.jpg?20260208214700",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-02-08 20:57:00",
        "Headline": "Sanae Takaichi has landed a mandate, a landslide so decisive that just a few months ago it would barely have been believed.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n However you cut it, this is a one-woman story. Sanae Takaichi has landed a mandate, a landslide so decisive that just a few months ago it would barely have been believed. And it could well change Japan and this region. When she assumed the leadership of the ruling Liberal Democratic Party (LDP) in October, following the resignation of her unpopular predecessor, the government she inherited was floundering; losing seats, losing trust and struggling to recover from a financial scandal. In just four months, she's managed to turn this into a supermajority, winning more seats than her party ever has since it was founded in the 1950s. Alongside her coalition partner, she now has the numbers to not only change the constitution but override any challenge from the consultative upper house of Japan's National Diet. It is, in essence, a carte blanche for her to see through her vision. And see it through, she almost certainly will. Indeed, many people we spoke to here cited her straight talking, consistent and \"get-it-done\" approach as being one of her biggest attractions. \"I think Japan will get better and better,\" smiled one man enthusiastically at an LDP candidate's watch party. But Takaichi also comes with clear convictions about what it is she stands for and what she wants to achieve. Indeed, behind the drum-playing, selfie-taking and motorbike-riding force that has undoubtedly livened up a normally pretty dry political scene, she has an ultra conservative vision and a resolutely nationalist outlook. Among the changes she is most likely to make are increasing Japan's defence spending and altering the constitution to explicitly recognise its armed forces. Read more:Japan's China-provoking PM raises the stakesCan Japan's first female PM tighten her grip on power? This is controversial, as officially Japan is still a pacifist country whose forces are only meant to defend. But support for these changes seems remarkably broad, even among younger voters. Indeed, at a gathering of students watching the results together in Tokyo, the idea that Japan should be more confident, even assertive, was clearly a motivating factor, a sense, perhaps, that post-war apologism is now somewhat outdated. \"She used the catchphrase 'strong and prosperous Japan', and until now Japan's prime ministers had not taken such a clear stance on national defence\", says one young woman. \"By using the word 'strong', I feel like it kind of broke through that sense of stagnation and cleared it away.\" But be in no doubt, China is watching, and it does not like what it sees. Aside from having suffered enormously under Japanese aggression during the Second World War, Takaichi has also made comments about the so-called Taiwan question that China finds deeply provoking. The result has been a plunge in relations to their lowest ebb in over a decade. Her victory will do nothing to fix that. In the end, there could hardly have been a more decisive endorsement of everything Takaichi stands for: her conservatism, her nationalism, her vision for a more confident, more militarised Japan. It matters not just because of what it says about changing sentiments here - a notable shift to the right - but also because of what it might mean for the stability of this region."
    },
    {
        "title": "Should Lindsey Vonn have even been at the Winter Olympics?",
        "description": "Lindsey Vonn, 41, said she was willing to risk everything to become the oldest Alpine skiing medallist.",
        "url": "https://news.sky.com/story/should-lindsey-vonn-have-even-been-at-the-winter-olympics-13505059",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsey-vonn-winter-olympics_7159046.jpg?20260208121053",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2026-02-08 21:17:00",
        "Headline": "She came out of retirement last year at the age of 41, chasing the dream of a second Olympic gold to add to her 2010 downhill title.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Lindsey Vonn, 41, said she was willing to risk everything to become the oldest Alpine skiing medallist. Not even rupturing the ACL in her left knee racing nine days before the event was going to stop the 41-year-old American. \"As long as there's a chance,\" she said after arriving in Italy, \"I will try.\" Hers was the most-anticipated event. It would have been even without the drama of the injury in Switzerland. Even if you are not the biggest Winter Olympics fan, you probably know her name. She came out of retirement last year at the age of 41, chasing the dream of a second Olympic gold to add to her 2010 downhill title. Could her body cope? Not only with the fresh injury, but racing on a right knee that was rebuilt from an injury in 2013. There was shock and despair in Cortina when she crashed 13 seconds out of the starting gate. The fall may have been softened by the mandatory safety airbag that inflated after losing control, but screams could be heard from Vonn after landing awkwardly at high speed. And in a repeat of the scenes witnessed nine days earlier in Crans-Montana, she was taken to hospital on a stretcher dangling from the bottom of a helicopter. Medics will now be assessing the long-term damage caused following surgery on her broken left leg. It could be a dramatic and horrific end to the career of one of the most successful female skiers of all time. Read more:Water cannon and tear gas fired at Olympics protestersOpening ceremony crowd ignored plea not to boo And questions will be asked whether the American team should have allowed Vonn to compete and whether it was a risk too far."
    },
    {
        "title": "Lindsey Vonn 'in stable condition' after terrifying crash at Winter Olympics",
        "description": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final.",
        "url": "https://news.sky.com/story/lindsey-vonn-crashes-in-downhill-skiing-final-at-winter-olympics-13504857",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winter-olympics-skiing_7159025.jpg?20260208113427",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-08 11:18:00",
        "Headline": "US skiing legend Vonn, 41, was competing despite rupturing her ACL less than two weeks ago in Switzerland.",
        "Content": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final. The 41-year-old American had already ruptured her ACL in a crash at a World Cup race in Switzerland on 30 January but was determined to compete at the Winter Olympics on Sunday nevertheless. Just 13 seconds into her final run in Cortina, northern Italy, on Sunday, Vonn crashed on the piste, having clipped a slalom gate while mid-air. The Team USA athlete was heard screaming after the crash as she was surrounded by medical personnel for several minutes. Read more: Analysis - Should Lindsey Vonn have even been at the Winter Olympics? Vonn was then strapped to a gurney and flown to a hospital in Cortina by helicopter. She was later transferred to a larger hospital in Treviso. In a statement, quoted on olympics.com on Sunday night, Ca' Foncello Hospital in Treviso said Vonn \"underwent orthopaedic surgery to stabilise a fracture in her left leg\". Her team confirmed she was \"in stable condition and in good hands with a team of American and Italian physicians\". Anouk Patty, chief of sport for US Ski and Snowboard, said: \"She'll be OK, but it's going to be a bit of a process. \"This sport's brutal and people need to remember when they're watching (that) these athletes are throwing themselves down a mountain and going really, really fast.\" People in the crowd, including rapper Snoop Dogg, watched as Vonn crashed and was taken away from the course. The skier's father was also in the stands and stared at the ground while she was being treated. Vonn's teammate, Breezy Johnson, won the women's downhill, becoming the second American woman to take the Olympic downhill gold. Vonn was the first US woman to accomplish the feat. Vonn was considered a medal hopeful despite her ruptured ACL and completed two impressive training runs earlier this week. She had returned to elite ski racing last season after nearly six years in retirement, having had a partial titanium knee replacement in her right knee. As well as the ruptured ACL, she also had a bone bruise and meniscus damage."
    },
    {
        "title": "Russian citizen detained in Dubai over shooting of general in Moscow",
        "description": "A Russian citizen has been detained in Dubai over the shooting of a general in Moscow.",
        "url": "https://news.sky.com/story/russian-citizen-detained-in-dubai-over-shooting-of-general-in-moscow-13504947",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vladimir-alexeyev_7157374.jpg?20260206125557",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-08 17:29:00",
        "Headline": "A Russian citizen named Lyubomir Korba was arrested on suspicion of carrying out the shooting targeting Lieutenant General Vladimir ‍Alexeyev on Friday, Russia's Federal Security Service (FSB) said.",
        "Content": "A Russian citizen has been detained in Dubai over the shooting of a general in Moscow. The Federal Security Service (FSB), the main successor to the Soviet-era KGB secret police, said in a statement that a Russian citizen named Lyubomir Korba was arrested on suspicion of shooting Lieutenant General Vladimir ‍Alexeyev on Friday. \"With the assistance of partners from the United Arab Emirates... [he] was detained in Dubai and handed over to the Russian side,\" the security service said. Korba has since been flown back to Russia, according to security officials. Lt Gen Alexeyev was shot three times with a Makarov pistol equipped with a silencer in an apartment block on the Volokolamsk highway in northern Moscow, according to investigators. The perpetrator then fled the scene. The 64-year-old was rushed to hospital and underwent surgery, Russian media said. Russian investigators have accused Ukraine of planning the shooting, but Kyiv has denied involvement. Investigators said Korba, born in the Ternopil region of Soviet Ukraine in 1960, was tasked by Ukrainian intelligence to carry out the shooting. \n                  Mystery as Russian general shot at close range - with equally curious response from the Kremlin\n                 \n                  We have entered a world without nuclear arms control as US-Russia treaty expires\n                 \n                  'I still would like to meet Putin': Epstein's unrequited love for Russian leader\n                 The FSB said it had identified two accomplices, also Russian citizens. One, Viktor Vasin, was detained in Moscow, while another, Zinaida Serebritskaya, escaped to Ukraine. Sky News was unable to immediately verify the details of the suspects. The UAE did not give any details about how Korba was detained. Vladimir Putin called the UAE leader, Mohammed bin Zayed Al Nahyan, after the detention of Korba and thanked him for his country's help in the operation, according to Kremlin spokesman Dmitry Peskov. Meanwhile, Russia launched an attack on several Ukrainian regions overnight. Ukraine's air force said 101 attack drones were fired towards the country, with the force repelling the majority. Apartments in the Donetsk region and nearby cars caught fire after a drone strike. One person died, and two others have been injured. The overnight attack came almost 24 hours after Russia launched a large-scale attack on Ukraine's energy infrastructure. More than 400 drones and 40 missiles were fired in that attack as the harshest winter in the near four-year war grips Ukraine. Volodymyr Zelenskyy introduced new sanctions in response to the strikes on Ukraine's energy infrastructure. Read more:Mystery as Russian general shot at close rangeRussian drone strike on bus in Ukraine kills 12 \"Producing this weaponry would be impossible without critical foreign components, which the Russians continue to obtain by circumventing sanctions,\" the Ukrainian leader wrote in a social media post. \"We are introducing new sanctions precisely against such companies - component suppliers, as well as missile and drone manufacturers. I have signed the relevant decisions.\""
    },
    {
        "title": "Thailand's incumbent party takes the lead in initial election results ",
        "description": "Thailand's incumbent party has taken the lead in the country's general election, according to preliminary and unofficial results from the state Electoral Commission.",
        "url": "https://news.sky.com/story/thailands-incumbent-party-takes-the-lead-in-initial-election-results-13505025",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-thailand-anutin-charnvirakulat_7159444.jpg?20260208181227",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-08 20:46:00",
        "Headline": "Bhumjaithai's leader, Prime Minister Anutin Charnvirakul, thanked voters for their support and vowed his party would work hard for the Thai people.",
        "Content": "Thailand's incumbent party has taken the lead in the country's general election, according to preliminary and unofficial results from the state Electoral Commission. The commission's count indicated the conservative Bhumjaithai party had attained around 194 seats in the 500-member House of Representatives. Parties need 251 seats to elect a prime minister, otherwise, a coalition will need to be formed. The People's Party, which had been tipped to win the most seats, is currently at around 116. The populist party Pheu Thai follows behind with around 76 seats. The 500-member House of Representatives is made up of 400 directly elected politicians based on constituencies. The other 100 are chosen from \"party list\" nominees, who gain seats according to each party's proportional share of the vote on a separate ballot indicating party preference. \n                  Japan's ultra conservative prime minister set to seize more power, exit poll shows\n                 \n                  Briton Jimmy Lai sentenced to 20 years after national security conviction in Hong Kong\n                 \n                  'China is watching': Election victory for Japan's PM Sanae Takaichi could threaten stability of region\n                 The party list totals are subject to change until the vote count is completed. Bhumjaithai's leader, Prime Minister Anutin Charnvirakul, thanked voters for their support and vowed his party would work hard for the Thai people. \"At this moment, our people have given us more than what we expected this morning. \"So we owe our voters a fortune and we will only repay them by working at our utmost to bring all the good things to them and our country,\" he said. The People's Party's leader, Natthaphong Ruengpanyawut, said early on Friday night his party would not come in first, and said it would respect the results. \"We respect the parliamentary system, that we have to allow the winner to form the government first, and for now, we don't think we are going to form a government in competition with Bhumjaithai,\" he said, apparently referring to any attempt to form an alternative coalition. Read more news from around the world:Japan's ultra conservative prime minister set to seize more powerLindsey Vonn crashes in skiing final at Winter Olympics He also said his party would not support Bhumjaithai's candidate for prime minister. Anutin has been the prime minister only since last September. He dissolved parliament in December to call a new election after he was threatened with a no-confidence vote. Subsequent border clashes with Cambodia allowed Anutin to recast himself as a wartime leader after his popularity initially slipped because of floods and financial scandals. His campaign focuses on national security and economic stimulus."
    },
    {
        "title": "Savannah Guthrie tells mother's potential kidnappers 'we will pay' in video plea for her return",
        "description": "US TV news host Savannah Guthrie has told the potential kidnappers of her 84-year-old mother that her family \"will pay\" for her safe return.",
        "url": "https://news.sky.com/story/savannah-guthrie-tells-mothers-potential-kidnappers-we-will-pay-in-video-plea-for-her-return-13504802",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-savannah-guthrie_7158036.jpg?20260207082747",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-08 00:06:00",
        "Headline": "Joined by her siblings Cameron and Annie, US TV host Savannah Guthrie posted a video on Instagram where she urged those believed to be holding her mother Nancy Guthrie to return her.",
        "Content": "US TV news host Savannah Guthrie has told the potential kidnappers of her 84-year-old mother that her family \"will pay\" for her safe return. Nancy Guthrie was last seen at her own home near Tucson, Arizona, on the evening of 31 January, and was reported missing the next day after she did not turn up at church. Law enforcement officials have concluded that she was kidnapped, but the Pima County Sheriff's Department said it has not identified any suspects or people of interest in the case. On Saturday, a week after her mother's disappearance, the NBC News Today co-anchor posted a video on Instagram where she urged those believed to be holding Ms Guthrie to return her. \"We received your message and we understand,\" she said, joined by her siblings Cameron and Annie. \"We beg you now to return our mother to us, so that we can celebrate with her.\" \"This is the only way we will have peace,\" she added. \"This is very valuable to us, and we will pay.\" Savannah Guthrie was referring to a message sent to the Tucson-based television station KOLD on Friday, according to Kevin Smith, a spokesperson for the FBI office in Phoenix. \n                  Nancy Guthrie: Authorities searching for 'kidnapped' mum of TV host investigating 'vehicle of interest'\n                 \n                  Trump U-turns (again) as America searches for Nancy Guthrie\n                 \n                  Nancy Guthrie: A neighbourhood left stunned by a crime that's mystifying America\n                 KOLD said it received an email related to the Guthrie case on social media that day but declined to share details about its contents as the FBI conducted its review. The station was one of several news outlets that received alleged ransom letters during the week. Former FBI agent Dennis Franks told Sky News he believes there may be coded messages being sent from the Guthrie family to the kidnappers. \"Some of the messages that Savannah is giving out, the family is giving out, have certain wording that I think may have significance to the kidnappers in that there could be some coding, some messages there,\" said Mr Franks. \"One of the first messages was that 'We hope to see her back for a celebration'.\" \"That was kind of an unusual term to use, in my opinion.\" Sky's US correspondent Martha Kelner said, \"this is obviously a huge mystery still\", noting there are \"no suspects and no persons of interest in this case\". While it's still unclear who the sender is, she added it appears they \"used the same secure server to hide their IP address\" and that the new note \"the senders believe will indicate to investigators that they are the same person or people that sent the original note\". Read more from Sky News:Gordon Brown says he was 'betrayed' by MandelsonDozens of flood warnings issued in UK It comes after it emerged that police investigating Ms Guthrie's disappearance were searching for a vehicle or vehicles that may be connected to her case. A spokesperson for the convenience store chain Circle K told NBC News on Friday that officers visited one of their stores after \"receiving a tip regarding a vehicle of interest, and our team has provided them access to the store's surveillance video\". Missing persons expert Charlie Hedges told Sky News this case would be \"quite challenging\" to deal with. \"We would normally prefer this to be a covert negotiation, not to publicise what's going on, not to discuss what the outcome might be in the public domain, but more to pursue the investigation, covertly and in a controlled way,\" he said. \"But also, it's obvious that most families would want to reach out and offer and want to engage to try and get her back as quickly as possible.\" Sky News has contacted the Pima County Sheriff's Department for comment."
    },
    {
        "title": "Lindsey Vonn 'in stable condition' after terrifying crash at Winter Olympics",
        "description": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final.",
        "url": "https://news.sky.com/story/lindsey-vonn-crashes-in-downhill-skiing-final-at-winter-olympics-13504857",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winter-olympics-skiing_7159025.jpg?20260208113427",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-08 11:18:00",
        "Headline": "US skiing legend Vonn, 41, was competing despite rupturing her ACL less than two weeks ago in Switzerland.",
        "Content": "Lindsey Vonn is recovering from surgery on a leg fracture after her Olympic comeback ended with her being airlifted to hospital following a terrifying crash in the women's downhill skiing final. The 41-year-old American had already ruptured her ACL in a crash at a World Cup race in Switzerland on 30 January but was determined to compete at the Winter Olympics on Sunday nevertheless. Just 13 seconds into her final run in Cortina, northern Italy, on Sunday, Vonn crashed on the piste, having clipped a slalom gate while mid-air. The Team USA athlete was heard screaming after the crash as she was surrounded by medical personnel for several minutes. Read more: Analysis - Should Lindsey Vonn have even been at the Winter Olympics? Vonn was then strapped to a gurney and flown to a hospital in Cortina by helicopter. She was later transferred to a larger hospital in Treviso. In a statement, quoted on olympics.com on Sunday night, Ca' Foncello Hospital in Treviso said Vonn \"underwent orthopaedic surgery to stabilise a fracture in her left leg\". Her team confirmed she was \"in stable condition and in good hands with a team of American and Italian physicians\". Anouk Patty, chief of sport for US Ski and Snowboard, said: \"She'll be OK, but it's going to be a bit of a process. \"This sport's brutal and people need to remember when they're watching (that) these athletes are throwing themselves down a mountain and going really, really fast.\" People in the crowd, including rapper Snoop Dogg, watched as Vonn crashed and was taken away from the course. The skier's father was also in the stands and stared at the ground while she was being treated. Vonn's teammate, Breezy Johnson, won the women's downhill, becoming the second American woman to take the Olympic downhill gold. Vonn was the first US woman to accomplish the feat. Vonn was considered a medal hopeful despite her ruptured ACL and completed two impressive training runs earlier this week. She had returned to elite ski racing last season after nearly six years in retirement, having had a partial titanium knee replacement in her right knee. As well as the ruptured ACL, she also had a bone bruise and meniscus damage."
    },
    {
        "title": "Super Bowl 60 LIVE: New England Patriots face Seattle Seahawks in California",
        "description": null,
        "url": "https://news.sky.com/story/super-bowl-60-live-new-england-patriots-face-seattle-seahawks-in-california-13505122",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-superbowl-new-england-patriots_7159676.jpg?20260209002114",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-08 22:54:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Toddler held by ICE 'nearly died' in detention and was denied medication, lawsuit claims",
        "description": "A toddler detained by US immigration authorities ended up in hospital with a life-threatening illness, but was returned to custody and denied medication, a lawsuit claims.",
        "url": "https://news.sky.com/story/toddler-held-by-ice-nearly-died-in-detention-and-was-denied-medication-lawsuit-claims-13504850",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-amalia-ice-immigration_7159013.jpg?20260208104955",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-08 10:38:00",
        "Headline": "A lawsuit claims that when the child was finally taken to hospital, she and her mother remained under guard by ICE agents.",
        "Content": "A toddler detained by US immigration authorities ended up in hospital with a life-threatening illness, but was returned to custody and denied medication, a lawsuit claims. The child, identified simply as Amalia in the legal challenge, was detained along with her parents on 11 December, amid an ongoing deportation drive by Donald Trump's administration. Held at a facility in Dilley, Texas, she reportedly developed a fever of 40C (104F) on New Year's Day, started vomiting, suffered diarrhoea, and struggled to breathe. Her parents took her to the facility's medical clinic eight or nine times, but each time received only basic fever medication, the lawsuit alleges. By mid-January, she was barely getting enough oxygen, and her blood oxygen levels had plunged to life-threatening lows, the case claims. Only then was she taken to hospital, where she and her mother were constantly supervised by Immigration and Customs Enforcement (ICE), the suit says. It's alleged that her father had to stay behind, unable to communicate with his wife and daughter. \n                  Trump sharing racist image of Obamas shows something has changed\n                 \n                  Donald Trump says he didn't make a mistake over Obamas as apes video\n                 \n                  Two killed in US strike on 'narco-terrorists' as forces attack alleged drug boat\n                 She was diagnosed with COVID-19, respiratory syncytial virus, viral bronchitis, and pneumonia, and placed on supplemental oxygen, according to the lawsuit. After 10 days at Methodist Children's Hospital in San Antonio, she was reportedly returned to the Dilley Facility in the midst of a measles outbreak. Having lost 10% of her weight, Amalia was given a nebulizer, respiratory medication, and nutritional drinks, but all were seized at the detention centre, the case claims. So the family was forced to queue in the cold for medication, waiting for hours every day in what's been called a \"pill line\", only to be denied what doctors had prescribed, according to the suit. The legal challenge was reported by Sky's US partner, NBC News, which described how medical experts had reviewed Amalia's case and cautioned against returning her to custody. One physician warned that the child faced a \"high risk for medical decompensation and death\". But the family was only released on Friday, after an emergency challenge was filed by Elora Mukherjee, a professor at Columbia Law School who leads its Immigrants' Rights Clinic. Ms Mukherjee said ICE still had not handed over the toddler's prescriptions and birth certificate. She said: \"Baby Amalia should never have been detained. She nearly died at Dilley.\" Amalia's parents, Kheilin Valero Marcano and Stiven Arrieta Prieto, entered the US in 2024 after fleeing their native Venezuela. Citing political persecution in their homeland, they applied for asylum for themselves and their daughter, who was born in Mexico on the journey north. Read more:'My five-year-old son has nightmares after ICE detention'Trump administration wants to deport five-year-old detained by ICE According to the lawsuit, they complied with all requirements, and checked in regularly with immigration authorities. It was during one of these check-ins that they were detained. Dilley, where they were taken, is more than 500 miles from where they had been living. Ms Mukherjee called for the release of the hundreds of children and families detained there, warning that they lacked sufficient drinking water, healthy food, education, or proper medical care. The Department of Homeland Security (DHS) did not immediately respond to a request for comment on Saturday. CoreCivic, the company contracted to run Dilley, referred questions about it to the DHS when approached by NBC. However, the firm said in a statement that \"the health and safety of those entrusted to our care\" is its greatest priority."
    },
    {
        "title": "Bad Bunny says fans should be prepared to dance during Super Bowl half-time performance",
        "description": "Puerto Rican star Bad Bunny will give a highly anticipated Super Bowl half-time performance on Sunday, promising fans they should be prepared to dance.",
        "url": "https://news.sky.com/story/bad-bunny-says-fans-should-be-prepared-to-dance-during-super-bowl-half-time-performance-13504806",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bad-bunny-super-bowl_7158931.jpg?20260208074925",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-08 06:27:00",
        "Headline": "The 31-year-old will perform a week after winning album of the year at the 2026 Grammys for Debi Tirar Mas Fotos - the first time an all Spanish-language album scooped the award.",
        "Content": "Puerto Rican star Bad Bunny will give a highly anticipated Super Bowl half-time performance on Sunday, promising fans they should be prepared to dance. The singer and rapper, whose real name is Benito Antonio Martinez Ocasio, is one of the world's most-streamed musicians. But not all were happy with his selection as half-time headliner, with Donald Trump calling it \"absolutely ridiculous\". The 31-year-old has been highly critical of the US president's deportation policies and supported Kamala Harris in the 2024 presidential election. He will perform a week after winning album of the year at the 2026 Grammys for Debi Tirar Mas Fotos - the first time an all Spanish-language album scooped the top award. At a news conference ahead of the Super Bowl, he joked those watching do not need to learn Spanish to enjoy his set, but they should get ready to dance. \"To be honest, I don't know how I'm feeling. There's a lot. I'm still in the middle of my tour. I was just at the Grammys last week. All of that,\" he said, speaking English at a press event on Thursday. \"I'm excited, but at the same time, I feel more excited about the people than even me - my family, my friends, the people who have always believed in me,\" he added. \"This moment, the culture - that's what makes these shows special.\" Read more: Why Bad Bunny's Super Bowl show is causing a stir It will not be the first time the musician has performed on the Super Bowl stage, having previously appeared during the half-time show at Super Bowl LIV in 2020 alongside Jennifer Lopez and Shakira. \"It's going to be a huge party,\" he said. \"What people can expect from me... I want to bring to the stage, of course, a lot of my culture. But I really don't, I don't want to give any spoilers. It's going to be fun.\" Asked if he will have any surprise guests, he replied: \"That's something I'm not going to tell you.\" 👉 Listen to Sky News Daily on your podcast app 👈 The Super Bowl will take place on Sunday at the Levi's Stadium in Santa Clara, where the Seattle Seahawks will face the New England Patriots. Green Day will play a set before the game to celebrate the 60th anniversary of the Super Bowl."
    },
    {
        "title": "Investment giant KKR ditches Mandelson lobbying firm",
        "description": "KKR, the American investment giant, has become the latest global corporation to sever ties with Global Counsel, the lobbying firm set up by Lord Mandelson, the disgraced former politician.",
        "url": "https://news.sky.com/story/investment-giant-kkr-ditches-mandelson-lobbying-firm-13504889",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-peter-mandelson_7150837.jpg?20260201225932",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-08 13:00:00",
        "Headline": "KKR, a shareholder in companies such as Travelopia and Flora Food Group, has cut ties with Global Counsel following new revelations about Lord Mandelson’s relationship with Jeffrey Epstein, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n KKR, the American investment giant, has become the latest global corporation to sever ties with Global Counsel, the lobbying firm set up by Lord Mandelson, the disgraced former politician. Sky News has learnt that KKR has decided to cease working with Global Counsel in the wake of fresh revelations about the close ties between Lord Mandelson and the convicted paedophile Jeffrey Epstein. KKR owns assets including John Laing, the infrastructure investor, and Flora Food Group, the spreads producer which was previously part of Unilever. It is understood to have worked with Global Counsel for some time. KKR's exit comes days after the Financial Times reported that Barclays had cut ties with the public affairs outfit, while the Premier League has also ceased to be a client. On Friday, Benjamin Wegg-Prosser resigned as Global Counsel's chief executive, while Lord Mandelson's stake in the firm was sold to Rebecca Park, Mr Wegg-Prosser's successor. Lord Mandelson was sacked as Britain's ambassador to the US last autumn amid the growing scandal over his relationship with Mr Epstein. Read more:Washington Post CEO Will Lewis steps downNatWest set to clinch £2.5bn takeover of Evelyn Following the publication last week of millions of documents containing correspondence involving Mr Epstein, Lord Mandelson was forced out of the Labour Party and resigned as a member of the House of Lords. On Friday, two of his homes were searched by police investigating potential offences relating to misconduct in a public office. KKR declined to comment."
    },
    {
        "title": "Morgan McSweeney's exit shows No 10 in full-blown survival mode",
        "description": "In the end, the PM had little option.",
        "url": "https://news.sky.com/story/morgan-mcsweeneys-exit-shows-no-10-in-full-blown-survival-mode-13504982",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-morgan-mcsweeney-labour_7159197.jpg?20260208143657",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-08 16:12:00",
        "Headline": "This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post.",
        "Content": "\n          Political editor\n              @BethRigby\n In the end, the PM had little option. Faced with an escalating crisis and ever-louder calls from his MPs that someone had to take responsibility for the Mandelson scandal, the PM's chief of staff, Morgan McSweeney, is gone. Politics latest: Starmer reacts as chief of staff Morgan McSweeney resigns It will be a bitter blow for Starmer, who had repeatedly said all week he had full confidence in McSweeney. No 10 was trying to hold on to the PM's right-hand man, who had worked with Starmer from opposition, through the election campaign and into power. As late as Sunday morning, cabinet minister Pat McFadden was saying that he did not think McSweeney should go over the Mandelson appointment. Read more: From Svengali to sacked, who is Morgan McSweeney? \n                  Politics latest: Chief of staff Morgan McSweeney was 'in two minds' about resigning - as Sir Keir Starmer reacts to exit\n                 \n                  From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?\n                 \n                  Starmer's chief of staff quits over Mandelson row\n                 That the government changed course reveals the deep peril Starmer is in. Faced with a chorus of anger from MPs that showed no sign of abating, No 10 offered a scalp. The hope will be that Mr McSweeney's departure from the heart of the No 10 operation will go some way to satisfying some of his MPs who were demanding a reset. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Baroness Harman, typically a government loyalist, led the charge on our Electoral Dysfunction podcast when she warned the prime minister that blaming Mandelson for misleading him was not enough. She argued that to save his premiership, he had to take responsibility by clearing out those who had advised Starmer to appoint Mandelson to Washington, embarking on a genuine programme to clean up politics as he promised in the manifesto and bringing forward action tackling violence against women and girls. Former prime minister Gordon Brown, backing Starmer as a \"man of integrity\" on Saturday, said the situation was \"serious\" and suggested the Labour leader had been \"too slow to do the right things\" to clean up politics in the wake of the Peter Mandelson row. This weekend, the PM has clearly heeded some of the unsolicited advice, but make no mistake that the departure of McSweeney comes from a position of acute weakness. This is about a prime minister sacrificing his closest ally in No 10 in the hope that he can remain in post. In the longer-term, it might only serve to weaken him further now that his key ally and fixer has gone. He has just lost the backbone of his operation. There will undoubtedly be more blood-letting, and allies of McSweeney say he was one of a number of people to advise the PM on Mandelson's appointment - he provided advice but was not the one who made the decision. McSweeney was a powerful force in the party, with a great many allies across the whole of government. There will be anger from many that the man who masterminded the election win and got Keir Starmer into the Labour leader position and then into No 10 has been cut adrift. As one former colleague of McSweeney texted me soon after the news broke, \"[Morgan] was not just a brilliant colleague but a moral and decent man who supported his staff through thick and thin. The PM should have put this down as a mistake and rejected his resignation\". Read more:Mandelson could be made to hand back 'five-figure' payoffGordon Brown on former ally Peter Mandelson Senior Labour sources told me McSweeney had been wrestling with what to do over the weekend and was feeling \"very down\", but the decision became \"inevitable\" due to the \"gravity of the situation\". McSweeney said in his resignation statement that he took \"full responsibility\" for advising the PM to appoint Mandelson. \"In public life, responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside.\" There will be some in his party who believe the PM cannot recover from this scandal, that it has gone too far to be repaired with the country and with the Labour Party. McSweeney's departure will not solve that. One minister told me after McSweeney's departure that the mood remained \"frenetic\" with MPs unsure how this would all play out, although the minister also thought it would \"help Keir for a bit\". Starmer will attempt this week to enact advice from Baroness Harman and former PM Brown, with one No 10 source saying the PM \"recognises the need for government to address the issues highlighted by the Mandelson revelations\". The PM instructed officials to move at pace to deliver on the PM's election pledge to \"clean up politics\", and will say more next week, starting with an address to his PLP on Monday night. But one senior figure told me that the reset in No 10 and scale of change will have to be really significant if Starmer wants to hold on: \"I don't think they appreciate how big a move will be needed to rebuild and stabilise the party.\" What is clearer is that the No 10 operation is now in full-blown survival mode. But past experience shows that when that operation goes into freefall, it's near impossible to stabilise."
    },
    {
        "title": "From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?",
        "description": "For those wishing to understand the Starmer project, it is hard to overstate how crucial a role Morgan McSweeney played.",
        "url": "https://news.sky.com/story/from-svengali-to-sacked-who-is-morgan-mcsweeney-the-prime-ministers-departed-chief-of-staff-13432116",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-morgan-mcsweeney-labour_7159221.jpg?20260208145126",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-08 14:13:00",
        "Headline": "He was credited with winning the 2024 general election for Labour after years in the wilderness - but he now joins a long list of aides Sir Keir Starmer has lost since that landslide victory.",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n For those wishing to understand the Starmer project, it is hard to overstate how crucial a role Morgan McSweeney played. Born in Macroom, County Cork, Mr McSweeney got his big break for Labour working at Lambeth Council with Steve Reed, the current housing secretary, who would later introduce him to the man who would go on to be Labour leader. Working at the south London council gave McSweeney his first taste of taking on his opponents of the left - a theme that would come to define his ascent to the very top of the Labour Party. Latest updates from Politics HubStarmer's top aide Morgan McSweeney resigns A central component of Labour winning back control of Lambeth in 2006 under Mr Reed was Mr McSweeney's campaign to remove all traces of the hard left from the party, which had dominated in the 1980s and 1990s under \"Red\" Ted Knight, who had been expelled from Labour in the 1950s as it carried out a purge of Trotskyists. Fast forward to 2017, and Labour was under the leadership of Jeremy Corbyn - someone Mr McSweeney regarded as equally unsuited to power as the hard left figures in Lambeth. That same year, he became director of Labour Together, a thinktank that challenged the narrative and ideology of the left under Mr Corbyn and which later helped Sir Keir win the 2020 Labour leadership election. After running Sir Keir's leadership bid, Mr McSweeney was appointed as his chief of staff, where he was accused of marginalising the left further, for example, by hampering their ability to stand for parliament by controlling shortlists. It was at this time that concerns about Mr McSweeney's influence and control over Sir Keir began to surface. The criticism directed at Sir Keir was that, with his lack of political background and instincts (he did not, for instance, work his way up through the Labour Party or the trade union movement), he created a vacuum for decision-making that could be occupied for better or worse by Mr McSweeney. I remain fully supportive of the Prime Minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. The decision to appoint Peter Mandelson was wrong. He has damaged our party, our country and trust in politics itself. \n When asked, I advised the prime minister to make that appointment and I take full responsibility for that advice. In public life responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside. This has not been an easy decision. Much has been written and said about me over the years but my motivations have always been simple: I have worked every day to elect and support a government that puts the lives of ordinary people first and leads us to a better future for our great country. Only a Labour government will do that. I leave with pride in all we have achieved mixed with regret at the circumstances of my departure. But I have always believed there are moments when you must accept your responsibility and step aside for the bigger cause. As I leave I have two further reflections:\n Firstly, and most importantly, we must remember the women and girls whose lives were ruined by Jeffrey Epstein and whose voices went unheard for far too long.\n Secondly, while I did not oversee the due diligence and vetting process, I believe that process must now be fundamentally overhauled. This cannot simply be a gesture but a safeguard for the future.\n I remain fully supportive of the prime minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. It is through this lens that some have viewed Peter Mandelson's appointment as US ambassador and the subsequent scandal that resulted in him quitting the House of Lords following the release of the Epstein files. They appeared to show that, as business secretary, Peter Mandelson forwarded sensitive market information to Epstein and that he had received $75,000 from the disgraced financier. Lord Mandelson's representatives have been contacted for comment. The prime minister was said to be not sold on the former spin doctor becoming his US ambassador, but that Mr McSweeney - a close ally of the Labour peer - pushed for his appointment. In light of the scandal surrounding Lord Mandelson anger against Mr McSweeney intensified, as did the political pressure to remove him. But Number 10 stuck by Sir Keir's chief of staff, with a spokesperson saying the prime minister had confidence in Mr McSweeney even as the scandal deepened. Even before that, Mr McSweeney became the target of frustration and anger among Labour MPs at the botched handling of welfare reforms. He was accused of treating MPs with disdain and of failing to grasp the extent of their concerns. In the end, it was only with the involvement of now departed Angela Rayner that MPs eventually decided to back a much watered-down version of cuts. And although these were attributed to \"allies\" of Sir Keir, Labour MPs demanded his head after briefings to journalists that the prime minister was facing an imminent coup attempt by Health Secretary Wes Streeting, which plunged No 10 into crisis. The real power behind the throne? Despite his success in making Labour electorally viable after years in opposition, Mr McSweeney encountered multiple bumps in the road. The most major was the fallout of the 2021 Hartlepool by-election, which saw the Tories win a seat that had been under Labour's control since it was created in the 1970s - a moment so devastating for the party that Sir Keir later admitted he considered resigning.  The Hartlepool by-election was also a major setback for Mr McSweeney, who was demoted as Sir Keir's chief of staff back to a campaign role. For his critics, the by-election saga was proof that Mr McSweeney, for all his campaigning prowess, was not suited to the role of chief of staff, with all of the administrative responsibilities and management skills required. However, it did not stop Sir Keir from moving Mr McSweeney back into the role to replace Sue Gray - the partygate investigator who was appointed shortly before Labour's election win - following a bitter power struggle inside Number 10. Again, for critics of the prime minister's operation, this episode stands out as one that revealed the extent of Mr McSweeney's influence over Sir Keir. The brutal nature of Ms Gray's departure, which came after weeks of anonymous negative briefings in the newspapers, seemed to some to provide a warning about Mr McSweeney's ruthlessness. Ms Gray was a close ally of Sir Keir and his pick for chief of staff - so for some, the way she was discarded acted as a foreshadowing of what the prime minister could expect to face if he ever found his leadership in peril - as he does now. The danger for Sir Keir is that he now has two former allies with an axe to grind - a spin doctor of the past and one of the present."
    },
    {
        "title": "Starmer's chief of staff quits over Mandelson row",
        "description": "Morgan McSweeney has resigned as Sir Keir Starmer's chief of staff amid the fall-out from the Peter Mandelson scandal.",
        "url": "https://news.sky.com/story/starmers-chief-of-staff-quits-over-mandelson-row-as-pm-battles-for-survival-13431484",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-morgan-mcsweeney-labour_7081426.jpg?20251119160715",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-08 14:09:00",
        "Headline": "Morgan McSweeney said he took full responsibility for advising the prime minister to appoint Peter Mandelson to ambassador to the US. However, sources told Sky's Beth Rigby that he was \"in two minds\" about it.",
        "Content": "Morgan McSweeney has resigned as Sir Keir Starmer's chief of staff amid the fall-out from the Peter Mandelson scandal. Several Labour MPs blamed him for the appointment of the former Labour peer as ambassador to the US. Politics latest: Live updates as Sir Keir Starmer's chief of staff resigns  Lord Mandelson was sacked from that position in September, but new Epstein files suggesting he shared confidential information with the convicted sex offender in 2009 brought the issue back into the spotlight. In a statement, Mr McSweeney said: \"The decision to appoint Peter Mandelson was wrong. He has damaged our party, our country and trust in politics itself. \"When asked, I advised the prime minister to make that appointment and I take full responsibility for that advice.\" Read more: From svengali to sacked, who is Morgan McSweeeny? \n                  Starmer branded 'weak' over Mandelson saga - as top Labour figure warns it could bring him down\n                 \n                  Mandelson saga will bring PM down unless he takes 'necessary action', Harman warns\n                 \n                  Even Starmer's allies are unsure about his future\n                 I remain fully supportive of the Prime Minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. The decision to appoint Peter Mandelson was wrong. He has damaged our party, our country and trust in politics itself. \n When asked, I advised the prime minister to make that appointment and I take full responsibility for that advice. In public life responsibility must be owned when it matters most, not just when it is most convenient. In the circumstances, the only honourable course is to step aside. This has not been an easy decision. Much has been written and said about me over the years but my motivations have always been simple: I have worked every day to elect and support a government that puts the lives of ordinary people first and leads us to a better future for our great country. Only a Labour government will do that. I leave with pride in all we have achieved mixed with regret at the circumstances of my departure. But I have always believed there are moments when you must accept your responsibility and step aside for the bigger cause. As I leave I have two further reflections:\n Firstly, and most importantly, we must remember the women and girls whose lives were ruined by Jeffrey Epstein and whose voices went unheard for far too long.\n Secondly, while I did not oversee the due diligence and vetting process, I believe that process must now be fundamentally overhauled. This cannot simply be a gesture but a safeguard for the future.\n I remain fully supportive of the prime minister. He is working every day to rebuild trust, restore standards and serve the country. I will continue to back that mission in whatever way I can. It has been the honour of my life to serve. Mr McSweeney ran Sir Keir's Labour leadership bid. There have long been concerns about how much influence he holds, with many Labour MPs accusing him of marginalising the left within the party. He was close with Lord Mandelson and is said to have pushed for him to get the top diplomatic job over other candidates. In a statement responding to his resignation, Sir Keir said it had been an \"honour\" to work with his right-hand man, adding: \"He turned our party around after one of its worst ever defeats and played a central role running our election campaign. \"It is largely thanks to his dedication, loyalty and leadership that we won a landslide majority and have the chance to change the country.\" The prime minister then said: \"Having worked closely with Morgan in opposition and in government, I have seen every day his commitment to the Labour Party and to our country. \"Our party and I owe him a debt of gratitude, and I thank him for his service.\" He will address the Parliamentary Labour Party later on Monday, providing an update on how the Mandelson scandal will be handled, including on vetting appointees. McSweeney was 'in two minds' on resigning As reaction to the resignation unfolded throughout Sunday afternoon, Sky's political editor Beth Rigby reported that Mr McSweeney was initially \"in two minds\" about stepping down. Two senior sources told her that the gravity of the situation made it clear that his resignation was \"inevitable\", while a Downing Street source said that he and the prime minister decided that this was the right moment to move on in \"a mutual understanding\". One Labour MP, speaking anonymously, offered scathing criticism of the departing aide, saying that they \"won't be shedding a tear that he's gone\". \"He's the very worst of our party,\" they added, according to Sky political reporter Faye Brown, \"every decision he's taken is to bolster himself and wage a war of factionalism. \"The PM should have sacked him just as he should have with Mandelson. The buck ultimately stops with the PM.\" The MP then said that Mr McSweeney's resignation might not save his premiership, adding: \"All this has done has bought him a little more time, but he's mortally wounded and it's not if, it's when he goes.\" Deputy chiefs to step up Sir Keir asked his deputy chiefs of staff, Jill Cuthbertson and Vidhya Alakeson, to be acting chiefs of staff, Sky News understands. Both officials have been with Sir Keir since becoming leader of the opposition. Ms Cuthbertson was his private secretary and managed his time and commitments, basically serving as a gatekeeper. She held the same role for Ed Miliband and Gordon Brown. Ms Alakeson has responsibility for policy and delivery. She was Sir Keir's director of external relations when he was leader of the opposition, forging ties with the business community. The former deputy chief executive of the Resolution Foundation also had government experience: she served in the No 10 strategy unit and in the Treasury during the last Labour government. Sir Keir's judgement criticised over Mandelson Meanwhile, the Mandelson scandal has also led to questions over Sir Keir's judgement. Cabinet minister Pat McFadden told Sky News he did not think Mr McSweeney should resign as responsibility for appointments \"lies with the prime minister\". Reacting to the news, veteran left-wing rebel John McDonnell posted on X: \"Morgan McSweeney's resignation is the right measure but let's remember the old adage: Advisers advise but ministers decide.\" Richard Burgon, added the resignation was an \"important first step\" but called for an independent inquiry \"into the practices that McSweeney & Mandelson undertook in the Labour Party\". \"There is a lot to do to rid the party of the nasty factionalism that has left Labour so unpopular with the public,\" he said. However, other MPs hope Mr McSweeney's resignation will put the matter to bed. Karl Turner said it was the right decision and Labour must now \"move on\". Oliver Ryan, MP for Burnley, added on social media that \"my constituents just want their cost of living & NHS sorting out\". Epstein files released earlier this week suggest Lord Mandelson may have shared confidential information with the paedophile financier after the financial crash, when he was the business secretary in Mr Brown's government. Lord Mandelson quit the Labour Party and resigned from the House of Lords following the revelations, though he still holds the title of being a \"Lord\", as removing that requires legislation. Lord Mandelson's representatives have been contacted for comment. Sir Keir admitted this week that he knew Lord Mandelson had kept some contact with Jeffrey Epstein following his conviction for sex offences, which was public knowledge, but said he \"lied repeatedly\" about the extent of their friendship. The government is due to release documents relating to Lord Mandelson's vetting - they have been asked to hold off while the Metropolitan Police investigates allegations of misconduct in public office. Ministers wanted to hold back documents that could be a risk to national security or diplomatic relations - but they were forced into a climbdown following an intervention from former deputy prime minister Angela Rayner. Now, sensitive documents will have to be referred to the cross-party Intelligence and Security Committee of Parliament. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the sex offender's victims."
    },
    {
        "title": "Lonely Starmer looks like he doesn't know his own mind",
        "description": "Morgan McSweeney was blamed by many Labour MPs for the disastrous decision to appoint Peter Mandelson as US ambassador. ",
        "url": "https://news.sky.com/story/lonely-starmer-looks-like-he-doesnt-know-his-own-mind-13504940",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keir-starmer-morgan-mcsweeney_7159266.jpg?20260208153155",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-08 15:14:00",
        "Headline": "Morgan McSweeney has quit, but there are dangers to scapegoating an adviser in this way.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Morgan McSweeney was blamed by many Labour MPs for the disastrous decision to appoint Peter Mandelson as US ambassador.  There has been a growing clamour from the backbenches for the chief of staff to fall on his sword and take the hit for his boss. As the architect of Labour's election win in July 2024, McSweeney was a protege of Mandelson, the Svengali of New Labour's success. The two had worked closely together over many years - even during last September's cabinet reshuffle. Politics latest: Starmer reacts as chief of staff Morgan McSweeney resigns In his resignation letter, McSweeney was explicit that the decision to appoint Mandelson was wrong, and he had advised the PM to do it. \"I take full responsibility for that advice,\" he said. But at the same time, he was also keen to highlight that he \"did not oversee the due diligence and vetting process\", which has been blamed for failing to sufficiently highlight the ongoing friendship between Mandelson and Jeffrey Epstein revealed in all its toxicity by the Epstein files this week. No 10 will be hoping McSweeney's sacrifice will be enough to satisfy the bloodlust of his furious backbenchers. \n                  Politics latest: Chief of staff Morgan McSweeney was 'in two minds' about resigning - as Sir Keir Starmer reacts to exit\n                 \n                  Morgan McSweeney's exit shows No 10 in full-blown survival mode\n                 \n                  From Svengali to sacked: Who is Morgan McSweeney, the prime minister's departed chief of staff?\n                 But there are massive risks to scapegoating an advisor in this way. Read more:Mandelson could be made to hand back 'five-figure' payoffGordon Brown on former ally Peter Mandelson It looks like the PM doesn't know his own mind - and doesn't own his own decisions. Ultimately, as even close Starmer ally Pat McFadden explained on Sky News' Sunday Morning with Trevor Phillips: \"Prime ministers have to take responsibility for the decisions that they make… in the end, the loneliness of the top job is that you take responsibility for these decisions.\" Without McSweeney by his side, guiding him through the political minefield of Westminster, it's even lonelier."
    },
    {
        "title": "Savannah Guthrie tells mother's potential kidnappers 'we will pay' in video plea for her return",
        "description": "US TV news host Savannah Guthrie has told the potential kidnappers of her 84-year-old mother that her family \"will pay\" for her safe return.",
        "url": "https://news.sky.com/story/savannah-guthrie-tells-mothers-potential-kidnappers-we-will-pay-in-video-plea-for-her-return-13504802",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-savannah-guthrie_7158036.jpg?20260207082747",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-08 00:06:00",
        "Headline": "Joined by her siblings Cameron and Annie, US TV host Savannah Guthrie posted a video on Instagram where she urged those believed to be holding her mother Nancy Guthrie to return her.",
        "Content": "US TV news host Savannah Guthrie has told the potential kidnappers of her 84-year-old mother that her family \"will pay\" for her safe return. Nancy Guthrie was last seen at her own home near Tucson, Arizona, on the evening of 31 January, and was reported missing the next day after she did not turn up at church. Law enforcement officials have concluded that she was kidnapped, but the Pima County Sheriff's Department said it has not identified any suspects or people of interest in the case. On Saturday, a week after her mother's disappearance, the NBC News Today co-anchor posted a video on Instagram where she urged those believed to be holding Ms Guthrie to return her. \"We received your message and we understand,\" she said, joined by her siblings Cameron and Annie. \"We beg you now to return our mother to us, so that we can celebrate with her.\" \"This is the only way we will have peace,\" she added. \"This is very valuable to us, and we will pay.\" Savannah Guthrie was referring to a message sent to the Tucson-based television station KOLD on Friday, according to Kevin Smith, a spokesperson for the FBI office in Phoenix. \n                  Nancy Guthrie: Authorities searching for 'kidnapped' mum of TV host investigating 'vehicle of interest'\n                 \n                  Trump U-turns (again) as America searches for Nancy Guthrie\n                 \n                  Nancy Guthrie: A neighbourhood left stunned by a crime that's mystifying America\n                 KOLD said it received an email related to the Guthrie case on social media that day but declined to share details about its contents as the FBI conducted its review. The station was one of several news outlets that received alleged ransom letters during the week. Former FBI agent Dennis Franks told Sky News he believes there may be coded messages being sent from the Guthrie family to the kidnappers. \"Some of the messages that Savannah is giving out, the family is giving out, have certain wording that I think may have significance to the kidnappers in that there could be some coding, some messages there,\" said Mr Franks. \"One of the first messages was that 'We hope to see her back for a celebration'.\" \"That was kind of an unusual term to use, in my opinion.\" Sky's US correspondent Martha Kelner said, \"this is obviously a huge mystery still\", noting there are \"no suspects and no persons of interest in this case\". While it's still unclear who the sender is, she added it appears they \"used the same secure server to hide their IP address\" and that the new note \"the senders believe will indicate to investigators that they are the same person or people that sent the original note\". Read more from Sky News:Gordon Brown says he was 'betrayed' by MandelsonDozens of flood warnings issued in UK It comes after it emerged that police investigating Ms Guthrie's disappearance were searching for a vehicle or vehicles that may be connected to her case. A spokesperson for the convenience store chain Circle K told NBC News on Friday that officers visited one of their stores after \"receiving a tip regarding a vehicle of interest, and our team has provided them access to the store's surveillance video\". Missing persons expert Charlie Hedges told Sky News this case would be \"quite challenging\" to deal with. \"We would normally prefer this to be a covert negotiation, not to publicise what's going on, not to discuss what the outcome might be in the public domain, but more to pursue the investigation, covertly and in a controlled way,\" he said. \"But also, it's obvious that most families would want to reach out and offer and want to engage to try and get her back as quickly as possible.\" Sky News has contacted the Pima County Sheriff's Department for comment."
    },
    {
        "title": "Bad Bunny says fans should be prepared to dance during Super Bowl half-time performance",
        "description": "Puerto Rican star Bad Bunny will give a highly anticipated Super Bowl half-time performance on Sunday, promising fans they should be prepared to dance.",
        "url": "https://news.sky.com/story/bad-bunny-says-fans-should-be-prepared-to-dance-during-super-bowl-half-time-performance-13504806",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bad-bunny-super-bowl_7158931.jpg?20260208074925",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-08 06:27:00",
        "Headline": "The 31-year-old will perform a week after winning album of the year at the 2026 Grammys for Debi Tirar Mas Fotos - the first time an all Spanish-language album scooped the award.",
        "Content": "Puerto Rican star Bad Bunny will give a highly anticipated Super Bowl half-time performance on Sunday, promising fans they should be prepared to dance. The singer and rapper, whose real name is Benito Antonio Martinez Ocasio, is one of the world's most-streamed musicians. But not all were happy with his selection as half-time headliner, with Donald Trump calling it \"absolutely ridiculous\". The 31-year-old has been highly critical of the US president's deportation policies and supported Kamala Harris in the 2024 presidential election. He will perform a week after winning album of the year at the 2026 Grammys for Debi Tirar Mas Fotos - the first time an all Spanish-language album scooped the top award. At a news conference ahead of the Super Bowl, he joked those watching do not need to learn Spanish to enjoy his set, but they should get ready to dance. \"To be honest, I don't know how I'm feeling. There's a lot. I'm still in the middle of my tour. I was just at the Grammys last week. All of that,\" he said, speaking English at a press event on Thursday. \"I'm excited, but at the same time, I feel more excited about the people than even me - my family, my friends, the people who have always believed in me,\" he added. \"This moment, the culture - that's what makes these shows special.\" Read more: Why Bad Bunny's Super Bowl show is causing a stir It will not be the first time the musician has performed on the Super Bowl stage, having previously appeared during the half-time show at Super Bowl LIV in 2020 alongside Jennifer Lopez and Shakira. \"It's going to be a huge party,\" he said. \"What people can expect from me... I want to bring to the stage, of course, a lot of my culture. But I really don't, I don't want to give any spoilers. It's going to be fun.\" Asked if he will have any surprise guests, he replied: \"That's something I'm not going to tell you.\" 👉 Listen to Sky News Daily on your podcast app 👈 The Super Bowl will take place on Sunday at the Levi's Stadium in Santa Clara, where the Seattle Seahawks will face the New England Patriots. Green Day will play a set before the game to celebrate the 60th anniversary of the Super Bowl."
    }
]