[
    {
        "title": "Government officials among 20 arrested after 59 killed in North Macedonia nightclub fire",
        "description": "Around 20 arrests have been made over a nightclub fire that killed at least 59 people in North Macedonia.",
        "url": "https://news.sky.com/story/at-least-50-dead-after-nightclub-fire-in-kocani-north-macedonia-13329983",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kocani-north-macedonia_6858400.jpg?20250316101253",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 07:50:00",
        "Headline": "The blaze broke out while local band DNK was performing. Reports said fireworks were set off inside the venue, causing the roof to catch fire.",
        "Content": " Around 20 arrests have been made over a nightclub fire that killed at least 59 people in North Macedonia. Authorities said 155 others were injured after the blaze broke out at Pulse in the eastern town of Kocani at around 2.35am on Sunday. Sparks ignited the roof while local band DNK was performing, sending hundreds of people scrambling for the small venue's only exit. Video from inside showed the band playing on stage before two flares went off either side of them and shot towards the ceiling. Interior minister Pance Toskovski told a news conference, reported by the Reuters news agency, that more than 20 of those injured and three of the people killed were aged under 18. He said government officials and the manager of the club, which did not have a valid licence, are among around 20 people who have been arrested in connection with the fire.  The club owner's son and members of the band are also among those who have been held, he said. North Macedonian Prime Minister Hristijan Mickoski said the licence was issued illegally by the economy ministry and promised those responsible would face justice. \"Regardless of who they are, from which institution, from what level, from which party and profession,\" he said as he declared seven days of national mourning. Some of the injured are being treated at Kocani General Hospital, where relatives have gathered desperate for more information, newspaper Nova Makedonija said. Broadcaster MRT reported that 27 people were being treated for severe burns at Skopje City Hospital, with another 23 at the Clinical Centre. 'This was my only child' Dragi Stojanov's only son Tomce died in the fire.  \"It's my only child and he died,\" he told reporters at the scene. \"What am I supposed to do?\" He said he had been there \"all night\" and that \"they can't even get bodies out\", with \"200 people\" still inside. \"This was my only child. I don't need my life anymore. I don't need my life,\" he told the media. A woman who was in the nightclub when the fire broke out suffered an injured ear and knee, and her sister is still missing. \"The fire broke out suddenly and everyone started running for the exit,\" the unnamed survivor said. \"There were charred bodies. I don't know… everyone is stressed. \"My sister is missing, we were unable to find her in the hospitals, so now we're waiting here, to find out if she's here.\" Read more from Sky NewsTrump launches air strikes over Red SeaUS expels South African ambassadorRussian ship captain appears in court Mr Mickoski described the deadly incident as a \"difficult and very sad day for Macedonia\". \"The loss of so many young lives is irreparable, and the pain of the families, loved ones and friends is immeasurable,\" he wrote in a post on X. He promised the government would do \"everything in their power to at least slightly alleviate their pain\". Police and forensic investigators cordoned off the scene on Sunday, with authorities saying evidence would be collected for state prosecutors. North Macedonia's public prosecutor Ljupco Kocevski said five prosecutors would investigate the incident. He said people were being interviewed, adding: \"At the moment, orders have been issued to collect evidence\". The US ambassador to North Macedonia Angela Aggeler also posted on X, saying her \"heart breaks this morning for the many victims in last night's fire at a nightclub in Kochani\". \"Our deepest condolences go to the victims and their loved ones at this awful time, and wishes for a speedy recovery to those who were injured,\" she said. Various leaders offered their condolences, including Albanian Prime Minister Edi Rama and Ukrainian President Volodymyr Zelenskyy. \"I wish those who were injured a speedy recovery. Ukraine mourns alongside our North Macedonian friends on this sad day,\" Mr Zelenskyy wrote on X."
    },
    {
        "title": "Vatican releases first image of Pope Francis since he fell ill",
        "description": "The Vatican has released the first image of Pope Francis since he was taken to hospital more than a month ago. ",
        "url": "https://news.sky.com/story/vatican-releases-first-image-of-pope-francis-since-he-fell-ill-13330453",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pope-francis_6858873.jpg?20250316180059",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 17:56:00",
        "Headline": "Pope Francis, 88, was admitted to hospital on 14 February and has not been seen in public since.",
        "Content": "The Vatican has released the first image of Pope Francis since he was taken to hospital more than a month ago.  The photograph shows the leader of the Catholic church celebrating a mass in his prayer room on Sunday morning. He is seen wearing a purple stole while sitting in a wheelchair in front of an altar. No one else is visible in the image. \"This morning Pope Francis concelebrated the Holy Mass in the chapel of the apartment on the 10th floor of the Policlinico Gemelli,\" a Vatican statement read. Read more:Pope Francis' voice heard for first time since he entered hospital in new audio messageThe Pope has had 'two episodes of acute respiratory failure', Vatican says The 88-year-old pontiff is being treated at the Gemelli Hospital in Rome - and he has not been seen publicly since being admitted. Doctors at the facility say he is no longer in a critical condition - having been admitted with bronchitis on 14 February and later diagnosed with double pneumonia and a polymicrobial infection. But those looking after him stress that his age and lack of mobility mean his situation remains complex.  Earlier, the Pope said he was facing a \"period of trial\" as he issued his traditional Sunday prayer from hospital. He thanked worshippers for \"all your prayers\", expressing his gratitude to those \"who assist me with such dedication\". By Lisa Holland, Sky correspondent, in Vatican City\n Without any kind of image of the Pope over the last four weeks, there's been something of an information vacuum which was inevitably filled with speculation about his health. This photograph tells us that the Pope is conscious, able to sit up and pray. We can't really see his face but we can make out that he isn't on oxygen - and we know throughout his hospitalisation he has had oxygen via nasal cannulas and also a more intensive oxygen mask over his nose and mouth. It's not known how long the Pope can manage without any kind of support for his breathing.\nBut the fact the photograph is taken from behind raises other questions about why doctors and the Vatican didn't want to show his face. It could be an issue of dignity given that we know the 88-year-old Pope is seriously ill and continuing his treatment for pneumonia in both lungs.   \n It could be that they simply don't want an intrusive image of someone so frail. It's not known why the photograph was released now.  Up until today the Vatican has released tweets, an audio recording and regular personal messages via his weekly Angelus address in written form.\nHowever after a month in hospital it doesn't feel like the Vatican could have left it any longer to support it's medical updates with an actual image of the Pope. Earlier in the day a group of around 100 children had visited the Gemelli and a rumour had spread that the Pope might come to the window. In the event - and probably at the insistence of doctors - he stayed behind closed doors. It may be a coincidence but the sudden rumour then the disappointment of not appearing at the Gemelli may have persuaded Vatican officials to deliver the next best thing - a picture of the pontiff. \"Our bodies are weak but, even like this, nothing can prevent us from loving, praying, giving ourselves, being for each other, in faith, shining signs of hope,\" he said. Praising his medical team, he said: \"How much light shines, in this sense, in hospitals and places of care! How much loving care illuminates the rooms, the corridors, the clinics, the places where the humblest services are performed!\"  The pontiff also offered his prayers to \"countries wounded by war… tormented Ukraine, Palestine, Israel, Lebanon, Myanmar, Sudan, and the Democratic Republic of the Congo\". Pope Francis - whose pre-papal name is Jorge Mario Bergoglio - was elected as the 266th pope in March 2013."
    },
    {
        "title": "Second teenager dies after car crash in West Midlands - as two others suffer serious injuries",
        "description": "Two teenagers have died and another is fighting for his life after a late night car crash in Shropshire.",
        "url": "https://news.sky.com/story/second-teenager-dies-after-car-crash-in-west-midlands-as-two-others-suffer-serious-injuries-13330629",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tong-shropshire-crash_6859158.jpg?20250316224603",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 20:56:00",
        "Headline": "Police appeal for information after a car crash in the Shropshire area left two teenagers dead.",
        "Content": "Two teenagers have died and another is fighting for his life after a late night car crash in Shropshire. A collision involving a silver Audi A1 occurred shortly before 11.15pm on Friday in Offoxey Road, Tong - near the town of Shifnal, West Mercia Police said. It has since been confirmed an 18-year-old man was pronounced dead at the scene, while a 17-year-old boy died in hospital. Another 17-year-old boy is still being treated in hospital and is in a critical condition after sustaining life-threatening injuries in the crash. A fourth, also a 17-year-old boy, sustained what has been described as \"life-changing\" injuries but is in a stable condition, police said. \"Officers investigating the collision are continuing to appeal for anyone who may have information about the incident to get in touch,\" a police spokesperson said. Anyone with information is footage is asked to contact DC Rich Owen on 07814773916 or SCIUNorth@westmercia.police.uk quoting incident number 554 of 14 March"
    },
    {
        "title": "Newcastle United beat Liverpool to win Carabao Cup - ending 70-year wait for domestic trophy",
        "description": "Newcastle United have won their first domestic trophy in 70 years after beating Liverpool 2-1 in the Carabao Cup. ",
        "url": "https://news.sky.com/story/newcastle-united-beat-liverpool-to-win-carabao-cup-ending-70-year-wait-for-domestic-trophy-13330400",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-newcastle-liverpool_6858954.jpg?20250316190219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 17:01:00",
        "Headline": "The Magpies' 2-1 victory ends their drought as tens of thousands of travelling fans celebrate. ",
        "Content": " Newcastle United have won their first domestic trophy in 70 years after beating Liverpool 2-1 in the Carabao Cup.  Tens of thousands of Magpies fans flooded the capital to watch their team end their drought against last year's winners at Wembley. TV presenters Declan Donnelly and Ant McPartlin were among fans rejoicing in the stands, while celebrations erupted across Newcastle. The club lifted the European Inter-City Fairs Cup in 1969 but haven't won a domestic trophy since their 1955 FA Cup victory. Liverpool, who have won 38 major trophies since the Black and Whites last got their hands on any silverware, went into the match as heavy favourites. The last time the teams met, in the league last month, Liverpool eased to a 2-0 win - and they sit comfortably top of the Premier League table, seemingly headed for the title. But Newcastle had the best of the first half and got their reward as local hero Dan Burn headed home from a corner just before half time, sending supporters into dreamland. They found the back of the net again early in the second half, but the celebrations were cut short as the goal was disallowed for offside. Read more from Sky News:Parts of UK will be hotter than Ibiza next weekPrince Harry immigration filed must be made public Minutes later, Alexander Isak struck and this time it did count, doubling Newcastle's lead and sending the Geordie faithful in the crowd wild once more. Liverpool gave themselves a lifeline in stoppage time with a goal from Federico Chiesa - after a tense VAR check - but Newcastle held on to secure the win. 'For them it's like the World Cup' Eddie Howe, who became the first English manager to win a domestic trophy since Harry Redknapp in 2008 in front of a crowd of 88,513, told Sky Sports he was \"very emotional\". \"We just knew what was at stake today for all the people here, all the people back in Newcastle and we just wanted to do them proud,\" he said. \"We were desperate to try and win the trophy after all the years of hurt. I'm so pleased not just with the result, but with the performance. I thought we deserved the win today.\" Bruno Guimaraes described his side's win as \"one of the best days\" of his life, telling Sky Sports: \"It's a lot for these fans, they deserve everything.\" \"For them this is like the World Cup. People have not seen Newcastle as champions. We are here to make history and I'm very happy. We deserve this, this is unbelievable.\" Liverpool's League Cup loss comes just days after the Premier League leaders were knocked out of the Champions League by Paris St Germain (PSG) on penalties."
    },
    {
        "title": "North Sea ship crash: Crew of US oil tanker praised as 'heroic'",
        "description": "The crew of a US oil tanker struck by a container ship in the North Sea have been praised as \"heroic\" for triggering a crucial firefighting system before abandoning the vessel.",
        "url": "https://news.sky.com/story/north-sea-ship-crash-crew-of-us-oil-tanker-praised-as-heroic-13330632",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-crash-north-sea-stena_6853182.jpg?20250311151701",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 21:10:00",
        "Headline": "The container ship Solong collided with the vessel off the east coast of Yorkshire on Monday. ",
        "Content": "The crew of a US oil tanker struck by a container ship in the North Sea have been praised as \"heroic\" for triggering a crucial firefighting system before abandoning the vessel. A sailor from the Portuguese-registered Solong is missing presumed dead after the collision off the east coast of Yorkshire on Monday morning. The Stena Immaculate had been carrying 220,000 barrels of jet fuel in 16 segregated tanks, but the maritime company that operates the tanker said only one was damaged thanks to the actions of the crew. Vice president of the firm Crowley, Cal Hayden, said: \"Before being forced to abandon ship, the crew had the dedication and presence of mind to ensure fire monitors were active in order to provide boundary cooling water to the adjacent cargo tanks. \"Their heroic action limited damage to only the cargo tanks impacted due to the allision.\"  A fire on the ship burned for three days after the incident and a salvage team has confirmed that 17,515 barrels of the 220,000 being carried have been lost, the company said. Crowley said the remaining cargo and bunkers are secure and the salvage operation is ongoing. \"The Coastguard position remains that there continues to be no cause for concern for pollution from the tanker,\" a statement said. Read more from Sky News:Officials among 20 arrested after North Macedonian nightclub blazeVatican releases first image of Pope Francis sine illness The Solong's captain, Russian national Vladimir Motin, 59, appeared at Hull Magistrates' Court on Saturday morning charged with gross negligence manslaughter and was remanded in custody to appear at the Old Bailey on 14 April. The missing crew member has been named by the Crown Prosecution Service as 38-year-old Filipino national Mark Angelo Pernia. He was working on the forward deck where there was an explosion following the collision and his fellow crew members were not able to find him before evacuating. A large search and rescue operation was launched and successfully brought 36 people from both ships back ashore."
    },
    {
        "title": "UK weather: Parts of country will be hotter than Ibiza this week",
        "description": "Parts of the UK could be hotter than Ibiza and Corfu on Thursday - on the first official day of spring.",
        "url": "https://news.sky.com/story/uk-weather-parts-of-country-will-be-hotter-than-ibiza-next-week-13330244",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-uk-weather-london-weather_6858636.jpg?20250316150606",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-16 14:55:00",
        "Headline": "Temperatures could reach 19C (66F) in the south of England on Thursday, the Met Office says, higher than the 17C (62F) predicted in Ibiza and 16C (60F) in Corfu.",
        "Content": "Parts of the UK could be hotter than Ibiza and Corfu on Thursday - on the first official day of spring. Temperatures could reach 19C (66F) in the south of England on 20 March, the Met Office said, higher than the 17C (62F) predicted in Ibiza and 16C (60F) in Corfu. Met Office meteorologist Becky Mitchell said: \"We're expecting quite a lot of dry weather, increasing amounts of sunshine as we head through the next few days. \"By Wednesday, we're looking at highs of about 17C in the South. And then on Thursday, we could get as high as 19C.\"  Check the weather forecast where you are The warmer-than-usual temperatures are 8C (46F) above average for the time of year, according to the Met Office. But before then, things will continue to feel cooler, with temperatures of around 10C. \"We've also got quite a chilly wind at the moment, so it's making it feel even colder,\" Ms Mitchell said. Read more from Sky NewsBest pictures from this week's blood moonRats enjoy banquet during bin strikeStranded astronauts return after nine months Thursday will mark the spring equinox, considered the first day of the new season. It will be warmest across southeast England and the Midlands - with warmer temperatures travelling north and westwards to Wales, Scotland, and Northern Ireland. \"There's really just northern Scotland that will keep hold of the colder weather though the middle of the week,\" Ms Mitchell said."
    },
    {
        "title": "Second teenager dies after car crash in West Midlands - as two others suffer serious injuries",
        "description": "Two teenagers have died and another is fighting for his life after a late night car crash in Shropshire.",
        "url": "https://news.sky.com/story/second-teenager-dies-after-car-crash-in-west-midlands-as-two-others-suffer-serious-injuries-13330629",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tong-shropshire-crash_6859158.jpg?20250316224603",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-16 20:56:00",
        "Headline": "Police appeal for information after a car crash in the Shropshire area left two teenagers dead.",
        "Content": "Two teenagers have died and another is fighting for his life after a late night car crash in Shropshire. A collision involving a silver Audi A1 occurred shortly before 11.15pm on Friday in Offoxey Road, Tong - near the town of Shifnal, West Mercia Police said. It has since been confirmed an 18-year-old man was pronounced dead at the scene, while a 17-year-old boy died in hospital. Another 17-year-old boy is still being treated in hospital and is in a critical condition after sustaining life-threatening injuries in the crash. A fourth, also a 17-year-old boy, sustained what has been described as \"life-changing\" injuries but is in a stable condition, police said. \"Officers investigating the collision are continuing to appeal for anyone who may have information about the incident to get in touch,\" a police spokesperson said. Anyone with information is footage is asked to contact DC Rich Owen on 07814773916 or SCIUNorth@westmercia.police.uk quoting incident number 554 of 14 March"
    },
    {
        "title": "North Sea ship crash: Crew of US oil tanker praised as 'heroic'",
        "description": "The crew of a US oil tanker struck by a container ship in the North Sea have been praised as \"heroic\" for triggering a crucial firefighting system before abandoning the vessel.",
        "url": "https://news.sky.com/story/north-sea-ship-crash-crew-of-us-oil-tanker-praised-as-heroic-13330632",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-crash-north-sea-stena_6853182.jpg?20250311151701",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-16 21:10:00",
        "Headline": "The container ship Solong collided with the vessel off the east coast of Yorkshire on Monday. ",
        "Content": "The crew of a US oil tanker struck by a container ship in the North Sea have been praised as \"heroic\" for triggering a crucial firefighting system before abandoning the vessel. A sailor from the Portuguese-registered Solong is missing presumed dead after the collision off the east coast of Yorkshire on Monday morning. The Stena Immaculate had been carrying 220,000 barrels of jet fuel in 16 segregated tanks, but the maritime company that operates the tanker said only one was damaged thanks to the actions of the crew. Vice president of the firm Crowley, Cal Hayden, said: \"Before being forced to abandon ship, the crew had the dedication and presence of mind to ensure fire monitors were active in order to provide boundary cooling water to the adjacent cargo tanks. \"Their heroic action limited damage to only the cargo tanks impacted due to the allision.\"  A fire on the ship burned for three days after the incident and a salvage team has confirmed that 17,515 barrels of the 220,000 being carried have been lost, the company said. Crowley said the remaining cargo and bunkers are secure and the salvage operation is ongoing. \"The Coastguard position remains that there continues to be no cause for concern for pollution from the tanker,\" a statement said. Read more from Sky News:Officials among 20 arrested after North Macedonian nightclub blazeVatican releases first image of Pope Francis sine illness The Solong's captain, Russian national Vladimir Motin, 59, appeared at Hull Magistrates' Court on Saturday morning charged with gross negligence manslaughter and was remanded in custody to appear at the Old Bailey on 14 April. The missing crew member has been named by the Crown Prosecution Service as 38-year-old Filipino national Mark Angelo Pernia. He was working on the forward deck where there was an explosion following the collision and his fellow crew members were not able to find him before evacuating. A large search and rescue operation was launched and successfully brought 36 people from both ships back ashore."
    },
    {
        "title": "Newcastle United beat Liverpool to win Carabao Cup - ending 70-year wait for domestic trophy",
        "description": "Newcastle United have won their first domestic trophy in 70 years after beating Liverpool 2-1 in the Carabao Cup. ",
        "url": "https://news.sky.com/story/newcastle-united-beat-liverpool-to-win-carabao-cup-ending-70-year-wait-for-domestic-trophy-13330400",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-newcastle-liverpool_6858954.jpg?20250316190219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-16 17:01:00",
        "Headline": "The Magpies' 2-1 victory ends their drought as tens of thousands of travelling fans celebrate. ",
        "Content": " Newcastle United have won their first domestic trophy in 70 years after beating Liverpool 2-1 in the Carabao Cup.  Tens of thousands of Magpies fans flooded the capital to watch their team end their drought against last year's winners at Wembley. TV presenters Declan Donnelly and Ant McPartlin were among fans rejoicing in the stands, while celebrations erupted across Newcastle. The club lifted the European Inter-City Fairs Cup in 1969 but haven't won a domestic trophy since their 1955 FA Cup victory. Liverpool, who have won 38 major trophies since the Black and Whites last got their hands on any silverware, went into the match as heavy favourites. The last time the teams met, in the league last month, Liverpool eased to a 2-0 win - and they sit comfortably top of the Premier League table, seemingly headed for the title. But Newcastle had the best of the first half and got their reward as local hero Dan Burn headed home from a corner just before half time, sending supporters into dreamland. They found the back of the net again early in the second half, but the celebrations were cut short as the goal was disallowed for offside. Read more from Sky News:Parts of UK will be hotter than Ibiza next weekPrince Harry immigration filed must be made public Minutes later, Alexander Isak struck and this time it did count, doubling Newcastle's lead and sending the Geordie faithful in the crowd wild once more. Liverpool gave themselves a lifeline in stoppage time with a goal from Federico Chiesa - after a tense VAR check - but Newcastle held on to secure the win. 'For them it's like the World Cup' Eddie Howe, who became the first English manager to win a domestic trophy since Harry Redknapp in 2008 in front of a crowd of 88,513, told Sky Sports he was \"very emotional\". \"We just knew what was at stake today for all the people here, all the people back in Newcastle and we just wanted to do them proud,\" he said. \"We were desperate to try and win the trophy after all the years of hurt. I'm so pleased not just with the result, but with the performance. I thought we deserved the win today.\" Bruno Guimaraes described his side's win as \"one of the best days\" of his life, telling Sky Sports: \"It's a lot for these fans, they deserve everything.\" \"For them this is like the World Cup. People have not seen Newcastle as champions. We are here to make history and I'm very happy. We deserve this, this is unbelievable.\" Liverpool's League Cup loss comes just days after the Premier League leaders were knocked out of the Champions League by Paris St Germain (PSG) on penalties."
    },
    {
        "title": "UK weather: Parts of country will be hotter than Ibiza this week",
        "description": "Parts of the UK could be hotter than Ibiza and Corfu on Thursday - on the first official day of spring.",
        "url": "https://news.sky.com/story/uk-weather-parts-of-country-will-be-hotter-than-ibiza-next-week-13330244",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-uk-weather-london-weather_6858636.jpg?20250316150606",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-16 14:55:00",
        "Headline": "Temperatures could reach 19C (66F) in the south of England on Thursday, the Met Office says, higher than the 17C (62F) predicted in Ibiza and 16C (60F) in Corfu.",
        "Content": "Parts of the UK could be hotter than Ibiza and Corfu on Thursday - on the first official day of spring. Temperatures could reach 19C (66F) in the south of England on 20 March, the Met Office said, higher than the 17C (62F) predicted in Ibiza and 16C (60F) in Corfu. Met Office meteorologist Becky Mitchell said: \"We're expecting quite a lot of dry weather, increasing amounts of sunshine as we head through the next few days. \"By Wednesday, we're looking at highs of about 17C in the South. And then on Thursday, we could get as high as 19C.\"  Check the weather forecast where you are The warmer-than-usual temperatures are 8C (46F) above average for the time of year, according to the Met Office. But before then, things will continue to feel cooler, with temperatures of around 10C. \"We've also got quite a chilly wind at the moment, so it's making it feel even colder,\" Ms Mitchell said. Read more from Sky NewsBest pictures from this week's blood moonRats enjoy banquet during bin strikeStranded astronauts return after nine months Thursday will mark the spring equinox, considered the first day of the new season. It will be warmest across southeast England and the Midlands - with warmer temperatures travelling north and westwards to Wales, Scotland, and Northern Ireland. \"There's really just northern Scotland that will keep hold of the colder weather though the middle of the week,\" Ms Mitchell said."
    },
    {
        "title": "Prince Harry immigration files must be made public next week, US court rules",
        "description": "Prince Harry's immigration files must be made public by this Tuesday, a US court has ruled.",
        "url": "https://news.sky.com/story/prince-harry-immigration-files-must-be-made-public-next-week-us-court-rules-13329988",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-prince-harry-vancouver_6858439.jpg?20250316115003",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-16 07:54:00",
        "Headline": "The Duke and Duchess of Sussex moved to the US in 2020 after their public split from the Royal Family. Following a brief spell in Canada, they have lived in California.",
        "Content": "Prince Harry's immigration files must be made public by this Tuesday, a US court has ruled. Judge Carl Nichols ordered documents relating to the Duke of Sussex's US visa application to be released as part of an ongoing Freedom of Information (FOI) request. The FOI request was brought by conservative US think-tank the Heritage Foundation, which alleges the duke may have concealed past drug use and that should have disqualified him from obtaining a US visa. Judge Nichols ordered the US Department of Homeland Security to release a redacted version of the documents no later than Tuesday, according to court filings dated 15 March. However, in September 2024, the same judge previously said that the public did not have a strong interest in the disclosure of Harry's immigration records. But the Heritage Foundation wanted the judgment changed. It questioned why Harry was allowed into the US in 2020 after the royal referenced taking cocaine, marijuana and psychedelic mushrooms in his book Spare. \n                  Prince Harry welcomes next Invictus Games in UK during closing ceremony \n                 \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 \n                  Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump\n                 In his memoir, Harry said cocaine \"didn't do anything for me\", adding: \"Marijuana is different, that actually really did help me.\" The foundation also said that answers about his prior drug use in his visa application could raise questions over the US government's integrity. Despite refusing the previous FOI request, lawyers for the Department of Homeland Security agreed in February to release redacted versions of the forms. \"Specifically, Defendant would propose redacting all information in these items that would reveal information that the Court has determined Defendant can withhold,\" department lawyer John Bardo wrote in a court filing. In February, President Donald Trump ruled out deporting Harry from the US, telling The New York Post: \"I'll leave him alone.\" He added: \"He's got enough problems with his wife. She's terrible.\" Meghan, the Duchess of Sussex, has been a vocal critic of Mr Trump and called him \"divisive\" and a \"misogynist\". Mr Trump, in a GB News interview with Nigel Farage in March last year, also said Harry should not receive preferential treatment. Read more from Sky News:KT Tunstall's musical reinventionHeadteachers 'slapped' and 'threatened' by pupils' parentsAt least 34 killed in US tornadoes and dust storms He said: \"No. We'll have to see if they know something about the drugs, and if he lied they'll have to take appropriate action.\" The royal moved to the US in 2020, following a brief spell in Canada, with his wife Meghan, after the couple's split from the rest of the Royal Family. They have lived in California ever since."
    },
    {
        "title": "Abolished indefinite prison sentences still in place - despite prisoner numbers approaching pre-release scheme levels",
        "description": "This week government figures are likely to show the prison population back to where it was before the last early release scheme.&#160;",
        "url": "https://news.sky.com/story/abolished-indefinite-prison-sentences-still-in-place-despite-prisoner-numbers-approaching-pre-release-scheme-levels-13329119",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andy-logan-ipp-farrell_6857211.jpg?20250315143211",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "Imprisonment for public protection (IPP) sentences were introduced in 2005 and abolished in 2012. But the law wasn't backdated, so thousands are still behind bars.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  This week government figures are likely to show the prison population back to where it was before the last early release scheme.  But even though hundreds of prisoners have served only 40% of their sentences, there is a cohort of the prison population who have served extended sentences, years beyond their minimum term. IPP sentences (imprisonment for public protection) were introduced in 2005 and abolished in 2012. But the law wasn't backdated, so the legacy of prisoners serving indefinite sentences continues. \"It's broken me as a man,\" says Andy Logan. The burly 45-year-old from Kent has spent most of the last 20 years in jail on an IPP sentence, now he won't leave home without his mother. \"I don't go out, I've got no social circle,\" he says. \"I'm not in no family photographs, it's like Back To The Future when he gets erased from the photos, I'm not there. I'm a ghost - I've been a ghost for 20 years.\" He was given IPP sentences twice, for two cashpoint robberies where he showed his victims a knife but didn't use it. The minimum terms for each crime were two-and-a-half years and three years, but each time he spent far longer behind bars, the first time four years, then seven years. But that wasn't the end of it. After his release, Andy's IPP hung over him. He could be recalled for any misdemeanour, including drinking too much alcohol, taking drugs, or missing probation appointments. Over the next eight years he was recalled six times and would spend months behind bars waiting for a decision. His recall prison time alone has amounted to nearly four years. Twice the recalls were later deemed \"unjustified\". Read more from Sky NewsFive in court over woman's fatal shootingGang jailed for kidnapping music producerShip captain appears in court \"I started my sentence with people who murdered people - and some of them got out before me,\" says Andy. \"I lost all hope. I thought I'd never get out. I took drugs for four years. I exploded in weight. Self-harm started happening and I'd never self-harmed in my life.\" Andy lifts up his sleeve to reveal a red scar. \"That one, I nearly did the artery on my last recall. I was just so frustrated I wanted to die.\" His lawyer Catherine Bond says he was often recalled for minor breaches. She said: \"One was in 2020 - Andy does struggle with alcohol addiction. He had started drinking more at that point. \"He kept his probation officer informed, but his probation officer recalled him anyway, and the parole board found the recall was unjustified because although there was alcohol use, that doesn't necessarily equate to any increased risk.\" Each IPP recall is 're-traumatising' Ms Bond says the recalls have damaged Andy's mental health. \"Each time you go back in there you don't know when you are going to get back out so the whole process is re-traumatising, and I think it can make it more difficult for people to resettle when they get back out so each recall can increase the risk of further recalls,\" she said. But she also has IPP clients who've never been released - one jailed in 2005. \"It was a robbery - threat of violence. I'm not minimising that in any way but 20 years on it's totally disproportionate and these are people's lives,\" she said. \"Of course, they've done something wrong but effectively it is the misfortune of having committed an offence at a particular time... meant they are in prison for this excessive amount of time.\" The number of unreleased prisoners on IPP has fallen from 5,000 in 2015 to 1,180 in early 2024. Around 700 of those have served 10 years longer than their minimum term. The number recalled is rising with over 1,600 currently back in jail, mostly for licence breaches. The average time spent imprisoned on recall has risen dramatically from 11 months to around 26 months. Andy is so fearful of recall, he doesn't go out without his mother Betty. As Betty drives him to meet his probation officer, he says: \"What if someone takes a dislike to me and says 'who are you looking at?' and makes an allegation against me - I'm in prison. So, I'm just terrified.\" But Andy hopes this could be one of his last visits to probation. Until recently, any IPP prisoner would have to wait at least 10 years after their release from prison before their licence could even be considered for removal by a parole board - but in February this year that time period was reduced to three years. For Andy that means in the next few months he could finally get off it.  A Ministry of Justice (MoJ) spokesperson said: \"It is right that IPP sentences were abolished. With public protection as the number one priority, the lord chancellor is working with organisations and campaign groups to ensure appropriate action is taken to support those still serving these sentences, such as improved access to mental health support and rehabilitation programmes. \"An independent report from His Majesty's Inspectorate of Prisons found the majority of recall decisions were necessary to keep our streets safe. However, to avoid waiting unnecessarily for parole board hearings, eligible IPP prisoners can now be considered for release earlier after a thorough risk assessment.\" The prison population is bursting and is set to run out of space within a year according to internal forecasts from the MoJ. But some of those taking up space - probably shouldn't still be there."
    },
    {
        "title": "Government officials among 20 arrested after 59 killed in North Macedonia nightclub fire",
        "description": "Around 20 arrests have been made over a nightclub fire that killed at least 59 people in North Macedonia.",
        "url": "https://news.sky.com/story/at-least-50-dead-after-nightclub-fire-in-kocani-north-macedonia-13329983",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kocani-north-macedonia_6858400.jpg?20250316101253",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-16 07:50:00",
        "Headline": "The blaze broke out while local band DNK was performing. Reports said fireworks were set off inside the venue, causing the roof to catch fire.",
        "Content": " Around 20 arrests have been made over a nightclub fire that killed at least 59 people in North Macedonia. Authorities said 155 others were injured after the blaze broke out at Pulse in the eastern town of Kocani at around 2.35am on Sunday. Sparks ignited the roof while local band DNK was performing, sending hundreds of people scrambling for the small venue's only exit. Video from inside showed the band playing on stage before two flares went off either side of them and shot towards the ceiling. Interior minister Pance Toskovski told a news conference, reported by the Reuters news agency, that more than 20 of those injured and three of the people killed were aged under 18. He said government officials and the manager of the club, which did not have a valid licence, are among around 20 people who have been arrested in connection with the fire.  The club owner's son and members of the band are also among those who have been held, he said. North Macedonian Prime Minister Hristijan Mickoski said the licence was issued illegally by the economy ministry and promised those responsible would face justice. \"Regardless of who they are, from which institution, from what level, from which party and profession,\" he said as he declared seven days of national mourning. Some of the injured are being treated at Kocani General Hospital, where relatives have gathered desperate for more information, newspaper Nova Makedonija said. Broadcaster MRT reported that 27 people were being treated for severe burns at Skopje City Hospital, with another 23 at the Clinical Centre. 'This was my only child' Dragi Stojanov's only son Tomce died in the fire.  \"It's my only child and he died,\" he told reporters at the scene. \"What am I supposed to do?\" He said he had been there \"all night\" and that \"they can't even get bodies out\", with \"200 people\" still inside. \"This was my only child. I don't need my life anymore. I don't need my life,\" he told the media. A woman who was in the nightclub when the fire broke out suffered an injured ear and knee, and her sister is still missing. \"The fire broke out suddenly and everyone started running for the exit,\" the unnamed survivor said. \"There were charred bodies. I don't know… everyone is stressed. \"My sister is missing, we were unable to find her in the hospitals, so now we're waiting here, to find out if she's here.\" Read more from Sky NewsTrump launches air strikes over Red SeaUS expels South African ambassadorRussian ship captain appears in court Mr Mickoski described the deadly incident as a \"difficult and very sad day for Macedonia\". \"The loss of so many young lives is irreparable, and the pain of the families, loved ones and friends is immeasurable,\" he wrote in a post on X. He promised the government would do \"everything in their power to at least slightly alleviate their pain\". Police and forensic investigators cordoned off the scene on Sunday, with authorities saying evidence would be collected for state prosecutors. North Macedonia's public prosecutor Ljupco Kocevski said five prosecutors would investigate the incident. He said people were being interviewed, adding: \"At the moment, orders have been issued to collect evidence\". The US ambassador to North Macedonia Angela Aggeler also posted on X, saying her \"heart breaks this morning for the many victims in last night's fire at a nightclub in Kochani\". \"Our deepest condolences go to the victims and their loved ones at this awful time, and wishes for a speedy recovery to those who were injured,\" she said. Various leaders offered their condolences, including Albanian Prime Minister Edi Rama and Ukrainian President Volodymyr Zelenskyy. \"I wish those who were injured a speedy recovery. Ukraine mourns alongside our North Macedonian friends on this sad day,\" Mr Zelenskyy wrote on X."
    },
    {
        "title": "Father's grief after losing only son in North Macedonia nightclub fire",
        "description": "A father has said his only son, who died in a nightclub fire in North Macedonia, had \"only [just] started to live\" and that more than 150 families have been left \"devastated\" by the tragedy.",
        "url": "https://news.sky.com/story/fathers-grief-after-losing-only-son-in-north-macedonia-nightclub-fire-13330122",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-north-macedonia-fire_6858453.png?20250316123325",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-16 12:42:00",
        "Headline": "Dragi Stojanov's son Tomce, 21, was inside Pulse nightclub in the eastern town of Kocani in the early hours of Sunday when the fire broke out.",
        "Content": " A father has said his only son, who died in a nightclub fire in North Macedonia, had \"only [just] started to live\" and that more than 150 families have been left \"devastated\" by the tragedy. Dragi Stojanov's son Tomce, 21, was among the crowd inside Pulse nightclub in the eastern town of Kocani in the early hours of Sunday when the fire broke out. Local media reports and video from inside the venue suggest fireworks were set off while local band DNK was performing, causing the roof to catch fire. Speaking at the scene on Sunday, interior minister Panche Toshkovski confirmed at least 59 people have died, 39 of whom have been identified, and more than 150 others injured. Mr Stojanov told reporters at the scene: \"It's my only child and he died. What is left for me in life? I don't need my life anymore.\" Asked for his age, he said his son had \"only [just] started to live\".  Mr Stojanov stayed at the scene \"all night\", he added, claiming authorities \"can't even get the bodies out\" and that there \"must be 200 people inside\". He described the victims as \"children… burnt, beyond recognition\". \"There are corpses, just corpses inside. They can't pull them out. One-hundred-and-fifty families are devastated.\" Four arrest warrants have been issued in connection with the incident, which unfolded at 2.35am on Sunday. Survivor's sister was 'stomped over' An unnamed survivor also spoke to reporters at the scene. She suffered injuries to her ear and knee - and her sister is still missing. \"The fire broke out suddenly and everyone started running for the exit,\" she said. \"There were charred bodies. I don't know… everyone is stressed.\" She added that she and her family have been \"unable to find\" her sibling in any of the hospitals. \"She is injured. Running outside she fell and people stomped over her,\" she told reporters. Read more from Sky NewsTrump launches deadly airstrikes across Red SeaAt least 34 killed in US tornadoesNine Palestinians killed in Israeli airstrike Rescuers and forensic investigators are still working at the scene, which was sealed off by police on Sunday morning. Officials said evidence would be passed to the local prosecutor. The country's Prime Minister Hristijan Mickoski described the deadly incident as a \"difficult and very sad day for Macedonia\". \"The loss of so many young lives is irreparable, and the pain of the families, loved ones and friends is immeasurable,\" he wrote in a post on X. He promised the government would do \"everything in their power to at least slightly alleviate their pain\". Among those offering their condolences were Albanian Prime Minister Edi Rama and Ukrainian President Volodymyr Zelenskyy. \"I wish those who were injured a speedy recovery. Ukraine mourns alongside our North Macedonian friends on this sad day,\" Mr Zelenskyy wrote on X."
    },
    {
        "title": "Vatican releases first image of Pope Francis since he fell ill",
        "description": "The Vatican has released the first image of Pope Francis since he was taken to hospital more than a month ago. ",
        "url": "https://news.sky.com/story/vatican-releases-first-image-of-pope-francis-since-he-fell-ill-13330453",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pope-francis_6858873.jpg?20250316180059",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-16 17:56:00",
        "Headline": "Pope Francis, 88, was admitted to hospital on 14 February and has not been seen in public since.",
        "Content": "The Vatican has released the first image of Pope Francis since he was taken to hospital more than a month ago.  The photograph shows the leader of the Catholic church celebrating a mass in his prayer room on Sunday morning. He is seen wearing a purple stole while sitting in a wheelchair in front of an altar. No one else is visible in the image. \"This morning Pope Francis concelebrated the Holy Mass in the chapel of the apartment on the 10th floor of the Policlinico Gemelli,\" a Vatican statement read. Read more:Pope Francis' voice heard for first time since he entered hospital in new audio messageThe Pope has had 'two episodes of acute respiratory failure', Vatican says The 88-year-old pontiff is being treated at the Gemelli Hospital in Rome - and he has not been seen publicly since being admitted. Doctors at the facility say he is no longer in a critical condition - having been admitted with bronchitis on 14 February and later diagnosed with double pneumonia and a polymicrobial infection. But those looking after him stress that his age and lack of mobility mean his situation remains complex.  Earlier, the Pope said he was facing a \"period of trial\" as he issued his traditional Sunday prayer from hospital. He thanked worshippers for \"all your prayers\", expressing his gratitude to those \"who assist me with such dedication\". By Lisa Holland, Sky correspondent, in Vatican City\n Without any kind of image of the Pope over the last four weeks, there's been something of an information vacuum which was inevitably filled with speculation about his health. This photograph tells us that the Pope is conscious, able to sit up and pray. We can't really see his face but we can make out that he isn't on oxygen - and we know throughout his hospitalisation he has had oxygen via nasal cannulas and also a more intensive oxygen mask over his nose and mouth. It's not known how long the Pope can manage without any kind of support for his breathing.\nBut the fact the photograph is taken from behind raises other questions about why doctors and the Vatican didn't want to show his face. It could be an issue of dignity given that we know the 88-year-old Pope is seriously ill and continuing his treatment for pneumonia in both lungs.   \n It could be that they simply don't want an intrusive image of someone so frail. It's not known why the photograph was released now.  Up until today the Vatican has released tweets, an audio recording and regular personal messages via his weekly Angelus address in written form.\nHowever after a month in hospital it doesn't feel like the Vatican could have left it any longer to support it's medical updates with an actual image of the Pope. Earlier in the day a group of around 100 children had visited the Gemelli and a rumour had spread that the Pope might come to the window. In the event - and probably at the insistence of doctors - he stayed behind closed doors. It may be a coincidence but the sudden rumour then the disappointment of not appearing at the Gemelli may have persuaded Vatican officials to deliver the next best thing - a picture of the pontiff. \"Our bodies are weak but, even like this, nothing can prevent us from loving, praying, giving ourselves, being for each other, in faith, shining signs of hope,\" he said. Praising his medical team, he said: \"How much light shines, in this sense, in hospitals and places of care! How much loving care illuminates the rooms, the corridors, the clinics, the places where the humblest services are performed!\"  The pontiff also offered his prayers to \"countries wounded by war… tormented Ukraine, Palestine, Israel, Lebanon, Myanmar, Sudan, and the Democratic Republic of the Congo\". Pope Francis - whose pre-papal name is Jorge Mario Bergoglio - was elected as the 266th pope in March 2013."
    },
    {
        "title": "Crew welcomed into International Space Station to replace astronauts stranded for nine months",
        "description": "A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months.",
        "url": "https://news.sky.com/story/crew-arrives-at-international-space-station-to-replace-astronauts-stranded-for-9-months-13329910",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nasa-space-iss-astronauts_6858189.jpg?20250316061149",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-16 04:37:00",
        "Headline": "Butch Wilmore and Suni Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft experienced problems.",
        "Content": " A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months. A SpaceX capsule delivered four astronauts on Sunday on a mission to allow Butch Wilmore and Suni Williams - who have been on the ISS since June 2024 - to return home. The Dragon craft, with the Crew-10 astronauts inside, docked with the orbiting laboratory at 4.04am UK time, around 29 hours after it had been launched on the top of the Falcon 9 rocket from NASA's Kennedy Space Center in Florida. NASA's Anne McClain and Nichole Ayers, both military pilots, along with Japan's Takuya Onishi and Russia's Kirill Peskov, both former airline pilots, will spend the next six months at the space station. Their mission will allow four members of Crew-9, which includes Mr Wilmore and Ms Williams, to return to Earth. It took several minutes for Dragon to safely dock at the ISS, in what is an automated process. But there was about 1 hour and 45 minutes of additional safety checks before the hatch could be opened. \n                  Rocket with replacement crew for NASA astronauts stranded for nine months finally launches\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \n                  NASA astronauts stuck on International Space Station say they 'don't feel like castaways'\n                 Mr Wilmore swung open the space station's hatch and rang the ship's bell as the arrivals floated in one by one and were greeted with hugs and handshakes. How they were stranded Mr Wilmore and Ms Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft started experiencing problems. Technical issues left them stranded, and various attempts to bring them home were unsuccessful. The craft encountered so many problems that NASA insisted it return to Earth empty, leaving the pilots behind until now. 'You can hardly even put it into words' \"It was a wonderful day. Great to see our friends arrive,\" Ms Williams told Mission Control after the new astronauts had been welcomed aboard. Speaking after the successful docking, Ms McClain added: \"Crew-10 has had a great journey up here and I cannot tell you the immense joy of our crew when we looked out the window and we saw the space station for the first time. \"That is such an amazing journey. You can hardly even put it into words.\" The journey back to Earth The four newcomers will spend the next few days learning the station's ins and outs from Mr Wilmore and Ms Williams. Then the two of them will strap into their own capsule later in the week, one that has been up there since last year, to close out the unexpected extended mission. The pair's ride back arrived in late September with a downsized crew of two and two empty seats reserved for the leg back. But more delays emerged when their replacements' brand new capsule needed extensive battery repairs. An older capsule took its place, pushing up their return by a couple of weeks to mid-March. Read more from Sky News:Four in five headteachers abused by parentsTrump kills at least 31 civilians in Red SeaKT Tunstall's musical reinvention Weather permitting, the SpaceX capsule carrying them and two other astronauts will undock no earlier than Wednesday and splash down off Florida's coast."
    },
    {
        "title": "Carney wastes no time tearing into Trump, but can he save Canada from becoming America's 51st state?",
        "description": "President Donald J Trump wants to redraw the political map of the world to benefit \"America First\".",
        "url": "https://news.sky.com/story/carney-wastes-no-time-tearing-into-trump-but-can-he-save-canada-from-becoming-americas-51st-state-13329087",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump_6857115.jpg?20250315132202",
        "type": "World",
        "Author": "Adam Boulton",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "Donald Trump's second term has begun with him tearing up the established rules-based order in the West in pursuit of his own foreign policy. This includes wanting to take control of Greenland and the Panama Canal, and starting trade wars with once close allies.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n President Donald J Trump wants to redraw the political map of the world to benefit \"America First\". Some may laugh at his ignorance of history and his boastful schoolboyish territorial ambitions. Yet, in pursuit of his dream of fortress North America, he has already shown himself willing to tear up the rules-based order, which was agreed after the Second World War to stop countries from invading each other - at least in the democratic world. He has already broken international treaties entered into by US presidents - including by himself in the case of trade with Mexico and Canada. Since being inaugurated as US president for the second time in January, Trump has relentlessly spelled out what new conquests he is after. He predicts the US will \"get\" Greenland \"one way or the other\". \"We need Greenland for national security and even international security,\" he explained unconvincingly. \n                  Prime Minister Mark Carney says Canada will 'never ever be part of US' and talk of nation becoming 51st state is 'crazy'\n                 \n                  King Charles reaffirms commitment to Canada against backdrop of US trade war\n                 \n                  Small acts of defiance in Canada raise question of what country can do against Trump's tariff trade war\n                 Trump is equally explicit about the Panama Canal: \"We gave it to Panama. We didn't give it to China. And we are taking it back.\" The company running the ports at the Atlantic and Pacific ends of the canal caved in quickly. This month, Hong-Kong based CK Hutchinson sold out to a consortium led by the US fund managers BlackRock. Then there's Canada, the rich, independent G7 member nation, which Trump has repeatedly threatened to annex. He has taken to referring to it prematurely as the \"51st state\", while belittling its former prime minister as \"Governor Trudeau\". Who could be Canada's next PM?  In talks with Trudeau, he deliberately called into question the borders set in the 1908 Treaty signed by US president Teddy Roosevelt and Edward VII, king of Canada and the UK. \"The artificial line of separation drawn many years ago will finally disappear, and we will have the safest and most beautiful Nation anywhere in the World,\" he tweeted on his Truth Social network last week, while promising Canadians would pay \"much less tax\". Trump's aggressive language has upturned Canadian politics just ahead of a general election. Canada is the US's closest military partner and a fellow ally in NATO. It is the US's largest trading partners, supplying 80% of its aluminium and the largest source of steel. This only infuriates Trump who has slapped 25% tariffs on its metal exports and threatens more. Canada and Britain fought a war against the US in 1812 to protect its independence. Most Canadians have been horrified by Trump's unwanted attention.  The US national anthem is being booed at sporting events. American goods are being boycotted, right down to renaming Americano coffee \"Canadiano\". Meanwhile, Trump is instituting checks for those crossing the border. Canadians were expecting a change of government and a swing to the right in the general election - due by October. The outgoing Liberal government, led by Justin Trudeau, was tired after nine years in power. Difficulties with housing and the cost of living were the voters' main concerns. The Conservative Party of Pierre Poilievre, with his populist \"Canada First\" slogan, was 25% ahead. Then, Trump took office, and Trudeau stood down as Liberal Party leader. This week a political outsider was chosen with an overwhelming 85.9% of the vote as the new Liberal Party leader, automatically taking over as temporary prime minister.  Mark Carney, an economist who served previously as governor of the Bank of Canada and as the first foreigner governor of the Bank of England, is now in charge. The Liberals have shot up to neck and neck with the Conservatives, on 35% and 36% respectively, in the latest Nanos Research tracking poll. Carney is wasting no time tearing into Trump's plan in what he calls these \"dark times\". \"We didn't ask for this fight,\" he admitted with typical Canadian understatement, but \"the Americans want our resources, our water, our land and our country\". He promised: \"America is not Canada. And Canada never ever will be part of America in any way, shape or form.\" Carney is backing reciprocal tariffs against the US, even though he deplores them in principle, and predicts \"Canada will win\".  Carney has never been an elected politician. He is not even currently a member of the Canadian parliament. But, as a senior insider he piloted Canada through the 2007-2008 recession and guided the UK through Brexit, in spite of being fiercely opposed to it. He is well qualified to lead Canada in its unwanted economic war with the US. He is probably helped by coming late to the unpopular Liberal Party and keeping his distance from Trudeau. Carney and his English wife Diana are keen environmentalists but, mindful of Canada's vast oil and gas reserves, he no longer supports a carbon tax. Inevitably, his main opponent, the working-class hard man Poilievre, is attacking Carney as a member of the global elite. Like Trump during his campaign, the Conservative leader is courting the podcast \"manosphere\". Carney argues that Poilievre's previous admiration for Trump and his online bros should be a liability: \"A person who worships at the altar of Donald Trump will kneel before him, not stand up to him.\" 👉 Follow Trump 100 on your podcast app 👈 Some voices on the Conservative right are arguing that Canada should accept its mutual dependence with its southern neighbour and move closer to Trump in a North American alliance. Somewhat in contradiction, they also insist that Canada could preserve its technical independence if it goes in with Trump. Carney was only sworn in as prime minister last Friday and is expected to call an election imminently. For now, the momentum is with him. His victory would be a major rebuff to Trump - although the implications are terrifying.  Trump prefers to use economic bullying to get his way, but he has already shown with Ukraine that he is prepared to withdraw military and intelligence cooperation from allies to increase pressure. Canada and the US currently have integrated security cooperation to protect their continent. To Trump, they are freeloaders since Canada is one of NATO's under-spenders on defence. Canada has a population of 40 million, with 63,500 in the military. The US population is 340 million with 1.4 million in its armed forces. At the very least, Trump could emulate Putin if his territorial ambitions are frustrated and start a military build-up along the border. Incursions and fighting could not be ruled out after that. The UK shares a head of state and is ultimately a closer ally of Canada than the US. The annexation of Canada by the US would vindicate Trump's vision of the world as a place to be carved up by major powers led by autocratic leaders. The Trump administration is currently enabling Russia to \"get\" a significant portion of Ukraine. It follows that the US is trying to grab land from its neighbours. And if Putin and Trump can do it, it seems unlikely that Trump would risk war if Xi moves against Taiwan. The worst may not happen. But it could. The world is long past the point where Donald Trump must be taken both literally and seriously."
    },
    {
        "title": "Trump 100 Day 56: Q&A: Putin's 'hold' on Trump, the peace prize, and press access ",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-56-qa-putins-hold-on-trump-the-peace-prize-and-press-access-13328784",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On this episode, our US correspondents James Matthews and Mark Stone read through questions from listeners.  They are asked if Vladimir Putin has some kind of hold on Donald Trump, whether the US president can actually win a Nobel peace prize, and if Mark and James fear asking difficult questions to Trump's team in case they have their press access restricted, like other news organisations.You can email James, Martha, and Mark at trump100@sky.uk."
    },
    {
        "title": "At least 36 people killed as tornadoes and high winds rip through US",
        "description": "At least 36 people have been killed as tornadoes and high winds ripped through parts of the US.",
        "url": "https://news.sky.com/story/at-least-36-people-killed-as-tornadoes-and-high-winds-rip-through-us-13330197",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-storm-tornadoes_6858654.jpg?20250316151619",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-16 14:27:00",
        "Headline": "The huge storm has also produced dust storms and icy conditions. ",
        "Content": " At least 36 people have been killed as tornadoes and high winds ripped through parts of the US. The huge storm, which also produced dust storms and icy conditions, destroyed homes, wiped out schools and toppled lorries across the central and southern areas of the country. National Weather Service meteorologist Cody Snell said tornado watches remain in place for parts of the Carolinas, east Georgia and northern Florida. At least 36 people have been killed in seven states, including Missouri, where scattered twisters killed a dozen people, according to authorities. Dakota Henderson, who lives in the state, said he and others found five bodies in the debris outside what was left of his aunt's house on Friday night as they tried to rescue trapped neighbours. \"It was a very rough deal,\" he said on Saturday. \"It's really disturbing for what happened to the people, the casualties last night.\" Tornadoes continued on Saturday night as the Storm Prediction Center warned a region stretching from eastern Louisiana and Mississippi through Alabama, western Georgia and Florida was most at risk. Bailey Dillon, 24, and her fiance, Caleb Barnes, watched from their front porch in Tylertown, Mississippi, as a massive twister struck an area about half a mile away near an RV park, before they drove over to help. They filmed snapped trees, levelled buildings and overturned vehicles as Ms Dillon described the damage as \"catastrophic\". \"Everything was destroyed,\" she said. \"Homes and everything were destroyed all around it,\" she said. \"Schools and buildings are just completely gone.\" The dynamic storm, which was given a rare \"high risk\" designation from weather forecasters, has been blamed for deadly dust storms, icy weather and severe thunderstorms on Sunday. State of emergency  Mississippi governor Tate Reeves said six people died and more were missing as storms moved further east into Alabama, where three people including an 82-year-old woman were reported dead. In Arkansas, where three deaths have been confirmed, governor Sarah Huckabee Sanders declared a state of emergency. An emergency was also declared in Georgia, where a National Weather Service tornado watch posted early on Sunday warnings of isolated tornadoes, hail and gusts of up to 70mph. Dust storms and wildfires Dust storms caused by high winds were blamed for 11 deaths on Friday as eight people died in a pileup involving around 50 vehicles in Kansas, while three people were killed in car crashes in Texas. The extreme weather conditions were forecast to impact an area home to more than 100 million people, with winds threatening blizzard conditions in colder northern areas and fanning the risk of wildfires in drier, warmer areas to the south. Read more from Sky News:New crew welcomed into International Space StationPrince Harry immigration files to be made public Evacuations were ordered in some areas of Oklahoma, with more than 130 fires reported across the state and nearly 300 homes damaged or destroyed. The state's governor Kevin Stitt said some 266 square miles had burned and that he had lost a home of his own on a ranch northeast of Oklahoma City."
    },
    {
        "title": "Crew welcomed into International Space Station to replace astronauts stranded for nine months",
        "description": "A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months.",
        "url": "https://news.sky.com/story/crew-arrives-at-international-space-station-to-replace-astronauts-stranded-for-9-months-13329910",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nasa-space-iss-astronauts_6858189.jpg?20250316061149",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-16 04:37:00",
        "Headline": "Butch Wilmore and Suni Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft experienced problems.",
        "Content": " A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months. A SpaceX capsule delivered four astronauts on Sunday on a mission to allow Butch Wilmore and Suni Williams - who have been on the ISS since June 2024 - to return home. The Dragon craft, with the Crew-10 astronauts inside, docked with the orbiting laboratory at 4.04am UK time, around 29 hours after it had been launched on the top of the Falcon 9 rocket from NASA's Kennedy Space Center in Florida. NASA's Anne McClain and Nichole Ayers, both military pilots, along with Japan's Takuya Onishi and Russia's Kirill Peskov, both former airline pilots, will spend the next six months at the space station. Their mission will allow four members of Crew-9, which includes Mr Wilmore and Ms Williams, to return to Earth. It took several minutes for Dragon to safely dock at the ISS, in what is an automated process. But there was about 1 hour and 45 minutes of additional safety checks before the hatch could be opened. \n                  Rocket with replacement crew for NASA astronauts stranded for nine months finally launches\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \n                  NASA astronauts stuck on International Space Station say they 'don't feel like castaways'\n                 Mr Wilmore swung open the space station's hatch and rang the ship's bell as the arrivals floated in one by one and were greeted with hugs and handshakes. How they were stranded Mr Wilmore and Ms Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft started experiencing problems. Technical issues left them stranded, and various attempts to bring them home were unsuccessful. The craft encountered so many problems that NASA insisted it return to Earth empty, leaving the pilots behind until now. 'You can hardly even put it into words' \"It was a wonderful day. Great to see our friends arrive,\" Ms Williams told Mission Control after the new astronauts had been welcomed aboard. Speaking after the successful docking, Ms McClain added: \"Crew-10 has had a great journey up here and I cannot tell you the immense joy of our crew when we looked out the window and we saw the space station for the first time. \"That is such an amazing journey. You can hardly even put it into words.\" The journey back to Earth The four newcomers will spend the next few days learning the station's ins and outs from Mr Wilmore and Ms Williams. Then the two of them will strap into their own capsule later in the week, one that has been up there since last year, to close out the unexpected extended mission. The pair's ride back arrived in late September with a downsized crew of two and two empty seats reserved for the leg back. But more delays emerged when their replacements' brand new capsule needed extensive battery repairs. An older capsule took its place, pushing up their return by a couple of weeks to mid-March. Read more from Sky News:Four in five headteachers abused by parentsTrump kills at least 31 civilians in Red SeaKT Tunstall's musical reinvention Weather permitting, the SpaceX capsule carrying them and two other astronauts will undock no earlier than Wednesday and splash down off Florida's coast."
    },
    {
        "title": "Prince Harry immigration files must be made public next week, US court rules",
        "description": "Prince Harry's immigration files must be made public by this Tuesday, a US court has ruled.",
        "url": "https://news.sky.com/story/prince-harry-immigration-files-must-be-made-public-next-week-us-court-rules-13329988",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-prince-harry-vancouver_6858439.jpg?20250316115003",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-16 07:54:00",
        "Headline": "The Duke and Duchess of Sussex moved to the US in 2020 after their public split from the Royal Family. Following a brief spell in Canada, they have lived in California.",
        "Content": "Prince Harry's immigration files must be made public by this Tuesday, a US court has ruled. Judge Carl Nichols ordered documents relating to the Duke of Sussex's US visa application to be released as part of an ongoing Freedom of Information (FOI) request. The FOI request was brought by conservative US think-tank the Heritage Foundation, which alleges the duke may have concealed past drug use and that should have disqualified him from obtaining a US visa. Judge Nichols ordered the US Department of Homeland Security to release a redacted version of the documents no later than Tuesday, according to court filings dated 15 March. However, in September 2024, the same judge previously said that the public did not have a strong interest in the disclosure of Harry's immigration records. But the Heritage Foundation wanted the judgment changed. It questioned why Harry was allowed into the US in 2020 after the royal referenced taking cocaine, marijuana and psychedelic mushrooms in his book Spare. \n                  Prince Harry welcomes next Invictus Games in UK during closing ceremony \n                 \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 \n                  Prince Harry's criticism of 'weak moral character' at Invictus Games felt like a jibe at Donald Trump\n                 In his memoir, Harry said cocaine \"didn't do anything for me\", adding: \"Marijuana is different, that actually really did help me.\" The foundation also said that answers about his prior drug use in his visa application could raise questions over the US government's integrity. Despite refusing the previous FOI request, lawyers for the Department of Homeland Security agreed in February to release redacted versions of the forms. \"Specifically, Defendant would propose redacting all information in these items that would reveal information that the Court has determined Defendant can withhold,\" department lawyer John Bardo wrote in a court filing. In February, President Donald Trump ruled out deporting Harry from the US, telling The New York Post: \"I'll leave him alone.\" He added: \"He's got enough problems with his wife. She's terrible.\" Meghan, the Duchess of Sussex, has been a vocal critic of Mr Trump and called him \"divisive\" and a \"misogynist\". Mr Trump, in a GB News interview with Nigel Farage in March last year, also said Harry should not receive preferential treatment. Read more from Sky News:KT Tunstall's musical reinventionHeadteachers 'slapped' and 'threatened' by pupils' parentsAt least 34 killed in US tornadoes and dust storms He said: \"No. We'll have to see if they know something about the drugs, and if he lied they'll have to take appropriate action.\" The royal moved to the US in 2020, following a brief spell in Canada, with his wife Meghan, after the couple's split from the rest of the Royal Family. They have lived in California ever since."
    },
    {
        "title": "Carney wastes no time tearing into Trump, but can he save Canada from becoming America's 51st state?",
        "description": "President Donald J Trump wants to redraw the political map of the world to benefit \"America First\".",
        "url": "https://news.sky.com/story/carney-wastes-no-time-tearing-into-trump-but-can-he-save-canada-from-becoming-americas-51st-state-13329087",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump_6857115.jpg?20250315132202",
        "type": "US",
        "Author": "Adam Boulton",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "Donald Trump's second term has begun with him tearing up the established rules-based order in the West in pursuit of his own foreign policy. This includes wanting to take control of Greenland and the Panama Canal, and starting trade wars with once close allies.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n President Donald J Trump wants to redraw the political map of the world to benefit \"America First\". Some may laugh at his ignorance of history and his boastful schoolboyish territorial ambitions. Yet, in pursuit of his dream of fortress North America, he has already shown himself willing to tear up the rules-based order, which was agreed after the Second World War to stop countries from invading each other - at least in the democratic world. He has already broken international treaties entered into by US presidents - including by himself in the case of trade with Mexico and Canada. Since being inaugurated as US president for the second time in January, Trump has relentlessly spelled out what new conquests he is after. He predicts the US will \"get\" Greenland \"one way or the other\". \"We need Greenland for national security and even international security,\" he explained unconvincingly. \n                  Prime Minister Mark Carney says Canada will 'never ever be part of US' and talk of nation becoming 51st state is 'crazy'\n                 \n                  King Charles reaffirms commitment to Canada against backdrop of US trade war\n                 \n                  Small acts of defiance in Canada raise question of what country can do against Trump's tariff trade war\n                 Trump is equally explicit about the Panama Canal: \"We gave it to Panama. We didn't give it to China. And we are taking it back.\" The company running the ports at the Atlantic and Pacific ends of the canal caved in quickly. This month, Hong-Kong based CK Hutchinson sold out to a consortium led by the US fund managers BlackRock. Then there's Canada, the rich, independent G7 member nation, which Trump has repeatedly threatened to annex. He has taken to referring to it prematurely as the \"51st state\", while belittling its former prime minister as \"Governor Trudeau\". Who could be Canada's next PM?  In talks with Trudeau, he deliberately called into question the borders set in the 1908 Treaty signed by US president Teddy Roosevelt and Edward VII, king of Canada and the UK. \"The artificial line of separation drawn many years ago will finally disappear, and we will have the safest and most beautiful Nation anywhere in the World,\" he tweeted on his Truth Social network last week, while promising Canadians would pay \"much less tax\". Trump's aggressive language has upturned Canadian politics just ahead of a general election. Canada is the US's closest military partner and a fellow ally in NATO. It is the US's largest trading partners, supplying 80% of its aluminium and the largest source of steel. This only infuriates Trump who has slapped 25% tariffs on its metal exports and threatens more. Canada and Britain fought a war against the US in 1812 to protect its independence. Most Canadians have been horrified by Trump's unwanted attention.  The US national anthem is being booed at sporting events. American goods are being boycotted, right down to renaming Americano coffee \"Canadiano\". Meanwhile, Trump is instituting checks for those crossing the border. Canadians were expecting a change of government and a swing to the right in the general election - due by October. The outgoing Liberal government, led by Justin Trudeau, was tired after nine years in power. Difficulties with housing and the cost of living were the voters' main concerns. The Conservative Party of Pierre Poilievre, with his populist \"Canada First\" slogan, was 25% ahead. Then, Trump took office, and Trudeau stood down as Liberal Party leader. This week a political outsider was chosen with an overwhelming 85.9% of the vote as the new Liberal Party leader, automatically taking over as temporary prime minister.  Mark Carney, an economist who served previously as governor of the Bank of Canada and as the first foreigner governor of the Bank of England, is now in charge. The Liberals have shot up to neck and neck with the Conservatives, on 35% and 36% respectively, in the latest Nanos Research tracking poll. Carney is wasting no time tearing into Trump's plan in what he calls these \"dark times\". \"We didn't ask for this fight,\" he admitted with typical Canadian understatement, but \"the Americans want our resources, our water, our land and our country\". He promised: \"America is not Canada. And Canada never ever will be part of America in any way, shape or form.\" Carney is backing reciprocal tariffs against the US, even though he deplores them in principle, and predicts \"Canada will win\".  Carney has never been an elected politician. He is not even currently a member of the Canadian parliament. But, as a senior insider he piloted Canada through the 2007-2008 recession and guided the UK through Brexit, in spite of being fiercely opposed to it. He is well qualified to lead Canada in its unwanted economic war with the US. He is probably helped by coming late to the unpopular Liberal Party and keeping his distance from Trudeau. Carney and his English wife Diana are keen environmentalists but, mindful of Canada's vast oil and gas reserves, he no longer supports a carbon tax. Inevitably, his main opponent, the working-class hard man Poilievre, is attacking Carney as a member of the global elite. Like Trump during his campaign, the Conservative leader is courting the podcast \"manosphere\". Carney argues that Poilievre's previous admiration for Trump and his online bros should be a liability: \"A person who worships at the altar of Donald Trump will kneel before him, not stand up to him.\" 👉 Follow Trump 100 on your podcast app 👈 Some voices on the Conservative right are arguing that Canada should accept its mutual dependence with its southern neighbour and move closer to Trump in a North American alliance. Somewhat in contradiction, they also insist that Canada could preserve its technical independence if it goes in with Trump. Carney was only sworn in as prime minister last Friday and is expected to call an election imminently. For now, the momentum is with him. His victory would be a major rebuff to Trump - although the implications are terrifying.  Trump prefers to use economic bullying to get his way, but he has already shown with Ukraine that he is prepared to withdraw military and intelligence cooperation from allies to increase pressure. Canada and the US currently have integrated security cooperation to protect their continent. To Trump, they are freeloaders since Canada is one of NATO's under-spenders on defence. Canada has a population of 40 million, with 63,500 in the military. The US population is 340 million with 1.4 million in its armed forces. At the very least, Trump could emulate Putin if his territorial ambitions are frustrated and start a military build-up along the border. Incursions and fighting could not be ruled out after that. The UK shares a head of state and is ultimately a closer ally of Canada than the US. The annexation of Canada by the US would vindicate Trump's vision of the world as a place to be carved up by major powers led by autocratic leaders. The Trump administration is currently enabling Russia to \"get\" a significant portion of Ukraine. It follows that the US is trying to grab land from its neighbours. And if Putin and Trump can do it, it seems unlikely that Trump would risk war if Xi moves against Taiwan. The worst may not happen. But it could. The world is long past the point where Donald Trump must be taken both literally and seriously."
    },
    {
        "title": "Trump 100 Day 56: Q&A: Putin's 'hold' on Trump, the peace prize, and press access ",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-56-qa-putins-hold-on-trump-the-peace-prize-and-press-access-13328784",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On this episode, our US correspondents James Matthews and Mark Stone read through questions from listeners.  They are asked if Vladimir Putin has some kind of hold on Donald Trump, whether the US president can actually win a Nobel peace prize, and if Mark and James fear asking difficult questions to Trump's team in case they have their press access restricted, like other news organisations.You can email James, Martha, and Mark at trump100@sky.uk."
    },
    {
        "title": "Digital lender OakNorth to be parent of US bank CUB",
        "description": "OakNorth, the British-based digital bank, will this week unveil a milestone US deal that will pave the way for it to launch a significant expansion on the other side of the Atlantic.",
        "url": "https://news.sky.com/story/digital-lender-oaknorth-to-be-parent-of-us-bank-cub-13330334",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-oaknorth-bank-finance_6858477.jpg?20250316130434",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-16 15:59:00",
        "Headline": "The British commercial bank founded by Rishi Khosla will announce on Monday the all-share acquisition of Michigan-based Community Unity Bank, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n OakNorth, the British-based digital bank, will this week unveil a milestone US deal that will pave the way for it to launch a significant expansion on the other side of the Atlantic. Sky News has learnt that OakNorth, which is chaired by the former City watchdog chair Lord Turner, will on Monday announce that it has agreed to acquire Community Unity Bank (CUB), which is based in Birmingham, Michigan, in an all-share deal. The purchase price was unclear on Sunday, although one insider said it was likely to be valued in the tens of millions of dollars. OakNorth declined to comment. Launched in 2015, the bank is among a group of lenders - along with Monzo and Starling Bank - founded after the 2008 financial crisis. Its backers include the giant Japanese investor SoftBank and GIC, the Singaporean state fund. Since its launch, it has lent close to £12.5bn and boasts an industry-leading loan default ratio. \n                  Premiership Rugby rivals and CVC to fund Newcastle Falcons loan\n                 \n                  Economy finds reverse gear in January with surprise contraction\n                 \n                  Weekend Money: Give up your career or work for £30 a day - the impossible choice facing women across UK\n                 Last year, it paid out just over £30m to shareholders in its maiden dividend payment. OakNorth has been growing rapidly, and this month said it had recorded pre-tax profits of £214.8m in 2024, up from £187.3m the previous year. It made more than £2.1bn of new loans last year. The acquisition of CUB, which launched just three years ago, is subject to regulatory approval, but follows authorisation of OakNorth by the Federal Reserve and the New York State Department of Financial Services for a Representative Office in New York last year. OakNorth began lending in the US in 2023 and has since made $700m of loans, including to F1 Arcade and Ultimate Performance."
    },
    {
        "title": "A Labour Party in Tory clothing? Why Starmer's backbenchers are deeply uncomfortable",
        "description": "Since taking office nine months ago Sir Keir Starmer has weathered party rows about winter fuel payments, the two child benefit cap, WASPI women, airport expansion and cuts to international aid.",
        "url": "https://news.sky.com/story/a-labour-party-in-tory-clothing-why-starmers-backbenchers-are-deeply-uncomfortable-13330162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-benefits-work-pensions_6858574.png?20250316142430",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-03-16 13:37:00",
        "Headline": "Government outriders have spent weeks making the point that the cost of health benefits for working-age people has ballooned by billions since the pandemic. ",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Since taking office nine months ago Sir Keir Starmer has weathered party rows about winter fuel payments, the two child benefit cap, WASPI women, airport expansion and cuts to international aid. All of these decisions have been justified in the name of balancing the books - filling that notorious £22bn black hole, sticking to the fiscal rules, and in the pursuit of growth as the government's number one priority. But welfare reform feels like a far more existential row. Health Secretary Wes Streeting argued on Sunday Morning With Trevor Phillips that the current system is \"unsustainable\". Ministers have been making the point for weeks that the health benefits bill for working-age people has ballooned by £20bn since the pandemic and is set to grow by another £18bn over the next five years, to £70bn. But the detail of where those cuts could fall is proving highly divisive. One proposal reportedly under consideration has been to freeze personal independence payments (PIPs) next year, rather than uprating them in line with inflation. Charities have warned this would be a catastrophic real-terms cut to 3.6 million people. Concerned left-wing backbenchers are calling on the government to tax the rich, not take from the most vulnerable. The Sunday Times and Observer have now reported that Work and Pensions Secretary Liz Kendall has dropped the idea in response to the backlash.  Read more:Streeting denies Labour 'changing into Tories'Planned PIP freeze set to be scrapped - reportsWhat cuts could be announced? Wes Streeting denied reports of a cabinet row over the plan, insisting the final package of measures hasn't yet been published and he and his cabinet colleagues haven't seen it. Not the final version perhaps - but given all backbench Labour MPs who were summoned to meetings with the Number 10 policy teams for briefings this week, that response is perhaps more than a little disingenuous. In his interview with Sir Trevor Phillips, he went on to make the broader case for PIP reform - highlighting the thousand people who sign up to the benefit every day and arguing that the system needs to be \"sustainable\", to \"deliver for those that need it most\" and \"provide the right kind of support for the different types of need that exist\". To me this signals the government are preparing to unveil a tighter set of PIP eligibility criteria, with a refocus on supporting those with the greatest needs.  Changes to incapacity benefit to better incentivise working - for those who can - are also clearly on the cards. The health secretary has been hitting out at the \"overdiagnosis\" of mental health conditions, arguing that \"going out to work is better for your mental and physical health, than being spent and being stuck at home\", and promising benefit reforms that will help support people back to work rather than \"trapped in the benefits system\". Turning Tory? Starmer said this week the current welfare system couldn't be defended on economic or moral grounds. The Conservatives don't disagree.  Before the election, they proposed £12bn in cuts to the welfare bill, with a focus on getting people on long-term sickness back to work. This morning, shadow education secretary Laura Trott claimed Labour denied that welfare cuts were needed during the election campaign and had wasted time in failing to include benefits reform in the King's Speech. \"They're coming to this chaotically, too late and without a plan,\" she said. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Notwithstanding the obvious critique that the Tories had 14 years to get a grip on the situation - what's most striking here is that, yet again, the Labour government seems to be borrowing Conservative clothes. When challenged by Sir Trevor this morning, Streeting denied they were turning Tory - claiming the case for welfare reform and supporting people into work is a Labour argument. But, from increasing defence spending and cutting the aid budget to scrapping NHS England, there's a definite pattern emerging. If you didn't know a Labour administration was in charge, you might have assumed these were the policies of a Conservative government. It's a strategy which makes many of his own backbenchers deeply uncomfortable. But it's doing a good job of neutering the Tory opposition."
    },
    {
        "title": "NHS 'addicted to overspending' and government 'genuinely sorry' for quango job losses, says Streeting",
        "description": "Wes Streeting said the NHS is \"addicted to overspending\", as he confirmed he is seeking cuts within Integrated Care Boards (ICBs).",
        "url": "https://news.sky.com/story/nhs-addicted-to-overspending-and-government-genuinely-sorry-for-quango-job-losses-says-streeting-13330123",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nhs-hospital-ward-file-pic_6858639.jpg?20250316150711",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-16 12:44:00",
        "Headline": "The government wants to slash NHS bureaucracy to divert money to the frontline of the NHS - criticising a culture of \"waste and inefficiency\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Wes Streeting said the NHS is \"addicted to overspending\", as he confirmed he is seeking cuts within Integrated Care Boards (ICBs). The health secretary told Sky's Sunday Morning with Trevor Phillips that ICBs - which are responsible for planning local health services - have been tasked with finding 50% savings to boost efficiency. Politics latest: Streeting denies Labour 'changing into Tories' It's part of the government's plans to slash bureaucracy in the health service - which Mr Streeting acknowledged on Sunday would cause anxiety among administrators facing job losses. He said he was \"genuinely sorry\" for people worried about the future, but efficiency savings would divert money to the frontline of the NHS. Confirming that Jim Mackey, head of the soon-to-be abolished NHS England, had written to ICBs asking them to halve their running costs, Mr Streeting said: \"Financial plans to us would have involved an overspend between £5bn and £6bn before the new financial year is even begun. \"And I'm afraid this speaks to the culture that I identified before the general election, where the NHS is addicted to overspending, is addicted to running operating deficits with the assumption that someone will come along to bail them out, which local councils would never be able to do.\" \n                  Is Keir Starmer bringing back austerity?\n                 \n                  If Sir Keir Starmer doesn't deliver on his reforms, then only Reform UK and the Tories will benefit\n                 \n                  Wes Streeting admits he did not anticipate scrapping NHS England - and 9,000 will lose jobs\n                 Reports of the cuts have sparked concerns among health leaders. Matthew Taylor, head of the NHS Confederation, said it will require \"major changes\" and make the task of delivering \"long term transformation of the NHS much harder\". Mr Streeting denied the cut was effectively a form of austerity, saying the government is going after a culture of \"waste and inefficiency\" which \"isn't just frustrating patients and taxpayers\" but staff working for the NHS too. \"They can see layer upon layer upon layer of bureaucracy and accountability,\" he said. \"That's not the fault of the people working in the system. They are also victims of it. \"And that's why we're going hard at achieving those savings in order to redeploy money into frontline services, which benefit patients.\" The government also announced this week it would be scrapping NHS England, the world's biggest quango, saying there is too much duplication with the work that the Department of Health and Social Care (DHSC) does. Scrapping NHS England 'beginning not the end' Mr Streeting has since indicated he will look to scrap other health-related bodies, writing in The Sunday Telegraph that axing NHS England is \"the beginning, not the end\". Asked what other organisations could be for the chopping board, Mr Streeting said he did not want to \"get ahead\" of a review by Dr Penny Dash into the operational effectiveness of NHS regulators. \"What I will do is look at how we can reduce the number of regulators, reduce the number of regulations wherever possible... and try to reduce the amount of money we are spending,\" he said. Read More:What does end of NHS England mean for you?Health secretary faces questions over disability cuts  The cabinet minister defended the language being used to describe the plans, after he described the NHS as being \"bloated\" by bureaucracy and Prime Minister Sir Keir Starmer called it \"flabby\". Streeting 'genuinely sorry' about job losses Mr Streeting stressed he was \"talking about the system, not the people who work in it\" - adding that he was \"genuinely sorry\" about the job losses that will come down the line.  The government has not yet said how many jobs it expects to axe under the reforms. Mr Streeting acknowledged lots of people will be anxious about their futures, adding: \"I'm genuinely sorry about that, because I don't want them to be in that position. But I've got to make the changes.\" The government's plans have generally received support from opposition parties, though there have been calls for more details. Shadow education secretary Laura Trott said reorganisation reforms introduced by the Tories in 2013 were \"well-intentioned but didn't work\" and she agrees \"in principle\" with what Labour has put forward. However she said the changes aren't a \"silver bullet\" and could result in further costs and disruption so \"we'll need to see a very clear plan from the government for how that won't affect waiting lists further\". Meanwhile, the Liberal Democrats said the government must \"take the same sense of urgency shown here to social care, and complete their review by the end of the year rather than continuing to kick the can down the road\"."
    },
    {
        "title": "Streeting denies Labour 'changing into Tories' amid questions over disability benefit cuts ",
        "description": "Wes Streeting has denied that Labour is \"changing into the Tories\" with its welfare reforms, amid speculation disability benefits could be cut. ",
        "url": "https://news.sky.com/story/streeting-denies-labour-changing-into-tories-amid-questions-over-disability-benefit-cuts-13330035",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-currency-uk-money-benefits_6858406.jpg?20250316102228",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-16 09:14:00",
        "Headline": "Wes Streeting was unable to say whether the government would freeze personal independence payment (PIP) amid reports that Downing Street could dilute its planned welfare reforms to stop a rebellion.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Wes Streeting has denied that Labour is \"changing into the Tories\" with its welfare reforms, amid speculation disability benefits could be cut.  The health secretary told Sky News' Sunday Morning with Trevor Phillips that it is \"not a Labour argument to say that we want people consigned to a life of benefit\". However he refused to be drawn on how the government is planning to get more people into work, saying contrary to media reports of internal divisions the proposals have \"not been discussed\" in cabinet yet. Politics Live: NHS 'addicted to overspending' Work and Pensions Secretary Liz Kendall is expected to unveil a series of measures to cut welfare spending next week, ahead of Chancellor Rachel Reeves's spring statement.  The plan was thought to include cancelling an inflation-linked rise to the personal independence payment (PIP) - but this has reportedly been scrapped due to backlash from Labour MPs. Mr Streeting would not be drawn on the supposed division - saying we will \"have to wait and see the proposals\" and the issue \"hasn't been discussed in cabinet\". \n                  NHS 'addicted to overspending' and government 'genuinely sorry' for quango job losses, says Streeting\n                 \n                  Wes Streeting admits he did not anticipate scrapping NHS England - and 9,000 will lose jobs\n                 \n                  NHS 'not up for grabs' in US-UK trade deal, says Wes Streeting\n                 However he said that what the government is trying to achieve with welfare reform is to make sure the system \"does the two things it needs to do\". \"One is to support people who cannot work to make sure they've got dignity, independence, and quality of life. \"And secondly, for those who can, to make sure that the welfare system isn't just a safety net, that it's a springboard back to work.\" Personal Independence Payment (PIP) is money for people who have extra care needs or mobility needs as a result of a disability. Mr Streeting said one thousand people every day are signing on to PIP and that's \"the size of the city of Manchester\" over the course of a year.  Asked if people get benefits too easily, the cabinet minister said there is a \"presumption in favour of the benefits system\" and people \"need to have the right support to stay and work wherever possible\". He rejected the claim that Labour is \"turning into the Tories\", saying: \"I don't think that it is a Labour argument to say that we would want people consigned to a life of benefits and not able to go to work when we know that they can.\" Labour MPs fear disability benefit cuts Former Tory chancellor George Osborne - the architect of welfare cuts during the coalition years - said on his Political Currency podcast this week that he resisted freezing PIP because he felt it was going too far. Former Labour shadow chancellor Ed Balls, who co-hosts the podcast with him and is married to Home Secretary Yvette Cooper, also said cutting disability benefits is \"not a Labour thing to do...it's not what they are for\". Read More:What welfare cuts could the government announce?We need to get a grip' on welfare, chancellor says The government's motivation is the cost of long-term sickness and disability benefits for working-age people, which has risen by £20bn since the pandemic and is forecast to hit £70bn over the next five years. Ministers have stressed there are currently 2.8 million people not in work due to ill-health, while one in eight young people are not in education, training or employment - prompting fears of a \"wasted generation\". Some of the changes being mooted include making it harder to qualify for PIP and increasing the rate of Universal Credit for those who are in or searching for work to incentivise employment, while cutting the rate for those judged unfit to work. Many Labour MPs fear drastic cuts to the most vulnerable. In a post on X, Barry Gardiner, the Labour MP for Brent West, criticised the bankers bonus cap coming to an end and said he doesn't understand \"why it is too difficult to tax a little more those having to manage on £19m a year\" instead of cutting the benefits bill. 'Overdiagnoses of mental health conditions' Mr Streeting later told the BBC's Sunday With Laura Kuenssberg that \"the moral of the story is to wait for the plans\" when repeatedly questioned on the future of PIP and other welfare benefits. He also said he thought there was an \"overdiagnosis\" of mental health conditions with \"too many people being written off\" and not getting the support they need. Laura Trott, the Tories' shadow education secretary, refused to say whether she supported disability benefit cuts or not. But she said the changes were not in Labour's manifesto, whereas her party did have a plan to do this. She told Trevor Phillips: \"At the election, Labour said we could save no money on welfare. \"They've lost so much time when it was obvious to everyone this was a benefit system that needed to be brought under control after the pandemic. \"Labour is coming to this too late without a plan. They were clearly divided on it. And that is not what our welfare system needs.\""
    },
    {
        "title": "Planned freeze to PIP disability benefits set to be scrapped but eligibility criteria could be tightened, say reports",
        "description": "Proposals to freeze some dis&#173;ability benefits are reportedly being scrapped after concerns from Labour politicians about the scale of planned welfare cuts.",
        "url": "https://news.sky.com/story/planned-freeze-to-disability-benefits-set-to-be-scrapped-but-eligibility-criteria-could-be-tightened-say-reports-13329880",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-work-and-pensions-liz-kendall_6808860.jpg?20250123234416",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-16 01:35:00",
        "Headline": "Reforms to the welfare system are expected to be announced within days, including changes to the personal independence payment (PIP). But it appears - under immense pressure from Labour MPs - some concessions have been made.",
        "Content": " Proposals to freeze some dis­ability benefits are reportedly being scrapped after concerns from Labour politicians about the scale of planned welfare cuts. The work and pensions secretary had been under pressure to cut the benefits bill and was expected to cancel an inflation-linked rise to the personal independence payment (PIP). But it is reported those plans will be ditched by Liz Kendall, despite the Chancellor Rachel Reeves insisting \"we do need to get a grip\" on the welfare budget, saying the \"current system is not working for anyone\".  👉 Click here to follow Electoral Dysfunction 👈 Reforms to the welfare system are expected to be announced this week, ahead of the spring statement on 26 March. Explainer: Where could welfare cuts be made? Some MPs fear drastic cuts to support for the most vulnerable, but Ms Kendall may have attempted to partly address concerns from cabinet colleagues and Labour backbenchers about the scale of the reforms. \n                  Decision to cut winter fuel payment complied with Equality Act, court told\n                 \n                  UK government 'blinded' by money worries when it cut fuel payment, court told\n                 \n                  Labour MPs and officials briefing against work and pensions secretary should 'shut up', Baroness Harman says\n                 Almost four million working-age adults in England and Wales currently claim incapacity or disability benefits, up from 2.8 million before the pandemic. It is being widely reported that instead of scrapping a rise in PIP, savings could be achieved by changing the eligibility criteria along with cutting the top rate of incapacity benefit. Ms Kendall told The Sunday Times it was an \"absolute principle\" to protect welfare payments for people unable to work. \"For those who absolutely cannot work, this is not about that,\" she said. She said the number of people on PIP is set to more than double this decade, partly driven by younger people.  \"Increasingly, there is lots of clear evidence that work is good for mental health and physical health too... social security alone for many people will never be the key to a better life. It should be a springboard and not trapping people,\" she told the newspaper. Ms Kendall has revealed plans to give disabled people the right to try employment without the risk of losing their benefits. The so-called \"right to try guarantee\" aims to prevent those people who receive health-related benefits from having their entitlements automatically re-assessed if they enter employment. The Observer said the details are due to be announced as part of a green paper on Tuesday. Read more from Sky News:Welfare cuts could trigger backbench fightTough choices the chancellor has to makeHarriet Harman: Stop briefing against DWP Research published in February by the Department for Work and Pensions (DWP) showed the number of 16 to 34 year-olds who are long-term sick with a mental health condition has reached 270,000, increasing by 60,000 (26%) in the last year alone. Some on benefits 'taking the mickey' The figure for all working-age people is 790,000, an increase of 140,000 (22%) over the last year. Responding at the time to those figures, Ms Kendall said some people on benefits were \"taking the mickey\". \"I have no doubt, as there always have been, there are people who shouldn't be on those benefits who are taking the mickey and that is not good enough - we have to end that,\" she told ITV News. The same survey found 200,000 people receiving health-related or disability benefits were ready to work if the right job or support was available. Welfare cuts are supported by the Conservatives, albeit the party has accused Labour of \"dithering, delay and division\" on the issue. Meanwhile, the SNP argues any planned cuts to disability payments should be \"abandoned\", and disability charities have expressed a similar view. Sky News' Trevor Phillips will be looking at all the political headlines this week from 8.30am this morning. He will be joined by Health Secretary Wes Streeting, shadow education secretary Laura Trott and former national security adviser Lord Ricketts."
    },
    {
        "title": "Crew welcomed into International Space Station to replace astronauts stranded for nine months",
        "description": "A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months.",
        "url": "https://news.sky.com/story/crew-arrives-at-international-space-station-to-replace-astronauts-stranded-for-9-months-13329910",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nasa-space-iss-astronauts_6858189.jpg?20250316061149",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-16 04:37:00",
        "Headline": "Butch Wilmore and Suni Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft experienced problems.",
        "Content": " A crew has entered the International Space Station (ISS) to replace the astronauts who were stranded there for nine months. A SpaceX capsule delivered four astronauts on Sunday on a mission to allow Butch Wilmore and Suni Williams - who have been on the ISS since June 2024 - to return home. The Dragon craft, with the Crew-10 astronauts inside, docked with the orbiting laboratory at 4.04am UK time, around 29 hours after it had been launched on the top of the Falcon 9 rocket from NASA's Kennedy Space Center in Florida. NASA's Anne McClain and Nichole Ayers, both military pilots, along with Japan's Takuya Onishi and Russia's Kirill Peskov, both former airline pilots, will spend the next six months at the space station. Their mission will allow four members of Crew-9, which includes Mr Wilmore and Ms Williams, to return to Earth. It took several minutes for Dragon to safely dock at the ISS, in what is an automated process. But there was about 1 hour and 45 minutes of additional safety checks before the hatch could be opened. \n                  Rocket with replacement crew for NASA astronauts stranded for nine months finally launches\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \n                  NASA astronauts stuck on International Space Station say they 'don't feel like castaways'\n                 Mr Wilmore swung open the space station's hatch and rang the ship's bell as the arrivals floated in one by one and were greeted with hugs and handshakes. How they were stranded Mr Wilmore and Ms Williams originally planned to go to space for just eight days but got stuck on the station after their Boeing Starliner spacecraft started experiencing problems. Technical issues left them stranded, and various attempts to bring them home were unsuccessful. The craft encountered so many problems that NASA insisted it return to Earth empty, leaving the pilots behind until now. 'You can hardly even put it into words' \"It was a wonderful day. Great to see our friends arrive,\" Ms Williams told Mission Control after the new astronauts had been welcomed aboard. Speaking after the successful docking, Ms McClain added: \"Crew-10 has had a great journey up here and I cannot tell you the immense joy of our crew when we looked out the window and we saw the space station for the first time. \"That is such an amazing journey. You can hardly even put it into words.\" The journey back to Earth The four newcomers will spend the next few days learning the station's ins and outs from Mr Wilmore and Ms Williams. Then the two of them will strap into their own capsule later in the week, one that has been up there since last year, to close out the unexpected extended mission. The pair's ride back arrived in late September with a downsized crew of two and two empty seats reserved for the leg back. But more delays emerged when their replacements' brand new capsule needed extensive battery repairs. An older capsule took its place, pushing up their return by a couple of weeks to mid-March. Read more from Sky News:Four in five headteachers abused by parentsTrump kills at least 31 civilians in Red SeaKT Tunstall's musical reinvention Weather permitting, the SpaceX capsule carrying them and two other astronauts will undock no earlier than Wednesday and splash down off Florida's coast."
    },
    {
        "title": "KT Tunstall: 'I was a totally crap pop star... It's important to kill your idea of what you should be'",
        "description": "Twenty years on from her breakout hit Suddenly I See, KT Tunstall is refreshingly candid about her early career: \"I was a totally crap pop star,\" she tells Sky News.",
        "url": "https://news.sky.com/story/kt-tunstall-i-was-a-totally-crap-pop-star-its-important-to-kill-your-idea-of-what-you-should-be-13325773",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-clueless-alicia-silverstone_6856350.jpg?20250314155201",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-16 00:01:00",
        "Headline": "Clueless, Mean Girls and The Devil Wears Prada have all undergone a musical make-over, injecting the West End with a colourful nostalgia hit that shifts tickets too. KT Tunstall is part of the stage revolution.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Twenty years on from her breakout hit Suddenly I See, KT Tunstall is refreshingly candid about her early career: \"I was a totally crap pop star,\" she tells Sky News. The Scottish singer-songwriter may have a Brit and Ivor Novello to her name - won the year after she outsold every other female artist in the UK - but she's not taking any prisoners. \"You have an idea of what you should be as an artist, I think it's really, really important to kill that.\" She goes on: \"The whole point of being an artist is that you never know what you're going to be, and you should never assume that you know. \"I think there's something much more divine in the kind of growth of yourself as an artist that it's not your place to know what's going to be.\" Sharing a private thought, she admits: \"I don't think I've ever said it out loud, but I have always thought to myself, 'What if the things that you have done are not the thing that you're most known for? That there's something coming'?\" Turning 50 next year, Tunstall's embraced change head on, helping transform 1995 film Clueless for the stage, alongside its creator Amy Heckerling. Working in Hollywood for four decades and counting, Heckerling, who also directed Fast Times At Ridgemont High and Look Who's Talking, says \"I always felt like the movie, while we were making it, kind of wanted to sing.\" 'It was really time to do something new' It was a \"wild ride\" that Tunstall, who says she was \"desperate to learn something new,\" was keen to be part of. Busking as a student before joining bands in her early 20s, Tunstall says: \"I've been I've been doing gigs and touring for a long time, and it was really time to do something new and, and this is just a dream project to do it with.\" With the film's original soundtrack featuring hits from Radiohead, Coolio, the Lightning Seeds, Supergrass and the Beastie Boys, Tunstall says it was exciting to create songs for the \"explosion of genre\" that was the 1990s - a time when Nirvana and NSYNC jostled alongside each other in the charts, and the Spice Girls burst onto the worldwide scene. Tunstall's approach? \"Come up with a mega-mix feel, that it's the cassette tape playing in Cher's Jeep\" and then merge it with the MTV music video visuals catching fire at the time.  'Enjoy the nostalgia and relax in the theatre' Emma Flynn, who plays Cher Horowitz in the show, says it's the role of a lifetime having been a fan of the movie \"since I was in the foetal position\" and \"pretty much off book\" from day one. Flynn says the show offers audiences an escape from some of the stresses of modern-day life. \"Watching people before social media and cell phones, just going to the Valley party and actually having to communicate. I think people enjoy that nostalgia. And I think it allows people to relax in the theatre too.\" And Clueless isn't the only classic movie getting a musical makeover. The Devil Wears Prada The Musical brings fashion to the West End, with music by Sir Elton John. While the Mean Girls Broadway run was such a success, it got turned back into its own movie last year, taking over $100m at the global box office. The musical's now in the West End, becoming the fastest-selling show in the Dominion Theatre's history. So, what's the appeal? The shows already have a ready-made audience of fans, created by the original film. They're familiar but different - building on the original narrative, taking well-loved characters and oft-repeated catchphrases - and using song and dance to expand on the movies' best-known scenes - to the delight of the audience. Meanwhile, the success of streaming over the last two decades means older films are easy to find and re-watch for a new generation of fans. There's the nostalgia factor too - looking back to a movie you loved as a child or teen means it's already won a special place in your heart, and you're much more likely to welcome it in for a second time. 'The 90s are on fire in popular culture' And the shows are not just attracting familiar audiences, but fresh ones as well says actress Charlie Burn, who plays Cady Heron in Mean Girls The Musical. While she says there are certain \"anticipatory parts of the show where people know there are iconic lines coming up,\" she says there are also \"parents with their kids at the stage door, that say, 'I never knew the musical, I never knew the movie, and I loved it'.\" As for Clueless, Tunstall says it's a piece of luck that after years of work the musical has come to fruition \"when the '90s are on fire again in popular culture\", adding \"a whole new generation of kids are really appreciating the culture of the '90s, and it just feels really perfect.\" Cher's futuristic outfit generator may never have become a daily-dressing reality, and a Burn Book in the back of the closet would now be shared via an array of social media putdowns. But the hefty dollop of nostalgia delivered by such shows is a song and dance welcomed by many across universally challenging times."
    }
]