[
    {
        "title": "The links between Jeffrey Epstein and the UK revealed in new files",
        "description": "Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US.",
        "url": "https://news.sky.com/story/the-links-between-jeffrey-epstein-and-the-uk-revealed-in-new-files-13485977",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251220174213",
        "type": "Home",
        "Author": "Tom Cheshire",
        "Date Published": "2025-12-20 15:14:00",
        "Headline": "The files reveal the disgraced financier inveigled his way into British high society.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US. The newly released Epstein documents reveal, in particular, how the paedophile financier ascended into the highest levels of British society. This photo of Andrew Mountbatten-Windsor sprawled across the lap of several women, whose identities have been protected, speaks to his close relationship with Epstein's former girlfriend Ghislaine Maxwell, who was jailed for child sex trafficking and other offences in connection with Epstein. But the furnishings are even more revealing. Epstein files - latest updates  Sky News matched the fireplace in this photo with the one in Sandringham, the estate where the royals tend to spend Christmas - (Andrew is not invited this year). Andrew has vigorously denied any accusations against him. Also included in the latest release are Epstein's flight records. They provide some useful corroborating evidence. On 9 March 2001, his plane landed at \"EGGW\" - Luton Airport - with JE, GM and VR on board - Jeffrey Epstein, Ghislaine Maxwell and Virginia Roberts, better known by her married name of Virginia Giuffre and perhaps Epstein's most famous accuser. The next day is when this photo was alleged to have been taken, in London, of Giuffre and Andrew. Other photos show Maxwell on the steps of Downing Street - and power was as much a draw as celebrity. On 15 May 2002, the flight records show Epstein again arriving at Luton. The next day is when he met Tony Blair, prime minister at the time. This was before Epstein's first arrest and there is no suggestion of wrongdoing. Read more:New photos of Jeffrey Epstein's circle releasedGhislaine Maxwell sex trafficking case material to be released The meeting was arranged by Peter Mandelson, who lost his job as ambassador to the US because of his Epstein connections, and who features prominently in the files. The UK was a draw for Epstein's wider circle too - Maxwell here is pictured touring the Churchill War Rooms with Bill Clinton and Kevin Spacey. Neither are accused of wrongdoing or knowledge of Epstein's crimes. And the other grim life that Epstein led, of sex trafficking, also had British links. Another document released in the files, from 2019, shows witness testimony from Maxwell's trial. In it, a victim is mentioned who is \"17 years old\" and who grew up \"in England\". She would later be taken to Epstein's private Caribbean island."
    },
    {
        "title": "US seizes another tanker off Venezuela - as Brazil issues warning",
        "description": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker.",
        "url": "https://news.sky.com/story/us-seize-another-tanker-off-coast-of-venezuela-13486172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-tanker-oil-tanker_7116377.jpg?20251220212607",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-20 19:11:00",
        "Headline": "Brazil's President Lula says an \"armed intervention in Venezuela would be a ⁠humanitarian catastrophe\" after the US seized a second tanker.",
        "Content": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker. Secretary Kristi Noem of the Department of Homeland Security confirmed the operation on X, saying the oil tanker had last docked in Venezuela. She posted: \"The United States will continue to pursue the illicit movement of sanctioned oil that is used to fund narco terrorism in the region. We will find you, and we will stop you.\" In footage shared by Ms Noem of the raid, a helicopter can be seen landing on the deck of the ship ahead of the seizure.  The vessel is believed to be the Panama-flagged Centuries, according to the maritime risk management company Vanguard. The oil tanker, which was recently spotted near the Venezuelan coast, was seized east of Barbados in the Caribbean Sea. A US official, speaking on condition of anonymity, said the raid was a \"consented boarding,\" with the tanker stopping voluntarily to allowing American forces aboard. It's understood that the operation was led by the Coast Guard with the US military providing helicopter support. The US has already seized a sanctioned oil tanker, called Skipper, off the coast of Venezuela last week. But Centuries has not been sanctioned by the US, according to Jeremy Paner, a partner at Hughes Hubbard law firm in Washington DC, and former investigator at the Office of Foreign Assets Control. \"The seizure of ‌a vessel that is not sanctioned by the US marks a further increase in Trump's pressure on Venezuela,\" he said. \"It also runs counter to Trump's statement that the US would impose a blockade of all sanctioned oil tankers.\" The ship, which was bound for China with some 1.8 million barrels of oil, loaded in Venezuela under the false name Crag, Reuters news agency reported, citing internal documents from Venezuela's state-owned oil company, PDVSA. It departed the country on Wednesday and was briefly escorted by the Venezuelan navy, according to TankerTrackers.com. President Luiz Inacio Lula da Silva of neighbouring Brazil has since cautioned the US against an \"armed intervention\" in Venezuela. During a summit of the South American Mercosur bloc, he said: \"Armed intervention in Venezuela would be a ⁠humanitarian catastrophe.\" He also referred to the 1982 Falklands War between Britain and Argentina, and said \"the South ⁠American continent is once again haunted by ‌the military presence of an extra-regional power\". If the US did intervene, he said, it would set a \"dangerous precedent for the world\".  In recent weeks there has been a steady build up of US forces in the region, effectively placing Venezuela under embargo. \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,\" US President Donald Trump said on Tuesday. \"It will only get bigger, and the shock to them will be like nothing they have ever seen before.\" In his post on social media, the president also branded the regime of Venezuelan President Nicolás Maduro as \"illegitimate\" and a \"foreign terrorist organisation\". He continued: \"Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.\" 👉 Follow Trump100 on your podcast app 👈  Since the Skipper was seized, vessels carrying millions of barrels of oil have been staying put in Venezuelan waters, fearing that the US will intercept them. Some of these are considered to be part of a \"shadow fleet\" - vessels that use concealing tactics to transport goods for sanctioned countries like Russia, Iran, and Venezuela. More than 70 oil tankers in Venezuelan waters this week are part of the so-called shadow fleet, with some 38 sanctioned by the US Treasury, according to data from TankerTrackers.com. Read more:US says eight 'narco-terrorists' killed in three boat strikesMaduro's 'narco nephews' hit with sanctions President Trump has been ramping up pressure on the Maduro regime, accusing it of involvement in the drugs trade. As part of his efforts, he has also authorised deadly strikes against vessels he claims are trafficking drugs in the Caribbean and Eastern Pacific. President Maduro claims Mr Trump is trying to overthrow him with a view to seizing Venezuela's oil reserves."
    },
    {
        "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
        "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
        "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-20 18:36:00",
        "Headline": "The Delaware Supreme Court rules to reinstate his 2018 Tesla stock options worth $139bn, taking his net worth past an unprecedented $700bn.",
        "Content": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions. According to Forbes's billionaires index, the Tesla chief executive's net worth climbed to $749bn (£559bn) on Friday, making Musk the first person to surpass the $700bn milestone. He is already the world's richest man, and around $500bn (£373bn) richer than the second-richest, Google co-founder Larry Page, the index reports.   It follows the Delaware Supreme Court's ruling to reinstate his 2018 Tesla stock options worth $139bn (£103bn), which were rescinded last year. That year, Musk was awarded a pay package including stocks worth $56bn (£41bn) at the time, but it was struck down in a lower court in 2024 as the compensation was \"unfathomable\". Delaware judge Kathaleen McCormick concluded after a five-day trial that Tesla's directors were conflicted and key facts were hidden from shareholders when they voted to approve the plan. On Friday, the state supreme court ruled that rescinding the pay package left the Tesla head \"uncompensated for his time and efforts over a period of six years\", and that Ms McCormick's verdict had been improper and inequitable. Read more on Elon Musk:Musk is winning the space race - and looks unstoppableHow world's richest man is boosting the British right As is his style, Musk has not issued a formal statement responding to the restoration of his options, but did say in a reply on his social media platform X that he was \"vindicated\". If Musk exercises all the stock options from the 2018 package, his stake in Tesla would grow from about 12.4% to 18.1% of an expanded share base. It was Tesla's largest ever pay package, until the electric vehicle company awarded Musk a pay plan worth up to $1trn (£747bn) this November. It was approved by 75% of shareholders, but to pay out in full, Mr Musk must achieve five milestones in the next decade: • Deliver 20 million Tesla vehicles and one million robots; • Drive 10 million subscriptions to Tesla's self-driving feature; • Bring one million self-driving Robotaxis into operation; • Earn as much as $400bn in core profit; • Lift Tesla's market value to $8.5trn. Under the agreement, Musk will not receive a salary, but meeting all targets would see him receive more than 400 million extra shares in Tesla. If the company's value is raised to the target, those would be worth around $1trn. As of writing, Tesla is valued at $1.51trn (£1.12trn)."
    },
    {
        "title": "Brent shooting: Man, 55, shot dead in London",
        "description": "Police have launched a murder investigation after a 55-year-old man was shot dead in London.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-man-shot-dead-in-london-13485882",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brent-murder-london_7115782.png?20251220162134",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-20 11:29:00",
        "Headline": "Officers were called at 9.35pm on Friday to reports of a shooting in West End Close, Brent.",
        "Content": "Police have launched a murder investigation after a 55-year-old man was shot dead in London. Officers were called at 9.35pm on Friday to reports of a shooting in West End Close, Brent. Emergency first aid was given to a 55-year-old man, who died at the scene.   Detective Chief Inspector Neil John, from the Met's Specialist Crime Team, who is leading the investigation, said: \"Firstly, our thoughts are with the family and friends of the victim at this incredibly difficult time. \"Enquiries are well under way, and my team is working at pace to determine the circumstances that led to this man's tragic death. \n                  £20,000 reward announced over fatal shooting of father\n                 \n                  Bishop Richard Moth named as new Archbishop of Westminster\n                 \n                  Police release new images after fatal stabbing of 15-year-old in London\n                 \"There's no doubt this incident will cause concern in the local community and more widely, but we have increased patrols in the area. I'd like to reassure the public that our investigation remains a priority. \"I would urge anyone who may have witnessed the incident or has information, including dashcam footage, that will assist us with our enquiries to contact us at the earliest opportunity. \"We also believe there was a large group of people congregated nearby at the time the incident happened, and we are keen to hear from them.\" At the early stage of the investigation, no arrests have been made."
    },
    {
        "title": "Former Pakistani prime minister Imran Khan jailed for 17 years over state gift fraud",
        "description": "Former Pakistan prime minister and cricketer Imran Khan and his wife Bushra Bibi have been jailed for 17 years for buying state gifts at a knock-down price.\n",
        "url": "https://news.sky.com/story/former-pakistani-prime-minister-imran-khan-jailed-for-17-years-over-state-gift-fraud-13485873",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-khan-pakistan_7115698.jpg?20251220105630",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-20 10:19:00",
        "Headline": "Prosecutors argue Khan and his wife purchased the luxury gifts from the state at a heavily discounted price - violating rules.",
        "Content": "Former Pakistan prime minister and cricketer Imran Khan and his wife Bushra Bibi have been jailed for 17 years for buying state gifts at a knock-down price.\n Luxury watches and jewellery were gifted to Khan while he was prime minister by Saudi Arabia's Crown Prince Mohammed bin Salman during official visits. Under Pakistani law, if government officials and politicians wish to keep gifts received from foreign dignitaries, they must buy them from the state at the market value - and declare any proceeds earned from selling them. But prosecutors said Khan, 73, and ‌his wife paid a heavily ⁠discounted fee for the gifts - violating Pakistani rules. The couple pleaded not guilty when they were indicted last year. Prosecutors argued he and his wife declared the value of the gifts at little over $10,000 (£7,500), far below their actual market value of $285,500 (£213,000), allowing them to purchase the items at a reduced price. They were handed 10 years' rigorous imprisonment under Pakistan's penal code for criminal ‌breach of trust, and a further seven years under anti-corruption laws, Pakistan's Federal Investigation Agency announced. \n                  Bondi, Imran Khan's sons speak out, and is a deal close in Ukraine?\n                 \n                  Imran Khan being held in 'death cell', his sons say\n                 \n                  How did a viral deepfake stoke tensions between India and Pakistan? \n                 The latest conviction adds to a series of legal setbacks for Khan, who has been behind bars since August 2023, and is currently serving a 14-year sentence in a separate corruption case. He faces dozens of cases filed since he was ousted from office in 2022, ranging from corruption ‍to anti-terrorism and state secrets charges. Khan has denied wrongdoing in all the cases, which his party says are politically motivated. In a recent interview with Sky News' The World with Yalda Hakim, Khan's sons said they fear they might never see their father again. They also claimed he was being \"psychologically tortured\" in a \"death cell\". Khan is one of the country's most celebrated cricketers, who captained his country to World Cup victory in 1992. Khan's jail term from Saturday's ruling would begin after he has served the 14 years from the separate land graft case, information minister Attaullah Tarar said. Read more from Sky News:Indian high-speed train hits and kills seven elephantsAustralia plans gun buyback scheme after Bondi Beach attack Zulfi Bukhari, a spokesperson for Khan, said the verdict \"ignores basic principles of justice\" and turns the process into \"a tool for selective prosecution.\" Khan has reportedly told ‌his legal team to appeal the decision at the Islamabad High Court. Khan, a former cricket star turned politician, remains one of Pakistan's most polarising figures. His Pakistan ‍Tehreek-e-Insaf party - which was founded in 1996 - remains sidelined from power."
    },
    {
        "title": "Prince William and Prince George help prepare Christmas lunch for the homeless",
        "description": "Prince William has taken Prince George to a homelessness project for the first time, with father and son helping to prepare its annual Christmas lunch.",
        "url": "https://news.sky.com/story/prince-william-follows-in-princess-dianas-footsteps-as-he-takes-prince-george-to-homelessness-project-13485942",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mick-clarke-prince-william_7115975.jpg?20251220161712",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-20 14:24:00",
        "Headline": "William and George made a surprise visit to The Passage in Victoria, London, on Tuesday morning, an organisation that the Prince of Wales visited with his mother, Diana, when he was a child.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has taken Prince George to a homelessness project for the first time, with father and son helping to prepare its annual Christmas lunch. William and George made a surprise visit to The Passage in Victoria, London, on Tuesday morning, an organisation that the Prince of Wales visited with his mother, Princess Diana, when he was a child. In a video and photographs released by Kensington Palace, they can be seen dressed in aprons, joining in with lunch preparations with head chef Claudette. They also helped to pack care packages, made cupcakes and decorated a Christmas tree that had previously stood in Westminster Abbey for the Princess of Wales's Together at Christmas carol service.  The Passage's chief executive, Mick Clarke, who showed the royals around, said George was asking lots of questions \"very much like his dad\", adding: \"Prince William has often talked about, during his childhood, how his mother talked about - I think as he described - the importance of viewing life beyond palace walls. \"And I very much picked that up with George as well. And it seemed to me that this was, or is, a family that are just trying to ensure that their children are brought up with greater awareness of what is around them and the need to ensure that, particularly, the most vulnerable in society are supported and looked after. \"I think George was genuinely moved to experience the work that we do, even just a little snapshot of it.\" The Passage holds a deep personal significance for the Prince of Wales. His mother brought him to see the charity's work when he was 11 years old. He often talks about how it was an experience that helped inspire his commitment to tackling homelessness and the creation of Homewards, the programme he launched in 2023 that he hopes will show that it is possible to end homelessness. During the visit, George signed the visitors' book on the same page previously signed by his father and his late grandmother on 14 December 1993. Read more:William marks 20 years as patron of CentrepointPrince challenged over work despite privileged life A Kensington Palace spokesperson said: \"It was important to the Prince of Wales to share with Prince George the work of The Passage and to spend time volunteering alongside the team. \"They both greatly enjoyed meeting staff, volunteers and service users as well as learning more about the charity's work. \"The dedication shown not only by The Passage but by organisations across the homelessness sector, at Christmas and throughout the year, is invaluable.\" It also highlights his desire more generally to educate all his children about homelessness. William and George also spent time meeting some of The Passage's service users, whom the Prince of Wales had met before, hearing about their experiences and the support they receive. Talking about that meeting, Mr Clarke said: \"Sarah and Brian first used The Passage many, many years ago, and for many years now have been safely off the streets and in their own accommodation. \"But like most of us, we know it's not ending there - just having a roof over your head. It's about having support networks around you. \"So they come back and use our art group. They come back and use the Irish group. And it was really genuinely very moving - firstly for William to introduce George to Brian and Sarah, and then for Brian and Sarah to explain their story. \"As Sarah beautifully put it, 'Christmas time is a time for family. We don't have any family, so The Passage is our family'. And that was deeply moving to hear.\""
    },
    {
        "title": "The links between Jeffrey Epstein and the UK revealed in new files",
        "description": "Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US.",
        "url": "https://news.sky.com/story/the-links-between-jeffrey-epstein-and-the-uk-revealed-in-new-files-13485977",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251220174213",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-12-20 15:14:00",
        "Headline": "The files reveal the disgraced financier inveigled his way into British high society.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US. The newly released Epstein documents reveal, in particular, how the paedophile financier ascended into the highest levels of British society. This photo of Andrew Mountbatten-Windsor sprawled across the lap of several women, whose identities have been protected, speaks to his close relationship with Epstein's former girlfriend Ghislaine Maxwell, who was jailed for child sex trafficking and other offences in connection with Epstein. But the furnishings are even more revealing. Epstein files - latest updates  Sky News matched the fireplace in this photo with the one in Sandringham, the estate where the royals tend to spend Christmas - (Andrew is not invited this year). Andrew has vigorously denied any accusations against him. Also included in the latest release are Epstein's flight records. They provide some useful corroborating evidence. On 9 March 2001, his plane landed at \"EGGW\" - Luton Airport - with JE, GM and VR on board - Jeffrey Epstein, Ghislaine Maxwell and Virginia Roberts, better known by her married name of Virginia Giuffre and perhaps Epstein's most famous accuser. The next day is when this photo was alleged to have been taken, in London, of Giuffre and Andrew. Other photos show Maxwell on the steps of Downing Street - and power was as much a draw as celebrity. On 15 May 2002, the flight records show Epstein again arriving at Luton. The next day is when he met Tony Blair, prime minister at the time. This was before Epstein's first arrest and there is no suggestion of wrongdoing. Read more:New photos of Jeffrey Epstein's circle releasedGhislaine Maxwell sex trafficking case material to be released The meeting was arranged by Peter Mandelson, who lost his job as ambassador to the US because of his Epstein connections, and who features prominently in the files. The UK was a draw for Epstein's wider circle too - Maxwell here is pictured touring the Churchill War Rooms with Bill Clinton and Kevin Spacey. Neither are accused of wrongdoing or knowledge of Epstein's crimes. And the other grim life that Epstein led, of sex trafficking, also had British links. Another document released in the files, from 2019, shows witness testimony from Maxwell's trial. In it, a victim is mentioned who is \"17 years old\" and who grew up \"in England\". She would later be taken to Epstein's private Caribbean island."
    },
    {
        "title": "Brent shooting: Man, 55, shot dead in London",
        "description": "Police have launched a murder investigation after a 55-year-old man was shot dead in London.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-man-shot-dead-in-london-13485882",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brent-murder-london_7115782.png?20251220162134",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-20 11:29:00",
        "Headline": "Officers were called at 9.35pm on Friday to reports of a shooting in West End Close, Brent.",
        "Content": "Police have launched a murder investigation after a 55-year-old man was shot dead in London. Officers were called at 9.35pm on Friday to reports of a shooting in West End Close, Brent. Emergency first aid was given to a 55-year-old man, who died at the scene.   Detective Chief Inspector Neil John, from the Met's Specialist Crime Team, who is leading the investigation, said: \"Firstly, our thoughts are with the family and friends of the victim at this incredibly difficult time. \"Enquiries are well under way, and my team is working at pace to determine the circumstances that led to this man's tragic death. \n                  £20,000 reward announced over fatal shooting of father\n                 \n                  Bishop Richard Moth named as new Archbishop of Westminster\n                 \n                  Police release new images after fatal stabbing of 15-year-old in London\n                 \"There's no doubt this incident will cause concern in the local community and more widely, but we have increased patrols in the area. I'd like to reassure the public that our investigation remains a priority. \"I would urge anyone who may have witnessed the incident or has information, including dashcam footage, that will assist us with our enquiries to contact us at the earliest opportunity. \"We also believe there was a large group of people congregated nearby at the time the incident happened, and we are keen to hear from them.\" At the early stage of the investigation, no arrests have been made."
    },
    {
        "title": "Prince William and Prince George help prepare Christmas lunch for the homeless",
        "description": "Prince William has taken Prince George to a homelessness project for the first time, with father and son helping to prepare its annual Christmas lunch.",
        "url": "https://news.sky.com/story/prince-william-follows-in-princess-dianas-footsteps-as-he-takes-prince-george-to-homelessness-project-13485942",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mick-clarke-prince-william_7115975.jpg?20251220161712",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-20 14:24:00",
        "Headline": "William and George made a surprise visit to The Passage in Victoria, London, on Tuesday morning, an organisation that the Prince of Wales visited with his mother, Diana, when he was a child.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has taken Prince George to a homelessness project for the first time, with father and son helping to prepare its annual Christmas lunch. William and George made a surprise visit to The Passage in Victoria, London, on Tuesday morning, an organisation that the Prince of Wales visited with his mother, Princess Diana, when he was a child. In a video and photographs released by Kensington Palace, they can be seen dressed in aprons, joining in with lunch preparations with head chef Claudette. They also helped to pack care packages, made cupcakes and decorated a Christmas tree that had previously stood in Westminster Abbey for the Princess of Wales's Together at Christmas carol service.  The Passage's chief executive, Mick Clarke, who showed the royals around, said George was asking lots of questions \"very much like his dad\", adding: \"Prince William has often talked about, during his childhood, how his mother talked about - I think as he described - the importance of viewing life beyond palace walls. \"And I very much picked that up with George as well. And it seemed to me that this was, or is, a family that are just trying to ensure that their children are brought up with greater awareness of what is around them and the need to ensure that, particularly, the most vulnerable in society are supported and looked after. \"I think George was genuinely moved to experience the work that we do, even just a little snapshot of it.\" The Passage holds a deep personal significance for the Prince of Wales. His mother brought him to see the charity's work when he was 11 years old. He often talks about how it was an experience that helped inspire his commitment to tackling homelessness and the creation of Homewards, the programme he launched in 2023 that he hopes will show that it is possible to end homelessness. During the visit, George signed the visitors' book on the same page previously signed by his father and his late grandmother on 14 December 1993. Read more:William marks 20 years as patron of CentrepointPrince challenged over work despite privileged life A Kensington Palace spokesperson said: \"It was important to the Prince of Wales to share with Prince George the work of The Passage and to spend time volunteering alongside the team. \"They both greatly enjoyed meeting staff, volunteers and service users as well as learning more about the charity's work. \"The dedication shown not only by The Passage but by organisations across the homelessness sector, at Christmas and throughout the year, is invaluable.\" It also highlights his desire more generally to educate all his children about homelessness. William and George also spent time meeting some of The Passage's service users, whom the Prince of Wales had met before, hearing about their experiences and the support they receive. Talking about that meeting, Mr Clarke said: \"Sarah and Brian first used The Passage many, many years ago, and for many years now have been safely off the streets and in their own accommodation. \"But like most of us, we know it's not ending there - just having a roof over your head. It's about having support networks around you. \"So they come back and use our art group. They come back and use the Irish group. And it was really genuinely very moving - firstly for William to introduce George to Brian and Sarah, and then for Brian and Sarah to explain their story. \"As Sarah beautifully put it, 'Christmas time is a time for family. We don't have any family, so The Passage is our family'. And that was deeply moving to hear.\""
    },
    {
        "title": "£20,000 reward announced over fatal shooting of father",
        "description": "Police have announced a &#163;20,000 reward in the hunt for the killers of a man in north London in March.",
        "url": "https://news.sky.com/story/16320000-reward-announced-over-fatal-shooting-of-father-in-london-13485846",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-met-police-mahad-mohamed_6946180.jpg?20250619184341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-20 07:53:00",
        "Headline": "The victim's younger sister has appealed for information, saying: \"My brother deserves better. He deserves justice\".",
        "Content": "Police have announced a £20,000 reward in the hunt for the killers of a man in north London in March. Mahad Abdi Mohamed, 27, died after being shot in the head in Waverley Road, Tottenham at 8.45pm on 20 March, the Metropolitan Police said. The Met, which announced the reward from the independent charity Crimestoppers, said officers believed the shooting was a case of mistaken identity. Police now want to speak to two people in connection with the incident. DCI Rebecca Woodsford, who is leading the investigation, said: \"There is someone out there who knows what happened that night, and we are urging those individuals to find it in their heart to come forward. It could be exactly what we need to locate those responsible.\" A targeted attack Police believe the suspects, who got out of a stolen Mitsubishi Outlander, which was later recovered burned out, were taking part in a targeted attack. On the night of the murder, Mahad had spent the early evening with his friend at their home. They were breaking their fast outside when the Mitsubishi Outlander approached and the suspects opened fire, striking Mahad and his friend multiple times. Mahad's 26-year-old friend received treatment for a gunshot wound to his leg. The force suspects another stolen vehicle, a blue Jaguar, was used to transport the suspects to and from the Mitsubishi. Read more from Sky News:Driver guilty of murder in Christmas Day rampageUkraine \"hits Russian tanker in Mediterranean Sea for first time\" Police arrested four adult men in March and April on suspicion of murder, who were subsequently bailed. The investigation so far has led officers to believe whoever killed Mahad set out to hurt someone else in a pre-planned, targeted attack. Appealing to the public for information, Mahad's youngest sister said: \"To stay silent is to be complicit. To stay silent is to let a grieving mother suffer in confusion. To stay silent is to let a little boy grow up not knowing what happened to his father.\" The reward, which is offered for information that leads to the identification, arrest and prosecution of those responsible, is available for three months and is due to expire on 20 March 2026."
    },
    {
        "title": "Dover ferry passengers hit by delays after IT issues",
        "description": "Ferry passengers getting home for Christmas from Dover face delays of up to one hour after French border controls were hit by IT issues.",
        "url": "https://news.sky.com/story/dover-ferry-passengers-hit-by-delays-after-it-issues-13485906",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-dover-france_7115759.jpg?20251220131130",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-20 13:01:00",
        "Headline": "Port of Dover Travel advised passengers not to arrive more than two hours before their ferry leaves.",
        "Content": "Ferry passengers getting home for Christmas from Dover face delays of up to one hour after French border controls were hit by IT issues. The border began experiencing technology issues before peak traffic arrival on Saturday morning. Port of Dover Travel said in a post on X, at 9.21am, that there were still ongoing issues which were resulting in delays. It later confirmed delays were still ongoing at 12.02pm. The organisation, which has not since issued an update, also urged passengers not to arrive more than two hours before their ferry leaves. The Port of Dover estimates nearly 30,000 cars will board for outward journeys during the festive period, with traffic peaking between 6am and 1pm from Friday to Sunday. It is also forecast to be the busiest year on record for the Christmas getaway in the UK. P&O Ferries, which operates some of the ships from the port, said there are large queues on the approach roads and in the buffer area. \n                  What Dover residents make of small boat crossings\n                 \n                  Police arrest man in Dover the day after female migrant's body found dead on Sangatte beach near Calais\n                 \n                  Govt under pressure after 'appalling and preventable' deaths in the Channel\n                 But once through passengers will face a smooth journey with no check-in delays, it added. Read more:Indian high-speed train hits and kills seven elephantsLondon's roads ranked most congested in Europe The Port of Dover added in the post: \"We also ask that all port-bound traffic remain on the main roads to the port, the A20 and A2, and keep the local roads clear for the community. \"If customers do miss their scheduled sailing due to the wait times, their ferry operator will place them on the next available crossing.\" Simon Jones, an AA expert patrol, said: \"It's beginning to look a lot like traffic. Our advice is simple: plan ahead, check your route and allow extra time. Patience will be your best present this year.\""
    },
    {
        "title": "Joshua delivers taste of reality to YouTuber Jake Paul",
        "description": "Former British heavyweight world champion Anthony Joshua delivered a dose of reality to YouTuber-turned-boxer Jake Paul as he won their much-anticipated showdown.",
        "url": "https://news.sky.com/story/anthony-joshua-wins-fight-against-jake-paul-13485804",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jake-paul-v-anthony-joshua_7115555.jpg?20251220045301",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-20 00:07:00",
        "Headline": "Two-time heavyweight world champion Joshua returned to the ring for the first time since his knockout defeat to Daniel Dubois in September 2024.",
        "Content": "Former British heavyweight world champion Anthony Joshua delivered a dose of reality to YouTuber-turned-boxer Jake Paul as he won their much-anticipated showdown. But Joshua was made to work far harder than he would have liked to extinguish the challenge of a brave but limited opponent. Joshua scored three knockdowns before landing a huge right hit on Paul halfway through the sixth round. The British fighter lifted Paul's hand in a show of respect after the fight broadcast on the streaming platform Netflix. \"Jake Paul has done really well tonight. I want to give him his props, he got up, time and time again,\" he said about his opponent. Joshua said it \"wasn't the best performance\", adding: \"It took a bit longer than expected. But the right hand finally found the destination.\" Meanwhile, Paul said: \"I'm feeling good, that was fun. I love this sport. I gave it my all, It's f****** crazy. I had a blast. \n                  Jake Paul vs Anthony Joshua: All you need to know\n                 \n                  Anthony Joshua could return to ring to fight ex-YouTuber Jake Paul\n                 \n                  Anthony Joshua blames training 'fatigue' for speeding\n                 \"I got my ass beat, but that's what this sport is about. I'mma (going to) come back and keep on winning.\" He added: \"I just got tired to be honest. He did amazing and hits really hard.\" The fight marked the end of a 14-month hiatus for Joshua, 36, while for 28-year-old Paul it was the biggest fight since his boxing career began in 2020. At the weigh-in on Friday, Joshua boasted an almost two-stone advantage over Paul, who has regularly fought at cruiserweight since he entered the world of boxing. Read more from Sky News:David Walliams dropped by publisherThe pictures that defined 2025 Britain's two-time world heavyweight champion tipped the scales at 243.4lbs (17st 5lbs) for his fight against Paul in Miami, while Paul weighed in at 216lbs (15st 6lbs) - a hefty 1.9st difference. Joshua, who could not weigh more than 245lbs, is the lightest he has been since his first fight against Oleksandr Usyk in September 2021 when he was 240lbs. For his last fight against Daniel Dubois he weighed 252.5Ibs. It is also only the second time that Paul weighed in over cruiserweight limit - the other time was when he fought 58-year-old Mike Tyson. Paul defeated Tyson by unanimous decision with 80-72, 79-73, and 79-73. "
    },
    {
        "title": "Deadline-day release of Epstein files has White House media management written all over it",
        "description": "Can it be a coincidence that US planes attacked Syria around the very time the Epstein files were released?",
        "url": "https://news.sky.com/story/deadline-day-release-of-epstein-files-has-white-house-media-management-written-all-over-it-13485849",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jeffrey-epstein-peter-mandelson_6929044.jpg?20250527185401",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2025-12-20 08:23:00",
        "Headline": "The deadline-day release of the Epstein files may appear carefully contrived for the benefit of Donald Trump, but will leave survivors feeling angered.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Can it be a coincidence that US planes attacked Syria around the very time the Epstein files were released? It would be cynical - but then again, it would be how politics works. The deadline-day release of the Epstein files had White House media management written all over it, unredacted. Initial searches for Trump's name within the Department of Justice search function returned nothing, while the presence of former president Bill Clinton, on the other hand, was everywhere. It is PR strategy 101 - front-load the release of documents with the Democrat stuff and save any possible Trump content for a soft landing sometime between Christmas and New Year. Epstein files latest: What we found inside - as critics accuse 'document dump' of breaking law By that time, the public will have softened its focus on the story - it's what the festive season does. The presence of celebrity in the latest release might also feather Trump's bed. It's clear that iconic superstars like Mick Jagger and Diana Ross were courted by Epstein as innocents, ignorant of his criminality. To see them in the files cements a narrative of a monster who lured the unsuspecting into his orbit. We support Jagger and Ross as treasured icons, so we remind ourselves that simply being included in the files doesn't equate to wrongdoing or knowledge of it. In turn, it shapes an empathy around the predicament that will extend to Trump and, perhaps, the benefit of any doubt. Of course, not everyone will see it that way - the people who see a cynical exercise in delay and obfuscation, constituting a gross insult to the Epstein survivors at the heart of the story. Read more:Mystery text quoting price for 'girl' included in new picturesTrump administration criticised over partial Epstein files release For all the talk (by the Trump administration) of a tight time scale and a willingness to act transparently, survivors and their supporters point out that Donald Trump could have published all the Epstein files long ago, never mind drip feed them with wide-ranging redactions. Not to have done so is an affront to them and an attempt to evade accountability. For all the talk about the release of the files, their significance is undermined by the lack of context. We are shown pictures and documents that reflect the life of a thoroughly unpleasant individual who inflicted suffering on an industrial scale. But with redactions, and without explanations, we are left having to join the dots in an effort to establish criminal behaviour and blame. It is a level of uncertainty surrounding the Epstein files and a source of dissatisfaction to survivors, for whom justice further delayed is justice further denied."
    },
    {
        "title": "US seizes another tanker off Venezuela - as Brazil issues warning",
        "description": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker.",
        "url": "https://news.sky.com/story/us-seize-another-tanker-off-coast-of-venezuela-13486172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-tanker-oil-tanker_7116377.jpg?20251220212607",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-20 19:11:00",
        "Headline": "Brazil's President Lula says an \"armed intervention in Venezuela would be a ⁠humanitarian catastrophe\" after the US seized a second tanker.",
        "Content": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker. Secretary Kristi Noem of the Department of Homeland Security confirmed the operation on X, saying the oil tanker had last docked in Venezuela. She posted: \"The United States will continue to pursue the illicit movement of sanctioned oil that is used to fund narco terrorism in the region. We will find you, and we will stop you.\" In footage shared by Ms Noem of the raid, a helicopter can be seen landing on the deck of the ship ahead of the seizure.  The vessel is believed to be the Panama-flagged Centuries, according to the maritime risk management company Vanguard. The oil tanker, which was recently spotted near the Venezuelan coast, was seized east of Barbados in the Caribbean Sea. A US official, speaking on condition of anonymity, said the raid was a \"consented boarding,\" with the tanker stopping voluntarily to allowing American forces aboard. It's understood that the operation was led by the Coast Guard with the US military providing helicopter support. The US has already seized a sanctioned oil tanker, called Skipper, off the coast of Venezuela last week. But Centuries has not been sanctioned by the US, according to Jeremy Paner, a partner at Hughes Hubbard law firm in Washington DC, and former investigator at the Office of Foreign Assets Control. \"The seizure of ‌a vessel that is not sanctioned by the US marks a further increase in Trump's pressure on Venezuela,\" he said. \"It also runs counter to Trump's statement that the US would impose a blockade of all sanctioned oil tankers.\" The ship, which was bound for China with some 1.8 million barrels of oil, loaded in Venezuela under the false name Crag, Reuters news agency reported, citing internal documents from Venezuela's state-owned oil company, PDVSA. It departed the country on Wednesday and was briefly escorted by the Venezuelan navy, according to TankerTrackers.com. President Luiz Inacio Lula da Silva of neighbouring Brazil has since cautioned the US against an \"armed intervention\" in Venezuela. During a summit of the South American Mercosur bloc, he said: \"Armed intervention in Venezuela would be a ⁠humanitarian catastrophe.\" He also referred to the 1982 Falklands War between Britain and Argentina, and said \"the South ⁠American continent is once again haunted by ‌the military presence of an extra-regional power\". If the US did intervene, he said, it would set a \"dangerous precedent for the world\".  In recent weeks there has been a steady build up of US forces in the region, effectively placing Venezuela under embargo. \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,\" US President Donald Trump said on Tuesday. \"It will only get bigger, and the shock to them will be like nothing they have ever seen before.\" In his post on social media, the president also branded the regime of Venezuelan President Nicolás Maduro as \"illegitimate\" and a \"foreign terrorist organisation\". He continued: \"Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.\" 👉 Follow Trump100 on your podcast app 👈  Since the Skipper was seized, vessels carrying millions of barrels of oil have been staying put in Venezuelan waters, fearing that the US will intercept them. Some of these are considered to be part of a \"shadow fleet\" - vessels that use concealing tactics to transport goods for sanctioned countries like Russia, Iran, and Venezuela. More than 70 oil tankers in Venezuelan waters this week are part of the so-called shadow fleet, with some 38 sanctioned by the US Treasury, according to data from TankerTrackers.com. Read more:US says eight 'narco-terrorists' killed in three boat strikesMaduro's 'narco nephews' hit with sanctions President Trump has been ramping up pressure on the Maduro regime, accusing it of involvement in the drugs trade. As part of his efforts, he has also authorised deadly strikes against vessels he claims are trafficking drugs in the Caribbean and Eastern Pacific. President Maduro claims Mr Trump is trying to overthrow him with a view to seizing Venezuela's oil reserves."
    },
    {
        "title": "'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims",
        "description": "On an overcast morning, hundreds of Bondi lifeguards lined up on the beach, looked out at the sea and remembered the lives lost in the massacre at the Hanukkah celebration almost one week ago.",
        "url": "https://news.sky.com/story/bondi-beach-victims-honoured-by-lifeguards-who-saw-what-few-people-have-ever-seen-13485854",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-australia_7115656.png?20251220090649",
        "type": "World",
        "Author": "Nicole Johnston",
        "Date Published": "2025-12-20 08:52:00",
        "Headline": "Surf lifesavers played a critical role in the aftermath of the attack. They ran to the scene with first aid kits and, in some cases, were barefoot.",
        "Content": "\n          News correspondent\n              @nicole_reporter\n On an overcast morning, hundreds of Bondi lifeguards lined up on the beach, looked out at the sea and remembered the lives lost in the massacre at the Hanukkah celebration almost one week ago. There was a two-minute silence and a fly-by over the beach by a rescue helicopter. This was Bondi's lifeguards saying goodbye. Surf lifesavers played a critical role in the aftermath of the attack. They ran to the scene with first aid kits and, in some cases, were barefoot. Many were close by, attending a Christmas party at their club. Vice president of the North Bondi Surf Club, Phil Suriano, said: \"Our members were first responders, and what they're going through and what they've seen, few people have ever seen.\" One 20-year-old surf lifesaver, JJ, was with friends on the night of the attack. \"I was swimming out at the rocks and we heard popping sounds going off,\" she said. \"At first, I thought it was firecrackers going off down at the beach. \"It took a few rounds for me to realise that's not firecrackers.\" \"I was pretty close to the rocks and I was moving up them,\" she said. \"We got lots of people off the rocks and into shelter up in the houses that you can see at the northern end.\" A few blocks away from Bondi Beach, Grigoriy Raunshteyn was at home trying to come to terms with it all. He was at the Hanukkah celebration and heard the gunfire start. Once he realised what was happening, he switched on his Facebook livestream and broadcast the footage around the world. \"I started livestreaming, just to bring the awareness,\" he explained. Millions of people have viewed the short videos. Read more about the attack:Inside hotel where alleged gunmen stayed during tripTerror on camera: Pieceing together the full story of the Bondi attackAustralia plans gun buyback scheme in response to Bondi Beach killings \"I was lying down as instructed and trying to figure out where the shooters were. For some reason, I felt the shots coming from six or five different locations,\" Mr Raunshteyn said. He had recently completed a first aid course, including CPR. Once it was safe, Mr Raunshteyn tried to save those around him, including British-born rabbi Eli Schlenger. Rabbi Schlenger did not survive. \"We were waiting for the paramedics,\" said Mr Raunshteyn. \"When they came, they quickly assessed him and said something like, 'move to the next person'.\" \"I thought 'I'll give him one rescue breath', and I did.\" Grigoriy Raunshteyn is slowly processing those traumatic hours. He never believed something like this could ever happen in Sydney."
    },
    {
        "title": "Indian high-speed train hits and kills seven elephants",
        "description": "A high-speed train carrying 650 people has collided with and killed seven wild Asiatic elephants and injured a calf in northern India. ",
        "url": "https://news.sky.com/story/indian-high-speed-train-hits-and-kills-seven-elephants-13485855",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-elephant-india_7115658.jpg?20251220091018",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-20 08:57:00",
        "Headline": "Since 2020, at least a dozen elephants have been killed by speeding trains across India's Assam state.",
        "Content": "A high-speed train carrying 650 people has collided with and killed seven wild Asiatic elephants and injured a calf in northern India.  Five train coaches and the engine derailed following the impact, but there were no reported human casualties, Kishore Sharma, Indian Railways spokesman said. Local authorities say the incident happened in the early hours of Saturday morning in India's northeastern state of Assam. Although the train driver spotted the hundred-strong herd crossing the track and used the train's emergency brakes, some of the elephants were still hit. Veterinarians carried out autopsies on the dead elephants which will be buried later in the day. The Rajdhani Express train had been traveling from Mizoram state, which borders Myanmar, to the national capital of New Delhi. The accident site is a forested area in Assam. Railway tracks in the state are often frequented by elephants, but Indian Railways said in a statement the accident location wasn't a designated elephant corridor. \n                  Train hits elephants in Sri Lanka, killing four babies and two adults from herd\n                 \n                  Elephants can't pursue release because they are not people, court rules\n                 \n                  Elephants have nicknames for each other, scientists find in 'really exciting' discovery\n                 Despite the impact, passengers in the carriages which didn't derail resumed their journey towards New Delhi. Read more from Sky News:The pictures that defined 2025Pensioner spared jail after smothering wife at home Around 200 passengers who were in the five derailed coaches were moved to Guwahati in a different train. Speeding trains hitting wild elephants is not rare in Assam, which is home to an estimated 7,000 wild Asiatic elephants, one of the highest concentrations of the pachyderm in India. Since 2020, at least a dozen elephants have been killed by speeding trains across the state. Wild elephants often stray into human habitations this time of year, when rice fields are ready for harvesting."
    },
    {
        "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
        "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
        "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-20 18:36:00",
        "Headline": "The Delaware Supreme Court rules to reinstate his 2018 Tesla stock options worth $139bn, taking his net worth past an unprecedented $700bn.",
        "Content": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions. According to Forbes's billionaires index, the Tesla chief executive's net worth climbed to $749bn (£559bn) on Friday, making Musk the first person to surpass the $700bn milestone. He is already the world's richest man, and around $500bn (£373bn) richer than the second-richest, Google co-founder Larry Page, the index reports.   It follows the Delaware Supreme Court's ruling to reinstate his 2018 Tesla stock options worth $139bn (£103bn), which were rescinded last year. That year, Musk was awarded a pay package including stocks worth $56bn (£41bn) at the time, but it was struck down in a lower court in 2024 as the compensation was \"unfathomable\". Delaware judge Kathaleen McCormick concluded after a five-day trial that Tesla's directors were conflicted and key facts were hidden from shareholders when they voted to approve the plan. On Friday, the state supreme court ruled that rescinding the pay package left the Tesla head \"uncompensated for his time and efforts over a period of six years\", and that Ms McCormick's verdict had been improper and inequitable. Read more on Elon Musk:Musk is winning the space race - and looks unstoppableHow world's richest man is boosting the British right As is his style, Musk has not issued a formal statement responding to the restoration of his options, but did say in a reply on his social media platform X that he was \"vindicated\". If Musk exercises all the stock options from the 2018 package, his stake in Tesla would grow from about 12.4% to 18.1% of an expanded share base. It was Tesla's largest ever pay package, until the electric vehicle company awarded Musk a pay plan worth up to $1trn (£747bn) this November. It was approved by 75% of shareholders, but to pay out in full, Mr Musk must achieve five milestones in the next decade: • Deliver 20 million Tesla vehicles and one million robots; • Drive 10 million subscriptions to Tesla's self-driving feature; • Bring one million self-driving Robotaxis into operation; • Earn as much as $400bn in core profit; • Lift Tesla's market value to $8.5trn. Under the agreement, Musk will not receive a salary, but meeting all targets would see him receive more than 400 million extra shares in Tesla. If the company's value is raised to the target, those would be worth around $1trn. As of writing, Tesla is valued at $1.51trn (£1.12trn)."
    },
    {
        "title": "Former Pakistani prime minister Imran Khan jailed for 17 years over state gift fraud",
        "description": "Former Pakistan prime minister and cricketer Imran Khan and his wife Bushra Bibi have been jailed for 17 years for buying state gifts at a knock-down price.\n",
        "url": "https://news.sky.com/story/former-pakistani-prime-minister-imran-khan-jailed-for-17-years-over-state-gift-fraud-13485873",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-khan-pakistan_7115698.jpg?20251220105630",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-20 10:19:00",
        "Headline": "Prosecutors argue Khan and his wife purchased the luxury gifts from the state at a heavily discounted price - violating rules.",
        "Content": "Former Pakistan prime minister and cricketer Imran Khan and his wife Bushra Bibi have been jailed for 17 years for buying state gifts at a knock-down price.\n Luxury watches and jewellery were gifted to Khan while he was prime minister by Saudi Arabia's Crown Prince Mohammed bin Salman during official visits. Under Pakistani law, if government officials and politicians wish to keep gifts received from foreign dignitaries, they must buy them from the state at the market value - and declare any proceeds earned from selling them. But prosecutors said Khan, 73, and ‌his wife paid a heavily ⁠discounted fee for the gifts - violating Pakistani rules. The couple pleaded not guilty when they were indicted last year. Prosecutors argued he and his wife declared the value of the gifts at little over $10,000 (£7,500), far below their actual market value of $285,500 (£213,000), allowing them to purchase the items at a reduced price. They were handed 10 years' rigorous imprisonment under Pakistan's penal code for criminal ‌breach of trust, and a further seven years under anti-corruption laws, Pakistan's Federal Investigation Agency announced. \n                  Bondi, Imran Khan's sons speak out, and is a deal close in Ukraine?\n                 \n                  Imran Khan being held in 'death cell', his sons say\n                 \n                  How did a viral deepfake stoke tensions between India and Pakistan? \n                 The latest conviction adds to a series of legal setbacks for Khan, who has been behind bars since August 2023, and is currently serving a 14-year sentence in a separate corruption case. He faces dozens of cases filed since he was ousted from office in 2022, ranging from corruption ‍to anti-terrorism and state secrets charges. Khan has denied wrongdoing in all the cases, which his party says are politically motivated. In a recent interview with Sky News' The World with Yalda Hakim, Khan's sons said they fear they might never see their father again. They also claimed he was being \"psychologically tortured\" in a \"death cell\". Khan is one of the country's most celebrated cricketers, who captained his country to World Cup victory in 1992. Khan's jail term from Saturday's ruling would begin after he has served the 14 years from the separate land graft case, information minister Attaullah Tarar said. Read more from Sky News:Indian high-speed train hits and kills seven elephantsAustralia plans gun buyback scheme after Bondi Beach attack Zulfi Bukhari, a spokesperson for Khan, said the verdict \"ignores basic principles of justice\" and turns the process into \"a tool for selective prosecution.\" Khan has reportedly told ‌his legal team to appeal the decision at the Islamabad High Court. Khan, a former cricket star turned politician, remains one of Pakistan's most polarising figures. His Pakistan ‍Tehreek-e-Insaf party - which was founded in 1996 - remains sidelined from power."
    },
    {
        "title": "The links between Jeffrey Epstein and the UK revealed in new files",
        "description": "Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US.",
        "url": "https://news.sky.com/story/the-links-between-jeffrey-epstein-and-the-uk-revealed-in-new-files-13485977",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251220174213",
        "type": "US",
        "Author": "Tom Cheshire",
        "Date Published": "2025-12-20 15:14:00",
        "Headline": "The files reveal the disgraced financier inveigled his way into British high society.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n Jeffrey Epstein led two different lives - sex offender and celebrity networker - and he did that in the UK as well as the US. The newly released Epstein documents reveal, in particular, how the paedophile financier ascended into the highest levels of British society. This photo of Andrew Mountbatten-Windsor sprawled across the lap of several women, whose identities have been protected, speaks to his close relationship with Epstein's former girlfriend Ghislaine Maxwell, who was jailed for child sex trafficking and other offences in connection with Epstein. But the furnishings are even more revealing. Epstein files - latest updates  Sky News matched the fireplace in this photo with the one in Sandringham, the estate where the royals tend to spend Christmas - (Andrew is not invited this year). Andrew has vigorously denied any accusations against him. Also included in the latest release are Epstein's flight records. They provide some useful corroborating evidence. On 9 March 2001, his plane landed at \"EGGW\" - Luton Airport - with JE, GM and VR on board - Jeffrey Epstein, Ghislaine Maxwell and Virginia Roberts, better known by her married name of Virginia Giuffre and perhaps Epstein's most famous accuser. The next day is when this photo was alleged to have been taken, in London, of Giuffre and Andrew. Other photos show Maxwell on the steps of Downing Street - and power was as much a draw as celebrity. On 15 May 2002, the flight records show Epstein again arriving at Luton. The next day is when he met Tony Blair, prime minister at the time. This was before Epstein's first arrest and there is no suggestion of wrongdoing. Read more:New photos of Jeffrey Epstein's circle releasedGhislaine Maxwell sex trafficking case material to be released The meeting was arranged by Peter Mandelson, who lost his job as ambassador to the US because of his Epstein connections, and who features prominently in the files. The UK was a draw for Epstein's wider circle too - Maxwell here is pictured touring the Churchill War Rooms with Bill Clinton and Kevin Spacey. Neither are accused of wrongdoing or knowledge of Epstein's crimes. And the other grim life that Epstein led, of sex trafficking, also had British links. Another document released in the files, from 2019, shows witness testimony from Maxwell's trial. In it, a victim is mentioned who is \"17 years old\" and who grew up \"in England\". She would later be taken to Epstein's private Caribbean island."
    },
    {
        "title": "US seizes another tanker off Venezuela - as Brazil issues warning",
        "description": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker.",
        "url": "https://news.sky.com/story/us-seize-another-tanker-off-coast-of-venezuela-13486172",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-venezuela-tanker-oil-tanker_7116377.jpg?20251220212607",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-20 19:11:00",
        "Headline": "Brazil's President Lula says an \"armed intervention in Venezuela would be a ⁠humanitarian catastrophe\" after the US seized a second tanker.",
        "Content": "The US has been warned against risking a \"humanitarian catastrophe\" in Venezuela after it seized another tanker. Secretary Kristi Noem of the Department of Homeland Security confirmed the operation on X, saying the oil tanker had last docked in Venezuela. She posted: \"The United States will continue to pursue the illicit movement of sanctioned oil that is used to fund narco terrorism in the region. We will find you, and we will stop you.\" In footage shared by Ms Noem of the raid, a helicopter can be seen landing on the deck of the ship ahead of the seizure.  The vessel is believed to be the Panama-flagged Centuries, according to the maritime risk management company Vanguard. The oil tanker, which was recently spotted near the Venezuelan coast, was seized east of Barbados in the Caribbean Sea. A US official, speaking on condition of anonymity, said the raid was a \"consented boarding,\" with the tanker stopping voluntarily to allowing American forces aboard. It's understood that the operation was led by the Coast Guard with the US military providing helicopter support. The US has already seized a sanctioned oil tanker, called Skipper, off the coast of Venezuela last week. But Centuries has not been sanctioned by the US, according to Jeremy Paner, a partner at Hughes Hubbard law firm in Washington DC, and former investigator at the Office of Foreign Assets Control. \"The seizure of ‌a vessel that is not sanctioned by the US marks a further increase in Trump's pressure on Venezuela,\" he said. \"It also runs counter to Trump's statement that the US would impose a blockade of all sanctioned oil tankers.\" The ship, which was bound for China with some 1.8 million barrels of oil, loaded in Venezuela under the false name Crag, Reuters news agency reported, citing internal documents from Venezuela's state-owned oil company, PDVSA. It departed the country on Wednesday and was briefly escorted by the Venezuelan navy, according to TankerTrackers.com. President Luiz Inacio Lula da Silva of neighbouring Brazil has since cautioned the US against an \"armed intervention\" in Venezuela. During a summit of the South American Mercosur bloc, he said: \"Armed intervention in Venezuela would be a ⁠humanitarian catastrophe.\" He also referred to the 1982 Falklands War between Britain and Argentina, and said \"the South ⁠American continent is once again haunted by ‌the military presence of an extra-regional power\". If the US did intervene, he said, it would set a \"dangerous precedent for the world\".  In recent weeks there has been a steady build up of US forces in the region, effectively placing Venezuela under embargo. \"Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,\" US President Donald Trump said on Tuesday. \"It will only get bigger, and the shock to them will be like nothing they have ever seen before.\" In his post on social media, the president also branded the regime of Venezuelan President Nicolás Maduro as \"illegitimate\" and a \"foreign terrorist organisation\". He continued: \"Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.\" 👉 Follow Trump100 on your podcast app 👈  Since the Skipper was seized, vessels carrying millions of barrels of oil have been staying put in Venezuelan waters, fearing that the US will intercept them. Some of these are considered to be part of a \"shadow fleet\" - vessels that use concealing tactics to transport goods for sanctioned countries like Russia, Iran, and Venezuela. More than 70 oil tankers in Venezuelan waters this week are part of the so-called shadow fleet, with some 38 sanctioned by the US Treasury, according to data from TankerTrackers.com. Read more:US says eight 'narco-terrorists' killed in three boat strikesMaduro's 'narco nephews' hit with sanctions President Trump has been ramping up pressure on the Maduro regime, accusing it of involvement in the drugs trade. As part of his efforts, he has also authorised deadly strikes against vessels he claims are trafficking drugs in the Caribbean and Eastern Pacific. President Maduro claims Mr Trump is trying to overthrow him with a view to seizing Venezuela's oil reserves."
    },
    {
        "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
        "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
        "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-20 18:36:00",
        "Headline": "The Delaware Supreme Court rules to reinstate his 2018 Tesla stock options worth $139bn, taking his net worth past an unprecedented $700bn.",
        "Content": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions. According to Forbes's billionaires index, the Tesla chief executive's net worth climbed to $749bn (£559bn) on Friday, making Musk the first person to surpass the $700bn milestone. He is already the world's richest man, and around $500bn (£373bn) richer than the second-richest, Google co-founder Larry Page, the index reports.   It follows the Delaware Supreme Court's ruling to reinstate his 2018 Tesla stock options worth $139bn (£103bn), which were rescinded last year. That year, Musk was awarded a pay package including stocks worth $56bn (£41bn) at the time, but it was struck down in a lower court in 2024 as the compensation was \"unfathomable\". Delaware judge Kathaleen McCormick concluded after a five-day trial that Tesla's directors were conflicted and key facts were hidden from shareholders when they voted to approve the plan. On Friday, the state supreme court ruled that rescinding the pay package left the Tesla head \"uncompensated for his time and efforts over a period of six years\", and that Ms McCormick's verdict had been improper and inequitable. Read more on Elon Musk:Musk is winning the space race - and looks unstoppableHow world's richest man is boosting the British right As is his style, Musk has not issued a formal statement responding to the restoration of his options, but did say in a reply on his social media platform X that he was \"vindicated\". If Musk exercises all the stock options from the 2018 package, his stake in Tesla would grow from about 12.4% to 18.1% of an expanded share base. It was Tesla's largest ever pay package, until the electric vehicle company awarded Musk a pay plan worth up to $1trn (£747bn) this November. It was approved by 75% of shareholders, but to pay out in full, Mr Musk must achieve five milestones in the next decade: • Deliver 20 million Tesla vehicles and one million robots; • Drive 10 million subscriptions to Tesla's self-driving feature; • Bring one million self-driving Robotaxis into operation; • Earn as much as $400bn in core profit; • Lift Tesla's market value to $8.5trn. Under the agreement, Musk will not receive a salary, but meeting all targets would see him receive more than 400 million extra shares in Tesla. If the company's value is raised to the target, those would be worth around $1trn. As of writing, Tesla is valued at $1.51trn (£1.12trn)."
    },
    {
        "title": "Joshua delivers taste of reality to YouTuber Jake Paul",
        "description": "Former British heavyweight world champion Anthony Joshua delivered a dose of reality to YouTuber-turned-boxer Jake Paul as he won their much-anticipated showdown.",
        "url": "https://news.sky.com/story/anthony-joshua-wins-fight-against-jake-paul-13485804",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jake-paul-v-anthony-joshua_7115555.jpg?20251220045301",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-20 00:07:00",
        "Headline": "Two-time heavyweight world champion Joshua returned to the ring for the first time since his knockout defeat to Daniel Dubois in September 2024.",
        "Content": "Former British heavyweight world champion Anthony Joshua delivered a dose of reality to YouTuber-turned-boxer Jake Paul as he won their much-anticipated showdown. But Joshua was made to work far harder than he would have liked to extinguish the challenge of a brave but limited opponent. Joshua scored three knockdowns before landing a huge right hit on Paul halfway through the sixth round. The British fighter lifted Paul's hand in a show of respect after the fight broadcast on the streaming platform Netflix. \"Jake Paul has done really well tonight. I want to give him his props, he got up, time and time again,\" he said about his opponent. Joshua said it \"wasn't the best performance\", adding: \"It took a bit longer than expected. But the right hand finally found the destination.\" Meanwhile, Paul said: \"I'm feeling good, that was fun. I love this sport. I gave it my all, It's f****** crazy. I had a blast. \n                  Jake Paul vs Anthony Joshua: All you need to know\n                 \n                  Anthony Joshua could return to ring to fight ex-YouTuber Jake Paul\n                 \n                  Anthony Joshua blames training 'fatigue' for speeding\n                 \"I got my ass beat, but that's what this sport is about. I'mma (going to) come back and keep on winning.\" He added: \"I just got tired to be honest. He did amazing and hits really hard.\" The fight marked the end of a 14-month hiatus for Joshua, 36, while for 28-year-old Paul it was the biggest fight since his boxing career began in 2020. At the weigh-in on Friday, Joshua boasted an almost two-stone advantage over Paul, who has regularly fought at cruiserweight since he entered the world of boxing. Read more from Sky News:David Walliams dropped by publisherThe pictures that defined 2025 Britain's two-time world heavyweight champion tipped the scales at 243.4lbs (17st 5lbs) for his fight against Paul in Miami, while Paul weighed in at 216lbs (15st 6lbs) - a hefty 1.9st difference. Joshua, who could not weigh more than 245lbs, is the lightest he has been since his first fight against Oleksandr Usyk in September 2021 when he was 240lbs. For his last fight against Daniel Dubois he weighed 252.5Ibs. It is also only the second time that Paul weighed in over cruiserweight limit - the other time was when he fought 58-year-old Mike Tyson. Paul defeated Tyson by unanimous decision with 80-72, 79-73, and 79-73. "
    },
    {
        "title": "Trump administration criticised over partial Epstein files release",
        "description": "The Trump administration's release of just some of the files related to Jeffrey Epstein was criticised as failing to \"comply with law\".",
        "url": "https://news.sky.com/story/trump-administration-criticised-over-partial-epstein-files-release-13485816",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marjorie-taylor-greene_7088174.jpg?20251122065156",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-20 04:19:00",
        "Headline": "The US deputy attorney general, Todd Blanche, said in a letter to Congress that the justice department was continuing to review the remaining files and was withholding some documents under exemptions meant to protect victims.",
        "Content": "The Trump administration's release of just some of the files related to Jeffrey Epstein was criticised as failing to \"comply with law\". The tranche of material relating to the dead paedophile financier was made public by the US justice department shortly after 9pm UK time on Friday - hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act. The US deputy attorney general, Todd Blanche, said in a letter to Congress that the department was continuing to review the remaining files and was withholding some documents under exemptions meant to protect victims. More than 1,200 victims and their families were identified during a review of the records, which have been redacted to protect victims, Mr Blanche said. He said additional disclosures can be expected by the end of the year. But the decision not to release all the files by Friday's deadline has been criticised by politicians, who said the Trump administration had failed to produce all the documents required under the transparency act. Release fails in 'spirit and letter' of law \n                  The links between Jeffrey Epstein and the UK revealed in new files\n                 \n                  New photos of Jeffrey Epstein's circle among thousands of files released\n                 \n                  Trump turns angry ahead of Epstein files release\n                 Democrat Ro Khanna and Republican Thomas Massie, who had teamed up to get the bipartisan law passed that triggered the release, voiced their criticism and disappointment in posts on X. \"The DOJ's document dump of hundreds of thousands of pages failed to comply with the law authored by @RepThomasMassie and me,\" Mr Khanna said. He said the release was \"disappointing\" and that survivors of Epstein's abuse, and their lawyers, were still expecting to see a lot more files. Mr Khanna particularly highlighted one document, which included 119 pages of Grand Jury testimony that were completely redacted. \"Unfortunately, today's document release by @AGPamBondi and @DAGToddBlanche grossly fails to comply with both the spirit and the letter of the law that @realDonaldTrump signed just 30 days ago,\" Mr Massie added. Incomplete files 'NOT MAGA' Meanwhile, Marjorie Taylor Greene, the MAGA Republican Congresswoman who was once US President Donald Trump's biggest cheerleader, isn't happy either. Mr Trump recently branded her a \"traitor\" after she became critical of his handling of the Epstein files, among other issues - prompting her resignation from Congress. She wrote on X about Friday's release, saying the following was \"NOT MAGA\". \"The heavily redacted Epstein files being released, failure to release them all by today's lawful deadline, and redacting 'politically exposed individuals and government officials',\" Ms Taylor Greene wrote. White House defends release The justice department said it was not redacting the names of any politicians. \"The only redactions being applied to the documents are those required by law - full stop. Consistent with the statute and applicable laws, we are not redacting the names of individuals or politicians unless they are a victim,\" it quoted deputy attorney general Mr Blanche in a post on X. The Trump administration has claimed to be the most transparent in history. In a statement, the White House claimed the release also demonstrated its commitment to justice for Epstein's victims, criticising previous Democratic administrations for not doing the same. But that statement ignored that the disclosures only happened because Congress forced the administration's hand with a bill demanding the release, after Trump officials declared earlier this year that no more Epstein files would be made public. Can Democrats force the full release? Democrat senator Jeff Merkley said that by disregarding the deadline, the administration was denying justice to Epstein's victims. He added he was \"exploring all avenues and legal tools to get justice for the victims and transparency for the American people\". Read more:Photos of Jeffrey Epstein's circle among released filesWriting on body seen in pictures released by DemocratsTrump, Clinton, Andrew and others seen in previous release One potential avenue for Democrats would be going to court to force the justice department to comply with the Epstein Files Transparency Act, but that would likely be a lengthy process that would play out while the department releases more files. The House Oversight Committee has issued a subpoena for the Epstein files in the meantime, which could give Congress another avenue to force the release. However, this would require Republicans to join the Democrats in contempt-of-Congress proceedings against Mr Trump's Republican administration."
    },
    {
        "title": "Fashion brand LK Bennett in race for Christmas saviour",
        "description": "The owner of the fashion brand LK Bennett is this weekend racing to find a saviour amid concerns that it could be heading for collapse for the second time in six years.",
        "url": "https://news.sky.com/story/fashion-brand-lk-bennett-in-race-for-christmas-saviour-13485843",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-istock-money_7115638.jpg?20251220080451",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-20 07:50:00",
        "Headline": "The brand which counted the Princess of Wales and Theresa May among its customers has called in City advisers to run an accelerated sale process, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of the fashion brand LK Bennett is this weekend racing to find a saviour amid concerns that it could be heading for collapse for the second time in six years. Sky News has learnt that the clothing chain, which was founded by Linda Bennett in 1990, is working with advisers at Alvarez & Marsal (A&M) on an accelerated sale process. Industry sources said on Saturday that A&M had begun sounding out potential buyers and investors in the last few days. At one stage, LK Bennett was among the most recognisable brands on the high street, expanding to 200 branded outlets in the UK and overseas markets including China, Russia and the US. In its home market it now trades from just nine standalone stores, with a further 13 listed as concessions on its website. It was unclear whether a sale of the loss-making brand was likely or whether LK Bennett's existing backers might be prepared to inject more funding into the business. Contingency plans for an insolvency are frequently drawn up by advisers drafted in to run accelerated sale processes. \n                  Facewatch: The controversial tech that retailers have deployed to tackle shoplifting and violence\n                 \n                  Chain of cricket venues backed by Ben Stokes collapses into administration | Money\n                 \n                  Retail rues tough Black Friday amid consumer caution ahead of Christmas\n                 The brand is owned by Byland UK, a company established in 2019 for the purpose of rescuing LK Bennett from a previous brush with insolvency. Byland UK was formed by Rebecca Feng, who ran LK Bennett's Chinese franchises. At the time of that deal, Ms Feng said: \"Under our plan, the business will continue to operate out of the UK, looking to maintain the long-standing and undoubted heritage of the brand. \"This will be achieved through a combination of working with quality British design, and the business's existing supply chain.\" Accounts for LK Bennett Fashion for the period ended January 27, 2024 show the company made a post-tax loss of £3.5m on turnover of £42.1m. The figures showed a steep loss in sales from £48.8m in 2023. According to the accounts, LK Bennett paid a dividend of £229,000 \"at the start of the year when performance was doing well\". \"Given the decline in revenue, the directors do not recommend the payment of any further dividends.\" Ms Bennett founded the eponymous chain by opening a store in Wimbledon, southwest London, in 1990, and promised to \"bring a bit of Bond Street to the high street\". Her eye for design earned her the nickname 'queen of the kitten heel' and saw her products worn by the Princess of Wales and Theresa May, the former prime minister. In 2008, Ms Bennett sold the business for an estimated £100m to a consortium led by the private equity firm Phoenix Equity Partners. She retained a stake, and then bought back the remaining equity in 2017. The company's administration in 2019 resulted in the closure of 15 stores. It was unclear how many people are now employed by LK Bennett. LK Bennett has been contacted for comment, while A&M declined to comment."
    },
    {
        "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
        "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
        "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-20 18:36:00",
        "Headline": "The Delaware Supreme Court rules to reinstate his 2018 Tesla stock options worth $139bn, taking his net worth past an unprecedented $700bn.",
        "Content": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions. According to Forbes's billionaires index, the Tesla chief executive's net worth climbed to $749bn (£559bn) on Friday, making Musk the first person to surpass the $700bn milestone. He is already the world's richest man, and around $500bn (£373bn) richer than the second-richest, Google co-founder Larry Page, the index reports.   It follows the Delaware Supreme Court's ruling to reinstate his 2018 Tesla stock options worth $139bn (£103bn), which were rescinded last year. That year, Musk was awarded a pay package including stocks worth $56bn (£41bn) at the time, but it was struck down in a lower court in 2024 as the compensation was \"unfathomable\". Delaware judge Kathaleen McCormick concluded after a five-day trial that Tesla's directors were conflicted and key facts were hidden from shareholders when they voted to approve the plan. On Friday, the state supreme court ruled that rescinding the pay package left the Tesla head \"uncompensated for his time and efforts over a period of six years\", and that Ms McCormick's verdict had been improper and inequitable. Read more on Elon Musk:Musk is winning the space race - and looks unstoppableHow world's richest man is boosting the British right As is his style, Musk has not issued a formal statement responding to the restoration of his options, but did say in a reply on his social media platform X that he was \"vindicated\". If Musk exercises all the stock options from the 2018 package, his stake in Tesla would grow from about 12.4% to 18.1% of an expanded share base. It was Tesla's largest ever pay package, until the electric vehicle company awarded Musk a pay plan worth up to $1trn (£747bn) this November. It was approved by 75% of shareholders, but to pay out in full, Mr Musk must achieve five milestones in the next decade: • Deliver 20 million Tesla vehicles and one million robots; • Drive 10 million subscriptions to Tesla's self-driving feature; • Bring one million self-driving Robotaxis into operation; • Earn as much as $400bn in core profit; • Lift Tesla's market value to $8.5trn. Under the agreement, Musk will not receive a salary, but meeting all targets would see him receive more than 400 million extra shares in Tesla. If the company's value is raised to the target, those would be worth around $1trn. As of writing, Tesla is valued at $1.51trn (£1.12trn)."
    },
    {
        "title": "Elon Musk closer to becoming first-ever trillionaire as he marks major milestone",
        "description": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions.",
        "url": "https://news.sky.com/story/elon-musk-closer-to-becoming-first-ever-trillionaire-as-he-marks-major-milestone-13486155",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-20 18:36:00",
        "Headline": "The Delaware Supreme Court rules to reinstate his 2018 Tesla stock options worth $139bn, taking his net worth past an unprecedented $700bn.",
        "Content": "Elon Musk has just gotten even closer to being the first-ever trillionaire after a court reinstated his Tesla stock options worth billions. According to Forbes's billionaires index, the Tesla chief executive's net worth climbed to $749bn (£559bn) on Friday, making Musk the first person to surpass the $700bn milestone. He is already the world's richest man, and around $500bn (£373bn) richer than the second-richest, Google co-founder Larry Page, the index reports.   It follows the Delaware Supreme Court's ruling to reinstate his 2018 Tesla stock options worth $139bn (£103bn), which were rescinded last year. That year, Musk was awarded a pay package including stocks worth $56bn (£41bn) at the time, but it was struck down in a lower court in 2024 as the compensation was \"unfathomable\". Delaware judge Kathaleen McCormick concluded after a five-day trial that Tesla's directors were conflicted and key facts were hidden from shareholders when they voted to approve the plan. On Friday, the state supreme court ruled that rescinding the pay package left the Tesla head \"uncompensated for his time and efforts over a period of six years\", and that Ms McCormick's verdict had been improper and inequitable. Read more on Elon Musk:Musk is winning the space race - and looks unstoppableHow world's richest man is boosting the British right As is his style, Musk has not issued a formal statement responding to the restoration of his options, but did say in a reply on his social media platform X that he was \"vindicated\". If Musk exercises all the stock options from the 2018 package, his stake in Tesla would grow from about 12.4% to 18.1% of an expanded share base. It was Tesla's largest ever pay package, until the electric vehicle company awarded Musk a pay plan worth up to $1trn (£747bn) this November. It was approved by 75% of shareholders, but to pay out in full, Mr Musk must achieve five milestones in the next decade: • Deliver 20 million Tesla vehicles and one million robots; • Drive 10 million subscriptions to Tesla's self-driving feature; • Bring one million self-driving Robotaxis into operation; • Earn as much as $400bn in core profit; • Lift Tesla's market value to $8.5trn. Under the agreement, Musk will not receive a salary, but meeting all targets would see him receive more than 400 million extra shares in Tesla. If the company's value is raised to the target, those would be worth around $1trn. As of writing, Tesla is valued at $1.51trn (£1.12trn)."
    },
    {
        "title": "It's one of theatre's most magical crafts - but now it's critically endangered",
        "description": "Puppetry has enjoyed a renaissance in recent years.",
        "url": "https://news.sky.com/story/its-one-of-theatres-most-magical-crafts-but-now-its-critically-endangered-13483716",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-puppet-pinocchio-globe_7110885.jpg?20251215120324",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-12-20 00:01:00",
        "Headline": "While some puppets are enjoying success on the stage, the intricate skills required for long-string marionettes mean they are under threat.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Puppetry has enjoyed a renaissance in recent years. With the ability to tell political and philosophical stories, fairy tales and musical adventures, all with equal flair, puppeteers bringing the inanimate to life on stage is back in vogue. A staple of the festive season, the year-round resurgence has been invigorated by hit West End shows including War Horse, The Life Of Pi, The Lion King and My Neighbour Totoro, boosting a craft that has been traced back as far as the ancient Greeks. This year, puppets are centre stage at Shakespeare's Globe, with Pinocchio their leading man. The tale of a wooden puppet who dreams of becoming a real boy, Globe associate director Sean Holmes tells Sky News: \"It seemed to fit, a boy made of wood in a theatre made of wood. \"There's something about the kind of challenge of that storytelling, the theatricality, the magic, the puppetry, that really drew us to it.\" The performers - made up of actors and puppeteers - spent 18 months workshopping the show ahead of opening night, perfecting the challenge of skilled puppetry, acting and singing all on an open-air stage. It's no mean feat. \n                  The show might not go on: Broadway stars ready to strike\n                 \n                  John Lithgow on JK Rowling's trans stance backlash: 'She's handled it fairly gracefully'\n                 \n                  KT Tunstall: 'I was a totally crap pop star... It's important to kill your idea of what you should be'\n                 The show features a range of puppets, including rod, table-top, and large-scale creations that fill the stage and marionettes - small puppets with big impact. One of the show's puppeteers, Stan Middleton, a marionette specialist, operates a marionette Romeo puppet in part of the performance. He tells Sky News: \"I think a lot of people are scared of marionettes because they think, 'Oh no, they're too difficult, we can't do them'.\" He goes on: \"It's so nice to have the marionette moment in this show, because it gives people a chance to see how beautiful they are and how enchanting… \"They've got a sort of delicate charm and a sort of like inner silence which I think really captivates people.\" Despite their charms, the intricate skills required to both craft and manipulate long-string marionettes mean they are under threat. While some puppets - including War Horse-style rod and Totoro-style body ones - are enjoying success on the stage, marionettes are critically endangered. Unlike dance or circus, puppetry is not recognised in its own right by Arts Council England and is instead grouped with theatre. It means specialist puppet venues are competing for funding in the highly saturated market of theatre companies producing for children and families, with no special recognition of their craft. Marionette-making was added to Heritage Crafts' Red List of Endangered Crafts in 2023. There are now calls for it to be added to the UNESCO Intangible Cultural Heritage (ICH) list too, after the UK officially joined earlier this year. Little Angel Theatre, a hub for British puppetry for over six decades, is one of a handful of UK spaces where puppeteers can perform with long-string marionettes. Boasting not one but two marionette bridges, puppeteers can walk 360 degrees all the way around the upper part of the stage, working their marionettes from a hidden vantage point above. Trained by some of the last remaining UK makers, including Little Angel co-founder Lyndie Wright, Little Angel Associate director Oliver Hymans is a central figure in the effort to save the craft. Inspired by seeing old marionettes hung up at the back of the stage and intrigued by why they were not being used, he is now committed to re-establishing traditional marionette-making. Hymans tells Sky News: \"The marionette is a series of nine different pendulums all wired together. You're having to work against gravity to keep it in control. \"But the thing about the marionette is you can hide the puppeteer. So, you can completely design and develop a world where there are only puppets and scenery and scenography.\" He says the majority of master marionette makers have retired or are nearing retirement, and warns there may be just a handful left in the country. He explains: \"With the onslaught of AI, we know it's coming. Jobs where people use their hands are going to be vitally important, and if we don't protect these crafts, they are going to die out.\" Putting their money where their mouth is, Little Angel is nurturing emerging talent, upskilling people in both the art of making and performing with marionettes. They plan to have a marionette show on stage next summer. Also joining the fight for the overlooked craft, puppetry director Rachel Warr has organised a celebration of marionettes for the last three years, with the support of the Art Workers' Guild Outreach Committee. An industry-focused free event, it brings the puppetry community together - with particular relevance to those who work with marionettes - or who aspire to. Some members of the community appear in a forthcoming short documentary about puppets, Untangling, by filmmaker Hester Heeler-Frood. Warr told Sky News: \"People are often more affected by a puppet dying on stage than an actor pretending to die in character. It doesn't have the artifice of getting up and walking away and getting on the tube at the end of the night. \"There's something quite vulnerable about the puppet in that sense… We know that it's not really alive, and yet we're able to project on to it our own thoughts and feelings. It's a blank canvas - a powerful tool.\" Meanwhile, as Pinocchio plays at the Globe, the theatre is running accompanying puppetry workshops, encouraging children to get involved in the craft - maybe inspiring future stars of puppeteering. With their future hanging by a string, the training of the next generation is key to breathing life back into an overlooked craft, reinstating marionettes to their rightful place on the stage. Pinocchio runs at Shakespeare's Globe until Sunday 4 January. The Storm Whale at Little Angel Studios runs until Saturday 24 January, and Me runs at Little Angel Theatre until Sunday 25 January."
    }
]