[
    {
        "title": "Ukrainian officials head to US for peace talks - while dramatic footage shows Russian oil tankers being hit ",
        "description": "Ukraine's representatives are preparing for renewed peace talks in the US, while dramatic footage has shown Russian tankers being hit by naval drones.",
        "url": "https://news.sky.com/story/ukrainian-officials-head-to-us-for-peace-talks-while-dramatic-footage-shows-russian-oil-tanker-being-hit-13477317",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-russian-tanker-black-sea_7096087.jpg?20251130005013",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 21:40:00",
        "Headline": "Volodymyr Zelenskyy says his country's delegation is looking to \"swiftly and substantively work out the steps needed to end the war\".",
        "Content": " Ukraine's representatives are preparing for renewed peace talks in the US, while dramatic footage has shown Russian tankers being hit by naval drones. President Zelenskyy said a delegation headed by national security chief Rustem Umerov was on its way to \"swiftly and substantively work out the steps needed to end the war\". They are due to be greeted by US secretary of state Marco Rubio, Donald Trump's special envoy Steve Witkoff, and the US president's son-in-law Jared Kushner, a senior US official told Reuters news agency. After the US-Ukraine talks, an American delegation is expected to travel to Moscow to meet President Putin. It comes after Mr Trump released a 28-point proposal last week that would hand swathes of land to Russia and limit the size of Kyiv's military. It was widely seen as heavily favouring Russia and led Mr Zelenskyy to swiftly engage with American negotiators. President Trump said on Tuesday his plan had been \"fine-tuned\". \n                  Zelenskyy will cut a lonely figure without his towering chief of staff\n                 \n                  France reveals new national military service amid fears of Russian threat\n                 \n                  Who is negotiating the potential peace deal for the US, Russia and Ukraine?\n                  In his evening address on Saturday, the Ukrainian leader said: \"The American side is demonstrating a constructive approach, and in the coming days it is feasible to flesh out the steps to determine how to bring the war to a dignified end.\" Mr Zelenskyy's team in the US is without his former chief of staff and lead negotiator, Andrii Yermak, as he quit on Friday after officials raided his home amid a corruption scandal.  Tankers hit by 'Sea Baby' drones Ukrainian drones were shown hitting two of Russia's so-called \"shadow fleet\" oil tankers in the Black Sea in footage released on Saturday. Friday's attack was carried out by the country's security service and its navy, an official told Reuters. They said both ships \"sustained critical damage\" that took them out of service. A security source told Associated Press that domestically-made \"Sea Baby\" drones were used. The tankers were under sanctions and heading to a Russian port to load up with oil destined for foreign markets, the official said. They have been identified as the Kairos and Virat. Read more:Who is Steve Witkoff, the property mogul seeking a peace deal?Analysis: Trump's peace plan had Russian fingerprints all over it The 274m-long Kairos suffered an explosion and caught fire en route from Egypt to Russia on Friday, Turkey's transport ministry said. The crew was evacuated. The Virat was reportedly struck about 35 nautical miles offshore. It was attacked by unmanned vessels and sustained minor damage to its starboard side, the Turkish ministry said. Russia deploys a fleet of often ageing, uninsured and unmarked tankers to circumvent sanctions on its oil exports, which continue to help pay for the Ukraine war. Another Ukrainian attack halted operations at an oil terminal near the Russian port of Novorossiysk on Saturday.  Andriy Kovalenko, from Ukraine's National Security and Defence Council, said special forces were responsible. \"Naval drones managed to destroy one of the three oil tanker berths of the Caspian Pipeline Consortium in the Novorossiysk area,\" he wrote on Telegram. Six killed in aerial attacks on Ukraine Russia carried out another onslaught on the Ukrainian capital overnight into Saturday, firing 36 cruise and ballistic missiles and launching around 600 drones. Officials said three people were killed in and around Kyiv, two in the Dnipropetrovsk region and one in a midday attack in Kherson region in the south. Mayor Vitali Klitschko said 29 others were injured in Kyiv, largely due to falling debris from intercepted drones hitting buildings. The attacks also hit Ukrainian energy facilities and left hundreds of thousands without power in the capital. Supplies have since been restored. Targeting such infrastructure has become a familiar tactic from Russia over the winter, in what Ukraine officials say is the \"weaponising\" of the cold."
    },
    {
        "title": "Hong Kong mourns those lost to fire as investigators search for remains",
        "description": "Grief was not lonely today in Hong Kong. Three days after the worst fire in the history of modern Hong Kong, it feels as though it has barely sunk in.",
        "url": "https://news.sky.com/story/hong-kong-mourns-those-lost-to-fire-as-investigators-search-for-remains-13477236",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hong-kong-fire-flowers_7095878.jpg?20251129190304",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-11-29 18:47:00",
        "Headline": "Wednesday's blaze has claimed the lives of at least 128 people with dozens unaccounted for, making it Hong Kong's deadliest fire since 1948.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Grief was not lonely today in Hong Kong. Three days after the worst fire in the history of modern Hong Kong, it feels as though it has barely sunk in. The weekend at least lent them time to pay tribute, and gave them some space to reflect. People came in droves to lay flowers, so many a queuing system was needed. Official books of condolences were also set up in multiple parts of the city. It was the first day large teams of investigators were able to enter the site. Dozens of them in hazmat suits were bused in, their work the grimmest of tasks. Every so often you could see a flashlight peep through the window of an upper blackened window, a reminder that the fire services are still undertaking dangerous work. But the reach of the authorities is ramping up here. Yesterday a grass roots aid distribution centre was the vibrant heart of the response. They received notice at 4am that they needed to pack up and move on. By 10.30am, the mountains of donations were gone, residents watched on, bewildered. The task apparently will be handed over to professional NGOs. \"I think the government's biggest concern is due to some past incidents,\" one organiser tells us. \"They may liken this to previous events. The essence looks similar.\" She's careful with her words, but she's clearly hinting at major pro-democracy protests that were crushed by authorities in 2019. Any sort of mass gathering is now seen as a risk, the system is still very nervous. And they might well be because people here are angry. What, they ask, did the government know? What did it choose to ignore? Indeed, Sky News has learnt that residents raised their fears over fire safety connected to extensive renovations on Wang Fuk Court as early as September 2024. They flagged the suspected flammability of green nets being used to cover the building. An email response from the Labour Department was sent a few months later to Jason Poon, a civil engineer-turned-activist, who was working with residents. It insists that \"the mesh's flame retardant properties meet safety standards\". But many clearly didn't believe it. Posts spanning many months on a residents' Facebook group continued to voice their fears.  When a much smaller fire broke out in the city last month, one resident posted: \"All the materials outside are flammable, I feel really worried.\" \"I feel that same way\" another replied. \"The government has no sense of concern.\" For Poon, who dedicates much of his time to fighting lax safety standards in Hong Kong's construction industry, the whole experience has been devastating. \"They knew all the maintenance was using corner-cutting materials, but they didn't do anything,\" he says. \"This is a man-made disaster.\" We put these allegations to Hong Kong's Labour Department but they have not yet responded to our request for comment. Grief may still be the prominent force here, but anger is not that far behind."
    },
    {
        "title": "The family of a 14-year-old hit by a train say they will 'miss him forever'",
        "description": "The family of a talented footballer who died after being struck by a train say he had \"so much love to give\".",
        "url": "https://news.sky.com/story/the-family-of-a-14-year-old-hit-by-a-train-say-they-will-miss-him-forever-13476980",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-burton-joyce-nottinghamshire_7095408.jpg?20251129152620",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 15:02:00",
        "Headline": "Joshua Travis, 14, was struck by a train in Burton Joyce, Nottinghamshire, on Wednesday.",
        "Content": "The family of a talented footballer who died after being struck by a train say he had \"so much love to give\". The British Transport Police (BTP) said officers responded to reports of a casualty on the tracks in Burton Joyce, Nottinghamshire, just after 7pm on Wednesday. In a statement on Saturday, BTP said Joshua Travis, 14, died at the scene. His family said in a statement: \"Josh was a lad with an incredibly (sic) energy for life, an infectious and mischievous smile, kind sparkling eyes, and so much love to give. \"He leaves a gap in our lives that is and will always be impossible to fill, and we will miss him forever.\" Nottingham Forest Academy also paid tribute to the 14-year-old on social media, saying: \"Everyone at Nottingham Forest is deeply saddened to learn of the tragic passing of our former academy goalkeeper Josh Travis. \"Our thoughts are with Josh's family and friends at this extremely difficult time.\" Aspire Football Coaching said on Facebook that it will postpone all of its games after the death of Travis - their under-15s goalkeeper. \"Josh was a fantastic goalkeeper and a great character in the group,\" the coaching school added. \"Everybody that came across Josh described him as a pleasure to have around with his polite and funny nature. \"Josh made a real impact in his age group, both as a footballer but more importantly as a person and will be sorely missed at the club.\" Read more from Sky News:Dozens of flood alerts across England and WalesLuke Littler reflects on his rise to famePM's rap battle with Sky's Beth Rigby goes viral The BTP said in a statement that the incident is not being treated as suspicious. Sky News has contacted the Rail Accident Investigation Branch for comment."
    },
    {
        "title": "Legendary playwright Sir Tom Stoppard has died",
        "description": "Playwright Sir Tom Stoppard, who won an Oscar and a Golden Globe for Shakespeare In Love, has died at the age of 88.",
        "url": "https://news.sky.com/story/playwright-sir-tom-stoppard-has-died-13476935",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tom-stoppard-westminster-abbey_7095644.jpg?20251129172823",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 14:09:00",
        "Headline": "Sir Tom received countless accolades and honours during his lengthy career, including being knighted by the late Queen for his services to literature in 1997.",
        "Content": "Playwright Sir Tom Stoppard, who won an Oscar and a Golden Globe for Shakespeare In Love, has died at the age of 88. A statement from United Agents said: \"We are deeply saddened to announce that our beloved client and friend, Tom Stoppard, has died peacefully at home in Dorset, surrounded by his family. \"He will be remembered for his works, for their brilliance and humanity, and for his wit, his irreverence, his generosity of spirit and his profound love of the English language. \"It was an honour to work with Tom and to know him.\" King Charles said in a tribute: \"My wife and I are deeply saddened to learn of the death of one of our greatest writers, Sir Tom Stoppard. A dear friend who wore his genius lightly, he could, and did, turn his pen to any subject, challenging, moving and inspiring his audiences, borne from his own personal history. \"We send our most heartfelt sympathy to his beloved family. Let us all take comfort in his immortal line: 'Look on every exit as being an entrance somewhere else'.\" Sir Tom's entertainment career spanned more than six decades, in which he won a host of Tony and Olivier awards, as well as the Golden Globe and Academy Award with Marc Norman for their 1998 screenplay Shakespeare In Love - starring fellow Oscar-winner Gwyneth Paltrow. \n                  UK weather: Dozens of flood alerts in place across England and Wales amid warning of heavy rainfall\n                 \n                  Asylum seekers to be banned from using taxis for medical appointments\n                 \n                  Your Party co-founder Zarah Sultana refuses to enter group's conference hall\n                 His work, known to blend intellect, emotion and humour, often explored philosophical and political themes, challenging societal norms to remind audiences of the power of thought. His other award-winning plays included Rosencrantz And Guildenstern Are Dead, The Real Thing and Travesties. The playwright also wrote prolifically for TV, radio and film, including adapting Leo Tolstoy's novel Anna Karenina for the 2012 film starring Keira Knightley and Jude Law, and TV series Parade's End with Benedict Cumberbatch and Rebecca Hall - adapted from novels by Ford Madox Ford. He received countless accolades and honours during his career, including being knighted by the late Queen for his services to literature in 1997. He won the David Cohen Prize For Literature in 2017, following in the footsteps of laureates Harold Pinter, Hilary Mantel and Seamus Heaney. Sir Tom released his semi-autobiographical work titled Leopoldstadt in 2020 - set in the Jewish quarter of early 20th century Vienna - which later won him an Olivier award for best new play and also scooped four Tony awards. The West End play, which featured his son Ed Stoppard, also saw him honoured by PEN America, the literary and human rights organisation, which handed him the Mike Nichols Writing for Performance Award. From refugee to playwrighting sensation Sir Tom was born Tomas Straussler in Czechoslovakia, but fled and changed his name amid the Nazi occupation, finding refuge in Britain in 1946. He became a journalist in Bristol in 1954 before becoming a theatre critic and writing plays for radio and TV, including The Stand-Ins, later revised as The Real Inspector Hound, and Albert's Bridge first broadcast by BBC Radio. His career took off with hit play Rosencrantz And Guildenstern Are Dead, which premiered at the Edinburgh Fringe Festival in 1966, before it was produced for the National Theatre and on Broadway, winning four Tony awards in 1968 including best play. Sir Tom began advocating on behalf of Soviet and Eastern Bloc dissidents after writing Every Good Boy Deserves Favour, a play inspired by his friendship with Viktor Fainberg, who had been imprisoned in Czechoslovakia by the Soviets. Much later, in 2002, his trilogy of plays set in 19th century Russia, The Coast Of Utopia, were staged at the National Theatre. His most recent plays include Heroes, Rock 'n' Roll and The Hard Problem."
    },
    {
        "title": "Two brothers killed in Israeli drone strike on Gaza",
        "description": "An Israeli drone strike has killed two Palestinian children in southern Gaza, a hospital reported.",
        "url": "https://news.sky.com/story/two-brothers-killed-in-israeli-drone-strike-on-gaza-13477104",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israel-palestine_7095647.jpg?20251129172930",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 17:18:00",
        "Headline": "Fadi Abu Assi, 11, and Goma Abu Assi, eight, were gathering firewood at the time, their uncle said.",
        "Content": "An Israeli drone strike has killed two Palestinian children in southern Gaza, a hospital reported. The two brothers died when a drone struck close to a school sheltering displaced people near Beni Suhaila, staff at Nasser Hospital said. The boys, Fadi Abu Assi, 11, and Goma Abu Assi, eight, were gathering firewood for their wheelchair-bound father, according to their uncle, Mohamed Abu Assi. He said: \"They are children...what did they do? They do not have missiles or bombs, they went to gather wood for their father so he can start a fire.\" At the funeral, the boys' father wept over one of his children, whose white shroud was peeled back to show his face. Asked for comment by Sky News, the IDF responded: \"Earlier today, IDF troops identified two suspects who crossed the yellow line, conducted suspicious activities on the ground, and approached IDF troops operating in the southern Gaza Strip, posing an immediate threat to them. \"Following the identification, the IAF eliminated the suspects in order to remove the threat.\" \n                  Talks begin on the next phase of Gaza ceasefire deal as Hamas and Israel hand over remains\n                 \n                  Controversial US and Israeli-backed aid operation the Gaza Humanitarian Foundation to close\n                 \n                  Israel launches strikes on Gaza in further test of fragile ceasefire\n                 It comes less than two months after a 20-point peace deal, brokered by US President Donald Trump, took effect in October. Now Hamas is calling on mediators to pressure Israel to stop violating the ceasefire. Israel, which accuses Hamas of breaking the ceasefire itself, says its strikes are aimed at militants violating the truce. At least 352 Palestinians have been killed since the ceasefire took effect on October 10, according to Gaza's Health Ministry.  The Hamas-run ministry, which does not differentiate between civilians and combatants, says the death toll from Israel's offensive in Gaza has now passed 70,000. Israeli officials have questioned the accuracy of the figures, accusing Hamas of exaggerating the numbers, though the militant group denies this. Read more:'Almost two children a day killed in Gaza'Gaza: It's impossible to imagine people still living here The health ministry says it had refrained from adding thousands of reported deaths to the official tally pending further checks. Now with a shaky ceasefire in effect, officials claim they can take advantage of the relative calm to search for the dead. The UN has previously described the ministry's figures as \"credible\"."
    },
    {
        "title": "Venezuela accuses Trump of 'colonial threat' after US president 'closes' its airspace ",
        "description": "Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\".",
        "url": "https://news.sky.com/story/trump-closes-airspace-above-and-surrounding-venezuela-13476971",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/d03e6721ce603019af90a0108dc7a01e31949e7f5ebcf8d10301bb35b6fb52d7_7091997.jpg?20251125224122",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 14:48:00",
        "Headline": "The US president made the announcement on Truth Social amid a growing row over drug trafficking with Venezuelan counterpart Nicolas Maduro.",
        "Content": " Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\". Mr Trump made the declaration amid growing tensions with President Maduro - and as the US continues attacking boats it claims are carrying drugs from Venezuela. He wrote on Truth Social: \"To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY.\" Venezuela's foreign affairs office called it a \"colonial threat\" and \"illegal, and unjustified aggression\". It accused the president of threatening \"the sovereignty of the national airspace... and the full sovereignty of the Venezuelan state\". President Trump's words were part of a \"permanent policy of aggression against our country\" that breached international law and the UN Charter, it added. The US leader's post comes after the American aviation regulator warned of a \"potentially hazardous situation\" over Venezuela due to a \"worsening security situation\". The South American nation revoked operating rights for six major airlines that went on to suspend flights to the country. Mr Trump warned this week that land operations against suspected Venezuelan drug traffickers would begin \"very soon\". Such a move would be a major escalation in Operation Southern Spear - the US naval deployment in the Caribbean Sea and eastern Pacific that's so far attacked at least 21 vessels.  Venezuela has said the attacks, which have killed more than 80 people, amount to murder. The US has released videos of boats being targeted, but hasn't provided evidence - such as photos of their cargo - to support the smuggling claims. Read more:Trump may have another motive in war on drugsThe US-Venezuela crisis explained  The Pentagon has sought to justify the strikes by labelling the drug gangs as \"foreign terrorist organisations\" - putting them on par with the likes of al Qaeda. It claims the boats targeted are carrying drugs bound for the US, although Sky's chief correspondent says the final destination is likely to be Europe and West Africa. President Maduro has also denied Mr Trump's claims he is involved in the drugs trade himself, and said his counterpart wants to oust him so he can install a more sympathetic government. Venezuelan officials have also claimed Mr Trump's true motivation is access to the country's plentiful oil reserves. Mr Maduro is widely considered a dictator who's cheated elections and has been president since 2013."
    },
    {
        "title": "UK weather: Dozens of flood alerts in place across England and Wales amid warning of heavy rainfall",
        "description": "Dozens of flood alerts have been issued across England and Wales amid a warning of heavy rainfall.",
        "url": "https://news.sky.com/story/uk-weather-dozens-of-flood-alerts-in-place-across-england-and-wales-amid-warning-of-heavy-rainfall-13476917",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-car-blur_7095224.jpg?20251129131626",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-29 13:38:00",
        "Headline": "Up to 30mm of rain could fall \"fairly widely\" on Saturday, the Met Office predicted, with as much as 60mm possible over higher ground.",
        "Content": "Dozens of flood alerts have been issued across England and Wales amid a warning of heavy rainfall. The Environment Agency has 35 flood alerts in place for rivers in England, while Natural Resources Wales has another 10 in force as of midday on Saturday. Alerts mean flooding is possible. It comes as the Met Office has a yellow weather warning in place for rain in the East Midlands, North East England and Yorkshire and Humber on Saturday. Up to 30mm could fall \"fairly widely\", the agency predicted, with as much as 60mm possible over higher ground. A yellow warning for ice is also in place for large parts of northern England overnight into Sunday. Check the weather forecast where you are There is also a yellow warning for rain on Monday covering North West England, Hampshire, South West England and Wales. Up to 40mm is likely to fall quite widely for Derbyshire, North West England, and Yorkshire and Humber, and there could be as much as 120mm in a few places over the Cumbrian fells, the Met Office said. In South West England, there could be up to 50mm \"across the higher parts of Exmoor, Dorset, the Mendips and Cotswolds\". Also for Monday, there is a more serious amber warning for rain in South Wales all day, with 120mm possible in a few places. Homes and businesses could be flooded, the agency said, and there may be travel disruption and difficult driving conditions. England and Wales normally averages just over 100mm of rainfall for the entire month of November. Jason Kelly, chief meteorologist at the Met Office, said: \"There is a clear signal for strong winds and periods of heavy rain, which could lead to surface water flooding and delays to road and rail travel. \"Rain will also push into North East England during Saturday, some of which could fall as snow over higher ground when the system meets colder air coming down from the north. \"Sunday will be drier and brighter, albeit colder, for many areas with blustery winds lingering near some North Sea coasts. Expect widespread frost overnight into Monday before the next weather system approaches.\" Read more from Sky News:National prostate cancer screening not recommended on NHSBritish passenger missing after falling from cruise ship Next week, the weather is expected to remain changeable, with occasional dry spells. Homes across Scotland left without power It comes after homes across Scotland were left without power following severe gales overnight. The Met Office had issued a yellow weather warning for wind, covering Orkney, Shetland and western parts of the Highlands and Argyll and Bute, which expired at 11am on Friday. Scottish and Southern Electricity Networks said gusts reached 83mph on the Western Isles and 75mph on the Isle of Mull. A spokesperson said around 1,000 homes on the Isle of Mull were without power by mid-morning on Friday, but most have since been restored."
    },
    {
        "title": "Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit",
        "description": "Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised &#163;26bn in taxes.",
        "url": "https://news.sky.com/story/budget-2025-chancellor-rachel-reeves-fighting-claims-she-lied-about-deficit-13477021",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092361.jpg?20251126113017",
        "type": "Home",
        "Author": "Tamara Cohen",
        "Date Published": "2025-11-29 16:16:00",
        "Headline": "The chancellor is under pressure after Treasury forecasters revealed public finances showed a £4.2bn surplus, while Rachel Reeves was pointing to a significant black hole that she needed to fill in this week's package of measures.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised £26bn in taxes. It follows a letter published by the Office for Budget Responsibility (OBR), the official watchdog which draws up forecasts for the Treasury, published on Friday. In it, OBR chair Richard Hughes (who is already under fire for the leak of the budget measures) said he'd taken the unusual step of revealing the forecasts it had submitted to Rachel Reeves in the 10 weeks before the budget, and which is normally shrouded in secrecy. The letter reveals this timeline, which has plunged the chancellor into trouble: 17 September - first forecast At this point, it was already known that the UK's growth forecast would be downgraded. The chancellor was told that the \"increases in real wages and inflation\" would offset the impact of the downgrade. The deficit forecast by the end of the parliament was £2.5bn. 20 October - second forecast \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 By this point, that deficit had turned into a small surplus of £2.1bn - i.e. the productivity downgrade has been wiped out and \"both of the government's fiscal targets were on course to be met\". 31 October - third forecast The final one before the Treasury put forward its measures. The finances were now net positive with a £4.2bn surplus. But the accusation is that Rachel Reeves was presenting an entirely different picture - that she had a significant black hole which needed to be filled. 13 October Ms Reeves tells Sky's deputy political editor Sam Coates the productivity downgrade has been challenging but added: \"I won't duck those challenges. Of course we're looking at tax and spending.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 27 October With the Treasury now aware the deficit had been wiped out, the Financial Times was briefed about a \"£20bn hit to public finances.\" 4 November Ms Reeves gave a dawn news conference in Downing Street, setting the stage for tax rises. She says she wants people \"to understand the circumstances we are facing... productivity performance is weaker than previously thought,\" adding that \"we will all have to contribute\". 10 November Ms Reeves tells BBC 5Live that sticking to Labour's promises not to raise taxes would require \"things like deep cuts in capital spending\". The stage seemed set for the nuclear option - the first income tax rise in decades. 13 November After headlines about a plot to oust Prime Minister Sir Keir Starmer, the Financial Times reported that the chancellor had dropped plans to raise income tax because of improved forecasts [which we now know hadn't changed since 31 October], putting the black hole closer to £20bn than £30bn.   The prime minister's spokesperson has insisted Rachel Reeves did not mislead voters and set out her choices, and the reasons for them, at the budget. But the issue has had enormous cut-through, with newspapers giving it top billing. The Sun's Saturday front page headline - \"Chancer of the Exchequer - fury at Reeves 'lies' over £30bn black hole\" - will not have been pleasant reading for ministers. She now has questions to answer about the chaotic run-up to the budget - of briefing and counter-briefing, which critics say now makes little sense. Tory leader Kemi Badenoch said on Saturday: \"We have learned that the chancellor misrepresented the OBR's forecasts. She sold her 'Benefits Street' budget on a lie. Honesty matters... she has to go.\" Economist Paul Johnson, former director of the respected Institute for Fiscal Studies (IFS), told The Times the chancellor's 4 November news briefing \"probably was misleading. It was clearly intended to have an impact and confirm what independent forecasters like [the National Institute of Economic and Social Research] and the IFS had been saying. \"It was designed to confirm a narrative that there was a fiscal hole that needed to be filled with significant tax rises. In fact, as she knew at the time, no such hole existed.\" Read more on budget fallout:Reeves accused over forecastsHospitality 'needs a lifeline' Rachel Reeves is doing a round of morning interviews on Sunday in which she'll be grilled over which of her budget measures will generate economic growth (which the government claimed was its number one priority), why they have been unable to tackle rising welfare spending and now about why markets and voters were left confused by dire warnings. She may claim that she never personally said there was a specific £30bn black hole or that the extra headroom generated by the tax rises will ensure she does not have to come back for more next year. In an interview with The Saturday's Guardian, Ms Reeves said she had \"chosen to protect public spending\" on schools and hospitals in the budget. She confirmed an income tax rise had been looked at, and insisted that OBR forecasts \"move around\" after the Treasury has submitted its planned measures. There are plenty more questions to come."
    },
    {
        "title": "UK weather: Dozens of flood alerts in place across England and Wales amid warning of heavy rainfall",
        "description": "Dozens of flood alerts have been issued across England and Wales amid a warning of heavy rainfall.",
        "url": "https://news.sky.com/story/uk-weather-dozens-of-flood-alerts-in-place-across-england-and-wales-amid-warning-of-heavy-rainfall-13476917",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-car-blur_7095224.jpg?20251129131626",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 13:38:00",
        "Headline": "Up to 30mm of rain could fall \"fairly widely\" on Saturday, the Met Office predicted, with as much as 60mm possible over higher ground.",
        "Content": "Dozens of flood alerts have been issued across England and Wales amid a warning of heavy rainfall. The Environment Agency has 35 flood alerts in place for rivers in England, while Natural Resources Wales has another 10 in force as of midday on Saturday. Alerts mean flooding is possible. It comes as the Met Office has a yellow weather warning in place for rain in the East Midlands, North East England and Yorkshire and Humber on Saturday. Up to 30mm could fall \"fairly widely\", the agency predicted, with as much as 60mm possible over higher ground. A yellow warning for ice is also in place for large parts of northern England overnight into Sunday. Check the weather forecast where you are There is also a yellow warning for rain on Monday covering North West England, Hampshire, South West England and Wales. Up to 40mm is likely to fall quite widely for Derbyshire, North West England, and Yorkshire and Humber, and there could be as much as 120mm in a few places over the Cumbrian fells, the Met Office said. In South West England, there could be up to 50mm \"across the higher parts of Exmoor, Dorset, the Mendips and Cotswolds\". Also for Monday, there is a more serious amber warning for rain in South Wales all day, with 120mm possible in a few places. Homes and businesses could be flooded, the agency said, and there may be travel disruption and difficult driving conditions. England and Wales normally averages just over 100mm of rainfall for the entire month of November. Jason Kelly, chief meteorologist at the Met Office, said: \"There is a clear signal for strong winds and periods of heavy rain, which could lead to surface water flooding and delays to road and rail travel. \"Rain will also push into North East England during Saturday, some of which could fall as snow over higher ground when the system meets colder air coming down from the north. \"Sunday will be drier and brighter, albeit colder, for many areas with blustery winds lingering near some North Sea coasts. Expect widespread frost overnight into Monday before the next weather system approaches.\" Read more from Sky News:National prostate cancer screening not recommended on NHSBritish passenger missing after falling from cruise ship Next week, the weather is expected to remain changeable, with occasional dry spells. Homes across Scotland left without power It comes after homes across Scotland were left without power following severe gales overnight. The Met Office had issued a yellow weather warning for wind, covering Orkney, Shetland and western parts of the Highlands and Argyll and Bute, which expired at 11am on Friday. Scottish and Southern Electricity Networks said gusts reached 83mph on the Western Isles and 75mph on the Isle of Mull. A spokesperson said around 1,000 homes on the Isle of Mull were without power by mid-morning on Friday, but most have since been restored."
    },
    {
        "title": "Asylum seekers to be banned from using taxis for medical appointments",
        "description": "A ban on asylum seekers using taxis for most medical journeys has been announced by Home Secretary Shabana Mahmood.",
        "url": "https://news.sky.com/story/asylum-seekers-to-be-banned-from-using-taxis-for-medical-appointments-13476875",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-taxis-uk-general_7095134.jpg?20251129095419",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 09:41:00",
        "Headline": "Home Secretary Shabana Mahmood has said she is \"ending the unrestricted use\" of taxis by asylum seekers for hospital appointments.",
        "Content": "A ban on asylum seekers using taxis for most medical journeys has been announced by Home Secretary Shabana Mahmood. Under the new rules, taxi use for medical travel will be restricted to \"exceptional\" cases such as physical disability, pregnancy or serious illness - and these will require government approval. Ms Mahmood made the announcement after a BBC investigation found \"widespread\" use of taxis by asylum seekers, including for long journeys - with one case involving a 250-mile trip to see a GP. Transport for asylum seekers has cost the government an average of almost £16m a year, according to reports. All service providers will be required to stop using taxis for medical journeys from February next year and the government is now working to help introduce alternatives such as public transport. \"This government inherited Conservative contracts that are wasting billions of taxpayers' hard-earned cash,\" the home secretary said. \"I am ending the unrestricted use of taxis by asylum seekers for hospital appointments, authorising them only in the most exceptional circumstances. \"I will continue to root out waste as we close every single asylum hotel.\" Taxi drivers said the system was open to \"abuse\", accusing sub-contractors of inflating mileage, for instance by dispatching drivers over long distances to perform much shorter journeys. One told BBC Radio 4's Today programme he had been dispatched from Gatwick to take an asylum seeker more than 50 miles away in Reading to an appointment only 1.5 miles from his hotel. A second driver was reportedly sent from Heathrow, about 30 miles away, to bring the same man back from the appointment. The policy change comes after a Home Office review of transport arrangements for asylum seekers, it is understood. Asylum system overhaul It comes after a raft of measures to overhaul the asylum system was set out by Ms Mahmood earlier in November. In an interview with Sky News' political editor Beth Rigby, she admitted the UK's illegal immigrant numbers were \"too high\" - but said Reform UK leader Nigel Farage could \"sod off\" after he claimed she sounded like a Reform supporter. Read more:Britain's immigration system changes explainedHow the UK and Denmark's immigration policies compareAnalysis: The new hard woman of British politics  The \"restoring order and control\" plan includes: • The removal of more families with children - either voluntarily through cash incentives up to £3,000, or by force;• Quadrupling the time successful asylum seekers must wait to claim permanent residency, from five to 20 years;• Removing the legal obligation to provide financial support for those who have the right to work but choose not to;• Setting up a new appeals body to significantly speed up the time it takes to decide whether to refuse an application;• Reforming how the European Convention on Human Rights (ECHR) is interpreted in immigration cases;• Banning visas for countries refusing to accept deportees;• The establishment of new safe and legal refugee routes. The home secretary told MPs it is an \"uncomfortable truth\" that Britain's generous asylum offer, compared with other European countries, is attracting people to the UK - and for British taxpayers the system \"feels out of control and unfair\". However, the wide-ranging reforms have drawn criticism from Labour backbenchers. Nadia Whittome MP called Ms Mahmood's plans \"dystopian\" and \"shameful\", while Richard Burgon MP said she should change course rather than be forced into a U-turn later. So far this year, some 39,292 people have made the journey across the Channel, already more than last year's numbers, but still below the total for the record year of 2022."
    },
    {
        "title": "Your Party co-founder Zarah Sultana refuses to enter group's conference hall",
        "description": "Zarah Sultana has boycotted day one of the Your Party conference over the expulsion of members of left-wing groups.",
        "url": "https://news.sky.com/story/zarah-sultana-boycotts-first-day-of-your-party-conference-over-witch-hunt-expulsions-13476925",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/431f60b611b1fa5cea03bb52f5ee63ebce66bab0bee4ddf24c501d4532493503_7095053.jpg?20251129063138",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-11-29 13:45:00",
        "Headline": "Your Party's \"historic\" founding conference has descended into chaos on day one as one of its co-founders stages a boycott over claims of a \"purge\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Zarah Sultana has boycotted day one of the Your Party conference over the expulsion of members of left-wing groups. Ms Sultana co-founded Your Party with Jeremy Corbyn in July, but the new movement has been marred with infighting from the outset. There was a row on the eve of conference after it emerged members of the Socialist Workers Party (SWP) had been expelled from Your Party, as its rules do not permit dual membership. However, a spokesperson for Ms Sultana branded this a \"witch hunt\" and said she won't be returning until her speech tomorrow. She said: \"Zarah met members outside the conference and condemned the recent expulsions. This witch hunt is indefensible. We must build a party that welcomes all socialists. She will not be entering the conference hall today.\" Ms Sultana later told Sky News the orchestrators of that witch hunt were \"nameless, faceless bureaucrats\" close to Mr Corbyn. However, she insisted she was not walking away and that her and the former Labour leader are \"definitely friends\". \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 \n                  Why has there been so much tension in Your Party?\n                 When asked the same question yesterday, Mr Corbyn said they were \"colleagues\". The pair have previously clashed over the party's structure. Your Party has also faced rows over its finances and policy positions, with two MPs quitting over a \"toxic culture\" in recent weeks. This conference is aimed at turning a new page and getting the party primed to fight the local elections in May. Your Party 'turning on socialists' Members of the SWP argue dual membership should be allowed as the SWP doesn't field election candidates. Lewis Nieslen, the SWP's national secretary, was expelled on Friday as he was on his way to Liverpool, where the conference is being hosted. Read more:Why has there been so much tension in Your Party? He told Sky News: \"With far-right Reform UK topping the polls and Starmer paving the way for them, we urgently need a new party that unites the whole left. \"It's wrong for those at the top of Your Party to turn fire on socialists like us who have been key to building Your Party on the ground, and are determined to make it the insurgent, inspiring force it can be.\"  Members of the socialist organisation Counterfire have also been banned from the conference, Sky News has learned. Cllr Michael Lavalette, who helped set up Your Party's Preston branch, told Sky News earlier this morning that he was not allowed to enter the venue today. He said he was told there is intelligence Counterfire was going to be disruptive, which he said is \"simply not true\". \"Counterfire is a very pro-Your Party organisation so I am not sure where that has come from,\" he said. He said it would be interesting to see the alleged intelligence \"because I've never said anything disruptive, I've been encouraging people to come\". Purge claims 'false' Ms Sultana has been advocating for what she calls \"maximum member democracy\" and believes anyone who is a socialist should be allowed in Your Party even if they are members of other parties. Her allies see the expulsions as an attempt to purge those supportive of her. There are many grassroots left-wing groups who want Your Party to be led by members rather than a single MP, a position Ms Sultana supports. Those groups have hit out at a \"clique\" of people close to Mr Corbyn from his days as Labour leader, who they accuse of making decisions without members' consent. However, a Your Party spokesperson said claims of a purge are \"false\". They said: \"Members of another national political party signed up to Your Party in contravention of clearly-stated membership rules - and these rules were enforced.\" They added: \"We're focused on hosting a democratic founding conference with thousands of members coming together to debate and decide the big issues. This is politics outside the Westminster mould: from the ground up, not the top down.\" Ms Sultana was not due to address the conference today with her speech coming on Sunday afternoon. A source close to her said she was still \"very much looking forward to it\". They added that it was an \"interesting\" choice of programming, giving voting on the party's key issues - including whether dual membership should be allowed - will be closed by the time she gives her keynote address, unlike Mr Corbyn who spoke this morning. Ms Sultana was not involved in organising the conference and claims she was frozen out of the process. But those in Mr Corbyn's camp claim she froze herself out when she quit the independent alliance (IA), the group of independent MPs and volunteers close to the former Labour leader, who have been stewarding the party's founding process leading up to the conference this weekend. Ms Sultana previously accused that group of being a \"sexist boys club\", in a major row in September that saw her launch an unauthorised membership portal and nearly upended the entire project.  Mr Corbyn acknowledged \"stresses and strains\" in the set-up of the party saying it had become \"a lot better in the last few days and weeks and we're going to get through this weekend\". Asked if they were friends, Mr Corbyn said they were \"colleagues in parliament, and we obviously communicate and so on\". The pair appeared at separate events on the eve of the party's inaugural gathering."
    },
    {
        "title": "Man from Afghanistan appears in court charged with three sexual assaults in Southampton",
        "description": "A man from Afghanistan has appeared in court charged with sexually assaulting three women in Southampton, as well as entering the UK illegally.",
        "url": "https://news.sky.com/story/man-from-afghanistan-charged-with-three-sexual-assaults-in-southampton-13476874",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-southampton-upper-shaftesbury_7095148.jpg?20251129103210",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 09:41:00",
        "Headline": "Sohail Amiri, 30, has also been charged with illegally entering the UK.",
        "Content": "A man from Afghanistan has appeared in court charged with sexually assaulting three women in Southampton, as well as entering the UK illegally. Sohail Amiri, 30, is accused of approaching a woman and trying to kiss her in Upper Shaftesbury Avenue on Tuesday. He also faces two sexual assault charges relating to incidents on 23 September, when he allegedly made inappropriate comments and approaches to two women in Westwood Road. Amiri appeared at Southampton Magistrates' Court on Saturday. A Hampshire Constabulary spokesman said: \"Officers investigating three reports of sexual assaults on women in Portswood and Bevois have charged a man. \"The charges follow an incident which occurred in Upper Shaftesbury Avenue in the early hours of Tuesday. \"It was reported a woman was walking along the road just after midnight when she was approached by a man she did not know who is alleged to have then tried to kiss her. \n                  MoD hasn't done enough to prevent further data breaches following Afghan leak, MPs say\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 \n                  Afghanistan to boycott Twenty20 cricket tri-series in Pakistan after 'strike killed three local players'\n                 \"She was able to force him off and run away.\" Amiri, of Highfield Lane, Southampton, has also been charged with entering the United Kingdom without leave contrary to Section 24 of the Immigration Act 1971. Highfield House Hotel in Highfield Lane, Portswood, has been subject to repeated anti-immigration protests. Amiri was remanded in custody and is due to appear at the city's crown court on 5 January."
    },
    {
        "title": "Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit",
        "description": "Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised &#163;26bn in taxes.",
        "url": "https://news.sky.com/story/budget-2025-chancellor-rachel-reeves-fighting-claims-she-lied-about-deficit-13477021",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092361.jpg?20251126113017",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-11-29 16:16:00",
        "Headline": "The chancellor is under pressure after Treasury forecasters revealed public finances showed a £4.2bn surplus, while Rachel Reeves was pointing to a significant black hole that she needed to fill in this week's package of measures.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised £26bn in taxes. It follows a letter published by the Office for Budget Responsibility (OBR), the official watchdog which draws up forecasts for the Treasury, published on Friday. In it, OBR chair Richard Hughes (who is already under fire for the leak of the budget measures) said he'd taken the unusual step of revealing the forecasts it had submitted to Rachel Reeves in the 10 weeks before the budget, and which is normally shrouded in secrecy. The letter reveals this timeline, which has plunged the chancellor into trouble: 17 September - first forecast At this point, it was already known that the UK's growth forecast would be downgraded. The chancellor was told that the \"increases in real wages and inflation\" would offset the impact of the downgrade. The deficit forecast by the end of the parliament was £2.5bn. 20 October - second forecast \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 By this point, that deficit had turned into a small surplus of £2.1bn - i.e. the productivity downgrade has been wiped out and \"both of the government's fiscal targets were on course to be met\". 31 October - third forecast The final one before the Treasury put forward its measures. The finances were now net positive with a £4.2bn surplus. But the accusation is that Rachel Reeves was presenting an entirely different picture - that she had a significant black hole which needed to be filled. 13 October Ms Reeves tells Sky's deputy political editor Sam Coates the productivity downgrade has been challenging but added: \"I won't duck those challenges. Of course we're looking at tax and spending.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 27 October With the Treasury now aware the deficit had been wiped out, the Financial Times was briefed about a \"£20bn hit to public finances.\" 4 November Ms Reeves gave a dawn news conference in Downing Street, setting the stage for tax rises. She says she wants people \"to understand the circumstances we are facing... productivity performance is weaker than previously thought,\" adding that \"we will all have to contribute\". 10 November Ms Reeves tells BBC 5Live that sticking to Labour's promises not to raise taxes would require \"things like deep cuts in capital spending\". The stage seemed set for the nuclear option - the first income tax rise in decades. 13 November After headlines about a plot to oust Prime Minister Sir Keir Starmer, the Financial Times reported that the chancellor had dropped plans to raise income tax because of improved forecasts [which we now know hadn't changed since 31 October], putting the black hole closer to £20bn than £30bn.   The prime minister's spokesperson has insisted Rachel Reeves did not mislead voters and set out her choices, and the reasons for them, at the budget. But the issue has had enormous cut-through, with newspapers giving it top billing. The Sun's Saturday front page headline - \"Chancer of the Exchequer - fury at Reeves 'lies' over £30bn black hole\" - will not have been pleasant reading for ministers. She now has questions to answer about the chaotic run-up to the budget - of briefing and counter-briefing, which critics say now makes little sense. Tory leader Kemi Badenoch said on Saturday: \"We have learned that the chancellor misrepresented the OBR's forecasts. She sold her 'Benefits Street' budget on a lie. Honesty matters... she has to go.\" Economist Paul Johnson, former director of the respected Institute for Fiscal Studies (IFS), told The Times the chancellor's 4 November news briefing \"probably was misleading. It was clearly intended to have an impact and confirm what independent forecasters like [the National Institute of Economic and Social Research] and the IFS had been saying. \"It was designed to confirm a narrative that there was a fiscal hole that needed to be filled with significant tax rises. In fact, as she knew at the time, no such hole existed.\" Read more on budget fallout:Reeves accused over forecastsHospitality 'needs a lifeline' Rachel Reeves is doing a round of morning interviews on Sunday in which she'll be grilled over which of her budget measures will generate economic growth (which the government claimed was its number one priority), why they have been unable to tackle rising welfare spending and now about why markets and voters were left confused by dire warnings. She may claim that she never personally said there was a specific £30bn black hole or that the extra headroom generated by the tax rises will ensure she does not have to come back for more next year. In an interview with The Saturday's Guardian, Ms Reeves said she had \"chosen to protect public spending\" on schools and hospitals in the budget. She confirmed an income tax rise had been looked at, and insisted that OBR forecasts \"move around\" after the Treasury has submitted its planned measures. There are plenty more questions to come."
    },
    {
        "title": "Legendary playwright Sir Tom Stoppard has died",
        "description": "Playwright Sir Tom Stoppard, who won an Oscar and a Golden Globe for Shakespeare In Love, has died at the age of 88.",
        "url": "https://news.sky.com/story/playwright-sir-tom-stoppard-has-died-13476935",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tom-stoppard-westminster-abbey_7095644.jpg?20251129172823",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 14:09:00",
        "Headline": "Sir Tom received countless accolades and honours during his lengthy career, including being knighted by the late Queen for his services to literature in 1997.",
        "Content": "Playwright Sir Tom Stoppard, who won an Oscar and a Golden Globe for Shakespeare In Love, has died at the age of 88. A statement from United Agents said: \"We are deeply saddened to announce that our beloved client and friend, Tom Stoppard, has died peacefully at home in Dorset, surrounded by his family. \"He will be remembered for his works, for their brilliance and humanity, and for his wit, his irreverence, his generosity of spirit and his profound love of the English language. \"It was an honour to work with Tom and to know him.\" King Charles said in a tribute: \"My wife and I are deeply saddened to learn of the death of one of our greatest writers, Sir Tom Stoppard. A dear friend who wore his genius lightly, he could, and did, turn his pen to any subject, challenging, moving and inspiring his audiences, borne from his own personal history. \"We send our most heartfelt sympathy to his beloved family. Let us all take comfort in his immortal line: 'Look on every exit as being an entrance somewhere else'.\" Sir Tom's entertainment career spanned more than six decades, in which he won a host of Tony and Olivier awards, as well as the Golden Globe and Academy Award with Marc Norman for their 1998 screenplay Shakespeare In Love - starring fellow Oscar-winner Gwyneth Paltrow. \n                  UK weather: Dozens of flood alerts in place across England and Wales amid warning of heavy rainfall\n                 \n                  Asylum seekers to be banned from using taxis for medical appointments\n                 \n                  Your Party co-founder Zarah Sultana refuses to enter group's conference hall\n                 His work, known to blend intellect, emotion and humour, often explored philosophical and political themes, challenging societal norms to remind audiences of the power of thought. His other award-winning plays included Rosencrantz And Guildenstern Are Dead, The Real Thing and Travesties. The playwright also wrote prolifically for TV, radio and film, including adapting Leo Tolstoy's novel Anna Karenina for the 2012 film starring Keira Knightley and Jude Law, and TV series Parade's End with Benedict Cumberbatch and Rebecca Hall - adapted from novels by Ford Madox Ford. He received countless accolades and honours during his career, including being knighted by the late Queen for his services to literature in 1997. He won the David Cohen Prize For Literature in 2017, following in the footsteps of laureates Harold Pinter, Hilary Mantel and Seamus Heaney. Sir Tom released his semi-autobiographical work titled Leopoldstadt in 2020 - set in the Jewish quarter of early 20th century Vienna - which later won him an Olivier award for best new play and also scooped four Tony awards. The West End play, which featured his son Ed Stoppard, also saw him honoured by PEN America, the literary and human rights organisation, which handed him the Mike Nichols Writing for Performance Award. From refugee to playwrighting sensation Sir Tom was born Tomas Straussler in Czechoslovakia, but fled and changed his name amid the Nazi occupation, finding refuge in Britain in 1946. He became a journalist in Bristol in 1954 before becoming a theatre critic and writing plays for radio and TV, including The Stand-Ins, later revised as The Real Inspector Hound, and Albert's Bridge first broadcast by BBC Radio. His career took off with hit play Rosencrantz And Guildenstern Are Dead, which premiered at the Edinburgh Fringe Festival in 1966, before it was produced for the National Theatre and on Broadway, winning four Tony awards in 1968 including best play. Sir Tom began advocating on behalf of Soviet and Eastern Bloc dissidents after writing Every Good Boy Deserves Favour, a play inspired by his friendship with Viktor Fainberg, who had been imprisoned in Czechoslovakia by the Soviets. Much later, in 2002, his trilogy of plays set in 19th century Russia, The Coast Of Utopia, were staged at the National Theatre. His most recent plays include Heroes, Rock 'n' Roll and The Hard Problem."
    },
    {
        "title": "The family of a 14-year-old hit by a train say they will 'miss him forever'",
        "description": "The family of a talented footballer who died after being struck by a train say he had \"so much love to give\".",
        "url": "https://news.sky.com/story/the-family-of-a-14-year-old-hit-by-a-train-say-they-will-miss-him-forever-13476980",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-burton-joyce-nottinghamshire_7095408.jpg?20251129152620",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 15:02:00",
        "Headline": "Joshua Travis, 14, was struck by a train in Burton Joyce, Nottinghamshire, on Wednesday.",
        "Content": "The family of a talented footballer who died after being struck by a train say he had \"so much love to give\". The British Transport Police (BTP) said officers responded to reports of a casualty on the tracks in Burton Joyce, Nottinghamshire, just after 7pm on Wednesday. In a statement on Saturday, BTP said Joshua Travis, 14, died at the scene. His family said in a statement: \"Josh was a lad with an incredibly (sic) energy for life, an infectious and mischievous smile, kind sparkling eyes, and so much love to give. \"He leaves a gap in our lives that is and will always be impossible to fill, and we will miss him forever.\" Nottingham Forest Academy also paid tribute to the 14-year-old on social media, saying: \"Everyone at Nottingham Forest is deeply saddened to learn of the tragic passing of our former academy goalkeeper Josh Travis. \"Our thoughts are with Josh's family and friends at this extremely difficult time.\" Aspire Football Coaching said on Facebook that it will postpone all of its games after the death of Travis - their under-15s goalkeeper. \"Josh was a fantastic goalkeeper and a great character in the group,\" the coaching school added. \"Everybody that came across Josh described him as a pleasure to have around with his polite and funny nature. \"Josh made a real impact in his age group, both as a footballer but more importantly as a person and will be sorely missed at the club.\" Read more from Sky News:Dozens of flood alerts across England and WalesLuke Littler reflects on his rise to famePM's rap battle with Sky's Beth Rigby goes viral The BTP said in a statement that the incident is not being treated as suspicious. Sky News has contacted the Rail Accident Investigation Branch for comment."
    },
    {
        "title": "Netflix executive Lloyd screen-tested for top Channel 4 job",
        "description": "A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/netflix-executive-lloyd-screen-tested-for-top-channel-4-job-13476859",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-29 08:16:00",
        "Headline": "Emma Lloyd, whose previous employers include Sky, is among the candidates being considered to replace Alex Mahon as chief executive of the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster. Sky News has learnt that Emma Lloyd, the streaming giant's vice-president, partnerships, in Europe, the Middle East and Africa, is one of a handful of media executives shortlisted to replace Alex Mahon as Channel 4's chief executive. Ms Lloyd, whose previous employers included Sky, the immediate parent company of Sky News, also served on the board of Ocado Group, from which she stepped down this month after nine years as a non-executive director. She is understood to be a serious contender to take the helm at Channel 4, with other candidates understood to include Jonathan Allan, the interim chief executive who has also been its chief commercial officer and chief operating officer. The identities of others involved in the recruitment process was unclear this weekend. The appointment of a successor to Ms Mahon, Channel 4's long-serving boss, comes at an important time for the company, and the broader public service broadcasting sector. Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary, Lisa Nandy, although the process to land a new chief executive is being steered from within the company. \n                  Former Travis Perkins boss Cooper to chair Channel 4\n                 \n                  BBC and Channel 4 should 'merge' to survive, Sir Phil Redmond says\n                 \n                  AO chair Cooper interviewed for Channel 4 chair job\n                 In September, Geoff Cooper, who chairs the online electrical goods retailer AO, was named Channel 4's next chairman. He replaced Sir Ian Cheshire, the former Kingfisher boss, who held the role for a single three-year term. Channel 4 saw off the prospect of privatisation under the last Conservative government, with Ms Mahon a particularly vocal opponent of the move. Nevertheless, Channel 4, which is funded by advertising revenues, faces significant financial challenges amid shifting - and in many cases waning - consumption of traditional television channels. In the aftermath of a sale of the company being abandoned, its board last year unveiled Fast Forward, a five-year strategy designed to \"elevate its impact across the UK and stand out in a world of global entertainment conglomerates and social media giants\". \"While getting ourselves into the right shape for the future is without doubt the right action to take, it does involve making difficult decisions,\" Ms Mahon said at the time. \"I am very sad that some of our excellent colleagues will lose their jobs because of the changes ahead. \"But the reality of the rapid downshift in the UK economy and advertising market demand that we must change structurally. \"As we shift our centre of gravity from linear to digital our proposals will focus cost reductions on legacy activity.\" Ms Mahon's departure earlier this year saw her quit to run Superstruct, a music festival business owned by private equity backers. In recent weeks, her name has been linked with the BBC director-general's post, which is soon to be vacated by Tim Davie. Mr Davie announced this month that he would step down amid fierce criticism of the Corporation's handling of a misleadingly edited speech made by President Donald Trump, which was included in an edition of the current affairs programme last year. The public service broadcasting arena will also undergo significant change if a prospective bid by Sky for the television arm of ITV progresses to a definitive transaction. Talks between the two companies emerged earlier this month. In addition to the corporate developments in British broadcasting, the government has also confirmed a Sky News report that a search for a successor to Lord Grade, the Ofcom chairman, is under way. On Saturday, Netflix declined to comment on Ms Lloyd's behalf."
    },
    {
        "title": "Police given more time to question man arrested over Heaton Park synagogue attack",
        "description": "Police investigating the attack on the Heaton Park synagogue, in which two people died, have been given more time to question a man arrested on suspicion of terror offences.",
        "url": "https://news.sky.com/story/police-given-more-time-to-question-man-arrested-over-heaton-park-synagogue-attack-13477190",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-synagogue_7039976.jpg?20251003113326",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-29 17:50:00",
        "Headline": "The 31-year-old can now be held until Thursday, Greater Manchester Police said.",
        "Content": "Police investigating the attack on the Heaton Park synagogue, in which two people died, have been given more time to question a man arrested on suspicion of terror offences. The man, 31, can now be held in custody for up to seven days from his arrest on Thursday, Greater Manchester Police said in a statement on Saturday afternoon. Seven people have been arrested over last month's attack at the Heaton Park Hebrew Synagogue in Crumpsall. Jihad al Shamie, a Syrian-born UK citizen, drove his car at worshippers gathering on the Jewish holy day of Yom Kippur, before attacking others with a knife and trying to storm inside. Armed police fatally shot al Shamie after he ran towards officers \"aggressively\" while carrying a knife and what police feared was an explosive device - later identified as a fake. Worshippers Melvin Cravitz, 66, and Adrian Daulby, 53, were killed. Mr Daulby, who died from a single gunshot wound to the chest fired by an armed police officer, was described as a \"quiet hero\" who blocked the doors of the synagogue as it came under attack. \n                  Man jailed over £1m Rolex and luxury watch fraud\n                 \n                  'A real moral failing': Manchester synagogue members still don't feel safe weeks after attack\n                 \n                  Manchester drugs baron Gregory Bell who 'paid his daughter's private school fees with cash' jailed \n                 Father-of-three Mr Cravitz died from multiple knife wounds inflicted by al Shamie, an inquest at Manchester Coroner's Court heard in October.  The inquests into the deaths of both men have been adjourned until February next year. Three other men were treated in hospital for serious injuries. Two have since been released, police said on Thursday. An inquest into the death of al Shamie heard he was identified by his fingerprints and evidence, including his car, phone and inquiries with his immediate family in the aftermath of the attack. At the hearing in October, Judge Alexia Durran, the chief coroner of England and Wales, said her provisional findings were that al Shamie died of gunshot wounds. The Independent Office for Police Conduct found no misconduct in the police response. Read more from Sky News:Attacker's father calls for unityKing visits synagogue In a statement on Thursday, assistant chief constable Rob Potts, from Counter Terrorism Policing North West, said: \"The loved ones of Mr Daulby and Mr Cravitz have been updated on this development, as have those who were seriously injured in the attack. \"Our investigation is continuing, and I would once again appeal for anyone with information that they think could assist our enquiries to please come forward.\""
    },
    {
        "title": "Luke Littler on media attention, his meteoric rise to fame and bringing new fans to darts",
        "description": "If Luke Littler was going to Ally Pally to watch the World Darts Championships this Christmas instead of being the world champion, he'd dress up as Nintendo's Mario or Luigi. ",
        "url": "https://news.sky.com/story/luke-littler-on-media-attention-his-meteoric-rise-to-fame-and-bringing-new-fans-to-darts-13476756",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-luke-littler-darts_7094898.jpg?20251128201403",
        "type": "UK",
        "Author": "Jacquie Beltrao",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "The 18-year-old made most things this year look easy, winning the World Championships, the UK Open, World Matchplay, World Grand Prix, Grand Slam of Darts and the Players Championship.",
        "Content": "\n          Sports presenter\n        If Luke Littler was going to Ally Pally to watch the World Darts Championships this Christmas instead of being the world champion, he'd dress up as Nintendo's Mario or Luigi.  It's hard to believe less than two years ago he could have done that. Outside the darting world, he was an unknown Warrington schoolboy, before his extraordinary run to the final changed his life forever and it changed the whole sport. \"Oh, it's changed massively, not for just myself, but for my family, but it's changed for good reasons. At the start it was tough with all the media attention, but as the years have gone on, I'm getting used to it,\" he said. \"At the start it was just crazy to see the amount of people that did get involved with it. But ever since my first game at the World Championships up until now, the support has been the same. There's more people getting into it, and yeah, it's all down to me.\" Littler, who is now 18, isn't arrogant, just very matter-of-fact. He's now a millionaire and has recently bought his first car - a \"BMW One series, brand new\" - after passing his driving test. \"That's my other life outside of darts and obviously people don't see us outside of the darting world. They only see us on stage, but we're just the same person,\" he said. \n                  Luke Littler: World No 1 hopes his world title defence doesn't open with clash against Beau Greaves\n                 \n                  Luke Littler and Luke Humphries spark intense battle for world No 1 spot and World Darts Championship after Grand Slam of Darts\n                 \n                  Luke Littler: World No 2 admits to feeling 'nervous' and 'shaking' after being followed by photographers on motorway\n                 But did the youngest ever world number one get just a little nervous about the driving test? \"I wouldn't say it was nerve-wracking cause there was only a few routes around Warrington, so I kinda knew what route I was going on. I was doing lessons before it, and my driving instructor took me on a particular route and come my test, it was the same route, so it was very easy,\" Littler said. But he's made most things this year look easy, winning the World Championships, the UK Open, World Matchplay, World Grand Prix, Grand Slam of Darts and the Players Championship. Nerves do not seem to be part of his make-up even when he's behind in matches or the stakes are high: \"I wouldn't say there's really any nerves, I just enjoy it. I love producing my best darts, I love walking on, seeing the fans and there's no need to put any pressure on yourself. \"If you win, you win; if you lose, you lose. Obviously, if you're losing, it's not a good feeling and you've gotta get yourself out of that situation, get yourself back into the game, and that's what I'm good at. \"I'm good at turning it up a notch or two, and I can get in front of my opponent and then go on and win the game.\" He has single-handedly brought a whole new generation of fans to the sport. His fellow competitors are mostly twice his age, but they seem to enjoy the refresh and profile he has given the sport. Read more from Sky News:Deliver driver who killed girl, 7, in crash jailedMan jailed for 'depraved' murder of family friend There's no question Littler loves what he does and could probably get even better, \"if I put the practice in, I probably could get better. But at the minute I'm happy with how I'm doing,\" he said. And does he put much practice in? \"Not really, I'll be honest!\""
    },
    {
        "title": "Ukrainian officials head to US for peace talks - while dramatic footage shows Russian oil tankers being hit ",
        "description": "Ukraine's representatives are preparing for renewed peace talks in the US, while dramatic footage has shown Russian tankers being hit by naval drones.",
        "url": "https://news.sky.com/story/ukrainian-officials-head-to-us-for-peace-talks-while-dramatic-footage-shows-russian-oil-tanker-being-hit-13477317",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-russian-tanker-black-sea_7096087.jpg?20251130005013",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 21:40:00",
        "Headline": "Volodymyr Zelenskyy says his country's delegation is looking to \"swiftly and substantively work out the steps needed to end the war\".",
        "Content": " Ukraine's representatives are preparing for renewed peace talks in the US, while dramatic footage has shown Russian tankers being hit by naval drones. President Zelenskyy said a delegation headed by national security chief Rustem Umerov was on its way to \"swiftly and substantively work out the steps needed to end the war\". They are due to be greeted by US secretary of state Marco Rubio, Donald Trump's special envoy Steve Witkoff, and the US president's son-in-law Jared Kushner, a senior US official told Reuters news agency. After the US-Ukraine talks, an American delegation is expected to travel to Moscow to meet President Putin. It comes after Mr Trump released a 28-point proposal last week that would hand swathes of land to Russia and limit the size of Kyiv's military. It was widely seen as heavily favouring Russia and led Mr Zelenskyy to swiftly engage with American negotiators. President Trump said on Tuesday his plan had been \"fine-tuned\". \n                  Zelenskyy will cut a lonely figure without his towering chief of staff\n                 \n                  France reveals new national military service amid fears of Russian threat\n                 \n                  Who is negotiating the potential peace deal for the US, Russia and Ukraine?\n                  In his evening address on Saturday, the Ukrainian leader said: \"The American side is demonstrating a constructive approach, and in the coming days it is feasible to flesh out the steps to determine how to bring the war to a dignified end.\" Mr Zelenskyy's team in the US is without his former chief of staff and lead negotiator, Andrii Yermak, as he quit on Friday after officials raided his home amid a corruption scandal.  Tankers hit by 'Sea Baby' drones Ukrainian drones were shown hitting two of Russia's so-called \"shadow fleet\" oil tankers in the Black Sea in footage released on Saturday. Friday's attack was carried out by the country's security service and its navy, an official told Reuters. They said both ships \"sustained critical damage\" that took them out of service. A security source told Associated Press that domestically-made \"Sea Baby\" drones were used. The tankers were under sanctions and heading to a Russian port to load up with oil destined for foreign markets, the official said. They have been identified as the Kairos and Virat. Read more:Who is Steve Witkoff, the property mogul seeking a peace deal?Analysis: Trump's peace plan had Russian fingerprints all over it The 274m-long Kairos suffered an explosion and caught fire en route from Egypt to Russia on Friday, Turkey's transport ministry said. The crew was evacuated. The Virat was reportedly struck about 35 nautical miles offshore. It was attacked by unmanned vessels and sustained minor damage to its starboard side, the Turkish ministry said. Russia deploys a fleet of often ageing, uninsured and unmarked tankers to circumvent sanctions on its oil exports, which continue to help pay for the Ukraine war. Another Ukrainian attack halted operations at an oil terminal near the Russian port of Novorossiysk on Saturday.  Andriy Kovalenko, from Ukraine's National Security and Defence Council, said special forces were responsible. \"Naval drones managed to destroy one of the three oil tanker berths of the Caspian Pipeline Consortium in the Novorossiysk area,\" he wrote on Telegram. Six killed in aerial attacks on Ukraine Russia carried out another onslaught on the Ukrainian capital overnight into Saturday, firing 36 cruise and ballistic missiles and launching around 600 drones. Officials said three people were killed in and around Kyiv, two in the Dnipropetrovsk region and one in a midday attack in Kherson region in the south. Mayor Vitali Klitschko said 29 others were injured in Kyiv, largely due to falling debris from intercepted drones hitting buildings. The attacks also hit Ukrainian energy facilities and left hundreds of thousands without power in the capital. Supplies have since been restored. Targeting such infrastructure has become a familiar tactic from Russia over the winter, in what Ukraine officials say is the \"weaponising\" of the cold."
    },
    {
        "title": "Hong Kong mourns those lost to fire as investigators search for remains",
        "description": "Grief was not lonely today in Hong Kong. Three days after the worst fire in the history of modern Hong Kong, it feels as though it has barely sunk in.",
        "url": "https://news.sky.com/story/hong-kong-mourns-those-lost-to-fire-as-investigators-search-for-remains-13477236",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hong-kong-fire-flowers_7095878.jpg?20251129190304",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-11-29 18:47:00",
        "Headline": "Wednesday's blaze has claimed the lives of at least 128 people with dozens unaccounted for, making it Hong Kong's deadliest fire since 1948.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Grief was not lonely today in Hong Kong. Three days after the worst fire in the history of modern Hong Kong, it feels as though it has barely sunk in. The weekend at least lent them time to pay tribute, and gave them some space to reflect. People came in droves to lay flowers, so many a queuing system was needed. Official books of condolences were also set up in multiple parts of the city. It was the first day large teams of investigators were able to enter the site. Dozens of them in hazmat suits were bused in, their work the grimmest of tasks. Every so often you could see a flashlight peep through the window of an upper blackened window, a reminder that the fire services are still undertaking dangerous work. But the reach of the authorities is ramping up here. Yesterday a grass roots aid distribution centre was the vibrant heart of the response. They received notice at 4am that they needed to pack up and move on. By 10.30am, the mountains of donations were gone, residents watched on, bewildered. The task apparently will be handed over to professional NGOs. \"I think the government's biggest concern is due to some past incidents,\" one organiser tells us. \"They may liken this to previous events. The essence looks similar.\" She's careful with her words, but she's clearly hinting at major pro-democracy protests that were crushed by authorities in 2019. Any sort of mass gathering is now seen as a risk, the system is still very nervous. And they might well be because people here are angry. What, they ask, did the government know? What did it choose to ignore? Indeed, Sky News has learnt that residents raised their fears over fire safety connected to extensive renovations on Wang Fuk Court as early as September 2024. They flagged the suspected flammability of green nets being used to cover the building. An email response from the Labour Department was sent a few months later to Jason Poon, a civil engineer-turned-activist, who was working with residents. It insists that \"the mesh's flame retardant properties meet safety standards\". But many clearly didn't believe it. Posts spanning many months on a residents' Facebook group continued to voice their fears.  When a much smaller fire broke out in the city last month, one resident posted: \"All the materials outside are flammable, I feel really worried.\" \"I feel that same way\" another replied. \"The government has no sense of concern.\" For Poon, who dedicates much of his time to fighting lax safety standards in Hong Kong's construction industry, the whole experience has been devastating. \"They knew all the maintenance was using corner-cutting materials, but they didn't do anything,\" he says. \"This is a man-made disaster.\" We put these allegations to Hong Kong's Labour Department but they have not yet responded to our request for comment. Grief may still be the prominent force here, but anger is not that far behind."
    },
    {
        "title": "Indonesia: More than 300 people dead and others missing after floods and landslides",
        "description": "More than 300 people have died and dozens are missing following floods and landslides in Indonesia, which has also been hit by an earthquake.",
        "url": "https://news.sky.com/story/indonesia-at-least-248-people-dead-and-others-missing-after-floods-and-landslides-13476839",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-indonesia-north-sumatra_7095064.jpg?20251129071548",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 07:01:00",
        "Headline": "Rescue workers have been struggling to reach some areas cut off by damaged roads, and where communications lines have come down. Authorities fear the number of dead will increase further.",
        "Content": " More than 300 people have died and dozens are missing following floods and landslides in Indonesia, which has also been hit by an earthquake. Monsoon rains over the past week caused rivers to burst their banks in North Sumatra province. The deluge tore through mountainside villages, swept away people and submerged thousands of houses and buildings, the National Disaster Management Agency said. As rescue workers continued their efforts on Saturday, the head of the country's disaster mitigation agency said the number of dead had risen to at least 303 people. Authorities fear the figure will increase. Other Southeast Asian countries including Thailand, Malaysia and Sri Lanka have also been affected by torrential rain in the last week, with authorities working to rescue stranded citizens, restore power and communications and coordinate recovery efforts. On Friday, the Thai government said 145 people had been killed by flooding across eight southern provinces, while two deaths have also been confirmed in Malaysia. Sri Lanka, in South Asia, has also seen 46 deaths following a cyclone, authorities said. The extreme weather was driven by tropical cyclone Senyar, which formed in the Strait of Malacca, Indonesia's Meteorology, Climatology and Geophysical Agency said. Rescuers in Indonesia have been struggling to reach some areas cut off by damaged roads, and where communications lines have come down. Relief aircraft have been delivering aid and supplies to the hard-hit district of Central Tapanuli in North Sumatra and other provinces in the region. The agency said West Sumatra's Agam district had also been affected. Pictures of the rescue efforts show workers trudging through waist-deep mud and areas filled with tree trunks and debris, searching for any victims potentially trapped. In Aceh province, flooded roads meant authorities struggled to get tractors and other heavy equipment to hilly hamlets which were hit by mud and rocks in the deluge. Hundreds of police officers, soldiers and residents dug through the debris with their bare hands and spades as heavy rain hindered their efforts. Meanwhile, a magnitude 6.3 earthquake hit Sumatra island near Aceh province on Thursday, the country's geophysics agency said. Torrential rain triggered flash flooding and landslides in Sumatra earlier in the week. Videos posted on social media showed water streaming down from rooftops as panicked residents scrambled to safety. Heavy seasonal rain from about October to March often causes flooding and landslides in Indonesia - an archipelago of more than 17,000 islands including Sumatra - where millions of people live in mountainous areas or near fertile floodplains. Last week, almost 1,000 people from three villages on Java were forced to flee to shelters after the eruption of Mount Semeru, the island's highest volcano."
    },
    {
        "title": "Two brothers killed in Israeli drone strike on Gaza",
        "description": "An Israeli drone strike has killed two Palestinian children in southern Gaza, a hospital reported.",
        "url": "https://news.sky.com/story/two-brothers-killed-in-israeli-drone-strike-on-gaza-13477104",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israel-palestine_7095647.jpg?20251129172930",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 17:18:00",
        "Headline": "Fadi Abu Assi, 11, and Goma Abu Assi, eight, were gathering firewood at the time, their uncle said.",
        "Content": "An Israeli drone strike has killed two Palestinian children in southern Gaza, a hospital reported. The two brothers died when a drone struck close to a school sheltering displaced people near Beni Suhaila, staff at Nasser Hospital said. The boys, Fadi Abu Assi, 11, and Goma Abu Assi, eight, were gathering firewood for their wheelchair-bound father, according to their uncle, Mohamed Abu Assi. He said: \"They are children...what did they do? They do not have missiles or bombs, they went to gather wood for their father so he can start a fire.\" At the funeral, the boys' father wept over one of his children, whose white shroud was peeled back to show his face. Asked for comment by Sky News, the IDF responded: \"Earlier today, IDF troops identified two suspects who crossed the yellow line, conducted suspicious activities on the ground, and approached IDF troops operating in the southern Gaza Strip, posing an immediate threat to them. \"Following the identification, the IAF eliminated the suspects in order to remove the threat.\" \n                  Talks begin on the next phase of Gaza ceasefire deal as Hamas and Israel hand over remains\n                 \n                  Controversial US and Israeli-backed aid operation the Gaza Humanitarian Foundation to close\n                 \n                  Israel launches strikes on Gaza in further test of fragile ceasefire\n                 It comes less than two months after a 20-point peace deal, brokered by US President Donald Trump, took effect in October. Now Hamas is calling on mediators to pressure Israel to stop violating the ceasefire. Israel, which accuses Hamas of breaking the ceasefire itself, says its strikes are aimed at militants violating the truce. At least 352 Palestinians have been killed since the ceasefire took effect on October 10, according to Gaza's Health Ministry.  The Hamas-run ministry, which does not differentiate between civilians and combatants, says the death toll from Israel's offensive in Gaza has now passed 70,000. Israeli officials have questioned the accuracy of the figures, accusing Hamas of exaggerating the numbers, though the militant group denies this. Read more:'Almost two children a day killed in Gaza'Gaza: It's impossible to imagine people still living here The health ministry says it had refrained from adding thousands of reported deaths to the official tally pending further checks. Now with a shaky ceasefire in effect, officials claim they can take advantage of the relative calm to search for the dead. The UN has previously described the ministry's figures as \"credible\"."
    },
    {
        "title": "Australia's Anthony Albanese gets married - and makes history as country's first prime minister to wed in office",
        "description": "The Australian prime minister has married his partner, becoming the first leader to tie the knot while in office in the government's history.",
        "url": "https://news.sky.com/story/australias-anthony-albanese-gets-married-and-makes-history-as-countrys-first-prime-minister-to-wed-in-office-13476896",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prime-minister-australia_7095185.jpg?20251129120449",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 11:22:00",
        "Headline": "Anthony Albanese and Jodie Haydon, who wrote their own vows, had their dog Toto as ring bearer, while Ms Haydon's five-year-old niece was flower girl.",
        "Content": "The Australian prime minister has married his partner, becoming the first leader to tie the knot while in office in the government's history. Anthony Albanese and Jodie Haydon were married by a civil celebrant in an intimate ceremony at his official residence in the capital, Canberra, on Saturday. The couple, who wrote their own vows, had their dog Toto as ring bearer, while Ms Haydon's five-year-old niece, Ella, was flower girl. Cabinet ministers were among about 60 guests who attended the afternoon ceremony. \"We are absolutely delighted to share our love and commitment to spending our future lives together, in front of our family and closest friends,\" a statement from the newlyweds said. And sharing photos in a post on social media, Mr Albanese added: \"I love you, Jodie.\" Mr Albanese, 62, who is divorced with an adult son, is the first prime minister to get married while in office in the Australian government's 124-year history. He proposed to Ms Haydon, 46, who works in finance, on Valentine's Day last year, after meeting her at a business dinner in Melbourne in 2020. Read more from Sky News:Pope Leo visits Istanbul's Blue MosqueBritish passenger missing after cruise ship fallPM's rap battle with Sky's Beth Rigby goes viral Mr Albanese's Labor Party won the last election, held in May, to gain his second three-year term. The couple had initially planned a larger-scale wedding before the election, but delayed plans as party strategists feared a lavish ceremony during a cost-of-living crisis could hurt the government's chances of being re-elected. The prime minister's office said the couple will now honeymoon in Australia from Monday until Friday of next week, with all expenses paid privately by the couple."
    },
    {
        "title": "Pope Leo visits Istanbul's Blue Mosque during first overseas visit",
        "description": "The Pope has visited Istanbul's Blue Mosque during a day spent meeting both Muslim and Christian leaders.",
        "url": "https://news.sky.com/story/pope-leo-visits-istanbuls-blue-mosque-during-first-overseas-visit-13476871",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pope-leo-xiv-the-pope_7095131.jpg?20251129094318",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 09:28:00",
        "Headline": "Pope Leo's visit to the 17th-century Ottoman-era mosque marked part of his first overseas visit as head of the Catholic Church. He will travel to Lebanon on Sunday.",
        "Content": " The Pope has visited Istanbul's Blue Mosque during a day spent meeting both Muslim and Christian leaders. Pope Leo joined the imam at the 17th-century Ottoman-era mosque, officially called the Sultan Ahmed Mosque. The trip marked part of the third day of his first overseas visit as head of the Catholic Church. From Turkey, he will travel to Lebanon on Sunday. After the mosque visit, Leo held a private meeting with Turkey's Christian leaders at the Syriac Orthodox Church of Mor Ephrem. While the Vatican had said Leo would observe a \"brief minute of silent prayer\" at the Blue Mosque, the imam said the Pope declined. Speaking to reporters after the visit, Asgin Tunca said he had told the Pope: \"It's not my house, not your house, (it's the) house of Allah.\" The imam added that he told the pontiff: \"'If you want, you can worship here,' I said. But he said, 'that's OK.' \n                  Pope Leo arrives in Turkey for his first foreign visit with a message of peace\n                 \n                  Hollywood icons meet Pope Leo - after agents were assured invites were not a hoax\n                 \n                  Royals visit to meet Pope Leo at Vatican is welcome relief for King Charles engulfed in Prince Andrew revelations\n                 \"He wanted to see the mosque, wanted to feel (the) atmosphere of the mosque, I think. And was very pleased.\" Later, Vatican spokesman Matteo Bruni said: \"The Pope experienced his visit to the mosque in silence, in a spirit of contemplation and listening, with deep respect for the place and the faith of those who gather there in prayer.\" The Blue Mosque is officially named after Sultan Ahmed I, leader of the Ottoman Empire from 1603 to 1617, who oversaw its construction. It is decorated with thousands of blue ceramic tiles, which is the basis of its popular name. Leo is the latest pontiff to visit the holy site, with his recent predecessors Pope Francis and Pope Benedict also making visits in a gesture of respect to Turkey's Muslim population. Observing etiquette, Leo removed his shoes and walked through the carpeted mosque in his white socks. However, he did not visit the Hagia Sophia, one of the most important historic cathedrals in Christianity and located just across from the Blue Mosque. In July 2020, Turkey converted Hagia Sophia from a museum back into a mosque, which was criticised by the Vatican. Read more from Sky News:Tourist's partner 'tried to fight off shark' during fatal attackPM's rap battle with Sky's Beth Rigby goes viralHospitality pleads for 'lifeline' after budget 'stealth tax' The Pope is set to end Saturday with a Catholic Mass in Istanbul's Volkswagen Arena for the country's Catholic community. A religious minority, there are around 33,000 Catholics in Turkey, which has a population of more than 85 million people, most of whom are Sunni Muslim."
    },
    {
        "title": "Venezuela accuses Trump of 'colonial threat' after US president 'closes' its airspace ",
        "description": "Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\".",
        "url": "https://news.sky.com/story/trump-closes-airspace-above-and-surrounding-venezuela-13476971",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/d03e6721ce603019af90a0108dc7a01e31949e7f5ebcf8d10301bb35b6fb52d7_7091997.jpg?20251125224122",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-29 14:48:00",
        "Headline": "The US president made the announcement on Truth Social amid a growing row over drug trafficking with Venezuelan counterpart Nicolas Maduro.",
        "Content": " Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\". Mr Trump made the declaration amid growing tensions with President Maduro - and as the US continues attacking boats it claims are carrying drugs from Venezuela. He wrote on Truth Social: \"To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY.\" Venezuela's foreign affairs office called it a \"colonial threat\" and \"illegal, and unjustified aggression\". It accused the president of threatening \"the sovereignty of the national airspace... and the full sovereignty of the Venezuelan state\". President Trump's words were part of a \"permanent policy of aggression against our country\" that breached international law and the UN Charter, it added. The US leader's post comes after the American aviation regulator warned of a \"potentially hazardous situation\" over Venezuela due to a \"worsening security situation\". The South American nation revoked operating rights for six major airlines that went on to suspend flights to the country. Mr Trump warned this week that land operations against suspected Venezuelan drug traffickers would begin \"very soon\". Such a move would be a major escalation in Operation Southern Spear - the US naval deployment in the Caribbean Sea and eastern Pacific that's so far attacked at least 21 vessels.  Venezuela has said the attacks, which have killed more than 80 people, amount to murder. The US has released videos of boats being targeted, but hasn't provided evidence - such as photos of their cargo - to support the smuggling claims. Read more:Trump may have another motive in war on drugsThe US-Venezuela crisis explained  The Pentagon has sought to justify the strikes by labelling the drug gangs as \"foreign terrorist organisations\" - putting them on par with the likes of al Qaeda. It claims the boats targeted are carrying drugs bound for the US, although Sky's chief correspondent says the final destination is likely to be Europe and West Africa. President Maduro has also denied Mr Trump's claims he is involved in the drugs trade himself, and said his counterpart wants to oust him so he can install a more sympathetic government. Venezuelan officials have also claimed Mr Trump's true motivation is access to the country's plentiful oil reserves. Mr Maduro is widely considered a dictator who's cheated elections and has been president since 2013."
    },
    {
        "title": "'Women are afraid to get pregnant': Fighting mercury poisoning from illegal gold mining in Brazil",
        "description": "\"Many women end up losing their children,\" says Alessandra Korap, a community leader of the Munduruku people from the Brazilian Amazon.",
        "url": "https://news.sky.com/story/women-are-afraid-to-get-pregnant-indigenous-people-fight-mercury-poisoning-from-illegal-gold-mining-in-brazil-13474997",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-alessandra-korap-munduruku_7091729.jpg?20251125180544",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "Munduruku people in Brazil are battling miscarriages and loss of sight and sound, a community leader tells Sky News.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  \"Many women end up losing their children,\" says Alessandra Korap, a community leader of the Munduruku people from the Brazilian Amazon. \"Either they can't get pregnant, or they lose their [foetus] over time. \"So, women are afraid of getting pregnant.\" For centuries, the indigenous Munduruku have lived in an area across what is now the states of Amazonas and Para in northern Brazil, especially around the Tapajos River. But in recent decades, villagers had been plagued by curious symptoms that they didn't realise could be related: children unable to lift their heads, adults unable to walk any more, muscle tremors, memory loss, fading hearing and vision, miscarriages. Now they are finally closing in on the cause. The Tapajos river, their lifeblood, is laced with highly toxic mercury. \n                  Ex-Brazil president Jair Bolsonaro says he tried to prize open ankle tag after 'hallucinations'\n                 \n                  Ex-Brazil president Jair Bolsonaro 'tried to open ankle monitor' with soldering iron in 'escape attempt', court documents allege\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                 Mercury poisoning is hard to diagnose because symptoms resemble other degenerative illnesses like Parkinson's or Alzheimer's, says Gabriela Arrifano, professor of mercury toxicology at the Federal University of Para. \"But there is now enough evidence to relate the signs and symptoms found in people exposed to mercury.\" And they have no doubts about where it's coming from. \"We have robust evidence that mercury emissions to the environment comes from illegal gold mining activity,\" says Prof Arrifano in her university lab, where she analyses hair and blood samples. When researchers began studying the symptoms, Alessandra \"didn't know what mercury was\", she says. Hand in hand with drugs In Brazil, gold mining is outlawed in indigenous territory. Yet swathes of it are pockmarked with red and orange craters from illicit gold projects - a trend fuelled by record-high prices around the world. The underground trade works hand in hand with organised crime groups, sharing the same makeshift runways and roads through the Amazon rainforest, and using the gold to launder drug money. The gold, once locked in the mountainside of the Andes, was gradually washed away by ancient rain into the Amazon basin. To extract it, illegal miners churn up the riverbed and combine it with mercury because it binds to gold. The process releases mercury into the air, water and soil. Over time, the mercury coursing through the waterways accumulates in river fish, which indigenous communities eat for breakfast, lunch, dinner. One study found one in five fish in markets in northern Brazil had dangerous levels of mercury (0.5 micrograms per gram). Once in the guts, it enters the bloodstream and makes its way to the brain, where it can cause lesions. Even low levels of exposure can disrupt most of the body's systems, whether reproductive, skin, or nervous systems. Prof Arrifano says people's visual field shrinks so they lose their peripheral vision. \"And then you can imagine this is very hard for people who live in the forest that need their complete senses.\" The Munduruku have been fending off mining on their land since 1960s, Alessandra tells Sky News in Para's state capital Belem, as the city hosted international climate talks. Her symptoms aren't so bad. \"I feel tingling in my hands, brain fog, forgetfulness, that is because of the mercury.\" But her niece can't walk or talk. Alessandra suspects it's got something to do with the girl's grandfather being a fisherman. \"So maybe because of this, the mother ended up ingesting a lot of mercury in her body that went to the child.\" The toxic metal also accumulates in placentas, breast milk and children, often two or three times the safe threshold for pregnant women. One study across all of Brazil identified 668 cases of mercury poisoning, but that's thought to be a vast underestimate due to poor data collection and lack of access to healthcare. How global gold prices fuel the problem The current administration under President Luiz Inacio Lula da Silva has been attempting a widespread crackdown on illegal mining. Its environmental protection agency, IBAMA, swoops in by helicopter, blows up equipment, torches makeshift buildings and flies out again. It has also frozen assets and ended the presumption of \"good faith\" - that gold for sale was extracted from lawful sights. In the Yanomami Indigenous Territory in the far north, federal government figures show a 94% reduction in active illegal mining areas between 2023 and 2025. But some of these miners have set up camp elsewhere, and the ever-soaring price of gold is making it \"harder\" to combat, one of Brazil's top officials admits. \"We thought that the amount would be reduced, and initially it did,\" Adalberto Maluf, national secretary for water resources in the environment ministry, overseeing the crackdown, tells Sky News in Belem. \"But I think it's not going as fast as we wanted, or we thought it could happen, mainly because the price of gold continues rising.\" Read more from Sky News:Software issue hits thousands of Airbus planesHong Kong residents stunned by tower tragedyBigger than COVID? Why AI is going to be so huge The problem is not unique to Brazil, but common across South America and parts of Africa. Prices are surging as investors seek security from market turbulence and geopolitical tensions - upping the incentive for miners despite the risks, says Julia Yansara from the Financial Accountability and Corporate Transparency Coalition. \"It is driving illegal gold miners into new areas. And it's driving new criminal groups to get involved in this for the first time.\" 'If we don't fight, we are crushed' The Munduruku were formerly known as an aggressive group, feared by neighbouring peoples, before being fought down by colonisers who annexed their territory. This year, they capitalised on the global attention on Brazil as it hosted the UN climate talks (COP30) to fight for their land once again. Halfway through the conference they peacefully blocked the entrance, forcing a meeting with officials that then won them the legal rights to two further portions of territory. When the land is demarcated, it's easier to pressure the government to protect the land, says Alessandra. \"If we don't fight, we are crushed, we are taken over.\" But she too knows they are fighting a rising tide. \"When the price increases, everyone wants to invade our land, to pollute the water, to destroy the forest, because they need to take the gold to sell to other countries.\" But those buyers don't know \"what is happening to our bodies, to our lives\", she adds."
    },
    {
        "title": "Venezuela accuses Trump of 'colonial threat' after US president 'closes' its airspace ",
        "description": "Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\".",
        "url": "https://news.sky.com/story/trump-closes-airspace-above-and-surrounding-venezuela-13476971",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/d03e6721ce603019af90a0108dc7a01e31949e7f5ebcf8d10301bb35b6fb52d7_7091997.jpg?20251125224122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-29 14:48:00",
        "Headline": "The US president made the announcement on Truth Social amid a growing row over drug trafficking with Venezuelan counterpart Nicolas Maduro.",
        "Content": " Venezuela has accused Donald Trump of a \"colonial threat\" after he said the airspace \"above and surrounding\" the country should be considered closed \"in its entirety\". Mr Trump made the declaration amid growing tensions with President Maduro - and as the US continues attacking boats it claims are carrying drugs from Venezuela. He wrote on Truth Social: \"To all Airlines, Pilots, Drug Dealers, and Human Traffickers, please consider THE AIRSPACE ABOVE AND SURROUNDING VENEZUELA TO BE CLOSED IN ITS ENTIRETY.\" Venezuela's foreign affairs office called it a \"colonial threat\" and \"illegal, and unjustified aggression\". It accused the president of threatening \"the sovereignty of the national airspace... and the full sovereignty of the Venezuelan state\". President Trump's words were part of a \"permanent policy of aggression against our country\" that breached international law and the UN Charter, it added. The US leader's post comes after the American aviation regulator warned of a \"potentially hazardous situation\" over Venezuela due to a \"worsening security situation\". The South American nation revoked operating rights for six major airlines that went on to suspend flights to the country. Mr Trump warned this week that land operations against suspected Venezuelan drug traffickers would begin \"very soon\". Such a move would be a major escalation in Operation Southern Spear - the US naval deployment in the Caribbean Sea and eastern Pacific that's so far attacked at least 21 vessels.  Venezuela has said the attacks, which have killed more than 80 people, amount to murder. The US has released videos of boats being targeted, but hasn't provided evidence - such as photos of their cargo - to support the smuggling claims. Read more:Trump may have another motive in war on drugsThe US-Venezuela crisis explained  The Pentagon has sought to justify the strikes by labelling the drug gangs as \"foreign terrorist organisations\" - putting them on par with the likes of al Qaeda. It claims the boats targeted are carrying drugs bound for the US, although Sky's chief correspondent says the final destination is likely to be Europe and West Africa. President Maduro has also denied Mr Trump's claims he is involved in the drugs trade himself, and said his counterpart wants to oust him so he can install a more sympathetic government. Venezuelan officials have also claimed Mr Trump's true motivation is access to the country's plentiful oil reserves. Mr Maduro is widely considered a dictator who's cheated elections and has been president since 2013."
    },
    {
        "title": "Netflix executive Lloyd screen-tested for top Channel 4 job",
        "description": "A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/netflix-executive-lloyd-screen-tested-for-top-channel-4-job-13476859",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-29 08:16:00",
        "Headline": "Emma Lloyd, whose previous employers include Sky, is among the candidates being considered to replace Alex Mahon as chief executive of the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster. Sky News has learnt that Emma Lloyd, the streaming giant's vice-president, partnerships, in Europe, the Middle East and Africa, is one of a handful of media executives shortlisted to replace Alex Mahon as Channel 4's chief executive. Ms Lloyd, whose previous employers included Sky, the immediate parent company of Sky News, also served on the board of Ocado Group, from which she stepped down this month after nine years as a non-executive director. She is understood to be a serious contender to take the helm at Channel 4, with other candidates understood to include Jonathan Allan, the interim chief executive who has also been its chief commercial officer and chief operating officer. The identities of others involved in the recruitment process was unclear this weekend. The appointment of a successor to Ms Mahon, Channel 4's long-serving boss, comes at an important time for the company, and the broader public service broadcasting sector. Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary, Lisa Nandy, although the process to land a new chief executive is being steered from within the company. \n                  Former Travis Perkins boss Cooper to chair Channel 4\n                 \n                  BBC and Channel 4 should 'merge' to survive, Sir Phil Redmond says\n                 \n                  AO chair Cooper interviewed for Channel 4 chair job\n                 In September, Geoff Cooper, who chairs the online electrical goods retailer AO, was named Channel 4's next chairman. He replaced Sir Ian Cheshire, the former Kingfisher boss, who held the role for a single three-year term. Channel 4 saw off the prospect of privatisation under the last Conservative government, with Ms Mahon a particularly vocal opponent of the move. Nevertheless, Channel 4, which is funded by advertising revenues, faces significant financial challenges amid shifting - and in many cases waning - consumption of traditional television channels. In the aftermath of a sale of the company being abandoned, its board last year unveiled Fast Forward, a five-year strategy designed to \"elevate its impact across the UK and stand out in a world of global entertainment conglomerates and social media giants\". \"While getting ourselves into the right shape for the future is without doubt the right action to take, it does involve making difficult decisions,\" Ms Mahon said at the time. \"I am very sad that some of our excellent colleagues will lose their jobs because of the changes ahead. \"But the reality of the rapid downshift in the UK economy and advertising market demand that we must change structurally. \"As we shift our centre of gravity from linear to digital our proposals will focus cost reductions on legacy activity.\" Ms Mahon's departure earlier this year saw her quit to run Superstruct, a music festival business owned by private equity backers. In recent weeks, her name has been linked with the BBC director-general's post, which is soon to be vacated by Tim Davie. Mr Davie announced this month that he would step down amid fierce criticism of the Corporation's handling of a misleadingly edited speech made by President Donald Trump, which was included in an edition of the current affairs programme last year. The public service broadcasting arena will also undergo significant change if a prospective bid by Sky for the television arm of ITV progresses to a definitive transaction. Talks between the two companies emerged earlier this month. In addition to the corporate developments in British broadcasting, the government has also confirmed a Sky News report that a search for a successor to Lord Grade, the Ofcom chairman, is under way. On Saturday, Netflix declined to comment on Ms Lloyd's behalf."
    },
    {
        "title": "Ministers line up bankers to review options for UK steel industry",
        "description": "The government is lining up bankers to conduct a review of options for Britain's embattled steel industry amid calls for ministers to orchestrate mergers between some of the sector's biggest players.",
        "url": "https://news.sky.com/story/ministers-line-up-bankers-to-review-options-for-uk-steel-industry-13476860",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-british-steel-blast-furnaces_7095103.jpg?20251129082542",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-29 08:16:00",
        "Headline": "The government is close to hiring Evercore, the investment bank, to examine the future of the British steel industry months after it seized control of the country's second-biggest producer, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The government is lining up bankers to conduct a review of options for Britain's embattled steel industry amid calls for ministers to orchestrate mergers between some of the sector's biggest players. Sky News has learnt that Evercore, the independent investment bank which now employs George Osborne, the former chancellor, was expected to be appointed in the coming weeks to oversee a strategic review of the sector. If its appointment is confirmed, Evercore will report its findings to Peter Kyle, the business secretary, and UK Government Investments (UKGI), the Whitehall agency which manages taxpayers' interests in a range of companies, including the Post Office and Channel 4. The talks with Evercore come as the steel industry contends with the impact of President Trump's tariff war and the prospect of retaliatory measures from the European Union. The move to recruit bankers for a key review of Britain's struggling steel sector also comes during a period when the government has significant financial exposure to all of the country's three largest steel producers. Last year, ministers agreed to provide £500m in grant funding to Tata Steel, the Indian company, to install an electric arc furnace at its Port Talbot steelworks in Wales. The new facility is expected to be operational in 2027, but has been bitterly opposed by trade unions infuriated that the new funding was effectively used to drive through thousands of redundancies at the plant. \n                  'Disappointing' no steel tariff deal done before Trump in town, industry says\n                 \n                  UK to miss deadline to agree steel and aluminium tariffs\n                 \n                  Jingye and Whitehall officials hold talks over British Steel future\n                 In April, the then business secretary, Jonathan Reynolds, moved to seize control of British Steel after its Chinese owner, Jingye Group, threatened to close the UK's last-remaining blast furnaces at its site in Scunthorpe. The move sparked a diplomatic row with Beijing, with Jingye considering various legal options in an attempt to secure compensation for its shares in the company. Last month, ministers disclosed that the cost of taking control of British Steel had risen to £235m, in addition to a £600m bill for preserving its future in 2019 and 2020 when the company fell into insolvency under its previous owner. The government's move prevented the immediate loss of more than 3,000 jobs, although there remain questions about the company's viability as a standalone entity. Some advisers believe that a combination of British Steel with other industry players, including Sheffield Forgemasters, which is also in government control, will be a necessary step to preserving steelmaking capacity in the UK. People familiar with the plans said that a newspaper report this month suggesting that bankers were being recruited by the government to sell British Steel was \"wrong\". \"The UK government doesn't own British Steel; it's hard to sell an asset you do own,\" they said. Nevertheless, it remains conceivable that the government will at some stage be able to determine the future ownership of the industry's second-largest company, amid recent suggestions that Beijing could be willing to cede Jingye's claim to the company in return for Sir Keir Starmer's approval of a controversial new Chinese embassy in Central London. \"We continue to work with Jingye to find a pragmatic, realistic solution for the future of British Steel,\" Chris McDonald, the industry minister, said in a statement to parliament this month. \"Our long-term aspiration for the company will require co-investment with the private sector to enable modernisation and decarbonisation, safeguard taxpayers' money and retain steelmaking in Scunthorpe.\" Britain's third-largest steelmaker, Speciality Steels UK (SSUK), is also effectively in government hands, having been placed into compulsory liquidation during the summer. The business was part of Liberty Steel, which is owned by GFG, the metals empire of businessman Sanjeev Gupta. In August, a judge declared SSUK as \"hopelessly insolvent\", with a special manager now overseeing an auction of the business, which employs about 1,500 people. A spokesperson for the Department for Business and Trade (DBT) said: \"This government sees a bright and sustainable future for steelmaking in the UK, and we'll set out our long-term vision for the sector in our upcoming Steel Strategy.\" Sources said that that strategy was likely to be published either next month or early in the new year."
    },
    {
        "title": "Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'",
        "description": "Rachel Reeves has been accused of failing to \"support the great British pub\" as she promised in the budget, with owners facing skyrocketing business rates bills.",
        "url": "https://news.sky.com/story/budget-2025-hospitality-pleads-for-lifeline-as-rachel-reeves-accused-of-imposing-stealth-tax-13476732",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pubs-drink-alcohol-beer_7095046.jpg?20251129023048",
        "type": "Business",
        "Author": "Ben Bloch",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "Although the chancellor said in her budget speech that she is backing small retail and hospitality businesses, they are facing \"eye-watering\" business rates increases.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Rachel Reeves has been accused of failing to \"support the great British pub\" as she promised in the budget, with owners facing skyrocketing business rates bills. In her speech in the House of Commons on Wednesday, the chancellor said she was backing small businesses by introducing \"permanently lower tax rates for over 750,000 retail, hospitality and leisure properties - the lowest tax rates since 1991\". But while the government gave itself the powers to discount the business rates bills for high street businesses through legislation earlier this year, the chancellor only implemented a reduction of a quarter of what the government is able to, and she is being accused of imposing a \"stealth tax\". It has left small retail, hospitality, and leisure businesses questioning whether their businesses will be viable beyond April next year.  A Treasury spokesperson said: \"We're protecting pubs, restaurants and cafes with the budget's £4.3bn support package - capping bill rises so a typical independent pub will pay around £4,800 less next year than they otherwise would have. \"This comes on top of cutting licensing costs to help more venues offer pavement drinks and al fresco dining, maintaining our cut to alcohol duty on draught pints, and capping corporation tax.\" Business rates, which are a tax on commercial properties in England and Wales, are calculated through a complex formula of the value of the property, assessed by a government agency every three years, combined with a national \"multiplier\" set by the Treasury, giving a final cash amount. \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 Over the last few years, small businesses were given business rates relief of 75% to support them over the COVID pandemic, and Ms Reeves reduced that to 40% at last year's budget. The idea was that at the budget this year, the chancellor would remove that remaining relief in favour of reforming the business rates system to compensate for that drop, while shifting the tax burden on to much bigger businesses and companies like Amazon with lots of warehouse space. However, the chancellor only announced a 5p in the pound discount for small retail, hospitality, and leisure businesses, rather than the assumed 20p drop which the government gave itself the powers to implement, and which trade bodies had been lobbying for.  On top of that, small businesses have seen the government-assessed value of their property increase dramatically, which wipes out the discount, and sees their business rates bill shoot far above what they had previously been paying. One pub owner near Hull, Sam Caroll, has seen the assessed value of one of his two properties increase from £67,000 to £110,000 in just three years - a 64% increase. He told Sky News that there is a \"continual question\" of business viability, and while he thinks they can \"adapt\" in the short term, \"there will be a tipping point at some point\". Even at the moment, packing out their pubs seven nights a week, \"it's difficult for us to break even\", he said. There will be a discount for small businesses to transition to the higher business rates level, but by year three, almost the full amount is expected to be payable, and Mr Carroll described it as \"getting f***** slowly, instead of getting f***** overnight\". 👉 Listen to Sky News Daily on your podcast app 👈 Sean Hughes, who owns multiple hospitality venues in St Albans, has also seen vast increases in the assessed value of his properties, and was sharply critical of the transitional arrangements the government is implementing. He told Sky News: \"Fundamental business rate reform was promised and we have total chaos. If [the system] was fair, why would they need transitional relief periods?\" A spokesperson of the Valuation Office Agency (VOA), which assesses the value of commercial properties for business rates purposes, told Sky News: \"At the last revaluation, some sectors including hospitality were significantly affected by the pandemic, which resulted in much lower rateable values than they would have seen otherwise. Businesses that have now seen a recovery in trade are also likely to see an increase in their rateable value.\" Read more:Reeves accused of deliberately making UK finances look worseBudget is a big risk for Labour's election plans However, Sky News has seen evidence of businesses whose assessed value did not decrease when assessed during the pandemic, but actually rose, and has risen dramatically this year. Data compiled by the Pubs Advisory Service, shows that the number of pubs in the UK has decreased by nearly 5% in three years, but the average value of the properties has risen by an average of 36.82% per pub. And analysis by UK Hospitality, the trade body that represents hospitality businesses, has found that over the next three years, the average pub will pay an extra £12,900 in business rates, even with the transitional arrangements, while an average hotel will see its bill soar by £205,200.  The body adds that by 2028/29, an average pub's business rates will have increased by 76% and an average hotel's by 115%, compared to 16% for a distribution warehouse like the ones the web giants use. Hospitality entrepreneur Sacha Lord said he had \"never heard such fear\" within his sector. He said the business rates reform announced in the budget was \"nothing but a stealth tax\" and will mean that early next year there will be \"a raft of closures\". \"Pubs, independent restaurants and cafes are all at severe risk of closure,\" he warned. It's not just the business rates rise that is worrying owners - it is the increase in employers' national insurance implemented at the last budget, the increase in energy bills over the last few years, and the rise in the minimum wage, particularly for young people. With the budget set to squeeze disposal income, there is little room for price increases to make up the shortfall either. In a letter to the chancellor on Friday, Liberal Democrat deputy leader Daisy Cooper said small business owners \"have been pushed to tears as they're hit with the bombshell of higher business rates bills\", noting that \"the government has chosen not to use the full powers it gave itself to throw high streets a lifeline\". She added that businesses had been promised \"permanently lower business rates\", but it appears the government has \"broken yet another promise, by imposing a stealth tax not just on people, but on treasured high street businesses too\", and called on ministers to \"throw our high streets and Britain's hospitality sector a lifeline\". Conservative shadow business secretary Andrew Griffith published his own analysis of the government's budget measures on Friday morning, that found they will \"hammer British pubs\". Of the chancellor, he said: \"She pretended in her budget speech to be supportive, whilst the true detail is that a combination of rate revaluations and scrapping reliefs will leave most pubs paying thousands of pounds more than they cannot afford.\" Kate Nicholls, Chair of UKHospitality, said in a statement: \"The government promised in its manifesto that it would level the playing field between the high street and online giants. The plan in the budget to achieve this is quickly unravelling, and will deliver the exact opposite.\" She said they \"repeatedly warned the Treasury\" of the impending impacted of the value reassessment, but nonetheless, hospitality businesses are now facing \"eye-watering increases\". She added: \"We agree with its reforms to deliver permanently lower business rates for hospitality and we appreciate the package of transitional relief, but its current proposal is not delivering lower bills. A 20p discount for hospitality would. We urge the chancellor to revisit.\""
    },
    {
        "title": "Your Party co-founder Zarah Sultana refuses to enter group's conference hall",
        "description": "Zarah Sultana has boycotted day one of the Your Party conference over the expulsion of members of left-wing groups.",
        "url": "https://news.sky.com/story/zarah-sultana-boycotts-first-day-of-your-party-conference-over-witch-hunt-expulsions-13476925",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/431f60b611b1fa5cea03bb52f5ee63ebce66bab0bee4ddf24c501d4532493503_7095053.jpg?20251129063138",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-11-29 13:45:00",
        "Headline": "Your Party's \"historic\" founding conference has descended into chaos on day one as one of its co-founders stages a boycott over claims of a \"purge\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Zarah Sultana has boycotted day one of the Your Party conference over the expulsion of members of left-wing groups. Ms Sultana co-founded Your Party with Jeremy Corbyn in July, but the new movement has been marred with infighting from the outset. There was a row on the eve of conference after it emerged members of the Socialist Workers Party (SWP) had been expelled from Your Party, as its rules do not permit dual membership. However, a spokesperson for Ms Sultana branded this a \"witch hunt\" and said she won't be returning until her speech tomorrow. She said: \"Zarah met members outside the conference and condemned the recent expulsions. This witch hunt is indefensible. We must build a party that welcomes all socialists. She will not be entering the conference hall today.\" Ms Sultana later told Sky News the orchestrators of that witch hunt were \"nameless, faceless bureaucrats\" close to Mr Corbyn. However, she insisted she was not walking away and that her and the former Labour leader are \"definitely friends\". \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 \n                  Why has there been so much tension in Your Party?\n                 When asked the same question yesterday, Mr Corbyn said they were \"colleagues\". The pair have previously clashed over the party's structure. Your Party has also faced rows over its finances and policy positions, with two MPs quitting over a \"toxic culture\" in recent weeks. This conference is aimed at turning a new page and getting the party primed to fight the local elections in May. Your Party 'turning on socialists' Members of the SWP argue dual membership should be allowed as the SWP doesn't field election candidates. Lewis Nieslen, the SWP's national secretary, was expelled on Friday as he was on his way to Liverpool, where the conference is being hosted. Read more:Why has there been so much tension in Your Party? He told Sky News: \"With far-right Reform UK topping the polls and Starmer paving the way for them, we urgently need a new party that unites the whole left. \"It's wrong for those at the top of Your Party to turn fire on socialists like us who have been key to building Your Party on the ground, and are determined to make it the insurgent, inspiring force it can be.\"  Members of the socialist organisation Counterfire have also been banned from the conference, Sky News has learned. Cllr Michael Lavalette, who helped set up Your Party's Preston branch, told Sky News earlier this morning that he was not allowed to enter the venue today. He said he was told there is intelligence Counterfire was going to be disruptive, which he said is \"simply not true\". \"Counterfire is a very pro-Your Party organisation so I am not sure where that has come from,\" he said. He said it would be interesting to see the alleged intelligence \"because I've never said anything disruptive, I've been encouraging people to come\". Purge claims 'false' Ms Sultana has been advocating for what she calls \"maximum member democracy\" and believes anyone who is a socialist should be allowed in Your Party even if they are members of other parties. Her allies see the expulsions as an attempt to purge those supportive of her. There are many grassroots left-wing groups who want Your Party to be led by members rather than a single MP, a position Ms Sultana supports. Those groups have hit out at a \"clique\" of people close to Mr Corbyn from his days as Labour leader, who they accuse of making decisions without members' consent. However, a Your Party spokesperson said claims of a purge are \"false\". They said: \"Members of another national political party signed up to Your Party in contravention of clearly-stated membership rules - and these rules were enforced.\" They added: \"We're focused on hosting a democratic founding conference with thousands of members coming together to debate and decide the big issues. This is politics outside the Westminster mould: from the ground up, not the top down.\" Ms Sultana was not due to address the conference today with her speech coming on Sunday afternoon. A source close to her said she was still \"very much looking forward to it\". They added that it was an \"interesting\" choice of programming, giving voting on the party's key issues - including whether dual membership should be allowed - will be closed by the time she gives her keynote address, unlike Mr Corbyn who spoke this morning. Ms Sultana was not involved in organising the conference and claims she was frozen out of the process. But those in Mr Corbyn's camp claim she froze herself out when she quit the independent alliance (IA), the group of independent MPs and volunteers close to the former Labour leader, who have been stewarding the party's founding process leading up to the conference this weekend. Ms Sultana previously accused that group of being a \"sexist boys club\", in a major row in September that saw her launch an unauthorised membership portal and nearly upended the entire project.  Mr Corbyn acknowledged \"stresses and strains\" in the set-up of the party saying it had become \"a lot better in the last few days and weeks and we're going to get through this weekend\". Asked if they were friends, Mr Corbyn said they were \"colleagues in parliament, and we obviously communicate and so on\". The pair appeared at separate events on the eve of the party's inaugural gathering."
    },
    {
        "title": "Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference",
        "description": "Jeremy Corbyn has declined to say his Your Party co-founder Zarah Sultana is a friend as supporters of the new grouping gather in Liverpool.",
        "url": "https://news.sky.com/story/jeremy-corbyn-declines-to-call-zarah-sultana-a-friend-as-your-party-holds-first-conference-13476835",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-corbyn-sultana-your-party_7095035.jpg?20251129010221",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-11-29 00:45:00",
        "Headline": "Ms Sultana had previously claimed she was being \"sidelined\" by a \"sexist boys' club\" within the fledgling party.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Jeremy Corbyn has declined to say his Your Party co-founder Zarah Sultana is a friend as supporters of the new grouping gather in Liverpool. Speaking to Sky News on the eve of the conference, Mr Corbyn acknowledged \"stresses and strains\" in the set-up of the party but said it had become \"a lot better in the last few days and weeks and we're going to get through this weekend\". The former Labour leader has publicly clashed with Ms Sultana, the MP for Coventry South, over the launch and structure of the new party. Asked if they were friends, Mr Corbyn said they were \"colleagues in parliament, and we obviously communicate and so on\". The pair appeared at separate events on the eve of the party's inaugural gathering. Ms Sultana had previously claimed she was being \"sidelined\" by a \"sexist boys' club\" within the fledgling party. Mr Corbyn said her comments were an \"unfortunate choice of words\" but added that he had been more involved in the organisation of the conference than she had. The Islington North MP also said that Your Party was still waiting for Ms Sultana to transfer all of the funds she had raised from supporters. \"Obviously having money up front for a conference is a big help,\" he said. Ms Sultana has insisted she is transferring the donations in stages. The weekend gathering in Liverpool will see supporters choose between four options for a permanent party name: Your Party, Our Party, Popular Alliance, For the Many. The preferred choice of Ms Sultana - The Left - did not make the ballot. Similarly, the Coventry MP had said she favoured a co-leader approach, but members will only be able to pick between single leadership or collective leadership models. Speaking at her own pre-conference rally, Ms Sultana blamed a \"nameless, faceless bureaucrat\" for restricting the choices. Read more from Sky News:Why has there been so much tension in Your Party?Famous names affected by prostate cancer criticise screening decision The meeting also risked being disrupted by a series of member expulsions. One of those ejected, Lewis Nielsen, accused a \"clique\" of trying to \"take over\". Your Party sources said expulsions related to members of the Socialist Workers Party and that holding another national party membership was not allowed. Ms Sultana blamed a \"culture of paranoia at the top\" and said she believed the same people who had been briefing against her were now also expelling members. Mr Corbyn will open the conference on Saturday, while the results of the main decision-making votes will be announced on Sunday."
    },
    {
        "title": "Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit",
        "description": "Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised &#163;26bn in taxes.",
        "url": "https://news.sky.com/story/budget-2025-chancellor-rachel-reeves-fighting-claims-she-lied-about-deficit-13477021",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092361.jpg?20251126113017",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-11-29 16:16:00",
        "Headline": "The chancellor is under pressure after Treasury forecasters revealed public finances showed a £4.2bn surplus, while Rachel Reeves was pointing to a significant black hole that she needed to fill in this week's package of measures.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Rachel Reeves is fighting claims that she \"lied\" to the public about the state of the finances in the run-up to last week's budget - in which she raised £26bn in taxes. It follows a letter published by the Office for Budget Responsibility (OBR), the official watchdog which draws up forecasts for the Treasury, published on Friday. In it, OBR chair Richard Hughes (who is already under fire for the leak of the budget measures) said he'd taken the unusual step of revealing the forecasts it had submitted to Rachel Reeves in the 10 weeks before the budget, and which is normally shrouded in secrecy. The letter reveals this timeline, which has plunged the chancellor into trouble: 17 September - first forecast At this point, it was already known that the UK's growth forecast would be downgraded. The chancellor was told that the \"increases in real wages and inflation\" would offset the impact of the downgrade. The deficit forecast by the end of the parliament was £2.5bn. 20 October - second forecast \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 By this point, that deficit had turned into a small surplus of £2.1bn - i.e. the productivity downgrade has been wiped out and \"both of the government's fiscal targets were on course to be met\". 31 October - third forecast The final one before the Treasury put forward its measures. The finances were now net positive with a £4.2bn surplus. But the accusation is that Rachel Reeves was presenting an entirely different picture - that she had a significant black hole which needed to be filled. 13 October Ms Reeves tells Sky's deputy political editor Sam Coates the productivity downgrade has been challenging but added: \"I won't duck those challenges. Of course we're looking at tax and spending.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 27 October With the Treasury now aware the deficit had been wiped out, the Financial Times was briefed about a \"£20bn hit to public finances.\" 4 November Ms Reeves gave a dawn news conference in Downing Street, setting the stage for tax rises. She says she wants people \"to understand the circumstances we are facing... productivity performance is weaker than previously thought,\" adding that \"we will all have to contribute\". 10 November Ms Reeves tells BBC 5Live that sticking to Labour's promises not to raise taxes would require \"things like deep cuts in capital spending\". The stage seemed set for the nuclear option - the first income tax rise in decades. 13 November After headlines about a plot to oust Prime Minister Sir Keir Starmer, the Financial Times reported that the chancellor had dropped plans to raise income tax because of improved forecasts [which we now know hadn't changed since 31 October], putting the black hole closer to £20bn than £30bn.   The prime minister's spokesperson has insisted Rachel Reeves did not mislead voters and set out her choices, and the reasons for them, at the budget. But the issue has had enormous cut-through, with newspapers giving it top billing. The Sun's Saturday front page headline - \"Chancer of the Exchequer - fury at Reeves 'lies' over £30bn black hole\" - will not have been pleasant reading for ministers. She now has questions to answer about the chaotic run-up to the budget - of briefing and counter-briefing, which critics say now makes little sense. Tory leader Kemi Badenoch said on Saturday: \"We have learned that the chancellor misrepresented the OBR's forecasts. She sold her 'Benefits Street' budget on a lie. Honesty matters... she has to go.\" Economist Paul Johnson, former director of the respected Institute for Fiscal Studies (IFS), told The Times the chancellor's 4 November news briefing \"probably was misleading. It was clearly intended to have an impact and confirm what independent forecasters like [the National Institute of Economic and Social Research] and the IFS had been saying. \"It was designed to confirm a narrative that there was a fiscal hole that needed to be filled with significant tax rises. In fact, as she knew at the time, no such hole existed.\" Read more on budget fallout:Reeves accused over forecastsHospitality 'needs a lifeline' Rachel Reeves is doing a round of morning interviews on Sunday in which she'll be grilled over which of her budget measures will generate economic growth (which the government claimed was its number one priority), why they have been unable to tackle rising welfare spending and now about why markets and voters were left confused by dire warnings. She may claim that she never personally said there was a specific £30bn black hole or that the extra headroom generated by the tax rises will ensure she does not have to come back for more next year. In an interview with The Saturday's Guardian, Ms Reeves said she had \"chosen to protect public spending\" on schools and hospitals in the budget. She confirmed an income tax rise had been looked at, and insisted that OBR forecasts \"move around\" after the Treasury has submitted its planned measures. There are plenty more questions to come."
    },
    {
        "title": "Asylum seekers to be banned from using taxis for medical appointments",
        "description": "A ban on asylum seekers using taxis for most medical journeys has been announced by Home Secretary Shabana Mahmood.",
        "url": "https://news.sky.com/story/asylum-seekers-to-be-banned-from-using-taxis-for-medical-appointments-13476875",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-taxis-uk-general_7095134.jpg?20251129095419",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-29 09:41:00",
        "Headline": "Home Secretary Shabana Mahmood has said she is \"ending the unrestricted use\" of taxis by asylum seekers for hospital appointments.",
        "Content": "A ban on asylum seekers using taxis for most medical journeys has been announced by Home Secretary Shabana Mahmood. Under the new rules, taxi use for medical travel will be restricted to \"exceptional\" cases such as physical disability, pregnancy or serious illness - and these will require government approval. Ms Mahmood made the announcement after a BBC investigation found \"widespread\" use of taxis by asylum seekers, including for long journeys - with one case involving a 250-mile trip to see a GP. Transport for asylum seekers has cost the government an average of almost £16m a year, according to reports. All service providers will be required to stop using taxis for medical journeys from February next year and the government is now working to help introduce alternatives such as public transport. \"This government inherited Conservative contracts that are wasting billions of taxpayers' hard-earned cash,\" the home secretary said. \"I am ending the unrestricted use of taxis by asylum seekers for hospital appointments, authorising them only in the most exceptional circumstances. \"I will continue to root out waste as we close every single asylum hotel.\" Taxi drivers said the system was open to \"abuse\", accusing sub-contractors of inflating mileage, for instance by dispatching drivers over long distances to perform much shorter journeys. One told BBC Radio 4's Today programme he had been dispatched from Gatwick to take an asylum seeker more than 50 miles away in Reading to an appointment only 1.5 miles from his hotel. A second driver was reportedly sent from Heathrow, about 30 miles away, to bring the same man back from the appointment. The policy change comes after a Home Office review of transport arrangements for asylum seekers, it is understood. Asylum system overhaul It comes after a raft of measures to overhaul the asylum system was set out by Ms Mahmood earlier in November. In an interview with Sky News' political editor Beth Rigby, she admitted the UK's illegal immigrant numbers were \"too high\" - but said Reform UK leader Nigel Farage could \"sod off\" after he claimed she sounded like a Reform supporter. Read more:Britain's immigration system changes explainedHow the UK and Denmark's immigration policies compareAnalysis: The new hard woman of British politics  The \"restoring order and control\" plan includes: • The removal of more families with children - either voluntarily through cash incentives up to £3,000, or by force;• Quadrupling the time successful asylum seekers must wait to claim permanent residency, from five to 20 years;• Removing the legal obligation to provide financial support for those who have the right to work but choose not to;• Setting up a new appeals body to significantly speed up the time it takes to decide whether to refuse an application;• Reforming how the European Convention on Human Rights (ECHR) is interpreted in immigration cases;• Banning visas for countries refusing to accept deportees;• The establishment of new safe and legal refugee routes. The home secretary told MPs it is an \"uncomfortable truth\" that Britain's generous asylum offer, compared with other European countries, is attracting people to the UK - and for British taxpayers the system \"feels out of control and unfair\". However, the wide-ranging reforms have drawn criticism from Labour backbenchers. Nadia Whittome MP called Ms Mahmood's plans \"dystopian\" and \"shameful\", while Richard Burgon MP said she should change course rather than be forced into a U-turn later. So far this year, some 39,292 people have made the journey across the Channel, already more than last year's numbers, but still below the total for the record year of 2022."
    },
    {
        "title": "Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'",
        "description": "Rachel Reeves has been accused of failing to \"support the great British pub\" as she promised in the budget, with owners facing skyrocketing business rates bills.",
        "url": "https://news.sky.com/story/budget-2025-hospitality-pleads-for-lifeline-as-rachel-reeves-accused-of-imposing-stealth-tax-13476732",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pubs-drink-alcohol-beer_7095046.jpg?20251129023048",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "Although the chancellor said in her budget speech that she is backing small retail and hospitality businesses, they are facing \"eye-watering\" business rates increases.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Rachel Reeves has been accused of failing to \"support the great British pub\" as she promised in the budget, with owners facing skyrocketing business rates bills. In her speech in the House of Commons on Wednesday, the chancellor said she was backing small businesses by introducing \"permanently lower tax rates for over 750,000 retail, hospitality and leisure properties - the lowest tax rates since 1991\". But while the government gave itself the powers to discount the business rates bills for high street businesses through legislation earlier this year, the chancellor only implemented a reduction of a quarter of what the government is able to, and she is being accused of imposing a \"stealth tax\". It has left small retail, hospitality, and leisure businesses questioning whether their businesses will be viable beyond April next year.  A Treasury spokesperson said: \"We're protecting pubs, restaurants and cafes with the budget's £4.3bn support package - capping bill rises so a typical independent pub will pay around £4,800 less next year than they otherwise would have. \"This comes on top of cutting licensing costs to help more venues offer pavement drinks and al fresco dining, maintaining our cut to alcohol duty on draught pints, and capping corporation tax.\" Business rates, which are a tax on commercial properties in England and Wales, are calculated through a complex formula of the value of the property, assessed by a government agency every three years, combined with a national \"multiplier\" set by the Treasury, giving a final cash amount. \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 Over the last few years, small businesses were given business rates relief of 75% to support them over the COVID pandemic, and Ms Reeves reduced that to 40% at last year's budget. The idea was that at the budget this year, the chancellor would remove that remaining relief in favour of reforming the business rates system to compensate for that drop, while shifting the tax burden on to much bigger businesses and companies like Amazon with lots of warehouse space. However, the chancellor only announced a 5p in the pound discount for small retail, hospitality, and leisure businesses, rather than the assumed 20p drop which the government gave itself the powers to implement, and which trade bodies had been lobbying for.  On top of that, small businesses have seen the government-assessed value of their property increase dramatically, which wipes out the discount, and sees their business rates bill shoot far above what they had previously been paying. One pub owner near Hull, Sam Caroll, has seen the assessed value of one of his two properties increase from £67,000 to £110,000 in just three years - a 64% increase. He told Sky News that there is a \"continual question\" of business viability, and while he thinks they can \"adapt\" in the short term, \"there will be a tipping point at some point\". Even at the moment, packing out their pubs seven nights a week, \"it's difficult for us to break even\", he said. There will be a discount for small businesses to transition to the higher business rates level, but by year three, almost the full amount is expected to be payable, and Mr Carroll described it as \"getting f***** slowly, instead of getting f***** overnight\". 👉 Listen to Sky News Daily on your podcast app 👈 Sean Hughes, who owns multiple hospitality venues in St Albans, has also seen vast increases in the assessed value of his properties, and was sharply critical of the transitional arrangements the government is implementing. He told Sky News: \"Fundamental business rate reform was promised and we have total chaos. If [the system] was fair, why would they need transitional relief periods?\" A spokesperson of the Valuation Office Agency (VOA), which assesses the value of commercial properties for business rates purposes, told Sky News: \"At the last revaluation, some sectors including hospitality were significantly affected by the pandemic, which resulted in much lower rateable values than they would have seen otherwise. Businesses that have now seen a recovery in trade are also likely to see an increase in their rateable value.\" Read more:Reeves accused of deliberately making UK finances look worseBudget is a big risk for Labour's election plans However, Sky News has seen evidence of businesses whose assessed value did not decrease when assessed during the pandemic, but actually rose, and has risen dramatically this year. Data compiled by the Pubs Advisory Service, shows that the number of pubs in the UK has decreased by nearly 5% in three years, but the average value of the properties has risen by an average of 36.82% per pub. And analysis by UK Hospitality, the trade body that represents hospitality businesses, has found that over the next three years, the average pub will pay an extra £12,900 in business rates, even with the transitional arrangements, while an average hotel will see its bill soar by £205,200.  The body adds that by 2028/29, an average pub's business rates will have increased by 76% and an average hotel's by 115%, compared to 16% for a distribution warehouse like the ones the web giants use. Hospitality entrepreneur Sacha Lord said he had \"never heard such fear\" within his sector. He said the business rates reform announced in the budget was \"nothing but a stealth tax\" and will mean that early next year there will be \"a raft of closures\". \"Pubs, independent restaurants and cafes are all at severe risk of closure,\" he warned. It's not just the business rates rise that is worrying owners - it is the increase in employers' national insurance implemented at the last budget, the increase in energy bills over the last few years, and the rise in the minimum wage, particularly for young people. With the budget set to squeeze disposal income, there is little room for price increases to make up the shortfall either. In a letter to the chancellor on Friday, Liberal Democrat deputy leader Daisy Cooper said small business owners \"have been pushed to tears as they're hit with the bombshell of higher business rates bills\", noting that \"the government has chosen not to use the full powers it gave itself to throw high streets a lifeline\". She added that businesses had been promised \"permanently lower business rates\", but it appears the government has \"broken yet another promise, by imposing a stealth tax not just on people, but on treasured high street businesses too\", and called on ministers to \"throw our high streets and Britain's hospitality sector a lifeline\". Conservative shadow business secretary Andrew Griffith published his own analysis of the government's budget measures on Friday morning, that found they will \"hammer British pubs\". Of the chancellor, he said: \"She pretended in her budget speech to be supportive, whilst the true detail is that a combination of rate revaluations and scrapping reliefs will leave most pubs paying thousands of pounds more than they cannot afford.\" Kate Nicholls, Chair of UKHospitality, said in a statement: \"The government promised in its manifesto that it would level the playing field between the high street and online giants. The plan in the budget to achieve this is quickly unravelling, and will deliver the exact opposite.\" She said they \"repeatedly warned the Treasury\" of the impending impacted of the value reassessment, but nonetheless, hospitality businesses are now facing \"eye-watering increases\". She added: \"We agree with its reforms to deliver permanently lower business rates for hospitality and we appreciate the package of transitional relief, but its current proposal is not delivering lower bills. A 20p discount for hospitality would. We urge the chancellor to revisit.\""
    },
    {
        "title": "PM's rap battle with Sky's Beth Rigby goes viral - and one of the AI satirists behind it explains why",
        "description": "Satire has long been an occupational hazard for politicians - and while it has long been cartoons or shows like Spitting Image, content created by artificial intelligence (AI) is increasingly becoming the norm.",
        "url": "https://news.sky.com/story/pms-rap-battle-with-skys-beth-rigby-goes-viral-and-one-of-the-ai-satirists-behind-it-explains-why-13476750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-viral-video-of-rigby-and-starmer_7095041.jpg?20251129020940",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "A new page called the Crewkerne Gazette has been going viral in recent days for their videos using AI to satirise politicians - including Sir Keir Starmer's interview with Sky's political editor Beth Rigby.",
        "Content": " Satire has long been an occupational hazard for politicians - and while it has long been cartoons or shows like Spitting Image, content created by artificial intelligence (AI) is increasingly becoming the norm. A new page called the Crewkerne Gazette has been going viral in recent days for their videos using the new technology to satirise Rachel Reeves and other politicians around the budget. On Sky's Politics Hub, our presenter Darren McCaffrey spoke to one of the people behind the viral sensations, who is trying to remain anonymous. He said: \"A lot of people are drawing comparisons between us and Spitting Image, actually, and Spitting Image was great back in the day, but I kind of feel like recently they've not really covered a lot of what's happening. \"So we are the new and improved Spitting Image, the much better Have I Got News For You?\" He added that those kinds of satire shows don't seem to be engaging with younger people - but claimed his own output is \"incredibly good at doing\" just that. Examples of videos from the Crewkerne Gazette includes a rapping Kemi Badenoch and Rachel Reeves advertising leaky storage containers. \n                  Your Party co-founder Zarah Sultana refuses to enter group's conference hall\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 They even satirised our political editor Beth Rigby's interview with the prime minister on Thursday, when he defended measures in the budget and insisted they did not break their manifesto pledge by raising taxes. \"Crewkerne Man\" says providing satire for younger people is important as Labour is lowering the voting age. Asked why he is trying to be anonymous, the man said the project is not about one person - or even the whole group - but rather their output. He also claimed the UK is \"increasingly seeing arrests - especially with comedians\", pointing to the Graham Linehan case. \"So we just never know where the Labour Party is going to drive the policy next, in regards to free speech,\" he said. \"So for me, certainly it's a matter of safety.\" Watch Beth Rigby's actual interview with Sir Keir Starmer below. "
    },
    {
        "title": "Bigger than COVID? The graph that explains why AI is going to be so huge",
        "description": "Artificial intelligence is getting very good, very fast. Whether it's music, text, code or imagery, the time when it was reliably possible to tell the difference between AI and human outputs is disappearing at an alarming rate.",
        "url": "https://news.sky.com/story/bigger-than-covid-the-graph-that-explains-why-ai-is-going-to-be-so-huge-13476837",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-manthorpe-ai_7095050.png?20251129030236",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-11-29 01:24:00",
        "Headline": "Work by research firm Metr suggests AI is doubling capacity every seven months and that it's likely \"there's at least another five years of this\".",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n  Artificial intelligence is getting very good, very fast. Whether it's music, text, code or imagery, the time when it was reliably possible to tell the difference between AI and human outputs is disappearing at an alarming rate. Yet for all their wizardry, AIs can also be quite useless. They make things up and misunderstand instructions. They are brilliant as toys but incompetent as assistants. All this makes it hard to know how to put AI into perspective. Is it the most important technological trend since the iPhone? Or since the industrial revolution? At this distance, it's hard to say. There are industry measures to assess the intelligence of AI models, known as benchmarks. These too show rapid improvement. When Google released Gemini 3, its latest AI upgrade, last week, it broke records across the board. But benchmarks are too narrow to be totally reliable guides to ability and potential. This, says Marc Warner, is why you need to zoom out and look at the overall trend. When you do, he says, you see \"a very strong exponential\". \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 \n                  Tilly Norwood: Creator of AI actress insists she's not designed to steal jobs\n                 \n                  OpenAI denies allegations ChatGPT is responsible for teenager's death\n                 An exponential trend is where growth doubles and keeps on doubling. At first progress seems slow, but, before long, the line on the chart is rising almost vertically. \"Nothing, nothing, nothing, everything,\" as Dr Warner puts it. It's a pattern familiar from the COVID pandemic, where it caught out politicians and public health officials around the world. Now, says Dr Warner, who runs British tech company Faculty, it's happening with AI - and he's worried we don't have a plan. \"We saw in COVID, if you don't prepare for exponentials properly, they can really hurt you when things start to get very serious,\" he says. Could AI be as disruptive as COVID? It depends if its growth keeps going, Dr Warner says, and if AI is good at as many things as it appears to be. \"But if those were true, this would be way bigger than COVID,\" he says. \"COVID was a temporary shift…This will be a more permanent reshaping of how everything operates.\" When will AI top out? Dr Warner, who trained as a physicist before moving from academia into tech, has been here before. In March 2020, Faculty was modelling patient data for the NHS. He saw the virus doubling at a faster rate than the government appeared to appreciate. He got in touch with his brother Ben, who was working as a data scientist in Downing Street. Late on the evening of 12 March, Ben and Marc explained the situation to the prime minister's chief of staff, Dominic Cummings. Ten days later, the country was in lockdown. \"Marc Warner is one of the smartest and most ethical people I have ever met in my life,\" Mr Cummings later told MPs. \"I think that without him, thousands of people would be dead.\" Eventually, Dr Warner says, AI will stop getting better, simply because the tech companies run out of energy to train their power-hungry models. \"The amount of energy you'd need to train these models would be more than exists on the whole planet,\" he says. \"So this has to top out at some point.\" 'Doubling every seven months' However, the data he's looking at - a comparison of humans and AI models on software development tasks by AI research firm Metr - suggests AI is doubling capacity every seven months and that it's likely \"there's at least another five years of this\". So, by his estimate, there are a lot of changes to come. Some will be hugely positive. But inevitably, there will be downsides. \"As with any new technology, there will come a bunch of disruptions… That's why I feel like it's so important to actually think seriously about if this holds true, what it would mean,\" says Dr Warner. \"We will be able to manage it, but we'll only be able to do that if we actually have a real plan.\" Does he think the government has one? \"In the short term, I think the government's actually doing a decent job,\" he says. \"They announced this sovereign AI fund, I think that's a good thing.\" He also praises the UK's AI Security Institute, which investigates technical risks. Read more from Sky News:AI satirist on Sky correspondent's rap battle with PMThere's a new Bobbi on the beat - and they're powered by AI Just as in the pandemic, huge uncertainty surrounds even the best forecasts of AI. Metr's data only measures software development, and only assesses if AI has a 50% chance of succeeding at a task, so it's hard to generalise from. Then there's the economic uncertainty. There may be a speculative bubble around AI, Dr Warner says, but that doesn't make the underlying technology any less impactful. \"It feels to me something like we've gone from the first [aeroplane] flight to something like Concorde in a seven-year period. And that is a very big deal.\" Especially when there might be a lot more to come."
    },
    {
        "title": "'Women are afraid to get pregnant': Fighting mercury poisoning from illegal gold mining in Brazil",
        "description": "\"Many women end up losing their children,\" says Alessandra Korap, a community leader of the Munduruku people from the Brazilian Amazon.",
        "url": "https://news.sky.com/story/women-are-afraid-to-get-pregnant-indigenous-people-fight-mercury-poisoning-from-illegal-gold-mining-in-brazil-13474997",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-alessandra-korap-munduruku_7091729.jpg?20251125180544",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "Munduruku people in Brazil are battling miscarriages and loss of sight and sound, a community leader tells Sky News.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  \"Many women end up losing their children,\" says Alessandra Korap, a community leader of the Munduruku people from the Brazilian Amazon. \"Either they can't get pregnant, or they lose their [foetus] over time. \"So, women are afraid of getting pregnant.\" For centuries, the indigenous Munduruku have lived in an area across what is now the states of Amazonas and Para in northern Brazil, especially around the Tapajos River. But in recent decades, villagers had been plagued by curious symptoms that they didn't realise could be related: children unable to lift their heads, adults unable to walk any more, muscle tremors, memory loss, fading hearing and vision, miscarriages. Now they are finally closing in on the cause. The Tapajos river, their lifeblood, is laced with highly toxic mercury. \n                  Ex-Brazil president Jair Bolsonaro says he tried to prize open ankle tag after 'hallucinations'\n                 \n                  Ex-Brazil president Jair Bolsonaro 'tried to open ankle monitor' with soldering iron in 'escape attempt', court documents allege\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                 Mercury poisoning is hard to diagnose because symptoms resemble other degenerative illnesses like Parkinson's or Alzheimer's, says Gabriela Arrifano, professor of mercury toxicology at the Federal University of Para. \"But there is now enough evidence to relate the signs and symptoms found in people exposed to mercury.\" And they have no doubts about where it's coming from. \"We have robust evidence that mercury emissions to the environment comes from illegal gold mining activity,\" says Prof Arrifano in her university lab, where she analyses hair and blood samples. When researchers began studying the symptoms, Alessandra \"didn't know what mercury was\", she says. Hand in hand with drugs In Brazil, gold mining is outlawed in indigenous territory. Yet swathes of it are pockmarked with red and orange craters from illicit gold projects - a trend fuelled by record-high prices around the world. The underground trade works hand in hand with organised crime groups, sharing the same makeshift runways and roads through the Amazon rainforest, and using the gold to launder drug money. The gold, once locked in the mountainside of the Andes, was gradually washed away by ancient rain into the Amazon basin. To extract it, illegal miners churn up the riverbed and combine it with mercury because it binds to gold. The process releases mercury into the air, water and soil. Over time, the mercury coursing through the waterways accumulates in river fish, which indigenous communities eat for breakfast, lunch, dinner. One study found one in five fish in markets in northern Brazil had dangerous levels of mercury (0.5 micrograms per gram). Once in the guts, it enters the bloodstream and makes its way to the brain, where it can cause lesions. Even low levels of exposure can disrupt most of the body's systems, whether reproductive, skin, or nervous systems. Prof Arrifano says people's visual field shrinks so they lose their peripheral vision. \"And then you can imagine this is very hard for people who live in the forest that need their complete senses.\" The Munduruku have been fending off mining on their land since 1960s, Alessandra tells Sky News in Para's state capital Belem, as the city hosted international climate talks. Her symptoms aren't so bad. \"I feel tingling in my hands, brain fog, forgetfulness, that is because of the mercury.\" But her niece can't walk or talk. Alessandra suspects it's got something to do with the girl's grandfather being a fisherman. \"So maybe because of this, the mother ended up ingesting a lot of mercury in her body that went to the child.\" The toxic metal also accumulates in placentas, breast milk and children, often two or three times the safe threshold for pregnant women. One study across all of Brazil identified 668 cases of mercury poisoning, but that's thought to be a vast underestimate due to poor data collection and lack of access to healthcare. How global gold prices fuel the problem The current administration under President Luiz Inacio Lula da Silva has been attempting a widespread crackdown on illegal mining. Its environmental protection agency, IBAMA, swoops in by helicopter, blows up equipment, torches makeshift buildings and flies out again. It has also frozen assets and ended the presumption of \"good faith\" - that gold for sale was extracted from lawful sights. In the Yanomami Indigenous Territory in the far north, federal government figures show a 94% reduction in active illegal mining areas between 2023 and 2025. But some of these miners have set up camp elsewhere, and the ever-soaring price of gold is making it \"harder\" to combat, one of Brazil's top officials admits. \"We thought that the amount would be reduced, and initially it did,\" Adalberto Maluf, national secretary for water resources in the environment ministry, overseeing the crackdown, tells Sky News in Belem. \"But I think it's not going as fast as we wanted, or we thought it could happen, mainly because the price of gold continues rising.\" Read more from Sky News:Software issue hits thousands of Airbus planesHong Kong residents stunned by tower tragedyBigger than COVID? Why AI is going to be so huge The problem is not unique to Brazil, but common across South America and parts of Africa. Prices are surging as investors seek security from market turbulence and geopolitical tensions - upping the incentive for miners despite the risks, says Julia Yansara from the Financial Accountability and Corporate Transparency Coalition. \"It is driving illegal gold miners into new areas. And it's driving new criminal groups to get involved in this for the first time.\" 'If we don't fight, we are crushed' The Munduruku were formerly known as an aggressive group, feared by neighbouring peoples, before being fought down by colonisers who annexed their territory. This year, they capitalised on the global attention on Brazil as it hosted the UN climate talks (COP30) to fight for their land once again. Halfway through the conference they peacefully blocked the entrance, forcing a meeting with officials that then won them the legal rights to two further portions of territory. When the land is demarcated, it's easier to pressure the government to protect the land, says Alessandra. \"If we don't fight, we are crushed, we are taken over.\" But she too knows they are fighting a rising tide. \"When the price increases, everyone wants to invade our land, to pollute the water, to destroy the forest, because they need to take the gold to sell to other countries.\" But those buyers don't know \"what is happening to our bodies, to our lives\", she adds."
    },
    {
        "title": "Netflix executive Lloyd screen-tested for top Channel 4 job",
        "description": "A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/netflix-executive-lloyd-screen-tested-for-top-channel-4-job-13476859",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Entertainment",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-29 08:16:00",
        "Headline": "Emma Lloyd, whose previous employers include Sky, is among the candidates being considered to replace Alex Mahon as chief executive of the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A senior executive at Netflix is among the contenders vying to become the next boss of Channel 4, the state-owned broadcaster. Sky News has learnt that Emma Lloyd, the streaming giant's vice-president, partnerships, in Europe, the Middle East and Africa, is one of a handful of media executives shortlisted to replace Alex Mahon as Channel 4's chief executive. Ms Lloyd, whose previous employers included Sky, the immediate parent company of Sky News, also served on the board of Ocado Group, from which she stepped down this month after nine years as a non-executive director. She is understood to be a serious contender to take the helm at Channel 4, with other candidates understood to include Jonathan Allan, the interim chief executive who has also been its chief commercial officer and chief operating officer. The identities of others involved in the recruitment process was unclear this weekend. The appointment of a successor to Ms Mahon, Channel 4's long-serving boss, comes at an important time for the company, and the broader public service broadcasting sector. Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary, Lisa Nandy, although the process to land a new chief executive is being steered from within the company. \n                  Former Travis Perkins boss Cooper to chair Channel 4\n                 \n                  BBC and Channel 4 should 'merge' to survive, Sir Phil Redmond says\n                 \n                  AO chair Cooper interviewed for Channel 4 chair job\n                 In September, Geoff Cooper, who chairs the online electrical goods retailer AO, was named Channel 4's next chairman. He replaced Sir Ian Cheshire, the former Kingfisher boss, who held the role for a single three-year term. Channel 4 saw off the prospect of privatisation under the last Conservative government, with Ms Mahon a particularly vocal opponent of the move. Nevertheless, Channel 4, which is funded by advertising revenues, faces significant financial challenges amid shifting - and in many cases waning - consumption of traditional television channels. In the aftermath of a sale of the company being abandoned, its board last year unveiled Fast Forward, a five-year strategy designed to \"elevate its impact across the UK and stand out in a world of global entertainment conglomerates and social media giants\". \"While getting ourselves into the right shape for the future is without doubt the right action to take, it does involve making difficult decisions,\" Ms Mahon said at the time. \"I am very sad that some of our excellent colleagues will lose their jobs because of the changes ahead. \"But the reality of the rapid downshift in the UK economy and advertising market demand that we must change structurally. \"As we shift our centre of gravity from linear to digital our proposals will focus cost reductions on legacy activity.\" Ms Mahon's departure earlier this year saw her quit to run Superstruct, a music festival business owned by private equity backers. In recent weeks, her name has been linked with the BBC director-general's post, which is soon to be vacated by Tim Davie. Mr Davie announced this month that he would step down amid fierce criticism of the Corporation's handling of a misleadingly edited speech made by President Donald Trump, which was included in an edition of the current affairs programme last year. The public service broadcasting arena will also undergo significant change if a prospective bid by Sky for the television arm of ITV progresses to a definitive transaction. Talks between the two companies emerged earlier this month. In addition to the corporate developments in British broadcasting, the government has also confirmed a Sky News report that a search for a successor to Lord Grade, the Ofcom chairman, is under way. On Saturday, Netflix declined to comment on Ms Lloyd's behalf."
    },
    {
        "title": "PM's rap battle with Sky's Beth Rigby goes viral - and one of the AI satirists behind it explains why",
        "description": "Satire has long been an occupational hazard for politicians - and while it has long been cartoons or shows like Spitting Image, content created by artificial intelligence (AI) is increasingly becoming the norm.",
        "url": "https://news.sky.com/story/pms-rap-battle-with-skys-beth-rigby-goes-viral-and-one-of-the-ai-satirists-behind-it-explains-why-13476750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-viral-video-of-rigby-and-starmer_7095041.jpg?20251129020940",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-29 00:01:00",
        "Headline": "A new page called the Crewkerne Gazette has been going viral in recent days for their videos using AI to satirise politicians - including Sir Keir Starmer's interview with Sky's political editor Beth Rigby.",
        "Content": " Satire has long been an occupational hazard for politicians - and while it has long been cartoons or shows like Spitting Image, content created by artificial intelligence (AI) is increasingly becoming the norm. A new page called the Crewkerne Gazette has been going viral in recent days for their videos using the new technology to satirise Rachel Reeves and other politicians around the budget. On Sky's Politics Hub, our presenter Darren McCaffrey spoke to one of the people behind the viral sensations, who is trying to remain anonymous. He said: \"A lot of people are drawing comparisons between us and Spitting Image, actually, and Spitting Image was great back in the day, but I kind of feel like recently they've not really covered a lot of what's happening. \"So we are the new and improved Spitting Image, the much better Have I Got News For You?\" He added that those kinds of satire shows don't seem to be engaging with younger people - but claimed his own output is \"incredibly good at doing\" just that. Examples of videos from the Crewkerne Gazette includes a rapping Kemi Badenoch and Rachel Reeves advertising leaky storage containers. \n                  Your Party co-founder Zarah Sultana refuses to enter group's conference hall\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Budget 2025: Chancellor Rachel Reeves fighting claims she 'lied' about deficit\n                 They even satirised our political editor Beth Rigby's interview with the prime minister on Thursday, when he defended measures in the budget and insisted they did not break their manifesto pledge by raising taxes. \"Crewkerne Man\" says providing satire for younger people is important as Labour is lowering the voting age. Asked why he is trying to be anonymous, the man said the project is not about one person - or even the whole group - but rather their output. He also claimed the UK is \"increasingly seeing arrests - especially with comedians\", pointing to the Graham Linehan case. \"So we just never know where the Labour Party is going to drive the policy next, in regards to free speech,\" he said. \"So for me, certainly it's a matter of safety.\" Watch Beth Rigby's actual interview with Sir Keir Starmer below. "
    }
]