[
    {
        "title": "Donald Trump imposes sanctions on Russia's two biggest oil firms in major policy shift",
        "description": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin.",
        "url": "https://news.sky.com/story/donald-trump-imposes-sanctions-against-russias-two-biggest-oil-companies-as-frustration-grows-with-vladimir-putin-over-the-ukraine-war-13455515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-sanctions_7058998.jpg?20251023000042",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:21:00",
        "Headline": "The US has imposed sanctions against Rosneft, Lukoil and dozens of subsidiaries due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\".",
        "Content": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin. In a major policy shift, new restrictions have been unveiled against Rosneft and Lukoil - as well as dozens of subsidiaries - due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". \"Now is the time to stop the killing and for an immediate ceasefire,\" Treasury Secretary Scott Bessent said in a statement. \"Given President Putin's refusal to end this senseless war, Treasury is sanctioning Russia's two largest oil companies that fund the Kremlin's war machine. We encourage our allies to join us in, and adhere to, these sanctions.\" The move marked a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine. Trump frustrated with Putin The US president has resisted pressure to impose energy sanctions on Russia, hoping that Putin would agree to end the fighting. But with no end in sight, he said he felt it was time. \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Putin-Trump Budapest meeting in doubt as official says 'no plan for immediate future'\n                 Mr Trump explained he has a \"very good relationship\" with his Russian counterpart, but felt he had to cancel their planned meeting as \"it didn't feel right to me\". In a sign of growing frustration, he told reporters: \"It didn't feel like we were going to get to the place we have to get. So I cancelled it. But we'll do it in the future. \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" He also hinted that the sanctions could be lifted if the Russian president was prepared to cooperate in peace talks. \"We hope that they [the sanctions] won't be on for long,\" he said in the Oval Office. \"We hope that the war will be settled.\"  Trump wants Xi to help with Ukraine Ahead of a meeting next week with Chinese President Xi Jinping in South Korea, Mr Trump said he would like Beijing to help put pressure on Moscow to halt the fighting. \"I think he [Xi] can have a big influence on Putin. I think he can have a big influence ... he's a respected man. He's a very strong leader of a very big country. And we will certainly be talking about Russia-Ukraine,\" he said. Xi and Putin have formed a strategic alliance between their countries.  Ukraine denied Tomahawk missiles However, Mr Trump warned he is not prepared to provide Ukraine with long-range Tomahawk missiles, which Kyiv has requested. He explained it would take the Ukrainians up to a year to learn how to use the \"highly complex\" weapons. \"The only way a Tomahawk is going to be shot ... is if we shot it. And we're not going to do that. \"It takes a year of intense training to learn how to use it, and we know how to use it, and we're not going to be teaching other people.\""
    },
    {
        "title": "Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy ",
        "description": "The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy.",
        "url": "https://news.sky.com/story/trumps-sanctions-are-no-slap-on-the-wrist-theyre-a-punch-to-the-gut-of-moscows-war-economy-13455563",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin_6992362.jpg?20250816064331",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-10-22 23:52:00",
        "Headline": "If energy prices surge or allied unity splinters, Trump could find himself on the ropes following his announcement of sanctions on Russia's two biggest oil firms.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy. Oil giants Rosneft and Lukoil are the twin engines pumping money through Russia's military veins. Washington framed the bold move as a bid to \"degrade the Kremlin's ability to raise revenue for its war machine\". Oil is Russia's bloodstream, and the Trump Treasury just cut off the blood flow. But every blow struck in the ring comes with the risk of self-inflicted pain, and there's potential for collateral damage. By squeezing Russia's oil sector, the president is tightening the global market's chest - and America's own pump could feel the pressure. The White House is gambling that the geopolitical payoff will ultimately outweigh the domestic sting. \n                  No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit\n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Scottish and UK governments locked in dispute over £26m cost of Donald Trump and JD Vance visits\n                 \"These are tremendous sanctions and I hope they don't last long,\" Mr Trump said. That mix of swagger and caveat summed up his approach - maximum pressure, but with an eye on prices back home. Europe rushed to mirror Washington's stance, adding restrictions on imports and tightening loopholes in shipping. The EU was clearly signalling that it's in Trump's corner, that the Western alliance holds.  'Wasted journey' On both sides of the Atlantic, they know that Moscow will seize on any disunity and slip through the cracks. An Oval Office meeting with the NATO Secretary-General Mark Rutte provided the diplomatic stagecraft. Mr Trump repeated that he'd cancelled a planned summit with Vladimir Putin because he \"didn't want to have a wasted journey\". Mr Rutte played the part of loyal ally, twice labelling the US president \"the only one who can get this done\".  Earlier, Mr Rutte played down my suggestion that his visit indicated Trump's meeting with Zelensky last Friday had been a disaster. It wouldn't be the first time Mr Rutte, who famously referred to Mr Trump as \"Daddy\", has poured oil on troubled waters. But it's Moscow's apparent refusal to accept Trump's terms that has put plans for another summit with Putin on hold. China's diplomatic influence with Russia could give it some leverage when Mr Trump meets Xi Jinping for trade talks next week. The US president's sanctions are more than punishment - they're a strategic gamble to corner Putin - but the margin of error is razor thin. If energy prices surge or allied unity splinters, Mr Trump could find himself on the ropes."
    },
    {
        "title": "Dublin protests: Prams filled with fireworks as teens - and children as young as seven - clash with police ",
        "description": "At least 23 people have been arrested during a second night of violent disorder near an asylum hotel in Dublin.",
        "url": "https://news.sky.com/story/police-officers-hurt-in-second-night-of-violence-in-dublin-13455441",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dublin-protests_7058997.jpg?20251023000023",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 19:56:00",
        "Headline": "Protesters have again clashed with police close to a hotel housing asylum seekers in Dublin following an alleged sexual assault.",
        "Content": " At least 23 people have been arrested during a second night of violent disorder near an asylum hotel in Dublin. Two police officers were taken to hospital with injuries sustained during clashes with protesters - including one who was struck on the head by a bottle. A Sky News crew was caught in the confusion as police charged at crowds, who were throwing fireworks, stones and other debris. By Connor Gillies, news correspondent The Telegram and WhatsApp group chats were alive with activity organising night two of unrest here on the edge of Dublin.  City chiefs halted trams and buses to this part of the Irish capital in a bid to reduce the number of mobs coming from other areas to fight police.  It got ugly, and fast.  I witnessed children as young as seven throwing bricks at riot officers, that were standing in rows 5ft deep. Balaclava-clad thugs were spotted pulling and shaking bollards on the roadside in an effort to dislodge the tarmac to use as projectiles.   Pepper spray from fire extinguisher-size canisters pelted the eyes of those who dared to confront law enforcement.  Teenagers dragged a baby pram filled with fireworks lit their missiles as they chucked them at officers who were charging forward in a bid to get the hundreds of locals under control.  There is palpable, deep anger in this community after the alleged sexual assault of a 10-year-old girl near a large hotel housing asylum seekers.  The recent incident has fuelled a \"get them out\" pitchfork mentality that authorities, so far, appear to be struggling to get a grip of. It is the third night of demonstrations at the Citywest Hotel following an alleged sexual assault in the early hours of Monday morning. A demonstration in the wake of the incident, which allegedly involved a 10-year-old girl, turned violent on Tuesday night. A police officer was injured and six arrests were made. A 26-year-old man, who cannot be named due to rules that apply to all sexual assault cases in the Republic of Ireland, appeared in court on Tuesday charged over the alleged attack. Police had earlier pledged a \"robust response\" if the violence continued. Between 7pm and 8pm, hundreds of protesters faced off with around 40 uniformed officers. The uniformed officers were replaced with the Public Order Unit, who were carrying plastic shields and additional body protection. Protesters detained after stand-off Hundreds of protesters had been facing off against the public order unit of the Irish police force along Citywest Drive. While large parts of the crowd dispersed throughout the night, an additional public order unit was deployed to tackle those remaining at the protest shortly after 10pm. Several of those caught between the two units were tackled and detained as they tried to flee. Justice minister Jim O'Callaghan said \"many have been arrested\" and \"more will follow\" - and went on to praise officers who had responded professionally to \"thuggish violence\" in the area. Mr O'Callaghan vowed that those arrested would be \"charged, named and dealt with relentlessly\" by the criminal justice system."
    },
    {
        "title": "Boy, 15, who murdered Harvey Willgoose sentenced to life with minimum term of 16 years",
        "description": "A 15-year-old boy has been sentenced to life with a minimum term of 16 years for murdering Sheffield schoolboy Harvey Willgoose in a lunch break knife attack.",
        "url": "https://news.sky.com/story/boy-15-who-murdered-harvey-willgoose-sentenced-to-life-with-minimum-term-of-16-years-13454896",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-harvey-willgoose-murder_7058308.jpg?20251022125248",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 14:47:00",
        "Headline": "Mohammed Umar Khan, who can now be named, took a 13cm hunting knife to school and used it to kill 15-year-old Harvey Willgoose outside the cafeteria.",
        "Content": " A 15-year-old boy has been sentenced to life with a minimum term of 16 years for murdering Sheffield schoolboy Harvey Willgoose in a lunch break knife attack. Harvey, also 15, was stabbed twice in the chest by Mohammed Umar Khan outside their school cafeteria in February this year. At Sheffield Crown Court, Judge Mrs Justice Ellenbogen told Mohammed Umar Khan his \"senseless acts\" followed a \"long-standing interest in weapons\". She added the murder had a \"devastating effect on Harvey's family\" and their lives have been \"blighted by your actions\". As it happened: How sentencing unfolded Khan, who can now be named after the judge lifted reporting restrictions, took a 13cm hunting knife with him to All Saints Catholic High School. CCTV showed Harvey arriving at the school, with earlier footage showing the attacker trying to provoke Harvey, who remained calm. The attacker was also seen in footage holding a knife in the canteen before the stabbing. Khan had previously admitted to manslaughter but denied murder. But in August, he was found guilty at Sheffield Crown Court by a majority verdict of 11 to one. Defence lawyers claimed the boy had \"lost control\" after years of bullying and \"an intense period of fear at school\". He told teachers after the stabbing \"you know I can't control it\" and \"I'm not right in the head\".  Doesn't look like he's sorry Speaking outside court, Harvey Willgoose's mother, Caroline, said she was relieved the case was over. \"I feel like a big weight's been lifted off my shoulders, to be honest. He [Khan] doesn't look like he's sorry but I just hope that's his mask.\" Caroline Willgoose, whose father died last week, also spoke to Sky News about the anti-knife campaigns she was developing following the death of Harvey. \"He were funny, he were caring, and that's how I want him to be remembered. I hate him being remembered as the school kid that got stabbed to death in school. He'd hate that.\" Asked about her thoughts of Khan, she said: \"I don't really have any feelings for him. I don't know whether they'll come... but I do feel like he's been let down. They've both been let down.\"  'Popular, energetic, full-loving' Steve Davies, chief executive of St Clare Catholic Multi Academy Trust, which operates All Saints Catholic High School, described Harvey as \"a popular, energetic and fun-loving pupil who is dearly missed every day by the whole school community\". He added: \"Our thoughts are first and foremost with Harvey's family, loved ones and friends. We cannot begin to imagine the depth of their loss and our deepest sympathies go out to them today and every day. \"Since the conclusion of the trial, the school and trust have been able to engage fully with a number of ongoing investigations aimed at answering key questions about Harvey's tragic death. We will continue to work closely with these partners and cooperate fully with these investigations.\" 'Senseless acts' had 'devastating effect' During sentencing on Wednesday, Judge Mrs Justice Ellenbogen told Khan his \"senseless acts have had a devastating effect\". \"Harvey's family is haunted by the CCTV footage of the events of that day, and, exhausted by the trauma in their lives in which his absence is felt every day.\" \"It is clear that Harvey was also a popular pupil whom students and teachers held in affection. Their lives, too have been blighted by your actions, which have affected them deeply and will continue to do so.\" Read more:Sheffield United players pay tributeCommunity left in shock Mrs Ellenbogen added that Khan had a \"long-standing interest in weapons\" and images on his mobile phone showed him posing with hunting-style knives, a machete and a hammer. She told Khan he had a \"long-standing inability to manage your anger\", including three separate school incidents between November 2024 and January 2025 in which he had become angry and aggressive. The judge told him he would serve a minimum term of 16 years minus time spent in custody, which works out at around 15 years, three months. Khan did not show any obvious emotion as the sentence was passed. Following the murder, the parents of Harvey, Caroline and Mark Willgoose, told Sky News they wanted to see knife arches \"in all secondary schools and colleges\".  'Our mental health has been destroyed' Ahead of sentencing, Harvey's sister, Sophie Willgoose, described in her victim impact statement the family's \"world was shattered forever\" after they were told about his murder. She added: \"The defendant didn't just end Harvey's life, he ended ours too. Our mental health has been destroyed.\" Richard Thyne KC, prosecuting, said that while Khan had no previous convictions, he had previously taken an axe and a knife separately on to the school premises. Khan and Harvey had \"fronted up\" to one another in confrontations at school, he added. Attack was 'split-second decision' The detective who led the murder investigation said there was evidence that Khan was friends with Harvey until days before the fatal incident. Following the trial, Detective Chief Inspector Andy Knowles said a relatively trivial incident had led to a \"split-second decision to do something which just had dire and terrible consequences\". \"It was the knife that escalated this so quickly and led to consequences which you can't undo or take back afterwards,\" he added. Focus on knife crime prevention Kilvinder Vigurs, South Yorkshire's deputy mayor for policing and crime, said the trial \"marks a difficult moment for our region\" and more must be done \"to protect our children from the threat of knife crime\". In a statement, he said: \"Knife crime is not just a policing issue, it's a societal one. Our joint focus must be on prevention, education, and early intervention.\""
    },
    {
        "title": "All survivors who quit grooming gang inquiry will return if Jess Phillips resigns",
        "description": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns.",
        "url": "https://news.sky.com/story/jim-gamble-a-frontrunner-to-become-chair-of-grooming-gang-inquiry-withdraws-sky-news-understands-13455102",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:00:00",
        "Headline": "In a letter to the home secretary, the survivors said the minister's conduct shows she is \"unfit\" to oversee a process that requires them to trust the government.",
        "Content": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns. The four women who have resigned this week have written to Home Secretary Shabana Mahmood, calling for Ms Phillips to step down and all survivors to be consulted on appointing a senior judge as chair with no major conflicts of interest. Ms Phillips told parliament on Tuesday suggestions the scope of the inquiry was to be expanded from just grooming gangs were \"categorically untrue\". But leaked consultation documents and texts between the safeguarding minister and survivor Fiona Goddard show the survivors' concerns that the scope would be expanded were valid. The survivors' letter says: \"Being publicly contradicted and dismissed by a government minister when you are a survivor telling the truth takes you right back to that feeling of not being believed all over again. \"It is a betrayal that has destroyed what little trust remained.\" Phillips 'unfit' to oversee process The survivors have demanded the scope of the inquiry remain \"laser-focused\" on grooming gangs and called for victims to be free to speak to support networks without fear of reprisal. An independent mental health professional should replace the current victim liaison lead, they also wrote. The letter to Ms Mahmood says: \"Her [Ms Phillips'] conduct over the last week has shown she is unfit to oversee a process that requires survivors to trust the government. Her departure would signal you are serious about accountability and changing direction.\" The survivors describe their demands as \"the absolute bare minimum for survivors to trust that this inquiry will be different from every other process that has let us down\". Sky News has approached the Home Office for a comment on the victims' letter. Read more on Sky News:Inquiry 'won't be watered down'Grooming survivor quits inquiryVictim 'lives with trauma every day Frontrunner quits over 'toxicity' The letter was sent hours after one of the frontrunners to become chair of the inquiry withdrew, blaming \"vested interests\" and \"political opportunism and point-scoring\". Ex-police chief and child protection specialist Jim Gamble told the home secretary in a letter there was a \"highly charged and toxic environment\" around the appointment process and victims \"deserve better\". Speaking to Sky News, he said he originally viewed the job as an \"opportunity of a lifetime\" but changed his mind due to a \"growing level of toxicity\" and misinformation. He said he had more than 20 years' experience working with abuse survivors and understood the issues involved. \"To imply for one second I would align myself with any political party to hide their blushes is just nonsense,\" said Mr Gamble, who added he was stepping back \"with a heavy heart\".  'Political opportunism' In his letter to the home secretary, Mr Gamble said his decision was \"reinforced by the highly charged and toxic environment that has surrounded and influenced the appointment process and the impact this has had on those closest to me\". He added: \"Regrettably, the reaction to the appointment process has been defined more by the vested interests of some, as well as political opportunism and point-scoring, rather than by the cross-party consensus required to address such a serious national issue. \"Victims and survivors, who have been let down so often in the past, deserve better than to be used as leverage for short-term gain by anyone.\" Mr Gamble began his career in Northern Ireland, rising to become head of RUC special branch in Belfast. However, he is best known for his work combating child abuse, and in 2006 headed up the Child Exploitation and Online Protection Centre, which revolutionised the approach to policing online child abuse networks. He was one of two known leading candidates for the role. Former social worker out of the running The other, Annie Hudson, a former social worker, said earlier this week she no longer wanted to be considered after intense media coverage. The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. It is understood that the government is exploring a range of other candidates and will provide an update in due course.  A Home Office spokesperson said: \"The grooming gang scandal was one of the darkest moments in this country's history. \"That is why this government is committed to a full, statutory, national inquiry to uncover the truth. It is the very least that the victims of these hideous crimes deserve. \"We are disappointed that candidates to chair that inquiry have withdrawn. This is an extremely sensitive topic, and we have to take the time to appoint the best person suitable for the role. \"The home secretary has been clear - there will be no hiding place for those who abused the most vulnerable in our society.\" Inquiry 'will never be watered down' Kemi Badenoch raised the issue at Prime Minister's Questions on Wednesday, with the Tory leader asking - on behalf of one of the resigned grooming inquiry members - what the point of an inquiry is if they are just ignored. Sir Keir said the inquiry \"is not and will never be watered down\" and that he wanted survivors \"to be at the heart of this\".  Victim's father calls for minister to resign Marlon West, whose daughter Scarlett was a grooming victim who was raped by more than 60 men, has also called for Ms Jess Phillips to resign. He said he doubted she would, but claimed she \"has lost any kind of faith from the public, and more importantly with survivors and families\".  Mr West described the minister in parliament this week as \"unprofessional\" and \"defensive rather than listening to what survivors are saying\". He also wants to see an inquiry with family members included, alongside survivors, on the panel, and even though he doesn't want to be included, he said, \"it's the families who are dealing with the services, not so much the survivors\". Mr West added: \"It's the parents who are dealing with the police, every single day, and social services. It's really important that they get family perspective. I think they should start again.\" 'Gaslit and manipulated' Survivor Ellie-Ann Reynolds, who withdrew earlier this week, said as soon as they [victims] found out what the two candidates used to do [police and social work], it \"raised red flags\" as they were involved with \"the two institutions that have failed us\". Mr Gamble's decision to withdraw was \"the right thing to do\", she said, as victims were \"gaslit\" and \"manipulated\" during the process and had \"very little faith in authorities and systems\"."
    },
    {
        "title": "No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit",
        "description": "Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge. ",
        "url": "https://news.sky.com/story/no-charges-over-images-of-trump-and-epstein-projected-onto-windsor-castle-during-presidents-visit-13455405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-state-visit_7022699.jpg?20250917090019",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 19:24:00",
        "Headline": "Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence.",
        "Content": " Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge.  Thames Valley Police said: \"The investigation into four men arrested in connection with an unauthorised projection on to Windsor Castle has concluded and no further action will be taken against them. \"The arrests took place on September 16 and involved a 60-year-old man from East Sussex, a 36-year-old man from London, a 37-year-old man from Kent and a 50-year-old man from London. \"The individuals were arrested on suspicion of offences including malicious communications and public nuisance.\" Mr Trump has faced questions about his relationship with the disgraced billionaire after messages allegedly sent to him by the US president were published earlier this month. Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence. In September, it called the arrests a \"ridiculous overreaction\" and said the sequence had beamed the pictures from a nearby hotel. \"I think they've been arrested for embarrassing Donald Trump,\" a spokesperson added. The US president stayed at the castle and was given a ceremonial welcome before a state banquet."
    },
    {
        "title": "Man deported under 'one in, one out' scheme returns to UK in small boat",
        "description": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat.",
        "url": "https://news.sky.com/story/man-deported-under-one-in-one-out-scheme-returns-to-uk-in-small-boat-13455227",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-home-office-migrant_7058547.jpg?20251022160545",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-22 14:47:00",
        "Headline": "Sky News understands that the Iranian man will be deported to France once again.",
        "Content": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat. The Iranian national was initially detained when he entered the UK on a small boat on 6 August. He was removed under the government's deal with France on 19 September, and he returned on 18 October. He has been detained once again, and Sky News understands that the government is set to expedite his removal back to France. Politics latest: Remaining grooming gang inquiry chair candidate withdraws The news comes as Sky News learns that more migrants have crossed the Channel on a small boat in 2025 so far than the entirety of 2024. The \"one in, one out\" treaty with France allows the UK to return anyone who arrives in the UK on a small boat back to France, in exchange for France sending to the UK the same number of people who have never previously tried to enter illegally.  The man told The Guardian newspaper that he had been a victim of modern slavery at the hands of people smugglers in northern France. \n                  Death threats for former French president Nicolas Sarkozy - less than a day into five-year prison sentence\n                 \n                  Louvre robbery: Paris museum reopens three days after crown jewels stolen in daring heist\n                 \n                  Jewels stolen in Louvre heist worth £76m, prosecutor says\n                 \"If I had felt that France was safe for me I would never have returned to the UK,\" he claimed. \"When we were returned to France we were taken to a shelter in Paris. I didn't dare to go out because I was afraid for my life. The smugglers are very dangerous. They always carry weapons and knives. I fell into the trap of a human trafficking network in the forests of France before I crossed to the UK from France the first time. \"They took me like a worthless object, forced me to work, abused me, and threatened me with a gun and told me I would be killed if I made the slightest protest. Every day and every night, I was filled with terror and stress. Every day I live in fear and anxiety, every loud noise, every shadow, every strange face scares me. \"When I reached UK the first time and Home Office asked what had happened to me I was crying and couldn't speak about this because of shame.\" The UK government's position is that France is a safe country.  'Rwanda is further than France' The aim of the agreement with France is to create a disincentive for migrants to make the dangerous crossing across the Channel. But Downing Street repeatedly refused to describe the scheme as a \"deterrent\" this afternoon, insisting that the scheme is among a number of measures the government is taking to stop small boat crossings. A Home Office spokesperson said in a statement: \"We will not accept any abuse of our borders, and we will do everything in our power to remove those without the legal right to be here. \"Individuals who are returned under the pilot and subsequently attempt to re-enter the UK illegally will be removed.\" Former Tory home secretary James Cleverly quipped on social media that \"Rwanda is a lot further away than France\", arguing that had their embattled scheme got off the ground, it would have been harder for migrants to make the return journey. The prime minister is hosting Western Balkans leaders on Wednesday as the government tries to crack down on people smuggling and illegal migration. But despite various government efforts, Sky News understands that more migrants have crossed the English Channel in small boats so far this year than in the whole of 2024, Sky News understands While the exact number of people who have made the crossing today is not set to be published until tomorrow, Home Office sources have confirmed that more than 36,816 people - the total for 2024 - have now crossed the Channel so far in 2025. Home Secretary Shabana Mahmood said in a statement: \"The previous government left our borders in crisis, and we are still living with the consequences. These figures are shameful - the British people deserve better. \"This government is taking action. We have detained and removed more than 35,000 who were here illegally. Our historic deal with the French means those who arrive on small boats are now being sent back. \"But it is clear we must go further and faster - removing more of those here illegally, and stopping migrants from making small boat crossings in the first place. \"And I have been clear: I will do whatever it takes to restore order to our border.\""
    },
    {
        "title": "Boy, 15, who murdered Harvey Willgoose sentenced to life with minimum term of 16 years",
        "description": "A 15-year-old boy has been sentenced to life with a minimum term of 16 years for murdering Sheffield schoolboy Harvey Willgoose in a lunch break knife attack.",
        "url": "https://news.sky.com/story/boy-15-who-murdered-harvey-willgoose-sentenced-to-life-with-minimum-term-of-16-years-13454896",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-harvey-willgoose-murder_7058308.jpg?20251022125248",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 14:47:00",
        "Headline": "Mohammed Umar Khan, who can now be named, took a 13cm hunting knife to school and used it to kill 15-year-old Harvey Willgoose outside the cafeteria.",
        "Content": " A 15-year-old boy has been sentenced to life with a minimum term of 16 years for murdering Sheffield schoolboy Harvey Willgoose in a lunch break knife attack. Harvey, also 15, was stabbed twice in the chest by Mohammed Umar Khan outside their school cafeteria in February this year. At Sheffield Crown Court, Judge Mrs Justice Ellenbogen told Mohammed Umar Khan his \"senseless acts\" followed a \"long-standing interest in weapons\". She added the murder had a \"devastating effect on Harvey's family\" and their lives have been \"blighted by your actions\". As it happened: How sentencing unfolded Khan, who can now be named after the judge lifted reporting restrictions, took a 13cm hunting knife with him to All Saints Catholic High School. CCTV showed Harvey arriving at the school, with earlier footage showing the attacker trying to provoke Harvey, who remained calm. The attacker was also seen in footage holding a knife in the canteen before the stabbing. Khan had previously admitted to manslaughter but denied murder. But in August, he was found guilty at Sheffield Crown Court by a majority verdict of 11 to one. Defence lawyers claimed the boy had \"lost control\" after years of bullying and \"an intense period of fear at school\". He told teachers after the stabbing \"you know I can't control it\" and \"I'm not right in the head\".  Doesn't look like he's sorry Speaking outside court, Harvey Willgoose's mother, Caroline, said she was relieved the case was over. \"I feel like a big weight's been lifted off my shoulders, to be honest. He [Khan] doesn't look like he's sorry but I just hope that's his mask.\" Caroline Willgoose, whose father died last week, also spoke to Sky News about the anti-knife campaigns she was developing following the death of Harvey. \"He were funny, he were caring, and that's how I want him to be remembered. I hate him being remembered as the school kid that got stabbed to death in school. He'd hate that.\" Asked about her thoughts of Khan, she said: \"I don't really have any feelings for him. I don't know whether they'll come... but I do feel like he's been let down. They've both been let down.\"  'Popular, energetic, full-loving' Steve Davies, chief executive of St Clare Catholic Multi Academy Trust, which operates All Saints Catholic High School, described Harvey as \"a popular, energetic and fun-loving pupil who is dearly missed every day by the whole school community\". He added: \"Our thoughts are first and foremost with Harvey's family, loved ones and friends. We cannot begin to imagine the depth of their loss and our deepest sympathies go out to them today and every day. \"Since the conclusion of the trial, the school and trust have been able to engage fully with a number of ongoing investigations aimed at answering key questions about Harvey's tragic death. We will continue to work closely with these partners and cooperate fully with these investigations.\" 'Senseless acts' had 'devastating effect' During sentencing on Wednesday, Judge Mrs Justice Ellenbogen told Khan his \"senseless acts have had a devastating effect\". \"Harvey's family is haunted by the CCTV footage of the events of that day, and, exhausted by the trauma in their lives in which his absence is felt every day.\" \"It is clear that Harvey was also a popular pupil whom students and teachers held in affection. Their lives, too have been blighted by your actions, which have affected them deeply and will continue to do so.\" Read more:Sheffield United players pay tributeCommunity left in shock Mrs Ellenbogen added that Khan had a \"long-standing interest in weapons\" and images on his mobile phone showed him posing with hunting-style knives, a machete and a hammer. She told Khan he had a \"long-standing inability to manage your anger\", including three separate school incidents between November 2024 and January 2025 in which he had become angry and aggressive. The judge told him he would serve a minimum term of 16 years minus time spent in custody, which works out at around 15 years, three months. Khan did not show any obvious emotion as the sentence was passed. Following the murder, the parents of Harvey, Caroline and Mark Willgoose, told Sky News they wanted to see knife arches \"in all secondary schools and colleges\".  'Our mental health has been destroyed' Ahead of sentencing, Harvey's sister, Sophie Willgoose, described in her victim impact statement the family's \"world was shattered forever\" after they were told about his murder. She added: \"The defendant didn't just end Harvey's life, he ended ours too. Our mental health has been destroyed.\" Richard Thyne KC, prosecuting, said that while Khan had no previous convictions, he had previously taken an axe and a knife separately on to the school premises. Khan and Harvey had \"fronted up\" to one another in confrontations at school, he added. Attack was 'split-second decision' The detective who led the murder investigation said there was evidence that Khan was friends with Harvey until days before the fatal incident. Following the trial, Detective Chief Inspector Andy Knowles said a relatively trivial incident had led to a \"split-second decision to do something which just had dire and terrible consequences\". \"It was the knife that escalated this so quickly and led to consequences which you can't undo or take back afterwards,\" he added. Focus on knife crime prevention Kilvinder Vigurs, South Yorkshire's deputy mayor for policing and crime, said the trial \"marks a difficult moment for our region\" and more must be done \"to protect our children from the threat of knife crime\". In a statement, he said: \"Knife crime is not just a policing issue, it's a societal one. Our joint focus must be on prevention, education, and early intervention.\""
    },
    {
        "title": "All survivors who quit grooming gang inquiry will return if Jess Phillips resigns",
        "description": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns.",
        "url": "https://news.sky.com/story/jim-gamble-a-frontrunner-to-become-chair-of-grooming-gang-inquiry-withdraws-sky-news-understands-13455102",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:00:00",
        "Headline": "In a letter to the home secretary, the survivors said the minister's conduct shows she is \"unfit\" to oversee a process that requires them to trust the government.",
        "Content": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns. The four women who have resigned this week have written to Home Secretary Shabana Mahmood, calling for Ms Phillips to step down and all survivors to be consulted on appointing a senior judge as chair with no major conflicts of interest. Ms Phillips told parliament on Tuesday suggestions the scope of the inquiry was to be expanded from just grooming gangs were \"categorically untrue\". But leaked consultation documents and texts between the safeguarding minister and survivor Fiona Goddard show the survivors' concerns that the scope would be expanded were valid. The survivors' letter says: \"Being publicly contradicted and dismissed by a government minister when you are a survivor telling the truth takes you right back to that feeling of not being believed all over again. \"It is a betrayal that has destroyed what little trust remained.\" Phillips 'unfit' to oversee process The survivors have demanded the scope of the inquiry remain \"laser-focused\" on grooming gangs and called for victims to be free to speak to support networks without fear of reprisal. An independent mental health professional should replace the current victim liaison lead, they also wrote. The letter to Ms Mahmood says: \"Her [Ms Phillips'] conduct over the last week has shown she is unfit to oversee a process that requires survivors to trust the government. Her departure would signal you are serious about accountability and changing direction.\" The survivors describe their demands as \"the absolute bare minimum for survivors to trust that this inquiry will be different from every other process that has let us down\". Sky News has approached the Home Office for a comment on the victims' letter. Read more on Sky News:Inquiry 'won't be watered down'Grooming survivor quits inquiryVictim 'lives with trauma every day Frontrunner quits over 'toxicity' The letter was sent hours after one of the frontrunners to become chair of the inquiry withdrew, blaming \"vested interests\" and \"political opportunism and point-scoring\". Ex-police chief and child protection specialist Jim Gamble told the home secretary in a letter there was a \"highly charged and toxic environment\" around the appointment process and victims \"deserve better\". Speaking to Sky News, he said he originally viewed the job as an \"opportunity of a lifetime\" but changed his mind due to a \"growing level of toxicity\" and misinformation. He said he had more than 20 years' experience working with abuse survivors and understood the issues involved. \"To imply for one second I would align myself with any political party to hide their blushes is just nonsense,\" said Mr Gamble, who added he was stepping back \"with a heavy heart\".  'Political opportunism' In his letter to the home secretary, Mr Gamble said his decision was \"reinforced by the highly charged and toxic environment that has surrounded and influenced the appointment process and the impact this has had on those closest to me\". He added: \"Regrettably, the reaction to the appointment process has been defined more by the vested interests of some, as well as political opportunism and point-scoring, rather than by the cross-party consensus required to address such a serious national issue. \"Victims and survivors, who have been let down so often in the past, deserve better than to be used as leverage for short-term gain by anyone.\" Mr Gamble began his career in Northern Ireland, rising to become head of RUC special branch in Belfast. However, he is best known for his work combating child abuse, and in 2006 headed up the Child Exploitation and Online Protection Centre, which revolutionised the approach to policing online child abuse networks. He was one of two known leading candidates for the role. Former social worker out of the running The other, Annie Hudson, a former social worker, said earlier this week she no longer wanted to be considered after intense media coverage. The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. It is understood that the government is exploring a range of other candidates and will provide an update in due course.  A Home Office spokesperson said: \"The grooming gang scandal was one of the darkest moments in this country's history. \"That is why this government is committed to a full, statutory, national inquiry to uncover the truth. It is the very least that the victims of these hideous crimes deserve. \"We are disappointed that candidates to chair that inquiry have withdrawn. This is an extremely sensitive topic, and we have to take the time to appoint the best person suitable for the role. \"The home secretary has been clear - there will be no hiding place for those who abused the most vulnerable in our society.\" Inquiry 'will never be watered down' Kemi Badenoch raised the issue at Prime Minister's Questions on Wednesday, with the Tory leader asking - on behalf of one of the resigned grooming inquiry members - what the point of an inquiry is if they are just ignored. Sir Keir said the inquiry \"is not and will never be watered down\" and that he wanted survivors \"to be at the heart of this\".  Victim's father calls for minister to resign Marlon West, whose daughter Scarlett was a grooming victim who was raped by more than 60 men, has also called for Ms Jess Phillips to resign. He said he doubted she would, but claimed she \"has lost any kind of faith from the public, and more importantly with survivors and families\".  Mr West described the minister in parliament this week as \"unprofessional\" and \"defensive rather than listening to what survivors are saying\". He also wants to see an inquiry with family members included, alongside survivors, on the panel, and even though he doesn't want to be included, he said, \"it's the families who are dealing with the services, not so much the survivors\". Mr West added: \"It's the parents who are dealing with the police, every single day, and social services. It's really important that they get family perspective. I think they should start again.\" 'Gaslit and manipulated' Survivor Ellie-Ann Reynolds, who withdrew earlier this week, said as soon as they [victims] found out what the two candidates used to do [police and social work], it \"raised red flags\" as they were involved with \"the two institutions that have failed us\". Mr Gamble's decision to withdraw was \"the right thing to do\", she said, as victims were \"gaslit\" and \"manipulated\" during the process and had \"very little faith in authorities and systems\"."
    },
    {
        "title": "No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit",
        "description": "Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge. ",
        "url": "https://news.sky.com/story/no-charges-over-images-of-trump-and-epstein-projected-onto-windsor-castle-during-presidents-visit-13455405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-state-visit_7022699.jpg?20250917090019",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 19:24:00",
        "Headline": "Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence.",
        "Content": " Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge.  Thames Valley Police said: \"The investigation into four men arrested in connection with an unauthorised projection on to Windsor Castle has concluded and no further action will be taken against them. \"The arrests took place on September 16 and involved a 60-year-old man from East Sussex, a 36-year-old man from London, a 37-year-old man from Kent and a 50-year-old man from London. \"The individuals were arrested on suspicion of offences including malicious communications and public nuisance.\" Mr Trump has faced questions about his relationship with the disgraced billionaire after messages allegedly sent to him by the US president were published earlier this month. Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence. In September, it called the arrests a \"ridiculous overreaction\" and said the sequence had beamed the pictures from a nearby hotel. \"I think they've been arrested for embarrassing Donald Trump,\" a spokesperson added. The US president stayed at the castle and was given a ceremonial welcome before a state banquet."
    },
    {
        "title": "Man deported under 'one in, one out' scheme returns to UK in small boat",
        "description": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat.",
        "url": "https://news.sky.com/story/man-deported-under-one-in-one-out-scheme-returns-to-uk-in-small-boat-13455227",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-home-office-migrant_7058547.jpg?20251022160545",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 14:47:00",
        "Headline": "Sky News understands that the Iranian man will be deported to France once again.",
        "Content": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat. The Iranian national was initially detained when he entered the UK on a small boat on 6 August. He was removed under the government's deal with France on 19 September, and he returned on 18 October. He has been detained once again, and Sky News understands that the government is set to expedite his removal back to France. Politics latest: Remaining grooming gang inquiry chair candidate withdraws The news comes as Sky News learns that more migrants have crossed the Channel on a small boat in 2025 so far than the entirety of 2024. The \"one in, one out\" treaty with France allows the UK to return anyone who arrives in the UK on a small boat back to France, in exchange for France sending to the UK the same number of people who have never previously tried to enter illegally.  The man told The Guardian newspaper that he had been a victim of modern slavery at the hands of people smugglers in northern France. \n                  Death threats for former French president Nicolas Sarkozy - less than a day into five-year prison sentence\n                 \n                  Louvre robbery: Paris museum reopens three days after crown jewels stolen in daring heist\n                 \n                  Jewels stolen in Louvre heist worth £76m, prosecutor says\n                 \"If I had felt that France was safe for me I would never have returned to the UK,\" he claimed. \"When we were returned to France we were taken to a shelter in Paris. I didn't dare to go out because I was afraid for my life. The smugglers are very dangerous. They always carry weapons and knives. I fell into the trap of a human trafficking network in the forests of France before I crossed to the UK from France the first time. \"They took me like a worthless object, forced me to work, abused me, and threatened me with a gun and told me I would be killed if I made the slightest protest. Every day and every night, I was filled with terror and stress. Every day I live in fear and anxiety, every loud noise, every shadow, every strange face scares me. \"When I reached UK the first time and Home Office asked what had happened to me I was crying and couldn't speak about this because of shame.\" The UK government's position is that France is a safe country.  'Rwanda is further than France' The aim of the agreement with France is to create a disincentive for migrants to make the dangerous crossing across the Channel. But Downing Street repeatedly refused to describe the scheme as a \"deterrent\" this afternoon, insisting that the scheme is among a number of measures the government is taking to stop small boat crossings. A Home Office spokesperson said in a statement: \"We will not accept any abuse of our borders, and we will do everything in our power to remove those without the legal right to be here. \"Individuals who are returned under the pilot and subsequently attempt to re-enter the UK illegally will be removed.\" Former Tory home secretary James Cleverly quipped on social media that \"Rwanda is a lot further away than France\", arguing that had their embattled scheme got off the ground, it would have been harder for migrants to make the return journey. The prime minister is hosting Western Balkans leaders on Wednesday as the government tries to crack down on people smuggling and illegal migration. But despite various government efforts, Sky News understands that more migrants have crossed the English Channel in small boats so far this year than in the whole of 2024, Sky News understands While the exact number of people who have made the crossing today is not set to be published until tomorrow, Home Office sources have confirmed that more than 36,816 people - the total for 2024 - have now crossed the Channel so far in 2025. Home Secretary Shabana Mahmood said in a statement: \"The previous government left our borders in crisis, and we are still living with the consequences. These figures are shameful - the British people deserve better. \"This government is taking action. We have detained and removed more than 35,000 who were here illegally. Our historic deal with the French means those who arrive on small boats are now being sent back. \"But it is clear we must go further and faster - removing more of those here illegally, and stopping migrants from making small boat crossings in the first place. \"And I have been clear: I will do whatever it takes to restore order to our border.\""
    },
    {
        "title": "Professor labelled war criminal and threatened with beheading by pro-Palestinian protesters during lecture at London university",
        "description": "A university professor has vowed to continue teaching after pro-Palestinian students disrupted his lecture, made a threat to behead him and called for him to be sacked.",
        "url": "https://news.sky.com/story/professor-labelled-war-criminal-and-threatened-with-beheading-by-pro-palestinian-protesters-during-lecture-at-london-university-13455406",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michael-ben-gad-city-st-georges_7058879.jpg?20251022214247",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:40:00",
        "Headline": "Economics professor Michael Ben-Gad says he was branded a terrorist by masked protesters from a group calling itself City Action for Palestine, and has rejected demands for him to resign.",
        "Content": "A university professor has vowed to continue teaching after pro-Palestinian students disrupted his lecture, made a threat to behead him and called for him to be sacked. Michael Ben-Gad, professor of economics at City St George's, University of London, told Sky News he was also branded a terrorist because of links to Israel's military, after he was conscripted to serve in the Israel Defence Forces (IDF) in the 1980s. \"It started, apparently on the same day as the start of the ceasefire [between Israel and Hamas]... which I don't think is necessarily coincidental. \"There's a whole industry that has developed about vilifying Israel, by extension, Jews. And they're now looking for new targets.\" Mr Ben-Gad said it was not just his military service that protesters were complaining about. \"The other three accusations against me are that I studied at Hebrew University, this is a 100-year-old university in Jerusalem; that I've taught at the University of Haifa; and I've worked at the central bank [of Israel]. \"Broadly speaking, the accusation is that I lived in the Middle East while being Jewish. And if it's illegal in their eyes to do that, I don't know what they think about people who might be Jewish [and] living, let's say, in Edgware or Golders Green.\" Footage of the protest, posted online by a group calling itself City Action for Palestine, shows protesters with their faces covered, making pro-Palestinian chants and appearing to call for Mr Ben-Gad to be sacked. He told Sky News he had been targeted again by the same group, which disrupted his lecture on Wednesday afternoon. \"As of about an hour ago, I finished my lecture. It was invaded by protesters who came right up to me and screamed in my face, called me a war criminal and a Nazi, refused to leave... they're masked... one of them.... made a threat about having my head chopped off.\" Read more from Sky News:Maccabi Tel Aviv fan banNHS gets antisemitism trainingOverseas conflicts on UK shores But Mr Ben-Gad was defiant in the face of calls for him to resign: \"I'm insisting on carrying on my duties. I think that the students have a right to expect nothing less from me.\" He defended his military service, saying he was proud to have been part of the IDF, adding that Israel is a \"country at war\". \"We're besieged. And we need to defend ourselves because there are 7.5 million Jews who live there right now, and without the IDF, they would simply be exterminated,\" he said. In reference to the protesters, Mr Ben-Gad described them as part of a \"very small radical element\". \"I've had enormous amounts of support from all over the world. Among my colleagues, we come from every possible corner of the world. I have nothing but support and friendship. \"I would also say that I've taught at this university for nearly 20 years. My background has never been a secret. We have a large Muslim population here. The city's St George students are nearly all extremely polite, and they have wonderful manners. Nobody has ever confronted me about any of this until last week.\" Sky News has approached City St George's, University of London, for comment about the latest protest. An earlier statement, reported by Jewish News, from the university said it \"fully supports and upholds freedom of expression within the law\" but \"the university will not tolerate the harassment of its staff and students\". \"We will continue to support and protect our staff and students, including Michael, who has the full support of the university and its senior management team, as well as colleagues of all faiths and backgrounds.\""
    },
    {
        "title": "Starmer failed to take decisive step to smash the gangs at leaders summit - as small boat crossings exceed 2024",
        "description": "There were some wins for the UK at the Western Balkans Summit at Lancaster House in central London today.",
        "url": "https://news.sky.com/story/starmer-failed-to-take-decisive-step-to-smash-the-gangs-at-leaders-summit-as-small-boat-crossings-exceed-2024-13455411",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-edi-rama-starmer-western-balkans-summit_7058804.jpg?20251022204311",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-22 19:20:00",
        "Headline": "The summit with western Balkans leaders focused instead on growth opportunities and EU enlargement.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There were some wins for the UK at the Western Balkans Summit at Lancaster House in central London today. The UK unveiled a fresh list of sanctions - and believes it has made some headway convincing the EU to follow suit by placing restrictions on the likes of Kosovo passport forgers. British participants also claimed to be pleased that Serbia and Montenegro were added to a joint migration taskforce and said UK and EU law enforcement would work even more closely. But was it a moment where Sir Keir Starmer could convincingly claim to have taken a decisive step towards smashing the gangs, which was one of the goals he claimed he had for the summit this afternoon? Absolutely not. While presented domestically as a means to tackle illegal immigration, in fact, the Western Balkans Summit was not primarily about migration, and I understood the talks focused on many other areas, including growth opportunities and EU enlargement. Indeed, I was told that return hubs were not even on the prime minister's agenda. Perhaps unsurprisingly, western Balkan leaders did not want to talk about that and the summit was not designed in the first place to focus on that agenda, regardless of how it was presented to the domestic media. \n                  Man deported under 'one in, one out' scheme returns to UK in small boat\n                 \n                  Small boat migrant crossings in 2024 surpass last year's total two months early\n                 \n                  Kosovo PM Albin Kurti: We feel 'obligation' to host UK migrant return hub\n                 The backdrop for the summit couldn't have been more tricky. The number of immigrants who crossed the Channel exceeded the number in 2024 on Wednesday. Read more:Man deported under 'one in, one out' returns to UKPM backs call for MP probe into Prince Andrew's housing Meanwhile, the first of the 46 migrants returned to France made their way back over the Channel, claiming France is an unsafe country. There was finger pointing from British officials about why the French police had not done more to detain and deter this man from returning. And the truth is, migrants who leave the UK are returning - because in many cases we are giving them the cash to do so. That aside, there is also a nervousness that the French one-in, one-out deal may collapse entirely in a matter of weeks. Only 42 individuals have been removed from the UK to date but the EU has to authorise this plan for the long-term and it is far from clear that it will survive. To have secured the long term future of that deal at an international summit would be a big success. Today's were on a much smaller scale."
    },
    {
        "title": "King Charles lands in Rome to meet Pope Leo ahead of praying together",
        "description": "The King is said to be \"greatly looking forward\" to sharing what will be a historic moment praying alongside Pope Leo, after an arduous week of scandal for the Royal Family.",
        "url": "https://news.sky.com/story/king-charles-lands-in-rome-to-meet-pope-leo-ahead-of-praying-together-13455295",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-king-rome_7058680.jpg?20251022182619",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-22 16:08:00",
        "Headline": "The King and Queen Camilla have arrived in the Italian capital for a historic meeting with Pope Leo at the Vatican, marking a new step amid an ongoing royal scandal involving Charles's brother Prince Andrew.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King is said to be \"greatly looking forward\" to sharing what will be a historic moment praying alongside Pope Leo, after an arduous week of scandal for the Royal Family. King Charles and Queen Camilla have landed in Rome for their second visit this year, but this time for a state visit to the Holy See and their first meeting with the new Pope. It comes just days after the dramatic statement was released announcing that Prince Andrew was relinquishing the use of his honours and titles. But as the royal couple stepped off the plane, a spokesperson for the King released a statement attempting to draw attention back to the religious importance of this visit. The spokesperson said: \"His Majesty is greatly looking forward to meeting Pope Leo and celebrating together the historical significance of this visit, representing, as it does, such a landmark in relationships between the Church of England and the Catholic Church, and between the UK and the Holy See.\" Read More: King to become first UK monarch to pray with Pope in 500 yearsPrince Andrew giving up titles was clearly not entirely his decision Tomorrow, the King and Queen will meet the new pontiff Pope Leo XIV at the Apostolic Palace, his official residence, and then attend a special ecumenical service in the Sistine Chapel. \n                  King and Queen arrive in Rome ahead of Pope Leo meeting\n                 \n                  King Charles to become first British monarch to pray publicly with Pope in 500 years\n                 \n                  King and Queen set to meet Pope Leo in Vatican state visit\n                 There, the King, who is also Supreme Governor of the Church of England, and the Pope will publicly pray together during the service. It will be the first time an English monarch and the pontiff have joined together in this type of moment of reflection in the 500 years since the Reformation; in 1534, King Henry VIII declared himself as head of the Church of England, breaking from the papal authority of the Roman Catholic Church. In another historic step, the King will also be made Royal Confrater of the Abbey of St Paul Outside the Walls - one of Rome's four major papal basilicas - and presented with a special seat decorated with the King's Coat of Arms. The ceremonial title is seen as a symbolic acknowledgement of his friendship towards the Roman Catholic Church and his commitment to interfaith dialogue. With the King also carrying out the visit on behalf of the government, his spokesperson emphasised the wider importance of the trip, saying: \"At times of such global challenge, it has seldom been more important for Christian communities around the world to unite in faith and in fellowship with our partners. \"This provides a bulwark against those promoting conflict, division and tyranny, and supports our work together in Harmony to protect Nature, God's Creation. These are, of course, the issues that directly impact lives and livelihoods in Britain and around the globe, not just today but for generations to come.\" But the visit comes at a difficult time, with attention still focused on the allegations around Prince Andrew, and calls for further investigation into his titles and the rental arrangements for his home, Royal Lodge. The prime minister faced questions over his position on the matter at PMQs, when he said he believed there should be \"proper scrutiny\" of the arrangements. Buckingham Palace has been keen to stress this week that they are not ignoring the seriousness of the allegations that have been made against Prince Andrew. And even as he vehemently denies the claims, a source told Sky News that they should be examined in the \"proper and fullest ways\". But there has been a concerted effort to guide attention towards the historical and religious significance of the events that will take place over the next 24 hours, and as much as possible shut down the unwelcome distractions brought by his brother."
    },
    {
        "title": "Comet Lemmon visible in UK after closest approach to Earth in 1,300 years",
        "description": "Skygazers in the UK have the best chance this week to see a comet which will not make another close approach to Earth for another 1,300 years, astronomers have said.",
        "url": "https://news.sky.com/story/comet-lemmon-visible-in-uk-after-closest-approach-to-earth-in-1300-years-13455101",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-comet-lemmon-comet_7058383.jpg?20251022150537",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-22 12:57:00",
        "Headline": "Comet Lemmon came closest to the Earth when it was 56 million miles away, but will still be a \"fairly bright, fuzzy object\" for people to see in the evening sky.",
        "Content": "Skygazers in the UK have the best chance this week to see a comet which will not make another close approach to Earth for another 1,300 years, astronomers have said. Comet Lemmon should be easy to see with binoculars during the evening after sunset - but experts said it may also be possible to see it with the naked eye depending on the weather and if \"you've got a very dark sky\". The comet, which orbits the sun, was first detected in January and has been monitored by astronomers during the year. It came closest to the Earth on Tuesday when it was 56 million miles (90 million km) away, but is still expected to offer people the chance of \"something to go and enjoy\" into the opening days of November. Another comet, Swan, came to within 24 million miles (39 million km) of Earth on Tuesday, but it is easier to view from the southern hemisphere with a telescope. It comes as one of the most reliable meteor showers is set to peak this week when debris left by Halley's Comet will streak across the night sky. The Orionid meteor shower presents a dramatic light show for UK astronomers, producing up to 20 meteors every hour until the early morning. Read more:Here's how to see the Orionid showerFind out the weather for your area  Best time to see Comet Lemmon People in the UK are being advised that 8pm is around the best time to see Lemmon, which last made its closest approach to Earth around 1,300 years ago. By looking at a clear western sky around an hour after sunset, the comet - a greenish cosmic snowball - will appear relatively high and will brighten as it gets nearer to the sun in the coming weeks. Dr Robert Massey, deputy executive director of the Royal Astronomical Society, said it may be a \"little tough\" to see with the naked eye, but it should be \"reasonably bright\" and easy to spot with binoculars. \"Comet Lemmon is pretty much at its best visibility right now,\" he said. \"The best place to look is in the evening sky. As the sky darkens the comet will first of all be moving, over a matter of days, past the bright star Arcturus, and then further round towards the southwest. \"It will stand out as a fairly bright, fuzzy object. \"The fact that you can see it easily with binoculars makes it fairly unusual, and I think for that reason alone it's something to go and enjoy, particularly if you've never seen a comet before.\" This month also brought the chance to see the harvest moon - the first of three consecutive supermoons due to appear before the end of 2025. Supermoons appear larger and fuller than usual because the moon is at a point in its orbit which is nearer to Earth. The next supermoon will rise on 5 November and is set to be \"the biggest one of all\"."
    },
    {
        "title": "Donald Trump imposes sanctions on Russia's two biggest oil firms in major policy shift",
        "description": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin.",
        "url": "https://news.sky.com/story/donald-trump-imposes-sanctions-against-russias-two-biggest-oil-companies-as-frustration-grows-with-vladimir-putin-over-the-ukraine-war-13455515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-sanctions_7058998.jpg?20251023000042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:21:00",
        "Headline": "The US has imposed sanctions against Rosneft, Lukoil and dozens of subsidiaries due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\".",
        "Content": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin. In a major policy shift, new restrictions have been unveiled against Rosneft and Lukoil - as well as dozens of subsidiaries - due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". \"Now is the time to stop the killing and for an immediate ceasefire,\" Treasury Secretary Scott Bessent said in a statement. \"Given President Putin's refusal to end this senseless war, Treasury is sanctioning Russia's two largest oil companies that fund the Kremlin's war machine. We encourage our allies to join us in, and adhere to, these sanctions.\" The move marked a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine. Trump frustrated with Putin The US president has resisted pressure to impose energy sanctions on Russia, hoping that Putin would agree to end the fighting. But with no end in sight, he said he felt it was time. \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Putin-Trump Budapest meeting in doubt as official says 'no plan for immediate future'\n                 Mr Trump explained he has a \"very good relationship\" with his Russian counterpart, but felt he had to cancel their planned meeting as \"it didn't feel right to me\". In a sign of growing frustration, he told reporters: \"It didn't feel like we were going to get to the place we have to get. So I cancelled it. But we'll do it in the future. \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" He also hinted that the sanctions could be lifted if the Russian president was prepared to cooperate in peace talks. \"We hope that they [the sanctions] won't be on for long,\" he said in the Oval Office. \"We hope that the war will be settled.\"  Trump wants Xi to help with Ukraine Ahead of a meeting next week with Chinese President Xi Jinping in South Korea, Mr Trump said he would like Beijing to help put pressure on Moscow to halt the fighting. \"I think he [Xi] can have a big influence on Putin. I think he can have a big influence ... he's a respected man. He's a very strong leader of a very big country. And we will certainly be talking about Russia-Ukraine,\" he said. Xi and Putin have formed a strategic alliance between their countries.  Ukraine denied Tomahawk missiles However, Mr Trump warned he is not prepared to provide Ukraine with long-range Tomahawk missiles, which Kyiv has requested. He explained it would take the Ukrainians up to a year to learn how to use the \"highly complex\" weapons. \"The only way a Tomahawk is going to be shot ... is if we shot it. And we're not going to do that. \"It takes a year of intense training to learn how to use it, and we know how to use it, and we're not going to be teaching other people.\""
    },
    {
        "title": "Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy ",
        "description": "The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy.",
        "url": "https://news.sky.com/story/trumps-sanctions-are-no-slap-on-the-wrist-theyre-a-punch-to-the-gut-of-moscows-war-economy-13455563",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin_6992362.jpg?20250816064331",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-10-22 23:52:00",
        "Headline": "If energy prices surge or allied unity splinters, Trump could find himself on the ropes following his announcement of sanctions on Russia's two biggest oil firms.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy. Oil giants Rosneft and Lukoil are the twin engines pumping money through Russia's military veins. Washington framed the bold move as a bid to \"degrade the Kremlin's ability to raise revenue for its war machine\". Oil is Russia's bloodstream, and the Trump Treasury just cut off the blood flow. But every blow struck in the ring comes with the risk of self-inflicted pain, and there's potential for collateral damage. By squeezing Russia's oil sector, the president is tightening the global market's chest - and America's own pump could feel the pressure. The White House is gambling that the geopolitical payoff will ultimately outweigh the domestic sting. \n                  No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit\n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Scottish and UK governments locked in dispute over £26m cost of Donald Trump and JD Vance visits\n                 \"These are tremendous sanctions and I hope they don't last long,\" Mr Trump said. That mix of swagger and caveat summed up his approach - maximum pressure, but with an eye on prices back home. Europe rushed to mirror Washington's stance, adding restrictions on imports and tightening loopholes in shipping. The EU was clearly signalling that it's in Trump's corner, that the Western alliance holds.  'Wasted journey' On both sides of the Atlantic, they know that Moscow will seize on any disunity and slip through the cracks. An Oval Office meeting with the NATO Secretary-General Mark Rutte provided the diplomatic stagecraft. Mr Trump repeated that he'd cancelled a planned summit with Vladimir Putin because he \"didn't want to have a wasted journey\". Mr Rutte played the part of loyal ally, twice labelling the US president \"the only one who can get this done\".  Earlier, Mr Rutte played down my suggestion that his visit indicated Trump's meeting with Zelensky last Friday had been a disaster. It wouldn't be the first time Mr Rutte, who famously referred to Mr Trump as \"Daddy\", has poured oil on troubled waters. But it's Moscow's apparent refusal to accept Trump's terms that has put plans for another summit with Putin on hold. China's diplomatic influence with Russia could give it some leverage when Mr Trump meets Xi Jinping for trade talks next week. The US president's sanctions are more than punishment - they're a strategic gamble to corner Putin - but the margin of error is razor thin. If energy prices surge or allied unity splinters, Mr Trump could find himself on the ropes."
    },
    {
        "title": "Dublin protests: Prams filled with fireworks as teens - and children as young as seven - clash with police ",
        "description": "At least 23 people have been arrested during a second night of violent disorder near an asylum hotel in Dublin.",
        "url": "https://news.sky.com/story/police-officers-hurt-in-second-night-of-violence-in-dublin-13455441",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dublin-protests_7058997.jpg?20251023000023",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-22 19:56:00",
        "Headline": "Protesters have again clashed with police close to a hotel housing asylum seekers in Dublin following an alleged sexual assault.",
        "Content": " At least 23 people have been arrested during a second night of violent disorder near an asylum hotel in Dublin. Two police officers were taken to hospital with injuries sustained during clashes with protesters - including one who was struck on the head by a bottle. A Sky News crew was caught in the confusion as police charged at crowds, who were throwing fireworks, stones and other debris. By Connor Gillies, news correspondent The Telegram and WhatsApp group chats were alive with activity organising night two of unrest here on the edge of Dublin.  City chiefs halted trams and buses to this part of the Irish capital in a bid to reduce the number of mobs coming from other areas to fight police.  It got ugly, and fast.  I witnessed children as young as seven throwing bricks at riot officers, that were standing in rows 5ft deep. Balaclava-clad thugs were spotted pulling and shaking bollards on the roadside in an effort to dislodge the tarmac to use as projectiles.   Pepper spray from fire extinguisher-size canisters pelted the eyes of those who dared to confront law enforcement.  Teenagers dragged a baby pram filled with fireworks lit their missiles as they chucked them at officers who were charging forward in a bid to get the hundreds of locals under control.  There is palpable, deep anger in this community after the alleged sexual assault of a 10-year-old girl near a large hotel housing asylum seekers.  The recent incident has fuelled a \"get them out\" pitchfork mentality that authorities, so far, appear to be struggling to get a grip of. It is the third night of demonstrations at the Citywest Hotel following an alleged sexual assault in the early hours of Monday morning. A demonstration in the wake of the incident, which allegedly involved a 10-year-old girl, turned violent on Tuesday night. A police officer was injured and six arrests were made. A 26-year-old man, who cannot be named due to rules that apply to all sexual assault cases in the Republic of Ireland, appeared in court on Tuesday charged over the alleged attack. Police had earlier pledged a \"robust response\" if the violence continued. Between 7pm and 8pm, hundreds of protesters faced off with around 40 uniformed officers. The uniformed officers were replaced with the Public Order Unit, who were carrying plastic shields and additional body protection. Protesters detained after stand-off Hundreds of protesters had been facing off against the public order unit of the Irish police force along Citywest Drive. While large parts of the crowd dispersed throughout the night, an additional public order unit was deployed to tackle those remaining at the protest shortly after 10pm. Several of those caught between the two units were tackled and detained as they tried to flee. Justice minister Jim O'Callaghan said \"many have been arrested\" and \"more will follow\" - and went on to praise officers who had responded professionally to \"thuggish violence\" in the area. Mr O'Callaghan vowed that those arrested would be \"charged, named and dealt with relentlessly\" by the criminal justice system."
    },
    {
        "title": "Louvre director offers to resign and admits jewel heist was 'terrible failure' ",
        "description": "The director of the Louvre has admitted a daylight raid, in which jewels worth an estimated &#163;76m were stolen, was a \"terrible failure\" and has offered to resign.",
        "url": "https://news.sky.com/story/louvre-director-offers-to-resign-and-admits-jewel-heist-was-terrible-failure-13455330",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-laurence-des-cars_7058727.png?20251022192513",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-22 17:13:00",
        "Headline": "The Louvre in Paris reopened its doors on Wednesday, three days after a major theft which has damaged France's global image and prompted the director of the world-famous museum to submit her resignation.",
        "Content": "The director of the Louvre has admitted a daylight raid, in which jewels worth an estimated £76m were stolen, was a \"terrible failure\" and has offered to resign. \"Despite our efforts, despite our hard work every day, we were defeated,\" Laurence des Cars told a committee of the French Senate. On Wednesday, the Louvre reopened for the first time since Sunday's audacious heist at the world's most-visited and highest-profile museums.  Thieves used a crane to access an upstairs window, smashed the glass, then made off with eight pieces from France's Crown Jewels, before escaping on motorbikes. Three days on, the jewels remain missing and the thieves are still at large. Under pressure over a theft that has stained France's global image, she told the committee: \"We are experiencing a terrible failure at the Louvre, which I take my share of responsibility in.\" Despite submitting her resignation, the culture minister refused to accept it. Authorities say the thieves spent less than four minutes inside the Louvre on Sunday morning. \n                  Louvre robbery: Paris museum reopens three days after crown jewels stolen in daring heist\n                 \n                  Louvre robbery: 'Matter of time' before thieves struck, expert says - and UK museums could be next\n                 \n                  Louvre worker says staff 'repeatedly warned about security shortcomings' at museum before jewellery heist\n                 \"We did not detect the thieves' arrival early enough,\" she said, blaming it on the fact that there were not enough cameras outside monitoring the vicinity of the museum. The outside security cameras do not offer full coverage of the museum's facade, she said, adding that, in particular, the window through which the thieves broke in was not monitored by CCTV. Read more from Sky News:Louvre: UK museums could be nextWhat will happen to stolen jewels? Ms Des Cars insisted she had repeatedly warned that the centuries-old building's security was in a dire state. \"The warnings I had been sounding came horribly true last Sunday,\" she said.  It comes just months after employees went on strike, warning of chronic understaffing and underresourcing, with too few eyes on too many rooms. The Apollo Room, the scene of Sunday's robbery, was still closed to visitors, with a folding screen closing off the doorway at the gallery's entrance. Culture Minister Rachida Dati was criticised on Tuesday after telling politicians there had been no security failings. Prosecutor Laure Beccuau said roughly 100 investigators are attempting to recover the stolen items, worth an estimated €88m (£76m), and track down four suspects who have so far been identified at the scene, along with accomplices. In January, French President Emmanuel Macron announced new measures for the Louvre, including a new command post and expanded camera grid that the culture ministry says is being rolled out."
    },
    {
        "title": "Professor labelled war criminal and threatened with beheading by pro-Palestinian protesters during lecture at London university",
        "description": "A university professor has vowed to continue teaching after pro-Palestinian students disrupted his lecture, made a threat to behead him and called for him to be sacked.",
        "url": "https://news.sky.com/story/professor-labelled-war-criminal-and-threatened-with-beheading-by-pro-palestinian-protesters-during-lecture-at-london-university-13455406",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michael-ben-gad-city-st-georges_7058879.jpg?20251022214247",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:40:00",
        "Headline": "Economics professor Michael Ben-Gad says he was branded a terrorist by masked protesters from a group calling itself City Action for Palestine, and has rejected demands for him to resign.",
        "Content": "A university professor has vowed to continue teaching after pro-Palestinian students disrupted his lecture, made a threat to behead him and called for him to be sacked. Michael Ben-Gad, professor of economics at City St George's, University of London, told Sky News he was also branded a terrorist because of links to Israel's military, after he was conscripted to serve in the Israel Defence Forces (IDF) in the 1980s. \"It started, apparently on the same day as the start of the ceasefire [between Israel and Hamas]... which I don't think is necessarily coincidental. \"There's a whole industry that has developed about vilifying Israel, by extension, Jews. And they're now looking for new targets.\" Mr Ben-Gad said it was not just his military service that protesters were complaining about. \"The other three accusations against me are that I studied at Hebrew University, this is a 100-year-old university in Jerusalem; that I've taught at the University of Haifa; and I've worked at the central bank [of Israel]. \"Broadly speaking, the accusation is that I lived in the Middle East while being Jewish. And if it's illegal in their eyes to do that, I don't know what they think about people who might be Jewish [and] living, let's say, in Edgware or Golders Green.\" Footage of the protest, posted online by a group calling itself City Action for Palestine, shows protesters with their faces covered, making pro-Palestinian chants and appearing to call for Mr Ben-Gad to be sacked. He told Sky News he had been targeted again by the same group, which disrupted his lecture on Wednesday afternoon. \"As of about an hour ago, I finished my lecture. It was invaded by protesters who came right up to me and screamed in my face, called me a war criminal and a Nazi, refused to leave... they're masked... one of them.... made a threat about having my head chopped off.\" Read more from Sky News:Maccabi Tel Aviv fan banNHS gets antisemitism trainingOverseas conflicts on UK shores But Mr Ben-Gad was defiant in the face of calls for him to resign: \"I'm insisting on carrying on my duties. I think that the students have a right to expect nothing less from me.\" He defended his military service, saying he was proud to have been part of the IDF, adding that Israel is a \"country at war\". \"We're besieged. And we need to defend ourselves because there are 7.5 million Jews who live there right now, and without the IDF, they would simply be exterminated,\" he said. In reference to the protesters, Mr Ben-Gad described them as part of a \"very small radical element\". \"I've had enormous amounts of support from all over the world. Among my colleagues, we come from every possible corner of the world. I have nothing but support and friendship. \"I would also say that I've taught at this university for nearly 20 years. My background has never been a secret. We have a large Muslim population here. The city's St George students are nearly all extremely polite, and they have wonderful manners. Nobody has ever confronted me about any of this until last week.\" Sky News has approached City St George's, University of London, for comment about the latest protest. An earlier statement, reported by Jewish News, from the university said it \"fully supports and upholds freedom of expression within the law\" but \"the university will not tolerate the harassment of its staff and students\". \"We will continue to support and protect our staff and students, including Michael, who has the full support of the university and its senior management team, as well as colleagues of all faiths and backgrounds.\""
    },
    {
        "title": "The ICJ's highly critical ruling on Israel's conduct in Gaza - and what could happen next | Adam Parsons",
        "description": "This was a verdict that came slowly, and with some of its barbs hidden in sub-clauses and legalese. But if you put the elements together, it was a highly critical attack on Israel's conduct in the occupied territories. Not just in Gaza, but also in the West Bank and East Jerusalem.",
        "url": "https://news.sky.com/story/the-icjs-highly-critical-ruling-on-israels-conduct-in-gaza-and-what-could-happen-next-adam-parsons-13455326",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-icj-gaza_7058673.jpg?20251022183349",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-22 17:08:00",
        "Headline": "The International Court of Justice has in a ruling criticised Israel's conduct in the Gaza Strip and the occupied territories. How will Benjamin Netanyahu react?",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n This was a verdict that came slowly, and with some of its barbs hidden in sub-clauses and legalese. But if you put the elements together, it was a highly critical attack on Israel's conduct in the occupied territories. Not just in Gaza, but also in the West Bank and East Jerusalem. The International Court of Justice's ruling says Israel must facilitate - not simply allow - humanitarian aid to be delivered to the Gaza Strip by the United Nations and its entities. The ban on many of UNRWA's operations was deemed unlawful, and there was a constant drumbeat of Israel's obligations as an \"occupying power\". There was a call to allow the Red Cross access to Palestinian prisoners being held by Israeli authorities, and various demands - or perhaps reminders - of Israel's obligations towards those caught within the orbit of an armed conflict. Israel has already said it \"completely rejects\" the findings, which have come in the form of an advisory ruling, claiming that the entire process was politically driven and based on false information. Israel insists that its decision to restrict UNRWA was driven by links between the agency and Hamas, which it says has \"infested\" UNRWA's staff. What did the ICJ ruling say about Israel's UNRWA claim? In its ruling, the court said that evidence had not been presented to show that UNRWA's neutrality had been compromised, nor that it could substantiate Israel's claim that around 10% of UNRWA's staff were active members of Hamas. Contacts within UNRWA have told me they hope it will focus minds, and lead a drive for \"longer-term accountability... to stop the normalisation of actions against UN organisations around the world\".​  The question is whether this ruling, critical as it is, will have any real-world impact. Israel, clearly, will not change its laws in reaction to this. It has long labelled the UN as biased against Israel, and, as long as it has the support of the White House, Israeli Prime Minister Benjamin Netanyahu will feel he doesn't have to worry about this ruling. Having shrugged off previous declarations that his country is responsible for both genocide and famine, Netanyahu will not break sweat over today's ruling. Read more:British troops deployed to 'monitor Gaza ceasefire'America takes centre stage in show of diplomatic power But what this pronouncement from the court will do is, once again, train international focus on Israel's actions. It might lead to some of Netanyahu's opponents to ask for restraint. But, perhaps more likely, it might actually embolden more extreme political rivals to cast Israel as a victim of politically-inspired mob justice. And rather than leading to a calming of the rhetoric, it might heat it up."
    },
    {
        "title": "Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat",
        "description": "The US has launched its eighth strike against an alleged drug vessel - this time in the Pacific.",
        "url": "https://news.sky.com/story/pete-hegseth-makes-al-qaeda-claim-as-us-strikes-eighth-alleged-drug-boat-13455385",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hegseth-drugs_7058756.jpg?20251022200153",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-22 18:23:00",
        "Headline": "The US has struck an eighth alleged drug boat, this time in the Pacific. Pete Hegseth has vowed to \"wage war\" on traffickers.",
        "Content": " The US has launched its eighth strike against an alleged drug vessel - this time in the Pacific. The US defence secretary Pete Hegseth revealed the \"lethal kinetic\" strike on social media. In a video shared by Mr Hegseth, a small boat carrying brown packages explodes after being struck. According to the US war secretary, the action killed two \"narco-terrorists\", taking the death toll from all the strikes to at least 34 people. \"Yesterday, at the direction of President Trump, the Department of War conducted a lethal kinetic strike on a vessel being operated by a designated terrorist organisation and conducting narco-trafficking in the Eastern Pacific,\" said Mr Hegseth. \"There were two narco-terrorists aboard during the strike, which was conducted in international waters. Both terrorists were killed, and no US forces were harmed.\" Mr Hegseth likened the alleged drug traffickers to the group behind the September 11 attacks, Islamist terror organisation Al Qaeda. Read more:US airstrike destroyed 'drug-carrying submarine'Survivors reported after US military strike \"Just as Al Qaeda waged war on our homeland, these cartels are waging war on our border and our people,\" Mr Hegseth said. \"There will be no refuge or forgiveness - only justice.\" The seven previous US strikes had all targeted vessels in the Caribbean. Amid a US military build up in the region and anxiety that Mr Trump may order military action against Venezuela, which the US president accuses of narcoterrorism, President Nicolas Maduro.has denied any connection to drug smuggling and said the boat strikes were a pretext for regime change."
    },
    {
        "title": "King Charles lands in Rome to meet Pope Leo ahead of praying together",
        "description": "The King is said to be \"greatly looking forward\" to sharing what will be a historic moment praying alongside Pope Leo, after an arduous week of scandal for the Royal Family.",
        "url": "https://news.sky.com/story/king-charles-lands-in-rome-to-meet-pope-leo-ahead-of-praying-together-13455295",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-king-rome_7058680.jpg?20251022182619",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-22 16:08:00",
        "Headline": "The King and Queen Camilla have arrived in the Italian capital for a historic meeting with Pope Leo at the Vatican, marking a new step amid an ongoing royal scandal involving Charles's brother Prince Andrew.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King is said to be \"greatly looking forward\" to sharing what will be a historic moment praying alongside Pope Leo, after an arduous week of scandal for the Royal Family. King Charles and Queen Camilla have landed in Rome for their second visit this year, but this time for a state visit to the Holy See and their first meeting with the new Pope. It comes just days after the dramatic statement was released announcing that Prince Andrew was relinquishing the use of his honours and titles. But as the royal couple stepped off the plane, a spokesperson for the King released a statement attempting to draw attention back to the religious importance of this visit. The spokesperson said: \"His Majesty is greatly looking forward to meeting Pope Leo and celebrating together the historical significance of this visit, representing, as it does, such a landmark in relationships between the Church of England and the Catholic Church, and between the UK and the Holy See.\" Read More: King to become first UK monarch to pray with Pope in 500 yearsPrince Andrew giving up titles was clearly not entirely his decision Tomorrow, the King and Queen will meet the new pontiff Pope Leo XIV at the Apostolic Palace, his official residence, and then attend a special ecumenical service in the Sistine Chapel. \n                  King and Queen arrive in Rome ahead of Pope Leo meeting\n                 \n                  King Charles to become first British monarch to pray publicly with Pope in 500 years\n                 \n                  King and Queen set to meet Pope Leo in Vatican state visit\n                 There, the King, who is also Supreme Governor of the Church of England, and the Pope will publicly pray together during the service. It will be the first time an English monarch and the pontiff have joined together in this type of moment of reflection in the 500 years since the Reformation; in 1534, King Henry VIII declared himself as head of the Church of England, breaking from the papal authority of the Roman Catholic Church. In another historic step, the King will also be made Royal Confrater of the Abbey of St Paul Outside the Walls - one of Rome's four major papal basilicas - and presented with a special seat decorated with the King's Coat of Arms. The ceremonial title is seen as a symbolic acknowledgement of his friendship towards the Roman Catholic Church and his commitment to interfaith dialogue. With the King also carrying out the visit on behalf of the government, his spokesperson emphasised the wider importance of the trip, saying: \"At times of such global challenge, it has seldom been more important for Christian communities around the world to unite in faith and in fellowship with our partners. \"This provides a bulwark against those promoting conflict, division and tyranny, and supports our work together in Harmony to protect Nature, God's Creation. These are, of course, the issues that directly impact lives and livelihoods in Britain and around the globe, not just today but for generations to come.\" But the visit comes at a difficult time, with attention still focused on the allegations around Prince Andrew, and calls for further investigation into his titles and the rental arrangements for his home, Royal Lodge. The prime minister faced questions over his position on the matter at PMQs, when he said he believed there should be \"proper scrutiny\" of the arrangements. Buckingham Palace has been keen to stress this week that they are not ignoring the seriousness of the allegations that have been made against Prince Andrew. And even as he vehemently denies the claims, a source told Sky News that they should be examined in the \"proper and fullest ways\". But there has been a concerted effort to guide attention towards the historical and religious significance of the events that will take place over the next 24 hours, and as much as possible shut down the unwelcome distractions brought by his brother."
    },
    {
        "title": "Donald Trump imposes sanctions on Russia's two biggest oil firms in major policy shift",
        "description": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin.",
        "url": "https://news.sky.com/story/donald-trump-imposes-sanctions-against-russias-two-biggest-oil-companies-as-frustration-grows-with-vladimir-putin-over-the-ukraine-war-13455515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-sanctions_7058998.jpg?20251023000042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:21:00",
        "Headline": "The US has imposed sanctions against Rosneft, Lukoil and dozens of subsidiaries due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\".",
        "Content": "Donald Trump has imposed sanctions on Russia's two largest oil companies - and spoke of his frustration with Vladimir Putin. In a major policy shift, new restrictions have been unveiled against Rosneft and Lukoil - as well as dozens of subsidiaries - due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". \"Now is the time to stop the killing and for an immediate ceasefire,\" Treasury Secretary Scott Bessent said in a statement. \"Given President Putin's refusal to end this senseless war, Treasury is sanctioning Russia's two largest oil companies that fund the Kremlin's war machine. We encourage our allies to join us in, and adhere to, these sanctions.\" The move marked a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine. Trump frustrated with Putin The US president has resisted pressure to impose energy sanctions on Russia, hoping that Putin would agree to end the fighting. But with no end in sight, he said he felt it was time. \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Putin-Trump Budapest meeting in doubt as official says 'no plan for immediate future'\n                 Mr Trump explained he has a \"very good relationship\" with his Russian counterpart, but felt he had to cancel their planned meeting as \"it didn't feel right to me\". In a sign of growing frustration, he told reporters: \"It didn't feel like we were going to get to the place we have to get. So I cancelled it. But we'll do it in the future. \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" He also hinted that the sanctions could be lifted if the Russian president was prepared to cooperate in peace talks. \"We hope that they [the sanctions] won't be on for long,\" he said in the Oval Office. \"We hope that the war will be settled.\"  Trump wants Xi to help with Ukraine Ahead of a meeting next week with Chinese President Xi Jinping in South Korea, Mr Trump said he would like Beijing to help put pressure on Moscow to halt the fighting. \"I think he [Xi] can have a big influence on Putin. I think he can have a big influence ... he's a respected man. He's a very strong leader of a very big country. And we will certainly be talking about Russia-Ukraine,\" he said. Xi and Putin have formed a strategic alliance between their countries.  Ukraine denied Tomahawk missiles However, Mr Trump warned he is not prepared to provide Ukraine with long-range Tomahawk missiles, which Kyiv has requested. He explained it would take the Ukrainians up to a year to learn how to use the \"highly complex\" weapons. \"The only way a Tomahawk is going to be shot ... is if we shot it. And we're not going to do that. \"It takes a year of intense training to learn how to use it, and we know how to use it, and we're not going to be teaching other people.\""
    },
    {
        "title": "Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy ",
        "description": "The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy.",
        "url": "https://news.sky.com/story/trumps-sanctions-are-no-slap-on-the-wrist-theyre-a-punch-to-the-gut-of-moscows-war-economy-13455563",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin_6992362.jpg?20250816064331",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-10-22 23:52:00",
        "Headline": "If energy prices surge or allied unity splinters, Trump could find himself on the ropes following his announcement of sanctions on Russia's two biggest oil firms.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The new US sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy. Oil giants Rosneft and Lukoil are the twin engines pumping money through Russia's military veins. Washington framed the bold move as a bid to \"degrade the Kremlin's ability to raise revenue for its war machine\". Oil is Russia's bloodstream, and the Trump Treasury just cut off the blood flow. But every blow struck in the ring comes with the risk of self-inflicted pain, and there's potential for collateral damage. By squeezing Russia's oil sector, the president is tightening the global market's chest - and America's own pump could feel the pressure. The White House is gambling that the geopolitical payoff will ultimately outweigh the domestic sting. \n                  No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit\n                 \n                  Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat\n                 \n                  Scottish and UK governments locked in dispute over £26m cost of Donald Trump and JD Vance visits\n                 \"These are tremendous sanctions and I hope they don't last long,\" Mr Trump said. That mix of swagger and caveat summed up his approach - maximum pressure, but with an eye on prices back home. Europe rushed to mirror Washington's stance, adding restrictions on imports and tightening loopholes in shipping. The EU was clearly signalling that it's in Trump's corner, that the Western alliance holds.  'Wasted journey' On both sides of the Atlantic, they know that Moscow will seize on any disunity and slip through the cracks. An Oval Office meeting with the NATO Secretary-General Mark Rutte provided the diplomatic stagecraft. Mr Trump repeated that he'd cancelled a planned summit with Vladimir Putin because he \"didn't want to have a wasted journey\". Mr Rutte played the part of loyal ally, twice labelling the US president \"the only one who can get this done\".  Earlier, Mr Rutte played down my suggestion that his visit indicated Trump's meeting with Zelensky last Friday had been a disaster. It wouldn't be the first time Mr Rutte, who famously referred to Mr Trump as \"Daddy\", has poured oil on troubled waters. But it's Moscow's apparent refusal to accept Trump's terms that has put plans for another summit with Putin on hold. China's diplomatic influence with Russia could give it some leverage when Mr Trump meets Xi Jinping for trade talks next week. The US president's sanctions are more than punishment - they're a strategic gamble to corner Putin - but the margin of error is razor thin. If energy prices surge or allied unity splinters, Mr Trump could find himself on the ropes."
    },
    {
        "title": "Pete Hegseth makes Al Qaeda claim as US strikes eighth alleged drug boat",
        "description": "The US has launched its eighth strike against an alleged drug vessel - this time in the Pacific.",
        "url": "https://news.sky.com/story/pete-hegseth-makes-al-qaeda-claim-as-us-strikes-eighth-alleged-drug-boat-13455385",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hegseth-drugs_7058756.jpg?20251022200153",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 18:23:00",
        "Headline": "The US has struck an eighth alleged drug boat, this time in the Pacific. Pete Hegseth has vowed to \"wage war\" on traffickers.",
        "Content": " The US has launched its eighth strike against an alleged drug vessel - this time in the Pacific. The US defence secretary Pete Hegseth revealed the \"lethal kinetic\" strike on social media. In a video shared by Mr Hegseth, a small boat carrying brown packages explodes after being struck. According to the US war secretary, the action killed two \"narco-terrorists\", taking the death toll from all the strikes to at least 34 people. \"Yesterday, at the direction of President Trump, the Department of War conducted a lethal kinetic strike on a vessel being operated by a designated terrorist organisation and conducting narco-trafficking in the Eastern Pacific,\" said Mr Hegseth. \"There were two narco-terrorists aboard during the strike, which was conducted in international waters. Both terrorists were killed, and no US forces were harmed.\" Mr Hegseth likened the alleged drug traffickers to the group behind the September 11 attacks, Islamist terror organisation Al Qaeda. Read more:US airstrike destroyed 'drug-carrying submarine'Survivors reported after US military strike \"Just as Al Qaeda waged war on our homeland, these cartels are waging war on our border and our people,\" Mr Hegseth said. \"There will be no refuge or forgiveness - only justice.\" The seven previous US strikes had all targeted vessels in the Caribbean. Amid a US military build up in the region and anxiety that Mr Trump may order military action against Venezuela, which the US president accuses of narcoterrorism, President Nicolas Maduro.has denied any connection to drug smuggling and said the boat strikes were a pretext for regime change."
    },
    {
        "title": "Why is Trump and Putin's meeting off?",
        "description": "With Vladimir Putin and Donald Trump's meeting in Budapest \"on hold\" for now, US correspondents Martha Kelner and Mark Stone unpick the US president's latest position on the war in Ukraine.",
        "url": "https://news.sky.com/story/why-is-trump-and-putins-meeting-off-13454855",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 01:56:00",
        "Headline": "No subtitle found",
        "Content": "With Vladimir Putin and Donald Trump's meeting in Budapest \"on hold\" for now, US correspondents Martha Kelner and Mark Stone unpick the US president's latest position on the war in Ukraine. Martha also chats to Huffington Post journalist SV Dáte about his run-in with White House Press Secretary Karoline Leavitt. You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job",
        "description": "Elon Musk has attacked NASA's administrator - and claimed he isn't smart enough to hold the top job.",
        "url": "https://news.sky.com/story/elon-musk-launches-personal-attack-on-nasa-boss-and-says-he-isnt-smart-enough-for-the-job-13454871",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-tesla_6902434.jpg?20250501102033",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 04:28:00",
        "Headline": "While NASA has been planning to use SpaceX's Starship rocket system to land on the lunar surface, proposals will now be accepted from rivals as the US tries to return astronauts to the moon before China gets there.",
        "Content": "Elon Musk has attacked NASA's administrator - and claimed he isn't smart enough to hold the top job. The billionaire's criticism of Sean Duffy came after the space agency said it was open to using moon landers that weren't manufactured by his company SpaceX. On X, Musk accused Mr Duffy of \"trying to kill NASA\", and wrote: \"The person responsible for America's space program can't have a 2 digit IQ.\"  While NASA has been planning to use SpaceX's Starship rocket system to land on the lunar surface, proposals will now be accepted from rivals. The agency wants to return astronauts to the moon within Donald Trump's second term and do so before China gets there. Mr Duffy had told CNBC: \"We're not going to wait for one company. We're going to push this forward and win the second space race against the Chinese.\" While SpaceX has a $2.9bn (£2.2bn) contract for the Artemis III mission, it has fallen behind schedule - with Starship suffering a series of explosive failures this year. \n                  Did Trump and Zelenskyy's meeting turn into a 'shouting match'?\n                 \n                  Burning space debris which crashed to Earth may have come from Chinese rocket, says expert\n                 \n                  Gangsters, billionaires and love triangles: Behind the scenes of China's micro-drama boom\n                  Nonetheless, Musk has defended the company's progress, writing: \"SpaceX is moving like lightning compared to the rest of the space industry. \"Moreover, Starship will end up doing the whole moon mission. Mark my words.\" In response, Mr Duffy said: \"Love the passion. The race to the Moon is ON. Great companies shouldn't be afraid of a challenge. When our innovators compete with each other, America wins!\" Mr Duffy is currently the acting administrator of NASA, but reports suggest that he wants to keep the role. Musk has previously thrown his support behind a billionaire called Jared Isaacman for the top job, who has previously flown on two private SpaceX missions into orbit."
    },
    {
        "title": "No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit",
        "description": "Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge. ",
        "url": "https://news.sky.com/story/no-charges-over-images-of-trump-and-epstein-projected-onto-windsor-castle-during-presidents-visit-13455405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-state-visit_7022699.jpg?20250917090019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 19:24:00",
        "Headline": "Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence.",
        "Content": " Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge.  Thames Valley Police said: \"The investigation into four men arrested in connection with an unauthorised projection on to Windsor Castle has concluded and no further action will be taken against them. \"The arrests took place on September 16 and involved a 60-year-old man from East Sussex, a 36-year-old man from London, a 37-year-old man from Kent and a 50-year-old man from London. \"The individuals were arrested on suspicion of offences including malicious communications and public nuisance.\" Mr Trump has faced questions about his relationship with the disgraced billionaire after messages allegedly sent to him by the US president were published earlier this month. Political campaign group Led By Donkeys said it was behind the nine-minute projection sequence. In September, it called the arrests a \"ridiculous overreaction\" and said the sequence had beamed the pictures from a nearby hotel. \"I think they've been arrested for embarrassing Donald Trump,\" a spokesperson added. The US president stayed at the castle and was given a ceremonial welcome before a state banquet."
    },
    {
        "title": "White House responds to report Trump is considering commuting Diddy's prison sentence",
        "description": "A White House official has said there is \"zero truth\" to a report that Donald Trump is considering commuting Sean \"Diddy\" Combs's prison sentence as early as this week.",
        "url": "https://news.sky.com/story/zero-truth-to-report-of-donald-trump-commuting-sean-diddy-combss-sentence-white-house-says-13454946",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-combs-donald-trump_7058106.jpg?20251022101905",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-22 07:46:00",
        "Headline": "Sean 'Diddy' Combs was sentenced to 50 months in prison and given a $500,000 fine at the beginning of October, after being found guilty of prostitution-related charges. His lawyers intend to appeal - but reports continue about a possible pardon or commutation of the sentence.",
        "Content": "A White House official has said there is \"zero truth\" to a report that Donald Trump is considering commuting Sean \"Diddy\" Combs's prison sentence as early as this week. On Monday, US entertainment site TMZ reported the US president was \"vacillating\" on whether or not to reduce the music mogul's sentence, citing a \"high-ranking White House official\". Combs was sentenced to 50 months in prison and given a $500,000 fine at a hearing on 3 October, after being found guilty of prostitution charges relating to his former girlfriends and male sex workers at the end of his high-profile trial in the summer. Earlier this week, the 55-year-old's legal team filed a legal document officially signalling their intention to appeal. Now, a White House official has pushed back on TMZ's report about a possible commutation. There is \"zero truth to the TMZ report, which we would've gladly explained had they reached out before running their fake news\", the official told NBC, Sky News' US partner. Mr Trump, \"not anonymous sources, is the final decider on pardons and commutations\", the official added. Casey Carver, a spokesperson for TMZ, said in a brief statement: \"We stand by our story.\" In an update to the story on the outlet's website, the news site said: \"The White House Communications Office is saying our story is not true. We stand by our story. Our story is accurate.\" Lawyers for Combs did not immediately return a request for comment about the disparity between the White House statement and TMZ's reporting. However, they previously told NBC News they had been pursuing a pardon. In the US federal system, commutation of sentence and pardons are different forms of executive clemency, \"which is a broad term that applies to the president's constitutional power to give leniency to persons who have committed federal crimes\", according to the justice department. Neither signifies innocence, but a pardon is an expression of a president's forgiveness and can be granted in recognition of acceptance of responsibility and good conduct, reinstating rights such as the right to vote. A commutation reduces a sentence either totally or partially but does not remove civil disabilities that apply as a result of criminal conviction. What has Donald Trump said? In August, before Combs's sentencing, Mr Trump said in an interview that he had been approached about a possible pardon but implied he would not be granting one. \"You know, I was very friendly with him. I got along with him great and he seemed like a nice guy. I didn't know him well,\" the president said. \"But when I ran for office, he was very hostile.\" When asked if he was suggesting he would not pardon Combs, he replied: \"I would say so.\" \"When you knew someone and you were fine, and then you run for office, and he made some terrible statements. So, I don't know, it's more difficult,\" Mr Trump said. \"Makes it more - I'm being honest, it makes it more difficult to do.\" The president has issued several pardons and commutations in his second term - including to around 1,500 criminal defendants in connection with the attack on the US Capitol in January 2021. Last week, he commuted the sentence of disgraced former Republican congressman George Santos. Read more:The rise and fall of DiddyDiddy sentencing: As it happened Combs was found guilty of two counts of transportation for prostitution in July, but was cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. Ahead of his sentencing, he told the court he admitted his past behaviour was \"disgusting, shameful and sick\", and apologised personally to Cassie Ventura and \"Jane\", another former girlfriend who testified anonymously during the trial. He told the court he got \"lost in my excess and lost in my ego\", but since his time in prison he has been \"humbled and broken to my core\", adding: \"I hate myself right now... I am truly sorry for it all.\" The rapper is serving his sentence at Brooklyn's Metropolitan Detention Center, where his team has said conditions are \"inhumane\". He has asked to be moved to a low-security federal prison in New Jersey, but the Bureau of Prisons has yet to approve the request."
    },
    {
        "title": "Manchester Pride put into voluntary liquidation and being assessed by regulator",
        "description": "Manchester Pride has been put into voluntary liquidation and is being assessed by the charities regulator, with the future of the event in doubt.",
        "url": "https://news.sky.com/story/manchester-pride-put-into-voluntary-liquidation-as-money-owed-to-artists-13455289",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-pride_7058586.jpg?20251022170057",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Miles Starforth, reporter",
        "Date Published": "2025-10-22 15:40:00",
        "Headline": "The organisers of the event celebrating the northern city's LGBTQ+ community cited rising costs, declining ticket sales and an unsuccessful bid to host Euro Pride as factors behind the decision.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Miles Starforth, reporter  Manchester Pride has been put into voluntary liquidation and is being assessed by the charities regulator, with the future of the event in doubt. Artists, suppliers and freelancers have been left unpaid, some of them owed thousands, the performers' and creatives' union Equity said. After nearly a week of speculation and a period of financial difficulty, Pride's organisers cited rising costs, declining ticket sales and an unsuccessful bid to host Euro Pride as factors behind the decision. The organisation is a charity and limited company that campaigns for LGBTQ+ equality and puts on the annual parade and live events. The company had been in financial difficulty, according to latest accounts, and gone through a series of directors in recent months. All three directors appointed in August resigned this month. An up-to-date picture of Manchester Pride's finances is not available, as the last update was submitted in September 2024 for the year up to December 2023, showing a consolidated deficit of nearly £500,000. At that point, the company said it could continue to exist, as a \"going concern\", as it said a review of the charity's strategy would take place, detailed budgets and cash forecasts had been prepared for 2024 and 2025, and it had been in surplus up to August 2024. \n                  Thousands defy ban to join Pride march in Budapest\n                 \n                  Tom Daley says 'it's scary how LGBT rights are being dangerously threatened'\n                 \n                  Glasgow Pride bans political parties from taking part amid Supreme Court row\n                 Manchester Pride said at the time it had a plan to diversify income streams and rebuild cash reserves. Accounts for 2024 are not due until 31 December this year. As a charity, Manchester Pride Limited is regulated by the Charity Regulator, which said it had opened a compliance case \"to assess concerns raised\" about the organisation. \"We are engaging with the trustees to help inform any next regulatory steps,\" a spokesperson said. It's understood that Manchester Pride submitted a serious incident report relating to its finances. What went wrong? Directly impacted by the liquidation is freelance event manager Abbie Ashall, who is owed £2,000 after her pay day was missed in September. Ms Ashall said she was not the worst hit; others are out of pocket even more, having hired and paid people for events they were contracted to put on, all with the expectation of being paid by Manchester Pride. She had been an employee of Manchester Pride from summer 2023 to January 2025, but left to go freelance when staff members left and were not being replaced, raising concerns about resources to deal with an increasing workload. It was at that point that she assumed things were not going well financially. Read more from Sky News:Royal Navy destroyer intercepts Russian warshipEurostar orders UK's first double-decker trains She continued to work for the organisation on a freelance basis, project managing the 2025 parade and now producing a musical, Spraywatch: A Beautiful Rescue. Manchester Pride's difficulties can, in part, be attributed to its model of getting people to pay for a wristband to access sites which are public spaces. \"I don't think that the business model worked at the end of the day,\" Ms Ashall said. \"And I think not enough people were buying tickets... we're seeing a massive trend in the events and festival industry that people just are not buying\". What next? Creatives waiting to be paid have been urged to contact the Equity union. \"We are collecting contractual information to pursue all options to recoup money owed, and we will begin these processes immediately,\" said Equity's North West official, Karen Lockney. \"We are also speaking with Manchester City Council and other stakeholders to ensure artists' voices are heard in discussions about the future of Pride in the city, ensuring that Manchester gets the Pride it deserves\". Details of those owed money have been passed to the liquidators, Manchester Pride's board of trustees said in a statement. What does this mean for Pride in Manchester? A Pride celebration will take place in August next year with council support, Manchester City Council said. \"There will undoubtedly be anxiety about what the future holds - but Pride is much more than the organisation that runs it. We want to support a new chapter for Manchester Pride weekend, which will take place next August. \"The council will play a full and active role in bringing together the LGBTQ community to help shape how the city moves forward to ensure a bright and thriving future for Manchester Pride.\""
    },
    {
        "title": "Inflation: Cost of living challenges require bold decisions",
        "description": "You know bad economic news is looming when a Chancellor of the Exchequer tries to get their retaliation in first.",
        "url": "https://news.sky.com/story/inflation-cost-of-living-challenges-require-bold-decisions-13454933",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20250716091522",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-22 07:04:00",
        "Headline": "The better than expected inflation data will help the chancellor and Bank of England, but there are challenges to overcome on tackling price growth in the long term.  ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n You know bad economic news is looming when a Chancellor of the Exchequer tries to get their retaliation in first. Treasury guidance on Tuesday afternoon that Rachel Reeves has prioritised easing the cost of living had to be seen in the light of inflation figures, published this morning, and widely expected to rise above 4% for the first time since the aftermath of the energy crisis. In that context the fact consumer price inflation in September remained level at 3.8% counts as qualified good news for the Treasury, if not consumers. Money latest: What inflation hike means for state pension and rail fare increases The figure remains almost double the Bank of England target of 2%, the rate when Labour took office, but economists at the Bank and beyond do expect this month to mark the peak of this inflationary cycle. That's largely because the impact of higher energy prices last year will drop out of calculations next month.  The small surprise to the upside has also improved the chances of an interest rate cut before the end of the year, with markets almost fully pricing expectations of a reduction to 3.75% by December, though rate-setters may hold off at their next meeting early next month. September's figure also sets the uplift in benefits from next April so this figure may improve the internal Treasury forecast, but at more than double the rate a year ago it will still add billions to the bill due in the new year.  For consumers there was good news and bad, and no comfort at all from the knowledge that they face the highest price increases in Europe. Fuel prices rose but there was welcome relief from the rate of food inflation, which fell to 4.5% from 5.1% in August, still well above the headline rate and an unavoidable cost increase for every household. Read more from Sky News:Beef market in turmoil and affecting farmers and consumersRachel Reeves looking at cutting energy bills in budget The chancellor will convene a meeting of cabinet ministers on Thursday to discuss ways to ease the cost of living and has signalled that cutting energy bills is a priority. The easiest lever for her to pull is to cut the VAT rate on gas and electricity from 5% to zero, which would reduce average bills by around £80 but cost £2.5bn. More fundamental reform of energy prices, which remain the second-highest in Europe for domestic bill payers and the highest for industrial users, may be required to bring down inflation fast and stimulate growth."
    },
    {
        "title": "Is OpenAI's browser worth the hype? These experts tried it out",
        "description": "\"To put it bluntly, it felt at times like watching a 12-year-old use my computer.\"",
        "url": "https://news.sky.com/story/is-openais-browser-worth-the-hype-these-experts-tried-it-out-13455085",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-openai_7002687.jpg?20250827150243",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-22 14:29:00",
        "Headline": "\"Maybe I will use it in the future, if they release versions that are actually working,\" said one expert.",
        "Content": "\n          Science and technology reporter\n        \"To put it bluntly, it felt at times like watching a 12-year-old use my computer.\" That's Dr Junade Ali's assessment of the new OpenAI browser, which was released on Tuesday evening. The browser, called Atlas, appears designed to challenge Google Chrome and potentially supplant the most profitable segment of Google's parent company, Alphabet. But after testing out Atlas, AI experts have told Sky News one of its key elements feels \"very clunky\". As well as fully incorporating ChatGPT into the browser so it follows you around the internet, the \"most exciting part\" of the browser is its AI agent, according to Dr Andrea Barbon from the University of St Gallen. The feature is currently only available in \"preview mode\" for certain users. \"When you activate the agent, you can ask it to do something, and then it will take control of your computer or your mouse,\" he explained after trying it out. \"It will start clicking around on the website to perform the task that you requested,\" he said - but the feature left him disappointed, and he stopped using the browser within minutes. \"I tried a couple of websites where the workflow is a bit complex and ChatGPT was just not able to handle it, not at all,\" he said. \"After a few minutes, I closed the browser and I didn't uninstall it, but I could - I'm not going to use it, right? \"Maybe I will use it in the future, if they release versions that are actually working,\" he said. Dr Ali, a fellow at the Institution for the IET, said the AI agent would \"struggle around a little bit to try and do the task in the most effective way and it would sometimes get stuck\". \"It definitely seemed very primitive - but it is a really neat concept,\" he said. OpenAI said its agent mode is \"an early experience and may make mistakes on complex workflows\". \"We're rapidly improving reliability, latency and complex task success.\" Will it topple Google? Despite being underwhelmed by the browser, Dr Ali said OpenAI has already shown it can cause Google problems. \"We do see Google struggling to keep up with the advances that OpenAI are doing,\" he said. OpenAI has already made a \"massive dent\" in the web traffic Google would usually be able to make money from, he said, through ChatGPT and people using the AI bot as a search engine. \"So in that aspect, it has already been able to disrupt Google.\" \"Google is going to respond,\" said Dr Barbon. \"For sure, Google is gonna integrate more AI into Google Chrome. So it really depends on who is faster at achieving a working prototype. I think OpenAI is not there yet.\" Will this change how we use the internet? When Google launched in 1998, it changed the flow of information around the world, disrupted business models and revolutionised advertising. OpenAI are hoping Atlas has a similarly sweeping impact. During last night's launch, chief executive Sam Altman said: \"AI presents a rare once-in-a-decade opportunity to rethink what a browser can be about.\" Read more from Sky News:Royal Navy destroyer intercepts Russian warshipStorm Benjamin to bring heavy rain and winds For Dr Luke Roberts, from the Centre of Science and Policy at the University of Cambridge, an AI-integrated browser could trigger societal change.  \"The bigger question behind this is really [about] the shift from the attention economy to the answer economy,\" he told Sky News. \"If the conversations previously were [about] how much technology grabs your attention, I think the biggest societal shift we're gonna see is people just want the answer now.\" 👉 Listen to Sky News Daily on your podcast app 👈 With AI making answers quicker and easier to access than ever before, Dr Roberts warned there is a risk we will become complacent about the source and veracity of that information. \"We don't necessarily scrutinise the answers we're being given, we just accept them at face value,\" he said. \"I think there's some really big shifts about to happen that we're going to need to really think quite deeply as a society.\""
    },
    {
        "title": "Shrinking herds and rising costs: The beef market is in turmoil - and inflation is spiralling ",
        "description": "If you eat beef, and ever stop to wonder where and how it's produced, Jonathan Chapman's farm in the Chiltern Hills west of London is what you might imagine.&#160;",
        "url": "https://news.sky.com/story/shrinking-herds-and-rising-costs-the-beef-market-is-in-turmoil-and-inflation-is-spiralling-13454552",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-beef-inflation_7057944.jpg?20251022032058",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-22 01:54:00",
        "Headline": "Beef prices are rising across Europe and the US, but amid rising environmental and cost pressures, it's a small consolation.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  If you eat beef, and ever stop to wonder where and how it's produced, Jonathan Chapman's farm in the Chiltern Hills west of London is what you might imagine.  A small native herd, eating only the pasture beneath their hooves in a meadow fringed by beech trees, their leaves turning to match the copper coats of the Ruby Red Devons, selected for slaughter only after fattening naturally during a contented if short existence. But this bucolic scene belies the turmoil in the beef market, where herds are shrinking, costs are rising, and even the promise of the highest prices in years, driven by the steepest price increase of any foodstuff, is not enough to tempt many farmers to invest. For centuries, a symbolic staple of the British lunch table, beef now tells us a story about spiralling inflation and structural decline in agriculture. Mr Chapman has been raising beef for just over a decade. A former champion eventing rider with a livery yard near Chalfont St Giles, the main challenge when he shifted his attention from horses to cows was that prices were too low. \"Ten years ago, the deadweight carcass price for beef was £3.60 a kilo. We might clear £60 a head of cattle,\" he says. \"The only way we could make the sums add up was to process and sell the meat ourselves.\" Processing a carcass doubles the revenue, from around £2,000 at today's prices to £4,000. That insight saw his farm sprout a butchery and farm shop under the Native Beef brand. Today, they process two animals a week and sell or store every cut on site, from fillet to dripping. \n                  Farming community responds to rumours of an inheritance tax U-turn\n                 \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Cost of rural crime in Wales at its highest in more than a decade\n                 Today, farmgate prices are nearly double what they were in 2015 at £6.50 a kilo, down slightly from the April peak of almost £7, but still up around 25% in a year. For consumers that has made paying more than £5 for a pack of mince the norm. For farmers, rising prices reflect rising costs, long-term trends, and structural changes to the subsidy regime since Brexit. \"Supply and demand is the short answer,\" says Mr Chapman. \"Cow numbers have been falling roughly 3% a year for the last decade, probably in this country. Since Brexit, there is virtually no direct support for food in this country. Well over 50% of the beef supply would have come from the dairy herd, but that's been reducing because farmers just couldn't make money.\" Political, environmental and economic forces Beef farmers also face the same costs of trading as every other business. The rise in employers' national insurance and the minimum wage have increased labour costs, and energy prices remain above the long-term average. Then there is the weather, the inescapable variable in agriculture that this year delivered a historically dry summer, leaving pastures dormant, reducing hay and silage yields and forcing up feed costs. Native Beef is not immune to these forces. Mr Chapman has reduced his suckler herd from 110 to 90, culling older cows to reduce costs this winter. If repeated nationally, the full impact of that reduction will only be fully clear in three years' time, when fewer calves will reach maturity for sale, potentially keeping prices high. That lag demonstrates one of the challenges in bringing prices down. Basic economics says high prices ought to provide an opportunity and prompt increased supply, but there is no quick fix. Calves take nine months to gestate and another 20 to 24 months to reach maturity, and without certainty about price, there is greater risk. There is another long-term issue weighing on farmers of all kinds: inheritance tax. The ending of the exemption for agriculture, announced in the last budget and due to be imposed from next April, has undermined confidence. Neil Shand of the National Beef Association cites farmers who are spending what available capital they have on expensive life insurance to protect their estates, rather than expanding their herds. \"The farmgate price is such that we should be in an environment that we should be in a great place to expand, there is a market there that wants the product,\" he says. \"But the inheritance tax challenge has made everyone terrified to invest in something that will be more heavily taxed in the future.\" While some of the issues are domestic, the UK is not alone. Beef prices are rising in the US and Europe too, but that is small consolation to the consumer, and none at all to the cow."
    },
    {
        "title": "Cyber attack on Jaguar Land Rover 'most financially damaging' in UK history, experts say",
        "description": "The cyber attack on Jaguar Land Rover is believed to have been the \"most financially damaging\" in UK history at an estimated cost of &#163;1.9bn, a security body has said.",
        "url": "https://news.sky.com/story/cyber-attack-on-jaguar-land-rover-the-most-financially-damaging-in-uk-history-13455008",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-22 09:45:00",
        "Headline": "The Cyber Monitoring Centre says the incident serves as a wake-up call that companies should treat seriously.",
        "Content": "The cyber attack on Jaguar Land Rover is believed to have been the \"most financially damaging\" in UK history at an estimated cost of £1.9bn, a security body has said. The attack, in late August, forced a halt to production across the carmaker's global operations for more than a month, and it has yet to get back to full speed. Research from the Cyber Monitoring Centre (CMC) suggests that around 5,000 businesses across the UK were affected by the fallout. Money latest: What inflation figures mean for your finances The independent body estimated that more than half of the total financial losses would be felt by JLR itself, through lost production, sales and cash spent on getting its systems back online. The company revealed help for suppliers earlier this month, but only those it directly deals with, with companies further down the chain suggesting they remained exposed due to interruptions in their own production and invoice flows.  Ciaran Martin, chair of the CMC's technical committee, said: \"With a cost of nearly £2bn, this incident looks to have been by some distance, the single most financially damaging cyber event ever to hit the UK. \n                  Manchester Pride put into voluntary liquidation and being assessed by regulator\n                 \n                  Inflation: Cost of living challenges require bold decisions\n                 \n                  Money latest: Gold sees biggest one-day plunge in 12 years; half a million Britons to get significant pay rise \n                 \"That should make us all pause and think, and then - as the National Cyber Security Centre said so forcefully last week - it's time to act.  Read more from Sky News:Jaguar Land Rover 'was not insured for cyber attack'Jaguar Land Rover gets £1.5bn government-backed loan \"Every organisation needs to identify the networks that matter to them, and how to protect them better, and then plan for how they'd cope if the network gets disrupted.\" JLR, which declined to comment on the report, is yet to put an estimated figure on the cost itself. It is due to report financial results next month. Marks and Spencer - also a victim of cyber criminals this year - has said its estimated £300m hit will be largely eradicated through insurance payouts."
    },
    {
        "title": "CBI business group to name BAE Systems' Hogg as next president",
        "description": "The CBI, Britain's best-known business lobbying group, will on Wednesday name Cressida Hogg, the BAE Systems chair, to take the helm until 2028.",
        "url": "https://news.sky.com/story/cbi-business-group-to-name-bae-systems8217-hogg-as-next-president-13454877",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/skynews-cressida-hogg-landsec_5802548.png?20220612145925",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-22 05:08:00",
        "Headline": "Cressida Hogg will complete an all-female double act at the top of Britain's best-known employers' group when she succeeds Rupert Soames in January, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The CBI, Britain's best-known business lobbying group, will on Wednesday name Cressida Hogg, the BAE Systems chair, to take the helm until 2028. Sky News has learnt that Ms Hogg, who also sits on the board of the London Stock Exchange's parent company, has been picked to succeed Rupert Soames as the CBI president early next year. The appointment will make Ms Hogg a relative rarity as a woman holding the CBI's two-year presidency, and complete an all-female double act at the top of the organisation. Money latest: Reaction as inflation figures set to rise Rain Newton-Smith, the CBI chief executive, was parachuted into the role in 2023 as it fought for its survival amid a sexual misconduct scandal which triggered an exodus of corporate members. Mr Soames, the former Aggreko and Serco chief who now chairs Smith & Nephew, was recruited in the same year to help stabilise the business group. A former executive at the London-listed private equity group 3i, Ms Hogg has extensive experience of working in major pension fund and infrastructure roles, which people close to the CBI said would be an asset as Rachel Reeves, the chancellor, focuses on boosting investment in the UK economy. \n                  Is Rachel Reeves the new Margaret Thatcher?\n                 \n                  Settlement with former chief Danker 'cost CBI £500,000'\n                 \n                  KPMG and NatWest return to CBI fold in boost for scandal-hit group\n                 Ms Hogg has also chaired Land Securities Group, the property company, and served as a non-executive director at companies including Associated British Ports and Anglian Water. One person close to the CBI said they regarded it as \"a coup\" that it had been able to recruit her. Sky News revealed in July that the CBI was working with Egon Zehnder, the headhunter, on a search for Mr Soames's successor. His leadership is said to have persuaded a significant number of companies to rejoin the CBI after a period in which it came perilously close to insolvency. The group's handling of a sexual misconduct scandal saw it forced to secure emergency funding from a group of banks, even as it was frozen out of meetings with government ministers. Mr Soames and Ms Newton-Smith have partly restored its influence in Whitehall, although many doubt that it will ever be able to credibly reclaim its former status as \"the voice of business\". Read more from Sky News:Beef market in turmoil and affecting farmers and consumersRachel Reeves looking at cutting energy bills in budget  At one point, Ms Newton-Smith suggested that the CBI might need to change its name in order to distance itself from the scandal which claimed the job of predecessor Tony Danker. Mr Danker subsequently received a six-figure settlement amid disquiet over the way his exit had been handled. The CBI's parlous financial position meant it was forced into job cuts and the closure of some overseas offices. It also approached some of its trade association members to gauge their appetite to lease parts of the 25,000sq ft Cannon Place office in the City it moved into in 2014. At one stage, it entertained talks last year about a merger with Make UK, the manufacturers' body, but these were abandoned. The CBI has been contacted for comment about Ms Hogg's impending appointment. She will stand for election by CBI members at its next annual meeting in 2026."
    },
    {
        "title": "Cinven plots bid for funeral provider Pure Cremation",
        "description": "Cinven, the private equity firm, is plotting a takeover of one of Britain's biggest funeral providers in a deal which could value it at more than &#163;500m.",
        "url": "https://news.sky.com/story/cinven-plots-bid-for-funeral-provider-pure-cremation-13454981",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-funeral-file-pic-coffin_6421919.jpg?20240115073342",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-22 09:04:00",
        "Headline": "The private equity firm is among suitors circling one of the UK's biggest funeral providers, with offers expected to value it at more than £500m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Cinven, the private equity firm, is plotting a takeover of one of Britain's biggest funeral providers in a deal which could value it at more than £500m. Sky News has learnt that Cinven, a former owner of the fashion brand Kurt Geiger, is among the private equity firms expected to table bids this week for Pure Cremation. Bankers at Houlihan Lokey are running a sale process which insiders say could value Pure Cremation at anywhere between £500m and £700m. Money latest: What inflation figures mean for your finances Epiris, which acquired the business from its founders in 2023, is expected to choose a preferred bidder before the end of the year. Pure Cremation was founded in 2015 by Bryan and Catherine Powell, with the aim of meeting growing demand for so-called direct cremations, which involve a simple service without mourners in attendance. The company offers pre-paid plans, which the company is understood to believe represents a significant growth opportunity for a future owner. \n                  Manchester Pride put into voluntary liquidation and being assessed by regulator\n                 \n                  Inflation: Cost of living challenges require bold decisions\n                 \n                  Money latest: Gold sees biggest one-day plunge in 12 years; half a million Britons to get significant pay rise \n                 Read more from Sky News:Beef market in turmoil and affecting farmers and consumersRachel Reeves looking at cutting energy bills in budget Pure Cremation is now run by Dean Lamble, the former chief executive of SunLife Insurance. A decline in the number of religious funerals taking place in Britain each year has fuelled growth in lower-cost alternatives. Pure Cremation operates the UK's busiest crematorium, located in Andover, Hampshire. Cinven declined to comment."
    },
    {
        "title": "Eurostar orders UK's first fleet of double-decker trains",
        "description": "A major fleet of double-decker trains is set to run on the UK rail network for the first time as part of the Eurostar services operating through the Channel Tunnel.",
        "url": "https://news.sky.com/story/eurostar-orders-uks-first-fleet-of-double-decker-trains-13455015",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-eurostar-celestia-trains_7058203.jpg?20251022110500",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-22 09:53:00",
        "Headline": "The trains are expected to begin operating in 2031, while Eurostar said the plans will create hundreds of new jobs in the UK.",
        "Content": "A major fleet of double-decker trains is set to run on the UK rail network for the first time as part of the Eurostar services operating through the Channel Tunnel. Eurostar has revealed it is buying up to 50 high-speed two-storey trains for its network across five countries - and will include the services between London St Pancras and Paris, Brussels and Amsterdam. The \"new generation\" electric fleet of 200-metre trains will be named Eurostar Celestia and will also see the introduction of services from St Pancras to Frankfurt and Geneva. Commercial services using the new trains are expected to begin in May 2031. Eurostar also said the new fleet will create around 350 more jobs at its Temple Mills depot in London, where it plans to maintain its entire fleet. It said it will be investing €80m (£70m) to develop the site so it can \"accommodate the new trains\". Most of the firm's jobs are already based in the UK. Eurostar has confirmed an initial order for 30 trains and has an option for a further 20 as part of a €2bn (£1.74bn) deal with the manufacturer, Alstom. The trains will operate alongside Eurostar's existing 17 single-decker Siemens-built e320s and will boast 20% more seats, a lower floor and be 16cm taller. Double-decker trains do not have twice as many seats as single-deckers because space is needed for interior steps. 'More than a thousand seats per service' In a statement, Eurostar said: \"It is expected that each 200-metre set will have around 540 seats. \"If running in 400m formation (as through the Channel Tunnel today), there would be around 1,080 seats per service.\" The company said the Celestia fleet will herald a \"golden age for international sustainable travel\" and will make up to 50% in energy savings compared with its existing trains. Read more from Sky News:Surprise food price fall helps keep inflation downChancellor looking at cutting energy bills  Eurostar CEO Gwendoline Cazenave said: \"Placing this milestone order marks the concrete realisation of Eurostar's ambitious growth strategy - to reach 30 million passengers by investing in a brand new fleet. \"We're particularly proud to bring double-decker trains to the UK for the very first time. \"Customers can expect a very special new train with Eurostar Celestia, which will offer exceptional comfort, a unique Eurostar experience and new surprises to be revealed.\""
    },
    {
        "title": "Starmer failed to take decisive step to smash the gangs at leaders summit - as small boat crossings exceed 2024",
        "description": "There were some wins for the UK at the Western Balkans Summit at Lancaster House in central London today.",
        "url": "https://news.sky.com/story/starmer-failed-to-take-decisive-step-to-smash-the-gangs-at-leaders-summit-as-small-boat-crossings-exceed-2024-13455411",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-edi-rama-starmer-western-balkans-summit_7058804.jpg?20251022204311",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-22 19:20:00",
        "Headline": "The summit with western Balkans leaders focused instead on growth opportunities and EU enlargement.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There were some wins for the UK at the Western Balkans Summit at Lancaster House in central London today. The UK unveiled a fresh list of sanctions - and believes it has made some headway convincing the EU to follow suit by placing restrictions on the likes of Kosovo passport forgers. British participants also claimed to be pleased that Serbia and Montenegro were added to a joint migration taskforce and said UK and EU law enforcement would work even more closely. But was it a moment where Sir Keir Starmer could convincingly claim to have taken a decisive step towards smashing the gangs, which was one of the goals he claimed he had for the summit this afternoon? Absolutely not. While presented domestically as a means to tackle illegal immigration, in fact, the Western Balkans Summit was not primarily about migration, and I understood the talks focused on many other areas, including growth opportunities and EU enlargement. Indeed, I was told that return hubs were not even on the prime minister's agenda. Perhaps unsurprisingly, western Balkan leaders did not want to talk about that and the summit was not designed in the first place to focus on that agenda, regardless of how it was presented to the domestic media. \n                  Man deported under 'one in, one out' scheme returns to UK in small boat\n                 \n                  Small boat migrant crossings in 2024 surpass last year's total two months early\n                 \n                  Kosovo PM Albin Kurti: We feel 'obligation' to host UK migrant return hub\n                 The backdrop for the summit couldn't have been more tricky. The number of immigrants who crossed the Channel exceeded the number in 2024 on Wednesday. Read more:Man deported under 'one in, one out' returns to UKPM backs call for MP probe into Prince Andrew's housing Meanwhile, the first of the 46 migrants returned to France made their way back over the Channel, claiming France is an unsafe country. There was finger pointing from British officials about why the French police had not done more to detain and deter this man from returning. And the truth is, migrants who leave the UK are returning - because in many cases we are giving them the cash to do so. That aside, there is also a nervousness that the French one-in, one-out deal may collapse entirely in a matter of weeks. Only 42 individuals have been removed from the UK to date but the EU has to authorise this plan for the long-term and it is far from clear that it will survive. To have secured the long term future of that deal at an international summit would be a big success. Today's were on a much smaller scale."
    },
    {
        "title": "All survivors who quit grooming gang inquiry will return if Jess Phillips resigns",
        "description": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns.",
        "url": "https://news.sky.com/story/jim-gamble-a-frontrunner-to-become-chair-of-grooming-gang-inquiry-withdraws-sky-news-understands-13455102",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jess-phillips-grooming-gangs_6984282.jpg?20250806170642",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-22 21:00:00",
        "Headline": "In a letter to the home secretary, the survivors said the minister's conduct shows she is \"unfit\" to oversee a process that requires them to trust the government.",
        "Content": "All survivors who have resigned from the government's grooming gangs inquiry panel will consider returning if safeguarding minister Jess Phillips resigns. The four women who have resigned this week have written to Home Secretary Shabana Mahmood, calling for Ms Phillips to step down and all survivors to be consulted on appointing a senior judge as chair with no major conflicts of interest. Ms Phillips told parliament on Tuesday suggestions the scope of the inquiry was to be expanded from just grooming gangs were \"categorically untrue\". But leaked consultation documents and texts between the safeguarding minister and survivor Fiona Goddard show the survivors' concerns that the scope would be expanded were valid. The survivors' letter says: \"Being publicly contradicted and dismissed by a government minister when you are a survivor telling the truth takes you right back to that feeling of not being believed all over again. \"It is a betrayal that has destroyed what little trust remained.\" Phillips 'unfit' to oversee process The survivors have demanded the scope of the inquiry remain \"laser-focused\" on grooming gangs and called for victims to be free to speak to support networks without fear of reprisal. An independent mental health professional should replace the current victim liaison lead, they also wrote. The letter to Ms Mahmood says: \"Her [Ms Phillips'] conduct over the last week has shown she is unfit to oversee a process that requires survivors to trust the government. Her departure would signal you are serious about accountability and changing direction.\" The survivors describe their demands as \"the absolute bare minimum for survivors to trust that this inquiry will be different from every other process that has let us down\". Sky News has approached the Home Office for a comment on the victims' letter. Read more on Sky News:Inquiry 'won't be watered down'Grooming survivor quits inquiryVictim 'lives with trauma every day Frontrunner quits over 'toxicity' The letter was sent hours after one of the frontrunners to become chair of the inquiry withdrew, blaming \"vested interests\" and \"political opportunism and point-scoring\". Ex-police chief and child protection specialist Jim Gamble told the home secretary in a letter there was a \"highly charged and toxic environment\" around the appointment process and victims \"deserve better\". Speaking to Sky News, he said he originally viewed the job as an \"opportunity of a lifetime\" but changed his mind due to a \"growing level of toxicity\" and misinformation. He said he had more than 20 years' experience working with abuse survivors and understood the issues involved. \"To imply for one second I would align myself with any political party to hide their blushes is just nonsense,\" said Mr Gamble, who added he was stepping back \"with a heavy heart\".  'Political opportunism' In his letter to the home secretary, Mr Gamble said his decision was \"reinforced by the highly charged and toxic environment that has surrounded and influenced the appointment process and the impact this has had on those closest to me\". He added: \"Regrettably, the reaction to the appointment process has been defined more by the vested interests of some, as well as political opportunism and point-scoring, rather than by the cross-party consensus required to address such a serious national issue. \"Victims and survivors, who have been let down so often in the past, deserve better than to be used as leverage for short-term gain by anyone.\" Mr Gamble began his career in Northern Ireland, rising to become head of RUC special branch in Belfast. However, he is best known for his work combating child abuse, and in 2006 headed up the Child Exploitation and Online Protection Centre, which revolutionised the approach to policing online child abuse networks. He was one of two known leading candidates for the role. Former social worker out of the running The other, Annie Hudson, a former social worker, said earlier this week she no longer wanted to be considered after intense media coverage. The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. It is understood that the government is exploring a range of other candidates and will provide an update in due course.  A Home Office spokesperson said: \"The grooming gang scandal was one of the darkest moments in this country's history. \"That is why this government is committed to a full, statutory, national inquiry to uncover the truth. It is the very least that the victims of these hideous crimes deserve. \"We are disappointed that candidates to chair that inquiry have withdrawn. This is an extremely sensitive topic, and we have to take the time to appoint the best person suitable for the role. \"The home secretary has been clear - there will be no hiding place for those who abused the most vulnerable in our society.\" Inquiry 'will never be watered down' Kemi Badenoch raised the issue at Prime Minister's Questions on Wednesday, with the Tory leader asking - on behalf of one of the resigned grooming inquiry members - what the point of an inquiry is if they are just ignored. Sir Keir said the inquiry \"is not and will never be watered down\" and that he wanted survivors \"to be at the heart of this\".  Victim's father calls for minister to resign Marlon West, whose daughter Scarlett was a grooming victim who was raped by more than 60 men, has also called for Ms Jess Phillips to resign. He said he doubted she would, but claimed she \"has lost any kind of faith from the public, and more importantly with survivors and families\".  Mr West described the minister in parliament this week as \"unprofessional\" and \"defensive rather than listening to what survivors are saying\". He also wants to see an inquiry with family members included, alongside survivors, on the panel, and even though he doesn't want to be included, he said, \"it's the families who are dealing with the services, not so much the survivors\". Mr West added: \"It's the parents who are dealing with the police, every single day, and social services. It's really important that they get family perspective. I think they should start again.\" 'Gaslit and manipulated' Survivor Ellie-Ann Reynolds, who withdrew earlier this week, said as soon as they [victims] found out what the two candidates used to do [police and social work], it \"raised red flags\" as they were involved with \"the two institutions that have failed us\". Mr Gamble's decision to withdraw was \"the right thing to do\", she said, as victims were \"gaslit\" and \"manipulated\" during the process and had \"very little faith in authorities and systems\"."
    },
    {
        "title": "Man deported under 'one in, one out' scheme returns to UK in small boat",
        "description": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat.",
        "url": "https://news.sky.com/story/man-deported-under-one-in-one-out-scheme-returns-to-uk-in-small-boat-13455227",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-home-office-migrant_7058547.jpg?20251022160545",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-22 14:47:00",
        "Headline": "Sky News understands that the Iranian man will be deported to France once again.",
        "Content": "A migrant who was deported back to France under the government's flagship \"one in, one out\" scheme has returned to the UK on a small boat. The Iranian national was initially detained when he entered the UK on a small boat on 6 August. He was removed under the government's deal with France on 19 September, and he returned on 18 October. He has been detained once again, and Sky News understands that the government is set to expedite his removal back to France. Politics latest: Remaining grooming gang inquiry chair candidate withdraws The news comes as Sky News learns that more migrants have crossed the Channel on a small boat in 2025 so far than the entirety of 2024. The \"one in, one out\" treaty with France allows the UK to return anyone who arrives in the UK on a small boat back to France, in exchange for France sending to the UK the same number of people who have never previously tried to enter illegally.  The man told The Guardian newspaper that he had been a victim of modern slavery at the hands of people smugglers in northern France. \n                  Death threats for former French president Nicolas Sarkozy - less than a day into five-year prison sentence\n                 \n                  Louvre robbery: Paris museum reopens three days after crown jewels stolen in daring heist\n                 \n                  Jewels stolen in Louvre heist worth £76m, prosecutor says\n                 \"If I had felt that France was safe for me I would never have returned to the UK,\" he claimed. \"When we were returned to France we were taken to a shelter in Paris. I didn't dare to go out because I was afraid for my life. The smugglers are very dangerous. They always carry weapons and knives. I fell into the trap of a human trafficking network in the forests of France before I crossed to the UK from France the first time. \"They took me like a worthless object, forced me to work, abused me, and threatened me with a gun and told me I would be killed if I made the slightest protest. Every day and every night, I was filled with terror and stress. Every day I live in fear and anxiety, every loud noise, every shadow, every strange face scares me. \"When I reached UK the first time and Home Office asked what had happened to me I was crying and couldn't speak about this because of shame.\" The UK government's position is that France is a safe country.  'Rwanda is further than France' The aim of the agreement with France is to create a disincentive for migrants to make the dangerous crossing across the Channel. But Downing Street repeatedly refused to describe the scheme as a \"deterrent\" this afternoon, insisting that the scheme is among a number of measures the government is taking to stop small boat crossings. A Home Office spokesperson said in a statement: \"We will not accept any abuse of our borders, and we will do everything in our power to remove those without the legal right to be here. \"Individuals who are returned under the pilot and subsequently attempt to re-enter the UK illegally will be removed.\" Former Tory home secretary James Cleverly quipped on social media that \"Rwanda is a lot further away than France\", arguing that had their embattled scheme got off the ground, it would have been harder for migrants to make the return journey. The prime minister is hosting Western Balkans leaders on Wednesday as the government tries to crack down on people smuggling and illegal migration. But despite various government efforts, Sky News understands that more migrants have crossed the English Channel in small boats so far this year than in the whole of 2024, Sky News understands While the exact number of people who have made the crossing today is not set to be published until tomorrow, Home Office sources have confirmed that more than 36,816 people - the total for 2024 - have now crossed the Channel so far in 2025. Home Secretary Shabana Mahmood said in a statement: \"The previous government left our borders in crisis, and we are still living with the consequences. These figures are shameful - the British people deserve better. \"This government is taking action. We have detained and removed more than 35,000 who were here illegally. Our historic deal with the French means those who arrive on small boats are now being sent back. \"But it is clear we must go further and faster - removing more of those here illegally, and stopping migrants from making small boat crossings in the first place. \"And I have been clear: I will do whatever it takes to restore order to our border.\""
    },
    {
        "title": "PM backs call for MP investigation into Prince Andrew's housing arrangement",
        "description": "Sir Keir Starmer has backed a call for a Commons investigation into Prince Andrew's housing arrangement. ",
        "url": "https://news.sky.com/story/pm-backs-call-for-mp-investigation-into-prince-andrews-housing-arrangement-13455076",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-windsor-castle_7058588.jpg?20251022165932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-22 11:56:00",
        "Headline": "Liberal Democrat leader Sir Ed Davey has called for a select committee inquiry into the Crown Estate, for which Prince Andrew would be called to give evidence. ",
        "Content": "Sir Keir Starmer has backed a call for a Commons investigation into Prince Andrew's housing arrangement.  The King's brother is still living in the Royal Lodge, a 30-room Windsor mansion owned by the Crown Estate, despite relinquishing his Duke of York title last week. Politics Live: Starmer promises grooming gangs inquiry 'will never be watered down' It has emerged he only pays a \"peppercorn rent\" on the property - a legal term used in leases to show that rent technically exists, so the lease is valid, but it's nominal - often £1 a year or even nothing at all. Liberal Democrat leader Sir Ed Davey has called for a select committee inquiry into the Crown Estate, in which Prince Andrew would be called to give evidence. Speaking in Prime Minister's Questions, Sir Ed said: \"Given the revelations about Royal Lodge, does the prime minister agree that this House needs to properly scrutinise the Crown Estate to ensure taxpayers' interests are protected. \"The chancellor herself has said that the current arrangements are wrong. \n                  Politics latest: Grooming survivors demand Jess Phillips resigns before they return to inquiry\n                 \n                  Starmer failed to take decisive step to smash the gangs at leaders summit - as small boat crossings exceed 2024\n                 \n                  All survivors who quit grooming gang inquiry will return if Jess Phillips resigns\n                 \"So will the prime minister support a select committee inquiry, so all those involved can be called for evidence, including the current occupant?\" Responding, Prime Minister Sir Keir Starmer said: \"It's important in relation to all Crown properties that there is proper scrutiny, and I certainly support that.\" A document from the Crown Estate, which oversees the Royal Family's land and property holdings, shows Andrew signed a 75-year lease on the Royal Lodge in 2003.  It reveals he paid £1m for the lease and that since then he has paid \"one peppercorn\" of rent \"if demanded\" per year. Andrew was also required to pay a further £7.5m for refurbishments completed in 2005, according to a report by the National Audit Office. The agreement also contains a clause that states the Crown Estate would have to pay Andrew around £558,000 if he gave up the lease. The royal is under pressure to do just that amid continued scrutiny over his relationship with paedophile financier Jeffrey Epstein. There has also been fresh focus on his sex accuser Virginia Giuffre's allegations, which Andrew denies, after the publication of her posthumous memoirs. Senior Tory Robert Jenrick said it was \"about time Prince Andrew took himself off to live in private\" as \"the public are sick of him\". Asked about his living arrangement on Tuesday, Chancellor Rachel Reeves told the BBC: \"I do think people should pay their way and pay their fair share.\""
    },
    {
        "title": "Why are abuse survivors losing faith in the grooming gang inquiry?",
        "description": "The grooming gangs inquiry has been plunged into disarray this week before it has even started, as four survivors have quit the panel and two frontrunners for chairperson have withdrawn.",
        "url": "https://news.sky.com/story/why-are-abuse-survivors-losing-faith-in-the-grooming-gang-inquiry-13455019",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-online-grooming-farrell_6636514.jpg?20251022132547",
        "type": "Politics",
        "Author": "Adele Robinson, news correspondent and Jake Levison, news reporter",
        "Date Published": "2025-10-22 09:59:00",
        "Headline": "Pressure is growing on the government over its upcoming grooming gang inquiry, with one victim's father saying the government \"should start again\".",
        "Content": "By Adele Robinson, news correspondent and Jake Levison, news reporter  The grooming gangs inquiry has been plunged into disarray this week before it has even started, as four survivors have quit the panel and two frontrunners for chairperson have withdrawn. The inquiry was announced in June, but frustrations have grown over the pace of progress towards launching it, with pressure mounting on the government to appoint a chair and set out its terms of reference. Survivors Fiona Goddard and Ellie-Ann Reynolds were first to stand down from their roles over concerns about who could head the inquiry and fears it may be \"watered down\" - something Sir Keir Starmer has denied, insisting that \"injustice will have no place to hide\". Both candidates shortlisted to lead the inquiry have now pulled out. Here's what we know about why panel members have quit and what the government has said in response. Concerns over inquiry chairs The resignations came after Sky News revealed the two shortlisted chairs for the inquiry were former police chief Jim Gamble and social worker Annie Hudson. Ms Goddard was the first to resign from the survivors' liaison panel, expressing deep reservations about the candidates: \"One has a background in police and the other, a social worker. The very two services that contributed most to the cover-up of the national mass rape and trafficking of children. \"This is a disturbing conflict of interest, and I fear the lack of trust in services from years of failings and corruption will have a negative impact in survivor engagement with this inquiry.\" The other survivors who resigned also took issue with the shortlisted chairs in their statements.  Ms Hudson withdrew her candidacy on Tuesday, while Mr Gamble pulled out of the running on Wednesday. In a letter to Home Secretary Shabana Mahmood explaining his decision, Mr Gamble said it was \"clear that a lack of confidence due to my previous occupation exists among some\" and that he did not want to proceed without a consensus among the victims. A Home Office spokesperson said: \"We are disappointed that candidates to chair that inquiry have withdrawn. This is an extremely sensitive topic, and we have to take the time to appoint the best person suitable for the role.\" Speaking to Sky News after Mr Gamble's resignation, Ms Reynolds said: \"The minute that we found out their former employment, it raised red flags.\" She claimed they represented \"the very institutions that have failed us\" and that their views would not have been \"unbiased\" or \"impartial\".  During Prime Minister's Questions on Wednesday, Sir Keir said his government \"will find the right person to chair the inquiry\", but did not mention names. Ms Reynolds and other victims have called for a judge to chair the inquiry, but Sir Keir said he ruled that out because it would require all ongoing criminal proceedings to finish before the inquiry could begin, leading to lengthy delays. \"We've waited years for the truth,\" Ms Reynolds said. \"The timing really doesn't matter. As long as we know that it's going to be done properly and impartially... we would be able to wait to ensure that that's done.\"  The full statutory inquiry into how cases of child sexual exploitation have been handled across England and Wales was announced by Sir Keir after an audit by Baroness Louise Casey found children had been failed by the systems in place to protect them. On Wednesday, Sir Keir said Baroness Casey would be working in support of the inquiry. Claims about poor treatment of survivors Ms Reynolds said survivors were \"kept in the dark\" and \"treated with contempt and ignored\" when they asked about Home Office meetings and decisions. She said it was made clear that \"speaking openly would jeopardise our place on the panel\". She told Sky News that victims were \"gaslit\" and \"manipulated\" during the process and they had \"very little faith in authorities and systems\". Similarly, Ms Goddard claimed a \"toxic, fearful environment\" had been created for survivors on the panel, with \"condescending and controlling language\" used towards them. Safeguarding Minister Jess Phillips has said she \"regrets\" resignations from the inquiry and that it was \"always sad when victims feel that they can't take part in a process\". On Wednesday, Sir Keir said: \"I respect the views of all the survivors, and there are different views, I accept that.\" He added that the door was open for people to return to the inquiry panel if they wished. Fears of 'diluted' inquiry The survivors say they fear the inquiry could be diluted, suggesting the Home Office could broaden its scope beyond group-based sexual abuse and push for it to have a regional focus rather than being truly national. Ms Goddard said the survivors had \"repeatedly faced suggestions from officials to expand this inquiry\" and that it risked being \"watered down\". Ms Reynolds said the \"final turning point\" in her decision to quit the panel was the \"push to widen the remit of the National Inquiry in ways that downplay the racial and religious motivations behind our abuse\". Ms Phillips said allegations that the inquiry is being diluted or intentionally delayed were \"false\" and that it would \"remain laser-focused on grooming gangs\". Read more from Sky News:Phillips slams 'idiot' councils for not seeing grooming problemLeading candidates to chair grooming gangs inquiry revealed Ms Goddard claimed this amounted to the minister calling her \"a liar\" and said she should apologise and resign. Ms Reynolds also said she believed Ms Phillips was \"unfit for the role\". During PMQs on Wednesday, Sir Keir defended the safeguarding minister, saying she and Baroness Casey were the \"right people\" to take the inquiry forward. He insisted the inquiry \"is not and will never be watered down\" and that \"its scope will not change\". \"It will examine the ethnicity and religion of the offenders, and we will find the right person to chair the inquiry,\" he said. 'They should start again' The father of a grooming gang victim says the government \"should start again\" with the national inquiry. Marlon West, whose daughter Scarlett was a victim of sexual exploitation in Manchester, told Sky News that public \"faith\" has been \"lost\". He described Ms Phillips in parliament this week as \"unprofessional\" and \"defensive rather than listening to what survivors are saying.\" \"I doubt she will resign but she has lost any kind of faith from the public, and more importantly with survivors and families. He wants to see an inquiry with family members included alongside survivors on the panel. \"Not that I want to go on it, if I'm honest,\" he said, \"but it's the families who are dealing with the services, not so much the survivors. \"It's really important that they get family perspective. I think they should start again.\" Government denies 'watered down' approach Home Secretary Shabana Mahmood responded to the resignations saying the scope of the inquiry \"will not change\" and that it will leave \"no hiding place\" for those involved in the scandal. In an article for The Times, she vowed the probe \"will never be watered down on my watch\" - and said it will focus on how \"some of the most vulnerable people in this country\" were abused \"at the hands of predatory monsters\". The home secretary also insisted the inquiry will be \"robust and rigorous\" - with the power to compel witnesses, and examine the ethnicity and religion of the offenders. Speaking to Times Radio on Wednesday, Ms Goddard said the Home Secretary's statement was \"reassuring\" but reiterated that Ms Phillips should resign."
    },
    {
        "title": "Caerphilly by-election: Will Plaid or Reform have last laugh in Tommy Cooper's birthplace?",
        "description": "Caerphilly is famous for three Cs: coal, cheese and its mighty castle. It's also the birthplace of the legendary comedian Tommy Cooper.",
        "url": "https://news.sky.com/story/caerphilly-by-election-will-plaid-or-reform-have-last-laugh-in-tommy-coopers-birthplace-13454658",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nigel-farage-rhun-ap-iowerth_7057706.jpg?20251021210247",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-22 03:29:00",
        "Headline": "The Caerphilly by-election will be a key indication of how future Westminster elections could go.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Caerphilly is famous for three Cs: coal, cheese and its mighty castle. It's also the birthplace of the legendary comedian Tommy Cooper. And after Thursday's Senedd by-election, in what was once a Labour stronghold as impregnable as the castle, it's Plaid Cymru or Reform UK that will have the last laugh. It may not be a Westminster by-election, but this clash will have an impact on UK politics way beyond the Welsh valleys if Nigel Farage's party triumphs. A Reform UK victory would strengthen claims that Mr Farage and his insurgents are poised to inflict massive damage on Labour and the Conservatives in elections next year and beyond. Victory in the valleys would intensify fears among the other parties that Reform UK's boasts about winning the next general election are not the fantasy that its opponents claim. On a campaign visit to Caerphilly, Mr Farage - inevitably - posed for photographs in front of a 9ft tall bronze statue of Tommy Cooper, who died in 1984. But the by-election is no laughing matter for Labour, which has seen its support in this by-election crumble like Caerphilly cheese. \n                  Migrant with AK-47 face tattoo who threatened to kill Nigel Farage shouts from dock as he's jailed\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \n                  'The time is now to stop Reform' - Plaid Cymru calls on Labour voters to unite behind Welsh nationalists \n                 Labour has held the Westminster seat of Caerphilly since 1918 and the Senedd seat since devolution in 1999. Ron Davies, said to be the architect of Welsh devolution, was MP from 1983 to 2001. He was Welsh secretary under Tony Blair from 1997 until he quit over what he called a \"moment of madness\" in 1998 when he was mugged at knifepoint on London's Clapham Common. For the front-runner Reform UK, not even the conviction of its former leader in Wales, Nathan Gill, for taking pro-Russian bribes seems to have halted the march of Mr Farage's party towards the brink of a stunning victory. Mr Gill, who led Reform UK in Wales in 2021, admitted taking bribes to make statements in favour of Vladimir Putin's Russia while he was a member of the European Parliament. Questioned during a visit to Caerphilly, Mr Farage said: \"Any political party can find in their midst all sorts of terrible people. Gill is particularly shocking because I knew him as a devout Christian, very clean-living, honest person. So I'm deeply shocked.\" Despite this bribery scandal, the latest opinion poll in the constituency suggested a narrow Reform UK victory, with Mr Farage's party on 42%, Plaid Cymru on 38% and Labour languishing on a dismal 12%. But with Labour, the Conservatives, Liberal Democrats and Green Party out of contention in a two-horse race, Reform UK's candidate Llŷr Powell could be vulnerable to tactical voting for Plaid Cymru's Lindsay Whittle. Turnout could be crucial. A low turnout is likely to help Plaid Cymru win. A high turnout could mean Reform's opinion poll leads, both nationally and locally, are reliable and could hand victory to Mr Farage. But Plaid has come second in every Senedd election in Caerphilly and Mr Whittle can't be faulted for perseverance and dogged determination. Until now, he's had a miserable record as a candidate, both for Westminster and the Senedd. Aged 72, he has stood in Caerphilly in every general election since 1983, no fewer than 10 times, and in every Welsh Assembly election since it was formed in 1999 - seven times. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Dubbed \"Mr Caerphilly\" by his party, he was council leader and assembly member for South Wales East between 2011 and 2016. Interviewed by Sky News back in 2003, the year of Tony Blair's Iraq war, he said: \"People are obviously very unhappy with the health service. They're unhappy with the way the Labour Party are drifting to the right. \"They're unhappy with the treatment of the ex-miners and their compensation claims. They're unhappy with the treatment of the firemen. They're unhappy that we've just gone to war.\" Reform UK's Mr Powell, on the other hand, is just 30 and is relatively inexperienced as a candidate. He was a Tory candidate in local elections in Cardiff in 2022. But he was also active in Mr Farage's UKIP and Brexit Party and worked for the now disgraced Gill as a constituency caseworker while Gill was an MEP. He now says Mr Gill's actions were \"abhorrent\" and \"a betrayal\". For Labour, despite its long dominance in Caerphilly, this campaign couldn't have gone any worse. As well as battling against the unpopularity of both Sir Keir Starmer and the Welsh government, the council's Labour leader, Sean Morgan, defected to Plaid Cymru during the campaign. So, like many two-horse races, this political dash to the finishing line could be neck and neck. Of Caerphilly's three Cs, coal is long gone. The last mine, Penallta collier, closed in 1991, though there's a proud history of coal mining. Back in 1913, tragedy struck when the Universal Colliery in Senghenydd was the site of the UK's worst mining accident, when 439 miners and a rescuer were killed in an explosion. But Caerphilly could be about to make history once more, with either a massive stride forward on the road to Downing Street for Mr Farage or Labour surrendering power to the Welsh nationalists in Cardiff after more than a quarter of a century. And, as Caerphilly's most famous son would have said, the by-election result on Thursday night will be a pointer to politics in Wales and the whole of the UK... just like that!"
    },
    {
        "title": "MSP Colin Smyth appears in court charged with voyeurism and possessing indecent images of children",
        "description": "A suspended Scottish Labour MSP has appeared in court charged with voyeurism and being in possession of indecent photographs of children.",
        "url": "https://news.sky.com/story/msp-colin-smyth-appears-in-court-charged-with-voyeurism-and-possessing-indecent-images-of-children-13455048",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dumfries-sheriff-court_7058348.jpg?20251022134821",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-10-22 17:18:00",
        "Headline": "Colin Smyth, 52, made no plea to the two charges and has been granted bail ahead of his next court appearance.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A suspended Scottish Labour MSP has appeared in court charged with voyeurism and being in possession of indecent photographs of children. Colin Smyth, 52, was previously arrested on 5 August. The MSP for South Scotland appeared before Dumfries Sheriff Court on Wednesday, where he made no plea to the two separate charges. The accused, whose general address was given as Edinburgh, was granted bail ahead of his next court appearance, which is yet to be confirmed. A spokesperson from the Crown Office and Procurator Fiscal Service (COPFS) said: \"These matters are active under the Contempt of Court Act 1981. \"The provisions of this act protect the integrity of proceedings, preserve access to justice for victims and secure the rights of people accused of crime. \"Anyone publishing items about active cases is advised to exercise caution as material must not be commentary or analysis of evidence, witnesses or accused. \"Contempt of Court carries penalties of up to two years in prison and/or an unlimited fine.\" Smyth has been an MSP since 2016 and previously served as Scottish Labour's general secretary from 2008 to 2012. He is currently suspended from the party and is listed as an independent on the Scottish parliament website."
    },
    {
        "title": "Scottish and UK governments locked in dispute over £26m cost of Donald Trump and JD Vance visits",
        "description": "The Scottish and UK governments are locked in a dispute over who should foot the &#163;26m bill for Donald Trump and JD Vance's recent visits to Scotland.",
        "url": "https://news.sky.com/story/scottish-and-uk-governments-locked-in-dispute-over-16326m-cost-of-donald-trump-and-jd-vance-visits-13454947",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-sir-keir-starmer_7058089.jpg?20251022090716",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-22 07:55:00",
        "Headline": "Scotland's Finance Secretary Shona Robison said the visits imposed \"substantial operational and financial burdens on Scottish public services, particularly Police Scotland\".",
        "Content": "The Scottish and UK governments are locked in a dispute over who should foot the £26m bill for Donald Trump and JD Vance's recent visits to Scotland. The US president spent four days visiting his golf courses in Ayrshire and Aberdeenshire in July, while the vice president spent around four days in Ayrshire the following month. In a letter to Chief Secretary to the Treasury James Murray, Scotland's Finance Secretary Shona Robison said the visits imposed \"substantial operational and financial burdens on Scottish public services, particularly Police Scotland\". Ms Robison said the estimated additional cost of policing the presidential visit alone was around £20m, reflecting peak daily deployments of more than 4,000 officers, while the cost for the vice president's trip was around £6m. According to provisional figures published by the Scottish government later on Wednesday, the two visits cost around £24.5m - with Police Scotland's bill totalling around £24.1m. The SNP MSP said while both occasions were framed as private visits, they were \"diplomatically significant\". She wrote: \"Following your decision not to provide funding to Scotland for costs incurred in relation to the visit of President Donald Trump to Scotland in July 2025 and the subsequent visit of Vice President JD Vance, I am writing to you to request that you reconsider this decision and provide full reimbursement for the cost of the visits.\" The UK government said the visits were private and \"not official UK government business\", and that the Scottish government is \"responsible for policing costs\". Mr Trump's trip came ahead of his UK state visit in September. During his time in Scotland, the president enjoyed several rounds of golf, opened a new golf course, and met with Prime Minister Sir Keir Starmer, First Minister John Swinney, and EU Commission President Ursula von der Leyen. Ms Robison pointed out the UK government reimbursed the cost of Mr Trump's visit to Scotland in 2018. Referring to the visits this summer, she wrote: \"It is important to note that these visits were not initiated by the Scottish government, nor were they part of devolved policy initiatives. \"Whilst I recognise this was not an official visit initiated by the UK government, any visit by a sitting president and vice president will always constitute a high-profile event. \"There is clear previous precedent, where the UK government has supported policing costs for visits to devolved nations by foreign dignitaries, including for the costs of the president's visit in 2018. \"Although the London element of the 2018 visit was for official engagements, the Scotland element was not.\" Ms Robison warned that failing to reimburse the costs would \"not only strain devolved budgets but also set a troubling precedent for future high-profile visits\". The letter was sent last week. 👉 Follow Trump100 on your podcast app 👈 Scotland's public finance minister Ivan McKee said the UK government should reimburse the full costs. He added: \"The visits were part of UK government international relations, with the prime minister formally meeting the president in two locations in Scotland during his visit. \"It is completely unacceptable to expect the Scottish government to foot the bill for what were clearly not private visits, as the UK government is claiming.\" A UK government spokesperson said: \"These were private visits by the president and vice president to Scotland, not official UK government business. \"The Scottish government are responsible for policing costs in Scotland as per agreed devolved funding arrangements.\" It is understood Mr Trump's visit in 2018 followed a UK government invitation, and Principle 10 of the Statement of Funding Policy therefore applied."
    },
    {
        "title": "Comet Lemmon visible in UK after closest approach to Earth in 1,300 years",
        "description": "Skygazers in the UK have the best chance this week to see a comet which will not make another close approach to Earth for another 1,300 years, astronomers have said.",
        "url": "https://news.sky.com/story/comet-lemmon-visible-in-uk-after-closest-approach-to-earth-in-1300-years-13455101",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-comet-lemmon-comet_7058383.jpg?20251022150537",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-22 12:57:00",
        "Headline": "Comet Lemmon came closest to the Earth when it was 56 million miles away, but will still be a \"fairly bright, fuzzy object\" for people to see in the evening sky.",
        "Content": "Skygazers in the UK have the best chance this week to see a comet which will not make another close approach to Earth for another 1,300 years, astronomers have said. Comet Lemmon should be easy to see with binoculars during the evening after sunset - but experts said it may also be possible to see it with the naked eye depending on the weather and if \"you've got a very dark sky\". The comet, which orbits the sun, was first detected in January and has been monitored by astronomers during the year. It came closest to the Earth on Tuesday when it was 56 million miles (90 million km) away, but is still expected to offer people the chance of \"something to go and enjoy\" into the opening days of November. Another comet, Swan, came to within 24 million miles (39 million km) of Earth on Tuesday, but it is easier to view from the southern hemisphere with a telescope. It comes as one of the most reliable meteor showers is set to peak this week when debris left by Halley's Comet will streak across the night sky. The Orionid meteor shower presents a dramatic light show for UK astronomers, producing up to 20 meteors every hour until the early morning. Read more:Here's how to see the Orionid showerFind out the weather for your area  Best time to see Comet Lemmon People in the UK are being advised that 8pm is around the best time to see Lemmon, which last made its closest approach to Earth around 1,300 years ago. By looking at a clear western sky around an hour after sunset, the comet - a greenish cosmic snowball - will appear relatively high and will brighten as it gets nearer to the sun in the coming weeks. Dr Robert Massey, deputy executive director of the Royal Astronomical Society, said it may be a \"little tough\" to see with the naked eye, but it should be \"reasonably bright\" and easy to spot with binoculars. \"Comet Lemmon is pretty much at its best visibility right now,\" he said. \"The best place to look is in the evening sky. As the sky darkens the comet will first of all be moving, over a matter of days, past the bright star Arcturus, and then further round towards the southwest. \"It will stand out as a fairly bright, fuzzy object. \"The fact that you can see it easily with binoculars makes it fairly unusual, and I think for that reason alone it's something to go and enjoy, particularly if you've never seen a comet before.\" This month also brought the chance to see the harvest moon - the first of three consecutive supermoons due to appear before the end of 2025. Supermoons appear larger and fuller than usual because the moon is at a point in its orbit which is nearer to Earth. The next supermoon will rise on 5 November and is set to be \"the biggest one of all\"."
    },
    {
        "title": "Is OpenAI's browser worth the hype? These experts tried it out",
        "description": "\"To put it bluntly, it felt at times like watching a 12-year-old use my computer.\"",
        "url": "https://news.sky.com/story/is-openais-browser-worth-the-hype-these-experts-tried-it-out-13455085",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-openai_7002687.jpg?20250827150243",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-22 14:29:00",
        "Headline": "\"Maybe I will use it in the future, if they release versions that are actually working,\" said one expert.",
        "Content": "\n          Science and technology reporter\n        \"To put it bluntly, it felt at times like watching a 12-year-old use my computer.\" That's Dr Junade Ali's assessment of the new OpenAI browser, which was released on Tuesday evening. The browser, called Atlas, appears designed to challenge Google Chrome and potentially supplant the most profitable segment of Google's parent company, Alphabet. But after testing out Atlas, AI experts have told Sky News one of its key elements feels \"very clunky\". As well as fully incorporating ChatGPT into the browser so it follows you around the internet, the \"most exciting part\" of the browser is its AI agent, according to Dr Andrea Barbon from the University of St Gallen. The feature is currently only available in \"preview mode\" for certain users. \"When you activate the agent, you can ask it to do something, and then it will take control of your computer or your mouse,\" he explained after trying it out. \"It will start clicking around on the website to perform the task that you requested,\" he said - but the feature left him disappointed, and he stopped using the browser within minutes. \"I tried a couple of websites where the workflow is a bit complex and ChatGPT was just not able to handle it, not at all,\" he said. \"After a few minutes, I closed the browser and I didn't uninstall it, but I could - I'm not going to use it, right? \"Maybe I will use it in the future, if they release versions that are actually working,\" he said. Dr Ali, a fellow at the Institution for the IET, said the AI agent would \"struggle around a little bit to try and do the task in the most effective way and it would sometimes get stuck\". \"It definitely seemed very primitive - but it is a really neat concept,\" he said. OpenAI said its agent mode is \"an early experience and may make mistakes on complex workflows\". \"We're rapidly improving reliability, latency and complex task success.\" Will it topple Google? Despite being underwhelmed by the browser, Dr Ali said OpenAI has already shown it can cause Google problems. \"We do see Google struggling to keep up with the advances that OpenAI are doing,\" he said. OpenAI has already made a \"massive dent\" in the web traffic Google would usually be able to make money from, he said, through ChatGPT and people using the AI bot as a search engine. \"So in that aspect, it has already been able to disrupt Google.\" \"Google is going to respond,\" said Dr Barbon. \"For sure, Google is gonna integrate more AI into Google Chrome. So it really depends on who is faster at achieving a working prototype. I think OpenAI is not there yet.\" Will this change how we use the internet? When Google launched in 1998, it changed the flow of information around the world, disrupted business models and revolutionised advertising. OpenAI are hoping Atlas has a similarly sweeping impact. During last night's launch, chief executive Sam Altman said: \"AI presents a rare once-in-a-decade opportunity to rethink what a browser can be about.\" Read more from Sky News:Royal Navy destroyer intercepts Russian warshipStorm Benjamin to bring heavy rain and winds For Dr Luke Roberts, from the Centre of Science and Policy at the University of Cambridge, an AI-integrated browser could trigger societal change.  \"The bigger question behind this is really [about] the shift from the attention economy to the answer economy,\" he told Sky News. \"If the conversations previously were [about] how much technology grabs your attention, I think the biggest societal shift we're gonna see is people just want the answer now.\" 👉 Listen to Sky News Daily on your podcast app 👈 With AI making answers quicker and easier to access than ever before, Dr Roberts warned there is a risk we will become complacent about the source and veracity of that information. \"We don't necessarily scrutinise the answers we're being given, we just accept them at face value,\" he said. \"I think there's some really big shifts about to happen that we're going to need to really think quite deeply as a society.\""
    },
    {
        "title": "Elon Musk launches personal attack on NASA boss - and says he isn't smart enough for the job",
        "description": "Elon Musk has attacked NASA's administrator - and claimed he isn't smart enough to hold the top job.",
        "url": "https://news.sky.com/story/elon-musk-launches-personal-attack-on-nasa-boss-and-says-he-isnt-smart-enough-for-the-job-13454871",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-tesla_6902434.jpg?20250501102033",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-22 04:28:00",
        "Headline": "While NASA has been planning to use SpaceX's Starship rocket system to land on the lunar surface, proposals will now be accepted from rivals as the US tries to return astronauts to the moon before China gets there.",
        "Content": "Elon Musk has attacked NASA's administrator - and claimed he isn't smart enough to hold the top job. The billionaire's criticism of Sean Duffy came after the space agency said it was open to using moon landers that weren't manufactured by his company SpaceX. On X, Musk accused Mr Duffy of \"trying to kill NASA\", and wrote: \"The person responsible for America's space program can't have a 2 digit IQ.\"  While NASA has been planning to use SpaceX's Starship rocket system to land on the lunar surface, proposals will now be accepted from rivals. The agency wants to return astronauts to the moon within Donald Trump's second term and do so before China gets there. Mr Duffy had told CNBC: \"We're not going to wait for one company. We're going to push this forward and win the second space race against the Chinese.\" While SpaceX has a $2.9bn (£2.2bn) contract for the Artemis III mission, it has fallen behind schedule - with Starship suffering a series of explosive failures this year. \n                  Did Trump and Zelenskyy's meeting turn into a 'shouting match'?\n                 \n                  Burning space debris which crashed to Earth may have come from Chinese rocket, says expert\n                 \n                  Gangsters, billionaires and love triangles: Behind the scenes of China's micro-drama boom\n                  Nonetheless, Musk has defended the company's progress, writing: \"SpaceX is moving like lightning compared to the rest of the space industry. \"Moreover, Starship will end up doing the whole moon mission. Mark my words.\" In response, Mr Duffy said: \"Love the passion. The race to the Moon is ON. Great companies shouldn't be afraid of a challenge. When our innovators compete with each other, America wins!\" Mr Duffy is currently the acting administrator of NASA, but reports suggest that he wants to keep the role. Musk has previously thrown his support behind a billionaire called Jared Isaacman for the top job, who has previously flown on two private SpaceX missions into orbit."
    },
    {
        "title": "Manchester Pride put into voluntary liquidation and being assessed by regulator",
        "description": "Manchester Pride has been put into voluntary liquidation and is being assessed by the charities regulator, with the future of the event in doubt.",
        "url": "https://news.sky.com/story/manchester-pride-put-into-voluntary-liquidation-as-money-owed-to-artists-13455289",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-pride_7058586.jpg?20251022170057",
        "type": "Entertainment",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Miles Starforth, reporter",
        "Date Published": "2025-10-22 15:40:00",
        "Headline": "The organisers of the event celebrating the northern city's LGBTQ+ community cited rising costs, declining ticket sales and an unsuccessful bid to host Euro Pride as factors behind the decision.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Miles Starforth, reporter  Manchester Pride has been put into voluntary liquidation and is being assessed by the charities regulator, with the future of the event in doubt. Artists, suppliers and freelancers have been left unpaid, some of them owed thousands, the performers' and creatives' union Equity said. After nearly a week of speculation and a period of financial difficulty, Pride's organisers cited rising costs, declining ticket sales and an unsuccessful bid to host Euro Pride as factors behind the decision. The organisation is a charity and limited company that campaigns for LGBTQ+ equality and puts on the annual parade and live events. The company had been in financial difficulty, according to latest accounts, and gone through a series of directors in recent months. All three directors appointed in August resigned this month. An up-to-date picture of Manchester Pride's finances is not available, as the last update was submitted in September 2024 for the year up to December 2023, showing a consolidated deficit of nearly £500,000. At that point, the company said it could continue to exist, as a \"going concern\", as it said a review of the charity's strategy would take place, detailed budgets and cash forecasts had been prepared for 2024 and 2025, and it had been in surplus up to August 2024. \n                  Thousands defy ban to join Pride march in Budapest\n                 \n                  Tom Daley says 'it's scary how LGBT rights are being dangerously threatened'\n                 \n                  Glasgow Pride bans political parties from taking part amid Supreme Court row\n                 Manchester Pride said at the time it had a plan to diversify income streams and rebuild cash reserves. Accounts for 2024 are not due until 31 December this year. As a charity, Manchester Pride Limited is regulated by the Charity Regulator, which said it had opened a compliance case \"to assess concerns raised\" about the organisation. \"We are engaging with the trustees to help inform any next regulatory steps,\" a spokesperson said. It's understood that Manchester Pride submitted a serious incident report relating to its finances. What went wrong? Directly impacted by the liquidation is freelance event manager Abbie Ashall, who is owed £2,000 after her pay day was missed in September. Ms Ashall said she was not the worst hit; others are out of pocket even more, having hired and paid people for events they were contracted to put on, all with the expectation of being paid by Manchester Pride. She had been an employee of Manchester Pride from summer 2023 to January 2025, but left to go freelance when staff members left and were not being replaced, raising concerns about resources to deal with an increasing workload. It was at that point that she assumed things were not going well financially. Read more from Sky News:Royal Navy destroyer intercepts Russian warshipEurostar orders UK's first double-decker trains She continued to work for the organisation on a freelance basis, project managing the 2025 parade and now producing a musical, Spraywatch: A Beautiful Rescue. Manchester Pride's difficulties can, in part, be attributed to its model of getting people to pay for a wristband to access sites which are public spaces. \"I don't think that the business model worked at the end of the day,\" Ms Ashall said. \"And I think not enough people were buying tickets... we're seeing a massive trend in the events and festival industry that people just are not buying\". What next? Creatives waiting to be paid have been urged to contact the Equity union. \"We are collecting contractual information to pursue all options to recoup money owed, and we will begin these processes immediately,\" said Equity's North West official, Karen Lockney. \"We are also speaking with Manchester City Council and other stakeholders to ensure artists' voices are heard in discussions about the future of Pride in the city, ensuring that Manchester gets the Pride it deserves\". Details of those owed money have been passed to the liquidators, Manchester Pride's board of trustees said in a statement. What does this mean for Pride in Manchester? A Pride celebration will take place in August next year with council support, Manchester City Council said. \"There will undoubtedly be anxiety about what the future holds - but Pride is much more than the organisation that runs it. We want to support a new chapter for Manchester Pride weekend, which will take place next August. \"The council will play a full and active role in bringing together the LGBTQ community to help shape how the city moves forward to ensure a bright and thriving future for Manchester Pride.\""
    },
    {
        "title": "White House responds to report Trump is considering commuting Diddy's prison sentence",
        "description": "A White House official has said there is \"zero truth\" to a report that Donald Trump is considering commuting Sean \"Diddy\" Combs's prison sentence as early as this week.",
        "url": "https://news.sky.com/story/zero-truth-to-report-of-donald-trump-commuting-sean-diddy-combss-sentence-white-house-says-13454946",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-combs-donald-trump_7058106.jpg?20251022101905",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-22 07:46:00",
        "Headline": "Sean 'Diddy' Combs was sentenced to 50 months in prison and given a $500,000 fine at the beginning of October, after being found guilty of prostitution-related charges. His lawyers intend to appeal - but reports continue about a possible pardon or commutation of the sentence.",
        "Content": "A White House official has said there is \"zero truth\" to a report that Donald Trump is considering commuting Sean \"Diddy\" Combs's prison sentence as early as this week. On Monday, US entertainment site TMZ reported the US president was \"vacillating\" on whether or not to reduce the music mogul's sentence, citing a \"high-ranking White House official\". Combs was sentenced to 50 months in prison and given a $500,000 fine at a hearing on 3 October, after being found guilty of prostitution charges relating to his former girlfriends and male sex workers at the end of his high-profile trial in the summer. Earlier this week, the 55-year-old's legal team filed a legal document officially signalling their intention to appeal. Now, a White House official has pushed back on TMZ's report about a possible commutation. There is \"zero truth to the TMZ report, which we would've gladly explained had they reached out before running their fake news\", the official told NBC, Sky News' US partner. Mr Trump, \"not anonymous sources, is the final decider on pardons and commutations\", the official added. Casey Carver, a spokesperson for TMZ, said in a brief statement: \"We stand by our story.\" In an update to the story on the outlet's website, the news site said: \"The White House Communications Office is saying our story is not true. We stand by our story. Our story is accurate.\" Lawyers for Combs did not immediately return a request for comment about the disparity between the White House statement and TMZ's reporting. However, they previously told NBC News they had been pursuing a pardon. In the US federal system, commutation of sentence and pardons are different forms of executive clemency, \"which is a broad term that applies to the president's constitutional power to give leniency to persons who have committed federal crimes\", according to the justice department. Neither signifies innocence, but a pardon is an expression of a president's forgiveness and can be granted in recognition of acceptance of responsibility and good conduct, reinstating rights such as the right to vote. A commutation reduces a sentence either totally or partially but does not remove civil disabilities that apply as a result of criminal conviction. What has Donald Trump said? In August, before Combs's sentencing, Mr Trump said in an interview that he had been approached about a possible pardon but implied he would not be granting one. \"You know, I was very friendly with him. I got along with him great and he seemed like a nice guy. I didn't know him well,\" the president said. \"But when I ran for office, he was very hostile.\" When asked if he was suggesting he would not pardon Combs, he replied: \"I would say so.\" \"When you knew someone and you were fine, and then you run for office, and he made some terrible statements. So, I don't know, it's more difficult,\" Mr Trump said. \"Makes it more - I'm being honest, it makes it more difficult to do.\" The president has issued several pardons and commutations in his second term - including to around 1,500 criminal defendants in connection with the attack on the US Capitol in January 2021. Last week, he commuted the sentence of disgraced former Republican congressman George Santos. Read more:The rise and fall of DiddyDiddy sentencing: As it happened Combs was found guilty of two counts of transportation for prostitution in July, but was cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. Ahead of his sentencing, he told the court he admitted his past behaviour was \"disgusting, shameful and sick\", and apologised personally to Cassie Ventura and \"Jane\", another former girlfriend who testified anonymously during the trial. He told the court he got \"lost in my excess and lost in my ego\", but since his time in prison he has been \"humbled and broken to my core\", adding: \"I hate myself right now... I am truly sorry for it all.\" The rapper is serving his sentence at Brooklyn's Metropolitan Detention Center, where his team has said conditions are \"inhumane\". He has asked to be moved to a low-security federal prison in New Jersey, but the Bureau of Prisons has yet to approve the request."
    },
    {
        "title": "Louvre robbery: Paris museum reopens three days after crown jewels stolen in daring heist",
        "description": "The Louvre has reopened, three days after \"priceless\" pieces from the French crown jewels were stolen by thieves in an audacious daytime raid.",
        "url": "https://news.sky.com/story/louvre-robbery-paris-museum-reopens-three-days-after-crown-jewels-stolen-in-daring-heist-13454983",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-robbery-paris_7058171.jpg?20251022104239",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-22 09:05:00",
        "Headline": "Hundreds of visitors queued outside the world's most visted museum before Tuesday's reopening as around 100 investigators continue to search for the missing jewels and the gang behind the theft.",
        "Content": " The Louvre has reopened, three days after \"priceless\" pieces from the French crown jewels were stolen by thieves in an audacious daytime raid. Crowds - hundreds deep - waited outside the Paris museum's famous glass pyramid entrance and bunched at the barriers as they were being removed on Wednesday morning. The Apollo Room, the scene of Sunday's robbery, was still closed to visitors, with a folding screen closing off the doorway at the gallery's entrance. The Paris landmark, the world's most-visited museum, is normally closed on Tuesdays and has been shut since the heist for investigation.  No arrests have been announced, and the stolen jewels remain missing. Paris prosecutor Laure Beccuau said on Tuesday that the stolen items were worth an estimated €88m (£76 million), not including their historical value to France. But, reacting to the theft, interior minister Laurent Nunez said the jewels \"have genuine heritage value and are, in fact, priceless\". The French culture ministry said the items stolen were: • Tiara from the set of Queen Marie-Amelie and Queen Hortense • Necklace from the sapphire set of Queen Marie-Amelie and Queen Hortense • Earring, from the pair belonging to the sapphire set of Queen Marie-Amelie and Queen Hortense • Emerald necklace from the Empress Marie Louise set • Pair of emerald earrings from the Empress Marie Louise set • Brooch known as the \"reliquary brooch\" • Tiara of Empress Eugenie • Large corsage bow brooch of Empress Eugenie How did the heist unfold? The smash-and-grab that unfolded just 250m (270 yards) from the Mona Lisa has prompted a national reckoning, with some officials comparing the shock to the 2019 Notre-Dame Cathedral fire. Culture minister Rachida Dati insisted the museum's security systems worked, despite speculation to the contrary. Alarms were triggered when the thieves forced the gallery's window, Mr Nunez, said on Monday, and police were on the scene within two or three minutes after receiving a call from a witness. But by the time staff, alerted by the alarms, rushed to the room, the thieves had left. About 100 investigators are involved in searching for the stolen items and thieves, who used a basket lift mounted on a lorry, wheeled to the Seine-facing side of the building, to gain access. Ms Beccuau said four people have been identified as being at the scene of the heist. In a raid that authorities said lasted around four minutes, they forced a window open, smashed two display cases, before fleeing on motorbikes with a number of Napoleonic-era jewels. Read more on Sky News: What we know so far about the heistHow the investigation is goingWhat are the stolen jewels worth? Ms Dati said footage of the operation showed the thieves \"don't target people, they enter calmly in four minutes, smash display cases, take their loot, and leave\". \"No violence, very professional,\" she told TF1. The heist has sharpened scrutiny of the Louvre's surveillance and president-director, Laurence des Cars, appears before the culture committee of the French Senate on Wednesday."
    }
]