[
    {
        "title": "Child sexual abuse victims 'denied justice' after compensation scheme scrapped over cost",
        "description": "Sky News can reveal that the government has rowed back on a national compensation scheme for victims of child sexual abuse, despite it being promised under the previous Conservative administration.",
        "url": "https://news.sky.com/story/child-sexual-abuse-victims-denied-justice-after-compensation-scheme-scrapped-over-cost-13359851",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marie-sex-abuse-victim_6903594.jpg?20250502135554",
        "type": "Home",
        "Author": "Alice Porter",
        "Date Published": "2025-05-03 23:01:00",
        "Headline": "The governments in Scotland and Northern Ireland have set up compensation schemes and paid hundreds of millions of pounds to victims of child sexual abuse - but ministers admit that a similar programme for the rest of the UK has been shelved.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Sky News can reveal that the government has rowed back on a national compensation scheme for victims of child sexual abuse, despite it being promised under the previous Conservative administration. Warning - this story contains references to sexual and physical abuse A National Redress Scheme was one of 20 key recommendations made by the Independent Inquiry into Child Sexual Abuse (IICSA), but a Home Office report reveals the government has scrapped it because of the cost. Marie, who is 71, suffered alleged sexual, physical, and emotional abuse at Greenfield House Convent in St Helens, Merseyside, between 1959 and 1962, and is still fighting for compensation. As soon as she arrived as a six-year-old, Marie says her hair was cut off, her name changed, and she experienced regular beatings from the nuns and students. She claims a nun instigated the violence, including when Marie was held down so that her legs were \"spread-eagled\" as she was sexually abused with a coat hanger. Merseyside Police investigated claims of abuse at the convent, but in 2016, a suspect died before charges could be brought. \n                  Rise in school suspensions and exclusion\n                 \n                  'The system just doesn't work': More children than ever are not in school, report finds, with more than 11 million lost days \n                 \n                  Doctors demand smacking ban in England to end 'Victorian-era punishment' which harms children\n                 Marie has received an apology from the Catholic body that ran the home; she tried to sue them, but her claim was rejected because it was filed too long after the alleged abuse. In February, ministers said the law would change for victims of sexual abuse trying to sue institutions for damages, which was a recommendation from the IICSA. Previously, people had to make a civil claim before they were 21, unless the victim could prove a fair trial could proceed despite the time lapse. Campaigners argued for the time limit to be removed as, on average, victims wait 26 years to come forward. Changes to the 1980 Limitation Act could lead to more people making claims. Civil cases 'can take three to five years' But Peter Garsden, president of the Association of Child Abuse Lawyers, worries that when it comes to historical abuse where the defendant is dead, institutions will still argue that it is impossible to have a fair trial and will fight to have the case thrown out of court. Mr Garsden said it takes \"between three and five years\" for a civil case to get to trial. He warned that claimants \"can end up losing if you go through that process. Whereas the Redress Scheme would be quicker, much more straightforward, and much more likely to give justice to the victims\". Victim awarded £10 compensation Jimbo, who was a victim of abuse at St Aidan's children's home in Cheshire, took his case to the High Court twice and the Court of Appeal three times, but, after 13 years, all he ended up with was £10 for his bus fare to court. Despite the Lord Justice of Appeal saying he believed that the abuse had occurred, Jimbo lost his claim because of the time limit for child sexual abuse claims to be made. Read more from Sky News:Call for Labour minister to resign over grooming gang remarksPM says govt will fund further local grooming gangs inquiries if 'needed' Neither Marie nor Jimbo is likely to benefit from the removal of the time limit for personal injury claims, which is why Mr Garsden is calling on the government to implement a National Redress Scheme for victims of sexual abuse, as recommended by the IICSA. Hundreds of millions paid to victims The governments in Scotland and Northern Ireland have set up compensation schemes and paid hundreds of millions of pounds to victims. In 2023, the then Conservative government said a similar scheme would be organised for England and Wales. But the Home Office admitted in its Tackling Child Sexual Abuse: Progress Update that it \"is not currently taking forward any further steps on the IICSA proposal for a separate, national financial redress scheme for all survivors of child sexual abuse\". \"In the current fiscal environment, this recommendation is very difficult to take forward,\" it added. For victims, the scheme was the last chance of compensation for a lifetime blighted by abuse. \"The money is about justice and about all the other people who have had to suffer this abuse,\" Marie said."
    },
    {
        "title": "Fourteen children arrested on suspicion of manslaughter after industrial fire in Gateshead",
        "description": "Fourteen children aged between 11 and 14 years old have been arrested after a boy died in a fire at an industrial site.",
        "url": "https://news.sky.com/story/fourteen-children-arrested-on-suspicion-of-manslaughter-after-industrial-fire-in-gateshead-13361164",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gateshead-fire-fairfield_6905518.jpg?20250503213548",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-03 19:17:00",
        "Headline": "Northumbria Police said the group - 11 boys and three girls - were arrested on suspicion of manslaughter after 14-year-old Layton Carr was found dead inside a building near Fairfield industrial park.",
        "Content": "Fourteen children aged between 11 and 14 years old have been arrested after a boy died in a fire at an industrial site. Northumbria Police said the group - 11 boys and three girls - were arrested on suspicion of manslaughter after the incident in Gateshead on Friday. They remain in police custody. Officers were called to reports of a fire near Fairfield industrial park in the Bill Quay area shortly after 8pm. Emergency services attended, and the fire was extinguished a short time later. Police then issued an appeal for a missing boy, Layton Carr, who was believed to be in the area at the time of the fire. In a statement, the force said that \"sadly, following searches, a body believed to be that of 14-year-old Layton Carr was located deceased inside the building\". Layton's next of kin have been informed and are being supported by specialist officers, police added. \n                  'Sensitive military documents' found in Newcastle street\n                 \n                  Robert Scott Clive: Murder suspects bailed as police probe into man's disappearance more than 20 years ago continues\n                 \n                  Prolific shoplifter Tanya Liddle banned from stores across North East after getting 171 convictions\n                 Detective Chief Inspector Louise Jenkins, of Northumbria Police, also said: \"This is an extremely tragic incident where a boy has sadly lost his life.\" She added that the force's \"thoughts are with Layton's family as they begin to attempt to process the loss of their loved one\", and asked that their privacy be respected. A cordon remains in place at the site of the incident."
    },
    {
        "title": "Conservatives call for Labour's Lucy Powell to resign over grooming gang remarks",
        "description": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs.",
        "url": "https://news.sky.com/story/conservatives-call-for-labours-lucy-powell-to-resign-over-grooming-gang-remarks-13361129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lucy-powell-house-of-commons_6905593.jpg?20250503224316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-03 22:14:00",
        "Headline": "The leader of the House of Commons later said she was \"sorry\" if she was \"unclear\" in her response to the topic being raised during a debate.",
        "Content": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs. The comment was made by Ms Powell, the leader of the House of Commons, after Conservative political commentator Tim Montgomerie started to ask a question on BBC Radio 4's Any Questions. \"I don't know if you saw the documentary on Channel 4 about rape gangs,\" he started, in relation to the recent programme Groomed: A National Scandal, which centred around five girls who were sexually abused by rape gangs. Ms Powell, who is MP for Manchester Central, responded: \"Oh, we want to blow that little trumpet now, do we? Yeah, OK, let's get that dog whistle out.\" Sir Keir Starmer and the government have been under sustained pressure from political opponents over the handling of historical sex abuse cases in the UK. ConservativeHome founder Mr Montgomerie, who will be appearing on Sunday Morning With Trevor Phillips, continued: \"There is a real issue where… There were so many people in local government, in the authorities, who, for good reason, were worried about upsetting community tensions, that those girls went undefended.\" The conversation moved on, but politicians criticised Ms Powell's comment, with some calling for her to resign. \n                  Can Nigel Farage and Reform prove themselves?\n                 \n                  'Shy' Reform voters in Labour areas led to Farage's party winning by-election, Harriet Harman says\n                 \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 Shadow home secretary Chris Philp said in a statement: \"This shocking outburst from a Labour cabinet minister belittles the thousands of girls and women who were raped by grooming gangs over decades. \"We have consistently called for a national enquiry in parliament, which has been blocked by Labour ministers who don't seem to know or care about the disgusting crimes which have been perpetrated. \"Anyone who has seen the shocking Channel 4 documentary will know that it is clearer than ever that this is not a 'dog whistle'. \"To dismiss thousands of victims who were raped and the cover up that followed is sickening. She should resign.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Shadow justice secretary Robert Jenrick said: \"Labour's Lucy Powell thinks it's a 'dog whistle' to demand arrests and accountability for the rape gangs. What a disgusting betrayal of the victims. They are part of the cover-up.\" Ousted Reform MP Rupert Lowe, now an independent, shared a letter he wrote to Ms Powell demanding she apologise, calling her comments \"deeply, deeply offensive\". On X on Saturday night, Ms Powell said: \"In the heat of a discussion on AQ, I would like to clarify that I regard issues of child exploitation and grooming with the utmost seriousness. I'm sorry if this was unclear. \"I was challenging the political point scoring around it, not the issue itself. As a constituency MP I've dealt with horrendous cases. This Gvt is acting to get to the truth, and deliver justice.\" Read more:Grooming gangs scandal timelinePM says government will fund further local grooming gangs inquiries if 'needed' Sky News has contacted the office for the Leader of the House of Commons for comment. The long-running row over grooming cases has continued after Labour promised five local inquiries into grooming gangs in January. Tech billionaire Elon Musk had accused Sir Keir of being \"complicit\" in the failure of authorities to protect victims and prosecute abusers while the PM was director of public prosecutions from 2008-2013. The prime minister has repeatedly defended his record, saying it shows he tackled the issue head-on."
    },
    {
        "title": "Harry's intention may have been to extend the most public olive branch, but it could cause more hurt",
        "description": "It's five years since Harry and Meghan stepped away from what they saw as the constraints of royal life, and yet if you wanted to see the scale of the ongoing repercussions for the Royal Family, then Harry's interview was a sledgehammer of a reminder.",
        "url": "https://news.sky.com/story/harrys-intention-may-have-been-to-extend-the-most-public-olive-branch-but-it-could-cause-more-hurt-13361015",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-harry-royal-family_6905267.jpg?20250503182348",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-03 17:11:00",
        "Headline": "After losing his appeal over his security arrangements when in the UK, Prince Harry said The King 'won't speak to me'. No one could have expected a response this raw.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It's five years since Harry and Meghan stepped away from what they saw as the constraints of royal life, and yet if you wanted to see the scale of the ongoing repercussions for the Royal Family, then Harry's interview was a sledgehammer of a reminder. They may have left the day-to-day business of the firm, but they are still very much part of the family, albeit, as the duke has now confirmed, being kept at a considerable distance. Twenty-four hours after his interview, it still feels extraordinary that Prince Harry used his response to losing his appeal to give us the most personal insight we have had in months about where things are with his family. Losing his latest court battle was always going to hurt, but no one could have expected a response this raw. Of course, what he says about being estranged from his father gets the headlines. Sadly for Harry, it has completely overshadowed the other point he was hoping to land just as strongly: his grievance against the Home Office for, he says, unfairly taking away his police protection.  It's always been a problem for the Royal Family: As soon as they say something personal, that becomes the story. But now, outside of the fold, Harry does not appear to have anyone around him to ask: \"Is this really wise?\" His intention may have been to extend the most public olive branch of reconciliation, but you can't help but think it's probably just caused more hurt.  Finding out how it's really gone down in the palace is more difficult than ever. As Harry has opened up more, palace sources appear to want to share less; it was, after all, Harry who criticised those palace insiders and his own family for briefing against him. And yet, it is his words about his relatives that are spread all over the front pages on Saturday. In the past I've been told that there was increasingly a sense within the palace that talking to Harry was now seen as potentially taking a risk. Who knows where their words may appear or be quoted back? This interview has sadly proved those doubters right. There is also disquiet within the palace that they were given little warning of the interview and what had been said in it; \"It was hardly a proper request for a right of reply,\" is how it was described to me. The public reaction to the interview is again confirmation of how much Harry and Meghan's decision to leave and talk so openly continues to split opinion. For supporters of the Sussexes, his interview just confirms their view of an outdated and cruel institution that could not even protect one of their own. For those who back the King, the interview will feel like another particularly low blow, especially with his cancer diagnosis. Read more:Harry's security case - all you need to knowHarry's relationship with the Royals - how did we get here?Who would have expected Harry's interview to go this far? I'm told the Royal Family is wholly focused on VE Day events, and the preparations are well under way. On Monday, the rest of the family with again come together at Buckingham Palace to celebrate what they see as true service, duty and loyalty."
    },
    {
        "title": "What VE Day was really like - 80 years on",
        "description": "Ruth Bourne, 98, remembers the \"electric buzz\" among the crowds partying outside Buckingham Palace on VE Day.",
        "url": "https://news.sky.com/story/what-ve-day-was-really-like-80-years-on-13361272",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ve-day_6902578.jpg?20250501125949",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-05-03 23:01:00",
        "Headline": "As VE Day's 80th anniversary approaches, an eyewitness tells Sky News what the atmosphere was really like when World War Two was finally declared over in Europe.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  Ruth Bourne, 98, remembers the \"electric buzz\" among the crowds partying outside Buckingham Palace on VE Day. She was one of hundreds of thousands of people that swarmed into central London on 8 May 1945 to celebrate in the streets after such a long and gruelling war. \"There was the most amazing atmosphere,\" she tells Sky News as we take a black cab to the palace to retrace some of the route she took on foot 80 years ago. \"All of a sudden the future was here,\" she recalls with a beaming smile. \"Everyone was so happy! \"I was there with a million others, or so it felt. It was a wonderful experience. There was the most amazing atmosphere - it was like an electric buzz in the crowd. \"We all thought, well, the king is bound to be around, you know, we'll go and see if he's there.\" People began chanting \"We want the king\" outside the gates of the palace and then the royal family came out on to the balcony to celebrate with the crowds. \n                  VE Day 2025: A moment of joy captured 80 years ago\n                 \n                  Ukraine troops to join British forces for VE Day procession\n                 \n                  VE Day flypast route: When and where to watch\n                 \"It was like a great big family and you all surged forward together... it was the best place to be,\" Ruth says. Ruth was a teenager during World War Two and had served as a Turing Bombe operator - a machine invented by Alan Turing that helped speed up the process of codebreaking and intercepting secret Nazi messages. She remembers feeling exhilarated by the sense of relief and freedom on VE Day. \"We all went crazy cheering,\" she says. \"There wasn't an empty lamp post to be seen, they were all clambering up the lamp posts like swarming bees.\" She remembers meeting countless people that day, sharing stories and dancing with anyone. \"You went into the street and with complete strangers, you stood one behind the other and clasped each other around the waist and did the conga. You sang 'Aye aye conga!'\" She remembers ending the night in a park next to a fire somebody had lit, laughing and singing with groups of people who had become instant friends. After so many years of blackouts, the light of the fire was symbolic. Read more:Ukraine troops to join British forces for VE Day processionVE Day flypast route: When and where to watch \"The lights were up,\" Ruth remembers. \"The bonfires were lit in the open air…we were glad to see the back of the blackouts. \"People might not realise now what it was like, it was like lockdown almost. \"Everything was lit up, including a lot of the servicemen, I must say. They were very, very excited to be free of all this! \"Nobody wanted to go to bed, nobody wanted to let it go… we felt free on that day, we were just young and having a wonderful time.\""
    },
    {
        "title": "Five people survive 36 hours surrounded by alligators after plane crashes into swamp in Amazon",
        "description": "Five people survived 36 hours surrounded by alligators after their plane crashed into a swamp in the Amazon, the pilot has told local media.",
        "url": "https://news.sky.com/story/five-people-survive-36-hours-surrounded-by-alligators-after-plane-crashes-into-swamp-in-amazon-13360375",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bolivia-crash_6904378.png?20250503125246",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-05-03 09:59:00",
        "Headline": "The pilot said they were surrounded by \"huge alligators\" who came within three metres of the group. They also saw snakes in the water and had to contend with mosquitoes.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  Five people survived 36 hours surrounded by alligators after their plane crashed into a swamp in the Amazon, the pilot has told local media. A child, three women and the pilot of the light aircraft were rescued by a helicopter on Friday, Bolivian authorities said. The aircraft was flying from Baures to Trinidad over the Beni Department of northeastern Bolivia when the pilot was forced to make an emergency landing. He told local media it was a \"tough landing\" and the plane flipped over when it crashed into the swamp. Pablo Andres Velarde said they were left standing on top of the plane as it lay submerged in the water. He said they were surrounded by \"huge alligators\" which came within three metres of the group. \"They stayed three to four metres away from us, and stayed there all day and night but never got to us,\" he said. The pilot used the torch on his phone to keep watch of the reptiles and said he thought they were deterred by the smell of petrol leaking into the water from the plane. They also saw snakes in the water and had to contend with mosquitoes. The group \"couldn't drink anything,\" he added, and the only thing they had to eat was cassava flour they rescued from the plane. Read more:Trump posts AI image of himself as popeAustralian prime minister wins re-electionWoman dies after bomb explodes in her hands They eventually heard a fishing boat and the pilot signalled with his phone's flashlight and shouted for help. They were later airlifted to a hospital. \"We were happy because we could not survive another night,\" Mr Velarde said. \"We were very tired. We couldn't stand anymore, because we had to stand so we could keep an eye on the animals.\" Ruben Torres, director of the Beni region health department, said there had been \"a lot of speculation\" and \"many theories\" after the plane went missing. \"I am really happy because in the end all the institutions joined together to be able to find the missing people and save those lives that now receive the attention they need, being with their families is important,\" he said."
    },
    {
        "title": "McCanns remember missing Madeleine on anniversary of her disappearance",
        "description": "Kate and Gerry McCann, the parents of Madeleine McCann, who went missing while on holiday in Portugal in 2007, have posted a message to their daughter on the 18th anniversary of her disappearance.",
        "url": "https://news.sky.com/story/mccanns-remember-missing-madeleine-on-anniversary-of-her-disappearance-13360589",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-madeleine-mccann-missing_6466449.jpg?20240223130749",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-03 13:37:00",
        "Headline": "The girl, who was three when she went missing from a rented holiday apartment in 2007, turns 22 this month, and her parents say she continues to be \"right here with us, every day, but especially on her special day\".",
        "Content": "Kate and Gerry McCann, the parents of Madeleine McCann, who went missing while on holiday in Portugal in 2007, have posted a message to their daughter on the 18th anniversary of her disappearance. On the Official Find Madeleine Campaign page, the couple said that while they \"have no significant news to share, our determination to leave no stone unturned is unwavering\". The message, which thanked supporters and charities involved in searching for missing children, reflected that Madeleine's 22nd birthday is this month. They write: \"No matter how near or far she is, she continues to be right here with us, every day, but especially on her special day. We continue to 'celebrate' her as the very beautiful and unique person she is. We miss her.\" Madeleine's disappearance while on holiday with her family in Portugal's Algarve is one of the most high-profile cases of a missing person in British history. Read more:Woman claiming to be Madeleine pleads not guilty to stalkingKey witness to Madeleine investigation 'dying from cancer'Madeleine McCann suspect beat rape victim, court hears Gerry and Kate McCann had left her in bed with her twin siblings while they had dinner with friends at a nearby restaurant in Praia da Luz when the then three-year-old disappeared at around 10pm on 3 May. More than £13m has been spent by the Metropolitan Police investigating the case. In January, a German prosecutor told Sky News that Christian B, the German-born drifter who is the prime suspect in her disappearance, will not face any charges in the case for the foreseeable future. Christian B, who cannot be fully identified under his country's privacy law, was acquitted of unrelated rape and child sex assault charges last October."
    },
    {
        "title": "Child sexual abuse victims 'denied justice' after compensation scheme scrapped over cost",
        "description": "Sky News can reveal that the government has rowed back on a national compensation scheme for victims of child sexual abuse, despite it being promised under the previous Conservative administration.",
        "url": "https://news.sky.com/story/child-sexual-abuse-victims-denied-justice-after-compensation-scheme-scrapped-over-cost-13359851",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marie-sex-abuse-victim_6903594.jpg?20250502135554",
        "type": "UK",
        "Author": "Alice Porter",
        "Date Published": "2025-05-03 23:01:00",
        "Headline": "The governments in Scotland and Northern Ireland have set up compensation schemes and paid hundreds of millions of pounds to victims of child sexual abuse - but ministers admit that a similar programme for the rest of the UK has been shelved.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Sky News can reveal that the government has rowed back on a national compensation scheme for victims of child sexual abuse, despite it being promised under the previous Conservative administration. Warning - this story contains references to sexual and physical abuse A National Redress Scheme was one of 20 key recommendations made by the Independent Inquiry into Child Sexual Abuse (IICSA), but a Home Office report reveals the government has scrapped it because of the cost. Marie, who is 71, suffered alleged sexual, physical, and emotional abuse at Greenfield House Convent in St Helens, Merseyside, between 1959 and 1962, and is still fighting for compensation. As soon as she arrived as a six-year-old, Marie says her hair was cut off, her name changed, and she experienced regular beatings from the nuns and students. She claims a nun instigated the violence, including when Marie was held down so that her legs were \"spread-eagled\" as she was sexually abused with a coat hanger. Merseyside Police investigated claims of abuse at the convent, but in 2016, a suspect died before charges could be brought. \n                  Rise in school suspensions and exclusion\n                 \n                  'The system just doesn't work': More children than ever are not in school, report finds, with more than 11 million lost days \n                 \n                  Doctors demand smacking ban in England to end 'Victorian-era punishment' which harms children\n                 Marie has received an apology from the Catholic body that ran the home; she tried to sue them, but her claim was rejected because it was filed too long after the alleged abuse. In February, ministers said the law would change for victims of sexual abuse trying to sue institutions for damages, which was a recommendation from the IICSA. Previously, people had to make a civil claim before they were 21, unless the victim could prove a fair trial could proceed despite the time lapse. Campaigners argued for the time limit to be removed as, on average, victims wait 26 years to come forward. Changes to the 1980 Limitation Act could lead to more people making claims. Civil cases 'can take three to five years' But Peter Garsden, president of the Association of Child Abuse Lawyers, worries that when it comes to historical abuse where the defendant is dead, institutions will still argue that it is impossible to have a fair trial and will fight to have the case thrown out of court. Mr Garsden said it takes \"between three and five years\" for a civil case to get to trial. He warned that claimants \"can end up losing if you go through that process. Whereas the Redress Scheme would be quicker, much more straightforward, and much more likely to give justice to the victims\". Victim awarded £10 compensation Jimbo, who was a victim of abuse at St Aidan's children's home in Cheshire, took his case to the High Court twice and the Court of Appeal three times, but, after 13 years, all he ended up with was £10 for his bus fare to court. Despite the Lord Justice of Appeal saying he believed that the abuse had occurred, Jimbo lost his claim because of the time limit for child sexual abuse claims to be made. Read more from Sky News:Call for Labour minister to resign over grooming gang remarksPM says govt will fund further local grooming gangs inquiries if 'needed' Neither Marie nor Jimbo is likely to benefit from the removal of the time limit for personal injury claims, which is why Mr Garsden is calling on the government to implement a National Redress Scheme for victims of sexual abuse, as recommended by the IICSA. Hundreds of millions paid to victims The governments in Scotland and Northern Ireland have set up compensation schemes and paid hundreds of millions of pounds to victims. In 2023, the then Conservative government said a similar scheme would be organised for England and Wales. But the Home Office admitted in its Tackling Child Sexual Abuse: Progress Update that it \"is not currently taking forward any further steps on the IICSA proposal for a separate, national financial redress scheme for all survivors of child sexual abuse\". \"In the current fiscal environment, this recommendation is very difficult to take forward,\" it added. For victims, the scheme was the last chance of compensation for a lifetime blighted by abuse. \"The money is about justice and about all the other people who have had to suffer this abuse,\" Marie said."
    },
    {
        "title": "Fourteen children arrested on suspicion of manslaughter after industrial fire in Gateshead",
        "description": "Fourteen children aged between 11 and 14 years old have been arrested after a boy died in a fire at an industrial site.",
        "url": "https://news.sky.com/story/fourteen-children-arrested-on-suspicion-of-manslaughter-after-industrial-fire-in-gateshead-13361164",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gateshead-fire-fairfield_6905518.jpg?20250503213548",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-03 19:17:00",
        "Headline": "Northumbria Police said the group - 11 boys and three girls - were arrested on suspicion of manslaughter after 14-year-old Layton Carr was found dead inside a building near Fairfield industrial park.",
        "Content": "Fourteen children aged between 11 and 14 years old have been arrested after a boy died in a fire at an industrial site. Northumbria Police said the group - 11 boys and three girls - were arrested on suspicion of manslaughter after the incident in Gateshead on Friday. They remain in police custody. Officers were called to reports of a fire near Fairfield industrial park in the Bill Quay area shortly after 8pm. Emergency services attended, and the fire was extinguished a short time later. Police then issued an appeal for a missing boy, Layton Carr, who was believed to be in the area at the time of the fire. In a statement, the force said that \"sadly, following searches, a body believed to be that of 14-year-old Layton Carr was located deceased inside the building\". Layton's next of kin have been informed and are being supported by specialist officers, police added. \n                  'Sensitive military documents' found in Newcastle street\n                 \n                  Robert Scott Clive: Murder suspects bailed as police probe into man's disappearance more than 20 years ago continues\n                 \n                  Prolific shoplifter Tanya Liddle banned from stores across North East after getting 171 convictions\n                 Detective Chief Inspector Louise Jenkins, of Northumbria Police, also said: \"This is an extremely tragic incident where a boy has sadly lost his life.\" She added that the force's \"thoughts are with Layton's family as they begin to attempt to process the loss of their loved one\", and asked that their privacy be respected. A cordon remains in place at the site of the incident."
    },
    {
        "title": "Conservatives call for Labour's Lucy Powell to resign over grooming gang remarks",
        "description": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs.",
        "url": "https://news.sky.com/story/conservatives-call-for-labours-lucy-powell-to-resign-over-grooming-gang-remarks-13361129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lucy-powell-house-of-commons_6905593.jpg?20250503224316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-03 22:14:00",
        "Headline": "The leader of the House of Commons later said she was \"sorry\" if she was \"unclear\" in her response to the topic being raised during a debate.",
        "Content": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs. The comment was made by Ms Powell, the leader of the House of Commons, after Conservative political commentator Tim Montgomerie started to ask a question on BBC Radio 4's Any Questions. \"I don't know if you saw the documentary on Channel 4 about rape gangs,\" he started, in relation to the recent programme Groomed: A National Scandal, which centred around five girls who were sexually abused by rape gangs. Ms Powell, who is MP for Manchester Central, responded: \"Oh, we want to blow that little trumpet now, do we? Yeah, OK, let's get that dog whistle out.\" Sir Keir Starmer and the government have been under sustained pressure from political opponents over the handling of historical sex abuse cases in the UK. ConservativeHome founder Mr Montgomerie, who will be appearing on Sunday Morning With Trevor Phillips, continued: \"There is a real issue where… There were so many people in local government, in the authorities, who, for good reason, were worried about upsetting community tensions, that those girls went undefended.\" The conversation moved on, but politicians criticised Ms Powell's comment, with some calling for her to resign. \n                  Can Nigel Farage and Reform prove themselves?\n                 \n                  'Shy' Reform voters in Labour areas led to Farage's party winning by-election, Harriet Harman says\n                 \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 Shadow home secretary Chris Philp said in a statement: \"This shocking outburst from a Labour cabinet minister belittles the thousands of girls and women who were raped by grooming gangs over decades. \"We have consistently called for a national enquiry in parliament, which has been blocked by Labour ministers who don't seem to know or care about the disgusting crimes which have been perpetrated. \"Anyone who has seen the shocking Channel 4 documentary will know that it is clearer than ever that this is not a 'dog whistle'. \"To dismiss thousands of victims who were raped and the cover up that followed is sickening. She should resign.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Shadow justice secretary Robert Jenrick said: \"Labour's Lucy Powell thinks it's a 'dog whistle' to demand arrests and accountability for the rape gangs. What a disgusting betrayal of the victims. They are part of the cover-up.\" Ousted Reform MP Rupert Lowe, now an independent, shared a letter he wrote to Ms Powell demanding she apologise, calling her comments \"deeply, deeply offensive\". On X on Saturday night, Ms Powell said: \"In the heat of a discussion on AQ, I would like to clarify that I regard issues of child exploitation and grooming with the utmost seriousness. I'm sorry if this was unclear. \"I was challenging the political point scoring around it, not the issue itself. As a constituency MP I've dealt with horrendous cases. This Gvt is acting to get to the truth, and deliver justice.\" Read more:Grooming gangs scandal timelinePM says government will fund further local grooming gangs inquiries if 'needed' Sky News has contacted the office for the Leader of the House of Commons for comment. The long-running row over grooming cases has continued after Labour promised five local inquiries into grooming gangs in January. Tech billionaire Elon Musk had accused Sir Keir of being \"complicit\" in the failure of authorities to protect victims and prosecute abusers while the PM was director of public prosecutions from 2008-2013. The prime minister has repeatedly defended his record, saying it shows he tackled the issue head-on."
    },
    {
        "title": "What VE Day was really like - 80 years on",
        "description": "Ruth Bourne, 98, remembers the \"electric buzz\" among the crowds partying outside Buckingham Palace on VE Day.",
        "url": "https://news.sky.com/story/what-ve-day-was-really-like-80-years-on-13361272",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ve-day_6902578.jpg?20250501125949",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-05-03 23:01:00",
        "Headline": "As VE Day's 80th anniversary approaches, an eyewitness tells Sky News what the atmosphere was really like when World War Two was finally declared over in Europe.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  Ruth Bourne, 98, remembers the \"electric buzz\" among the crowds partying outside Buckingham Palace on VE Day. She was one of hundreds of thousands of people that swarmed into central London on 8 May 1945 to celebrate in the streets after such a long and gruelling war. \"There was the most amazing atmosphere,\" she tells Sky News as we take a black cab to the palace to retrace some of the route she took on foot 80 years ago. \"All of a sudden the future was here,\" she recalls with a beaming smile. \"Everyone was so happy! \"I was there with a million others, or so it felt. It was a wonderful experience. There was the most amazing atmosphere - it was like an electric buzz in the crowd. \"We all thought, well, the king is bound to be around, you know, we'll go and see if he's there.\" People began chanting \"We want the king\" outside the gates of the palace and then the royal family came out on to the balcony to celebrate with the crowds. \n                  VE Day 2025: A moment of joy captured 80 years ago\n                 \n                  Ukraine troops to join British forces for VE Day procession\n                 \n                  VE Day flypast route: When and where to watch\n                 \"It was like a great big family and you all surged forward together... it was the best place to be,\" Ruth says. Ruth was a teenager during World War Two and had served as a Turing Bombe operator - a machine invented by Alan Turing that helped speed up the process of codebreaking and intercepting secret Nazi messages. She remembers feeling exhilarated by the sense of relief and freedom on VE Day. \"We all went crazy cheering,\" she says. \"There wasn't an empty lamp post to be seen, they were all clambering up the lamp posts like swarming bees.\" She remembers meeting countless people that day, sharing stories and dancing with anyone. \"You went into the street and with complete strangers, you stood one behind the other and clasped each other around the waist and did the conga. You sang 'Aye aye conga!'\" She remembers ending the night in a park next to a fire somebody had lit, laughing and singing with groups of people who had become instant friends. After so many years of blackouts, the light of the fire was symbolic. Read more:Ukraine troops to join British forces for VE Day processionVE Day flypast route: When and where to watch \"The lights were up,\" Ruth remembers. \"The bonfires were lit in the open air…we were glad to see the back of the blackouts. \"People might not realise now what it was like, it was like lockdown almost. \"Everything was lit up, including a lot of the servicemen, I must say. They were very, very excited to be free of all this! \"Nobody wanted to go to bed, nobody wanted to let it go… we felt free on that day, we were just young and having a wonderful time.\""
    },
    {
        "title": "Harry's intention may have been to extend the most public olive branch, but it could cause more hurt",
        "description": "It's five years since Harry and Meghan stepped away from what they saw as the constraints of royal life, and yet if you wanted to see the scale of the ongoing repercussions for the Royal Family, then Harry's interview was a sledgehammer of a reminder.",
        "url": "https://news.sky.com/story/harrys-intention-may-have-been-to-extend-the-most-public-olive-branch-but-it-could-cause-more-hurt-13361015",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-harry-royal-family_6905267.jpg?20250503182348",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-03 17:11:00",
        "Headline": "After losing his appeal over his security arrangements when in the UK, Prince Harry said The King 'won't speak to me'. No one could have expected a response this raw.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It's five years since Harry and Meghan stepped away from what they saw as the constraints of royal life, and yet if you wanted to see the scale of the ongoing repercussions for the Royal Family, then Harry's interview was a sledgehammer of a reminder. They may have left the day-to-day business of the firm, but they are still very much part of the family, albeit, as the duke has now confirmed, being kept at a considerable distance. Twenty-four hours after his interview, it still feels extraordinary that Prince Harry used his response to losing his appeal to give us the most personal insight we have had in months about where things are with his family. Losing his latest court battle was always going to hurt, but no one could have expected a response this raw. Of course, what he says about being estranged from his father gets the headlines. Sadly for Harry, it has completely overshadowed the other point he was hoping to land just as strongly: his grievance against the Home Office for, he says, unfairly taking away his police protection.  It's always been a problem for the Royal Family: As soon as they say something personal, that becomes the story. But now, outside of the fold, Harry does not appear to have anyone around him to ask: \"Is this really wise?\" His intention may have been to extend the most public olive branch of reconciliation, but you can't help but think it's probably just caused more hurt.  Finding out how it's really gone down in the palace is more difficult than ever. As Harry has opened up more, palace sources appear to want to share less; it was, after all, Harry who criticised those palace insiders and his own family for briefing against him. And yet, it is his words about his relatives that are spread all over the front pages on Saturday. In the past I've been told that there was increasingly a sense within the palace that talking to Harry was now seen as potentially taking a risk. Who knows where their words may appear or be quoted back? This interview has sadly proved those doubters right. There is also disquiet within the palace that they were given little warning of the interview and what had been said in it; \"It was hardly a proper request for a right of reply,\" is how it was described to me. The public reaction to the interview is again confirmation of how much Harry and Meghan's decision to leave and talk so openly continues to split opinion. For supporters of the Sussexes, his interview just confirms their view of an outdated and cruel institution that could not even protect one of their own. For those who back the King, the interview will feel like another particularly low blow, especially with his cancer diagnosis. Read more:Harry's security case - all you need to knowHarry's relationship with the Royals - how did we get here?Who would have expected Harry's interview to go this far? I'm told the Royal Family is wholly focused on VE Day events, and the preparations are well under way. On Monday, the rest of the family with again come together at Buckingham Palace to celebrate what they see as true service, duty and loyalty."
    },
    {
        "title": "Lorraine Kelly says she will undergo surgery to remove ovaries",
        "description": "Lorraine Kelly has revealed she is undergoing surgery to remove her ovaries and fallopian tubes.",
        "url": "https://news.sky.com/story/lorraine-kelly-says-she-will-undergo-surgery-to-remove-ovaries-13360610",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lorraine-kelly-lorraine_6904640.jpg?20250503150559",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-03 15:00:00",
        "Headline": "The 65-year-old TV presenter posted a video of her in a hospital bed on Instagram, and said \"I've not been feeling all that well for a little while\".",
        "Content": "Lorraine Kelly has revealed she is undergoing surgery to remove her ovaries and fallopian tubes. The 65-year-old TV presenter posted a video of her in a hospital bed on Instagram, and said \"I've not been feeling all that well for a little while\". Kelly added she \"had a little scan and I have to have my ovaries and my tubes taken out\" with keyhole surgery. She said that the procedure is \"purely preventative,\" and that \"I'm going to be totally fine, see you soon\". According to the NHS, keyhole surgery - also called laparoscopic surgery - is carried out using several small incisions. The procedure can take between one and two hours, and doctors recommend staying off work for two to four weeks after the surgery. In the caption, the ITV presenter wrote she felt \"very lucky to be treated so well\" and thanked gynaecologist Dr Ahmed Raafat and hospital staff. \n                  Lorraine Kelly warns it has become 'almost impossible' for working-class youngsters to make it into TV like she did\n                 \n                  Anne Hathaway reveals miscarriage while in play in which she had to 'give birth every night'\n                 Good Morning Britain presenter Susanna Reid said she was \"sending you all the love in the world\", while TV presenter Julia Bradbury added: \"Wishing you a speedy recovery Lorraine, and good luck with the post op rehab.\" Read more from Sky News:Trump posts AI image of himself as pope'I'm a brain surgeon - here's what we earn'Woman dies after bomb explodes in her hands Kelly has been in television since 1984, starting her career on TV-am as an on-screen reporter covering Scottish news. In 1990, she began her presenting career on Good Morning Britain, before hosting her own show, Lorraine, from 2010."
    },
    {
        "title": "Prince Harry says loss of security protection makes it 'impossible' to bring Meghan and children to UK",
        "description": "Prince Harry has said losing a legal challenge over his security in the UK means it is now \"impossible\" for him to bring Meghan and their children back to the UK safely.",
        "url": "https://news.sky.com/story/prince-harry-says-loss-of-security-protection-makes-it-impossible-to-bring-meghan-and-children-to-uk-13360358",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-prince-harry-meghan-markle_5642860.png?20220115230109",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-03 08:21:00",
        "Headline": "Prince Harry says he does not think he will ever be able to bring his wife and their children, Archie and Lilibet, back to Britain and claims his father, the King, could resolve the issue.",
        "Content": " Prince Harry has said losing a legal challenge over his security in the UK means it is now \"impossible\" for him to bring Meghan and their children back to the UK safely. Harry said he did not think he would ever be able to bring his wife and their children, Archie and Lilibet, back to Britain and claimed his father, the King, could resolve the issue. In an interview with BBC News the Duke of Sussex said because of the security decision he cannot \"see a world in which I would be bringing my wife and children back to the UK at this point\". \"I can only come to the UK safely if I am invited, and there is a lot of control and ability in my father's hands,\" he said. \"Ultimately, this whole thing could be resolved through him, not by intervening, but by stepping aside and allowing the experts to do what is necessary.\" He added: \"That said, this all was initiated under a previous government. There is now a new government. I have had it described to me, once people knew about the facts, that this is a good old-fashioned establishment stitch-up, and that is what it feels like.\" The prince lost a Court of Appeal challenge against the Home Office over his security arrangements on Friday. It followed a decision of the Executive Committee for the Protection of Royalty and Public Figures (Ravec) to downgrade his high-level police protection after he and Meghan stepped down from full-time royal duties to move to the US in 2020. Since then the duke has argued his private protection team in the US no longer has access to the UK intelligence information needed to keep his wife and children safe. During the interview, the prince also said he wants \"reconciliation\" with the Royal Family but claimed the King \"won't speak to me\". \"I would love reconciliation with my family, there's no point in continuing to fight anymore,\" he said. \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\" Read more:What Harry's words mean for the royalsWhy prince lost appeal over security  Harry warned the Royal Family's power over security means it \"can be used to control\" family members. He said: \"I think what really worries me more than anything else about today's decision, depending on what happens next, it sets a new precedent that security can be used to control members of the family, and effectively, what it does is imprison other members of the family from being able to choose a different life.\" 👉 Listen to Sky News Daily on your podcast app 👈 He added: \"If, for me, security is conditional on having an official role, one that both myself and my wife wish to carry on, but then was rejected, not by Ravec, was rejected by the Royal Household, and the result to that is you lose your security - that basically says you can't live outside of their control if you want to be safe.\""
    },
    {
        "title": "Woman dies in Greece after bomb explodes in her hands",
        "description": "A woman has died in Greece after a bomb she was carrying exploded in her hands, police have said.",
        "url": "https://news.sky.com/story/woman-dies-in-greece-after-bomb-explodes-in-her-hands-13357949",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-greece-bomb-blast_6904264.jpg?20250503083638",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-03 05:00:00",
        "Headline": "The 38-year-old was carrying the device to place it outside a nearby bank, police say.",
        "Content": "A woman has died in Greece after a bomb she was carrying exploded in her hands, police have said. The 38-year-old was carrying the device to place it outside a nearby bank at around 5am on Saturday in the northern Greek city of Thessaloniki. Several storefronts and vehicles were damaged by the explosion, police said. \"It appears that she was carrying an explosive device and planned to plant it a bank's ATM,\" a senior police official told Reuters news agency. Something went wrong and it exploded in her hands, the official added. The woman was known to authorities after taking part in several robberies, according to police. They are investigating her possible ties to extreme left-wing groups. \n                  Drone attacks are intensifying in Sudan - hitting schools and camps housing the displaced\n                 \n                  Recording reveals details about IDF arrest of Gaza paramedic after aid attack\n                 \n                  Ukraine war latest: Russia calls for 'definitive' response to ceasefire offer - as Zelenskyy says he had 'best' conversation with Trump\n                 This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Trump posts AI image of himself as pope on Truth Social",
        "description": "Donald Trump has posted an AI-generated image of himself dressed in papal regalia on his Truth Social platform - just 11 days after the death of Pope Francis.",
        "url": "https://news.sky.com/story/trump-posts-ai-image-of-himself-as-pope-on-truth-social-13360403",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-truth-social_6904326.jpg?20250503131502",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-03 10:46:00",
        "Headline": "The picture was published without comment or explanation on the US president's personal account - and then on the White House X and Instagram accounts.",
        "Content": "Donald Trump has posted an AI-generated image of himself dressed in papal regalia on his Truth Social platform - just 11 days after the death of Pope Francis. Uploaded onto his account early on Saturday morning, it shows the US president with a large gold cross on a chain around his neck. From there, it was published, without comment or explanation, on the White House X and Instagram accounts and, though it drew fierce criticism, it was liked more than 100,000 times. It comes just a few days after the world leader joked that he'd like to be the pontiff. Last week, he was asked by reporters on the White House lawn who he would like to succeed Francis and he replied: \"I'd like to be Pope. That would be my number one choice.\" He went on to say that he did not have a preference, but there was a cardinal in New York who was \"very good\".  Mr Trump was quickly accused of mocking Pope Francis's death, but, by noon, UK time, the post had been liked more than 58,000 times on Instagram. User comments, however, were mostly negative, with one saying that the image \"isn't funny. It's not satire. And it's not harmless\". Another simply called it \"disgusting\", while other reactions included \"disturbing\", \"disrespectful\" and \"offensive\". On X, where the picture was liked more than 78,000 times, a user commented that Mr Trump was \"making a mockery of the pious\", while another judged it \"not a wise decision\". The conclave to select a new pontiff will begin on 7 May after the death of Francis, the leader of the Roman Catholic Church. The Argentinian, who became pope in 2013, died on Easter Monday at the age of 88 due to a stroke and heart failure. Last weekend, the president was criticised for wearing a non-traditional blue suit for Francis's Vatican funeral and chewing gum during the ceremony. However, his meeting in St Peter's Basilica with Ukrainian President Volodymyr Zelenskyy before the outdoor mass got under way was dubbed \"Pope Francis's miracle\" by members of the clergy.  Read more:Trump birthday parade plannedWho could be the next pope? Mr Trump's own religious views have long been a matter of speculation. He was raised as a Presbyterian and publicly identified with it for most of his adult life, before, in October 2020, he renounced it and said he now considered himself a non-denominational Christian. Many have questioned the depth of his faith, but that hasn't stopped him appealing to conservative Christians and the Christian right, particularly evangelicals, some of whom have helped him get elected twice. Earlier this year, Mr Trump shared a bizarre AI-generated video on his Truth Social platform showcasing what appeared to be a vision of Gaza under his proposed plan.  The footage showed the area transformed into a Middle Eastern paradise with exotic beaches, Dubai-style skyscrapers, luxury yachts and people partying - and featured Israeli Prime Minister Benjamin Netanyahu and Elon Musk."
    },
    {
        "title": "Five people survive 36 hours surrounded by alligators after plane crashes into swamp in Amazon",
        "description": "Five people survived 36 hours surrounded by alligators after their plane crashed into a swamp in the Amazon, the pilot has told local media.",
        "url": "https://news.sky.com/story/five-people-survive-36-hours-surrounded-by-alligators-after-plane-crashes-into-swamp-in-amazon-13360375",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bolivia-crash_6904378.png?20250503125246",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-05-03 09:59:00",
        "Headline": "The pilot said they were surrounded by \"huge alligators\" who came within three metres of the group. They also saw snakes in the water and had to contend with mosquitoes.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  Five people survived 36 hours surrounded by alligators after their plane crashed into a swamp in the Amazon, the pilot has told local media. A child, three women and the pilot of the light aircraft were rescued by a helicopter on Friday, Bolivian authorities said. The aircraft was flying from Baures to Trinidad over the Beni Department of northeastern Bolivia when the pilot was forced to make an emergency landing. He told local media it was a \"tough landing\" and the plane flipped over when it crashed into the swamp. Pablo Andres Velarde said they were left standing on top of the plane as it lay submerged in the water. He said they were surrounded by \"huge alligators\" which came within three metres of the group. \"They stayed three to four metres away from us, and stayed there all day and night but never got to us,\" he said. The pilot used the torch on his phone to keep watch of the reptiles and said he thought they were deterred by the smell of petrol leaking into the water from the plane. They also saw snakes in the water and had to contend with mosquitoes. The group \"couldn't drink anything,\" he added, and the only thing they had to eat was cassava flour they rescued from the plane. Read more:Trump posts AI image of himself as popeAustralian prime minister wins re-electionWoman dies after bomb explodes in her hands They eventually heard a fishing boat and the pilot signalled with his phone's flashlight and shouted for help. They were later airlifted to a hospital. \"We were happy because we could not survive another night,\" Mr Velarde said. \"We were very tired. We couldn't stand anymore, because we had to stand so we could keep an eye on the animals.\" Ruben Torres, director of the Beni region health department, said there had been \"a lot of speculation\" and \"many theories\" after the plane went missing. \"I am really happy because in the end all the institutions joined together to be able to find the missing people and save those lives that now receive the attention they need, being with their families is important,\" he said."
    },
    {
        "title": "McCanns remember missing Madeleine on anniversary of her disappearance",
        "description": "Kate and Gerry McCann, the parents of Madeleine McCann, who went missing while on holiday in Portugal in 2007, have posted a message to their daughter on the 18th anniversary of her disappearance.",
        "url": "https://news.sky.com/story/mccanns-remember-missing-madeleine-on-anniversary-of-her-disappearance-13360589",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-madeleine-mccann-missing_6466449.jpg?20240223130749",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-03 13:37:00",
        "Headline": "The girl, who was three when she went missing from a rented holiday apartment in 2007, turns 22 this month, and her parents say she continues to be \"right here with us, every day, but especially on her special day\".",
        "Content": "Kate and Gerry McCann, the parents of Madeleine McCann, who went missing while on holiday in Portugal in 2007, have posted a message to their daughter on the 18th anniversary of her disappearance. On the Official Find Madeleine Campaign page, the couple said that while they \"have no significant news to share, our determination to leave no stone unturned is unwavering\". The message, which thanked supporters and charities involved in searching for missing children, reflected that Madeleine's 22nd birthday is this month. They write: \"No matter how near or far she is, she continues to be right here with us, every day, but especially on her special day. We continue to 'celebrate' her as the very beautiful and unique person she is. We miss her.\" Madeleine's disappearance while on holiday with her family in Portugal's Algarve is one of the most high-profile cases of a missing person in British history. Read more:Woman claiming to be Madeleine pleads not guilty to stalkingKey witness to Madeleine investigation 'dying from cancer'Madeleine McCann suspect beat rape victim, court hears Gerry and Kate McCann had left her in bed with her twin siblings while they had dinner with friends at a nearby restaurant in Praia da Luz when the then three-year-old disappeared at around 10pm on 3 May. More than £13m has been spent by the Metropolitan Police investigating the case. In January, a German prosecutor told Sky News that Christian B, the German-born drifter who is the prime suspect in her disappearance, will not face any charges in the case for the foreseeable future. Christian B, who cannot be fully identified under his country's privacy law, was acquitted of unrelated rape and child sex assault charges last October."
    },
    {
        "title": "Stove to burn conclave ballots for new pope installed in Sistine Chapel",
        "description": "The stove where ballots to elect the new pope will be burned during the upcoming conclave has been installed in the Sistine Chapel.",
        "url": "https://news.sky.com/story/stove-to-burn-conclave-ballots-for-new-pope-installed-in-sistine-chapel-13360706",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vatican-conclave-pope_6904763.jpg?20250503154802",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-03 14:34:00",
        "Headline": "People all around the world will be watching the chimney to see if black or white smoke is emitted, indicating whether a new pope has been chosen or not.",
        "Content": " The stove where ballots to elect the new pope will be burned during the upcoming conclave has been installed in the Sistine Chapel. The Vatican's fire brigade was seen on the roof of the Sistine Chapel on Friday installing the chimney that will become the focus for millions around the world waiting to see who will become the next head of the Catholic Church after Pope Francis died on 21 April, aged 88. A video released by the Holy See on Saturday showed the practical preparations for the conclave, including installing the stove and a false floor in the chapel to make it even. A total of 133 cardinals will gather to form a conclave to elect the next pope, beginning on 7 May. Black smoke, from the burning of ballots and potassium perchlorate anthracene - a component of coal tar - and sulphur, will be emitted from the chimney if at least 89 cardinals fail to agree on the next pope when they vote in each round. White smoke - produced by the ballots mixed with potassium chlorate, lactose and chloroform resin - will eventually appear when two-thirds (89) of the 133 cardinals have decided on who will lead the Church. Despite Donald Trump posting an AI-generated image of himself dressed in papal regalia on Saturday, he will not be in the running. \n                  Trump posts AI image of himself as pope on Truth Social\n                 \n                  How does the Sistine Chapel prepare for conclave?\n                 \n                  When does conclave start and how does it work?\n                 The footage also showed workers lining up wooden tables where the cardinals will sit to cast their votes on Wednesday. A ramp has been installed leading to the main seating area for those using a wheelchair. To prevent the secret deliberations from being bugged, there will be a technology blackout to ensure the cardinals have no contact with the outside world. Read more:How does the Sistine Chapel prepare for conclave?When does conclave start and how does it work? Silvio Screpanti, the engineer overseeing the preparations, said workers are deactivating all electronic sensors installed in the Sistine Chapel in recent years to help protect its frescoes. Over the next few days, all the windows of the Apostolic Palace facing the Sistine Chapel will be blacked out. Mr Screpanti said 80 seals will be put up on the eve of the vote around the perimeter of the space where the cardinals will live to keep outsiders away. The day the conclave begins, there will be a morning mass in St Peter's Basilica celebrated by the dean of the College of Cardinals, Cardinal Giovanni Battista Re. After that, the cardinal electors will be cut off from the rest of the world.  On Wednesday afternoon, they will process into the Sistine Chapel, hear a meditation and take their oaths before casting their first ballots. If no candidate reaches the necessary two-thirds majority in the first ballot, the cardinals will go to their Vatican residences for the night and return to the chapel on Thursday morning to conduct two votes, then two in the afternoon until a winner is declared. When Pope Francis was elected, the white smoke came out of the chimney on the fifth ballot on 13 March 2013."
    },
    {
        "title": "Australian PM Anthony Albanese wins re-election",
        "description": "Australian Prime Minister Anthony Albanese's centre-left Labor Party has won the federal election.",
        "url": "https://news.sky.com/story/australian-pm-anthony-albanese-wins-re-election-13360390",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-australia-anthony-albanese_6904425.jpg?20250503132242",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-03 10:15:00",
        "Headline": "He becomes the first Australian prime minister to win a second consecutive three-year term in 21 years after voters rejected the conservative Liberal Party.",
        "Content": " Australian Prime Minister Anthony Albanese's centre-left Labor Party has won the federal election. Opposition leader Peter Dutton, head of the conservative Liberal Party, conceded defeat after early counting on Saturday night showed his party would lose, and called Mr Albanese to congratulate him on the win. Mr Dutton, a sometimes controversial former cabinet minister and police officer, also lost his seat of Dickson in Brisbane to the Labor candidate. He had held the seat for 24 years. The Liberal Party leader said he accepted \"full responsibility\" for his party's loss and \"tonight is not the night\" he wanted. \"We didn't do well enough during this campaign,\" he added. Mr Albanese is the first Australian prime minister to win a second consecutive three-year term in 21 years. Addressing supporters in Sydney, Mr Albanese said serving as PM is the \"greatest honour of my life\". \"And it is with a deep sense of humility and a profound sense of responsibility that the first thing that I do tonight is to say thank you to the people of Australia,\" he added. UK Prime Minister Sir Keir Starmer congratulated Mr Albanese on his victory, saying: \"The UK and Australia are as close as ever - which goes to show that long-distance friendships can be the strongest.\" Cost-of-living pressures and concerns about US President Donald Trump's volatile policies had dominated the Australian election campaign. Labor had branded the opposition leader \"Doge-y Dutton\" and accused his party of mimicking Mr Trump and his Department of Government Efficiency (Doge). Mr Albanese's party had argued that under Mr Dutton, services would be slashed to pay for his party's nuclear ambitions. \"We've seen the attempt to run American-style politics here of division and pitting Australians against each other and I think that's not the Australian way,\" Mr Albanese said. Read more:Australian PM hits out at baby wombat-snatching US influencerEx-husband rejected alleged killer's invitation to poisonous mushrooms lunch Mr Dutton's party blamed government waste by Labor for fuelling inflation and increasing interest rates. He had pledged to axe more than one in five public service jobs to reduce government spending. Mr Dutton had said he wanted to become the first political leader to oust a first-term government since 1931, when Australians were reeling from the Great Depression. However, that dream was quashed as the electorate sided with the Labor Party. Both parties had agreed Australia should reach net zero greenhouse gas emissions by 2050, but Mr Dutton said the country should rely on more nuclear power instead of renewable energy sources to deliver less expensive electricity. The two campaigns also both focused on Australia's changing demographics. The election was the first in which Baby Boomers, born between the end of the Second World War and 1964, were outnumbered by younger voters. Both parties had promised policies to help first-time buyers in a property market out of reach for many."
    },
    {
        "title": "Trump posts AI image of himself as pope on Truth Social",
        "description": "Donald Trump has posted an AI-generated image of himself dressed in papal regalia on his Truth Social platform - just 11 days after the death of Pope Francis.",
        "url": "https://news.sky.com/story/trump-posts-ai-image-of-himself-as-pope-on-truth-social-13360403",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-truth-social_6904326.jpg?20250503131502",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-03 10:46:00",
        "Headline": "The picture was published without comment or explanation on the US president's personal account - and then on the White House X and Instagram accounts.",
        "Content": "Donald Trump has posted an AI-generated image of himself dressed in papal regalia on his Truth Social platform - just 11 days after the death of Pope Francis. Uploaded onto his account early on Saturday morning, it shows the US president with a large gold cross on a chain around his neck. From there, it was published, without comment or explanation, on the White House X and Instagram accounts and, though it drew fierce criticism, it was liked more than 100,000 times. It comes just a few days after the world leader joked that he'd like to be the pontiff. Last week, he was asked by reporters on the White House lawn who he would like to succeed Francis and he replied: \"I'd like to be Pope. That would be my number one choice.\" He went on to say that he did not have a preference, but there was a cardinal in New York who was \"very good\".  Mr Trump was quickly accused of mocking Pope Francis's death, but, by noon, UK time, the post had been liked more than 58,000 times on Instagram. User comments, however, were mostly negative, with one saying that the image \"isn't funny. It's not satire. And it's not harmless\". Another simply called it \"disgusting\", while other reactions included \"disturbing\", \"disrespectful\" and \"offensive\". On X, where the picture was liked more than 78,000 times, a user commented that Mr Trump was \"making a mockery of the pious\", while another judged it \"not a wise decision\". The conclave to select a new pontiff will begin on 7 May after the death of Francis, the leader of the Roman Catholic Church. The Argentinian, who became pope in 2013, died on Easter Monday at the age of 88 due to a stroke and heart failure. Last weekend, the president was criticised for wearing a non-traditional blue suit for Francis's Vatican funeral and chewing gum during the ceremony. However, his meeting in St Peter's Basilica with Ukrainian President Volodymyr Zelenskyy before the outdoor mass got under way was dubbed \"Pope Francis's miracle\" by members of the clergy.  Read more:Trump birthday parade plannedWho could be the next pope? Mr Trump's own religious views have long been a matter of speculation. He was raised as a Presbyterian and publicly identified with it for most of his adult life, before, in October 2020, he renounced it and said he now considered himself a non-denominational Christian. Many have questioned the depth of his faith, but that hasn't stopped him appealing to conservative Christians and the Christian right, particularly evangelicals, some of whom have helped him get elected twice. Earlier this year, Mr Trump shared a bizarre AI-generated video on his Truth Social platform showcasing what appeared to be a vision of Gaza under his proposed plan.  The footage showed the area transformed into a Middle Eastern paradise with exotic beaches, Dubai-style skyscrapers, luxury yachts and people partying - and featured Israeli Prime Minister Benjamin Netanyahu and Elon Musk."
    },
    {
        "title": "Hovis and Kingsmill-owners in talks about historic bread merger",
        "description": "The owners of Hovis and Kingsmill, two of Britain's leading bread producers, are in talks about a historic merger amid a decades-long decline in the sale of supermarket loaves.",
        "url": "https://news.sky.com/story/hovis-and-kingsmill-owners-in-talks-about-historic-bread-merger-13360351",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hovis-bread_6904232.jpg?20250503064806",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-03 07:39:00",
        "Headline": "Allied Bakeries-owner Associated British Foods and 135 year-old Hovis are negotiating a landmark industry deal that would attract scrutiny from competition regulators, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of Hovis and Kingsmill, two of Britain's leading bread producers, are in talks about a historic merger amid a decades-long decline in the sale of supermarket loaves. Sky News has learnt that Associated British Foods (ABF), the London-listed company which owns Kingsmill's immediate parent, Allied Bakeries, and Hovis, which is owned by investment firm Endless, have been involved in prolonged discussions about a combination of the two businesses. City sources said this weekend that the talks were ongoing, but that there was no certainty that a deal would be finalised. Bankers are said to be working with both sides on the talks about a transaction. A deal could be structured as an acquisition of Hovis by ABF, according to analysts, although details about the mechanics of a merger or the valuations attached to the two businesses were unclear this weekend. ABF is also said to be exploring other options for the future of Allied Bakeries which do not include a deal with Hovis. If completed, a merger would unite two of Britain's best-known ambient food brands, with Allied Bakeries having been founded in 1935 by Willard Garfield Weston, part of the family which continues to control ABF. \n                  Struggling Aston Martin steers into fresh pay controversy\n                 \n                  Money blog: 'I'm a brain surgeon - here's what we earn (I don't think it's good) and easy ways to keep your mind healthy'\n                 \n                  Co-op 'very sorry' after hackers access members' data \n                 Hovis traces its history back even further, having been created in 1890 when Herbert Grime scooped a £25 prize for coming up with the name Hovis, which was derived from the Latin 'Hominis Vis' - meaning strength of man. Persistent inflation, competition from speciality bread producers and shifting consumer habits towards lower-carb diets have combined to impair the bread industry's financial health in recent decades. The impact of the war in Ukraine on wheat and flour prices has been among the factors increasing inflationary pressures on bread producers, according to the most recent set of accounts for Hovis filed at Companies House last year. The overall UK bakery market is said to be worth about £5bn in annual sales, with the equivalent of 11m loaves being sold each day. The principal obstacle facing a merger of Allied Bakeries, which also owns the Sunblest and Allinson's bread brands, and Hovis would reside in its consequences for competition in the UK market. Warburtons, the family-owned business which is the largest bakery group in Britain, is estimated to have a 34% share of the branded wrapped sliced bread sector in the UK, with Hovis on 24% and Allied on 17%, according to industry insiders. A merger of Hovis and Kingsmill would give the combined group a larger share of that segment of the market, although one source said Warburtons' overall turnover would remain larger because of the breadth of its product range. Nevertheless, reducing the number of major supermarket bread suppliers from three to two would be a test of the Competition and Markets Authority's approach to such industry-reshaping mergers at a time when the watchdog is under intense government scrutiny. Read more on Sky News:Aston Martin in pay concernCo-op 'sorry' over hackingMintago £6m funding boost In January, the government removed the CMA chairman, Marcus Bokkerink, as part of a push to reorient Britain's economic regulators around growth-focused objectives. An industry insider suggested that a joint venture involving the distribution networks of Hovis and Kingsmill was a possible, although less likely, alternative to a full-blown merger of the companies. They added that a combined group could benefit from up to £50m of cost savings from such a tie-up. In its interim results announcement this week, ABF said the performance of Allied Bakeries had continued to struggle. \"Allied Bakeries continues to face a very challenging market,\" it said. \"We are evaluating strategic options for Allied Bakeries against this backdrop and we expect to provide an update in [the second half of] 2025.\" In a separate presentation to analysts, ABF described the losses at Allied as unsustainable. The company does not disclose details of Allied Bakeries' financial performance. Allied also owns Speedibake, an own-label bread manufacturer. Hovis has been owned by Endless, a prominent investor in British businesses, since 2020, having previously been owned by Mr Kipling-maker Premier Foods and the Gores family. At the time of the most recent takeover, High Wycombe-based Hovis employed about 2,700 people and operated eight bakery sites and its own flour mill. Hovis's current chief executive, Jon Jenkins, is a former boss of Allied Milling and Baking. This weekend, ABF and Endless both declined to comment."
    },
    {
        "title": "Can Nigel Farage and Reform prove themselves?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/can-nigel-farage-and-reform-prove-themselves-13359842",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-03 04:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Beth Rigby, Harriet Harman and Ruth Davidson assemble for an elections debrief. Beth's been following a very happy Nigel Farage after Reform gained an MP in Runcorn, took the Greater Lincolnshire mayoralty and seized control of several councils. But, how does the party promising change in its very name prove itself with greater power and responsibility? They also discuss how Sir Keir Starmer reacts to Labour's losses (Harriet says he needs to deliver on what he's promised). And what Kemi Badenoch has to do after a terrible set of results for the Conservatives (Ruth reckons it'll be worse for the 2026 set of elections). Come and join us live on Tuesday 20 May at Cadogan Hall in London, tickets available now: https://www.aegpresents.co.uk/event/electoral-dysfunction-live/ Remember you can also watch us on YouTube!"
    },
    {
        "title": "Conservatives call for Labour's Lucy Powell to resign over grooming gang remarks",
        "description": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs.",
        "url": "https://news.sky.com/story/conservatives-call-for-labours-lucy-powell-to-resign-over-grooming-gang-remarks-13361129",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lucy-powell-house-of-commons_6905593.jpg?20250503224316",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-03 22:14:00",
        "Headline": "The leader of the House of Commons later said she was \"sorry\" if she was \"unclear\" in her response to the topic being raised during a debate.",
        "Content": "The Conservatives are calling for Lucy Powell to resign after the Labour MP's exchange with a commentator about grooming gangs. The comment was made by Ms Powell, the leader of the House of Commons, after Conservative political commentator Tim Montgomerie started to ask a question on BBC Radio 4's Any Questions. \"I don't know if you saw the documentary on Channel 4 about rape gangs,\" he started, in relation to the recent programme Groomed: A National Scandal, which centred around five girls who were sexually abused by rape gangs. Ms Powell, who is MP for Manchester Central, responded: \"Oh, we want to blow that little trumpet now, do we? Yeah, OK, let's get that dog whistle out.\" Sir Keir Starmer and the government have been under sustained pressure from political opponents over the handling of historical sex abuse cases in the UK. ConservativeHome founder Mr Montgomerie, who will be appearing on Sunday Morning With Trevor Phillips, continued: \"There is a real issue where… There were so many people in local government, in the authorities, who, for good reason, were worried about upsetting community tensions, that those girls went undefended.\" The conversation moved on, but politicians criticised Ms Powell's comment, with some calling for her to resign. \n                  Can Nigel Farage and Reform prove themselves?\n                 \n                  'Shy' Reform voters in Labour areas led to Farage's party winning by-election, Harriet Harman says\n                 \n                  Local election in maps and charts: Reform delivers massive blow to traditional parties\n                 Shadow home secretary Chris Philp said in a statement: \"This shocking outburst from a Labour cabinet minister belittles the thousands of girls and women who were raped by grooming gangs over decades. \"We have consistently called for a national enquiry in parliament, which has been blocked by Labour ministers who don't seem to know or care about the disgusting crimes which have been perpetrated. \"Anyone who has seen the shocking Channel 4 documentary will know that it is clearer than ever that this is not a 'dog whistle'. \"To dismiss thousands of victims who were raped and the cover up that followed is sickening. She should resign.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Shadow justice secretary Robert Jenrick said: \"Labour's Lucy Powell thinks it's a 'dog whistle' to demand arrests and accountability for the rape gangs. What a disgusting betrayal of the victims. They are part of the cover-up.\" Ousted Reform MP Rupert Lowe, now an independent, shared a letter he wrote to Ms Powell demanding she apologise, calling her comments \"deeply, deeply offensive\". On X on Saturday night, Ms Powell said: \"In the heat of a discussion on AQ, I would like to clarify that I regard issues of child exploitation and grooming with the utmost seriousness. I'm sorry if this was unclear. \"I was challenging the political point scoring around it, not the issue itself. As a constituency MP I've dealt with horrendous cases. This Gvt is acting to get to the truth, and deliver justice.\" Read more:Grooming gangs scandal timelinePM says government will fund further local grooming gangs inquiries if 'needed' Sky News has contacted the office for the Leader of the House of Commons for comment. The long-running row over grooming cases has continued after Labour promised five local inquiries into grooming gangs in January. Tech billionaire Elon Musk had accused Sir Keir of being \"complicit\" in the failure of authorities to protect victims and prosecute abusers while the PM was director of public prosecutions from 2008-2013. The prime minister has repeatedly defended his record, saying it shows he tackled the issue head-on."
    },
    {
        "title": "Lorraine Kelly says she will undergo surgery to remove ovaries",
        "description": "Lorraine Kelly has revealed she is undergoing surgery to remove her ovaries and fallopian tubes.",
        "url": "https://news.sky.com/story/lorraine-kelly-says-she-will-undergo-surgery-to-remove-ovaries-13360610",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lorraine-kelly-lorraine_6904640.jpg?20250503150559",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-03 15:00:00",
        "Headline": "The 65-year-old TV presenter posted a video of her in a hospital bed on Instagram, and said \"I've not been feeling all that well for a little while\".",
        "Content": "Lorraine Kelly has revealed she is undergoing surgery to remove her ovaries and fallopian tubes. The 65-year-old TV presenter posted a video of her in a hospital bed on Instagram, and said \"I've not been feeling all that well for a little while\". Kelly added she \"had a little scan and I have to have my ovaries and my tubes taken out\" with keyhole surgery. She said that the procedure is \"purely preventative,\" and that \"I'm going to be totally fine, see you soon\". According to the NHS, keyhole surgery - also called laparoscopic surgery - is carried out using several small incisions. The procedure can take between one and two hours, and doctors recommend staying off work for two to four weeks after the surgery. In the caption, the ITV presenter wrote she felt \"very lucky to be treated so well\" and thanked gynaecologist Dr Ahmed Raafat and hospital staff. \n                  Lorraine Kelly warns it has become 'almost impossible' for working-class youngsters to make it into TV like she did\n                 \n                  Anne Hathaway reveals miscarriage while in play in which she had to 'give birth every night'\n                 Good Morning Britain presenter Susanna Reid said she was \"sending you all the love in the world\", while TV presenter Julia Bradbury added: \"Wishing you a speedy recovery Lorraine, and good luck with the post op rehab.\" Read more from Sky News:Trump posts AI image of himself as pope'I'm a brain surgeon - here's what we earn'Woman dies after bomb explodes in her hands Kelly has been in television since 1984, starting her career on TV-am as an on-screen reporter covering Scottish news. In 1990, she began her presenting career on Good Morning Britain, before hosting her own show, Lorraine, from 2010."
    }
]