[
    {
        "title": "'Europe's Silicon Valley' at heart of government's growth plans, Rachel Reeves to announce",
        "description": "Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\".",
        "url": "https://news.sky.com/story/europes-silicon-valley-reservoirs-and-old-trafford-at-heart-of-governments-growth-plans-rachel-reeves-to-announce-13298476",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-rachel-reeves-budget_6732265.jpg?20241029170357",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-01-28 17:08:00",
        "Headline": "The chancellor is looking to turn the economy's fortunes around after sluggish growth continued following Labour's election victory last year.",
        "Content": "\n          Political reporter\n       Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\". The chancellor is expected to announce a raft of measures including developing Oxford and Cambridge - which she says has the \"potential to be Europe's Silicon Valley\" - building nine new reservoirs and the redevelopment of Old Trafford. The speech is considered a key moment for a chancellor who has struggled with sluggish economic headwinds since her first budget last autumn. Politics latest: Follow the chancellor's speech on Wednesday morning Despite intense speculation, the government has not yet announced whether they will back a third runway at Heathrow, or further developments at other airports. In a speech on Wednesday, Ms Reeves will confirm: • Support for the Oxford-Cambridge Growth Corridor - also known as the Oxbridge Arc - that was scrapped by the Conservatives in 2022. The government points to a report claiming the development, including transport, business growth, and housing, could add £78bn to the UK economy by 2035; • An agreement that allows water companies to spend £7.9bn to build nine new reservoirs, with two planned for Somerset and then one each in Lincolnshire, Hampshire, Cambridgeshire, Oxfordshire, Suffolk, Kent and West Midlands. A new reservoir hasn't been opened in the UK since 1992; • The government will back the redevelopment of Manchester United's Old Trafford stadium and its surrounding area, alongside plans to change the way projects are appraised and evaluated, in order to \"support decisions on public investment across the country, including outside London and the southeast\"; • Confirmation of a new approach to the National Wealth Fund and Office for Investment to get regional development happening faster. Economics and data editor Don't, whatever you do, call it a \"relaunch\".\n When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy.  Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome the chancellor's enthusiasm for business-friendly reforms.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. Read the analysis in full here A commitment to growth Ms Reeves will use these plans as demonstrations of the government's commitment to \"growth\". The chancellor is set to say in her speech: \"Low growth is not our destiny. But growth will not come without a fight. Without a government that is on the side of working people. Willing to take the right decisions now to change our country's course for the better. \"That's what our Plan for Change is about. That is what drives me as chancellor. And it is what I'm determined to deliver.\" In its election campaign last year, Labour pledged to increase building in the UK - both housing and infrastructure. These pledges are essential to the government's plans to grow the economy, which has continued to struggle since Ms Reeves' budget. A key date for the chancellor is 26 March, when the Office for Budget Responsibility will provide its latest forecast, an indicator of whether they think the government's plans will work. A lack of growth could lead to Ms Reeves having to cut budgets further or raise taxes. As part of the government's plans to grow the economy and build, Sir Keir Starmer has vowed to \"take on\" people who oppose building near where they live, who are known as Nimbys - which stands for Not In My Backyard.  The Oxbridge arc The chancellor will also announce that the Environment Agency has dropped its opposition to 4,500 houses around Cambridge after working with the regulator and local authorities. The prime minister was clear last week that he also wants to see fewer legal challenges to planning applications. Other developments in that region that are getting government backing include more funding for East-West Rail, with new services between Oxford and Milton Keynes, and upgrades to the roads linking Milton Keynes and Cambridge. Ms Reeves will also say a new East Coast Mainline Station at Tempsford - between Cambridge and Milton Keynes - will be supported. Read more on growth:Reeves to seek billions from pension schemesAnalysis: Will chancellor's plans finally boost growth? Sir Patrick Vallance, a science minister who came to prominence during COVID as the government's chief scientific adviser, will be made the Oxford-Cambridge growth corridor champion. Ms Reeves is set to say: \"Just 66 miles apart, these cities are home to two of the best universities in the world, two of the most intensive innovation clusters in the world, and the area is a hub for globally renowned science and technology firms in life sciences, manufacturing, and AI. \"It has the potential to be Europe's Silicon Valley. The home of British innovation.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 She will point out there is no direct commuter link between the two sites and a lack of affordable housing in the area. The chancellor will say the industrial strategy will look to \"take advantage\" of the area's \"unique strengths and potential\". Mel Stride, the shadow chancellor, claimed the \"biggest barriers to growth\" in the UK are Ms Reeves and Sir Keir, and their \"job-destroying budget\". He branded the ideas \"hastily cobbled together\", saying they will not help businesses."
    },
    {
        "title": "Big economy speech will take no immediate pressure off Rachel Reeves",
        "description": "Don't, whatever you do, call it a \"relaunch\".",
        "url": "https://news.sky.com/story/big-economy-speech-will-take-no-immediate-pressure-off-rachel-reeves-13298529",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-rachel-reeves-chancellor_6748484.jpg?20241114182951",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-01-28 19:27:00",
        "Headline": "Sky's Ed Conway says the announcements made by Rachel Reeves will show no immediate returns for a chancellor accused of scoring a growth own-goal within weeks of stepping into the role.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Don't, whatever you do, call it a \"relaunch\". When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy. Having begun the job of repairing the public finances in last October's budget, this is, Rachel Reeves will say, simply the next step. Money latest: Much-loved chocolate bar makes return to shelves Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome her enthusiasm for business-friendly reforms. And most would agree that making it easier to build infrastructure (which is a large part of her pitch) will help improve growth.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. None of that is especially growth-friendly. The greatest challenge facing the chancellor, however, is the fact that very little of what she's talking about in her speech is actually new. Most of these schemes, from the Oxford-Cambridge Arc (or whatever they're calling it) to the multiple new runways planned around London, are very, very old. They've been blueprints for years if not decades. What's been missing is the political will and determination to turn them into reality. The new government may fare better at delivery. But it won't be easy. And none of these projects will deliver growth immediately. Not until some time after the end of the parliament will they properly bear fruit."
    },
    {
        "title": "Glasgow mum who lost leg in Clydebank BMW hit-and-run crash settles £1m legal action against driver",
        "description": "A mum-of-one who lost her leg in a hit-and-run crash has settled a &#163;1m legal action against the driver.",
        "url": "https://news.sky.com/story/glasgow-mum-who-lost-leg-in-clydebank-bmw-hit-and-run-crash-settles-1631m-legal-action-against-driver-13298139",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-kerrie-laverty-digby-brown_6687510.jpg?20250128111841",
        "type": "Home",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-01-28 11:09:00",
        "Headline": "Kerrie Lavery, 26, was mowed down by Thomas Granger while she was on her way home from a mental health charity event in October 2021.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A mum-of-one who lost her leg in a hit-and-run crash has settled a £1m legal action against the driver. Kerrie Lavery, 26, suffered the life-changing injury when Thomas Granger struck her with a BMW while she was on her way home from a mental health charity event in October 2021. A court heard Granger was travelling at about 80mph, double the limit, when the collision occurred at a pedestrian crossing near Clydebank in West Dunbartonshire. Alanah Boyle, who was also mowed down, suffered an injury to her pelvis, elbow, and post-traumatic stress disorder (PTSD). Granger admitted causing serious injury by dangerous driving and failing to stop at the scene of an accident. In May 2024, he was jailed for 33 months and banned from driving for seven years. Ms Lavery, from Drumchapel in Glasgow, last year launched a civil claim in relation to the incident, which was raised at the Court of Session. \n                  Child sex abuse ring victims were 'failed' by the system, Scottish government admits\n                 \n                  Glasgow paedophile gang that ran 'monstrous' child sex abuse ring jailed\n                 \n                  Inquiry to be held into death of asylum seeker who was shot by police after Glasgow hotel stabbings\n                 At the time, it was understood the £1m legal action sought to cover the cost of prosthetics for the rest of Ms Lavery's life, as well as compensation for the impact on her life, including lost earnings. In an update on Wednesday, Ms Lavery's lawyers confirmed the action had now been successfully settled. Chris Stewart, partner at Digby Brown Solicitors, said: \"What happened to Kerrie was agonising and life-changing and something no young mother should have to endure. \"I can't comment on specifics around the civil claim, but I can confirm the action has now [been] settled which means Kerrie can access the best possible medical treatment for the rest of her life as well as secure her financial future after the crash impacted her ability to work. \"Kerrie has already proven her strength and determination throughout her recovery - from physios to prosecution hearings to simply staying upbeat for her wee boy. \"Of course, there are hard days, but I know she also has a positive and tight-knit network of friends and family who offer support. \"I hope that Kerrie, Alanah and their families may now have the means to move forward into the peaceful and positive future they deserve.\""
    },
    {
        "title": "Bishop of Liverpool denies wrongdoing after misconduct allegations from two women",
        "description": "The Bishop of Liverpool has denied allegations of misconduct made against him by two women.",
        "url": "https://news.sky.com/story/bishop-of-liverpool-denies-wrongdoing-after-misconduct-allegations-from-two-women-13298677",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-church-of-england_6813185.jpg?20250128221052",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-28 22:08:00",
        "Headline": "In a statement, the Rt Revd Dr John Perumbalath said he has \"consistently denied the allegations made against me\".",
        "Content": "The Bishop of Liverpool has denied allegations of misconduct made against him by two women. In a statement after Channel 4 first reported claims, the Rt Revd Dr John Perumbalath said he \"consistently denied\" them and had complied with any church investigation. \"The allegations set out in this programme are in relation to encounters that took place in public settings, with other people present,\" he said. He added that a claim of misconduct made in Essex had been \"investigated by the police who took no further action\". The bishop added that while \"I don't believe I have done anything wrong\", he took \"seriously the lessons learnt through this process addressing how my actions can be perceived by others\" and said he would comply \"with any investigation deemed necessary\". The Church of England also confirmed that a complaint of alleged misconduct was raised against the bishop early in 2023. It said: \"The complaint was looked into according to statutory safeguarding guidance… and an independent risk assessment undertaken. \"This process concluded that there were no ongoing safeguarding concerns, but a learning outcome was identified with which the bishop fully engaged.\" Shortly after the first complaint, the church added a \"further disclosure was made by another woman\". Read more from Sky News:British man dies after being swept out to sea in Tenerife - reportsSelena Gomez breaks down in tears over Trump's deportations The church said the later allegation was \"assessed not to be a safeguarding matter but a matter of alleged misconduct\". It added the second woman brought her claim too late for action to be taken. It added that Stephen Cottrell - the Archbishop of York - was involved in supporting the woman. \"He had no part in the decision making around safeguarding or disciplinary matters,\" the statement said. Mr Cottrell was criticised last year after a BBC investigation claimed when he was Bishop of Chelmsford, he let priest David Tudor stay in post in the diocese despite knowing he had been banned by the Church from being alone with children and paid compensation to a sexual abuse victim. He said at the time he was \"deeply sorry that we were not able to take action earlier\" but added he \"acted immediately\" within the authority he had regarding the case."
    },
    {
        "title": "'Limited distribution' in UK of recalled Coca-Cola soft drinks",
        "description": "There has been a \"limited distribution to the UK\" of Coca-Cola and other soft drinks that have been recalled over safety fears, the Food Standards Agency (FSA) has said.",
        "url": "https://news.sky.com/story/limited-distribution-in-uk-of-recalled-coca-cola-soft-drinks-13298585",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-coke-coca-cola-cans_6656503.jpg?20240814153802",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-28 20:58:00",
        "Headline": "High levels of a chemical by-product from chlorine disinfectants were found in some of the drinks, including Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero.",
        "Content": "There has been a \"limited distribution to the UK\" of Coca-Cola and other soft drinks that have been recalled over safety fears, the Food Standards Agency (FSA) has said. High levels of a chemical by-product from chlorine disinfectants were found in some of the drinks, including Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero. Coca-Cola Europacific Partners, the company's bottling partner, said batches had been taken off shelves in Belgium, Luxembourg and the Netherlands after testing revealed \"elevated levels\" of chlorate. The FSA's Tina Potter said the withdrawal related to a \"small number of their soft drinks\" which contained higher levels of the chemical. \"We can confirm that there has been limited distribution to the UK of the affected products,\" she said on Tuesday. \"We are working with relevant authorities and the business directly to assess if there is a food safety concern for UK consumers. \"If we identify any unsafe food, we'll take action to ensure it is removed and alert consumers.\" Chlorate can cause iodine deficiency and is a by-product of chlorine disinfectants widely used in water treatment and food processing. Read more from Sky News:Leicester City owner's helicopter crash was accidental - inquest'New Concorde' prototype jet breaks sound barrier for first timeIran says Hamas will come back stronger In a statement, Coca-Cola Europacific Partners said it had \"flagged\" the issue to the UK's food safety authorities and was in communication with them. It added: \"Independent expert analysis concluded that the likelihood of any associated risk of feeling temporarily unwell from consuming these products is very low. \"This has affected a very small number of imported cans of Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero with production codes from 328 GE to 338 GE, which can be found on the base of the can.\""
    },
    {
        "title": "Driver of SUV involved in crash that killed two girls at Wimbledon school rearrested",
        "description": "The driver of an SUV that crashed into a school in Wimbledon killing two schoolgirls has been arrested for a second time after detectives reopened the investigation, the Metropolitan Police said.",
        "url": "https://news.sky.com/story/driver-of-suv-involved-in-crash-that-killed-two-girls-at-wimbledon-school-arrested-13298106",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wimbledon-school-crash_6726172.jpg?20241024094339",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-28 10:01:00",
        "Headline": "Nuria Sajjad and Selena Lau were both killed when a Land Rover drove through a fence and into their school during an end-of-term tea party.",
        "Content": "The driver of an SUV that crashed into a school in Wimbledon killing two schoolgirls has been arrested for a second time after detectives reopened the investigation, the Metropolitan Police said. Nuria Sajjad and Selena Lau died after the collision at The Study Prep school in southwest London, on 6 July 2023. A \"distinctive gold\" Land Rover smashed through a fence and drove into the school as an end-of-term tea party was being hosted. More than a dozen people were also injured. The Met Police said it arrested a 48-year-old woman, previously named as Claire Freemantle, for the second time on Tuesday on suspicion of causing death by dangerous driving and she was in custody at a London police station. She was first arrested at the scene of the incident. An initial investigation led to the Crown Prosecution Service (CPS) deciding in June last year that Ms Freemantle should face no further action, police said. Read more from Sky News:Search for sisters missing for three weeks endsEx-football referee apologises over 'cocaine video'Young people rioted in 'thrill of the moment' At the time, police said the driver had suffered an epileptic seizure and would face no criminal charges. However, speaking last summer, prosecutors said Ms Freemantle had never had an epileptic seizure before and was in good health before the crash. In a statement at the time, Ms Freemantle expressed her \"deepest sorrow\" and claimed to have \"no recollection of what took place\" after losing consciousness. But, after concerns were raised by the families of the two young girls, a review of the investigation was carried out and it was decided further examination was required. Detective Superintendent Lewis Basford, who is leading the investigation, reissued an appeal for witnesses, adding police believed there were people who had not yet come forward to officers. In a statement released after the Met's announcement, the families of the two girls said: \"We welcomed the reopening of the investigation in October 2024 by the Metropolitan Police into the death of our beautiful girls and the harm caused to those injured and who witnessed the tragedy on that sunny July day. \"It is important that this investigation runs its course unhindered and that each step taken is done so in the pursuit of truth and the full facts.\" After the incident, Nuria's family described her as \"the light of our lives\". Paying tribute, they added: \"She embodied joy, kindness and generosity and she was loved by all around her.\" Selena's family said she would always be their \"shining star\", adding: \"We will miss you so much.\" Solicitor Trevor Sterling, from Moore Barlow, who is representing 20 of the families affected by the crash, said: \"This remains an incredibly tragic case, which has and continues to have a profound impact on all of those affected.\""
    },
    {
        "title": "Child sex abuse ring victims were 'failed' by the system, Scottish government admits",
        "description": "The Scottish government has admitted that children who were raped and attacked by a \"monstrous\" child sex abuse ring were \"failed\" by the system.&#160;",
        "url": "https://news.sky.com/story/child-sex-abuse-ring-victims-were-failed-by-the-system-scottish-government-admits-13298399",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-scotland-child-abuse_6360653.jpg?20250128153854",
        "type": "Home",
        "Author": "Connor Gillies",
        "Date Published": "2025-01-28 15:13:00",
        "Headline": "The case is the largest prosecution of its kind in Scottish history and has raised significant issues about what the authorities knew.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n The Scottish government has admitted that children who were raped and attacked by a \"monstrous\" child sex abuse ring were \"failed\" by the system.  Seven members of a paedophile gang were jailed yesterday for multiple crimes committed in a Glasgow drugs den. The case, which involved primary school-aged children being plied with alcohol and cocaine, was described by the judge as plunging to \"the depths of human depravity\". The heroin addicts organised regular gatherings to carry out the brutal violence between 2012 and 2019. Older children were forced to abuse a younger child during prolonged attacks, referred to in court as \"child rape nights\". It was the largest prosecution of its kind in Scottish history and raised significant issues about what the authorities knew. A major review is now under way. On Tuesday, Scotland's children's minister told Holyrood the details in the case were \"horrific\". MSP Natalie Don-Innes added: \"This case absolutely horrifies me, and there is no getting away from the fact that these children were failed.\" The minister said a case review will ensure \"safeguarding is bolstered going forward\".  The children, who referred to the location of their abuse as the \"beastie house\", claimed money was exchanged after the heinous sex attacks while some of the sex offenders laughed. Iain Owens, 46, Elaine Lannery, 40, Lesley Williams, 43, Paul Brannan, 42, Scott Forbes, 51, Barry Watson, 48, and John Clark, 48, were all found guilty of rape and sexual assault. Read more from Sky News:Leicester City owner's death in helicopter crash was accidental, inquest findsDriver involved in crash that killed two girls at school rearrested The paedophiles were each sentenced to an order for lifelong restriction (OLR). An OLR is a life-long sentence usually reserved for the most serious court cases in Scotland that do not involve murder."
    },
    {
        "title": "'Pick-n-mix' ideologies: Why violent motivations are becoming harder to define",
        "description": "\"Loners and misfits and young men in their bedrooms accessing all sorts of material online\" - are these the \"new threat\" to our security? That's how Sir Keir Starmer put it as he told us last week that \"terrorism has changed\".&#160;",
        "url": "https://news.sky.com/story/pick-n-mix-ideologies-why-violent-motivations-are-becoming-harder-to-define-13297150",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-01-28 16:36:00",
        "Headline": "From 160,000 documents seized and examined, it was concluded Southport killer Axel Rudakubana was obsessed with extreme violence, not a political or religious ideology.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  \"Loners and misfits and young men in their bedrooms accessing all sorts of material online\" - are these the \"new threat\" to our security? That's how Sir Keir Starmer put it as he told us last week that \"terrorism has changed\".  The government says it has no plans to change the definition of extremism. So, then what does need redefining? Or does the \"new threat\" fall into some other category that perhaps in the US they would call \"school-shooter\"?   Southport killer Axel Rudakubana is indeed a misfit, an aberration, but even the most clearly defined terrorists often are. Sometimes they have mental health problems. Often there's a criminal background and a pattern of escalating violence in their lives. In 2017, Khalid Masood killed four people and injured 50 when he drove a car down the pavement of Westminster Bridge, before fatally stabbing a police officer who was protecting parliament. Masood was a known extremist and Islamic State claimed responsibility for his actions, but research by criminologists at Birmingham City University found Masood's history of violence was a means to assert his \"manliness\" and regain power that may have been lacking elsewhere in his life. He also had a previous knife crime conviction, often got into fights and researchers say that \"there is evidence that within prison he wanted to kill someone\". No one is quite sure how Masood was radicalised, probably in jail, but perhaps he was just looking for a reason to justify his desire to kill - and extremism provided it. There is an argument that in many cases ideology is a mask, or at least secondary in significance to a person's violent nature. Our definition of terrorism comes from the Terrorism Act of 2000 and is the use of threat of violence designed to influence government or intimidate the public for the purpose of a political, religious, racial or ideological cause. The Incel movement New and weird forms of ideology can potentially form a plank for terrorism. The Incel (involuntary celibate) movement is one, and it definitely falls into the \"misfit\" category. This sub-culture is focused on members's feeling that they are being denied their right to intimate relationships. A deadly attack in a Toronto massage parlour in 2020 by an Incel-inspired man was described as an act of terrorism by a judge in Canada. Research by Swansea University for the Commission for Counter Extremism said this phenomenon was more aligned to the need for mental health support rather than counter-terrorism interventions, and that is partly where debate lies now with Rudakubana. He did get mental health support after it was determined he had an autism spectrum disorder, but he stopped engaging with it two years ago. The well-publicised deficiency in our mental health services needs as much attention here as any alleged failure in the anti-terrorism Prevent system. 'More volatile would-be terrorists' In October 2024, the head of MI5 Ken McCallum made the point that it was becoming harder to determine whether an act of violence was ideologically motivated or driven by another factor like mental health. He said: \"We're encountering more volatile would-be terrorists with only a tenuous grasp of the ideologies they profess to follow. People viewing both extreme right-wing and Islamist extremist instructional material, along with other bits of online hatred, conspiracy theories and disinformation.\" Mr McCallum described a \"dizzying range\" of beliefs, \"pick-n-mix\" ideologies, and a \"crowd-sourced model\" where people pull on hatred and misinformation from a multitude of mostly online sources. He said: \"Today, an attacker may have no connections to other terrorists. They might not be on our records. And there's often no claim of responsibility.\" 160,000 documents seized in Rudakubana probe Rudakubana again fits into the 'pic-n-mix' classification. He had a copy of Military Studies in the Jihad Against the Tyrants: The al Qaeda Training Manual, but he also had documents about Nazi Germany and the Rwandan genocide.  From 160,000 documents seized and examined, it was concluded he was simply obsessed with extreme violence, not a political or religious ideology. You could say violence was his ideology. In October 2017, when teenagers Thomas Wyllie and Alex Bolland were arrested for plotting to massacre fellow pupils at their school in Northallerton, their planned actions too did not conform to an ideology. The seeming act of terrorism committed by Emad al Swealmeen in November 2021, when he blew himself up in the back of a taxi outside Liverpool Women's Hospital, was eventually found to be motivated by a mix of anger over his failed asylum application and poor mental health. Prevent and its deradicalisation programme The Prevent programme, set up to stop the spread of terrorism in the UK, clearly is not ideal for these kinds of cases. Around 6,000 to 7,000 people are referred to it every year and only a few hundred are selected to go on a deradicalisation programme called Channel. This can't be a catch-all for anyone intent on mass murder. The number of people referred to Prevent with \"conflicted\" or no ideology has been growing and now makes up 36% of all referrals.  Rudakubana fell into that category in the three times he was referred. The first came after he did online searches around mass shootings, the second because of posts he made on Instagram about Libya's Colonel Gaddafi, and the third when he was found to be researching the London Bridge attacks. In each case, a judgement was made that he did not require intervention. Read more from Sky News:Reeves says 'no stone should be left unturned' in inquiryFormer social worker warns over 'holes in the system' 'Individuals pose a serious concern' Dame Sara Khan, the former counter-extremism czar, told Sky News: \"There is no effective system in place to deal with such individuals and they will continue to pose a serious concern.\" It's hard to quantify the number of success stories from Prevent because, by definition, they lead to nothing happening. But Rudakubana is the fourth person known to the programme, who has gone on to commit an act that many would call terrorism. The others include Reading knife killer Khairi Saadallah, Parsons Green bomber Ahmed Hassan, and the man who murdered MP Sir David Amess. Ali Harbi Ali managed to convince people at Prevent that he was reformed, when, actually, he was becoming ever more devoted to Islamic State ideology, ever more obsessed with murdering a politician. His ideology and choice of a political target puts Ali Harbi Ali firmly in the terrorist bracket. But is it worth trying to glean an understanding of Rudakubana's motives from his choice of victims? After all, he is the second mass killer to target children enjoying pop music from a female artist. Like the Manchester bombing at Ariana Grande's concert, his was an attack on innocence. Perhaps the best explanation for this was from the woman taking the dance class, Leanne Lucus. She told Liverpool Crown Court: \"He targeted us because we were women and girls - because we were vulnerable, easy prey.\" Add to this the Islamic State terror threat to a Taylor Swift concert in Austria last summer, it seems angry young men; be they Islamic terrorists, Incels, or misfit loners, often have a misogynistic streak, taking out their rage on women and girls. It's clear a new strategy is needed, and as Metropolitan Police Commissioner Mark Rowley told LBC, they can never stop every violent man. He added: \"We need to be as good as possible at it and there are too many, young men, online, obsessing about this violent material. Some of that is how we intervene with individuals, some of that's about the rules for online material and what people can digest and watch.\" MI5 says the internet is becoming ever more central to terrorist activities - surely that is the frontline of this battle, and one that seems to be getting further out of control with tech bosses choosing not to monitor and regulate content. With easy access to whatever he wanted to watch, Rudakubana was able to curate and indulge his warped fantasy in his bedroom, until he was ready to inflict it on the softest of targets. Does that make him a terrorist or just a monster? A young girl who he attacked but miraculously survived, perhaps found the best word: \"Coward.\""
    },
    {
        "title": "'Europe's Silicon Valley' at heart of government's growth plans, Rachel Reeves to announce",
        "description": "Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\".",
        "url": "https://news.sky.com/story/europes-silicon-valley-reservoirs-and-old-trafford-at-heart-of-governments-growth-plans-rachel-reeves-to-announce-13298476",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-rachel-reeves-budget_6732265.jpg?20241029170357",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-01-28 17:08:00",
        "Headline": "The chancellor is looking to turn the economy's fortunes around after sluggish growth continued following Labour's election victory last year.",
        "Content": "\n          Political reporter\n       Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\". The chancellor is expected to announce a raft of measures including developing Oxford and Cambridge - which she says has the \"potential to be Europe's Silicon Valley\" - building nine new reservoirs and the redevelopment of Old Trafford. The speech is considered a key moment for a chancellor who has struggled with sluggish economic headwinds since her first budget last autumn. Politics latest: Follow the chancellor's speech on Wednesday morning Despite intense speculation, the government has not yet announced whether they will back a third runway at Heathrow, or further developments at other airports. In a speech on Wednesday, Ms Reeves will confirm: • Support for the Oxford-Cambridge Growth Corridor - also known as the Oxbridge Arc - that was scrapped by the Conservatives in 2022. The government points to a report claiming the development, including transport, business growth, and housing, could add £78bn to the UK economy by 2035; • An agreement that allows water companies to spend £7.9bn to build nine new reservoirs, with two planned for Somerset and then one each in Lincolnshire, Hampshire, Cambridgeshire, Oxfordshire, Suffolk, Kent and West Midlands. A new reservoir hasn't been opened in the UK since 1992; • The government will back the redevelopment of Manchester United's Old Trafford stadium and its surrounding area, alongside plans to change the way projects are appraised and evaluated, in order to \"support decisions on public investment across the country, including outside London and the southeast\"; • Confirmation of a new approach to the National Wealth Fund and Office for Investment to get regional development happening faster. Economics and data editor Don't, whatever you do, call it a \"relaunch\".\n When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy.  Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome the chancellor's enthusiasm for business-friendly reforms.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. Read the analysis in full here A commitment to growth Ms Reeves will use these plans as demonstrations of the government's commitment to \"growth\". The chancellor is set to say in her speech: \"Low growth is not our destiny. But growth will not come without a fight. Without a government that is on the side of working people. Willing to take the right decisions now to change our country's course for the better. \"That's what our Plan for Change is about. That is what drives me as chancellor. And it is what I'm determined to deliver.\" In its election campaign last year, Labour pledged to increase building in the UK - both housing and infrastructure. These pledges are essential to the government's plans to grow the economy, which has continued to struggle since Ms Reeves' budget. A key date for the chancellor is 26 March, when the Office for Budget Responsibility will provide its latest forecast, an indicator of whether they think the government's plans will work. A lack of growth could lead to Ms Reeves having to cut budgets further or raise taxes. As part of the government's plans to grow the economy and build, Sir Keir Starmer has vowed to \"take on\" people who oppose building near where they live, who are known as Nimbys - which stands for Not In My Backyard.  The Oxbridge arc The chancellor will also announce that the Environment Agency has dropped its opposition to 4,500 houses around Cambridge after working with the regulator and local authorities. The prime minister was clear last week that he also wants to see fewer legal challenges to planning applications. Other developments in that region that are getting government backing include more funding for East-West Rail, with new services between Oxford and Milton Keynes, and upgrades to the roads linking Milton Keynes and Cambridge. Ms Reeves will also say a new East Coast Mainline Station at Tempsford - between Cambridge and Milton Keynes - will be supported. Read more on growth:Reeves to seek billions from pension schemesAnalysis: Will chancellor's plans finally boost growth? Sir Patrick Vallance, a science minister who came to prominence during COVID as the government's chief scientific adviser, will be made the Oxford-Cambridge growth corridor champion. Ms Reeves is set to say: \"Just 66 miles apart, these cities are home to two of the best universities in the world, two of the most intensive innovation clusters in the world, and the area is a hub for globally renowned science and technology firms in life sciences, manufacturing, and AI. \"It has the potential to be Europe's Silicon Valley. The home of British innovation.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 She will point out there is no direct commuter link between the two sites and a lack of affordable housing in the area. The chancellor will say the industrial strategy will look to \"take advantage\" of the area's \"unique strengths and potential\". Mel Stride, the shadow chancellor, claimed the \"biggest barriers to growth\" in the UK are Ms Reeves and Sir Keir, and their \"job-destroying budget\". He branded the ideas \"hastily cobbled together\", saying they will not help businesses."
    },
    {
        "title": "Big economy speech will take no immediate pressure off Rachel Reeves",
        "description": "Don't, whatever you do, call it a \"relaunch\".",
        "url": "https://news.sky.com/story/big-economy-speech-will-take-no-immediate-pressure-off-rachel-reeves-13298529",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-rachel-reeves-chancellor_6748484.jpg?20241114182951",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-01-28 19:27:00",
        "Headline": "Sky's Ed Conway says the announcements made by Rachel Reeves will show no immediate returns for a chancellor accused of scoring a growth own-goal within weeks of stepping into the role.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Don't, whatever you do, call it a \"relaunch\". When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy. Having begun the job of repairing the public finances in last October's budget, this is, Rachel Reeves will say, simply the next step. Money latest: Much-loved chocolate bar makes return to shelves Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome her enthusiasm for business-friendly reforms. And most would agree that making it easier to build infrastructure (which is a large part of her pitch) will help improve growth.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. None of that is especially growth-friendly. The greatest challenge facing the chancellor, however, is the fact that very little of what she's talking about in her speech is actually new. Most of these schemes, from the Oxford-Cambridge Arc (or whatever they're calling it) to the multiple new runways planned around London, are very, very old. They've been blueprints for years if not decades. What's been missing is the political will and determination to turn them into reality. The new government may fare better at delivery. But it won't be easy. And none of these projects will deliver growth immediately. Not until some time after the end of the parliament will they properly bear fruit."
    },
    {
        "title": "Glasgow mum who lost leg in Clydebank BMW hit-and-run crash settles £1m legal action against driver",
        "description": "A mum-of-one who lost her leg in a hit-and-run crash has settled a &#163;1m legal action against the driver.",
        "url": "https://news.sky.com/story/glasgow-mum-who-lost-leg-in-clydebank-bmw-hit-and-run-crash-settles-1631m-legal-action-against-driver-13298139",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-kerrie-laverty-digby-brown_6687510.jpg?20250128111841",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-01-28 11:09:00",
        "Headline": "Kerrie Lavery, 26, was mowed down by Thomas Granger while she was on her way home from a mental health charity event in October 2021.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A mum-of-one who lost her leg in a hit-and-run crash has settled a £1m legal action against the driver. Kerrie Lavery, 26, suffered the life-changing injury when Thomas Granger struck her with a BMW while she was on her way home from a mental health charity event in October 2021. A court heard Granger was travelling at about 80mph, double the limit, when the collision occurred at a pedestrian crossing near Clydebank in West Dunbartonshire. Alanah Boyle, who was also mowed down, suffered an injury to her pelvis, elbow, and post-traumatic stress disorder (PTSD). Granger admitted causing serious injury by dangerous driving and failing to stop at the scene of an accident. In May 2024, he was jailed for 33 months and banned from driving for seven years. Ms Lavery, from Drumchapel in Glasgow, last year launched a civil claim in relation to the incident, which was raised at the Court of Session. \n                  Child sex abuse ring victims were 'failed' by the system, Scottish government admits\n                 \n                  Glasgow paedophile gang that ran 'monstrous' child sex abuse ring jailed\n                 \n                  Inquiry to be held into death of asylum seeker who was shot by police after Glasgow hotel stabbings\n                 At the time, it was understood the £1m legal action sought to cover the cost of prosthetics for the rest of Ms Lavery's life, as well as compensation for the impact on her life, including lost earnings. In an update on Wednesday, Ms Lavery's lawyers confirmed the action had now been successfully settled. Chris Stewart, partner at Digby Brown Solicitors, said: \"What happened to Kerrie was agonising and life-changing and something no young mother should have to endure. \"I can't comment on specifics around the civil claim, but I can confirm the action has now [been] settled which means Kerrie can access the best possible medical treatment for the rest of her life as well as secure her financial future after the crash impacted her ability to work. \"Kerrie has already proven her strength and determination throughout her recovery - from physios to prosecution hearings to simply staying upbeat for her wee boy. \"Of course, there are hard days, but I know she also has a positive and tight-knit network of friends and family who offer support. \"I hope that Kerrie, Alanah and their families may now have the means to move forward into the peaceful and positive future they deserve.\""
    },
    {
        "title": "Bishop of Liverpool denies wrongdoing after misconduct allegations from two women",
        "description": "The Bishop of Liverpool has denied allegations of misconduct made against him by two women.",
        "url": "https://news.sky.com/story/bishop-of-liverpool-denies-wrongdoing-after-misconduct-allegations-from-two-women-13298677",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-church-of-england_6813185.jpg?20250128221052",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-28 22:08:00",
        "Headline": "In a statement, the Rt Revd Dr John Perumbalath said he has \"consistently denied the allegations made against me\".",
        "Content": "The Bishop of Liverpool has denied allegations of misconduct made against him by two women. In a statement after Channel 4 first reported claims, the Rt Revd Dr John Perumbalath said he \"consistently denied\" them and had complied with any church investigation. \"The allegations set out in this programme are in relation to encounters that took place in public settings, with other people present,\" he said. He added that a claim of misconduct made in Essex had been \"investigated by the police who took no further action\". The bishop added that while \"I don't believe I have done anything wrong\", he took \"seriously the lessons learnt through this process addressing how my actions can be perceived by others\" and said he would comply \"with any investigation deemed necessary\". The Church of England also confirmed that a complaint of alleged misconduct was raised against the bishop early in 2023. It said: \"The complaint was looked into according to statutory safeguarding guidance… and an independent risk assessment undertaken. \"This process concluded that there were no ongoing safeguarding concerns, but a learning outcome was identified with which the bishop fully engaged.\" Shortly after the first complaint, the church added a \"further disclosure was made by another woman\". Read more from Sky News:British man dies after being swept out to sea in Tenerife - reportsSelena Gomez breaks down in tears over Trump's deportations The church said the later allegation was \"assessed not to be a safeguarding matter but a matter of alleged misconduct\". It added the second woman brought her claim too late for action to be taken. It added that Stephen Cottrell - the Archbishop of York - was involved in supporting the woman. \"He had no part in the decision making around safeguarding or disciplinary matters,\" the statement said. Mr Cottrell was criticised last year after a BBC investigation claimed when he was Bishop of Chelmsford, he let priest David Tudor stay in post in the diocese despite knowing he had been banned by the Church from being alone with children and paid compensation to a sexual abuse victim. He said at the time he was \"deeply sorry that we were not able to take action earlier\" but added he \"acted immediately\" within the authority he had regarding the case."
    },
    {
        "title": "Driver of SUV involved in crash that killed two girls at Wimbledon school rearrested",
        "description": "The driver of an SUV that crashed into a school in Wimbledon killing two schoolgirls has been arrested for a second time after detectives reopened the investigation, the Metropolitan Police said.",
        "url": "https://news.sky.com/story/driver-of-suv-involved-in-crash-that-killed-two-girls-at-wimbledon-school-arrested-13298106",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wimbledon-school-crash_6726172.jpg?20241024094339",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-28 10:01:00",
        "Headline": "Nuria Sajjad and Selena Lau were both killed when a Land Rover drove through a fence and into their school during an end-of-term tea party.",
        "Content": "The driver of an SUV that crashed into a school in Wimbledon killing two schoolgirls has been arrested for a second time after detectives reopened the investigation, the Metropolitan Police said. Nuria Sajjad and Selena Lau died after the collision at The Study Prep school in southwest London, on 6 July 2023. A \"distinctive gold\" Land Rover smashed through a fence and drove into the school as an end-of-term tea party was being hosted. More than a dozen people were also injured. The Met Police said it arrested a 48-year-old woman, previously named as Claire Freemantle, for the second time on Tuesday on suspicion of causing death by dangerous driving and she was in custody at a London police station. She was first arrested at the scene of the incident. An initial investigation led to the Crown Prosecution Service (CPS) deciding in June last year that Ms Freemantle should face no further action, police said. Read more from Sky News:Search for sisters missing for three weeks endsEx-football referee apologises over 'cocaine video'Young people rioted in 'thrill of the moment' At the time, police said the driver had suffered an epileptic seizure and would face no criminal charges. However, speaking last summer, prosecutors said Ms Freemantle had never had an epileptic seizure before and was in good health before the crash. In a statement at the time, Ms Freemantle expressed her \"deepest sorrow\" and claimed to have \"no recollection of what took place\" after losing consciousness. But, after concerns were raised by the families of the two young girls, a review of the investigation was carried out and it was decided further examination was required. Detective Superintendent Lewis Basford, who is leading the investigation, reissued an appeal for witnesses, adding police believed there were people who had not yet come forward to officers. In a statement released after the Met's announcement, the families of the two girls said: \"We welcomed the reopening of the investigation in October 2024 by the Metropolitan Police into the death of our beautiful girls and the harm caused to those injured and who witnessed the tragedy on that sunny July day. \"It is important that this investigation runs its course unhindered and that each step taken is done so in the pursuit of truth and the full facts.\" After the incident, Nuria's family described her as \"the light of our lives\". Paying tribute, they added: \"She embodied joy, kindness and generosity and she was loved by all around her.\" Selena's family said she would always be their \"shining star\", adding: \"We will miss you so much.\" Solicitor Trevor Sterling, from Moore Barlow, who is representing 20 of the families affected by the crash, said: \"This remains an incredibly tragic case, which has and continues to have a profound impact on all of those affected.\""
    },
    {
        "title": "'Limited distribution' in UK of recalled Coca-Cola soft drinks",
        "description": "There has been a \"limited distribution to the UK\" of Coca-Cola and other soft drinks that have been recalled over safety fears, the Food Standards Agency (FSA) has said.",
        "url": "https://news.sky.com/story/limited-distribution-in-uk-of-recalled-coca-cola-soft-drinks-13298585",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-coke-coca-cola-cans_6656503.jpg?20240814153802",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-28 20:58:00",
        "Headline": "High levels of a chemical by-product from chlorine disinfectants were found in some of the drinks, including Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero.",
        "Content": "There has been a \"limited distribution to the UK\" of Coca-Cola and other soft drinks that have been recalled over safety fears, the Food Standards Agency (FSA) has said. High levels of a chemical by-product from chlorine disinfectants were found in some of the drinks, including Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero. Coca-Cola Europacific Partners, the company's bottling partner, said batches had been taken off shelves in Belgium, Luxembourg and the Netherlands after testing revealed \"elevated levels\" of chlorate. The FSA's Tina Potter said the withdrawal related to a \"small number of their soft drinks\" which contained higher levels of the chemical. \"We can confirm that there has been limited distribution to the UK of the affected products,\" she said on Tuesday. \"We are working with relevant authorities and the business directly to assess if there is a food safety concern for UK consumers. \"If we identify any unsafe food, we'll take action to ensure it is removed and alert consumers.\" Chlorate can cause iodine deficiency and is a by-product of chlorine disinfectants widely used in water treatment and food processing. Read more from Sky News:Leicester City owner's helicopter crash was accidental - inquest'New Concorde' prototype jet breaks sound barrier for first timeIran says Hamas will come back stronger In a statement, Coca-Cola Europacific Partners said it had \"flagged\" the issue to the UK's food safety authorities and was in communication with them. It added: \"Independent expert analysis concluded that the likelihood of any associated risk of feeling temporarily unwell from consuming these products is very low. \"This has affected a very small number of imported cans of Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero with production codes from 328 GE to 338 GE, which can be found on the base of the can.\""
    },
    {
        "title": "'Pick-n-mix' ideologies: Why violent motivations are becoming harder to define",
        "description": "\"Loners and misfits and young men in their bedrooms accessing all sorts of material online\" - are these the \"new threat\" to our security? That's how Sir Keir Starmer put it as he told us last week that \"terrorism has changed\".&#160;",
        "url": "https://news.sky.com/story/pick-n-mix-ideologies-why-violent-motivations-are-becoming-harder-to-define-13297150",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-01-28 16:36:00",
        "Headline": "From 160,000 documents seized and examined, it was concluded Southport killer Axel Rudakubana was obsessed with extreme violence, not a political or religious ideology.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  \"Loners and misfits and young men in their bedrooms accessing all sorts of material online\" - are these the \"new threat\" to our security? That's how Sir Keir Starmer put it as he told us last week that \"terrorism has changed\".  The government says it has no plans to change the definition of extremism. So, then what does need redefining? Or does the \"new threat\" fall into some other category that perhaps in the US they would call \"school-shooter\"?   Southport killer Axel Rudakubana is indeed a misfit, an aberration, but even the most clearly defined terrorists often are. Sometimes they have mental health problems. Often there's a criminal background and a pattern of escalating violence in their lives. In 2017, Khalid Masood killed four people and injured 50 when he drove a car down the pavement of Westminster Bridge, before fatally stabbing a police officer who was protecting parliament. Masood was a known extremist and Islamic State claimed responsibility for his actions, but research by criminologists at Birmingham City University found Masood's history of violence was a means to assert his \"manliness\" and regain power that may have been lacking elsewhere in his life. He also had a previous knife crime conviction, often got into fights and researchers say that \"there is evidence that within prison he wanted to kill someone\". No one is quite sure how Masood was radicalised, probably in jail, but perhaps he was just looking for a reason to justify his desire to kill - and extremism provided it. There is an argument that in many cases ideology is a mask, or at least secondary in significance to a person's violent nature. Our definition of terrorism comes from the Terrorism Act of 2000 and is the use of threat of violence designed to influence government or intimidate the public for the purpose of a political, religious, racial or ideological cause. The Incel movement New and weird forms of ideology can potentially form a plank for terrorism. The Incel (involuntary celibate) movement is one, and it definitely falls into the \"misfit\" category. This sub-culture is focused on members's feeling that they are being denied their right to intimate relationships. A deadly attack in a Toronto massage parlour in 2020 by an Incel-inspired man was described as an act of terrorism by a judge in Canada. Research by Swansea University for the Commission for Counter Extremism said this phenomenon was more aligned to the need for mental health support rather than counter-terrorism interventions, and that is partly where debate lies now with Rudakubana. He did get mental health support after it was determined he had an autism spectrum disorder, but he stopped engaging with it two years ago. The well-publicised deficiency in our mental health services needs as much attention here as any alleged failure in the anti-terrorism Prevent system. 'More volatile would-be terrorists' In October 2024, the head of MI5 Ken McCallum made the point that it was becoming harder to determine whether an act of violence was ideologically motivated or driven by another factor like mental health. He said: \"We're encountering more volatile would-be terrorists with only a tenuous grasp of the ideologies they profess to follow. People viewing both extreme right-wing and Islamist extremist instructional material, along with other bits of online hatred, conspiracy theories and disinformation.\" Mr McCallum described a \"dizzying range\" of beliefs, \"pick-n-mix\" ideologies, and a \"crowd-sourced model\" where people pull on hatred and misinformation from a multitude of mostly online sources. He said: \"Today, an attacker may have no connections to other terrorists. They might not be on our records. And there's often no claim of responsibility.\" 160,000 documents seized in Rudakubana probe Rudakubana again fits into the 'pic-n-mix' classification. He had a copy of Military Studies in the Jihad Against the Tyrants: The al Qaeda Training Manual, but he also had documents about Nazi Germany and the Rwandan genocide.  From 160,000 documents seized and examined, it was concluded he was simply obsessed with extreme violence, not a political or religious ideology. You could say violence was his ideology. In October 2017, when teenagers Thomas Wyllie and Alex Bolland were arrested for plotting to massacre fellow pupils at their school in Northallerton, their planned actions too did not conform to an ideology. The seeming act of terrorism committed by Emad al Swealmeen in November 2021, when he blew himself up in the back of a taxi outside Liverpool Women's Hospital, was eventually found to be motivated by a mix of anger over his failed asylum application and poor mental health. Prevent and its deradicalisation programme The Prevent programme, set up to stop the spread of terrorism in the UK, clearly is not ideal for these kinds of cases. Around 6,000 to 7,000 people are referred to it every year and only a few hundred are selected to go on a deradicalisation programme called Channel. This can't be a catch-all for anyone intent on mass murder. The number of people referred to Prevent with \"conflicted\" or no ideology has been growing and now makes up 36% of all referrals.  Rudakubana fell into that category in the three times he was referred. The first came after he did online searches around mass shootings, the second because of posts he made on Instagram about Libya's Colonel Gaddafi, and the third when he was found to be researching the London Bridge attacks. In each case, a judgement was made that he did not require intervention. Read more from Sky News:Reeves says 'no stone should be left unturned' in inquiryFormer social worker warns over 'holes in the system' 'Individuals pose a serious concern' Dame Sara Khan, the former counter-extremism czar, told Sky News: \"There is no effective system in place to deal with such individuals and they will continue to pose a serious concern.\" It's hard to quantify the number of success stories from Prevent because, by definition, they lead to nothing happening. But Rudakubana is the fourth person known to the programme, who has gone on to commit an act that many would call terrorism. The others include Reading knife killer Khairi Saadallah, Parsons Green bomber Ahmed Hassan, and the man who murdered MP Sir David Amess. Ali Harbi Ali managed to convince people at Prevent that he was reformed, when, actually, he was becoming ever more devoted to Islamic State ideology, ever more obsessed with murdering a politician. His ideology and choice of a political target puts Ali Harbi Ali firmly in the terrorist bracket. But is it worth trying to glean an understanding of Rudakubana's motives from his choice of victims? After all, he is the second mass killer to target children enjoying pop music from a female artist. Like the Manchester bombing at Ariana Grande's concert, his was an attack on innocence. Perhaps the best explanation for this was from the woman taking the dance class, Leanne Lucus. She told Liverpool Crown Court: \"He targeted us because we were women and girls - because we were vulnerable, easy prey.\" Add to this the Islamic State terror threat to a Taylor Swift concert in Austria last summer, it seems angry young men; be they Islamic terrorists, Incels, or misfit loners, often have a misogynistic streak, taking out their rage on women and girls. It's clear a new strategy is needed, and as Metropolitan Police Commissioner Mark Rowley told LBC, they can never stop every violent man. He added: \"We need to be as good as possible at it and there are too many, young men, online, obsessing about this violent material. Some of that is how we intervene with individuals, some of that's about the rules for online material and what people can digest and watch.\" MI5 says the internet is becoming ever more central to terrorist activities - surely that is the frontline of this battle, and one that seems to be getting further out of control with tech bosses choosing not to monitor and regulate content. With easy access to whatever he wanted to watch, Rudakubana was able to curate and indulge his warped fantasy in his bedroom, until he was ready to inflict it on the softest of targets. Does that make him a terrorist or just a monster? A young girl who he attacked but miraculously survived, perhaps found the best word: \"Coward.\""
    },
    {
        "title": "Family who heard staff laughing as son taken off life support given 'poor bereavement care'",
        "description": "A family who said they could hear hospital staff laughing in a nearby room as their son was taken off life support were given \"poor bereavement\" care, an investigation has found.",
        "url": "https://news.sky.com/story/family-who-heard-staff-laughing-as-son-taken-off-life-support-given-poor-bereavement-care-13298537",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-muhammad-ayaan-haroon_6813029.jpg?20250128200727",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-28 19:25:00",
        "Headline": "Five-year-old Muhammad Ayaan Haroon's father complained of a \"catalogue of catastrophic errors\" in his son's care which he believes \"cost Ayaan his life\".",
        "Content": "A family who said they could hear hospital staff laughing in a nearby room as their son was taken off life support were given \"poor bereavement\" care, an investigation has found. Five-year-old Muhammad Ayaan Haroon, known as Ayaan, died at Sheffield Children's Hospital on 13 March 2023. He had a history of respiratory problems and a rare genetic condition called Hace 1. His father Haroon Rashid complained of a \"catalogue of catastrophic errors\" in his son's care which he believes \"cost Ayaan his life\". A draft report into the boy's death by Niche Health and Social Care Consulting found some of Ayaan's care did not meet the expected standards. It concluded some changes may have marginally increased his chances of survival but were ultimately unlikely to have changed the outcome. Mr Rashid said his family \"simply can't trust this report\" and has called for a second investigation. He said: \"Although it's very critical of the care my son received, the main thing for us as a family is despite it saying his care was mismanaged, it still says the outcome would not have changed. We as a family can't accept that. \"The way I see it there was a catalogue of catastrophic errors that were made... that cost him his life. \"We want a second investigation, for the truth and for the report to reflect the true care that my son received. Our ultimate goal is for genuine lessons to be learned.\" Read more from Sky News:Leicester City owner's helicopter crash was accidental - inquest'New Concorde' prototype jet breaks sound barrier for first timeIran says Hamas will come back stronger 'Substantially inadequate' cultural sensitivity The draft report said Ayaan's family were given \"poor\" bereavement care and the cultural sensitivity shown after his death was \"substantially inadequate,\" which \"undoubtedly added to the trauma of the family\". It said staff did not find out if there were any specific cultural wishes of the family when performing Ayaan's last rights and in the management of his body. Investigators found aspects of Ayaan's care did not meet standards, including the fact he should have been started on high flow oxygen therapy sooner, as well as a four-hour delay in admitting him to the paediatric intensive care unit because of bed and staff capacity issues. The family had complained they could hear staff laughing in a nearby room during Ayaan's final moments, and the report said the unit was so busy there was no side room available \"to support a private dignified death which, while unavoidable, added to the family's distress\". 'Sincere condolences' An NHS South Yorkshire spokesperson said: \"We would again like to offer our sincere condolences to Ayaan's family for the loss and distress they have experienced. \"We're continuing to work very closely and support Ayaan's family and have met with Ayaan's father to share with him the draft report into Ayaan's care. \"As this report is still in draft we're currently at the stage where everyone, most importantly Ayaan's family, have the opportunity to fully read and provide feedback and comment before the final report is released.\""
    },
    {
        "title": "Strictly star Wynne Evans leaves live tour to 'prioritise his wellbeing'",
        "description": "Strictly Come Dancing star Wynne Evans has left the show's live tour after agreeing with the BBC to \"take some time out\" to prioritise his \"wellbeing\". ",
        "url": "https://news.sky.com/story/strictly-star-wynne-evans-leaves-live-tour-to-prioritise-his-wellbeing-13298141",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wynne-evans-strictly-come-dancing_6812560.jpg?20250128112627",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-28 11:06:00",
        "Headline": "The Welsh opera singer issued an apology on Sunday after being heard making a remark to a woman in a video filmed during the launch event for the tour on 16 January.",
        "Content": "Strictly Come Dancing star Wynne Evans has left the show's live tour after agreeing with the BBC to \"take some time out\" to prioritise his \"wellbeing\".  It comes after the 53-year-old Welsh opera singer, who is famous for his role in the GoCompare insurance adverts, apologised for an \"inappropriate and unacceptable\" remark he made during the launch event for the shows. He said: \"I've agreed with the BBC that I'll take some time out from my radio show and the Strictly Live tour, as well as my other public commitments, to prioritise my wellbeing. \"I am deeply sorry for the pain my inappropriate actions have caused, and plan to take this time for self-reflection. \"Apologies to those I won't get to see at the remaining performances and I'm grateful to my fellow tour gang for all the amazing support they have given me.\" The tour started on 17 January and Evans had been performing with Katya Jones, his dance partner during the BBC TV series last year. He missed shows in Glasgow on Saturday and Sunday, saying this was due to an ankle injury and sharing images of his bruises in an Instagram story. Evans then issued an apology on Sunday after being heard making a remark to a woman in a video filmed during the launch event for the tour on 16 January, the Mail On Sunday first reported. \"My language was inappropriate and unacceptable for which I sincerely apologise,\" he said in a statement. The Strictly live tour now continues without him with 12 dates left, including shows in Liverpool tonight and tomorrow. Evans is also taking time off from presenting his weekday morning show on BBC Radio Wales. Broadcaster Robin Morgan sat in for him on Monday and will continue to present during his absence, PA understands. BBC Wales said it had nothing further to add to Evans's statement. Apology over 'joke' In October, Evans and Jones apologised for a \"joke\" after viewers saw the female dance professional moving his hand from her waist during an episode of the show. Jones also appeared not to want to high-five her celebrity partner, but the pair called this \"a running joke\". Strictly introduced chaperones \"at all times\" during rehearsals for the 2024 series."
    },
    {
        "title": "British man dies after being swept out to sea in Tenerife - reports",
        "description": "A British man has reportedly died after being swept out to sea in Tenerife.",
        "url": "https://news.sky.com/story/british-man-dies-after-being-swept-out-to-sea-in-tenerife-reports-13298505",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-los-gigantes_6812974.jpg?20250128183728",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-28 18:19:00",
        "Headline": "The 63-year-old tourist is said to have been one of three people who got into difficulties at Crab Island natural swimming pool on the west side of the Spanish island.",
        "Content": "A British man has reportedly died after being swept out to sea in Tenerife. The 63-year-old tourist was one of three people who got into difficulties at Los Gigantes natural swimming pool on the west side of the Spanish island, according to The Sun. The other two people, both women, managed to get back to safety, the newspaper adds. A local Civil Guard officer reportedly said all three were in the pool, often referred to as Crab Island natural swimming pool, when a wave \"swept them into the sea\". The officer added: \"It will be up for the autopsy to determine how the British man died and whether it occurred for instance through drowning or from a blow to the head.\" Read more from Sky News:Search for sisters missing for three weeks endsEx-football referee apologises over 'cocaine video'Young people rioted in 'thrill of the moment' A spokesman for a regional government-run emergency response co-ordination centre reportedly said: \"Emergency services intervened in the rescue of three people who had got into difficulties in the sea in Tenerife. \"It occurred near to the Crab Island natural pool in the municipality of Santiago del Teide. \"The alarm was raised just before midday yesterday, when we were told three people had been swept by a wave into the sea.\" A Foreign Office spokesman said: \"We are assisting the family of a British man who has died in Spain and are in touch with the local authorities.\""
    },
    {
        "title": "Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry",
        "description": "Donald Trump thinks the&#160;Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms.",
        "url": "https://news.sky.com/story/donald-trump-warns-deepseek-should-be-wakeup-call-for-americas-ai-industry-13298001",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-miami_6812409.jpg?20250128033243",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-28 01:51:00",
        "Headline": "The US president wants US tech companies to dominate artificial intelligence but acknowledges the challenge posed by the low-cost rival, DeepSeek.",
        "Content": " Donald Trump thinks the Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms. DeepSeek says its artificial intelligence models are comparable with those from US giants, like OpenAI which is behind ChatGPT and Google's Gemini, but potentially a fraction of the cost. That has triggered a fall in various US shares, especially leading AI chipmaker Nvidia which registered a record one-day loss for any company on Wall Street during trading on Monday. Its shares recovered some poise on Tuesday, rising more than 7%, as the shock died down and the US president spoke of his belief that the success of the Chinese firm could be helpful to America's AI aspirations. \"The release of DeepSeek, AI from a Chinese company should be a wakeup call for our industries that we need to be laser-focused on competing to win,\" Mr Trump said in Florida. He pointed to DeepSeek's ability to use fewer computing resources. \"I view that as a positive, as an asset... you won't be spending as much, and you'll get the same result, hopefully,\" he added. On Monday, the DeepSeek assistant had surpassed ChatGPT in downloads from Apple's app store. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 OpenAI CEO Sam Altman has given his rival some acknowledgement in a post on X, reacting to DeepSeek's R1 \"reasoning\" model - a core part of the AI technology which answers questions. \"DeepSeek's r1 is an impressive model, particularly around what they're able to deliver for the price,\" he wrote. But Mr Altman was also defiant: \"We will obviously deliver much better models and also it's legit invigorating to have a new competitor! we will pull up some releases.\" DeepSeek is a startup founded in 2023 in Hangzhou, China. Its CEO Liang Wenfeng previously co-founded one of China's top hedge funds, High-Flyer, which focuses on AI-driven quantitative trading. By 2022, it had created a cluster of 10,000 of Nvidia's high-performance chips which are used to build and run AI systems. The US then restricted sales of those chips to China.  DeepSeek said recent AI models were built with Nvidia’s lower-performing chips, which are not banned in China - suggesting cutting-edge technology might not be critical for AI development. In January 2024 it released R1, a new AI model which it claimed was on par with similar models from US companies, but is cheaper to use depending on the task.\n Since DeepSeek's chatbot became available as a mobile app it has surpassed rival ChatGPT in downloads from Apple's app store.\n There have been concerns DeepSeek could undermine the potentially $500bn (£401bn) AI investment by OpenAI, Oracle and SoftBank in Stargate which Mr Trump announced last week at the White House. That project essentially aims to build vastly more computing power to boost AI development. But while addressing Republicans in Miami on Monday, Mr Trump remained upbeat. He claimed that Chinese leaders had told him the US had the most brilliant scientists in the world. 👉 Follow Trump 100 on your podcast app 👈 Read more:AI now a contest between superpowersPM: AI changing 'quicker than we think' He indicated that if Chinese industry could come up with cheaper AI technology, US companies would follow. \"We always have the ideas. We're always first. So I would say that's a positive that could be very much a positive development. \"So instead of spending billions and billions, you'll spend less, and you'll come up with, hopefully, the same solution,\" Mr Trump said. The intense attention on the Chinese firm has not all been good news though. It reported suffering \"large-scale malicious attacks\" on its services. The company said it was hit by a cyber attack on Monday which disrupted users' ability to register on the site."
    },
    {
        "title": "What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down",
        "description": "The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot.",
        "url": "https://news.sky.com/story/what-is-deepseek-the-low-cost-chinese-ai-firm-that-has-turned-the-tech-world-upside-down-13298039",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-app_6812411.jpg?20250128034509",
        "type": "World",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-01-28 07:10:00",
        "Headline": "DeepSeek has turned the tech world upside down as the tiny Chinese company has come up with AI chatbots using just a fraction of the cost of the major players in the industry.",
        "Content": "By Claire Gilbody Dickerson, news reporter  The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot. On Monday, DeepSeek, a tiny company which reportedly employs no more than 200 people, caused American chipmaker Nvidia to have almost $600bn wiped off its market value - the biggest drop in US stock market history. The Chinese AI chatbot threatens the billions of dollars invested in AI while causing US tech stocks to lose well over $1trn (£802bn) in value, according to market analysts. DeepSeek, which has developed two models, V3 and R1, is now the most popular free application on Apple's App Store across the US and UK. What's DeepSeek? The startup was founded in 2023 in Hangzhou, China, by Liang Wenfeng, who previously co-founded one of China's top hedge funds, High-Flyer. The fund had by 2022 amassed a cluster of 10,000 of California-based Nvidia's high-performance A100 graphics processor chips that are used to build and run AI systems, according to a post that summer on Chinese social media platform WeChat. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Former US President Joe Biden's administration restricted sales of those chips to China soon after, something likely to be pursued by his successor, Donald Trump, who was recently sworn in for a second term in the White House.  Why all the attention now?  The hype - and market turmoil - over DeepSeek follows a research paper published last week about the R1 model, which showed advanced \"reasoning\" skills. They include the ability to rethink its approach to a math problem while, depending on the task, being 20 to 50 times cheaper to use than OpenAI's o1 model, according to a post on DeepSeek's official WeChat account. That's why there are fears it could undermine the potentially $500bn AI investment by OpenAI, Oracle and SoftBank that Mr Trump has touted. What's so cool about it?  As Morgan Brown, vice president of product and growth in artificial intelligence at Dropbox, put it, it is currently \"insanely expensive\" to train top AI models. \"DeepSeek just showed up and said 'LOL what if we did this for $5M instead?' \"And they didn't just talk - they actually DID it. Their models match or beat GPT-4 and Claude on many tasks. The AI world is (as my teenagers say) shook,\" he said in a post on X. So how much did it cost? The company wrote in a paper last month that the training of DeepSeek-V3 required less than $6m (£5m) worth of computing power from Nvidia H800 chips. How has President Trump responded?  Speaking to House Republicans on Monday, the 78-year-old Republican called the development a \"wakeup call for our industries that we need to be laser-focused on competing to win\". But Mr Trump signed an order on his first day in office last week that said his administration would \"identify and eliminate loopholes in existing export controls\", signalling that he is likely to strengthen Mr Biden's approach. Read more from Sky News:What are the 'UFO clouds' seen hanging over UK skies?What are the UK's knife crime laws? Venture capitalist Marc Andreessen, who has advised Mr Trump on tech policy, has warned overregulation of the AI industry by the US government will hinder American companies and enable China to get ahead. \"Deepseek R1 is AI's Sputnik moment,\" said Mr Andreessen in a recent post on X, referencing the 1957 satellite launch that set off a Cold War space exploration race between the Soviet Union and the US. What are the concerns? Some people expressed their reservations about the Chinese company and its handling of users' data. Bill Ackman described DeepSeek as \"a Trojan Horse\" and said, TikTok, which was temporarily banned in the US earlier this month over national security concerns, \"is just a toy by comparison\". Sky News has reached out to DeepSeek for comment. UK Prime Minister Sir Keir Starmer's spokesman said on Tuesday he would not \"get ahead of specific models\" when asked whether he would rule out using Chinese AI in Whitehall. But Dr Lukasz Olejnik, independent researcher and consultant, affiliated with King's College London Institute for AI, claims the way the app is designed provides for \"perfect data privacy\". He told Sky News: \"What truly sets DeepSeek apart is its accessibility thanks to open-weight models. \"Unlike centralised models, its open-source versions can be run locally, providing perfect data privacy. \"Organisations are already deploying full models internally, ensuring complete control over sensitive information. \"This is much better than AI tools served on remote servers.\" Too controversial? People have also been flagging how, when it comes to questions about alleged wrongdoing and human rights abuses at the hands of the Chinese government, the app seems unable to respond. Seemingly controversial topics include Taiwan, which China claims as its own, the 1989 Tiananmen Square protests and massacre as well as China's treatment of its Uyghur population, which the UN has previously said \"may constitute crimes against humanity\"."
    },
    {
        "title": "Rwandan-backed M23 rebels complete takeover of key Democratic Republic of Congo city",
        "description": "Rwandan-backed M23 rebels have completed their three-day capture of Goma - the regional capital of eastern DRC - after fierce battles with Congolese forces.",
        "url": "https://news.sky.com/story/rwandan-backed-m23-rebels-complete-takeover-of-key-democratic-republic-of-congo-city-13298463",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-congo-drc-rwanda-m23-rebel_6812915.jpg?20250128165721",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-01-28 16:38:00",
        "Headline": "The Rwandan-backed M23 rebels now have full control of Goma's airport and the border with Rwanda. Civilians who fled the rebels must now contend with life under their rule.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Rwandan-backed M23 rebels have completed their three-day capture of Goma - the regional capital of eastern DRC - after fierce battles with Congolese forces. The rebel group now has full control of the city's airport and the border with Rwanda, as the constant gunfire and shelling around our hotel has gone silent to mark their victory. Mortars and artillery coming in from the Rwandan side of the border have ceased now too. The city is a humanitarian hub and a safe haven for hundreds of thousands who fled the M23 insurgency in other parts of the region. As the group advanced on Goma's outskirts, masses of women and children fled deeper into the city for safety. Now, they will have to contend with what life will look like under their rule. Read more:Inside Congolese city overrun by rebelsWhat is the fighting in the DRC about? Hospitals in town have been overwhelmed by injured civilians wounded in the crossfire and many of Goma's residents have been trapped in their homes without electricity, running water and mobile internet. The swathes of territory in eastern DRC that M23 has captured with its vast, lucrative mines and supply routes have now culminated in their capture of Goma. A city that - on the surface - looks limited in strategic and economic significance but is the ultimate leverage for the path ahead."
    },
    {
        "title": "Swimming pool-sized sinkhole swallows truck in Japan, trapping driver",
        "description": "A truck and its driver have been swallowed by a sinkhole on a busy intersection in Japan, officials say, with a rescue operation under way.",
        "url": "https://news.sky.com/story/swimming-pool-sized-sinkhole-swallows-truck-in-japan-trapping-driver-13298381",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-yashio-japan-sinkhole_6812793.jpg?20250128151547",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-28 14:36:00",
        "Headline": "Officials said the driver had been stuck in the hole, approximately 20ft deep, for some eight hours after it formed at about 10am local time.",
        "Content": " A truck and its driver have been swallowed by a sinkhole on a busy intersection in Japan, officials say, with a rescue operation under way. The driver was still trapped in the vehicle eight hours after it fell into the crater - approximately 20ft deep and 32ft wide - as it formed in the Japanese city of Yashio. Officials said the collapse, which happened at about 10am local time on Tuesday, was thought to have been caused by a crack in the Nakagawa River Basin sewer pipe. The man was trapped due to the driver's seat being filled with sand and mud, according to the Nippon TV station, which reported that rescue teams were pumping air into the hole to give the driver oxygen. Aerial footage from the broadcaster showed at least 12 fire trucks were on the scene in the city, which sits to the north of Japan's capital Tokyo. Japanese media quoted the police as saying the driver was still conscious and capable of talking to officers earlier in the day, but the broadcaster later reported that rescuers could no longer communicate with him. Police were also quoted as saying an investigation was under way to confirm what caused the sinkhole, which has appeared on a road lined with restaurants and local businesses, less than a mile from the Yashio City Hall. Read more:Inside Congolese city overrun by rebelsCycling team rushed to hospital after being hit by car Meanwhile some on social media have raised concerns over local infrastructure. It comes after a sinkhole appeared in the city of Hiroshima last September when an underground water pipe burst and the road caved in, meaning several people trapped in buildings had to be rescued. Similarly, in 2016, a giant sinkhole about 98ft wide and 50ft deep suddenly appeared in the Japanese city of Fukuoka and swallowed five road lanes before it was flooded. The incident caught the attention of the world as workmen repaired the road within a matter of days."
    },
    {
        "title": "Doomsday Clock moved closer to midnight: What is it and how does it work?",
        "description": "The Doomsday Clock has been moved closer to midnight than ever before - symbolising that we are edging towards a global catastrophe.",
        "url": "https://news.sky.com/story/doomsday-clock-moves-closer-to-midnight-what-does-it-mean-12794884",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-doomsday-clock_6812864.jpg?20250128160811",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-28 14:00:00",
        "Headline": "The Doomsday Clock is now at 89 seconds to midnight. Sky News looks at the meaning behind it, what it is and how it works.",
        "Content": "The Doomsday Clock has been moved closer to midnight than ever before - symbolising that we are edging towards a global catastrophe. The clock's new time of 89 seconds to midnight was announced on 28 January, moving one second closer than where it had remained for the previous two years. But what does it actually mean? A metaphor for the dangers facing humanity, the clock is updated based on perceptions about how close humans are to destroying the world - with midnight symbolising that point. The countdown is agreed on by experts at the Bulletin of the Atomic Scientists. What is the Doomsday Clock and how is it set? The Bulletin of the Atomic Scientists first launched the initiative in response to the threat of nuclear war in the 1940s. After the US dropped atomic bombs on Hiroshima and Nagasaki at the end of the Second World War, members of the Bulletin saw a need to help the public understand the scale of the nuclear threat to the existence of humanity. To this day, the Bulletin's science and security board, made up of nuclear and climate experts, set the time for the clock. The board has done this since 1973, when it took over from Eugene Rabinowitch, Bulletin editor and disarmament campaigner. The clock moves closer to or further away from midnight based on how the experts on the board, plus academic colleagues and the Bulletin's sponsors - which include 13 Nobel laureates - read the threats facing the world. Why are scientists changing the time? In 2023 the clock moved forward to 90 seconds due to the \"mounting dangers of the war in Ukraine\". It was the first time the time had changed since 2020, when it was at 100 seconds. Experts said the increase in nuclear threat, political tensions, climate change and illnesses made 2023 a \"time of unprecedented danger\". It stayed the same upon review the following year, when scientists said there was a \"continuing unprecedented level of risk\" from threats including war, the climate crisis and the \"dramatic advance\" of AI. Now, the scientists say the shift from 90 to 89 seconds to midnight should serve as \"a warning to all world leaders\". Daniel Holz, chair of the Bulletin's Science and Security Board, said: \"The factors shaping this year's decision - nuclear risk, climate change, the potential misuse of advances in biological science and a variety of other emerging technologies such as artificial intelligence - were not new in 2024. \"But we have seen insufficient progress in addressing the key challenges, and in many cases this is leading to increasingly negative and worrisome effects. \"Setting the Doomsday Clock at 89 seconds to midnight is a warning to all world leaders. \"The war in Ukraine continues to loom as a large source of nuclear risk. That conflict could escalate to include nuclear weapons at any moment due to a rash decision or through accident and miscalculation.\" The warning comes after Russian president Vladimir Putin lowered his threshold for a nuclear strike in November last year, in what experts considered a thinly veiled warning to the West. \"Russian aggression in Ukraine, including repeated use of nuclear threats since the war began, has been disturbing,\" Mr Holz said. \"In addition, Russia's recent backtracking from important arms control treaties is an alarming sign of increasing nuclear risk.\" The scientist added that despite the current ceasefire between Israel and Hamas in Gaza, \"tensions in the Middle East including with Iran are still dangerously unstable\", and warned other \"potential hotspots\" like Taiwan and North Korea could cause \"unpredictable and potentially devastating outcomes\" through nuclear attacks. AI 'adding to dysfunction' Mr Holz highlighted two major AI threats. The first was its use on the battlefield, which he said is currently \"tentative but worrisome\" as it may start being applied to nuclear weapons. The second, he said, was its risk to global security. \"AI is increasingly disrupting the world's information ecosystem,\" he added. \"AI-fueled disinformation and misinformation will only add to this dysfunction.\" Finally, the scientists cited global warming, with last year being the hottest in recorded history, and the last 10 years being the hottest decade on record, according to scientists at the UN World Meteorological Organisation. \"While there has been impressive growth in wind and solar energy, the world is still falling short of what is necessary to prevent the worse aspects of climate change,\" Mr Holz said. The Doomsday Clock's history When it first began in 1947, the clock was set at seven minutes to midnight. Artist Martyl Langsdorf came up with the idea of the clock and set the time to symbolise the dangers of nuclear confrontation, on the front cover of the Bulletin. Since then it has been ticking away as political, nuclear and climate changes continued over the years, with experts revising the time up and down - mostly closer to midnight and its metaphor for total disaster. There have been more reassuring years, though. In 1995 the clock was at 14 minutes to midnight, the safest reading in its history. And there were \"positive strides\" in some years, such as the Paris climate agreement. Ever since 1998, however, the hands of the clock have been at less than 10 minutes to midnight. In 2020, scientists moved the hands of the clock forward to 100 seconds to midnight after the breakout of COVID-19."
    },
    {
        "title": "Doctors look for clues on why 'super survivors' overcome cancer in first global study",
        "description": "Doctors have begun the first global study of why some people with cancer beat the odds and survive so much longer than expected.",
        "url": "https://news.sky.com/story/doctors-look-for-clues-on-why-super-survivors-overcome-cancer-in-first-global-study-13297748",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-cancer-study-thomas-moore_6812083.jpg?20250127135756",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-01-28 03:00:00",
        "Headline": "The Rosalind study will bring together large numbers of 'super survivors', allowing scientists to explore why these patients have responded so well to treatment.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Doctors have begun the first global study of why some people with cancer beat the odds and survive so much longer than expected. Many cancer specialists have anecdotal stories of patients who have overcome even the most aggressive forms of the disease, despite being given only months to live. The Rosalind study will now bring together large numbers of 'super survivors', allowing scientists to look for clues to why they have responded so well to treatment, while others die. In the past doctors may have put stark differences in survival down to luck. But Dr Thankamma Ajithkumar, who is leading the UK arm of the study at Cambridge University Hospitals NHS Trust, said the hunt was on for a more scientific reason. \"This is the first time anybody has tried to answer this question why there is a select group of people who do exceptionally well after these dreadful cancers,\" he told Sky News. \"We will have a much larger database to say more confidently that this is what is making you live longer.\" The study will focus on some of the most aggressive forms of the disease - extensive-stage small cell lung cancer, the brain cancer glioblastoma, and metastatic pancreatic ductal adenocarcinoma. Just 3% to 5% of patients are still alive five years after diagnosis. 'I never believed I was going to die' Katherine Webster will be joining the study. She was found to have a stage four glioblastoma after suffering a seizure on a train. Scans revealed the tumour in her brain was around 8cm across. Yet after surgery and a course of radiotherapy and chemo all signs of the cancer disappeared. Her latest scan, in December, showed she only has a small fluid-filled space in the left side of her brain. \"I never believed I was going to die,\" she said. \"I just remember coming out of the surgery and saying, 'I'm going to fight this'. \"Having that positive mental attitude has been really important for me.\" Katherine rows regularly near where she lives in Cambridge. Apart from tiring easily and having an occasional tremor in her hand, she is well. \"The thing that really struck me was the study's approach,\" she said. \"It's looking at the positive effects, why you survive as opposed to why you get ill, which is the normal default setting for studies these days. \"It synchronised with my approach to the disease.\" Scientists in more than 40 countries - including eight cancer centres in the UK - will take part in the study. They'll analyse detailed biological information from more than 1,000 patients and their tumours, comparing genetic mutations, proteins and other factors that may determine their response to treatment. 'We might find targets for drugs' Dr Ajithkumar said: \"We hope to answer our basic curiosity of why somebody is alive. \"And second, we might find a number of targets for future drugs.\" The study is being run by French biotech startup Cure51, with backing from the venture capital firm Sofinnova Partners. Read more on Sky News:Surgeons remove tumour through eye socketNew test uses AI to detect breast cancer Nicolas Wolikow, Cure51's co-founder, told Sky News that the aim was to \"kill cancer\" in 20 years. \"The ambition of the project is to eradicate cancer,\" he said. \"If we could unlock these biological mechanisms that are possessed by these survivors and replicate that for the majority of patients, I think we could do it.\" Super survivors who are interested in taking part in the UK arm of the study can get more info at https://www.cuh.nhs.uk/news/trust-backs-international-cancer-study-aided-by-super-survivors/"
    },
    {
        "title": "Boom Supersonic's XB-1 prototype jet breaks sound barrier for first time",
        "description": "A US company's prototype jet has broken the sound barrier in a demonstration it hopes will pave the way for a successor to the Concorde.",
        "url": "https://news.sky.com/story/boom-supersonics-xb-1-prototype-jet-breaks-sound-barrier-for-first-time-13298478",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-boom-supersonic-jet_6812901.png?20250128164815",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-01-28 16:56:00",
        "Headline": "Boom Supersonic hopes the XB-1 will pave the way for the development of Overture, the company's supersonic commercial airliner.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  A US company's prototype jet has broken the sound barrier in a demonstration it hopes will pave the way for a successor to the Concorde. Boom Supersonic's XB-1 is the first civilian aircraft to achieve the feat since the British-French supersonic airliner, which was retired in 2003. The XB-1 broke the sound barrier for the first time over the Mojave Desert in California. During the test flight, it reached an altitude of 35,000ft before accelerating to Mach 1.1 (844mph) - 10% faster than the speed of sound. The jet, which was flown by Boom Supersonic's chief test pilot Tristan \"Geppetto\" Brandenburg, went on to reach Mach 1.1 two more times. A live stream showed the test flight as it happened. Denver-based Boom Supersonic hopes the XB-1 will pave the way for the development of Overture, the company's supersonic commercial airliner. The XB-1 is around 63ft-long, around one-third the size of Overture, which is intended to seat between 64 and 80 passengers and travel at speeds of up to Mach 1.7. Such speeds would be around twice as fast as subsonic passenger jets, but still slightly slower than the Concorde. The Overture has already been pre-ordered 130 times by companies such as American Airlines, United Airlines, and Japan Airlines. Read more from Sky News:Leicester City owner's helicopter crash was accidental - inquestIran says Hamas will come back strongerDoomsday Clock moved closer to midnight What happened to Concorde? Concorde was a British-French supersonic airliner which predominantly flew routes between New York and London or Paris. It could accelerate up to around Mach 2 (1,354mph) - more than twice the speed of sound - and carried around 100 passengers. In July 2000 an Air France Concorde crashed shortly after take-off, killing all 109 on board and four people on the ground. It also led to the fleet being grounded for a year. Maintenance issues, high operational costs and the impact of the 9/11 attacks on air travel led British Airways and Air France to retire the Concorde in 2003."
    },
    {
        "title": "Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry",
        "description": "Donald Trump thinks the&#160;Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms.",
        "url": "https://news.sky.com/story/donald-trump-warns-deepseek-should-be-wakeup-call-for-americas-ai-industry-13298001",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-miami_6812409.jpg?20250128033243",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 01:51:00",
        "Headline": "The US president wants US tech companies to dominate artificial intelligence but acknowledges the challenge posed by the low-cost rival, DeepSeek.",
        "Content": " Donald Trump thinks the Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms. DeepSeek says its artificial intelligence models are comparable with those from US giants, like OpenAI which is behind ChatGPT and Google's Gemini, but potentially a fraction of the cost. That has triggered a fall in various US shares, especially leading AI chipmaker Nvidia which registered a record one-day loss for any company on Wall Street during trading on Monday. Its shares recovered some poise on Tuesday, rising more than 7%, as the shock died down and the US president spoke of his belief that the success of the Chinese firm could be helpful to America's AI aspirations. \"The release of DeepSeek, AI from a Chinese company should be a wakeup call for our industries that we need to be laser-focused on competing to win,\" Mr Trump said in Florida. He pointed to DeepSeek's ability to use fewer computing resources. \"I view that as a positive, as an asset... you won't be spending as much, and you'll get the same result, hopefully,\" he added. On Monday, the DeepSeek assistant had surpassed ChatGPT in downloads from Apple's app store. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 OpenAI CEO Sam Altman has given his rival some acknowledgement in a post on X, reacting to DeepSeek's R1 \"reasoning\" model - a core part of the AI technology which answers questions. \"DeepSeek's r1 is an impressive model, particularly around what they're able to deliver for the price,\" he wrote. But Mr Altman was also defiant: \"We will obviously deliver much better models and also it's legit invigorating to have a new competitor! we will pull up some releases.\" DeepSeek is a startup founded in 2023 in Hangzhou, China. Its CEO Liang Wenfeng previously co-founded one of China's top hedge funds, High-Flyer, which focuses on AI-driven quantitative trading. By 2022, it had created a cluster of 10,000 of Nvidia's high-performance chips which are used to build and run AI systems. The US then restricted sales of those chips to China.  DeepSeek said recent AI models were built with Nvidia’s lower-performing chips, which are not banned in China - suggesting cutting-edge technology might not be critical for AI development. In January 2024 it released R1, a new AI model which it claimed was on par with similar models from US companies, but is cheaper to use depending on the task.\n Since DeepSeek's chatbot became available as a mobile app it has surpassed rival ChatGPT in downloads from Apple's app store.\n There have been concerns DeepSeek could undermine the potentially $500bn (£401bn) AI investment by OpenAI, Oracle and SoftBank in Stargate which Mr Trump announced last week at the White House. That project essentially aims to build vastly more computing power to boost AI development. But while addressing Republicans in Miami on Monday, Mr Trump remained upbeat. He claimed that Chinese leaders had told him the US had the most brilliant scientists in the world. 👉 Follow Trump 100 on your podcast app 👈 Read more:AI now a contest between superpowersPM: AI changing 'quicker than we think' He indicated that if Chinese industry could come up with cheaper AI technology, US companies would follow. \"We always have the ideas. We're always first. So I would say that's a positive that could be very much a positive development. \"So instead of spending billions and billions, you'll spend less, and you'll come up with, hopefully, the same solution,\" Mr Trump said. The intense attention on the Chinese firm has not all been good news though. It reported suffering \"large-scale malicious attacks\" on its services. The company said it was hit by a cyber attack on Monday which disrupted users' ability to register on the site."
    },
    {
        "title": "What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down",
        "description": "The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot.",
        "url": "https://news.sky.com/story/what-is-deepseek-the-low-cost-chinese-ai-firm-that-has-turned-the-tech-world-upside-down-13298039",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-app_6812411.jpg?20250128034509",
        "type": "US",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-01-28 07:10:00",
        "Headline": "DeepSeek has turned the tech world upside down as the tiny Chinese company has come up with AI chatbots using just a fraction of the cost of the major players in the industry.",
        "Content": "By Claire Gilbody Dickerson, news reporter  The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot. On Monday, DeepSeek, a tiny company which reportedly employs no more than 200 people, caused American chipmaker Nvidia to have almost $600bn wiped off its market value - the biggest drop in US stock market history. The Chinese AI chatbot threatens the billions of dollars invested in AI while causing US tech stocks to lose well over $1trn (£802bn) in value, according to market analysts. DeepSeek, which has developed two models, V3 and R1, is now the most popular free application on Apple's App Store across the US and UK. What's DeepSeek? The startup was founded in 2023 in Hangzhou, China, by Liang Wenfeng, who previously co-founded one of China's top hedge funds, High-Flyer. The fund had by 2022 amassed a cluster of 10,000 of California-based Nvidia's high-performance A100 graphics processor chips that are used to build and run AI systems, according to a post that summer on Chinese social media platform WeChat. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Former US President Joe Biden's administration restricted sales of those chips to China soon after, something likely to be pursued by his successor, Donald Trump, who was recently sworn in for a second term in the White House.  Why all the attention now?  The hype - and market turmoil - over DeepSeek follows a research paper published last week about the R1 model, which showed advanced \"reasoning\" skills. They include the ability to rethink its approach to a math problem while, depending on the task, being 20 to 50 times cheaper to use than OpenAI's o1 model, according to a post on DeepSeek's official WeChat account. That's why there are fears it could undermine the potentially $500bn AI investment by OpenAI, Oracle and SoftBank that Mr Trump has touted. What's so cool about it?  As Morgan Brown, vice president of product and growth in artificial intelligence at Dropbox, put it, it is currently \"insanely expensive\" to train top AI models. \"DeepSeek just showed up and said 'LOL what if we did this for $5M instead?' \"And they didn't just talk - they actually DID it. Their models match or beat GPT-4 and Claude on many tasks. The AI world is (as my teenagers say) shook,\" he said in a post on X. So how much did it cost? The company wrote in a paper last month that the training of DeepSeek-V3 required less than $6m (£5m) worth of computing power from Nvidia H800 chips. How has President Trump responded?  Speaking to House Republicans on Monday, the 78-year-old Republican called the development a \"wakeup call for our industries that we need to be laser-focused on competing to win\". But Mr Trump signed an order on his first day in office last week that said his administration would \"identify and eliminate loopholes in existing export controls\", signalling that he is likely to strengthen Mr Biden's approach. Read more from Sky News:What are the 'UFO clouds' seen hanging over UK skies?What are the UK's knife crime laws? Venture capitalist Marc Andreessen, who has advised Mr Trump on tech policy, has warned overregulation of the AI industry by the US government will hinder American companies and enable China to get ahead. \"Deepseek R1 is AI's Sputnik moment,\" said Mr Andreessen in a recent post on X, referencing the 1957 satellite launch that set off a Cold War space exploration race between the Soviet Union and the US. What are the concerns? Some people expressed their reservations about the Chinese company and its handling of users' data. Bill Ackman described DeepSeek as \"a Trojan Horse\" and said, TikTok, which was temporarily banned in the US earlier this month over national security concerns, \"is just a toy by comparison\". Sky News has reached out to DeepSeek for comment. UK Prime Minister Sir Keir Starmer's spokesman said on Tuesday he would not \"get ahead of specific models\" when asked whether he would rule out using Chinese AI in Whitehall. But Dr Lukasz Olejnik, independent researcher and consultant, affiliated with King's College London Institute for AI, claims the way the app is designed provides for \"perfect data privacy\". He told Sky News: \"What truly sets DeepSeek apart is its accessibility thanks to open-weight models. \"Unlike centralised models, its open-source versions can be run locally, providing perfect data privacy. \"Organisations are already deploying full models internally, ensuring complete control over sensitive information. \"This is much better than AI tools served on remote servers.\" Too controversial? People have also been flagging how, when it comes to questions about alleged wrongdoing and human rights abuses at the hands of the Chinese government, the app seems unable to respond. Seemingly controversial topics include Taiwan, which China claims as its own, the 1989 Tiananmen Square protests and massacre as well as China's treatment of its Uyghur population, which the UN has previously said \"may constitute crimes against humanity\"."
    },
    {
        "title": "Hotter, drier, faster, stronger: The role climate change did - and did not - play in the California wildfires",
        "description": "Climate change did not ignite the recent blazes that engulfed swathes of Los Angeles this month. But it did make them worse in at least one key way, a rapid analysis has found. \n",
        "url": "https://news.sky.com/story/hotter-drier-faster-stronger-the-role-climate-change-did-and-did-not-play-in-the-california-wildfires-13298161",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-california-los-angeles_6798551.jpg?20250114043648",
        "type": "US",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-01-28 11:49:00",
        "Headline": "Climate change did not cause the Los Angeles wildfires, nor the now infamous Santa Ana winds. But its fingerprints were all over the recent disaster, says a large new study from World Weather Attribution.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Climate change did not ignite the recent blazes that engulfed swathes of Los Angeles this month. But it did make them worse in at least one key way, a rapid analysis has found. \n The fires that erupted on 7 January astounded officials as they ballooned in size in mere hours, torching famous neighbourhoods, forcing 190,000 people to evacuate and taking 28 lives. President Donald Trump has been engaged in a spat with state governor and political foe Gavin Newsom about who is to blame for the fires before the two had an apparently amicable meeting on Friday. The early sparks were fanned into infernos by the now infamous Santa Ana winds - hot, dry winds most common in winter, which reached 99mph. Scientists do not yet understand if climate change disrupts these parching winds. But global warming made the hot and dry conditions that drove the ferocious fires about 35% more likely and 6% more intense, a global network of 32 scientists at World Weather Attribution (WWA) said today. The world is already on average 1.3C hotter than before humans started burning fossil fuels at scale. Around Los Angeles, the hotter air dried out the shrubby vegetation in the area called chaparral, turning it into tinderbox material that feeds a fast-moving fire. \n                  Trump threatens to 'get rid' of emergency agency FEMA as he tours disaster areas\n                 \n                  Day 6: What is Trump really trying to say?\n                 \n                  California wildfires: More than 30,000 flee as fire erupts north of Los Angeles\n                 They also found the fire season, with highly flammable drought conditions, in Los Angeles lasts 23 days longer per year, and that low rainfall between October and December is more than twice as likely. While climate change influenced these two trends, they cannot yet quantify the extent, due to the complex local geography and a lack of data, they said. Dr Clair Barnes from WWA and Imperial College London said: \"Drought conditions are more frequently pushing into winter, increasing the chance a fire will break out during strong Santa Ana winds that can turn small ignitions into deadly infernos. \"Without a faster transition away from planet-heating fossil fuels, California will continue to get hotter, drier, and more flammable.\" John Abatzoglou, professor of climatology at the University of California Merced, who also worked on the study, said: \"This was a perfect storm of climate-enabled and weather-driven fires impacting the built environment.\" The 'fundamental solution' to preventing more fires Last week, President Trump threatened to block federal disaster funding for Los Angeles unless governor Gavin Newsom enforced voter ID and made changes to the city's water management. Mr Trump, who last week ripped up scores of environmental rules, has repeated spurious claims that the conservation programme for a tiny fish caused the fire hydrants to run dry. The scientists called for an overhaul of water infrastructure, which is designed for more routine, structural fires, but now needs to handle intense continuous needs of a fast-moving wildfire.  They also pointed the finger at other policies that had nothing to do with climate change, including housing being built in fire-prone areas. Governor Newsom has commissioned an independent investigation into the loss of water pressure to hydrants. Patrick Gonzalez, a climate change scientist and forest ecologist at California's Berkley University, who was not involved with the study, said: \"Most importantly, the fundamental solution to prevent catastrophic wildfires is cutting the carbon pollution from cars, power plants, and other human sources that causes climate change.\" 'Take this seriously' The researchers reached their findings by comparing a computer simulation of the conditions with a simulation of the climate had it not been warmed by humans, and drawing on existing research. It follows previous studies from the University of California, Los Angeles (UCLA) that found climate change was to blame for about a quarter of the fuel available for the fires. The quick analysis has not been formally peer-reviewed, as it would have to be to get published in a scientific journal, but uses peer-reviewed methods. Dr Gonzalez said it is \"consistent with published research showing that human-caused climate change has intensified the heat that drives wildfire\". Prof Gabi Hegerl, a climate scientist from Edinburgh University who was not involved with the study, called it a \"carefully researched result that should be taken seriously\"."
    },
    {
        "title": "Day 9: Trump and Gaza ",
        "description": " <a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>  ",
        "url": "https://news.sky.com/story/day-9-trump-and-gaza-13298003",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-podcasts-donald-trump_6801283.png?20250128034928",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 02:55:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Follow Trump 100 on your podcast app 👈    As thousands of Palestinians head back to their homes in Northern Gaza, US correspondents Mark Stone and James Matthews find out if Arab Americans who backed Trump in November are still happy with their choice, or if his comments about 'cleaning out' the Gaza Strip have rocked their confidence in the President. And, diplomacy via social media? What does Donald Trump's almost-trade war with Colombia, and the way it was resolved, tell us about how the Trump administration will handle international affairs? You can email James, Martha and Mark on trump100@sky.uk"
    },
    {
        "title": "Pardoned January 6 Capitol rioter shot dead by police in Indiana",
        "description": "A pardoned January 6 Capitol rioter has been shot dead by police in Indiana.",
        "url": "https://news.sky.com/story/pardoned-january-6-capitol-rioter-shot-dead-by-police-in-indiana-13298163",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-us-politics-capitol-riots_6812579.png?20250128121058",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 12:00:00",
        "Headline": "Matthew Huttle and his uncle Dale travelled to Washington DC and took part in the Capitol riots in 2021.",
        "Content": "A pardoned January 6 Capitol rioter has been shot dead by police in Indiana. Matthew Huttle was killed on Sunday when he was shot following a traffic stop in Pulaski County. The 42-year-old had been previously convicted over his role in the Capitol riots, along with his uncle Dale, but was among the more than 1,500 people pardoned by the US president in one of his first actions.   State police are now investigating the incident. They said after an officer tried to arrest Huttle during a traffic stop, \"an altercation took place between the suspect and the officer, which resulted in the officer firing his weapon and fatally wounding the suspect\". It was added that Huttle had been in possession of a firearm.  Authorities did not say what had prompted the traffic stop. \"Our condolences go out to the family of the deceased as any loss of life is traumatic to those that were close to Mr Huttle,\" Sheriff Patrick Williamson said. Nick Barnes, an attorney who was representing Huttle in pending motor vehicle cases in Lake County, said he did not know the circumstances of the shooting but planned to find out. Read more from Sky News:66 million-year-old vomit fossil discoveredTrump and Starmer speak on phoneWhat is DeepSeek? In 2023, Huttle was sentenced to six months in jail after he pleaded guilty to entering the Capitol building. The US Department of Justice, in its statement of facts, said his uncle Dale had struck a police officer with a flag pole and was involved in a \"second violent interaction\" with officers half an hour later when he tried to snatch a baton. It was added that Matthew Huttle had filmed himself once inside the building, turning the camera on his masked face and saying: \"This is me.\""
    },
    {
        "title": "Matthew Perry Foundation launches addiction medicine fellowship",
        "description": "The Matthew Perry Foundation has set up an addiction medicine training fellowship, 15 months after the former Friends star died of a ketamine overdose.",
        "url": "https://news.sky.com/story/matthew-perry-foundation-launches-addiction-medicine-fellowship-13298574",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-actor_6657881.jpg?20240816215818",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 20:46:00",
        "Headline": "Perry, who had been taking the drug six to eight times a day before he died, \"believed deeply in eliminating the stigma\" around addiction, the foundation said.",
        "Content": "The Matthew Perry Foundation has set up an addiction medicine training fellowship, 15 months after the former Friends star died of a ketamine overdose. Established with Massachusetts General Hospital (MGH), the Matthew Perry Foundation Fellowship in Addiction Medicine allows a doctor to join MGH's Addiction Medicine Fellowship for the 2025-26 academic year. Dr Sarah 'SK' Kler, a resident at MGH, will take up the role in June, tasked with studying addiction treatment and working toward providing addiction care in future work, the foundation said on Instagram on Tuesday. In a statement, the chair of the foundation's board Doug Chapin, and its executive director Lisa Kasteler Calio said Perry \"believed deeply in eliminating the stigma surrounding the disease of addiction, and with that in mind, we are proud to lend our name to this important work\". The Canadian-born actor, who had been taking ketamine six to eight times a day before he died, was found dead at his home in Los Angeles in October 2023. A medical examiner later ruled that ketamine was the primary cause of death. Dr Sarah Wakeman, the fellowship's programme director, warned against continuing to \"silo addiction care outside the rest of medical care\". \n                  Blake Lively and Justin Baldoni could go to trial over It Ends With Us allegations\n                 \n                  Strictly star Wynne Evans leaves live tour to 'prioritise his wellbeing'\n                 \n                  Selena Gomez breaks down in tears over Trump's deportations as immigration raids ramp up\n                 In comments posted on the hospital's website, she said marginalising addiction as a social problem outside of the domain of physicians \"will only exacerbate stigma and inequities and increase the deadly impact of this epidemic\".  Dr Wakeman called on the medical community to use \"effective, holistic, wraparound services across medical settings\" to help battle addiction. MGH \"will work in close collaboration with the Matthew Perry Foundation to raise awareness, reduce stigma, and, most importantly, offer hope to those of every age, background, and experience who are struggling with substance use disorder\", she said. Read more:Lively-Baldoni could go to trial'No protection' for BoyzoneGomez in tears over deportations In October 2024, Dr Mark Chavez, who had been charged in connection with Perry's death, pleaded guilty to a charge of conspiring to distribute ketamine. Chavez could face up to 10 years in prison when he is sentenced in April. Five people, including Chavez, have been charged in connection with Perry's death. The other four are his live-in assistant Kenneth Iwamasa, an acquaintance of the actor named Eric Fleming, another doctor named Salvador Plasencia, known as \"Dr P\", and Jasveen Sangha, who was referred to in documents as the \"Ketamine Queen\"."
    },
    {
        "title": "Selena Gomez breaks down in tears over Trump's deportations as immigration raids ramp up",
        "description": "Selena Gomez has deleted a video where she breaks down over Donald Trump's immigration crackdown after receiving backlash.",
        "url": "https://news.sky.com/story/selena-gomez-breaks-down-in-tears-over-donald-trumps-deportation-policies-13298152",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-selena-gomez-singer_6812487.jpg?20250128081238",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 11:38:00",
        "Headline": "The 32-year-old American singer and actress, who is of Mexican heritage, deleted the video and replaced it with a post reading: \"Apparently it's not ok to show empathy for people.\"",
        "Content": " Selena Gomez has deleted a video where she breaks down over Donald Trump's immigration crackdown after receiving backlash. The 32-year-old American singer and actress, who is of Mexican heritage, appeared to be reacting to Donald Trump's immigration crackdown. On the now deleted Instagram video on Monday, Gomez said through tears: \"I just want to say that I'm so sorry. All my people are getting attacked. \"The children. I don't understand. I'm so sorry I wish I could do something but I can't. \"I don't know what to do. I'll try everything, I promise.\" It came after Mr Trump signed 10 executive orders on immigration and issued a slew of edicts to carry out promises of mass deportations and tightening border security. Some of the orders have had an immediate impact, with the Trump administration set to conduct major immigration raids in three US cities per week, according to Sky News' US partner NBC News. This week raids in Chicago began on Sunday, New York City began on Tuesday, and three officials said they are planning for the next operation in Aurora, Colorado on Thursday. Next week, three more cities will be targeted. In a meeting with Immigration and Customs Enforcement (ICE) senior leadership over the weekend, ICE's 25 field offices were told to enhance their \"routine operations\" by meeting a quota of between 1,200-1,500 arrests per day, the sources told NBC News. After receiving some backlash online, Ms Gomez replaced the video with a post on her Instagram story which read: \"Apparently it's not ok to show empathy for people.\" That post has now been deleted too. One of her critics was Republican US Senate candidate Sam Parker, who said she should \"be deported\" on X. Gomez appeared to respond on her Instagram story, writing: \"Oh Mr Parker, Mr Parker. Thanks for the laugh and the threat.\" Gomez recently starred in the Oscar-nominated Spanish-language musical Emilia Perez, playing one of four Mexican women involved with a cartel. Read more:Just Stop Oil protesters disrupt play starring Sigourney WeaverUS first lady Melania Trump's new portrait released The president has promised the biggest deportation in US history, and the White House shared images on Friday of men in shackles being taken on a military plane with the caption: \"Deportation flights have begun.\" The Trump administration has expanded arrest priorities to include anyone in the country illegally, not just people with criminal convictions, public safety or national security threats and migrants stopped at the border. While some of Mr Trump's orders are expected to take far longer to have an impact, they have generated fear in immigrant communities. There are about 4 million unauthorised Mexican migrants in the US, according to the Pew Research Center's 2022 research."
    },
    {
        "title": "Former classmate arrested after fresh DNA link nearly 50 years after schoolgirl's murder",
        "description": "DNA advances have led to an arrest which could solve the cold case murder of a 16-year-old girl at a school in Hawaii, nearly five decades ago.",
        "url": "https://news.sky.com/story/former-classmate-arrested-after-fresh-dna-link-nearly-50-years-after-schoolgirls-murder-13298010",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-dawn-momohara-honolulu_6812430.png?20250128044841",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 04:02:00",
        "Headline": "A man living at a nursing home in Utah has been arrested and charged in connection with the unsolved murder of student Dawn Momohara in Honolulu in 1977.",
        "Content": "DNA advances have led to an arrest which could solve the cold case murder of a 16-year-old girl at a school in Hawaii, nearly five decades ago. The body of Dawn Momohara was discovered on the second floor of the English building at McKinley High School in Honolulu on 21 March 1977. She had been sexually assaulted and strangled. Her former classmate, Gideon Castro, now 66, has been charged with second-degree murder, according to the Honolulu Police Department. He was arrested on Tuesday at a nursing home in Utah where he lives. Lieutenant Deena Thoemmes, from the department's homicide department, said the arrest was the result of advances in testing samples of DNA, which were not feasible in 1977. The morning before Ms Momohara was attacked, she had received a call from an unknown man. Later she told her mother she would be visiting a shopping centre with friends. Lt Thoemmes said that officers found Ms Momohara at the school with an orange cloth wound tightly around her neck, \"lying on her back, partially clothed\". \n                  Toddler saved from falling into erupting Hawaii volcano 'in the nick of time'\n                 \n                  'I heard this yell': Shark bites off leg of surfer, 61 - but he manages to swim back to shore\n                 \n                  Pirates Of The Caribbean actor Tamayo Perry dies after being attacked by shark while surfing in Hawaii\n                 After her body was found, detectives interviewed several people, including Mr Castro, but failed to identify a suspect. Sketches of a potential suspect and vehicle were published at the time and were also posted on the Honolulu Police Department's website. Read more from Sky News:Trump warns DeepSeek is 'wakeup call'Cancer clues from 'super survivors'Recall ordered of Coca-Cola drinks In 2019, police re-examined evidence from the murder scene including a pair of blue shorts and underwear. It helped secure the DNA profile of an unidentified male from sperm on Ms Momohara's shorts. Mr Castro is now in custody in Salt Lake County and awaiting extradition to Honolulu, according to Lt Thoemmes who thanked police in Hawaii and Utah. \"Thank you all for your dedication and commitment to the tireless pursuit of justice for Dawn and the Momohara family,\" she said."
    },
    {
        "title": "US first lady Melania Trump's new portrait released",
        "description": "US first lady Melania Trump's official portrait has been released.",
        "url": "https://news.sky.com/story/us-first-lady-melania-trumps-new-portrait-released-13298057",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-melania-trump-us-politics_6812493.png?20250128084157",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-28 08:27:00",
        "Headline": "Melania Trump returned to the White House with her husband this month for another term in Washington.",
        "Content": "US first lady Melania Trump's official portrait has been released. Shot in the White House, in the Yellow Oval Room, the Washington Monument is visible in the background. It was taken on 21 January, the day after Donald Trump's inauguration. Melania Trump: The first lady  The black and white image shows the new first lady wearing a dark business suit, resting her hands on a reflective table. It was shot by Regine Mahaux, a Belgian photographer, who has photographed the Trump family previously including Mrs Trump's official portrait from her first stint in the role. It comes after Mrs Trump drew attention for wearing a distinctive hat to her husband's inauguration.  Read more from Sky News:Ex-classmate arrested nearly 50 years after murderColombia backs down from US trade warTrump praises Starmer The wide-brimmed headpiece drew notice after Mr Trump went to kiss her cheek, but could not get close enough. Mr Trump's own official portrait was released earlier this month and drew comparisons with his police mugshot."
    },
    {
        "title": "Big economy speech will take no immediate pressure off Rachel Reeves",
        "description": "Don't, whatever you do, call it a \"relaunch\".",
        "url": "https://news.sky.com/story/big-economy-speech-will-take-no-immediate-pressure-off-rachel-reeves-13298529",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-rachel-reeves-chancellor_6748484.jpg?20241114182951",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-01-28 19:27:00",
        "Headline": "Sky's Ed Conway says the announcements made by Rachel Reeves will show no immediate returns for a chancellor accused of scoring a growth own-goal within weeks of stepping into the role.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Don't, whatever you do, call it a \"relaunch\". When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy. Having begun the job of repairing the public finances in last October's budget, this is, Rachel Reeves will say, simply the next step. Money latest: Much-loved chocolate bar makes return to shelves Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome her enthusiasm for business-friendly reforms. And most would agree that making it easier to build infrastructure (which is a large part of her pitch) will help improve growth.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. None of that is especially growth-friendly. The greatest challenge facing the chancellor, however, is the fact that very little of what she's talking about in her speech is actually new. Most of these schemes, from the Oxford-Cambridge Arc (or whatever they're calling it) to the multiple new runways planned around London, are very, very old. They've been blueprints for years if not decades. What's been missing is the political will and determination to turn them into reality. The new government may fare better at delivery. But it won't be easy. And none of these projects will deliver growth immediately. Not until some time after the end of the parliament will they properly bear fruit."
    },
    {
        "title": "Fashion retailer Quiz on brink of administration",
        "description": "Quiz Clothing, the troubled fashion business, is close to collapsing into administration days after its shares were delisted from the London stock market.",
        "url": "https://news.sky.com/story/fashion-retailer-quiz-on-brink-of-administration-13298140",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-quiz-olivia-buckland_6792899.jpg?20250106153631",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-28 11:09:00",
        "Headline": "Quiz Clothing, which recently delisted from the London stock market, is expected to appoint administrators by the end of next week, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Quiz Clothing, the troubled fashion business, is close to collapsing into administration days after its shares were delisted from the London stock market. Sky News has learnt that Quiz, which is chaired by the former JD Sports chief Peter Cowgill, is lining up Teneo as administrator in a move expected to take place before the end of next week. The pre-pack insolvency would be intended to enable the founding Ramzan family to take control of a restructured business with substantially fewer stores and employees. Money blog: The 'magic window' when booking flights is cheaper Quiz currently operates roughly 60 standalone stores and dozens more concessions, employing about 1,500 people. Last month, Sky News reported that Quiz's main lender, HSBC, had hired restructuring experts at Interpath to advise it. A solvent restructuring of the business is now said to have been effectively ruled out, although one source said the timing of an insolvency filing was still unclear. \n                  Big economy speech will take no immediate pressure off Rachel Reeves\n                 \n                  Money blog: Much-loved chocolate bar returning to shelves; KFC rival expanding in UK; British bosses admit spying\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 Quiz's troubles come amid growing financial pressure on retailers, many of which are facing a deepening challenge in 2025 as a result of looming hikes to employer's national insurance. In the last 10 days alone, Sky News has revealed that: Poundland's parent has hired advisers to assess options for the leading discount chain; Lakeland, the family-owned kitchenware retailer, has been put up for sale; and that The Original Factory Shop was on the verge of a sale to family office Baaj Capital. At the weekend, Sky News also revealed that WH Smith was in talks to sell its entire high street chain, numbering 500 stores and about 5,000 employees. Quiz Clothing, Teneo and Interpath all declined to comment."
    },
    {
        "title": "Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry",
        "description": "Donald Trump thinks the&#160;Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms.",
        "url": "https://news.sky.com/story/donald-trump-warns-deepseek-should-be-wakeup-call-for-americas-ai-industry-13298001",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-miami_6812409.jpg?20250128033243",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-01-28 01:51:00",
        "Headline": "The US president wants US tech companies to dominate artificial intelligence but acknowledges the challenge posed by the low-cost rival, DeepSeek.",
        "Content": " Donald Trump thinks the Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms. DeepSeek says its artificial intelligence models are comparable with those from US giants, like OpenAI which is behind ChatGPT and Google's Gemini, but potentially a fraction of the cost. That has triggered a fall in various US shares, especially leading AI chipmaker Nvidia which registered a record one-day loss for any company on Wall Street during trading on Monday. Its shares recovered some poise on Tuesday, rising more than 7%, as the shock died down and the US president spoke of his belief that the success of the Chinese firm could be helpful to America's AI aspirations. \"The release of DeepSeek, AI from a Chinese company should be a wakeup call for our industries that we need to be laser-focused on competing to win,\" Mr Trump said in Florida. He pointed to DeepSeek's ability to use fewer computing resources. \"I view that as a positive, as an asset... you won't be spending as much, and you'll get the same result, hopefully,\" he added. On Monday, the DeepSeek assistant had surpassed ChatGPT in downloads from Apple's app store. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 OpenAI CEO Sam Altman has given his rival some acknowledgement in a post on X, reacting to DeepSeek's R1 \"reasoning\" model - a core part of the AI technology which answers questions. \"DeepSeek's r1 is an impressive model, particularly around what they're able to deliver for the price,\" he wrote. But Mr Altman was also defiant: \"We will obviously deliver much better models and also it's legit invigorating to have a new competitor! we will pull up some releases.\" DeepSeek is a startup founded in 2023 in Hangzhou, China. Its CEO Liang Wenfeng previously co-founded one of China's top hedge funds, High-Flyer, which focuses on AI-driven quantitative trading. By 2022, it had created a cluster of 10,000 of Nvidia's high-performance chips which are used to build and run AI systems. The US then restricted sales of those chips to China.  DeepSeek said recent AI models were built with Nvidia’s lower-performing chips, which are not banned in China - suggesting cutting-edge technology might not be critical for AI development. In January 2024 it released R1, a new AI model which it claimed was on par with similar models from US companies, but is cheaper to use depending on the task.\n Since DeepSeek's chatbot became available as a mobile app it has surpassed rival ChatGPT in downloads from Apple's app store.\n There have been concerns DeepSeek could undermine the potentially $500bn (£401bn) AI investment by OpenAI, Oracle and SoftBank in Stargate which Mr Trump announced last week at the White House. That project essentially aims to build vastly more computing power to boost AI development. But while addressing Republicans in Miami on Monday, Mr Trump remained upbeat. He claimed that Chinese leaders had told him the US had the most brilliant scientists in the world. 👉 Follow Trump 100 on your podcast app 👈 Read more:AI now a contest between superpowersPM: AI changing 'quicker than we think' He indicated that if Chinese industry could come up with cheaper AI technology, US companies would follow. \"We always have the ideas. We're always first. So I would say that's a positive that could be very much a positive development. \"So instead of spending billions and billions, you'll spend less, and you'll come up with, hopefully, the same solution,\" Mr Trump said. The intense attention on the Chinese firm has not all been good news though. It reported suffering \"large-scale malicious attacks\" on its services. The company said it was hit by a cyber attack on Monday which disrupted users' ability to register on the site."
    },
    {
        "title": "Playtech chair Mattingley to step down",
        "description": "The chairman of Playtech, the London-listed gambling technology group, is to step down, triggering a search for a successor with a taste for stringent corporate governance challenges.",
        "url": "https://news.sky.com/story/playtech-chair-mattingley-to-step-down-13298450",
        "image_url": "https://e3.365dm.com/18/08/1920x1080/playtech-gambling-generic-sky-news_4397744.jpg?20180822122715",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-28 16:07:00",
        "Headline": "Brian Mattingley will retire from the gambling technology group’s board after an eventful three-and-a-half year tenure punctuated by pay rows and frenetic corporate activity, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chairman of Playtech, the London-listed gambling technology group, is to step down, triggering a search for a successor with a taste for stringent corporate governance challenges. Sky News has learnt that Playtech will announce this week that Brian Mattingley, who has held the role since 2021, is to retire from its board this year. Egon Zehnder International, the boardroom headhunter, is being appointed to handle the search for Mr Mattingley's successor, according to a source close to the situation. Money latest: Your boss is probably spying on you at home A former chairman and chief executive of 888, the London-listed gaming company now known as Evoke, Mr Mattingley was also a founding director of Gala Leisure. At Playtech, he has overseen a frenetic period of corporate activity while also finding himself in the eye of a series of storms with shareholders over boardroom pay and wider corporate governance. The most recent of those came in December when close to a third of investors rebelled over a €100m bonus plan for Mor Weizer, the company's chief executive, along with other senior executives. \n                  Big economy speech will take no immediate pressure off Rachel Reeves\n                 \n                  Fashion retailer Quiz on brink of administration\n                 \n                  Money blog: Much-loved chocolate bar returning to shelves; KFC rival expanding in UK; British bosses admit spying\n                 Shareholders give Mr Mattingley credit, however, for helping to navigate the company through a challenging period in the gambling industry, in particular his role last year in securing the sale of Snaitech, its Italian consumer gambling arm, for €2.3bn. That represented a nearly threefold return on Playtech's initial investment in the business, triggering total returns to shareholders of up to €1.8bn - a sum almost equivalent to all of the special dividends paid by London-listed companies in 2023. The sale of Snaitech will transform Playtech into a pure-play business-to-business operation. During Mr Mattingley's three-and-a-half year tenure, shares in the company have risen by about 60%. A Playtech spokesperson declined to comment on Tuesday."
    },
    {
        "title": "Ovo Energy buys brand from founder as capital-raise looms",
        "description": "Ovo Energy, Britain's fourth-biggest household energy supplier, has struck a &#163;150m deal to acquire its brand from the company's founder as part of a reorganisation expected to culminate in a capital raise or sale.",
        "url": "https://news.sky.com/story/ovo-energy-buys-brand-from-founder-as-capital-raise-looms-13298149",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-ovo-energy-app_6593953.jpg?20240629092625",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-28 11:26:00",
        "Headline": "The UK's fourth-biggest home energy supplier has moved to simplify its corporate structure, including by acquiring control of its brand from founder Stephen Fitzpatrick, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ovo Energy, Britain's fourth-biggest household energy supplier, has struck a £150m deal to acquire its brand from the company's founder as part of a reorganisation expected to culminate in a capital raise or sale. Sky News understands that Ovo has agreed a non-cash transaction with Stephen Fitzpatrick to take control of its brand through the issuance of preference shares to the Irish entrepreneur. The deal, disclosed in filings at Companies House, is part of a broader corporate revamp which also sees Mr Fitzpatrick relinquish his role on Ovo's holding company board. Money blog: The 'magic window' when booking flights is cheaper  Sources said the reorganisation would simplify Ovo's corporate structure, part of which was the legacy of its takeover in 2020 of SSE's energy retail business. That deal catapulted Ovo up the ranks of Britain's energy suppliers, and it now has about 4m customers, with Octopus Energy leading the industry ahead of Centrica's British Gas arm. \n                  The wonder material which could hold the key to near-limitless energy\n                 \n                  UK bills could rise - as Europe's gas consumption falls by 'unprecedented' amount\n                 \n                  Trump 'ill-informed' to attack 'success story' of UK wind industry \n                 Ovo has now repaid the final tranche of term debt associated with the SSE transaction. The deal to take full ownership of its brand means Ovo will no longer make an annual multimillion pound brand licensing payment to an entity controlled by Mr Fitzpatrick. Insiders said the company, chaired by former J Sainsbury chief Justin King and run by ex-Just Eat boss David Buttress, was also rejigging the ownership of Kaluza, its technology platform, within the Ovo Group structure. A capital-raising or sale of Ovo is on the cards in the short to medium term, with Sky News having reported last year that Rothschild was being hired to oversee a strategic review. In a statement issued in response to Sky News on Tuesday, an Ovo spokesperson said: \"Under the leadership of CEO David Buttress, Ovo has a simplified structure, an exceptional team, a strong financial base and a clear mission to deliver for customers. \"Ovo stands ready to accelerate its decarbonisation mission at scale.\""
    },
    {
        "title": "'Europe's Silicon Valley' at heart of government's growth plans, Rachel Reeves to announce",
        "description": "Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\".",
        "url": "https://news.sky.com/story/europes-silicon-valley-reservoirs-and-old-trafford-at-heart-of-governments-growth-plans-rachel-reeves-to-announce-13298476",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-rachel-reeves-budget_6732265.jpg?20241029170357",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-01-28 17:08:00",
        "Headline": "The chancellor is looking to turn the economy's fortunes around after sluggish growth continued following Labour's election victory last year.",
        "Content": "\n          Political reporter\n       Rachel Reeves will unveil Labour's plans to grow the UK economy on Wednesday, warning it \"will not come without a fight\". The chancellor is expected to announce a raft of measures including developing Oxford and Cambridge - which she says has the \"potential to be Europe's Silicon Valley\" - building nine new reservoirs and the redevelopment of Old Trafford. The speech is considered a key moment for a chancellor who has struggled with sluggish economic headwinds since her first budget last autumn. Politics latest: Follow the chancellor's speech on Wednesday morning Despite intense speculation, the government has not yet announced whether they will back a third runway at Heathrow, or further developments at other airports. In a speech on Wednesday, Ms Reeves will confirm: • Support for the Oxford-Cambridge Growth Corridor - also known as the Oxbridge Arc - that was scrapped by the Conservatives in 2022. The government points to a report claiming the development, including transport, business growth, and housing, could add £78bn to the UK economy by 2035; • An agreement that allows water companies to spend £7.9bn to build nine new reservoirs, with two planned for Somerset and then one each in Lincolnshire, Hampshire, Cambridgeshire, Oxfordshire, Suffolk, Kent and West Midlands. A new reservoir hasn't been opened in the UK since 1992; • The government will back the redevelopment of Manchester United's Old Trafford stadium and its surrounding area, alongside plans to change the way projects are appraised and evaluated, in order to \"support decisions on public investment across the country, including outside London and the southeast\"; • Confirmation of a new approach to the National Wealth Fund and Office for Investment to get regional development happening faster. Economics and data editor Don't, whatever you do, call it a \"relaunch\".\n When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy.  Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome the chancellor's enthusiasm for business-friendly reforms.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. Read the analysis in full here A commitment to growth Ms Reeves will use these plans as demonstrations of the government's commitment to \"growth\". The chancellor is set to say in her speech: \"Low growth is not our destiny. But growth will not come without a fight. Without a government that is on the side of working people. Willing to take the right decisions now to change our country's course for the better. \"That's what our Plan for Change is about. That is what drives me as chancellor. And it is what I'm determined to deliver.\" In its election campaign last year, Labour pledged to increase building in the UK - both housing and infrastructure. These pledges are essential to the government's plans to grow the economy, which has continued to struggle since Ms Reeves' budget. A key date for the chancellor is 26 March, when the Office for Budget Responsibility will provide its latest forecast, an indicator of whether they think the government's plans will work. A lack of growth could lead to Ms Reeves having to cut budgets further or raise taxes. As part of the government's plans to grow the economy and build, Sir Keir Starmer has vowed to \"take on\" people who oppose building near where they live, who are known as Nimbys - which stands for Not In My Backyard.  The Oxbridge arc The chancellor will also announce that the Environment Agency has dropped its opposition to 4,500 houses around Cambridge after working with the regulator and local authorities. The prime minister was clear last week that he also wants to see fewer legal challenges to planning applications. Other developments in that region that are getting government backing include more funding for East-West Rail, with new services between Oxford and Milton Keynes, and upgrades to the roads linking Milton Keynes and Cambridge. Ms Reeves will also say a new East Coast Mainline Station at Tempsford - between Cambridge and Milton Keynes - will be supported. Read more on growth:Reeves to seek billions from pension schemesAnalysis: Will chancellor's plans finally boost growth? Sir Patrick Vallance, a science minister who came to prominence during COVID as the government's chief scientific adviser, will be made the Oxford-Cambridge growth corridor champion. Ms Reeves is set to say: \"Just 66 miles apart, these cities are home to two of the best universities in the world, two of the most intensive innovation clusters in the world, and the area is a hub for globally renowned science and technology firms in life sciences, manufacturing, and AI. \"It has the potential to be Europe's Silicon Valley. The home of British innovation.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 She will point out there is no direct commuter link between the two sites and a lack of affordable housing in the area. The chancellor will say the industrial strategy will look to \"take advantage\" of the area's \"unique strengths and potential\". Mel Stride, the shadow chancellor, claimed the \"biggest barriers to growth\" in the UK are Ms Reeves and Sir Keir, and their \"job-destroying budget\". He branded the ideas \"hastily cobbled together\", saying they will not help businesses."
    },
    {
        "title": "Big economy speech will take no immediate pressure off Rachel Reeves",
        "description": "Don't, whatever you do, call it a \"relaunch\".",
        "url": "https://news.sky.com/story/big-economy-speech-will-take-no-immediate-pressure-off-rachel-reeves-13298529",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-rachel-reeves-chancellor_6748484.jpg?20241114182951",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-01-28 19:27:00",
        "Headline": "Sky's Ed Conway says the announcements made by Rachel Reeves will show no immediate returns for a chancellor accused of scoring a growth own-goal within weeks of stepping into the role.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Don't, whatever you do, call it a \"relaunch\". When the chancellor stands up and delivers her much-anticipated speech on Wednesday - with all sorts of exciting schemes for new infrastructure and growth-friendly reforms - she will cast it as part of the new government's long-standing economic strategy. Having begun the job of repairing the public finances in last October's budget, this is, Rachel Reeves will say, simply the next step. Money latest: Much-loved chocolate bar makes return to shelves Regardless of whether you believe that this is all business-as-usual, it's hard to escape the fact that the backdrop to the chancellor's growth speech is, to say the least, challenging. The economy has flatlined at best (possibly even shrunk) since Labour took power. Business and consumer confidence have dipped. Not all of this is down to the miserable messaging emanating from Downing Street since July, but some of it is. Still, whether or not this constitutes a change, most businesses would welcome her enthusiasm for business-friendly reforms. And most would agree that making it easier to build infrastructure (which is a large part of her pitch) will help improve growth.  But it's not everything. What about the fact that the UK has the highest energy costs in the developed world? What about the fact that these costs are likely to be pushed higher by net zero policies (even if they eventually come down)? What about the fact that tax levels are about to hit the highest level in history, or that government debt levels are now rising even faster than previously expected. None of that is especially growth-friendly. The greatest challenge facing the chancellor, however, is the fact that very little of what she's talking about in her speech is actually new. Most of these schemes, from the Oxford-Cambridge Arc (or whatever they're calling it) to the multiple new runways planned around London, are very, very old. They've been blueprints for years if not decades. What's been missing is the political will and determination to turn them into reality. The new government may fare better at delivery. But it won't be easy. And none of these projects will deliver growth immediately. Not until some time after the end of the parliament will they properly bear fruit."
    },
    {
        "title": "Govt says no plans to expand definition of extremism after leaked Home Office report",
        "description": "The government has no plans to expand the definition of extremism, a Home Office minister has said after a leaked review suggested the UK should focus on concerning behaviours and activity rather than ideologies.",
        "url": "https://news.sky.com/story/prime-minister-warns-uk-has-cohort-of-loners-who-are-extreme-and-need-to-be-factored-in-to-security-plans-13298050",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-28 07:42:00",
        "Headline": "A leaked Home Office report says spreading conspiracy theories, misogyny, violence against women and girls and an \"online subculture called the manosphere\" should be deemed extremism.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government has no plans to expand the definition of extremism, a Home Office minister has said after a leaked review suggested the UK should focus on concerning behaviours and activity rather than ideologies. Dan Jarvis told the Commons: \"This work did not recommend an expansion in the definition of extremism, and they are not, and have never been, any plans to do so. \"To be clear, the leaked documents were not current or new government policy.\" He added that \"many documents are produced\" across government as part of work that is not implemented and \"which do not constitute government policy\". Politics latest: Assisted dying debate returns to parliament The document was part of a rapid review on extremism commissioned by Home Secretary Yvette Cooper in August and was revealed after it was leaked to the Policy Exchange thinktank. It suggested the UK should be focusing on behaviours and activities such as spreading conspiracy theories, misogyny, influencing racism and involvement in \"an online subculture called the manosphere\". \n                  'Europe's Silicon Valley' at heart of government's growth plans, Rachel Reeves to announce\n                 \n                  Big economy speech will take no immediate pressure off Rachel Reeves\n                 \n                  Politics latest: Trump 'agrees' to Lord Mandelson as UK ambassador to the US\n                 Earlier on, Sir Keir Starmer said his government is \"looking carefully where the key challenges\" on extremism are, adding it is \"very important\" to focus on threats \"so we can deploy our resource properly\". \"Obviously, that's now informed with what I said last week in the aftermath of the Southport murders, where we've got the additional challenge, I think, of a cohort of loners who are extreme and they need to be factored in,\" he said. \"So that's the focus. In the end, what this comes down to is the safety and security of people across the United Kingdom, that's my number one focus.\" The Home Office said Islamism and extreme right-wing ideologies are the \"most prominent\" issues they are tackling today. In August, Ms Cooper said the Home Office was conducting a \"rapid analytical spring on extremism\" to map and monitor trends and inform the government's approach to extremism. Last week, Sir Keir Starmer said he would change the law if needed to recognise the new threat posed by extremists without specific ideologies ahead of the jailing of Axel Rudakubana for the stabbing to death of three young girls in Southport last summer. The 18-year-old had been referred to the anti-terror Prevent programme three times but was not deemed as an extremist under the scheme's criteria. And, although he pleaded guilty to murder, police were unable to identify Rudakubana's motive, so his crimes fell outside the definition of terrorism. Recommendations could be breach of freedom of speech The leaked review, obtained by the Policy Exchange thinktank, recommends reversing the guidance, introduced by then Home Secretary Suella Braverman, for police to reduce dealing with non-hate crime incidents. It says a new crime, making \"harmful communications\" online illegal, should be introduced instead. The Conservative government rejected this on freedom of speech grounds. Policy Exchange's Paul Stott and Andrew Gilligan said recommendations to class claims of two-tier policing as a \"right-wing extremist narrative\" will also raise concerns over freedom of speech. Dangerous individuals could be missed They said including \"behaviours\" such as violence against women and girls, spreading misinformation and an interest in gore or extreme violence in the definition of extremism could \"swamp already stretched counter-extremism staff and counter-terror police with thousands of new cases\". This could increase the risk \"that genuinely dangerous individuals are missed - it risks addressing symptoms, not causes\", Policy Exchange said. The review itself admits many who display such behaviours are not extremists. Read more:Data suggests 'new' kind of threat has been growing for yearsTrump and Starmer speak on phone and 'agree to meet soon'  Review 'downplays Islamism' Following Rudakubana's guilty plea last week, Sir Keir said the UK \"faces a new threat\" and the teenager represented a new kind of threat with \"acts of extreme violence perpetrated by loners, misfits, young men in their bedroom, accessing all manner of material online, desperate for notoriety\". He said he would change the law, if needed, \"to recognise this new and dangerous threat\" and said a review of \"our entire counter-extremism system\" would take place \"to make sure we have what we need to defeat it\". The review also \"de-centres and downplays Islamism, by far the greatest threat to national security\", Policy Exchange said. It said environmental extremism and Hindu extremism should be tackled, as well as \"left-wing, anarchist and single issue extremism\". And Policy Exchange said it has \"ignored, even repudiated\" recommendations by previous Prevent reviewer William Shawcross that the programme is the wrong place for dealing with the psychologically unstable.  Government focused on Islamism and right-wing ideologies A Home Office spokesperson said: \"The counter-extremism sprint sought to comprehensively assess the challenge facing our country and lay the foundations for a new approach to tackling extremism - so we can stop people being drawn towards hateful ideologies. \"This includes tackling Islamism and extreme right-wing ideologies, which are the most prominent today. \"The findings from the sprint have not been formally agreed by ministers and we are considering a wide range of potential next steps arising from that work.\" Conservative shadow home secretary Chris Philp said: \"By extending the definition of extremism so widely, the government risks losing focus on ideologically motivated terrorists who pose the most risk to life. \"In fact, the Shawcross Review of Prevent made clear that counter-extremism and the counterterrorism strategy should be more focused on terrorist ideology, not less. \"Prevent must be equipped to deal with the terrorist threats in our society, and we should not be dialling back efforts to confront this. \"What the government seems to be planning is a backwards step in the interests of the political correctness we know Keir Starmer loves. \"Starmer wants the thought police to stop anyone telling uncomfortable truths that he and his left-wing lawyer friends don't like.\""
    },
    {
        "title": "Doctors should be able to opt out of recommending assisted dying, MPs told",
        "description": "Doctors should be able to opt out of recommending assisted dying to terminally ill patients, MPs have been told.",
        "url": "https://news.sky.com/story/doctors-should-be-able-to-opt-out-of-recommending-assisted-dying-mps-told-13298384",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chris-whitty-covid-inquiry_6804899.jpg?20250120104153",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-28 15:00:00",
        "Headline": "The assisted dying bill was being scrutinised by MPs who heard from medical experts about the details of the potential legislation to help people end their lives.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Doctors should be able to opt out of recommending assisted dying to terminally ill patients, MPs have been told. Dr Andrew Green, chairman of the British Medical Association's (BMA) medical ethics committee, said it is important doctors should be able to say they do not want to take part in the process at any stage. Asked by the committee scrutinising the Terminally Ill Adults (End of Life) Bill if there is a danger some doctors could be reluctant to give a prognosis of six months or less to live, Dr Green said: \"There are doctors that would find it difficult to do that, and it's important that their position is respected.\" Politics latest: UK announces £17m in aid for Gaza As part of the proposed law, patients will only be allowed to go through with assisted dying if they are expected to die within six months. Chief medical adviser Professor Sir Chris Whitty also told MPs he thinks doctors who do not feel they can suggest assisted dying as an option to patients should be able to refer them to another doctor. However, he said if MPs decide that is \"not fair on the patient\" they need to make a decision on whether doctors should be able to \"push it on\". Patient information service needed Dr Green also called for an information service to be created to give tailored details about assisted dying and other services such as palliative care. The retired GP said doctors face a challenge in knowing when to have certain difficult conversations with patients, but also \"need to be able to open the door for the patient to go through into a safe space to have those difficult discussions\". Dr Green said: \"We actually believe it's important that patients should be able to access personalised information. \"We would like to see an official information service set up that patients could go to either as a self-referral or as a recommendation from their GPs or other doctors.\" In 2021, the doctor's union changed its position from being against assisted dying to a neutral stance. He said the BMA has not taken a view on whether assisted dying should be provided by the NHS but said there should be a \"degree of separation\" so it is not \"part of any doctor's normal job to provide assisted dying\". Read more:Cost of assisted dying estimatedWhat does the assisted dying bill propose?  Dr Green said this would reassure patients that assisted dying would not just be part of their normal care and if they were interested in it there would be \"proper quality, proper audit attached to it\". He said it would also reassure doctors \"who didn't want to have any part\" in assisted dying, as well as those who would feel alright to participate as they would have \"emotional support and proper training\". Training for nurses essential Professor Nicola Ranger, chief executive of the Royal College of Nursing (RCN) told MPs it was \"absolutely vital\" for the chief nursing officer to be part of any guidance on care because nurses provide \"the majority\" of end-of-life care. She said training nursing staff would be essential as they would need to be \"very vigilant around anyone feeling that they're a burden\" and therefore opting for assisted dying. The nurse said access to quality palliative care is not \"as good as it needs to be\" and said it is \"possible\" that someone might request assisted dying in the absence of adequate care. But she added: \"What we would want to strive to do is have a system that doesn't leave anyone in distress.\" The assisted dying bill was voted through by MPs last year and the details are now being scrutinised by a committee of MPs on both sides of the argument."
    },
    {
        "title": "Boom Supersonic's XB-1 prototype jet breaks sound barrier for first time",
        "description": "A US company's prototype jet has broken the sound barrier in a demonstration it hopes will pave the way for a successor to the Concorde.",
        "url": "https://news.sky.com/story/boom-supersonics-xb-1-prototype-jet-breaks-sound-barrier-for-first-time-13298478",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-boom-supersonic-jet_6812901.png?20250128164815",
        "type": "Technology",
        "Author": "Samuel Osborne",
        "Date Published": "2025-01-28 16:56:00",
        "Headline": "Boom Supersonic hopes the XB-1 will pave the way for the development of Overture, the company's supersonic commercial airliner.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  A US company's prototype jet has broken the sound barrier in a demonstration it hopes will pave the way for a successor to the Concorde. Boom Supersonic's XB-1 is the first civilian aircraft to achieve the feat since the British-French supersonic airliner, which was retired in 2003. The XB-1 broke the sound barrier for the first time over the Mojave Desert in California. During the test flight, it reached an altitude of 35,000ft before accelerating to Mach 1.1 (844mph) - 10% faster than the speed of sound. The jet, which was flown by Boom Supersonic's chief test pilot Tristan \"Geppetto\" Brandenburg, went on to reach Mach 1.1 two more times. A live stream showed the test flight as it happened. Denver-based Boom Supersonic hopes the XB-1 will pave the way for the development of Overture, the company's supersonic commercial airliner. The XB-1 is around 63ft-long, around one-third the size of Overture, which is intended to seat between 64 and 80 passengers and travel at speeds of up to Mach 1.7. Such speeds would be around twice as fast as subsonic passenger jets, but still slightly slower than the Concorde. The Overture has already been pre-ordered 130 times by companies such as American Airlines, United Airlines, and Japan Airlines. Read more from Sky News:Leicester City owner's helicopter crash was accidental - inquestIran says Hamas will come back strongerDoomsday Clock moved closer to midnight What happened to Concorde? Concorde was a British-French supersonic airliner which predominantly flew routes between New York and London or Paris. It could accelerate up to around Mach 2 (1,354mph) - more than twice the speed of sound - and carried around 100 passengers. In July 2000 an Air France Concorde crashed shortly after take-off, killing all 109 on board and four people on the ground. It also led to the fleet being grounded for a year. Maintenance issues, high operational costs and the impact of the 9/11 attacks on air travel led British Airways and Air France to retire the Concorde in 2003."
    },
    {
        "title": "Hotter, drier, faster, stronger: The role climate change did - and did not - play in the California wildfires",
        "description": "Climate change did not ignite the recent blazes that engulfed swathes of Los Angeles this month. But it did make them worse in at least one key way, a rapid analysis has found. \n",
        "url": "https://news.sky.com/story/hotter-drier-faster-stronger-the-role-climate-change-did-and-did-not-play-in-the-california-wildfires-13298161",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-california-los-angeles_6798551.jpg?20250114043648",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-01-28 11:49:00",
        "Headline": "Climate change did not cause the Los Angeles wildfires, nor the now infamous Santa Ana winds. But its fingerprints were all over the recent disaster, says a large new study from World Weather Attribution.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Climate change did not ignite the recent blazes that engulfed swathes of Los Angeles this month. But it did make them worse in at least one key way, a rapid analysis has found. \n The fires that erupted on 7 January astounded officials as they ballooned in size in mere hours, torching famous neighbourhoods, forcing 190,000 people to evacuate and taking 28 lives. President Donald Trump has been engaged in a spat with state governor and political foe Gavin Newsom about who is to blame for the fires before the two had an apparently amicable meeting on Friday. The early sparks were fanned into infernos by the now infamous Santa Ana winds - hot, dry winds most common in winter, which reached 99mph. Scientists do not yet understand if climate change disrupts these parching winds. But global warming made the hot and dry conditions that drove the ferocious fires about 35% more likely and 6% more intense, a global network of 32 scientists at World Weather Attribution (WWA) said today. The world is already on average 1.3C hotter than before humans started burning fossil fuels at scale. Around Los Angeles, the hotter air dried out the shrubby vegetation in the area called chaparral, turning it into tinderbox material that feeds a fast-moving fire. \n                  Trump threatens to 'get rid' of emergency agency FEMA as he tours disaster areas\n                 \n                  Day 6: What is Trump really trying to say?\n                 \n                  California wildfires: More than 30,000 flee as fire erupts north of Los Angeles\n                 They also found the fire season, with highly flammable drought conditions, in Los Angeles lasts 23 days longer per year, and that low rainfall between October and December is more than twice as likely. While climate change influenced these two trends, they cannot yet quantify the extent, due to the complex local geography and a lack of data, they said. Dr Clair Barnes from WWA and Imperial College London said: \"Drought conditions are more frequently pushing into winter, increasing the chance a fire will break out during strong Santa Ana winds that can turn small ignitions into deadly infernos. \"Without a faster transition away from planet-heating fossil fuels, California will continue to get hotter, drier, and more flammable.\" John Abatzoglou, professor of climatology at the University of California Merced, who also worked on the study, said: \"This was a perfect storm of climate-enabled and weather-driven fires impacting the built environment.\" The 'fundamental solution' to preventing more fires Last week, President Trump threatened to block federal disaster funding for Los Angeles unless governor Gavin Newsom enforced voter ID and made changes to the city's water management. Mr Trump, who last week ripped up scores of environmental rules, has repeated spurious claims that the conservation programme for a tiny fish caused the fire hydrants to run dry. The scientists called for an overhaul of water infrastructure, which is designed for more routine, structural fires, but now needs to handle intense continuous needs of a fast-moving wildfire.  They also pointed the finger at other policies that had nothing to do with climate change, including housing being built in fire-prone areas. Governor Newsom has commissioned an independent investigation into the loss of water pressure to hydrants. Patrick Gonzalez, a climate change scientist and forest ecologist at California's Berkley University, who was not involved with the study, said: \"Most importantly, the fundamental solution to prevent catastrophic wildfires is cutting the carbon pollution from cars, power plants, and other human sources that causes climate change.\" 'Take this seriously' The researchers reached their findings by comparing a computer simulation of the conditions with a simulation of the climate had it not been warmed by humans, and drawing on existing research. It follows previous studies from the University of California, Los Angeles (UCLA) that found climate change was to blame for about a quarter of the fuel available for the fires. The quick analysis has not been formally peer-reviewed, as it would have to be to get published in a scientific journal, but uses peer-reviewed methods. Dr Gonzalez said it is \"consistent with published research showing that human-caused climate change has intensified the heat that drives wildfire\". Prof Gabi Hegerl, a climate scientist from Edinburgh University who was not involved with the study, called it a \"carefully researched result that should be taken seriously\"."
    },
    {
        "title": "Doomsday Clock moved closer to midnight: What is it and how does it work?",
        "description": "The Doomsday Clock has been moved closer to midnight than ever before - symbolising that we are edging towards a global catastrophe.",
        "url": "https://news.sky.com/story/doomsday-clock-moves-closer-to-midnight-what-does-it-mean-12794884",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-doomsday-clock_6812864.jpg?20250128160811",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-28 14:00:00",
        "Headline": "The Doomsday Clock is now at 89 seconds to midnight. Sky News looks at the meaning behind it, what it is and how it works.",
        "Content": "The Doomsday Clock has been moved closer to midnight than ever before - symbolising that we are edging towards a global catastrophe. The clock's new time of 89 seconds to midnight was announced on 28 January, moving one second closer than where it had remained for the previous two years. But what does it actually mean? A metaphor for the dangers facing humanity, the clock is updated based on perceptions about how close humans are to destroying the world - with midnight symbolising that point. The countdown is agreed on by experts at the Bulletin of the Atomic Scientists. What is the Doomsday Clock and how is it set? The Bulletin of the Atomic Scientists first launched the initiative in response to the threat of nuclear war in the 1940s. After the US dropped atomic bombs on Hiroshima and Nagasaki at the end of the Second World War, members of the Bulletin saw a need to help the public understand the scale of the nuclear threat to the existence of humanity. To this day, the Bulletin's science and security board, made up of nuclear and climate experts, set the time for the clock. The board has done this since 1973, when it took over from Eugene Rabinowitch, Bulletin editor and disarmament campaigner. The clock moves closer to or further away from midnight based on how the experts on the board, plus academic colleagues and the Bulletin's sponsors - which include 13 Nobel laureates - read the threats facing the world. Why are scientists changing the time? In 2023 the clock moved forward to 90 seconds due to the \"mounting dangers of the war in Ukraine\". It was the first time the time had changed since 2020, when it was at 100 seconds. Experts said the increase in nuclear threat, political tensions, climate change and illnesses made 2023 a \"time of unprecedented danger\". It stayed the same upon review the following year, when scientists said there was a \"continuing unprecedented level of risk\" from threats including war, the climate crisis and the \"dramatic advance\" of AI. Now, the scientists say the shift from 90 to 89 seconds to midnight should serve as \"a warning to all world leaders\". Daniel Holz, chair of the Bulletin's Science and Security Board, said: \"The factors shaping this year's decision - nuclear risk, climate change, the potential misuse of advances in biological science and a variety of other emerging technologies such as artificial intelligence - were not new in 2024. \"But we have seen insufficient progress in addressing the key challenges, and in many cases this is leading to increasingly negative and worrisome effects. \"Setting the Doomsday Clock at 89 seconds to midnight is a warning to all world leaders. \"The war in Ukraine continues to loom as a large source of nuclear risk. That conflict could escalate to include nuclear weapons at any moment due to a rash decision or through accident and miscalculation.\" The warning comes after Russian president Vladimir Putin lowered his threshold for a nuclear strike in November last year, in what experts considered a thinly veiled warning to the West. \"Russian aggression in Ukraine, including repeated use of nuclear threats since the war began, has been disturbing,\" Mr Holz said. \"In addition, Russia's recent backtracking from important arms control treaties is an alarming sign of increasing nuclear risk.\" The scientist added that despite the current ceasefire between Israel and Hamas in Gaza, \"tensions in the Middle East including with Iran are still dangerously unstable\", and warned other \"potential hotspots\" like Taiwan and North Korea could cause \"unpredictable and potentially devastating outcomes\" through nuclear attacks. AI 'adding to dysfunction' Mr Holz highlighted two major AI threats. The first was its use on the battlefield, which he said is currently \"tentative but worrisome\" as it may start being applied to nuclear weapons. The second, he said, was its risk to global security. \"AI is increasingly disrupting the world's information ecosystem,\" he added. \"AI-fueled disinformation and misinformation will only add to this dysfunction.\" Finally, the scientists cited global warming, with last year being the hottest in recorded history, and the last 10 years being the hottest decade on record, according to scientists at the UN World Meteorological Organisation. \"While there has been impressive growth in wind and solar energy, the world is still falling short of what is necessary to prevent the worse aspects of climate change,\" Mr Holz said. The Doomsday Clock's history When it first began in 1947, the clock was set at seven minutes to midnight. Artist Martyl Langsdorf came up with the idea of the clock and set the time to symbolise the dangers of nuclear confrontation, on the front cover of the Bulletin. Since then it has been ticking away as political, nuclear and climate changes continued over the years, with experts revising the time up and down - mostly closer to midnight and its metaphor for total disaster. There have been more reassuring years, though. In 1995 the clock was at 14 minutes to midnight, the safest reading in its history. And there were \"positive strides\" in some years, such as the Paris climate agreement. Ever since 1998, however, the hands of the clock have been at less than 10 minutes to midnight. In 2020, scientists moved the hands of the clock forward to 100 seconds to midnight after the breakout of COVID-19."
    },
    {
        "title": "Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry",
        "description": "Donald Trump thinks the&#160;Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms.",
        "url": "https://news.sky.com/story/donald-trump-warns-deepseek-should-be-wakeup-call-for-americas-ai-industry-13298001",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-miami_6812409.jpg?20250128033243",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-28 01:51:00",
        "Headline": "The US president wants US tech companies to dominate artificial intelligence but acknowledges the challenge posed by the low-cost rival, DeepSeek.",
        "Content": " Donald Trump thinks the Chinese startup DeepSeek, which claims it has a technical advantage over US rivals, should be \"a wakeup call\" for American AI firms. DeepSeek says its artificial intelligence models are comparable with those from US giants, like OpenAI which is behind ChatGPT and Google's Gemini, but potentially a fraction of the cost. That has triggered a fall in various US shares, especially leading AI chipmaker Nvidia which registered a record one-day loss for any company on Wall Street during trading on Monday. Its shares recovered some poise on Tuesday, rising more than 7%, as the shock died down and the US president spoke of his belief that the success of the Chinese firm could be helpful to America's AI aspirations. \"The release of DeepSeek, AI from a Chinese company should be a wakeup call for our industries that we need to be laser-focused on competing to win,\" Mr Trump said in Florida. He pointed to DeepSeek's ability to use fewer computing resources. \"I view that as a positive, as an asset... you won't be spending as much, and you'll get the same result, hopefully,\" he added. On Monday, the DeepSeek assistant had surpassed ChatGPT in downloads from Apple's app store. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 OpenAI CEO Sam Altman has given his rival some acknowledgement in a post on X, reacting to DeepSeek's R1 \"reasoning\" model - a core part of the AI technology which answers questions. \"DeepSeek's r1 is an impressive model, particularly around what they're able to deliver for the price,\" he wrote. But Mr Altman was also defiant: \"We will obviously deliver much better models and also it's legit invigorating to have a new competitor! we will pull up some releases.\" DeepSeek is a startup founded in 2023 in Hangzhou, China. Its CEO Liang Wenfeng previously co-founded one of China's top hedge funds, High-Flyer, which focuses on AI-driven quantitative trading. By 2022, it had created a cluster of 10,000 of Nvidia's high-performance chips which are used to build and run AI systems. The US then restricted sales of those chips to China.  DeepSeek said recent AI models were built with Nvidia’s lower-performing chips, which are not banned in China - suggesting cutting-edge technology might not be critical for AI development. In January 2024 it released R1, a new AI model which it claimed was on par with similar models from US companies, but is cheaper to use depending on the task.\n Since DeepSeek's chatbot became available as a mobile app it has surpassed rival ChatGPT in downloads from Apple's app store.\n There have been concerns DeepSeek could undermine the potentially $500bn (£401bn) AI investment by OpenAI, Oracle and SoftBank in Stargate which Mr Trump announced last week at the White House. That project essentially aims to build vastly more computing power to boost AI development. But while addressing Republicans in Miami on Monday, Mr Trump remained upbeat. He claimed that Chinese leaders had told him the US had the most brilliant scientists in the world. 👉 Follow Trump 100 on your podcast app 👈 Read more:AI now a contest between superpowersPM: AI changing 'quicker than we think' He indicated that if Chinese industry could come up with cheaper AI technology, US companies would follow. \"We always have the ideas. We're always first. So I would say that's a positive that could be very much a positive development. \"So instead of spending billions and billions, you'll spend less, and you'll come up with, hopefully, the same solution,\" Mr Trump said. The intense attention on the Chinese firm has not all been good news though. It reported suffering \"large-scale malicious attacks\" on its services. The company said it was hit by a cyber attack on Monday which disrupted users' ability to register on the site."
    },
    {
        "title": "How Chinese DeepSeek can be as good as US AI rivals at fraction of cost",
        "description": "Based on the limited numbers of comparisons made so far, DeepSeek's AI models appear to be faster, smaller, and a whole lot cheaper than the best offerings from the supposed titans of AI like OpenAI, Anthropic and Google.",
        "url": "https://news.sky.com/story/how-chinese-deepseek-can-be-as-good-as-us-ai-rivals-at-fraction-of-cost-13298062",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-us-stock-china_6812967.jpg?20250128182753",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-01-28 08:52:00",
        "Headline": "The faster and smaller model's engineers seem to have thought about what AI needs to do - not what it might be able to do.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Based on the limited numbers of comparisons made so far, DeepSeek's AI models appear to be faster, smaller, and a whole lot cheaper than the best offerings from the supposed titans of AI like OpenAI, Anthropic and Google. And here's the kicker, the Chinese offering appears to be just as good. So how have they done it? Firstly, it looks like DeepSeek's engineers have thought about what an AI needs to do rather than what it might be able to do. It doesn't need to work out every possible answer to a question, just the best one - to two decimal places for example instead of 20. Their models are still massive computer programmes, DeepSeek-V3 has 671 billion variables. But ChatGPT-4 is a colossal 1.76 trillion. Doing more with less seems to be down to the architecture of the model, which uses a technique called \"mixture of experts\". Where OpenAI's latest model GPT-4.0 attempts to be Einstein, Shakespeare and Picasso rolled into one, DeepSeek's is more like a university broken up into expert departments. This allows the AI to decide what kind of query it's being asked, and then send it to a particular part of its digital brain to be dealt with.  This allows the other parts to remain switched off, saving time, energy and most importantly the need for computing power. And it's the equivalent performance with significantly less computing power, that has shocked the big AI developers and financial markets. The state-of-the-art AI models had been developed using more and more powerful graphics processing units (GPUs) made by the likes of Nvidia in the US. Read more:AI no longer contest between Californian tech brosDeepSeek 'wakeup call' for US, says Trump The only way to improve them, so the market logic went, was more and more \"compute\". Partly to stay ahead of China in the AI arms-race, the US restricted the sale of the most powerful GPUs to China. What DeepSeek's engineers have demonstrated is what engineers do when you present them with a problem. They come up with a workaround. Learning from what OpenAI and others have done, they redesigned a model from the ground up so that it could work on GPUs designed for computer games not superintelligence. What's more, their model is open source meaning it will be easier for developers to incorporate into their products. Being far more efficient, and open source makes DeepSeek's approach look like a far more attractive offering for everyday AI applications. The result, of course, a nearly $600bn overnight haircut for Nvidia. But it will survive its sudden reverse in fortunes. The LLM-type (large language model) models pioneered by OpenAI and now improved by DeepSeek aren't the be-all and end-all in AI development. \"General intelligence\" from an AI is still a way off - and lots of high end computing will likely be needed to get us there. The fate of firms like OpenAI is less certain. Their supposedly game-changing GPT-5 model, requiring mind-blowing amounts of computing power to function, is still to emerge. Now the game appears to have changed around them and many are clearly wondering what return they're going to get on their AI investment."
    },
    {
        "title": "What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down",
        "description": "The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot.",
        "url": "https://news.sky.com/story/what-is-deepseek-the-low-cost-chinese-ai-firm-that-has-turned-the-tech-world-upside-down-13298039",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-deepseek-app_6812411.jpg?20250128034509",
        "type": "Technology",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-01-28 07:10:00",
        "Headline": "DeepSeek has turned the tech world upside down as the tiny Chinese company has come up with AI chatbots using just a fraction of the cost of the major players in the industry.",
        "Content": "By Claire Gilbody Dickerson, news reporter  The arrival of a previously little-known Chinese tech company has attracted global attention as it sent shockwaves through Wall Street with a new AI chatbot. On Monday, DeepSeek, a tiny company which reportedly employs no more than 200 people, caused American chipmaker Nvidia to have almost $600bn wiped off its market value - the biggest drop in US stock market history. The Chinese AI chatbot threatens the billions of dollars invested in AI while causing US tech stocks to lose well over $1trn (£802bn) in value, according to market analysts. DeepSeek, which has developed two models, V3 and R1, is now the most popular free application on Apple's App Store across the US and UK. What's DeepSeek? The startup was founded in 2023 in Hangzhou, China, by Liang Wenfeng, who previously co-founded one of China's top hedge funds, High-Flyer. The fund had by 2022 amassed a cluster of 10,000 of California-based Nvidia's high-performance A100 graphics processor chips that are used to build and run AI systems, according to a post that summer on Chinese social media platform WeChat. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Former US President Joe Biden's administration restricted sales of those chips to China soon after, something likely to be pursued by his successor, Donald Trump, who was recently sworn in for a second term in the White House.  Why all the attention now?  The hype - and market turmoil - over DeepSeek follows a research paper published last week about the R1 model, which showed advanced \"reasoning\" skills. They include the ability to rethink its approach to a math problem while, depending on the task, being 20 to 50 times cheaper to use than OpenAI's o1 model, according to a post on DeepSeek's official WeChat account. That's why there are fears it could undermine the potentially $500bn AI investment by OpenAI, Oracle and SoftBank that Mr Trump has touted. What's so cool about it?  As Morgan Brown, vice president of product and growth in artificial intelligence at Dropbox, put it, it is currently \"insanely expensive\" to train top AI models. \"DeepSeek just showed up and said 'LOL what if we did this for $5M instead?' \"And they didn't just talk - they actually DID it. Their models match or beat GPT-4 and Claude on many tasks. The AI world is (as my teenagers say) shook,\" he said in a post on X. So how much did it cost? The company wrote in a paper last month that the training of DeepSeek-V3 required less than $6m (£5m) worth of computing power from Nvidia H800 chips. How has President Trump responded?  Speaking to House Republicans on Monday, the 78-year-old Republican called the development a \"wakeup call for our industries that we need to be laser-focused on competing to win\". But Mr Trump signed an order on his first day in office last week that said his administration would \"identify and eliminate loopholes in existing export controls\", signalling that he is likely to strengthen Mr Biden's approach. Read more from Sky News:What are the 'UFO clouds' seen hanging over UK skies?What are the UK's knife crime laws? Venture capitalist Marc Andreessen, who has advised Mr Trump on tech policy, has warned overregulation of the AI industry by the US government will hinder American companies and enable China to get ahead. \"Deepseek R1 is AI's Sputnik moment,\" said Mr Andreessen in a recent post on X, referencing the 1957 satellite launch that set off a Cold War space exploration race between the Soviet Union and the US. What are the concerns? Some people expressed their reservations about the Chinese company and its handling of users' data. Bill Ackman described DeepSeek as \"a Trojan Horse\" and said, TikTok, which was temporarily banned in the US earlier this month over national security concerns, \"is just a toy by comparison\". Sky News has reached out to DeepSeek for comment. UK Prime Minister Sir Keir Starmer's spokesman said on Tuesday he would not \"get ahead of specific models\" when asked whether he would rule out using Chinese AI in Whitehall. But Dr Lukasz Olejnik, independent researcher and consultant, affiliated with King's College London Institute for AI, claims the way the app is designed provides for \"perfect data privacy\". He told Sky News: \"What truly sets DeepSeek apart is its accessibility thanks to open-weight models. \"Unlike centralised models, its open-source versions can be run locally, providing perfect data privacy. \"Organisations are already deploying full models internally, ensuring complete control over sensitive information. \"This is much better than AI tools served on remote servers.\" Too controversial? People have also been flagging how, when it comes to questions about alleged wrongdoing and human rights abuses at the hands of the Chinese government, the app seems unable to respond. Seemingly controversial topics include Taiwan, which China claims as its own, the 1989 Tiananmen Square protests and massacre as well as China's treatment of its Uyghur population, which the UN has previously said \"may constitute crimes against humanity\"."
    },
    {
        "title": "UK warned about risk of 'storm clustering' after Eowyn caused widespread damage and disruption",
        "description": "People across the UK have been warned about the risk of \"storm clustering\" in the weeks ahead - after Storm Eowyn caused widespread disruption and damage.",
        "url": "https://news.sky.com/story/uk-warned-about-risk-of-storm-clustering-after-eowyn-caused-widespread-damage-and-disruption-13298242",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-denny-falkirk-storm-eowyn_6810538.jpg?20250125175421",
        "type": "Technology",
        "Author": "Jo Robinson",
        "Date Published": "2025-01-28 13:24:00",
        "Headline": "The Met Office's three-month summary outlook says there is a \"greater risk\" of several storms arriving over a short space of time - leading to increased impacts compared to them arriving in isolation.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n People across the UK have been warned about the risk of \"storm clustering\" in the weeks ahead - after Storm Eowyn caused widespread disruption and damage. Eowyn, the fifth named storm of the season, broke records last week with wind gusts reaching 114mph in Ireland and 100mph in Scotland. It was closely followed by Storm Herminia, named by the Spanish meteorological department, which hampered recovery efforts. Further disruption is possible in the weeks ahead, as the Met Office's three-month summary outlook that is issued to contingency planners suggests a greater chance of windy or stormy weather compared to average, especially for February and March. They also say the \"increased chance of storms gives rise to greater risk of storm clustering\". This refers to when several storms arrive over a short space of time, leading to increased impacts compared to the storms arriving in isolation. A memorable example of storm clustering was when named storms Dudley, Eunice and Franklin arrived over just one week, back in February 2022. \n                  'Europe's Silicon Valley' at heart of government's growth plans, Rachel Reeves to announce\n                 \n                  Big economy speech will take no immediate pressure off Rachel Reeves\n                 \n                  Glasgow mum who lost leg in Clydebank BMW hit-and-run crash settles £1m legal action against driver\n                 Strong winds from Franklin hampered clean-up operations following Eunice, which had left over a million homes without power and brought down trees across parts of England and Wales. Studies have shown that most clustering events for the UK occur when the jet stream - a ribbon of fast-moving air high above the Earth's surface - is powerful and straight. Whether storm clustering happens or not, the forecast raises concerns the country could be set for a wild end to the storm season. But the UK would need another seven named storms to match last year's greatest number since the naming convention started back in 2015. Read more:As it happened: Storm Eowyn hammers UKIreland counts cost of Storm Eowyn What is the weather expected to be like going into February? There will be some respite in the weather from the middle of this week after Storm Eowyn brought disruption to flights, rail services and hospitals. However, as the UK heads into February - the last month of the meteorological winter - long-range computer models suggest a return to unsettled conditions.  Wet and windy weather is likely during the first part of the month, especially in the North and West. The Met Office has said \"stormy conditions, and impacts from high winds, are more likely than normal\" when looking at February. Southern parts should see higher pressure, with a chance of something more widely settled for the second half of the month. Temperatures are likely to be above average."
    },
    {
        "title": "'Super-Earth' planet found 20 light years away could be able to host life",
        "description": "A \"super-Earth\" planet found outside of our solar system could have conditions suitable for life, according to experts at the University of Oxford.",
        "url": "https://news.sky.com/story/super-earth-planet-found-20-light-years-away-could-be-able-to-host-life-13298280",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-exoplanet-life-space_6812752.jpg?20250128144918",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-28 14:00:00",
        "Headline": "Found by Dr Michael Cretignier of the University of Oxford, the planet has a mass six times greater than Earth's and orbits in a \"habitable zone\" of a star similar to the sun.",
        "Content": "A \"super-Earth\" planet found outside of our solar system could have conditions suitable for life, according to experts at the University of Oxford. Researchers said the planet has a mass six times greater than our Earth's and orbits in a \"habitable zone\" of a star similar to the sun. While located 20 light-years away, scientists believe the planet - named HD 20794 d - could be at the right distance from its star to sustain water on its surface.   Dr Michael Cretignier, postdoctoral research assistant at the university's physics department, said: \"Excitingly, its proximity with us means there is hope for future space missions to obtain an image of it.\" However, because HD 20794 d orbits in an elliptical way, rather than circular like the Earth, it is unclear whether it would be able to host life. It was first identified by Dr Cretignier in 2022 after he found a possible signal while analysing archived data recorded by the High Accuracy Radial Velocity Planet Searcher spectrograph at the La Silla Observatory in Chile. An international team of researchers then analysed two decades of observations to confirm the discovery of HD 20794 d. Read more:Icy craters and sunlit plains seen on PlutoNASA's stuck astronaut steps out for spacewalk \"For me, it was naturally a huge joy when we could confirm the planet's existence,\" Dr Cretignier said. \"It was also a relief, since the original signal was at the edge of the spectrograph's detection limit, so it was hard to be completely convinced at that time if the signal was real or not.\" He added the planet \"could play a pivotal role in future missions\" hoping to \"search for biosignatures indicating potential life\" on planets far away from our own. \"I'm now very enthusiastic to hear what other scientists can tell us about this newly discovered planet, particularly since it is among the closest Earth-analogues we know about and given its peculiar orbit,\" he said. The findings were published in the journal Astronomy & Astrophysics."
    },
    {
        "title": "66 million-year-old vomit fossil discovered in Denmark",
        "description": "A 66 million-year-old vomit fossil has been discovered in Denmark.",
        "url": "https://news.sky.com/story/66-million-year-old-vomit-fossil-discovered-in-denmark-13298091",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-vomit-fossil-history_6812532.png?20250128095337",
        "type": "Technology",
        "Author": "Kieren Williams",
        "Date Published": "2025-01-28 09:43:00",
        "Headline": "Fossil hunter Peter Bennicke found the fossilised vomit after splitting open a piece of chalk.",
        "Content": "\n          News Reporter\n              @kjjjwilliams\n A 66 million-year-old vomit fossil has been discovered in Denmark. Found along the Stevns Klint coastal cliff, the fossil is regurgitated lumps of sea lily - a type of marine invertebrate. They were eaten during the Cretaceous period tens of millions of years ago. Fossil hunter Peter Bennicke made the discovery after splitting open a piece of chalk.  He brought the fossil to a local museum where it was cleaned up and examined by experts. It was there John Jagt concluded the remains were sea lilies that had been eaten by an animal which then threw up the indigestible parts. Such discoveries are invaluable to scientists because they offer a window into ancient ecosystems and reveal what predators ate and how food chains functioned millions of years ago. The find was named Danekrae DK-1295 - Danekrae are rare natural treasures of Denmark. Museum curator at Geomuseum Faxe and member of the Danish Wildlife Committee Jesper Milan told Sky News it was difficult to tell exactly which animal had thrown up the remains. But he said it was likely from something that specialised in eating things with hard shells, such as a fish or a bottom-dwelling shark. He added: \"We have found teeth from sharks that were specialised in crushing hard-shelled prey in the same area. \"They are called Heterodontus, it's a relative of the modern Port Jackson shark. That one is high on my list of suspects.\" Read more from Sky News:Search for missing sisters endsMan charged with murder of university lecturerEx-football referee sorry over 'cocaine video' Mr Milan continued: \"It is truly an unusual find. \"Sea lilies are not a particularly nutritious diet, as they mainly consist of calcareous plates held together by very few soft parts. \"But here is an animal, probably a type of fish, that 66 million years ago ate sea lilies that lived on the bottom of the Cretaceous sea and regurgitated the skeletal parts back up. \"Such a find provides important new knowledge about the relationship between predators and prey and the food chains in the Cretaceous sea.\" The vomit fossil will be displayed in a special exhibition at the Geomuseum Faxe."
    },
    {
        "title": "Amazon chooses Darlington for launch of drone delivery service",
        "description": "Amazon plans to begin launching drone deliveries in the UK as part of a trial.",
        "url": "https://news.sky.com/story/amazon-chooses-darlington-for-launch-of-drone-delivery-service-13298124",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-amazon-drone-deliveries_6812550.jpg?20250128104748",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-28 10:22:00",
        "Headline": "The US tech giant wants to roll out its Prime Air service from the Teesside town of Darlington, subject to planning permission and clearance for flights.",
        "Content": "Amazon plans to begin launching drone deliveries in the UK as part of a trial. The US tech giant said the drone service, called Prime Air, is already operating in two locations in the US, delivering packages in 60 minutes or less using a fleet of Amazon-designed, built and operated drones. The company said it was submitting a planning application to build drone flight operations at its fulfilment centre on the outskirts of Darlington, and was seeking clearance from the Civil Aviation Authority (CAA) for the flights. Amazon said it was \"ready and excited to make drone delivery a reality for our UK customers,\" starting from the Teesside town of Darlington. \"We have built safe and reliable drone delivery services elsewhere in the world in close partnership with regulators and the communities we serve, and we are working to do the same in the UK,\" a spokesperson said. \"We are announcing that Prime Air is taking steps to start planning for initial flights from our fulfilment centre in Darlington. \"While there is still much work to do, this is an exciting step forward.\" The company said once it had planning permission and CAA clearance, it would begin hiring employees to launch drone delivery. It also pledged to engage with the local community for feedback, and will hold a community event at the start of next month. Read more:How DeepSeek can be as good as US AI rivals at fraction of costTrump warns Chinese DeepSeek should be 'wakeup call' for US AI tech firms Tees Valley mayor Ben Houchen said he had worked closely with Amazon and Teesside International Airport over the past 18 months on the project. \"I am delighted that Teesside will become home to Amazon's first UK drone delivery service,\" he said. \"In Teesside, we do things differently. We say yes when others say it's too difficult. We are positive, ambitious, and we deliver. \"We are grabbing the opportunities and the optimism of the tech revolution - so it's no surprise that Amazon has chosen Darlington as the location to launch Prime Air in the UK. \"We have worked tirelessly with Amazon to bring this UK first to Teesside which will support high-quality jobs, deliver vital multi-million-pound investment in our local economy and drive growth across Teesside, Darlington and Hartlepool. \"The world is moving at pace - and if we don't keep up, we will be left behind. If you're not first, you're last.\" Amazon has been developing drone delivery systems for a number of years and has previously tested drone deliveries in the UK, making the first autonomous Prime Air delivery in Cambridgeshire in 2016 during a trial."
    },
    {
        "title": "Blake Lively and Justin Baldoni could go to trial over It Ends With Us allegations",
        "description": "A trial date has been set for Blake Lively and her It Ends With Us co-star and director Justin Baldoni.",
        "url": "https://news.sky.com/story/blake-lively-and-justin-baldoni-could-go-to-trial-over-it-ends-with-us-allegations-13298235",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-blake-lively-justin-baldoni_6812611.jpg?20250128134249",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 13:14:00",
        "Headline": "Blake Lively and her It Ends With Us co-star and director Justin Baldoni have filed lawsuits against each other. She has accused him of sexual harassment and planning to damage her reputation, while he alleges she is attempting to smear his name.",
        "Content": "A trial date has been set for Blake Lively and her It Ends With Us co-star and director Justin Baldoni. Both actors have filed lawsuits against each other following an initial legal complaint from Lively, who accused Baldoni of sexual harassment on the set of the film - and an alleged subsequent plan to damage her reputation. Baldoni then sued Lively and her husband Ryan Reynolds, accusing them of hijacking both the production and marketing of the film, as well as allegedly attempting to smear him and others who worked on the production through false allegations. It Ends With Us is an adaptation of best-selling US author Colleen Hoover's 2016 novel, which begins as a romance but takes a dark turn into domestic violence. The film exceeded box office expectations following its release in August, but was overshadowed by online speculation of a fall-out between the two co-stars, who were not pictured together at the film's premiere. Neither did they do interviews together during promotion. New York federal judge Lewis J Liman has now set a trial date for March 2026. It comes after Lively's legal team claimed in a filing on Monday that a lawyer for Baldoni was trying to influence potential jurors by creating a website to release selected documents and communications between the pair. \"The endless stream of defamatory and extrajudicial media statements must end,\" Lively's lawyers said.  Bryan Freedman, who is representing Baldoni, said in a statement in response that they would \"respect the court\", but added: \"All we want is for people to see the actual text messages that directly contradict her allegations, video footage that clearly shows there was no sexual harassment and all the other powerful evidence that directly contradicts any false allegations.\" Meanwhile in Texas, in a separate filing - a precursor to another potential lawsuit - Lively has asked for an order for a deposition for a crisis management specialist she claims was behind much of the alleged social media manipulation surrounding the film that turned public sentiment against her. How the legal case unfolded In late December, Lively sued Baldoni, his production company and others in New York for sexual harassment and attacks on her reputation, asking for unspecified damages. Baldoni filed his lawsuit earlier this month, accusing Lively and her husband, Deadpool star and Wrexham FC co-owner Reynolds, of defamation and extortion. He is seeking at least $400m (£321m) in damages. The judge said on Monday that he will likely combine the lawsuits for trial. Earlier in January, Baldoni also sued The New York Times newspaper for libel after it published allegations about him. Lively starred in the 2005 film The Sisterhood Of The Traveling Pants before rising to fame in the TV series Gossip Girl from 2007 to 2012. She is also known for films including The Town and The Shallows. Baldoni is known for the TV comedy series Jane The Virgin and for directing the 2019 film Five Feet Apart. He also wrote Man Enough - a book pushing back against traditional notions of masculinity."
    },
    {
        "title": "Strictly star Wynne Evans leaves live tour to 'prioritise his wellbeing'",
        "description": "Strictly Come Dancing star Wynne Evans has left the show's live tour after agreeing with the BBC to \"take some time out\" to prioritise his \"wellbeing\". ",
        "url": "https://news.sky.com/story/strictly-star-wynne-evans-leaves-live-tour-to-prioritise-his-wellbeing-13298141",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wynne-evans-strictly-come-dancing_6812560.jpg?20250128112627",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 11:06:00",
        "Headline": "The Welsh opera singer issued an apology on Sunday after being heard making a remark to a woman in a video filmed during the launch event for the tour on 16 January.",
        "Content": "Strictly Come Dancing star Wynne Evans has left the show's live tour after agreeing with the BBC to \"take some time out\" to prioritise his \"wellbeing\".  It comes after the 53-year-old Welsh opera singer, who is famous for his role in the GoCompare insurance adverts, apologised for an \"inappropriate and unacceptable\" remark he made during the launch event for the shows. He said: \"I've agreed with the BBC that I'll take some time out from my radio show and the Strictly Live tour, as well as my other public commitments, to prioritise my wellbeing. \"I am deeply sorry for the pain my inappropriate actions have caused, and plan to take this time for self-reflection. \"Apologies to those I won't get to see at the remaining performances and I'm grateful to my fellow tour gang for all the amazing support they have given me.\" The tour started on 17 January and Evans had been performing with Katya Jones, his dance partner during the BBC TV series last year. He missed shows in Glasgow on Saturday and Sunday, saying this was due to an ankle injury and sharing images of his bruises in an Instagram story. Evans then issued an apology on Sunday after being heard making a remark to a woman in a video filmed during the launch event for the tour on 16 January, the Mail On Sunday first reported. \"My language was inappropriate and unacceptable for which I sincerely apologise,\" he said in a statement. The Strictly live tour now continues without him with 12 dates left, including shows in Liverpool tonight and tomorrow. Evans is also taking time off from presenting his weekday morning show on BBC Radio Wales. Broadcaster Robin Morgan sat in for him on Monday and will continue to present during his absence, PA understands. BBC Wales said it had nothing further to add to Evans's statement. Apology over 'joke' In October, Evans and Jones apologised for a \"joke\" after viewers saw the female dance professional moving his hand from her waist during an episode of the show. Jones also appeared not to want to high-five her celebrity partner, but the pair called this \"a running joke\". Strictly introduced chaperones \"at all times\" during rehearsals for the 2024 series."
    },
    {
        "title": "Selena Gomez breaks down in tears over Trump's deportations as immigration raids ramp up",
        "description": "Selena Gomez has deleted a video where she breaks down over Donald Trump's immigration crackdown after receiving backlash.",
        "url": "https://news.sky.com/story/selena-gomez-breaks-down-in-tears-over-donald-trumps-deportation-policies-13298152",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-selena-gomez-singer_6812487.jpg?20250128081238",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 11:38:00",
        "Headline": "The 32-year-old American singer and actress, who is of Mexican heritage, deleted the video and replaced it with a post reading: \"Apparently it's not ok to show empathy for people.\"",
        "Content": " Selena Gomez has deleted a video where she breaks down over Donald Trump's immigration crackdown after receiving backlash. The 32-year-old American singer and actress, who is of Mexican heritage, appeared to be reacting to Donald Trump's immigration crackdown. On the now deleted Instagram video on Monday, Gomez said through tears: \"I just want to say that I'm so sorry. All my people are getting attacked. \"The children. I don't understand. I'm so sorry I wish I could do something but I can't. \"I don't know what to do. I'll try everything, I promise.\" It came after Mr Trump signed 10 executive orders on immigration and issued a slew of edicts to carry out promises of mass deportations and tightening border security. Some of the orders have had an immediate impact, with the Trump administration set to conduct major immigration raids in three US cities per week, according to Sky News' US partner NBC News. This week raids in Chicago began on Sunday, New York City began on Tuesday, and three officials said they are planning for the next operation in Aurora, Colorado on Thursday. Next week, three more cities will be targeted. In a meeting with Immigration and Customs Enforcement (ICE) senior leadership over the weekend, ICE's 25 field offices were told to enhance their \"routine operations\" by meeting a quota of between 1,200-1,500 arrests per day, the sources told NBC News. After receiving some backlash online, Ms Gomez replaced the video with a post on her Instagram story which read: \"Apparently it's not ok to show empathy for people.\" That post has now been deleted too. One of her critics was Republican US Senate candidate Sam Parker, who said she should \"be deported\" on X. Gomez appeared to respond on her Instagram story, writing: \"Oh Mr Parker, Mr Parker. Thanks for the laugh and the threat.\" Gomez recently starred in the Oscar-nominated Spanish-language musical Emilia Perez, playing one of four Mexican women involved with a cartel. Read more:Just Stop Oil protesters disrupt play starring Sigourney WeaverUS first lady Melania Trump's new portrait released The president has promised the biggest deportation in US history, and the White House shared images on Friday of men in shackles being taken on a military plane with the caption: \"Deportation flights have begun.\" The Trump administration has expanded arrest priorities to include anyone in the country illegally, not just people with criminal convictions, public safety or national security threats and migrants stopped at the border. While some of Mr Trump's orders are expected to take far longer to have an impact, they have generated fear in immigrant communities. There are about 4 million unauthorised Mexican migrants in the US, according to the Pew Research Center's 2022 research."
    },
    {
        "title": "Alec Baldwin shares first look at new reality TV series",
        "description": "Alec and Hilaria Baldwin have shared a first look into their life with the release of a trailer for their new reality show - which touches on the fatal Rust shooting.",
        "url": "https://news.sky.com/story/alec-baldwin-shares-first-look-at-new-reality-tv-series-13298066",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-alec-baldwin-hilaria-baldwin_6812539.jpg?20250128100812",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 09:00:00",
        "Headline": "Hollywood star Alec Baldwin was accused of involuntary manslaughter following the fatal shooting on the set of his western film Rust in 2021, but the case was thrown out mid-way through his trial. Now, he is starring in a reality series alongside his wife Hilaria and their seven children.",
        "Content": "Alec and Hilaria Baldwin have shared a first look into their life with the release of a trailer for their new reality show - which touches on the fatal Rust shooting. The couple, who married in 2012 and have seven children, star in The Baldwins, which is due to premiere in February. \"Seven children, six animals, two parents. Wild family,\" says Hilaria Baldwin in the teaser. Baldwin, who also has an older daughter, Ireland Baldwin, with his ex-wife Kim Basinger, is known for films including Beetlejuice, The Hunt For Red October, and Glengarry Glen Ross, as well as the comedy series 30 Rock and appearances playing Donald Trump on Saturday Night Live. The 66-year-old was accused of involuntary manslaughter following the fatal shooting of cinematographer Halyna Hutchins on the set of his western film Rust in 2021, but the case was thrown out by the judge mid-way through his trial in July last year. Earlier this month, the actor filed a lawsuit against prosecutors, alleging they intentionally concealed evidence that would have absolved him from blame and \"sought at every turn to scapegoat\" him. In the first trailer for The Baldwins, the star is emotional as he tells his wife: \"Honestly, from the bottom of my soul. I don't know where I would be if I didn't have you and these kids.\" \n                  Alec Baldwin files lawsuit against prosecutors in fatal Rust shooting case\n                 \n                  Appeal to bring manslaughter charge against Alec Baldwin over 2021 Rust shooting dropped by prosecutor\n                 \n                  Alec Baldwin's Rust premieres three years after fatal shooting - but cinematographer's mother refuses to attend\n                 Ms Hutchins died on the set of Rust after a Colt 45 that Baldwin was holding fired. He maintained he did not pull the trigger. Director Joel Souza was also injured. Earlier in the clip, Hilaria says of Ms Hutchins' death: \"A son lost his mom in the most unthinkable tragedy. This is never something to forget - and we are trying to parent through it.\" She later adds: \"We've had bad moments but we've found our foundation. We're solid and we're here together.\" Following the collapse of Baldwin's trial, Rust was eventually released in November last year. The film tells the story of a 13-year-old boy who, left to fend for himself and his younger brother following their parents' deaths in 1880s Wyoming, goes on the run with his long-estranged grandfather after being sentenced to hang for the accidental killing of a local rancher. The movie debuted at the Camerimage Festival in Poland, an event focusing on achievements in cinematography, to an audience of a few hundred - a more low-key affair than the typical fanfare of Hollywood releases. Baldwin did not attend the event, but Souza said before the screening that while it \"wasn't an easy decision by any means\" to continue the film after Ms Hutchins's death, \"it became important to me and important to her husband that people see her final work\". Rust's weapons supervisor Hannah Gutierrez-Reed received the maximum sentence of 18 months in prison after being convicted of involuntary manslaughter in April. She has filed an appeal against her conviction."
    },
    {
        "title": "Matthew Perry Foundation launches addiction medicine fellowship",
        "description": "The Matthew Perry Foundation has set up an addiction medicine training fellowship, 15 months after the former Friends star died of a ketamine overdose.",
        "url": "https://news.sky.com/story/matthew-perry-foundation-launches-addiction-medicine-fellowship-13298574",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-actor_6657881.jpg?20240816215818",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 20:46:00",
        "Headline": "Perry, who had been taking the drug six to eight times a day before he died, \"believed deeply in eliminating the stigma\" around addiction, the foundation said.",
        "Content": "The Matthew Perry Foundation has set up an addiction medicine training fellowship, 15 months after the former Friends star died of a ketamine overdose. Established with Massachusetts General Hospital (MGH), the Matthew Perry Foundation Fellowship in Addiction Medicine allows a doctor to join MGH's Addiction Medicine Fellowship for the 2025-26 academic year. Dr Sarah 'SK' Kler, a resident at MGH, will take up the role in June, tasked with studying addiction treatment and working toward providing addiction care in future work, the foundation said on Instagram on Tuesday. In a statement, the chair of the foundation's board Doug Chapin, and its executive director Lisa Kasteler Calio said Perry \"believed deeply in eliminating the stigma surrounding the disease of addiction, and with that in mind, we are proud to lend our name to this important work\". The Canadian-born actor, who had been taking ketamine six to eight times a day before he died, was found dead at his home in Los Angeles in October 2023. A medical examiner later ruled that ketamine was the primary cause of death. Dr Sarah Wakeman, the fellowship's programme director, warned against continuing to \"silo addiction care outside the rest of medical care\". \n                  Blake Lively and Justin Baldoni could go to trial over It Ends With Us allegations\n                 \n                  Strictly star Wynne Evans leaves live tour to 'prioritise his wellbeing'\n                 \n                  Selena Gomez breaks down in tears over Trump's deportations as immigration raids ramp up\n                 In comments posted on the hospital's website, she said marginalising addiction as a social problem outside of the domain of physicians \"will only exacerbate stigma and inequities and increase the deadly impact of this epidemic\".  Dr Wakeman called on the medical community to use \"effective, holistic, wraparound services across medical settings\" to help battle addiction. MGH \"will work in close collaboration with the Matthew Perry Foundation to raise awareness, reduce stigma, and, most importantly, offer hope to those of every age, background, and experience who are struggling with substance use disorder\", she said. Read more:Lively-Baldoni could go to trial'No protection' for BoyzoneGomez in tears over deportations In October 2024, Dr Mark Chavez, who had been charged in connection with Perry's death, pleaded guilty to a charge of conspiring to distribute ketamine. Chavez could face up to 10 years in prison when he is sentenced in April. Five people, including Chavez, have been charged in connection with Perry's death. The other four are his live-in assistant Kenneth Iwamasa, an acquaintance of the actor named Eric Fleming, another doctor named Salvador Plasencia, known as \"Dr P\", and Jasveen Sangha, who was referred to in documents as the \"Ketamine Queen\"."
    },
    {
        "title": "Ronan Keating on boyband fame in the 90s: 'Our duty of care meant nothing'",
        "description": "Ronan Keating says the members of Boyzone were \"unprotected\" and in \"a dangerous space\" when they were propelled to fame over 30 years ago.",
        "url": "https://news.sky.com/story/ronan-keating-on-boyband-fame-in-the-90s-our-duty-of-care-meant-nothing-13297732",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-keith-duffy-ronan-keating_6812406.jpg?20250128010135",
        "type": "Entertainment",
        "Author": "Bethany Minelle, arts and entertainment reporter",
        "Date Published": "2025-01-28 04:00:00",
        "Headline": "Ronan Keating, Keith Duffy, Shane Lynch and Mikey Graham share their story in Boyzone: All That Matters, charting the fame and success as well as the fallouts and tragedy of being in the band.",
        "Content": "By Bethany Minelle, arts and entertainment reporter   Ronan Keating says the members of Boyzone were \"unprotected\" and in \"a dangerous space\" when they were propelled to fame over 30 years ago. Speaking at the worldwide premiere of Boyzone: No Matter What, the 47-year-old singer told Sky News: \"We just played along with it all. I was 16, 17, 18 years of age. I was a child.\" Now a father of five, Keating goes on: \"But as you get older and your children get older… you realise what we went through as kids and how unprotected we were and what a dangerous space it was.\" In 1993, five working-class lads from Dublin, Ronan Keating, Stephen Gately, Keith Duffy, Shane Lynch and Mikey Graham were plucked from obscurity by talent manager Louis Walsh and moulded into stars. Breaking into the UK charts the following year, they had conquered the world by the mid-1990s. Six number one hits and five number one albums followed, with 25 million records sold across the world. A master of promotion, former X Factor judge Walsh worked hard to keep the boys' names in the papers, but that exposure came at a cost. \n                  Liam Payne's cause of death confirmed as polytrauma during UK inquest opening\n                 \n                  Waiter charged with supplying drugs to Liam Payne arrested - local media\n                 \n                  Liam Payne's final hours detailed by judge as five charged over his death in Argentina\n                 In October, the death of ex-One Direction star Liam Payne after falling from the third-floor balcony of a hotel in the Argentine capital Buenos Aires had drew a sharp focus on the duty of care offered to those thrust into the spotlight at a young age. But Keating says back then it was different: \"Our duty of care would not have been anything. It would never have been taken into account.\" Despite that, he says the band owe Walsh a lot: \"We wouldn't be here today if it wasn't for what Louis did for Boyzone, what he put on the line for us. \"He has apologised and said sorry for the words that he said, the things he's done. Somewhat. It's tough, it's hard, and at times my relationship with Louis - well, it's non-existent. But I am very grateful for the opportunity he gave Boyzone and me in the beginning.\" Shane Lynch too, is forgiving when it comes to past tabloid press intrusion into his private life. Lynch, 48, tells Sky News: \"A story's a story. A paper's a paper. People like to hear bad stuff about you. That's what gets them going, makes their own life feel better. \"Sometimes we were subjected to that little bit more than others. But that said, as Louis Walsh says, 'You made the front paper!'\" So why now - three decades after they first met, and following two splits - have the band felt the need to tell their story? Keating says: \"I think with any story you need a start, a middle and an end. And I think we've after 30 years, we've finally got that.\" Of course, one key element of Boyzone is missing, with the death of Stephen Gately back in 2009 (a result of an undiagnosed heart condition) meaning the five will never again take to the stage. Despite his loss, the remaining members see the three-part documentary as a form of tribute to their lost member, describing it as a way to celebrate and work with him again. In tribute, Keith Duffy, 50, dressed for the event with Gately very much in mind, telling Sky News: \"This shirt is for Steo. He loved a bit of print. He loved a bit of sequins. I found the perfect shirt and red was his favourite colour. I am representing Stephen tonight.\" Mikey Graham, who contributed to the documentary, did not attend the red carpet. Speaking from Miami where he was on holiday, Louis Walsh declined comment. Boyzone: No Matter What is available on Sky and streaming service Now from Sunday 2 February."
    },
    {
        "title": "Just Stop Oil protesters disrupt The Tempest starring Sigourney Weaver",
        "description": "Two Just Stop Oil protesters have been arrested after disrupting a performance of The Tempest starring Sigourney Weaver in London's West End.",
        "url": "https://news.sky.com/story/just-stop-oil-protesters-disrupt-performance-of-the-tempest-starring-sigourney-weaver-13298047",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-just-stop-oil-sigourney-weaver_6812472.jpg?20250128074452",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 07:36:00",
        "Headline": "The Alien star, 75, was escorted off the stage at London's Theatre Royal after activists said: \"We'll have to stop the show, ladies and gentlemen, sorry.\"",
        "Content": " Two Just Stop Oil protesters have been arrested after disrupting a performance of The Tempest starring Sigourney Weaver in London's West End. Alien star Weaver, 75, was escorted away by staff at the Theatre Royal in Drury Lane on Monday night after two members of the climate protest group climbed onto the stage. The two-time Golden Globe-winning actress had been sitting on a chair during the performance of the Shakespeare play in which she portrays the storm-creating magician Prospero - a role typically played by a man. The protesters launched a confetti cannon and a voice called out: \"We'll have to stop the show, ladies and gentlemen, sorry.\" A video posted online by the climate protest group shows the activists, carrying a sign reading \"over 1.5 degrees is a global shipwreck\", as they are met with boos and a few cheers from the audience. The sign was a reference to the recent announcement that 2024 had been the first full year when the average temperature exceeded 1.5C above pre-industrial levels. The Metropolitan Police said a 42-year-old woman and a 60-year-old man were arrested on suspicion of aggravated trespass after attending a central London police station on Tuesday and that they remained in custody. Read more from Sky News:Former Premier League referee apologises over 'cocaine video'Ronan Keating on boyband fame in the 90s One of the protesters, Hayley Walsh, 42, a lecturer from Nottingham, said she was \"scared\" for her three children. \"I can't sleepwalk them into a future of food shortages, life-threatening storms and wars for resources,\" she said in a statement released by the group. \"Years of writing to MPs, going on marches and teaching my students to be more sustainable hasn't seen the urgent change needed.\" The other activist, Richard Weir, a 60-year-old mechanical engineer from North Tyneside, added: \"We're already seeing the damage this crisis is doing to crops, homes and entire neighbourhoods. \"Unless we come together and demand a move away from fossil fuels by 2030, we will go the same way as manufacturing in the UK.\" It is the latest in a string of stunts carried out by Just Stop Oil protesters, including the recent spray-painting of Charles Darwin's grave in Westminster."
    },
    {
        "title": "The Traitors star Alexander Dragonetti inspires thousands of donations to Mencap charity",
        "description": "The Traitors finalist Alexander Dragonetti has inspired more than &#163;30,000 in charity donations after opening up about his late brother's learning disabilities on the show.",
        "url": "https://news.sky.com/story/the-traitors-star-alexander-dragonetti-inspires-thousands-of-donations-to-mencap-charity-13298069",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-alexander-dragonetti_6812503.jpg?20250128090602",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-28 09:00:00",
        "Headline": "The former British diplomat told fellow contestants he would donate some of his prize money to Mencap if he won the show, in tribute to his late brother.",
        "Content": "The Traitors finalist Alexander Dragonetti has inspired more than £30,000 in charity donations after opening up about his late brother's learning disabilities on the show. Mr Dragonetti told fellow contestants during the BBC show's final that he would be donate some of the prize money to Mencap, an organisation that supports people with learning disabilities, if he won. The former British diplomat said his late brother, who had Global Developmental Delay and autism, used to go to summer camps set up by the organisation, and that he would \"love to put some money their way to keep it going\". The 38-year-old failed to win the series, losing out to project manager Jake Brown and former soldier Leanne Quigley for the £94,600 prize pot. But Mencap says he has inspired more than 2,000 people to make donations since the final, raising £31,000. Mencap's chief executive Jon Sparkes said the charity was \"really grateful to Alexander for courageously sharing his personal story\". He added: \"Despite not winning on Friday night Alexander remained faithful to the end and captured the hearts of the nation - he is our champion! \"Telling his story has inspired a tremendous wave of generosity from the public. Their overwhelming support for Mencap has been incredible, with generous donations around £30,000. \"These donations are needed more now than ever as people with a learning disability continue to face extensive inequalities every day. Read more:Ronan Keating on boyband fame: 'Our duty of care meant nothing'Just Stop Oil protesters disrupt play starring Sigourney Weaver \"We know that when the experiences of people with a learning disability, and their loved ones, are represented in the media, it helps to change attitudes and make our society more inclusive,\" Mr Sparkes added. \"We loved watching Alexander's journey throughout the show and want to thank him for all that he's done.\" 'This way, you still win' The charity also shared some comments from anonymous donors inspired by the contestant. One read: \"My son is non verbal autistic and severe learning difficulties. I have a monthly donation but this one is for Alexander, it's what you wanted and this way, you still win. National treasure.\" \"I have always had family friends with learning disabilities but it was Alexander from the traitors that inspired me to donate,\" another read. Another donator wrote: \"I'm the parent of a child with learning disabilities who will need care in the future and I worry about his future when I'm gone every day. \"I also was moved by Alexander's story on the traitors and wanted to donate to his cause even though he hadn't won.\""
    }
]