[
    {
        "title": "Benjamin Netanyahu says Gaza ceasefire will end if Hamas does not free hostages by Saturday",
        "description": "The Gaza ceasefire will end if Hamas does not return Israeli hostages by midday on Saturday,&#160;Israel's prime minister has said.",
        "url": "https://news.sky.com/story/israeli-pm-says-gaza-ceasefire-will-be-terminated-if-hostages-are-not-returned-by-hamas-on-saturday-13307251",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-netanyahu-us_6822390.jpg?20250207155515",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:00:00",
        "Headline": "President Trump, who hosted Jordan's king on Tuesday, has once again reiterated his idea to move Palestinians out of Gaza, saying it will be a \"great economic development\".",
        "Content": " The Gaza ceasefire will end if Hamas does not return Israeli hostages by midday on Saturday, Israel's prime minister has said. It comes after Hamas said it would postpone Saturday's planned release, accusing Israel of violating the terms of the ceasefire. Trump latest: 'We're going to take Gaza' under 'US authority' Prime Minister Benjamin Netanyahu warned of a return to \"intense fighting\" and said his cabinet were in unanimous agreement following a four-hour meeting. He said they \"all expressed outrage at the shocking situation of our three hostages who were released last Saturday\". \"If Hamas does not return our hostages by Saturday noon - the ceasefire will be terminated, and the IDF will return to intense fighting until Hamas is finally defeated,\" the Israeli leader said. Mr Netanyahu said he had ordered forces to gather \"inside and around the Gaza Strip\" in readiness. Donald Trump has said Hamas should release all remaining hostages, rather than just the three planned, and if they aren't the deal should be cancelled.  Mr Netanyahu said the cabinet \"welcomed\" the US president's demand as well as his \"revolutionary vision for the future of Gaza\". It's currently unclear if the Israeli leader is also calling for all of the remaining hostages to be released on Saturday. How many captives have been freed? Five swaps have taken place so far, with 21 hostages - 16 Israelis and five Thais - and more than 730 Palestinian prisoners released as part of an initial 42-day truce. The most recent was last weekend, when three Israeli men were freed. However, there were concerns over how gaunt they looked after 16 months in captivity. The five Thai citizens were also reunited with their families following their release last month. Hamas has said it remains committed to the ceasefire deal if Israel sticks to its terms and dismissed Mr Trump's \"language of threats\". On Monday, the militant group claimed Israel had violated the ceasefire by \"delaying the return of the displaced to the northern Gaza Strip, and targeting them with shelling and gunfire\".  President Trump, who hosted Jordan's king on Tuesday, has again reiterated his controversial idea to move Palestinians out of Gaza and rebuild the territory. He's said the two million-plus population would not be able to return but would have a better, safer future elsewhere. The proposal has been widely dismissed by the West and Arab neighbours who favour a two-state solution - something unacceptable to the Israeli government. Middle East correspondent The Gaza ceasefire is now at real risk of collapsing. After Hamas’s threat last night to suspend further hostage releases, Benjamin Netanyahu has now raised the stakes. This evening, following a meeting with his security cabinet in Jerusalem, he delivered an ultimatum to Hamas: return the hostages or the IDF will resume fighting.\n Mr Netanyahu is on a wave of confidence after his visit to Washington last week. He is daring Hamas to back down. If they don’t Gaza will be at war once again The images of three emaciated hostages released last Saturday has shocked Israel and some are blaming Mr Netanyahu for not agreeing a ceasefire deal sooner. There were protests outside the PM’s residence in Jerusalem today. It’s possible Hamas is aware of this and trying to exploit those divisions within Israel.  But even if he doesn’t have full support within Israel, Mr Netanyahu knows that for now he has the full backing and protection of Donald Trump, and he is emboldened – the rest of the Middle East can only watch on.  What has Trump said? Speaking on Tuesday, Mr Trump said: \"It's a war-torn area, we're going to hold it, we're going to take it… Gaza the way it is, civilisation has been wiped out in Gaza. It's going to be a great economic development.\" Mr Trump has previously threatened to cut aid to Jordan, Egypt and others if they refuse to take in Palestinians. However, he appeared to soften his stance as he took questions at the White House alongside King Abdullah II. \"Well I don't want to say that… we don't have to threaten that, I do believe we're above that,\" said Mr Trump. And what has Jordan's king said? King Abdullah II said \"a plan from Egypt and the Arab countries\" is being discussed among them. \"I think the point is how do we make this work in a way that is good for everybody?\" he said. \"And we have to look at the best interests of the US, of the people in the region, and especially to my people of Jordan.\" Read more from Sky News:Russian oil under attack as Ukraine targets fuel used by militaryRubiales 'absolutely sure' kiss with Hermoso was consensual Much of Gaza lies in ruins after Israel's effort to destroy Hamas. The war began after the October 2023 terror attack that killed around 1,200 people in Israel and saw about 250 kidnapped. Tens of thousands of Palestinians have been killed since then - many of them women and children, according to Gaza's health ministry. Israel says it has killed more than 17,000 militants."
    },
    {
        "title": "Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government",
        "description": "Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce.",
        "url": "https://news.sky.com/story/elon-musk-joins-donald-trump-in-oval-office-as-he-denies-hostile-takeover-of-us-government-13307516",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250211223932",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 21:52:00",
        "Headline": "The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for\".",
        "Content": " Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce. As head of the Department of Government Efficiency (DOGE), an advisory group, Mr Musk says he wants to add \"common sense controls\" to government and ensure taxpayer money is spent wisely. The executive order requires government agencies to work with DOGE, in some cases so they can be \"eliminated or combined because their functions aren't required by law\". In addition, the agencies have been told to \"hire no more than one employee for every four employees that depart from federal service\", with exceptions for immigration, law enforcement and public safety. Answering reporters' questions in the Oval Office, Mr Musk was asked to respond to accusations he is orchestrating a \"hostile takeover\" of government in a non-transparent way. The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for. And that's what democracy is all about\". \"We have this unelected, fourth unconstitutional branch of government, which is the bureaucracy, which has in a lot of ways, currently more power than any elected representative,\" he added, while stood alongside his son X Æ A-12. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  US defence secretary Pete Hegseth works out with marines ahead of first NATO meeting\n                 \n                  Trump signs order reversing US move to ban plastic straws as he declares paper ones 'don't work'\n                 Mr Musk also spoke about what he described as a lack of Treasury controls. \"Your tax dollars need to be spent wisely on things that matter to the people... it's just common sense. It's not draconian or radical\". When challenged about what checks and balances are in place to ensure accountability for Mr Musk, who is unelected, he replied: \"We are trying to be as transparent as possible... I don't know of a case where an organisation has been more transparent\". 👉 Follow Trump 100 on your podcast app 👈 Another reporter raised the possibility of conflicts of interest, pointing out Mr Musk has received billions of dollars in federal contracts. \"All of our actions are fully public,\" he says, adding that he fully expects to be \"scrutinised nonstop\" - comparing it to \"a daily proctologist exam\" - but also admitting \"we will make mistakes, but we'll also fix the mistakes very quickly\". \"Some of the things that I say will be incorrect and should be corrected,\" he said. \"So nobody can bat 1,000.\" US correspondent This was the most awkward news conference starring the most awkward man, with his son picking his nose. It was quite a remarkable event. The president of the US was justifying a full-scale assault on the federal government in the Oval Office with Elon Musk by his side. There was little in the way of accountability, even if the country did vote for Donald Trump. Nobody saw Elon Musk coming. Nobody saw the half dozen young men that have been sent into these federal agencies to sack people by the thousands. Musk's description of bureaucracy as an unconstitutional branch of government is \"a stretch to say the least\". Over many years, the will of the people has been to construct a bureaucracy to deal with their interests, whether that's social security payments or high finance. At the same time, team Trump is attempting to \"railroad\" their legislation through the courts despite the objections of judges. Earlier on Tuesday, Mr Musk posted an attack aimed at judges who have issued rulings that paused Mr Trump's executive actions. \"Democracy in America is being destroyed by judicial coup,\" Mr Musk wrote on X. The president voiced a similar complaint in the Oval Office alongside Mr Musk. Read more from Sky News:Kanye blocked from selling swastika T-shirts'Historic blow' landed against Sicilian mafiaRussia releases American teacher from prison \"We want to weed out the corruption. And it seems hard to believe that a judge could say, we don't want you to do that,\" he said. \"So maybe we have to look at the judges, because that's very serious. I think it's a very serious violation.\" Mr Trump also held discussions with Jordan's King Abdullah at the White House. The president repeated his pledge to \"take Gaza\" and move its residents to Jordan and Egypt, something the king has rejected."
    },
    {
        "title": "Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats",
        "description": "Roads remain shut in Sheffield city centre as police continue to negotiate with a man who allegedly has weapons.",
        "url": "https://news.sky.com/story/sheffield-city-centre-roads-remain-shut-as-police-negotiate-with-armed-man-at-flats-13307587",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sheffield-siege_6826174.jpg?20250211225653",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 22:23:00",
        "Headline": "The incident has caused travel disruption, with some commuters reportedly taking three hours to get to work on Tuesday.",
        "Content": "Roads remain shut in Sheffield city centre as police continue to negotiate with a man who allegedly has weapons. The incident at a block of flats in Broad Street has been going on for over 24 hours, with residents evacuated and spending Monday night at a nearby sports centre. Police said they gained access to the building on Tuesday evening and reunited residents with their pets. However, the Gateway flats remain evacuated and Sheffield Parkway is closed in both directions between Park Square roundabout and Derek Dooley Way. Trams and buses have also been disrupted. The Sheffield Star said thousands of commuters were affected on Tuesday morning, with some spending three hours trying to get to work. South Yorkshire Police said the man is inside a property and is alleged to have weapons and be \"a risk to himself\". Read more from Sky News:Post-mortem reveals injuries of couple found dead in FranceLabour suspends 11 councillors over WhatsApp scandal The incident began at around 7pm on Monday. \"Those evacuated are all cared for and being accommodated with families and friends or in nearby facilities,\" said a police statement. Officers added: \"Our aim is to bring the incident to a close safely and get everyone and their families back to their homes as soon as possible.\""
    },
    {
        "title": "Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes",
        "description": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra &#163;350m for housebuilding.",
        "url": "https://news.sky.com/story/angela-rayner-insists-15m-housing-target-can-be-met-as-extra-163350m-pledged-for-affordable-homes-13307405",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-cambridgeshire-angela-rayner_6773952.jpg?20241212100932",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 19:27:00",
        "Headline": "The deputy prime minister says the government \"can't afford not to\" meet its manifesto commitment with 160,000 children currently in temporary accommodation.",
        "Content": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra £350m for housebuilding. An extra £300m has been injected to the affordable homes programme, a move ministers believe will allow 2,800 additional homes to be built. More than half of these extra homes will be for social rent, the government has said, while more than 250 council homes are expected to be made available through a £50m boost to the local authority housing fund. The scale of the challenge is stark, with more than 123,000 households in temporary accommodation - including nearly 160,000 children - while almost 6,000 families with children are in bed and breakfast accommodation. Asked whether she was worried about whether the government could meet the 1.5m homes target, Ms Rayner said she was \"determined\" to meet the challenge. Politics latest: No 10 says it will work with Trump on tariffs \"We will meet that target because we can't afford not to,\" she told broadcasters. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  Local elections for millions postponed as Nigel Farage hits out at government\n                 \n                  How Elon Musk took over British politics\n                 \"We have 1.3 million people waiting on housing waiting lists, there isn't a person listening to this show that will not know somebody who is desperate to get on the housing ladder. \"So, therefore, we're determined to turn that tide.\" And pressed on whether the expected 250 increase of council homes was a big enough increase to meet the need, Ms Rayner said: \"We think the measures we're taking will unlock thousands more council and social homes as part of that programme. We want to help councils who want to build those homes. \"We see 160,000 children in temporary accommodation, and the cost of that on local authorities is significant, as well as the impact on children's life chances,\" she said. \"So we need to build the homes, and we're doing everything we can to turn the tide of decline and build the houses that people desperately need.\"  The extra £350m promised comes on top of £500m that was earmarked for affordable housing in October's budget. According to housing charity Shelter, at least 90,000 social rent homes would need to be built each year for the next 10 years to clear most social housing waiting lists in England and to house every homeless household. A report by MPs last month found that a record number of children are living in B&Bs beyond the legal limit as England's homelessness crisis pushes councils to breaking point. MPs on the Public Accounts Committee (PAC) said there was a \"dire need\" for housing reform, with the lack of affordable homes forcing cash-strapped local authorities to haemorrhage their funds on temporary accommodation. A recent Sky News investigation found that children in some parts of England were spending as long as five-and-a-half years on average in temporary accommodation. The length of stay has increased significantly in many areas since 2021, with particularly long stays in London and the South East. Read more:Labour suspends 11 councillors over WhatsApp scandalSue Gray takes up seat in House of Lords Elsewhere, ministers are expected to set out plans to crack down on exploitative behaviour by rogue landlords who they say are costing the taxpayer by claiming uncapped housing benefit in return for providing homes that are unsuitable. Last week the government announced that a law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October. The legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester."
    },
    {
        "title": "Top candidate for borders watchdog says he would commute from Finland",
        "description": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to.",
        "url": "https://news.sky.com/story/top-candidate-for-borders-watchdog-says-he-would-commute-from-finland-13307607",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-john-tuckett_6826201.jpg?20250211235512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 23:22:00",
        "Headline": "John Tuckett, who has worked as the immigration services commissioner for six years, has told MPs he currently travels to the UK for work when he needs to.",
        "Content": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to. John Tuckett, who has worked as the immigration services commissioner for six years, was questioned by the Home Affairs Select Committee on Tuesday ahead of the appointment of the next independent chief inspector of borders and immigration (ICIBI). Asked if he lives in commuting distance from the London office, he replied: \"No I don't, I have a family home in Finland and I come across to this country whenever I need to.\" When MPs put it to him that he would expect to inspect the UK's borders without being a resident here, he added: \"I work in UK and I would be in the UK, I'm resident in Finland.\" Mr Tuckett told the committee he pays for travel and accommodation himself and \"always have done\". Follow latest: Live politics updates He also said he would be fine to work five days in the office if needed, adding: \"I have done this kind of work before, and when I was asked this question at my interview, I said, I think that my judgment is you need time when you're available for ministers, visits, all the things where you need to do face to face. \n                  Prisoners being sent back to jail because it's the 'easiest thing to do', chief inspector of probation says\n                 \n                  Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats\n                 \n                  Post-mortem results reveal injuries of British couple found dead at home in France\n                 \"You also need time where you can think, sit back, write, because you don't write a report, you know, in 10 spare minutes in between two major appointments. So I think there's a 60-40, split between for the chief inspector this is.! Mr Tuckett was announced as the preferred applicant for the chief inspector position by the Home Office in January, with previous experience as the chief executive of the Marine Management Organisation and working for the Archbishop of York. Read more politics news:CCTV to be installed in Parliament bar after drink-spiking claimLabour suspends 11 councillors over WhatsApp scandalGrenfell Tower - what happens now? Announcing the recommendation of Mr Tuckett for the role, migration minister Seema Malhotra said: \"His track record of delivering complex change programmes across government, combined with his current role as immigration services commissioner, makes him ideally suited to take on this crucial independent oversight role at an important time for our border security.\" If Mr Tuckett is confirmed as the next inspector, he will replace interim watchdog boss David Bolt - who has served since June last year. Mr Bolt's appointment came after the previous borders watchdog David Neal was sacked in February last year amid claims he breached the terms of his appointment. He later voiced his frustrations of the time taken for his reports to be published, and said there were \"very few\" ways of speaking out about his concerns on security."
    },
    {
        "title": "Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties",
        "description": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties.",
        "url": "https://news.sky.com/story/daffodil-hunt-launched-by-royal-horticultural-society-as-flower-lovers-urged-to-look-out-for-rare-varieties-13307357",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daffodil-flower_6825890.jpg?20250211184222",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 17:41:00",
        "Headline": "Royal Horticultural Society scientist James Kirkham Ramsbottom was honoured in 1925 for developing a hot water treatment against eelworms - credited with saving the daffodil. A century later, the charity is asking people to help track and map the flowers.",
        "Content": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties. The Royal Horticultural Society (RHS) is launching a \"daffodil diaries\" project in commemoration of 100 years since the charity helped save the flower. One of its scientists, James Kirkham Ramsbottom, was awarded the Barr Memorial in 1924 for developing a hot water treatment against eelworms - credited with saving the daffodil. The project runs from 12 February to Saint David's Day on 1 March, when the flowers are worn to mark the patron saint of Wales. Businesses and gardeners are being asked to log where daffodils are blooming, along with basic information such as colour, type and height. RHS scientists will then use the information from the mapping project to understand the environmental influences on the popular spring plant, its spread, and what buyers prefer. In particular, the charity is asking people to look for three varieties of daffodils that are at risk or thought to be extinct, including: • Mrs R O Backhouse, one of the first pink daffodils, which has a solid coral pink trumpet and ivory flowers • Mrs William Copeland - a white double-flowered daffodil which has not been on sale in recent years • The Sussex bonfire, a double-flowered yellow and orange daffodil, which has never been located The RHS said finding rarer daffodils can help better understand gardening heritage in the UK, aid the survival of the varieties, and even ensure the preservation of genetic material to help breed the flowers in the future. Dr Kalman Konyves, daffodil expert with the RHS, said: \"Daffodils have come to mark the arrival of spring and are celebrated for their welcome burst of colour in gardens, parks and roadsides. \"But there's more to this ubiquitous yellow flower than meets the eye, with 31,000 known varieties available in green, pink and red. \"Understanding where they can be found will help us in preserving this diversity for the future.\" Read more from Sky news:Lisa Riley reacts to Peter Kay's gig jibeSri Lanka power outage blamed on a monkey Gwen Hines, chief executive of plant conservation charity Plant Heritage, which helped select which rare cultivars to search for, added: \"Springtime daffodils are abundant, but rare varieties could be lost from our gardens and roadsides if they're not found and cared for. \"While six national plant collections do protect some, many others aren't yet safeguarded, which is why we encourage everyone to look for rare varieties this spring.\""
    },
    {
        "title": "Older people in England happier and more satisfied now than before COVID, researchers say",
        "description": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found.",
        "url": "https://news.sky.com/story/older-people-in-england-happier-and-more-satisfied-now-than-before-covid-researchers-say-13307277",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-older-couple-smiling_6825842.jpg?20250211173509",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:42:00",
        "Headline": "\"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic,\" says Prof Paola Zaninotto.",
        "Content": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found. Experts analysed data from a long-term study, the English Longitudinal Study of Ageing, tracking the wellbeing of 3,999 people aged 50 in England over time. The researchers found that those surveyed reported that their happiness, eudaemonic wellbeing - which measures whether life feels worthwhile - and life satisfaction all plummeted during the COVID-19 pandemic. However, Paola Zaninotto, professor of medical and social statistics at UCL's Department of Epidemiology and Public Health, said \"remarkably\" people reported higher happiness, wellbeing and satisfaction since then. \"As many would expect, we found that wellbeing declined during the pandemic, and instances of depression rose,\" she said. \"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic.\" The study did find levels of depression among the 50-year-olds surveyed have not returned to pre-pandemic levels. \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  COVID inquiry latest: Watch live as Matt Hancock gives evidence\n                 \n                  Watch COVID inquiry latest: Grieving families speak at hearing\n                 Around 11.4% reported depressive symptoms before COVID-19, which rose to 27.2% in late 2020. Post-pandemic, the study found levels of depression had fallen to 14.9% - still above pre-COVID figures. Read more from Sky News:Ageism limits mental health care for elderly - reportThings do seem better in the morning, study suggests Ms Zaninotto added that \"the pandemic had a profound effect on the wellbeing of older people in England,\" but added \"we can only speculate on the reasons\" why those surveyed reported feeling better after COVID-19. \"It perhaps could reflect a renewed appreciation for social connections and meaningful activities, as well as increased psychological resilience after a period of adversity,\" she said. \"Improved health security following widespread vaccinations could also have contributed to this positive shift. \"We saw marked differences by age and affluence, underscoring the importance of tailored support policies for the immediate and lingering effects of pandemics on the well-being of our older population.\" The study was published in the journal Aging and Mental Health."
    },
    {
        "title": "Labour suspends 11 councillors over WhatsApp scandal",
        "description": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench.",
        "url": "https://news.sky.com/story/labour-suspends-11-councillors-over-whatsapp-scandal-13307367",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-gwynne_6823559.jpg?20250208191233",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-11 18:09:00",
        "Headline": "The move comes after Andrew Gwynne was sacked as health minister at the weekend over messages posted in a WhatsApp group.",
        "Content": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench. It is understood most of the councillors are part of Tameside Council while two are members of Stockport Council. The move comes after the party sacked health minister Andrew Gwynne and suspended MP Oliver Ryan over messages reportedly posted in the group. Politics latest: UK and US refuse to sign AI safety deal On the suspension of the 11 councillors - which reportedly includes Mr Gwynne's wife, Allison Gwynne - a party spokesperson said: \"As part of our WhatsApp group investigation, a group of councillors have been administratively suspended from the Labour Party. \"As soon as this group was brought to our attention, a thorough investigation was launched in line with the Labour Party's rules and procedures and this process is ongoing. \"Swift action will always be taken where individuals are found to have breached the high standards expected of them as Labour Party members.\" \n                  Sue Gray takes up seat in House of Lords - and receives new title\n                 \n                  Starmer will hope he can draw a line under damage of WhatsApp scandal after second MP's suspension\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 Sky News understands the following councillors have now been suspended: The suspension of the Tameside councillors comes after three Labour members of the same local authority \"stepped away\" from their duties on Tameside Council. Councillors Jack Naylor, Claire Reid, and George Newton - who were members of the WhatsApp group - are also being investigated by the Labour Party. Mr Gwynne was sacked by Sir Keir Starmer after the Mail on Sunday reported he made racist comments about Labour MP Diane Abbott and sexist remarks about Deputy Prime Minister Angela Rayner. He is also reported to have said he hoped a pensioner would soon die after she asked a councillor about bin collections - and to have joked about a constituent being \"mown down\" by a truck. Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. Shortly after he was sacked from the frontbench, the Labour Party revealed that it was also investigating Mr Ryan over comments which a government source said were \"unacceptable and deeply disappointing\". Mr Ryan then had had the whip removed on Monday, meaning he will now sit as an independent MP in the Commons. The 29-year-old Burnley MP apologised on Sunday and said he \"deeply regrets\" the comments he made, which a government source said were \"unacceptable and deeply disappointing\". According to the Daily Mail, Mr Ryan joked about a fellow Labour MP being gay. In a statement on X over the weekend and before his suspension, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. Read more:The Labour WhatsApp investigation, the alleged messages and the MPs involvedWhy sacked minister's outrageous comments will concern Starmer He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" The MP also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". Mr Gwynne is the latest MP to lose his position on the frontbench after ex-treasury minister Tulip Siddiq quit last month and Louise Haigh resigned as transport minister in November."
    },
    {
        "title": "Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats",
        "description": "Roads remain shut in Sheffield city centre as police continue to negotiate with a man who allegedly has weapons.",
        "url": "https://news.sky.com/story/sheffield-city-centre-roads-remain-shut-as-police-negotiate-with-armed-man-at-flats-13307587",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sheffield-siege_6826174.jpg?20250211225653",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 22:23:00",
        "Headline": "The incident has caused travel disruption, with some commuters reportedly taking three hours to get to work on Tuesday.",
        "Content": "Roads remain shut in Sheffield city centre as police continue to negotiate with a man who allegedly has weapons. The incident at a block of flats in Broad Street has been going on for over 24 hours, with residents evacuated and spending Monday night at a nearby sports centre. Police said they gained access to the building on Tuesday evening and reunited residents with their pets. However, the Gateway flats remain evacuated and Sheffield Parkway is closed in both directions between Park Square roundabout and Derek Dooley Way. Trams and buses have also been disrupted. The Sheffield Star said thousands of commuters were affected on Tuesday morning, with some spending three hours trying to get to work. South Yorkshire Police said the man is inside a property and is alleged to have weapons and be \"a risk to himself\". Read more from Sky News:Post-mortem reveals injuries of couple found dead in FranceLabour suspends 11 councillors over WhatsApp scandal The incident began at around 7pm on Monday. \"Those evacuated are all cared for and being accommodated with families and friends or in nearby facilities,\" said a police statement. Officers added: \"Our aim is to bring the incident to a close safely and get everyone and their families back to their homes as soon as possible.\""
    },
    {
        "title": "Post-mortem results reveal injuries of British couple found dead at home in France",
        "description": "Police investigating the deaths of a British couple at their home in rural France have released details from a post-mortem examination. ",
        "url": "https://news.sky.com/story/post-mortem-results-reveal-injuries-of-british-couple-found-dead-at-home-in-france-13307196",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-searle-dawn-searle_6822825.jpg?20250208092140",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-02-11 13:37:00",
        "Headline": "The investigation continues into whether a third party was involved, or whether the deaths were the result of a murder-suicide.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Police investigating the deaths of a British couple at their home in rural France have released details from a post-mortem examination.  Prosecutors say Dawn Searle, 56, was found at their property in Les Pesquies with \"several\" injuries to her head, while her husband, Andrew Searle, 62, was found hanged with no visible defensive injuries. They are investigating whether the deaths are the result of a murder-suicide or if a third party was involved. The pair are said to have been found dead by a German friend, who lives nearby, on Thursday after Mr Searle didn't arrive for one of their regular dog walks. The couple moved to the hamlet of Les Pesquies around a decade ago and married in the nearby town of Villefranche-de-Rouergue, in the south of France, in 2023. A statement from the office of public prosecutor Nicolas Rigot-Muller said Ms Searle was found partially dressed with a major wound to her skull next to a box with jewellery inside. But no object or weapon was found that could've caused the wounds, which an autopsy carried out in Montpellier on Monday found were caused by a blunt and sharp object. There were no signs of sexual assault. The house appeared to have been quickly searched, while some cash was found in the couple's room. Investigators are conducting further examinations, including toxicology and pathology tests, to help determine the precise circumstances of their deaths. They each have two children from previous relationships and Ms Searle's son, the country musician and former Hollyoaks star Callum Kerr, said they were in mourning in a statement posted on Saturday. Family members are understood to have travelled to France, where they have spoken with investigators. Read more from Sky News:Identities of bodies recovered from Scottish rivers confirmedChelsea footballer Sam Kerr not guilty of racial harassment  The mayor of Villefranche-de-Rouergue, Jean-Sebastien Orcibal, who was also a neighbour of the Searles, said villagers and the British expat community were going to be getting \"psychological help\" following the incident, which has left locals in shock. Speaking to Sky News from the town hall in which he conducted the couple's wedding ceremony, he said: \"It doesn't seem like the problem comes from here because when we knew them and saw them living here they were very happy, very friendly and didn't seem to have any problems. \"The problem seems to come from the past or somewhere far away. \"It's an isolated act, it's very independent. It doesn't say that it's a very dangerous territory, in fact, it's very peaceful and that's why probably Andy and Dawn chose to live here, because it's very peaceful. \"Now, did their past come back and get them? That's another story. That's totally different from where we are. It could've happened anywhere.\" A Foreign Office spokesperson previously said: \"We are supporting the family of a British couple who died in France and are liaising with the local authorities.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Top candidate for borders watchdog says he would commute from Finland",
        "description": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to.",
        "url": "https://news.sky.com/story/top-candidate-for-borders-watchdog-says-he-would-commute-from-finland-13307607",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-john-tuckett_6826201.jpg?20250211235512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 23:22:00",
        "Headline": "John Tuckett, who has worked as the immigration services commissioner for six years, has told MPs he currently travels to the UK for work when he needs to.",
        "Content": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to. John Tuckett, who has worked as the immigration services commissioner for six years, was questioned by the Home Affairs Select Committee on Tuesday ahead of the appointment of the next independent chief inspector of borders and immigration (ICIBI). Asked if he lives in commuting distance from the London office, he replied: \"No I don't, I have a family home in Finland and I come across to this country whenever I need to.\" When MPs put it to him that he would expect to inspect the UK's borders without being a resident here, he added: \"I work in UK and I would be in the UK, I'm resident in Finland.\" Mr Tuckett told the committee he pays for travel and accommodation himself and \"always have done\". Follow latest: Live politics updates He also said he would be fine to work five days in the office if needed, adding: \"I have done this kind of work before, and when I was asked this question at my interview, I said, I think that my judgment is you need time when you're available for ministers, visits, all the things where you need to do face to face. \n                  Prisoners being sent back to jail because it's the 'easiest thing to do', chief inspector of probation says\n                 \n                  Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats\n                 \n                  Post-mortem results reveal injuries of British couple found dead at home in France\n                 \"You also need time where you can think, sit back, write, because you don't write a report, you know, in 10 spare minutes in between two major appointments. So I think there's a 60-40, split between for the chief inspector this is.! Mr Tuckett was announced as the preferred applicant for the chief inspector position by the Home Office in January, with previous experience as the chief executive of the Marine Management Organisation and working for the Archbishop of York. Read more politics news:CCTV to be installed in Parliament bar after drink-spiking claimLabour suspends 11 councillors over WhatsApp scandalGrenfell Tower - what happens now? Announcing the recommendation of Mr Tuckett for the role, migration minister Seema Malhotra said: \"His track record of delivering complex change programmes across government, combined with his current role as immigration services commissioner, makes him ideally suited to take on this crucial independent oversight role at an important time for our border security.\" If Mr Tuckett is confirmed as the next inspector, he will replace interim watchdog boss David Bolt - who has served since June last year. Mr Bolt's appointment came after the previous borders watchdog David Neal was sacked in February last year amid claims he breached the terms of his appointment. He later voiced his frustrations of the time taken for his reports to be published, and said there were \"very few\" ways of speaking out about his concerns on security."
    },
    {
        "title": "Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes",
        "description": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra &#163;350m for housebuilding.",
        "url": "https://news.sky.com/story/angela-rayner-insists-15m-housing-target-can-be-met-as-extra-163350m-pledged-for-affordable-homes-13307405",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-cambridgeshire-angela-rayner_6773952.jpg?20241212100932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 19:27:00",
        "Headline": "The deputy prime minister says the government \"can't afford not to\" meet its manifesto commitment with 160,000 children currently in temporary accommodation.",
        "Content": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra £350m for housebuilding. An extra £300m has been injected to the affordable homes programme, a move ministers believe will allow 2,800 additional homes to be built. More than half of these extra homes will be for social rent, the government has said, while more than 250 council homes are expected to be made available through a £50m boost to the local authority housing fund. The scale of the challenge is stark, with more than 123,000 households in temporary accommodation - including nearly 160,000 children - while almost 6,000 families with children are in bed and breakfast accommodation. Asked whether she was worried about whether the government could meet the 1.5m homes target, Ms Rayner said she was \"determined\" to meet the challenge. Politics latest: No 10 says it will work with Trump on tariffs \"We will meet that target because we can't afford not to,\" she told broadcasters. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  Local elections for millions postponed as Nigel Farage hits out at government\n                 \n                  How Elon Musk took over British politics\n                 \"We have 1.3 million people waiting on housing waiting lists, there isn't a person listening to this show that will not know somebody who is desperate to get on the housing ladder. \"So, therefore, we're determined to turn that tide.\" And pressed on whether the expected 250 increase of council homes was a big enough increase to meet the need, Ms Rayner said: \"We think the measures we're taking will unlock thousands more council and social homes as part of that programme. We want to help councils who want to build those homes. \"We see 160,000 children in temporary accommodation, and the cost of that on local authorities is significant, as well as the impact on children's life chances,\" she said. \"So we need to build the homes, and we're doing everything we can to turn the tide of decline and build the houses that people desperately need.\"  The extra £350m promised comes on top of £500m that was earmarked for affordable housing in October's budget. According to housing charity Shelter, at least 90,000 social rent homes would need to be built each year for the next 10 years to clear most social housing waiting lists in England and to house every homeless household. A report by MPs last month found that a record number of children are living in B&Bs beyond the legal limit as England's homelessness crisis pushes councils to breaking point. MPs on the Public Accounts Committee (PAC) said there was a \"dire need\" for housing reform, with the lack of affordable homes forcing cash-strapped local authorities to haemorrhage their funds on temporary accommodation. A recent Sky News investigation found that children in some parts of England were spending as long as five-and-a-half years on average in temporary accommodation. The length of stay has increased significantly in many areas since 2021, with particularly long stays in London and the South East. Read more:Labour suspends 11 councillors over WhatsApp scandalSue Gray takes up seat in House of Lords Elsewhere, ministers are expected to set out plans to crack down on exploitative behaviour by rogue landlords who they say are costing the taxpayer by claiming uncapped housing benefit in return for providing homes that are unsuitable. Last week the government announced that a law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October. The legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester."
    },
    {
        "title": "Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties",
        "description": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties.",
        "url": "https://news.sky.com/story/daffodil-hunt-launched-by-royal-horticultural-society-as-flower-lovers-urged-to-look-out-for-rare-varieties-13307357",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daffodil-flower_6825890.jpg?20250211184222",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 17:41:00",
        "Headline": "Royal Horticultural Society scientist James Kirkham Ramsbottom was honoured in 1925 for developing a hot water treatment against eelworms - credited with saving the daffodil. A century later, the charity is asking people to help track and map the flowers.",
        "Content": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties. The Royal Horticultural Society (RHS) is launching a \"daffodil diaries\" project in commemoration of 100 years since the charity helped save the flower. One of its scientists, James Kirkham Ramsbottom, was awarded the Barr Memorial in 1924 for developing a hot water treatment against eelworms - credited with saving the daffodil. The project runs from 12 February to Saint David's Day on 1 March, when the flowers are worn to mark the patron saint of Wales. Businesses and gardeners are being asked to log where daffodils are blooming, along with basic information such as colour, type and height. RHS scientists will then use the information from the mapping project to understand the environmental influences on the popular spring plant, its spread, and what buyers prefer. In particular, the charity is asking people to look for three varieties of daffodils that are at risk or thought to be extinct, including: • Mrs R O Backhouse, one of the first pink daffodils, which has a solid coral pink trumpet and ivory flowers • Mrs William Copeland - a white double-flowered daffodil which has not been on sale in recent years • The Sussex bonfire, a double-flowered yellow and orange daffodil, which has never been located The RHS said finding rarer daffodils can help better understand gardening heritage in the UK, aid the survival of the varieties, and even ensure the preservation of genetic material to help breed the flowers in the future. Dr Kalman Konyves, daffodil expert with the RHS, said: \"Daffodils have come to mark the arrival of spring and are celebrated for their welcome burst of colour in gardens, parks and roadsides. \"But there's more to this ubiquitous yellow flower than meets the eye, with 31,000 known varieties available in green, pink and red. \"Understanding where they can be found will help us in preserving this diversity for the future.\" Read more from Sky news:Lisa Riley reacts to Peter Kay's gig jibeSri Lanka power outage blamed on a monkey Gwen Hines, chief executive of plant conservation charity Plant Heritage, which helped select which rare cultivars to search for, added: \"Springtime daffodils are abundant, but rare varieties could be lost from our gardens and roadsides if they're not found and cared for. \"While six national plant collections do protect some, many others aren't yet safeguarded, which is why we encourage everyone to look for rare varieties this spring.\""
    },
    {
        "title": "Older people in England happier and more satisfied now than before COVID, researchers say",
        "description": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found.",
        "url": "https://news.sky.com/story/older-people-in-england-happier-and-more-satisfied-now-than-before-covid-researchers-say-13307277",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-older-couple-smiling_6825842.jpg?20250211173509",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:42:00",
        "Headline": "\"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic,\" says Prof Paola Zaninotto.",
        "Content": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found. Experts analysed data from a long-term study, the English Longitudinal Study of Ageing, tracking the wellbeing of 3,999 people aged 50 in England over time. The researchers found that those surveyed reported that their happiness, eudaemonic wellbeing - which measures whether life feels worthwhile - and life satisfaction all plummeted during the COVID-19 pandemic. However, Paola Zaninotto, professor of medical and social statistics at UCL's Department of Epidemiology and Public Health, said \"remarkably\" people reported higher happiness, wellbeing and satisfaction since then. \"As many would expect, we found that wellbeing declined during the pandemic, and instances of depression rose,\" she said. \"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic.\" The study did find levels of depression among the 50-year-olds surveyed have not returned to pre-pandemic levels. \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  COVID inquiry latest: Watch live as Matt Hancock gives evidence\n                 \n                  Watch COVID inquiry latest: Grieving families speak at hearing\n                 Around 11.4% reported depressive symptoms before COVID-19, which rose to 27.2% in late 2020. Post-pandemic, the study found levels of depression had fallen to 14.9% - still above pre-COVID figures. Read more from Sky News:Ageism limits mental health care for elderly - reportThings do seem better in the morning, study suggests Ms Zaninotto added that \"the pandemic had a profound effect on the wellbeing of older people in England,\" but added \"we can only speculate on the reasons\" why those surveyed reported feeling better after COVID-19. \"It perhaps could reflect a renewed appreciation for social connections and meaningful activities, as well as increased psychological resilience after a period of adversity,\" she said. \"Improved health security following widespread vaccinations could also have contributed to this positive shift. \"We saw marked differences by age and affluence, underscoring the importance of tailored support policies for the immediate and lingering effects of pandemics on the well-being of our older population.\" The study was published in the journal Aging and Mental Health."
    },
    {
        "title": "Labour suspends 11 councillors over WhatsApp scandal",
        "description": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench.",
        "url": "https://news.sky.com/story/labour-suspends-11-councillors-over-whatsapp-scandal-13307367",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-gwynne_6823559.jpg?20250208191233",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 18:09:00",
        "Headline": "The move comes after Andrew Gwynne was sacked as health minister at the weekend over messages posted in a WhatsApp group.",
        "Content": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench. It is understood most of the councillors are part of Tameside Council while two are members of Stockport Council. The move comes after the party sacked health minister Andrew Gwynne and suspended MP Oliver Ryan over messages reportedly posted in the group. Politics latest: UK and US refuse to sign AI safety deal On the suspension of the 11 councillors - which reportedly includes Mr Gwynne's wife, Allison Gwynne - a party spokesperson said: \"As part of our WhatsApp group investigation, a group of councillors have been administratively suspended from the Labour Party. \"As soon as this group was brought to our attention, a thorough investigation was launched in line with the Labour Party's rules and procedures and this process is ongoing. \"Swift action will always be taken where individuals are found to have breached the high standards expected of them as Labour Party members.\" \n                  Sue Gray takes up seat in House of Lords - and receives new title\n                 \n                  Starmer will hope he can draw a line under damage of WhatsApp scandal after second MP's suspension\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 Sky News understands the following councillors have now been suspended: The suspension of the Tameside councillors comes after three Labour members of the same local authority \"stepped away\" from their duties on Tameside Council. Councillors Jack Naylor, Claire Reid, and George Newton - who were members of the WhatsApp group - are also being investigated by the Labour Party. Mr Gwynne was sacked by Sir Keir Starmer after the Mail on Sunday reported he made racist comments about Labour MP Diane Abbott and sexist remarks about Deputy Prime Minister Angela Rayner. He is also reported to have said he hoped a pensioner would soon die after she asked a councillor about bin collections - and to have joked about a constituent being \"mown down\" by a truck. Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. Shortly after he was sacked from the frontbench, the Labour Party revealed that it was also investigating Mr Ryan over comments which a government source said were \"unacceptable and deeply disappointing\". Mr Ryan then had had the whip removed on Monday, meaning he will now sit as an independent MP in the Commons. The 29-year-old Burnley MP apologised on Sunday and said he \"deeply regrets\" the comments he made, which a government source said were \"unacceptable and deeply disappointing\". According to the Daily Mail, Mr Ryan joked about a fellow Labour MP being gay. In a statement on X over the weekend and before his suspension, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. Read more:The Labour WhatsApp investigation, the alleged messages and the MPs involvedWhy sacked minister's outrageous comments will concern Starmer He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" The MP also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". Mr Gwynne is the latest MP to lose his position on the frontbench after ex-treasury minister Tulip Siddiq quit last month and Louise Haigh resigned as transport minister in November."
    },
    {
        "title": "Heathrow set to announce multibillion-pound investment - as it prepares proposal for third runway",
        "description": "Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway.",
        "url": "https://news.sky.com/story/heathrow-set-to-announce-multibillion-pound-investment-as-it-prepares-proposal-for-third-runway-13307372",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-heathrow-terminal-five_6826084.jpg?20250211215936",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-11 18:20:00",
        "Headline": "Plans for a third Heathrow runway will be with the government \"by summer\", the airport has said, amid projections it could be decades before the project is completed, if at all.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway. The UK's biggest airport has announced a \"once-in-a-generation investment\" beginning this year to improve existing buildings and boost passenger numbers. The development is separate from a new runway - which the government recently announced support for - and will be funded by Heathrow shareholders with airlines and customers charged for the expanded services. Money blog: Major lender cuts mortgage rates below 4% As part of the investment, the capacity of terminals two and five will be increased and the layout of the airfield will be reconfigured in a bid to improve punctuality and to increase the number of aircraft stands. In a speech on Wednesday, chief executive Thomas Woldbye is expected to say: \"This privately-funded programme will upgrade existing infrastructure while laying the groundwork for a third runway, boosting UK investment and economic growth, with tangible benefits felt this year.\" Heathrow was last month criticised by Europe's largest airline Ryanair for being \"incredibly operationally inefficient\". Because of this, Ryanair chief executive Michael O'Leary said the airline had no interest in and would \"never\" fly from the airport, even if it were free. \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 \n                  Heathrow Airport: The case for and against a third runway\n                 \n                  Money and public backlash are not the only issues Heathrow expansion plans face\n                 Proposals for a third runway will be submitted to the government \"by summer\", the airport said, after Chancellor Rachel Reeves backed the expansion as part of her aim of growing the economy. The support is seen as controversial as many senior Labour politicians such as London mayor Sadiq Khan and cabinet members including Energy Secretary Ed Miliband have long opposed a third runway on environmental and health grounds.  It's unclear how the additional carbon emissions from the extra flights would be compatible with the state's legally binding 2050 emissions reduction targets. A third runway? Doubt has been cast over whether a runway could even be built during Labour's time in power. The process would have to be planned and approved before construction could begin.  Rivers and the M25 road would have to be diverted and hundreds of homes would need to be demolished as part of construction. Ryanair's Mr O'Leary said the chance of it being built was \"slim\" but it could be 2050 even if it does get built. A question over the third runway's ability to boost the economy was raised by left-leaning thinktank the New Economics Foundation (NEF) According to its analysis, growth in the number of business travellers - who may grow commercial links - has ceased and instead, passenger growth has been driven by wealthy British residents rather than foreign tourists entering the country. The air travel industry is also one of the poorest job creators in the economy per pound of revenue, the NEF said, while the environmental downsides of more flights are \"significant\". Steel pact  As part of interim, pre-third runway expansion Heathrow signed a charter to maximise opportunities for the use of British steel, a move welcomed by steel bosses, unions and the government."
    },
    {
        "title": "King Charles invites Sir Keir Starmer and devolved government leaders for dinner at Windsor Castle",
        "description": "King Charles will host the prime minister and the first ministers of the devolved governments at Windsor Castle on Wednesday night, Sky News understands.",
        "url": "https://news.sky.com/story/king-charles-invites-sir-keir-starmer-and-devolved-government-leaders-for-dinner-at-windsor-castle-13307474",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-king-charles-aberden_6804958.jpg?20250120113759",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-11 20:56:00",
        "Headline": "The dinner on Wednesday comes after Downing Street denied involving the monarch in politics after he appeared alongside the prime minister and Angela Rayner at a housing project in Cornwall.",
        "Content": "King Charles will host the prime minister and the first ministers of the devolved governments at Windsor Castle on Wednesday night, Sky News understands. The monarch has invited John Swinney, the Scottish first minister, to the Berkshire royal residence, along with Northern Irish First Minister Michelle O'Neill, Northern Irish Deputy First Minister Emma Little-Pengelly and Welsh first minister Eluned Morgan, it is understood. The King hosts a number of informal dinners at Windsor Castle for a wide variety of guests from across the arts, science, charity and politics each year. Politics latest: No 10 says it will work with Trump on tariffs  However, the latest event risks adding fuel to the criticism that the King is intervening in politics after he joined Sir Keir Starmer and his deputy Angela Rayner on a rare engagement to see a housing project in Cornwall on Monday. The monarch Sir Keir and Ms Rayner carried out three engagements in Nansledan, a 540-acre extension to the seaside town of Newquay. The visit is understood to have followed conversations about housing over the past few months between King Charles and Sir Keir, during which the Nansledan project was mentioned. \n                  Sue Gray takes up seat in House of Lords - and receives new title\n                 \n                  Sir Keir Starmer takes HIV test in effort to reduce stigma\n                 \n                  Why sacked minister's outrageous comments will concern Starmer\n                 The joint trip came ahead of the government outlining further measures to meet its target to build 1.5m homes over the next five years. The monarch famously does not intervene in political matters and remains politically neutral under the constitutional monarchy - but critics have claimed the visit risked dragging the King into politics. Asked whether making the visit ahead of the announcement risked that perception, the prime minister's official spokesperson said: \"No\". They added: \"Obviously, this project is entirely run by the Palace and the Duchy [of Cornwall], but the government has spoken repeatedly on its ambitions on housebuilding, it is a key part of the plan for change to deliver 1.5m homes, to tackle the housing crisis that we've inherited, to drive economic growth across the country.\" Read more:Labour suspends 11 councillors over WhatsApp scandalSue Gray takes up seat in House of Lords Sir Keir has made improving ties with the devolved leaders one of his priorities following years of thorny relations under the previous Conservative government. Last October, the prime minister held a summit with devolved leaders in Edinburgh where they discussed working together to grow the economy and to make the UK a clean energy superpower."
    },
    {
        "title": "Benjamin Netanyahu says Gaza ceasefire will end if Hamas does not free hostages by Saturday",
        "description": "The Gaza ceasefire will end if Hamas does not return Israeli hostages by midday on Saturday,&#160;Israel's prime minister has said.",
        "url": "https://news.sky.com/story/israeli-pm-says-gaza-ceasefire-will-be-terminated-if-hostages-are-not-returned-by-hamas-on-saturday-13307251",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-netanyahu-us_6822390.jpg?20250207155515",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:00:00",
        "Headline": "President Trump, who hosted Jordan's king on Tuesday, has once again reiterated his idea to move Palestinians out of Gaza, saying it will be a \"great economic development\".",
        "Content": " The Gaza ceasefire will end if Hamas does not return Israeli hostages by midday on Saturday, Israel's prime minister has said. It comes after Hamas said it would postpone Saturday's planned release, accusing Israel of violating the terms of the ceasefire. Trump latest: 'We're going to take Gaza' under 'US authority' Prime Minister Benjamin Netanyahu warned of a return to \"intense fighting\" and said his cabinet were in unanimous agreement following a four-hour meeting. He said they \"all expressed outrage at the shocking situation of our three hostages who were released last Saturday\". \"If Hamas does not return our hostages by Saturday noon - the ceasefire will be terminated, and the IDF will return to intense fighting until Hamas is finally defeated,\" the Israeli leader said. Mr Netanyahu said he had ordered forces to gather \"inside and around the Gaza Strip\" in readiness. Donald Trump has said Hamas should release all remaining hostages, rather than just the three planned, and if they aren't the deal should be cancelled.  Mr Netanyahu said the cabinet \"welcomed\" the US president's demand as well as his \"revolutionary vision for the future of Gaza\". It's currently unclear if the Israeli leader is also calling for all of the remaining hostages to be released on Saturday. How many captives have been freed? Five swaps have taken place so far, with 21 hostages - 16 Israelis and five Thais - and more than 730 Palestinian prisoners released as part of an initial 42-day truce. The most recent was last weekend, when three Israeli men were freed. However, there were concerns over how gaunt they looked after 16 months in captivity. The five Thai citizens were also reunited with their families following their release last month. Hamas has said it remains committed to the ceasefire deal if Israel sticks to its terms and dismissed Mr Trump's \"language of threats\". On Monday, the militant group claimed Israel had violated the ceasefire by \"delaying the return of the displaced to the northern Gaza Strip, and targeting them with shelling and gunfire\".  President Trump, who hosted Jordan's king on Tuesday, has again reiterated his controversial idea to move Palestinians out of Gaza and rebuild the territory. He's said the two million-plus population would not be able to return but would have a better, safer future elsewhere. The proposal has been widely dismissed by the West and Arab neighbours who favour a two-state solution - something unacceptable to the Israeli government. Middle East correspondent The Gaza ceasefire is now at real risk of collapsing. After Hamas’s threat last night to suspend further hostage releases, Benjamin Netanyahu has now raised the stakes. This evening, following a meeting with his security cabinet in Jerusalem, he delivered an ultimatum to Hamas: return the hostages or the IDF will resume fighting.\n Mr Netanyahu is on a wave of confidence after his visit to Washington last week. He is daring Hamas to back down. If they don’t Gaza will be at war once again The images of three emaciated hostages released last Saturday has shocked Israel and some are blaming Mr Netanyahu for not agreeing a ceasefire deal sooner. There were protests outside the PM’s residence in Jerusalem today. It’s possible Hamas is aware of this and trying to exploit those divisions within Israel.  But even if he doesn’t have full support within Israel, Mr Netanyahu knows that for now he has the full backing and protection of Donald Trump, and he is emboldened – the rest of the Middle East can only watch on.  What has Trump said? Speaking on Tuesday, Mr Trump said: \"It's a war-torn area, we're going to hold it, we're going to take it… Gaza the way it is, civilisation has been wiped out in Gaza. It's going to be a great economic development.\" Mr Trump has previously threatened to cut aid to Jordan, Egypt and others if they refuse to take in Palestinians. However, he appeared to soften his stance as he took questions at the White House alongside King Abdullah II. \"Well I don't want to say that… we don't have to threaten that, I do believe we're above that,\" said Mr Trump. And what has Jordan's king said? King Abdullah II said \"a plan from Egypt and the Arab countries\" is being discussed among them. \"I think the point is how do we make this work in a way that is good for everybody?\" he said. \"And we have to look at the best interests of the US, of the people in the region, and especially to my people of Jordan.\" Read more from Sky News:Russian oil under attack as Ukraine targets fuel used by militaryRubiales 'absolutely sure' kiss with Hermoso was consensual Much of Gaza lies in ruins after Israel's effort to destroy Hamas. The war began after the October 2023 terror attack that killed around 1,200 people in Israel and saw about 250 kidnapped. Tens of thousands of Palestinians have been killed since then - many of them women and children, according to Gaza's health ministry. Israel says it has killed more than 17,000 militants."
    },
    {
        "title": "Arsenal, Bayern Munich and PSG told to 'reconcile conscience' over Rwanda sponsorship deal",
        "description": "Three of the world's biggest football clubs are being urged to drop their sponsorship deals with Visit Rwanda by the government of neighbouring Democratic Republic of the Congo (DRC).",
        "url": "https://news.sky.com/story/arsenal-bayern-munich-and-psg-told-to-reconcile-conscience-over-rwanda-sponsorship-deal-13307361",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-drc-congo-therese-kayikwamba-wagner_6825906.jpg?20250211191910",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-11 17:52:00",
        "Headline": "Rwanda is accused of supporting the M23 rebels, whose capture of a major Congolese city precipitated thousands of deaths. Visit Rwanda is also a lucrative shirt sponsor for a handful of European football clubs - including Arsenal.",
        "Content": " Three of the world's biggest football clubs are being urged to drop their sponsorship deals with Visit Rwanda by the government of neighbouring Democratic Republic of the Congo (DRC). The United Nations recently said almost 3,000 people have been killed in fighting in DRC after M23 rebels, backed by some 4,000 troops from neighbouring Rwanda, seized the city of Goma. DRC's foreign minister Therese Kayikwamba Wagner told Sky News' Yalda Hakim that, despite calls to ditch the lucrative shirt sponsor, Arsenal, Paris St Germain (PSG) and Bayern Munich appeared to be \"still soul searching\". In a wide-ranging interview on The World on Tuesday, Ms Wagner accused the clubs of being sponsored by \"a country that is wreaking havoc... and that is de facto a warmonger\". \"How do these clubs know that the money used is not money that is derived from the sales of minerals... mined in the DRC through horrific human rights violations?\" she asked. \"How do these different football clubs reconcile with their conscience with the ideals that football represents of bringing people together? \"In the DRC, thousands of people have been killed, including children... children who certainly also cheer for Paris Saint-Germain, Bayern Munich or Arsenal. And so there is a need to reconcile that.\" A ceasefire was declared after the deadly capture of Goma, which involved fierce battles with Congolese forces. The UN said hundreds of thousands of people have been displaced amid \"immense human suffering... and a growing humanitarian crisis\". Earlier this month, Ms Wagner wrote to Arsenal, PSG and Bayern Munich to \"question the morality\" of the sponsorship deals and call for them to end. The deal is believed to be worth around £10m a year for Arsenal alone. PSG and Arsenal told Sky News they would not comment. Bayern Munich has not responded to a request for comment. Rwanda President Paul Kagame dismissed the appeal for the European clubs to break ties with Rwanda as \"wasted efforts\". He told CNN that DRC should instead \"direct the effort towards managing their own problems, own politics properly\". Mr Kagame also said he didn't know if his country's troops were in the DRC. Rwanda insists it has taken mostly defensive positions to protect its borders and citizens. Read more from Sky News:Netanyahu threatens to end ceasefireRushdie trial: Author describes attack'Historic blow' to Sicilian mafia But Ms Wagner described the rebels' takeover as a \"de facto occupation by Rwanda behind the facade of the M23\". She also called on the international community to impose \"firm sanctions\" on Rwanda and ban Rwandan minerals on the global markets. Ms Wagner accused Rwanda of \"pillaging\" the DRC's natural resources by using forced labour - involving Congolese men, women and children - to mine minerals under the threat of violence. She claimed the resources are \"transported over to Rwanda and exported as Rwandan minerals\". She said: \"We welcome the fact that, as of December, we have seen the UK stance be much more firm, much more transparent, and has also been much more clear in condemning the actions of Rwanda.\" But she also insisted that \"firmer action has to take place and that has to happen faster\" adding that \"we need firm sanctions... that actually target the Rwandan leadership\"."
    },
    {
        "title": "Post-mortem results reveal injuries of British couple found dead at home in France",
        "description": "Police investigating the deaths of a British couple at their home in rural France have released details from a post-mortem examination. ",
        "url": "https://news.sky.com/story/post-mortem-results-reveal-injuries-of-british-couple-found-dead-at-home-in-france-13307196",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-searle-dawn-searle_6822825.jpg?20250208092140",
        "type": "World",
        "Author": "Henry Vaughan",
        "Date Published": "2025-02-11 13:37:00",
        "Headline": "The investigation continues into whether a third party was involved, or whether the deaths were the result of a murder-suicide.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Police investigating the deaths of a British couple at their home in rural France have released details from a post-mortem examination.  Prosecutors say Dawn Searle, 56, was found at their property in Les Pesquies with \"several\" injuries to her head, while her husband, Andrew Searle, 62, was found hanged with no visible defensive injuries. They are investigating whether the deaths are the result of a murder-suicide or if a third party was involved. The pair are said to have been found dead by a German friend, who lives nearby, on Thursday after Mr Searle didn't arrive for one of their regular dog walks. The couple moved to the hamlet of Les Pesquies around a decade ago and married in the nearby town of Villefranche-de-Rouergue, in the south of France, in 2023. A statement from the office of public prosecutor Nicolas Rigot-Muller said Ms Searle was found partially dressed with a major wound to her skull next to a box with jewellery inside. But no object or weapon was found that could've caused the wounds, which an autopsy carried out in Montpellier on Monday found were caused by a blunt and sharp object. There were no signs of sexual assault. The house appeared to have been quickly searched, while some cash was found in the couple's room. Investigators are conducting further examinations, including toxicology and pathology tests, to help determine the precise circumstances of their deaths. They each have two children from previous relationships and Ms Searle's son, the country musician and former Hollyoaks star Callum Kerr, said they were in mourning in a statement posted on Saturday. Family members are understood to have travelled to France, where they have spoken with investigators. Read more from Sky News:Identities of bodies recovered from Scottish rivers confirmedChelsea footballer Sam Kerr not guilty of racial harassment  The mayor of Villefranche-de-Rouergue, Jean-Sebastien Orcibal, who was also a neighbour of the Searles, said villagers and the British expat community were going to be getting \"psychological help\" following the incident, which has left locals in shock. Speaking to Sky News from the town hall in which he conducted the couple's wedding ceremony, he said: \"It doesn't seem like the problem comes from here because when we knew them and saw them living here they were very happy, very friendly and didn't seem to have any problems. \"The problem seems to come from the past or somewhere far away. \"It's an isolated act, it's very independent. It doesn't say that it's a very dangerous territory, in fact, it's very peaceful and that's why probably Andy and Dawn chose to live here, because it's very peaceful. \"Now, did their past come back and get them? That's another story. That's totally different from where we are. It could've happened anywhere.\" A Foreign Office spokesperson previously said: \"We are supporting the family of a British couple who died in France and are liaising with the local authorities.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Salman Rushdie trial: Author describes moment of attack as he gives evidence in New York courtroom",
        "description": "Sir Salman Rushdie has described in court the moment he was attacked on stage.",
        "url": "https://news.sky.com/story/salman-rushdie-trial-author-describes-moment-of-attack-as-he-gives-evidence-in-new-york-courtroom-13307273",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-germany-frankfurt-salman-rushdie_6327931.jpg?20231020095321",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:27:00",
        "Headline": "The British-Indian author was stabbed as he was preparing to give a speech in August 2022. He was blinded in one eye in the attack, suffered a severely damaged hand, and spent months recovering.",
        "Content": "Sir Salman Rushdie has described in court the moment he was attacked on stage. The British-Indian author, who was stabbed as he was preparing to give a speech on 12 August 2022, took the stand in a New York courtroom to give evidence against the man charged over the attack. Rushdie, 77, was blinded in one eye in the incident, suffered a severely damaged hand, and spent months recovering. The writer, who spent most of the 1990s in hiding in the UK after receiving death threats over his 1988 novel The Satanic Verses, was stabbed about 15 times. He was attacked in the head, neck, torso, and left hand, blinding his right eye and damaging his liver and intestines. Rushdie told the court: \"I only saw him at the last minute. I was aware of someone wearing black clothes, or dark clothes and a black face mask. \"I was very struck by his eyes, which were dark and seemed very ferocious to me. I thought he was hitting me with his fist but I saw a large quantity of blood pouring onto my clothes. \"He was hitting me repeatedly. Hitting and slashing.\" 'I was dying' Rushdie then told the court about feeling \"a sense of great pain and shock\" after the New York attack, adding he was \"aware of the fact that there was an enormous quantity of blood that I was lying in\". \"It occurred to me that I was dying. That was my predominant thought,\" he added. His wife, Rachel Eliza Griffiths, cried from her seat in the courtroom as Rushdie testified. Defendant denies the charges Hadi Matar, 27, is charged with attempted murder and assault for attacking Rushdie - who also wrote Midnight's Children and Victory City - at the Chautauqua Institution. Matar has pleaded not guilty, and the trial continues. It is expected to last up to two weeks. The assault charge is in relation to the wounding of Henry Reese, the co-founder of Pittsburgh's City of Asylum who was carrying out the talk with Rushdie that morning. He is also set to testify.  A public defender representing Matar said the case is not as straightforward as prosecutors say, adding: \"Something very bad did happen, but the district attorney has to prove much more than that.\" District Attorney Jason Schmidt said on Tuesday that \"this is not a case of mistaken identity,\" but added jurors are unlikely to hear about a fatwa issued by the late Iranian leader Ayatollah Ruhollah Khomeini calling for Rushdie's death. Read more from Sky News:Rushdie thought stabbing would be 'the end'Trump halts 'wasteful' penny production After the fatwa was announced in 1989 following the publication of his book The Satanic Verses - which some Muslims consider blasphemous - Rushdie spent years in hiding. Mr Schmidt added that discussing Matar's motive would be unnecessary in the state trial, given the attack was seen by a live audience."
    },
    {
        "title": "'Historic blow' to Sicilian mafia after more than 180 arrests by Italian police",
        "description": "Italian police have arrested 181 people in a crackdown on the Sicilian mafia.",
        "url": "https://news.sky.com/story/historic-blow-to-sicilian-mafia-after-more-than-180-arrests-by-italian-police-13307249",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-italy-sicilyu-sicily_6825663.png?20250211151346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-11 14:55:00",
        "Headline": "A total of 1,200 officers were involved in the operation aimed at dismantling mafia clans in several districts of the capital Palermo.",
        "Content": " Italian police have arrested 181 people in a crackdown on the Sicilian mafia. Authorities launched a series of raids early on Tuesday, detaining suspected members of the mafia for alleged crimes including attempted murder, extortion, drug trafficking and more. A total of 1,200 officers were involved in the operation aimed at dismantling mafia clans in several districts of the capital Palermo. Italy's Prime Minister Giorgia Meloni said several alleged mafia bosses were among those arrested and described the sting as a \"very hard blow to Cosa Nostra\". Over 50kg of drugs were also seized. Palermo mayor Roberto Lagalla also praised the operation, said the arrests \"dealt a historic blow to the mafia\". The large-scale sting suggests the organisation, an association of a number of groups, remains a significant criminal force despite setbacks in recent decades. Police said Palermo's mafia families were still coordinating their activities across the city and its province like they used to in the heyday of Cosa Nostra. \n                  Italian court deals controversial Albania migrant scheme another blow\n                 \n                  Italian PM Giorgia Meloni investigated for repatriating Libyan warlord wanted on international arrest warrant\n                 \n                  Handler of Lazio eagle mascot sacked for posting photos online of prosthetic penis after choosing to have implant\n                 They added that inner city families had regained authority compared to the years in which a faction from Corleone - a town outside Palermo - dominated, that was the birthplace of notorious bosses Toto Riina and Bernardo Provenzano. But the Carabinieri police said the group had recently modernised, turning to encrypted smartphones. This allowed the most influential mafia bosses to communicate with one another while avoiding police attention, officers said in a statement. Such was the level of secrecy the method allowed, that one individual on the run for almost two years continued to \"govern the district\" - continue criminal activities in his area - communicating only using the mobiles. Read more from Sky News:Police in 'hopeless position' after High Court rulingWhy is the UK so cold at the moment?Warren Gatland leaves role as Wales rugby head coach The Carabinieri said the use of such devices was \"systematic\". \"We move forward with determination, because the mafia can and must be defeated,\" minister of defence Guido Crosetto said, congratulating police on the arrests. Alongside Tuesday's arrests, additional warrants were also issued for 33 suspects who were already in prison for other crimes. The Carabinieri also said Cosa Nostra continued to attract young people, documenting an example of one new recruit being given \"mafia lessons\" by an older associate. \"The young man was allegedly 'taken in charge' by a suspect who offered him specific instructions... as well as advising him on how to relate to the mafia leaders,\" police said."
    },
    {
        "title": "Luis Rubiales: It was the day in court Spain had been waiting for - but this case goes beyond a kiss",
        "description": "This was the day Spain - but most of all Jenni Hermoso - had been waiting for.",
        "url": "https://news.sky.com/story/luis-rubiales-it-was-the-day-in-court-spain-had-been-waiting-for-but-this-case-goes-beyond-a-kiss-13307374",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-luis-rubiales-kiss_6825462.jpg?20250211124533",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-02-11 18:14:00",
        "Headline": "Rubiales told a court that he did not sexually assault Jenni Hermoso, claiming they shared a moment of joy between friends - a claim at odds with her insistence no consent was given.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n This was the day Spain - but most of all Jenni Hermoso - had been waiting for. The day in court when Luis Rubiales would have to start answering questions about the kiss the player says tarnished the high point of Spanish women's football. Amid the euphoria of the 2023 World Cup final, did the man who once held so much power in football abuse that power with the world watching? No, Rubiales testified, after his trial was shown the kiss on the Sydney podium after Spain's victory over England. \"I've kissed many footballers,\" Rubiales said, while being unable to recall needing to reassure a male player in that manner after missing a penalty, as Hermoso did in the final. This was not a sexual assault, he insisted, but a moment of shared joy between friends. \"She squeezed me very hard under the armpits, lifted me up, and when I went back down I asked her if I can give her a kiss and she said 'OK',\" he said. This contradicted Hermoso's insistence last week in the same courtroom that no consent was given to Rubiales. An expert on lip reading brought in by the defence to verify whether Rubiales asked for a kiss had their claims of expertise called into question due to a lack of formal qualification. And when the focus turned to the sexual harassment protocols for World Cup teams, Rubiales insisted he was not in breach. \"It wasn't in the (code) that someone who asks for permission and that was given after winning a World Cup or in any other circumstances would it be forbidden to give a kiss,\" he claimed. \"It is only forbidden forced sexual violence, and this wasn't.\"  But this is a case that goes beyond a kiss. Rubiales is alleged to have attempted to coerce Hermoso into defending him, asking her to record a video. \"This was a big crisis … and we had to as quickly as possible, get on top of that and respond,\" he said. \"She said to me that she didn't want to, she wanted to celebrate the World Cup win,\" Rubiales said. \"That she had said it well enough in the statement. I said I was grateful for that. So seeing that she didn't want to, I did it alone.\" For weeks Rubiales clung on to power before being forced to resign as Spanish federation president and a vice president at European governing body UEFA. In court there was less of the bravado of 2023 when he attacked a witch hunt bringing him down. And there was even some regret over his conduct. \"I recognised I'd made a mistake, I acted like a player ... and I should have adopted a more institutional role,\" Rubiales said. \"I apologised because of my conduct. I said that it was wrong. I said I got carried away by the emotion and euphoria. I shouldn't have done that.\"Read more:Rubiales 'sure' World Cup kiss was consensualRubiales trial begins over World Cup kiss But it did not, Rubiales said, constitute criminal wrongdoing. And as he left court after finishing giving evidence a scrum of reporters sought more answers. Rubiales did his talking inside the court where the trial is due to continue on Wednesday with three co-defendants to give evidence, including former coach Jorge Vilda. All four men deny wrongdoing."
    },
    {
        "title": "Russia releases American teacher Marc Fogel from prison",
        "description": "An American teacher sentenced to 14 years in a Russian jail has been released and is flying home to be reunited with his family.",
        "url": "https://news.sky.com/story/russia-releases-american-teacher-marc-fogel-from-prison-13307434",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-fogel-marc_6826029.jpg?20250211210706",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-11 20:08:00",
        "Headline": "Mr Fogel's release comes six months after he was excluded from the biggest prisoner swap since the Cold War.",
        "Content": "An American teacher sentenced to 14 years in a Russian jail has been released and is flying home to be reunited with his family. Marc Fogel, 63, was pictured on a flight to the US on Tuesday - more than three years after he was arrested in Moscow for drug smuggling. He was detained after travelling with what his family said was medically prescribed cannabis. In December, the US government designated him as wrongfully detained. Mr Fogel left Russia with Middle East envoy Steve Witkoff in what officials said could help bring about talks to end the Ukraine war. US national security adviser Mike Waltz said: \"President Trump, Steve Witkoff and the president's advisers negotiated an exchange that serves as a show of good faith from the Russians\". \"By tonight, Marc Fogel will be on American soil and reunited with his family and loved ones thanks to President Trump's leadership,\" he added. Moscow has so far not commented and it is unclear what concessions the US might have made. \"We are beyond grateful, relieved, and overwhelmed that after more than three years of detention, our father, husband, and son, Marc Fogel, is finally coming home,\" the family said in a statement. They said their time apart had been \"the darkest and most painful period of our lives\". Mr Waltz said the deal was \"a sign we are moving in the right direction to end the brutal and terrible war in Ukraine\". Donald Trump said last month his administration was involved in \"very serious\" talks with Russia about the future of the conflict. Read more from Sky News:Trump imposes 25% tariffs on steel and aluminium importsArmie Hammer addresses cannibalism and assault allegations Mr Fogel's release comes six months after he was excluded from the biggest prisoner swap since the Cold War. That historic deal won the release of Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan, among others. Russian hitman Vadim Krasikov was among those released from Western prisons in exchange. However, US-Russian national Ksenia Khavana remains locked up after getting a 12-year treason sentence in August related to a $52 donation to a charity benefiting Ukraine."
    },
    {
        "title": "Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government",
        "description": "Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce.",
        "url": "https://news.sky.com/story/elon-musk-joins-donald-trump-in-oval-office-as-he-denies-hostile-takeover-of-us-government-13307516",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250211223932",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 21:52:00",
        "Headline": "The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for\".",
        "Content": " Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce. As head of the Department of Government Efficiency (DOGE), an advisory group, Mr Musk says he wants to add \"common sense controls\" to government and ensure taxpayer money is spent wisely. The executive order requires government agencies to work with DOGE, in some cases so they can be \"eliminated or combined because their functions aren't required by law\". In addition, the agencies have been told to \"hire no more than one employee for every four employees that depart from federal service\", with exceptions for immigration, law enforcement and public safety. Answering reporters' questions in the Oval Office, Mr Musk was asked to respond to accusations he is orchestrating a \"hostile takeover\" of government in a non-transparent way. The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for. And that's what democracy is all about\". \"We have this unelected, fourth unconstitutional branch of government, which is the bureaucracy, which has in a lot of ways, currently more power than any elected representative,\" he added, while stood alongside his son X Æ A-12. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  US defence secretary Pete Hegseth works out with marines ahead of first NATO meeting\n                 \n                  Trump signs order reversing US move to ban plastic straws as he declares paper ones 'don't work'\n                 Mr Musk also spoke about what he described as a lack of Treasury controls. \"Your tax dollars need to be spent wisely on things that matter to the people... it's just common sense. It's not draconian or radical\". When challenged about what checks and balances are in place to ensure accountability for Mr Musk, who is unelected, he replied: \"We are trying to be as transparent as possible... I don't know of a case where an organisation has been more transparent\". 👉 Follow Trump 100 on your podcast app 👈 Another reporter raised the possibility of conflicts of interest, pointing out Mr Musk has received billions of dollars in federal contracts. \"All of our actions are fully public,\" he says, adding that he fully expects to be \"scrutinised nonstop\" - comparing it to \"a daily proctologist exam\" - but also admitting \"we will make mistakes, but we'll also fix the mistakes very quickly\". \"Some of the things that I say will be incorrect and should be corrected,\" he said. \"So nobody can bat 1,000.\" US correspondent This was the most awkward news conference starring the most awkward man, with his son picking his nose. It was quite a remarkable event. The president of the US was justifying a full-scale assault on the federal government in the Oval Office with Elon Musk by his side. There was little in the way of accountability, even if the country did vote for Donald Trump. Nobody saw Elon Musk coming. Nobody saw the half dozen young men that have been sent into these federal agencies to sack people by the thousands. Musk's description of bureaucracy as an unconstitutional branch of government is \"a stretch to say the least\". Over many years, the will of the people has been to construct a bureaucracy to deal with their interests, whether that's social security payments or high finance. At the same time, team Trump is attempting to \"railroad\" their legislation through the courts despite the objections of judges. Earlier on Tuesday, Mr Musk posted an attack aimed at judges who have issued rulings that paused Mr Trump's executive actions. \"Democracy in America is being destroyed by judicial coup,\" Mr Musk wrote on X. The president voiced a similar complaint in the Oval Office alongside Mr Musk. Read more from Sky News:Kanye blocked from selling swastika T-shirts'Historic blow' landed against Sicilian mafiaRussia releases American teacher from prison \"We want to weed out the corruption. And it seems hard to believe that a judge could say, we don't want you to do that,\" he said. \"So maybe we have to look at the judges, because that's very serious. I think it's a very serious violation.\" Mr Trump also held discussions with Jordan's King Abdullah at the White House. The president repeated his pledge to \"take Gaza\" and move its residents to Jordan and Egypt, something the king has rejected."
    },
    {
        "title": "Trump doubles down on plans to 'take Gaza' as he meets Jordan's King Abdullah",
        "description": "Donald Trump has doubled down on US plans to take over Gaza in a meeting with Jordan's King Abdullah II at the White House.",
        "url": "https://news.sky.com/story/trump-doubles-down-on-plans-to-take-gaza-as-he-meets-jordans-king-abdullah-13307476",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-king-abdullah-ii_6825719.jpg?20250211153401",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 20:58:00",
        "Headline": "Donald Trump said the US won't buy Gaza, it will simply \"have it\" - although he appeared to back off on his threat to withhold aid from countries who refused to take forcibly displaced Palestinians.",
        "Content": " Donald Trump has doubled down on US plans to take over Gaza in a meeting with Jordan's King Abdullah II at the White House. The meeting came the day after the president said he would withhold aid to Jordan, Egypt and other Arab countries if they refused to take in people forcibly displaced from Gaza. King Abdullah's \"steadfast position\" - as he laid out on X after the news conference - was \"against the displacement of Palestinians.\" He said Jordan, which is already home to millions of Palestinians, will take in 2,000 children who have cancer or are otherwise unwell. But on taking in more Gazans, he stressed a solution that was \"good for everybody\" - including Americans, the \"people in the region\" and Jordanians - was his priority. However, the King sat quietly as Mr Trump reiterated his plans to displace two million Palestinians, which he said was a \"very small number of people\". Mr Trump also said he believes there will be \"parcels of land\" in Jordan, Egypt and \"someplace else\" where Palestinians will live \"happily and very safely\". \"They only want to be in the Gaza Strip because they don't know anything else, they've never had an alternative,\" Mr Trump said. \"They are being killed there at levels that nobody has ever seen - no place in the world is as dangerous as the Gaza Strip.\" He claims - contrary to what Gazans have said - that \"not one person\" wants to stay in Gaza. Asked to respond to the widespread view among experts in international law that his plan amounts to ethnic cleansing, Mr Trump said: \"We are moving them to a beautiful location.\" However, Trump appeared to ease off his previous threat to withdraw aid to countries that refused to take in people from Gaza. \"Well, I don't want to say that… we don't have to threaten that, I do believe we're above that,\" he said. In the same news conference, Mr Trump said the US won't buy Gaza, it will simply \"have it\". \"We don't have to buy, there's nothing to buy,\" he said.  \"It's a war-torn area, we're going to hold it, we're going to take it… Gaza the way it is, civilisation has been wiped out in Gaza. It's going to be a great economic development.\" He declined to answer how that would work - and how he can avoid spending US taxes running it. Read more:Elon Musk speaks in Oval OfficeIsrael says Gaza truce will end if hostages are not freed 👉 Follow Trump 100 on your podcast app 👈 \"We're going to run it very properly and eventually we'll have economic development at a very large scale\", he said, promising \"peace in the Middle East\". \"With the United States in control of that piece of land... you're going to have stability in the Middle East for the first time. \"The Palestinians, the people who live now in Gaza, will be living beautifully in another location. \"They are going to be living safely - they're not going to be killed, murdered and having to leave every 10 years.\" Trump added that he is 99% sure he will work out a deal with Egypt."
    },
    {
        "title": "Russia releases American teacher Marc Fogel from prison",
        "description": "An American teacher sentenced to 14 years in a Russian jail has been released and is flying home to be reunited with his family.",
        "url": "https://news.sky.com/story/russia-releases-american-teacher-marc-fogel-from-prison-13307434",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-fogel-marc_6826029.jpg?20250211210706",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 20:08:00",
        "Headline": "Mr Fogel's release comes six months after he was excluded from the biggest prisoner swap since the Cold War.",
        "Content": "An American teacher sentenced to 14 years in a Russian jail has been released and is flying home to be reunited with his family. Marc Fogel, 63, was pictured on a flight to the US on Tuesday - more than three years after he was arrested in Moscow for drug smuggling. He was detained after travelling with what his family said was medically prescribed cannabis. In December, the US government designated him as wrongfully detained. Mr Fogel left Russia with Middle East envoy Steve Witkoff in what officials said could help bring about talks to end the Ukraine war. US national security adviser Mike Waltz said: \"President Trump, Steve Witkoff and the president's advisers negotiated an exchange that serves as a show of good faith from the Russians\". \"By tonight, Marc Fogel will be on American soil and reunited with his family and loved ones thanks to President Trump's leadership,\" he added. Moscow has so far not commented and it is unclear what concessions the US might have made. \"We are beyond grateful, relieved, and overwhelmed that after more than three years of detention, our father, husband, and son, Marc Fogel, is finally coming home,\" the family said in a statement. They said their time apart had been \"the darkest and most painful period of our lives\". Mr Waltz said the deal was \"a sign we are moving in the right direction to end the brutal and terrible war in Ukraine\". Donald Trump said last month his administration was involved in \"very serious\" talks with Russia about the future of the conflict. Read more from Sky News:Trump imposes 25% tariffs on steel and aluminium importsArmie Hammer addresses cannibalism and assault allegations Mr Fogel's release comes six months after he was excluded from the biggest prisoner swap since the Cold War. That historic deal won the release of Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan, among others. Russian hitman Vadim Krasikov was among those released from Western prisons in exchange. However, US-Russian national Ksenia Khavana remains locked up after getting a 12-year treason sentence in August related to a $52 donation to a charity benefiting Ukraine."
    },
    {
        "title": "OpenAI co-founder tells Sky News his platform is 'not for sale'",
        "description": "OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (&#163;78.7bn) bid overnight. ",
        "url": "https://news.sky.com/story/openai-co-founder-sam-altman-tells-sky-news-his-platform-can-be-safer-13307024",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-altman-openai_6825170.jpg?20250210224002",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 09:24:00",
        "Headline": "Sam Altman, who is attending the Paris AI Summit with world leaders, said the company is not for sale after Elon Musk's $97.4bn bid for the platform.",
        "Content": " OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (£78.7bn) bid overnight.  Sam Altman, who is attending the Paris AI Summit with world leaders, was asked whether he can still afford OpenAI after Mr Musk's bid. \"The board will decide what to do there... the mission is really important and we're totally focused on making sure we preserve that,\" he told Sky's science and technology editor Tom Clarke on Tuesday morning. \"The company is not for sale, neither is the mission,\" he said. OpenAI is planning to transition to a for-profit company which Mr Musk has vehemently opposed. He has even launched legal action over it. \"It's time for OpenAI to return to the open-source, safety-focused force for good it once was,\" Mr Musk - who was also a co-founder of OpenAI - said in a statement on Monday. \"We will make sure that happens.\" Mr Altman also said he would like to \"work with China\" although he doesn't know if the US government would let him do that. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties\n                 \n                  Older people in England happier and more satisfied now than before COVID, researchers say\n                 \"Should we try as hard as we absolutely can [to work with them]? Yes,\" he said.  Chinese company DeepSeek sent shockwaves through the AI industry a fortnight ago, when it revealed a powerful AI model that was significantly cheaper than OpenAI's ChatGPT. US officials have raised security concerns about the company, however, and it is already banned on some government devices. Read more from Sky News:Teacher admits stabbing girl, 7, to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark Mr Altman was asked if he can reassure users that one of the fastest-growing generative AI platforms will continue to put safety at the forefront of what the company does. He said his platform can be safer amid concerns that red tape around artificial intelligence will be resisted as businesses say it stifles innovation. \"Safety is integral to what we do... We've got to make these systems really safe for people, or people just won't use them. It's the same thing and we'll work super hard on that,\" said Mr Altman. Acknowledging that safety is not high on the summit's agenda, he added: \"That's not actually the main thing that we've been hearing about - the main concern has been 'can we make this cheaper, can you have more of it, can we get it better and more advanced'.\" But asked if OpenAI can look at all of those elements as well as safety, he added: \"Yes, we can also do that.\" It comes as US vice president JD Vance warned that \"excessive regulation\" would kill the rapidly growing AI industry. \"Now, at this moment, we face the extraordinary prospect of a new industrial revolution, one on par with the invention of the steam engine,\" he said. \"But it will never come to pass if overregulation deters innovators from taking the risks necessary to advance the ball.\" In his first foreign trip as vice president, Mr Vance said President Trump's administration will \"ensure that AI systems developed in America are free from ideological bias\". He said the United States would \"never restrict our citizens' right to free speech.\""
    },
    {
        "title": "Steve Bannon avoids jail after admitting fraud in We Build The Wall case",
        "description": "Former Trump ally Steve Bannon has pleaded guilty to fraud after donors who gave money to help build a wall on the US border were duped. ",
        "url": "https://news.sky.com/story/steve-bannon-avoid-jails-after-admitting-fraud-in-us-mexico-border-wall-case-13307288",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-bannon-fraud_6825753.jpg?20250211160524",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:52:00",
        "Headline": "Bannon originally faced a federal prosecution over the matter but Donald Trump pardoned him at the end of his first stint in the White House.",
        "Content": "Former Trump ally Steve Bannon has pleaded guilty to fraud after donors who gave money to help build a wall on the US border were duped.  The 71-year-old will avoid jail after getting a three-year conditional discharge as part of a plea deal. Bannon had been accused of falsely promising donors that all money given to the We Build the Wall campaign would go towards a wall on the US-Mexico border. But prosecutors said hundreds of thousands of dollars were diverted to enrich him and others involved in the project. Bannon, Donald Trump's former chief strategist, pleaded guilty to one scheme to defraud count on Tuesday, but as he left the New York court said he felt like \"a million bucks\". He'd called the case, which was due to go to trial next month, a \"political persecution\" and now wants US attorney general Pam Bondi to investigate those who pursued him. In November, a judge said prosecutors could show the jury an email they said showed Bannon was concerned the fundraising was \"a scam\". \n                  Former Donald Trump aide Steve Bannon 'proud' as he begins prison sentence in Connecticut\n                 \n                  Steve Bannon must report to prison after longtime Donald Trump ally loses bid to stay out of jail\n                 \n                  Donald Trump ally Steve Bannon ordered to report to prison to begin contempt sentence\n                 An email from him allegedly said: \"Poor Americans shouldn't be using hard-earned money to chase something not doable.\" But last month his lawyers asked the judge to throw out the case, dismissing it as an \"unconstitutional selective enforcement of the law\". Bannon initially pleaded not guilty in September 2022 to a state court indictment charging him with fraud, money laundering and conspiracy. Read more from Sky News:Trump issues Gaza ceasefire ultimatumWest's shopping platform taken down over swastika T-shirts The We Build the Wall campaign was launched in 2018 after Bannon was fired by Mr Trump during his first presidency. It raised over $20m and built a few miles of fencing but ran into trouble with officials and was criticised by Mr Trump himself - despite a border wall being one of his main policies. Bannon was originally facing a federal prosecution but Mr Trump pardoned him at the end of his first stint in the White House. Two others involved in the project, Brian Kolfage and Andrew Badolato, admitted federal charges and went to prison. A third defendant, Timothy Shea, also got a jail term. Bannon last year served four months in an unrelated case - for defying a subpoena in the investigation into the US Capitol riots - but was released in October."
    },
    {
        "title": "Kanye West's Yeezy online shopping platform taken down over swastika T-shirts",
        "description": "Kanye West's Yeezy online shopping platform has been taken down after selling T-shirts featuring a swastika.",
        "url": "https://news.sky.com/story/kanye-wests-yeezy-online-shopping-platform-taken-down-over-swastika-t-shirts-13307276",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kanye-west-bianca-censori_6825747.jpg?20250211160033",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:33:00",
        "Headline": "The T-shirts were accompanied by the label \"HH-01\", understood to be code for \"Heil Hitler\". On Monday the rapper deactivated his account on X after coming under pressure for posting antisemitic messages. ",
        "Content": "Kanye West's Yeezy online shopping platform has been taken down after selling T-shirts featuring a swastika. The rapper, also known as Ye, used a Super Bowl commercial on Sunday to send people to his website to buy the clothing emblazoned with the Nazi symbol - an image often used by the extreme-right. The ecommerce platform Shopify, which hosts many online shops and businesses, has deactivated his site. Shopify said in an emailed statement to Sky News' partner network NBC News: \"All merchants are responsible for following the rules of our platform. This merchant did not engage in authentic commerce practices and violated our terms so we removed them from Shopify.\" West's representative is yet to respond to a request from NBC for comment. The white T-shirts featured a black swastika on the front and were the only items for sale on the front page of yeezy.com. No text or explanation accompanied the $20 (£16) item, just the letters \"HH-01\", which the Anti-Defamation League (ADF) said was code for \"Heil Hitler\". West's site showed a notice from Shopify which said the store was \"unavailable\". The decision to sell the T-shirt triggered widespread criticism, including from the ADF which posted a statement on X on Monday, describing the shirt sales as \"further proof\" of West's antisemitism. The organisation, formed to combat anti-Jewish bigotry and discrimination, explained that the swastika was adopted by Hitler and \"continues to threaten and instil fear in those targeted by antisemitism and white supremacy\". Read more from Sky News:Steve Bannon avoids jail after admitting fraudUkraine targets fuel used by Russian militaryArmie Hammer addresses cannibalism claims West has in recent days been posting antisemitic messages on X, as well as writing \"I love Hitler\" and \"I'm a Nazi\". His account then had a \"sensitive content warning\" added to it before he posted a final message. \"I'm logging out of Twitter,\" he wrote. \"I appreciate [X owner] Elon [Musk] for allowing me to vent.\" After his account was deactivated on Monday, his spokesperson Milo Yiannopoulos issued an explanation. \"Ye is an intergenerational artist and icon who continues to redefine the limits of creativity and free expression. He has deactivated his X account for the time being,\" he said in a statement. The Campaign Against Antisemitism was joined by Friends star David Schwimmer in calling for Elon Musk to remove West from X over a string of offensive posts. One of the most successful figures in hop-hip, West built up a fashion brand called Yeezy which began as a collaboration with Adidas. But the German sportswear giant cut ties with him in 2022 over his antisemitic remarks and eventually reached a settlement in October."
    },
    {
        "title": "Trump imposes 25% tariffs on all steel and aluminium imports",
        "description": "Donald Trump has signed two proclamations imposing 25% tariffs on all steel and aluminium imports to the US.",
        "url": "https://news.sky.com/story/trump-imposes-25-tariffs-on-all-steel-and-aluminium-imports-13306942",
        "image_url": "https://e3.365dm.com/18/03/1920x1080/skynews-steel-us_4250756.jpg?20180309035248",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-11 02:13:00",
        "Headline": "\"This is a big deal,\" Donald Trump said in the Oval Office as he announced the tariffs. \"The beginning of making America rich again.\"",
        "Content": " Donald Trump has signed two proclamations imposing 25% tariffs on all steel and aluminium imports to the US. A proclamation is a form of presidential directive to government officials, but they do not carry the force of law, as an executive order would. However the White House has said the tariffs will take effect from 4 March. \"This is a big deal,\" Mr Trump said in the Oval Office as he announced the tariffs. \"The beginning of making America rich again.\" He added: \"We were being pummelled by both friend and foe alike.\" Read moreAnalysis: Trump's steel and aluminium tariffs target a deeper issueTrump issues Gaza ceasefire ultimatum to HamasAnalysis: The country that could benefit most from Trump tariffs The proclamations mean the president has now removed the exceptions and exemptions from his 2018 tariffs on steel to allow for all imports of the metal to be taxed at 25%. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Trump doubles down on plans to 'take Gaza' as he meets Jordan's King Abdullah\n                 \n                  FBI uncovers thousands of secret JFK assassination files after Trump order\n                 The new tariff on aluminium is also much higher than the 10% duty he imposed on the material in his first term. The tariffs are part of an aggressive push by Mr Trump to reset global trade, as he claims that price hikes on the people and companies buying foreign-made products will ultimately strengthen domestic manufacturing. Outside economic analyses suggest the tariffs would increase costs for the factories that use steel and aluminium, possibly leaving US manufacturers worse off. European Commission president Ursula von der Leyen responded: \"Unjustified tariffs on the EU will not go unanswered -they will trigger firm and proportionate countermeasures\". Canada, the largest source of steel imports to the US, also criticised the move. Candace Laing, CEO of the Canadian Chamber of Commerce, said Mr Trump was destabilising the global economy. \"Today's news makes it clear that perpetual uncertainty is here to stay,\" she said. Economics and data editor At least part of the idea behind tariffs is to bring some production back to the US, but imposing them will have consequences. What kinds of consequences? Well, at its simplest, tariffs push up prices. This is, when you think about it, blindingly obvious.  A tariff is a tax on a good entering the country. So if aluminium and steel are going up in price then that means, all else equal, that the cost of making everything from aircraft wings to steel rivets also goes up. That in turn means consumers end up paying the price - and if a company can't make ends meet in the face of these tariffs, it means job losses - possibly within the very industrial sectors the president wants to protect. So says the economic theory. But in practice, economics isn't everything.  There are countless examples throughout history of countries defying economic logic in search of other goals. Perhaps they want to improve their national self-reliance in a given product; perhaps they want to ensure certain jobs in cherished areas or industries are protected.  But nothing comes for free, and even if Donald Trump's tariffs succeed in persuading domestic producers to smelt more aluminium or steel, such things don't happen overnight.  In the short run, it's hard to see how these tariffs wouldn't be significantly inflationary. Trump's war of tariffs Mr Trump's proclamations come days after the US imposed a 10% tariff on all goods imported from China. In return, China imposed 10% tariffs on American crude oil, agricultural machinery, large-displacement cars and pickup trucks. There will also be 15% tariffs on coal and liquefied natural gas from the US. US plans to impose 25% tariffs on Mexico and Canada were paused after agreements were reached on border security. Mexico's president said she was sending 10,000 National Guard troops to the US border immediately in return for a tariff delay. Mr Trump said the Mexican soldiers would be \"specifically designated\" to stop the flow of fentanyl into the US, as well as illegal migrants. Meanwhile, Canada's prime minister Justin Trudeau said almost 10,000 frontline personnel \"are and will be working on protecting the border\". He added that his country was appointing a \"fentanyl czar\", drug cartels would be listed as terrorists, and there would be \"24/7 eyes on the border\"."
    },
    {
        "title": "The new, even unlikely partnerships that Europe could forge in response to Trump's tariffs",
        "description": "The European Union owes its origins to a trade agreement that involved coal and steel. ",
        "url": "https://news.sky.com/story/the-new-even-unlikely-partnerships-that-europe-could-forge-in-response-to-trumps-tariffs-13307112",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-breakfast_6821407.jpg?20250206153927",
        "type": "US",
        "Author": "Adam Parsons",
        "Date Published": "2025-02-11 11:43:00",
        "Headline": "The consequence of US tariffs on goods could see European nations developing closer trade relationships with China, which has always been seen as a less palatable and less reliable partner than America, and others.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n The European Union owes its origins to a trade agreement that involved coal and steel.  At its very heart is a belief that free trade between partners is a fundamentally good thing. Nothing is more certain to upset policymakers in Brussels than the spectre of swingeing tariffs. They saw this coming, of course. Leaders in both Paris and Berlin already made it clear that the EU was ready to respond, while bemoaning the whole thing. On Tuesday, European Union chief Ursula von der Leyen vowed to retaliate against US President Donald Trump imposing tariffs on steel and aluminium. \"The EU will act to safeguard its economic interests,\" Ms von der Leyen said in a statement. \"Tariffs are taxes - bad for business, worse for consumers,\" she said. \"Unjustified tariffs on the EU will not go unanswered - they will trigger firm and proportionate countermeasures.\" \n                  Customs union, youth mobility or PEM convention: What exactly could the UK-EU reset look like?\n                 \n                  EU facing pressure to drop Rwanda mineral deal over DRC involvement - but fears China could step in\n                 \n                  How does Starmer keep Trump's US and the EU sweet? \n                  Talk to diplomats across Europe and they'll almost all tell you the same thing - that nobody wins from a trade war. But beyond the anger and diplomatic fret, there is something else that could happen now, and strain relations with Washington even more. Read more from Sky News:Trump imposes 25% tariffs on all steel and aluminium importsTrump tariff threat saw US imports hit record high European leaders, with a few exceptions, are nowhere near to adopting the same protectionist viewpoint as President Trump. That means that, if they think American markets are being closed off to them, then they will look for new places to sell goods. And that is likely to lead in three directions. Firstly China, which has always been seen as a less palatable and less reliable partner than America . Now, that judgment is likely to be revised. Secondly, they will look at India, where a comprehensive trade agreement remains outstanding, despite growing bilateral trade. And, thirdly, the EU will look at South America, another growing market. And that wouldn't just affect trade. If Europe develops closer economic relations with China, India, Brazil and others, then that's bound to affect a welter of other geopolitical deals - exactly the sort of things that annoy and worry American presidents. The consequence of American tariffs could see European nations forging new, and even unlikely partnerships, just as the old transatlantic friendship comes under strain."
    },
    {
        "title": "Has Elon Musk just put OpenAI in a tricky situation?",
        "description": "The AI summit in Paris is a coming together of world leaders and technology firms designed to shape a responsible and sustainable future for artificial intelligence.",
        "url": "https://news.sky.com/story/has-elon-musk-just-put-openai-in-a-tricky-situation-13307200",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-elon-musk-sam-altman_6825606.jpg?20250211143453",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2025-02-11 13:40:00",
        "Headline": "Elon Musk's $97.4bn (£78.7bn) bid for OpenAI is part of a long-running feud between the pair, who co-founded OpenAI as a non-profit entity for the benefit of humanity.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n The AI summit in Paris is a coming together of world leaders and technology firms designed to shape a responsible and sustainable future for artificial intelligence. But the big political day of the summit was overshadowed by a bust-up between rival billionaire tech-bros. Timed perfectly to coincide with OpenAI chief executive Sam Altman's arrival in Paris, Elon Musk put in a formal $97.4 (£78.7bn) billion offer to buy OpenAI. Read more: OpenAI co-founder tells Sky News his platform is 'not for sale' It would be easy to write it off as a typically mischievous play by Mr Musk. But his move is calculated and potentially very problematic for Mr Altman. OpenAI, which brought the world ChatGPT, is one of the global leaders in AI. Mr Altman has ambitious plans for growth. But in order to deliver on them, he wants to free OpenAI from the non-for-profit company that owns it.  That involves him essentially buying his own company from the non-profit board that formally owns it. It's rumoured the sum he was considering paying was around $40bn (£32.3bn). \n                  In China's Silicon Valley, where founder of DeepSeek Liang Wenfeng keeps a low profile\n                 \n                  Musk v Altman: The battle to become king of AI\n                 \n                  Elon Musk launches $97bn bid to buy ChatGPT-maker OpenAI\n                 So Musk's far higher offer puts the not-for-profit board in a tricky situation. If they refuse Mr Musk's offer, can they accept a far lower one from Mr Altman and still be doing their job according to the rules of the company's non-profit status? Or could Mr Musk have effectively forced Mr Altman to pay more than double for his own company? Read more from Sky News:Teacher admits stabbing girl to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark It's part of a long-running feud between the pair, who co-founded OpenAI as a non-profit entity for the benefit of humanity. And one that won't be of much interest to the political leaders convening in Paris. But it does speak to a concern AI safety campaigners have long held when it comes to the technology. How can we trust AI when it's controlled by a few, often capricious, billionaires? What further worries campaigners is that AI safety and regulation have been given short-shrift at the summit. In his address, US vice president JD Vance said the new \"industrial revolution\" that AI promises \"will never come to pass if overregulation deters innovators from taking the risks necessary\". European leaders, who have long held a tougher stance on AI regulation, seem to be softening their stance too. Concerned, perhaps, that if they don't follow America they won't be able to attract AI firms to their countries and have their own share of the power AI promises to bring."
    },
    {
        "title": "Heathrow set to announce multibillion-pound investment - as it prepares proposal for third runway",
        "description": "Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway.",
        "url": "https://news.sky.com/story/heathrow-set-to-announce-multibillion-pound-investment-as-it-prepares-proposal-for-third-runway-13307372",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-heathrow-terminal-five_6826084.jpg?20250211215936",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-11 18:20:00",
        "Headline": "Plans for a third Heathrow runway will be with the government \"by summer\", the airport has said, amid projections it could be decades before the project is completed, if at all.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway. The UK's biggest airport has announced a \"once-in-a-generation investment\" beginning this year to improve existing buildings and boost passenger numbers. The development is separate from a new runway - which the government recently announced support for - and will be funded by Heathrow shareholders with airlines and customers charged for the expanded services. Money blog: Major lender cuts mortgage rates below 4% As part of the investment, the capacity of terminals two and five will be increased and the layout of the airfield will be reconfigured in a bid to improve punctuality and to increase the number of aircraft stands. In a speech on Wednesday, chief executive Thomas Woldbye is expected to say: \"This privately-funded programme will upgrade existing infrastructure while laying the groundwork for a third runway, boosting UK investment and economic growth, with tangible benefits felt this year.\" Heathrow was last month criticised by Europe's largest airline Ryanair for being \"incredibly operationally inefficient\". Because of this, Ryanair chief executive Michael O'Leary said the airline had no interest in and would \"never\" fly from the airport, even if it were free. \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 \n                  Heathrow Airport: The case for and against a third runway\n                 \n                  Money and public backlash are not the only issues Heathrow expansion plans face\n                 Proposals for a third runway will be submitted to the government \"by summer\", the airport said, after Chancellor Rachel Reeves backed the expansion as part of her aim of growing the economy. The support is seen as controversial as many senior Labour politicians such as London mayor Sadiq Khan and cabinet members including Energy Secretary Ed Miliband have long opposed a third runway on environmental and health grounds.  It's unclear how the additional carbon emissions from the extra flights would be compatible with the state's legally binding 2050 emissions reduction targets. A third runway? Doubt has been cast over whether a runway could even be built during Labour's time in power. The process would have to be planned and approved before construction could begin.  Rivers and the M25 road would have to be diverted and hundreds of homes would need to be demolished as part of construction. Ryanair's Mr O'Leary said the chance of it being built was \"slim\" but it could be 2050 even if it does get built. A question over the third runway's ability to boost the economy was raised by left-leaning thinktank the New Economics Foundation (NEF) According to its analysis, growth in the number of business travellers - who may grow commercial links - has ceased and instead, passenger growth has been driven by wealthy British residents rather than foreign tourists entering the country. The air travel industry is also one of the poorest job creators in the economy per pound of revenue, the NEF said, while the environmental downsides of more flights are \"significant\". Steel pact  As part of interim, pre-third runway expansion Heathrow signed a charter to maximise opportunities for the use of British steel, a move welcomed by steel bosses, unions and the government."
    },
    {
        "title": "Deliveroo plots route to naming successor to founding CEO Shu",
        "description": "The entrepreneur who masterminded Deliveroo's evolution into one of Britain's biggest consumer technology businesses is preparing to hand over the reins to a new chief executive.",
        "url": "https://news.sky.com/story/deliveroo-plots-route-to-naming-successor-to-founding-ceo-shu-13307192",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-will-shu-deliveroo_5297297.jpg?20250211175755",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-11 13:33:00",
        "Headline": "Will Shu, who launched Deliveroo in London in 2013, could step down as its CEO as soon as this year under one scenario discussed by the company's board, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The entrepreneur who masterminded Deliveroo's evolution into one of Britain's biggest consumer technology businesses is preparing to hand over the reins to a new chief executive. Sky News has learnt that Will Shu, who set the company up in 2013 and participated in its delivery service himself, is contemplating stepping back as CEO as soon as this year. Under one scenario being discussed by Deliveroo's board, chaired by Claudia Arney, Mr Shu could leave the role in the autumn. Money blog: Britons told to holiday at Easter - or face astronomical summer prices Carlo Mocci, the company's chief business officer, is said to be the leading internal candidate to replace Mr Shu, although sources insisted on Tuesday that no decisions about a replacement had been taken by Deliveroo's board. Other succession planning scenarios are also said to be under consideration, including a number which could mean Mr Shu remaining in place for longer. At least one executive search firm is said to be engaged by Deliveroo on the project. \n                  Deliveroo achieves first ever profit as average customer spend rises\n                 \n                  Delivery riders to strike again as takeaway volumes fell during last walkout\n                 \n                  Deliveroo, Just Eat, Uber Eats strikes set to hit Fridays and holidays, drivers warn\n                 One source added that Deliveroo did not plan to make a public announcement about leadership changes for some time. Mr Shu has become one of the most prominent business leaders in Britain, steering a business which now employs thousands of people and partners with some of the country's best-known restaurant brands, including McDonald's, PizzaExpress and Wagamama. Under his leadership, it has also broadened its offering to groceries, with partners such as the Co-op, Sainsbury's and Waitrose. It has also encountered severe reputational challenges, notably over its treatment of so-called gig economy workers and their lack of employment rights. Deliveroo was privately held for most of its first decade in existence, attracting big-name technology investors before, in 2019, Amazon swooped to buy a sizeable minority stake in the company. The deal drew scrutiny from competition authorities, but was eventually approved the following year. That was widely expected to be the prelude to a full takeover bid from the internet behemoth, but such an offer never materialised. Instead, Deliveroo opted to go public in 2021 in London, leading to what critics dubbed the worst such public share sale in history. Initially priced at 390p-a-share - which gave Deliveroo a valuation of £7.6bn - the stock tumbled on its debut, ending its first day of trading at 284p. In recent months there has been growing speculation that Deliveroo will attract a takeover offer from an international suitor. Berlin-based Delivery Hero sold its 4.5% stake in Deliveroo last year for roughly £77m, although more recent market chatter has centred on Doordash, the American takeaway delivery service. A golden share held by Mr Shu that was put in place at the time of its IPO expired last year, removing the company's automatic protection against any unwanted bid. On Tuesday afternoon, Deliveroo shares were trading at around 138.5p, giving the company a market capitalisation of about £2.13bn. The stock has risen by about 15% over the last year. A Deliveroo spokesperson said: \"In response to rumours in the media, the company confirms that there are no plans for Will to step down. \"Will remains relentlessly focused on the long-term future of Deliveroo and delivering for consumers, merchants and riders.\""
    },
    {
        "title": "OpenAI co-founder tells Sky News his platform is 'not for sale'",
        "description": "OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (&#163;78.7bn) bid overnight. ",
        "url": "https://news.sky.com/story/openai-co-founder-sam-altman-tells-sky-news-his-platform-can-be-safer-13307024",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-altman-openai_6825170.jpg?20250210224002",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-11 09:24:00",
        "Headline": "Sam Altman, who is attending the Paris AI Summit with world leaders, said the company is not for sale after Elon Musk's $97.4bn bid for the platform.",
        "Content": " OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (£78.7bn) bid overnight.  Sam Altman, who is attending the Paris AI Summit with world leaders, was asked whether he can still afford OpenAI after Mr Musk's bid. \"The board will decide what to do there... the mission is really important and we're totally focused on making sure we preserve that,\" he told Sky's science and technology editor Tom Clarke on Tuesday morning. \"The company is not for sale, neither is the mission,\" he said. OpenAI is planning to transition to a for-profit company which Mr Musk has vehemently opposed. He has even launched legal action over it. \"It's time for OpenAI to return to the open-source, safety-focused force for good it once was,\" Mr Musk - who was also a co-founder of OpenAI - said in a statement on Monday. \"We will make sure that happens.\" Mr Altman also said he would like to \"work with China\" although he doesn't know if the US government would let him do that. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties\n                 \n                  Older people in England happier and more satisfied now than before COVID, researchers say\n                 \"Should we try as hard as we absolutely can [to work with them]? Yes,\" he said.  Chinese company DeepSeek sent shockwaves through the AI industry a fortnight ago, when it revealed a powerful AI model that was significantly cheaper than OpenAI's ChatGPT. US officials have raised security concerns about the company, however, and it is already banned on some government devices. Read more from Sky News:Teacher admits stabbing girl, 7, to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark Mr Altman was asked if he can reassure users that one of the fastest-growing generative AI platforms will continue to put safety at the forefront of what the company does. He said his platform can be safer amid concerns that red tape around artificial intelligence will be resisted as businesses say it stifles innovation. \"Safety is integral to what we do... We've got to make these systems really safe for people, or people just won't use them. It's the same thing and we'll work super hard on that,\" said Mr Altman. Acknowledging that safety is not high on the summit's agenda, he added: \"That's not actually the main thing that we've been hearing about - the main concern has been 'can we make this cheaper, can you have more of it, can we get it better and more advanced'.\" But asked if OpenAI can look at all of those elements as well as safety, he added: \"Yes, we can also do that.\" It comes as US vice president JD Vance warned that \"excessive regulation\" would kill the rapidly growing AI industry. \"Now, at this moment, we face the extraordinary prospect of a new industrial revolution, one on par with the invention of the steam engine,\" he said. \"But it will never come to pass if overregulation deters innovators from taking the risks necessary to advance the ball.\" In his first foreign trip as vice president, Mr Vance said President Trump's administration will \"ensure that AI systems developed in America are free from ideological bias\". He said the United States would \"never restrict our citizens' right to free speech.\""
    },
    {
        "title": "Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government",
        "description": "Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce.",
        "url": "https://news.sky.com/story/elon-musk-joins-donald-trump-in-oval-office-as-he-denies-hostile-takeover-of-us-government-13307516",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250211223932",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-11 21:52:00",
        "Headline": "The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for\".",
        "Content": " Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce. As head of the Department of Government Efficiency (DOGE), an advisory group, Mr Musk says he wants to add \"common sense controls\" to government and ensure taxpayer money is spent wisely. The executive order requires government agencies to work with DOGE, in some cases so they can be \"eliminated or combined because their functions aren't required by law\". In addition, the agencies have been told to \"hire no more than one employee for every four employees that depart from federal service\", with exceptions for immigration, law enforcement and public safety. Answering reporters' questions in the Oval Office, Mr Musk was asked to respond to accusations he is orchestrating a \"hostile takeover\" of government in a non-transparent way. The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for. And that's what democracy is all about\". \"We have this unelected, fourth unconstitutional branch of government, which is the bureaucracy, which has in a lot of ways, currently more power than any elected representative,\" he added, while stood alongside his son X Æ A-12. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  US defence secretary Pete Hegseth works out with marines ahead of first NATO meeting\n                 \n                  Trump signs order reversing US move to ban plastic straws as he declares paper ones 'don't work'\n                 Mr Musk also spoke about what he described as a lack of Treasury controls. \"Your tax dollars need to be spent wisely on things that matter to the people... it's just common sense. It's not draconian or radical\". When challenged about what checks and balances are in place to ensure accountability for Mr Musk, who is unelected, he replied: \"We are trying to be as transparent as possible... I don't know of a case where an organisation has been more transparent\". 👉 Follow Trump 100 on your podcast app 👈 Another reporter raised the possibility of conflicts of interest, pointing out Mr Musk has received billions of dollars in federal contracts. \"All of our actions are fully public,\" he says, adding that he fully expects to be \"scrutinised nonstop\" - comparing it to \"a daily proctologist exam\" - but also admitting \"we will make mistakes, but we'll also fix the mistakes very quickly\". \"Some of the things that I say will be incorrect and should be corrected,\" he said. \"So nobody can bat 1,000.\" US correspondent This was the most awkward news conference starring the most awkward man, with his son picking his nose. It was quite a remarkable event. The president of the US was justifying a full-scale assault on the federal government in the Oval Office with Elon Musk by his side. There was little in the way of accountability, even if the country did vote for Donald Trump. Nobody saw Elon Musk coming. Nobody saw the half dozen young men that have been sent into these federal agencies to sack people by the thousands. Musk's description of bureaucracy as an unconstitutional branch of government is \"a stretch to say the least\". Over many years, the will of the people has been to construct a bureaucracy to deal with their interests, whether that's social security payments or high finance. At the same time, team Trump is attempting to \"railroad\" their legislation through the courts despite the objections of judges. Earlier on Tuesday, Mr Musk posted an attack aimed at judges who have issued rulings that paused Mr Trump's executive actions. \"Democracy in America is being destroyed by judicial coup,\" Mr Musk wrote on X. The president voiced a similar complaint in the Oval Office alongside Mr Musk. Read more from Sky News:Kanye blocked from selling swastika T-shirts'Historic blow' landed against Sicilian mafiaRussia releases American teacher from prison \"We want to weed out the corruption. And it seems hard to believe that a judge could say, we don't want you to do that,\" he said. \"So maybe we have to look at the judges, because that's very serious. I think it's a very serious violation.\" Mr Trump also held discussions with Jordan's King Abdullah at the White House. The president repeated his pledge to \"take Gaza\" and move its residents to Jordan and Egypt, something the king has rejected."
    },
    {
        "title": "Octopus Energy wades into battle for Thames Water's future",
        "description": "Octopus Energy Group is wading into the battle for the future of Britain's biggest water company as part of a consortium which includes the French infrastructure giant Suez.",
        "url": "https://news.sky.com/story/octopus-energy-wades-into-battle-for-thames-water8217s-future-13307039",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777659.jpg?20241216120405",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-11 10:10:00",
        "Headline": "The energy supplier's technology arm, Kraken, has struck a deal to partner with Covalis Capital and Suez in a consortium that would inject about £1bn of equity into the debt-laden water company, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Octopus Energy Group is wading into the battle for the future of Britain's biggest water company as part of a consortium which includes the French infrastructure giant Suez. Sky News has learnt that Octopus Energy - which recently overtook British Gas as Britian's biggest household gas and electricity supplier - has struck an agreement that would see its technology arm managing Thames Water's 16 million customers. The deal with Kraken would provide Covalis Capital, the infrastructure investor spearheading the consortium, with critical technology expertise as it seeks to manage one of the UK's most complex utilities - and one with a long-standing reputation for poor customer service. Earlier reports said that Covalis would inject about £1bn into Thames Water, with £4bn more raised from asset sales, refinancing and a stock market listing. Money latest: My company cut my pay by £700 to cover NI rise Some industry sources have expressed doubts about the feasibility of such a plan. The emergence of Octopus Energy's involvement in the Thames Water crisis underlines the scale of Kraken's ambitions as it further extends its reach beyond the energy sector. \n                  Investment giant KKR advances plan for Thames Water rescue bid\n                 \n                  Thames Water seeks High Court approval for rescue plan\n                 \n                  Thames Water fined £18m by Ofwat for breaking shareholder payment rules\n                 Earlier this week, TalkTalk became the first major broadband provider to join the Kraken platform. Wholly owned by Octopus Energy, Kraken now manages more than 60 million customer accounts globally, of which roughly five million are water company customers. The consortium comprising Covalis, Suez and Octopus Energy was among fewer than a handful which tabled indicative offers to help Thames Water raise roughly £3bn in fresh equity ahead of a deadline on Monday. CK Infrastructure Holding and Castle Water are also understood to have submitted proposals, while the private equity behemoth KKR remains interested but did not lodge an offer, according to insiders. This week's deadline was in any case regarded as arbitrary and meaningless because two other crucial determinants of Thames Water's future have yet to become clear. One is the outcome of a court battle between the water company's class A and class B bondholders, both of which have said they want to lend a further £3bn to help Thames Water survive. The company has backed the class A plan despite the fact that it will saddle Thames Water with higher interest payments at a time when its creaking balance sheet has left it on the brink of temporary nationalisation. The second major uncertainty is whether Thames Water plans to appeal against an Ofwat ruling that it can increase customer bills by 35% over the next five-year regulatory period, rather than the 53% it had requested. Thames Water must decide within days whether to formally appeal to the Competition and Markets Authority. Prospective equity investors regard both those events as material to their investment case, with a preferred bidder not expected to be chosen by the company and its advisers at Rothschild until April. Thames Water was plunged deeper into crisis last year when its existing shareholders - comprising a combination of sovereign wealth funds and pension funds - declared the company \"uninvestible\" and reneged on a commitment to provide billions of pounds in new funding. The government has said it does not regard a special administration regime (SAR) as a desirable outcome, although an adverse outcome from the bondholders' legal fight or inability to secure additional equity could render the company insolvent. Laden with £19bn of debt, Thames Water has already warned that it will run out of money next month. Read more from Sky News:Bank of England rate-setter argues bigger cut was warrantedUS imposes tariffs on all steel and aluminium importsMusk's $97bn bid to buy OpenAI The only other major example of a SAR process was that involving Bulb Energy, which collapsed in 2021. Its 1.5 million-strong customer base was bought by Octopus Energy, with their accounts transferred onto Kraken within six months. Kraken, which works with UK water companies including Severn Trent and Portsmouth Water, says that it reduces water leakages, and reduces costs for both companies and customers. Octopus Energy declined to comment on Tuesday."
    },
    {
        "title": "UK needs 'cool and clear-headed' response to Trump tariffs on British steel, minister says",
        "description": "The UK needs a \"cool and clear-headed\" response to Donald Trump imposing 25% tariffs on British steel exports, the trade minister has said.",
        "url": "https://news.sky.com/story/uk-needs-cool-and-clear-headed-response-to-trump-tariffs-on-british-steel-minister-says-13307223",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-scunthorpe-british_5954986.jpg?20250211142421",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-11 14:12:00",
        "Headline": "Donald Trump announced on Monday night he is imposing heavy levies on foreign steel and aluminium 'without exceptions or exemptions'.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The UK needs a \"cool and clear-headed\" response to Donald Trump imposing 25% tariffs on British steel exports, the trade minister has said. The US president announced the heavy levies on foreign steel and aluminium late on Monday, saying they will be enforced \"without exceptions or exemptions\". UK Steel said the tariffs \"would be a devastating blow to our industry\" and accused Mr Trump of taking \"a sledgehammer to free trade, with huge ramifications for the steel sector in the UK and across the world\". However, trade minister Douglas Alexander urged a \"cool and clear-headed\" response from the industry rather than a \"knee-jerk\" reaction. Politics latest: Assisted dying backers 'very worried' bill won't pass Speaking in the Commons on Tuesday, he said the UK \"stands ready\" to find solutions that work for both countries. He said the US had so far only published details about tariffs on steel, not on aluminium. \n                  Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes\n                 \n                  Top candidate for borders watchdog says he would commute from Finland\n                 \n                  Politics latest: UK and US refuse to sign AI safety deal - as No 10 says it will work with Trump on tariffs\n                 Mr Alexander confirmed the business secretary, Jonathan Reynolds, would be meeting the steel industry and trade unions \"within the next 24 hours\", adding the UK has historically \"benefited from a strong and balanced trade relationship with the United States worth around £300m\". The MP, who is also a Cabinet Office minister, said it was \"right and reasonable to be mindful\" of what Mr Trump has said and to \"undertake analysis\". The US president \"has a speciality in generating uncertainty - it's part of his style of negotiations,\" he added.  Prime Minister Sir Keir Starmer is hoping to visit Washington DC in the coming weeks for talks with Mr Trump, but no details have yet been confirmed. Downing Street declined to say whether Mr Trump was wrong to impose the tariffs, saying the government \"will take a considered approach\" and will \"engage with the US on the detail\". A spokesman would not reveal if discussions with the US involved the UK asking Mr Trump to exclude Britain from the duties, and would not say if subsidies for British Steel could be introduced. He added: \"We've already provided significant support to the UK steel industry: £2.5bn of investment in the sector, we are bringing forward a British industry supercharger which is cutting electricity costs for steel firms and bringing prices in line with international competitors.\" Read more:MP behind assisted dying bill defends changeFarmers' inheritance tax creates 'chilling effect' The US is the UK steel industry's second-largest export market after the EU, although the government said it only accounted for 5% of UK steel exports in 2023. Mr Trump said the tariffs were needed to protect the US steel industry and national security. UK Steel director-general Gareth Stace said: \"President Trump has taken a sledgehammer to free trade, with huge ramifications for the steel sector in the UK and across the world. \"This will not only hinder UK exports to the US, but it will also have hugely distortive effects on international trade flows, adding further import pressure to our own market. \"UK steel poses no threat to US national security. Our high-quality products serve key US industries, many of which cannot source these domestically. \"This is a moment where our countries should work together to tackle global steel overproduction, not to be at loggerheads.\""
    },
    {
        "title": "BP at risk of takeover without renewed oil and gas focus success",
        "description": "It is nearly five years to the day since Bernard Looney, the then new chief executive of BP, set out a radical strategy for the oil major to go net zero by 2050.",
        "url": "https://news.sky.com/story/bp-at-risk-of-takeover-without-renewed-oil-and-gas-focus-success-13307029",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-bp-daily-climate-show_5951154.jpg?20221101162116",
        "type": "Business",
        "Author": "Ian King",
        "Date Published": "2025-02-11 09:51:00",
        "Headline": "Sky's Ian King says the company's expected reprioritisation of oil and gas revenues has long been demanded by investors whose returns have lagged those seen at rivals.",
        "Content": "\n          Business presenter\n              @iankingsky\n  It is nearly five years to the day since Bernard Looney, the then new chief executive of BP, set out a radical strategy for the oil major to go net zero by 2050. Under that strategy, BP would invest more in low carbon energy sources and less in oil and gas, even to the extent of leaving in the ground some of the oil and gas it had originally planned to extract. Investors were initially sceptical but prepared to give Mr Looney the benefit of the doubt and particularly when, a year later, he was able to argue that things were turning BP's way with, for example, the US rejoining the Paris climate agreement. Money latest: My company cut my pay by £700 to cover NI rise Today, though, it feels as if BP is repudiating all of that as the company promised to \"fundamentally reset\" its strategy. A capital markets day, due to take place on 26 February, is expected to announce that BP is reducing its low carbon investments in order to focus on its core oil and gas assets. Murray Auchincloss, who succeeded Mr Looney at the end of 2023 after the latter failed to disclose relationships with colleagues to the board, said this morning: \"We have been reshaping our portfolio - sanctioning new major projects, and focusing our low-carbon investment - and we have made strong progress in reducing costs. \"Building on the actions taken in the last 12 months, we now plan to fundamentally reset our strategy and drive further improvements in performance, all in service of growing cash flow and returns. It will be a new direction for BP and we look forward to sharing it at our capital markets update on 26 February.\" That reset is expected to see BP abandon plans to reduce its oil and gas production over time. The company had already reduced its renewables investment and spun off its offshore wind assets into a separate joint venture with Japanese partner Jera. The reset may even see BP abandon a pledge made by Mr Looney to reduce its oil production by 2030 to 70% of its level in 2019. The company has already scaled back a pledge to reduce its carbon emissions by the end of the decade from 35-40% of 2019 levels to between 20-30%. The news, while it will dismay climate activists, points to a new-found pragmatism at BP. The company's share price has underperformed that of its rivals, particularly US players such as Exxon and Chevron, who have remained focused throughout on their core fossil fuel activities. Meanwhile, it emerged over the weekend that Elliott Management, the feared activist investor famous for its campaigns at some of the world's biggest companies, had taken an undisclosed stake in BP, placing further pressure on management. Mr Auchincloss last month announced plans to cut BP's workforce by 5% - reducing the headcount by 4,700 - as he seeks to achieve $2bn (£1.62bn) worth of cost savings. It is unclear what actions Elliott hopes BP will take but it would not be a surprise were it, for example, to demand BP demerges its renewables assets from its traditional fossil fuel assets to become a focused oil and gas company again. Analysts have also speculated that Elliott may agitate for the removal of Helge Lund, BP's chairman, who was a key driver of the strategy previously put in place under Mr Looney. Adding to pressure for change is the fact that the world has changed since Mr Looney's big announcement. Russia's invasion of Ukraine in 2022 highlighted the importance of oil and gas, while Donald Trump is back in the White House and is promising to \"drill, baby, drill\", having already taken the US out of the Paris agreement again. Read more from Sky News:Bank of England rate-setter argues bigger cut was warrantedUS imposes tariffs on all steel and aluminium importsMusk's $97bn bid to buy OpenAI Ironically, given the revived emphasis on oil and gas, it was these activities which proved a drag on BP's earnings during the final three months of 2024. Underlying replacement cost profit, the accepted industry reporting standard, fell to $1.17bn (£954m) from $2.99bn (£2.41bn) during the same period in 2023 due, among other things, to weaker refining margins. For the year as a whole, underlying replacement cost profit fell to $8.92bn (£7.2bn) from $13.84bn (£11.1bn) in 2023. Investors were less focused on those numbers today. For them, all eyes are now on 26 February. Longer term, unless Mr Auchincloss can get the share price higher, BP looks to be a sitting duck for a possible takeover."
    },
    {
        "title": "Musk v Altman: The battle to become king of AI",
        "description": "Elon Musk's bid to buy OpenAI for $97.4bn (&#163;78.7bn) came unsolicited on Monday night and was quickly rejected by his former friend and OpenAI chief executive Sam Altman.",
        "url": "https://news.sky.com/story/musk-v-altman-the-battle-to-become-king-of-ai-13307145",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-musk-altman-openai_6825600.png?20250211142631",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-11 12:22:00",
        "Headline": "In 2015, Elon Musk and Sam Altman founded OpenAI to ensure \"artificial general intelligence benefits all of humanity\". A decade later, the pair are battling it out over AI.",
        "Content": "\n          Science and Technology reporter\n       Elon Musk's bid to buy OpenAI for $97.4bn (£78.7bn) came unsolicited on Monday night and was quickly rejected by his former friend and OpenAI chief executive Sam Altman. \"The company is not for sale, neither is the mission,\" Mr Altman said to Sky News this morning. \"We'll happily buy Twitter though.\" Read more: OpenAI co-founder tells Sky News it's 'not for sale' It's the latest in a long-running spat between the former tech buddies. Back in 2015, Mr Musk and Mr Altman founded OpenAI along with nine other Silicon Valley entrepreneurs to ensure \"artificial general intelligence benefits all of humanity\". But the idealistic partnership wasn't to last. Three years later, Mr Musk left after a power struggle. \"Elon wanted us to merge with Tesla or he wanted full control,\" the company wrote in a blog post about the split in 2024.  When Mr Altman and the others refused to hand over control, Mr Musk left acrimoniously, taking a promised $1bn donation with him, according to OpenAI. However, he had been right about one thing. When he'd offered to let OpenAI treat Tesla as a \"cash cow\", he'd said it was the only way to compete with Google's DeepMind project, which was developing quickly. OpenAI wasn't bringing in enough cash and everyone agreed the company would need more resources if it wanted to reach the AI holy grail: artificial general intelligence (AGI). AGI is a hypothetical AI system that can perform any intellectual task that a human can. So, after rejecting Mr Musk's offer, Mr Altman set up a \"capped-profit\" subsidiary of the company and got investments from Microsoft and others. Elon Musk was not happy. He founded his own company, xAI, and then took OpenAI to court, suing for a breach of contract. He accused the ChatGPT developer of transforming into \"a closed-source de facto subsidiary of the largest technology company, Microsoft\", according to a court filing. \"It is not just developing but is actually refining an AGI [artificial general intelligence] to maximise profits for Microsoft, rather than for the benefit of humanity\", the filing said. OpenAI denied this and also said it never promised to open-source its technology, just to spread the benefits of it. \"The Open in openAI means that everyone should benefit from the fruits of AI after it's built, but it's totally OK to not share the science...\", wrote former OpenAI chief scientist Ilya Sutskever in an email to Elon Musk in 2016. \"Yup,\" he replied, according to OpenAI. But the subsidiary still wasn't bringing in enough money and rumours began swirling in 2024 that Mr Altman would turn OpenAI into a for-profit company. Despite Mr Musk asking a judge to block this from happening, in December, Mr Altman officially released his plans for OpenAI's for-profit arm to take control and \"raise the necessary capital\" to reach general artificial intelligence. The non-profit side of the company would still exist to work on AI for the public good, the company reassured people. In order to make the switch from non-profit to for-profit, OpenAI's board is currently going through a complex process to value parts of the company. Sam Altman will then have to essentially buy the company from the non-profit, which is currently thought to be worth around $40 billion.  Musk throws a 'wrench' into Altman's profit-making plans But Elon Musk has now \"thrown a wrench\" into those proceedings with his $97.4bn (£78.7bn) offer, according to Yale professor Jonathan Macey, who specialises in corporate governance. \"The non-profit is supposed to take money to do whatever good deeds, and if OpenAI prefers to sell it to somebody else for less money, it's a concern for protecting the interests of the beneficiaries of the not-for-profit.\" OpenAI \"may not be able to ignore\" the bid, according to analyst Gil Luria, because it has credible investors backing it, including Ari Emanuel, chief executive of entertainment company Endeavour, and multiple other investment groups. However, others think this could just be another dig from Elon Musk to his former friend. \"It's partially a troll, and partially setting a price that may cause Sam to pay more than he might want to,\" wrote Dan Primack, Axios's business editor, on X. However, when Sam Altman spoke to Sky News from an AI summit in Paris on Tuesday morning, he sounded confident. \"The company is not for sale, neither is the mission.\" He was asked whether he can still afford to keep control of OpenAI after Mr Musk's bid. \"The board will decide what to do there... the mission is really important and we're totally focused on making sure we preserve that,\" he told Sky's science and technology editor Tom Clarke. Read more from Sky News:Has Elon Musk just put OpenAI in a tricky situation?In China's Silicon Valley, where DeepSeek founder keeps a low profile 'Consolidating power' If Mr Musk's bid were to be successful, some are worried about the degree of influence it could give him. \"Musk obviously already controls [X],\" Sherif Elsayed-Ali, executive director of the Future of Technology Institute, told Sky News. \"If he were to take control of OpenAI, or ChatGPT, which is the most widespread AI system out there, then you can see how that's really starting to consolidate power,\" he said. \"The reality is, Musk is a political actor as well, so this is not a pure business transaction.\""
    },
    {
        "title": "Trump imposes 25% tariffs on all steel and aluminium imports",
        "description": "Donald Trump has signed two proclamations imposing 25% tariffs on all steel and aluminium imports to the US.",
        "url": "https://news.sky.com/story/trump-imposes-25-tariffs-on-all-steel-and-aluminium-imports-13306942",
        "image_url": "https://e3.365dm.com/18/03/1920x1080/skynews-steel-us_4250756.jpg?20180309035248",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-11 02:13:00",
        "Headline": "\"This is a big deal,\" Donald Trump said in the Oval Office as he announced the tariffs. \"The beginning of making America rich again.\"",
        "Content": " Donald Trump has signed two proclamations imposing 25% tariffs on all steel and aluminium imports to the US. A proclamation is a form of presidential directive to government officials, but they do not carry the force of law, as an executive order would. However the White House has said the tariffs will take effect from 4 March. \"This is a big deal,\" Mr Trump said in the Oval Office as he announced the tariffs. \"The beginning of making America rich again.\" He added: \"We were being pummelled by both friend and foe alike.\" Read moreAnalysis: Trump's steel and aluminium tariffs target a deeper issueTrump issues Gaza ceasefire ultimatum to HamasAnalysis: The country that could benefit most from Trump tariffs The proclamations mean the president has now removed the exceptions and exemptions from his 2018 tariffs on steel to allow for all imports of the metal to be taxed at 25%. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Trump doubles down on plans to 'take Gaza' as he meets Jordan's King Abdullah\n                 \n                  FBI uncovers thousands of secret JFK assassination files after Trump order\n                 The new tariff on aluminium is also much higher than the 10% duty he imposed on the material in his first term. The tariffs are part of an aggressive push by Mr Trump to reset global trade, as he claims that price hikes on the people and companies buying foreign-made products will ultimately strengthen domestic manufacturing. Outside economic analyses suggest the tariffs would increase costs for the factories that use steel and aluminium, possibly leaving US manufacturers worse off. European Commission president Ursula von der Leyen responded: \"Unjustified tariffs on the EU will not go unanswered -they will trigger firm and proportionate countermeasures\". Canada, the largest source of steel imports to the US, also criticised the move. Candace Laing, CEO of the Canadian Chamber of Commerce, said Mr Trump was destabilising the global economy. \"Today's news makes it clear that perpetual uncertainty is here to stay,\" she said. Economics and data editor At least part of the idea behind tariffs is to bring some production back to the US, but imposing them will have consequences. What kinds of consequences? Well, at its simplest, tariffs push up prices. This is, when you think about it, blindingly obvious.  A tariff is a tax on a good entering the country. So if aluminium and steel are going up in price then that means, all else equal, that the cost of making everything from aircraft wings to steel rivets also goes up. That in turn means consumers end up paying the price - and if a company can't make ends meet in the face of these tariffs, it means job losses - possibly within the very industrial sectors the president wants to protect. So says the economic theory. But in practice, economics isn't everything.  There are countless examples throughout history of countries defying economic logic in search of other goals. Perhaps they want to improve their national self-reliance in a given product; perhaps they want to ensure certain jobs in cherished areas or industries are protected.  But nothing comes for free, and even if Donald Trump's tariffs succeed in persuading domestic producers to smelt more aluminium or steel, such things don't happen overnight.  In the short run, it's hard to see how these tariffs wouldn't be significantly inflationary. Trump's war of tariffs Mr Trump's proclamations come days after the US imposed a 10% tariff on all goods imported from China. In return, China imposed 10% tariffs on American crude oil, agricultural machinery, large-displacement cars and pickup trucks. There will also be 15% tariffs on coal and liquefied natural gas from the US. US plans to impose 25% tariffs on Mexico and Canada were paused after agreements were reached on border security. Mexico's president said she was sending 10,000 National Guard troops to the US border immediately in return for a tariff delay. Mr Trump said the Mexican soldiers would be \"specifically designated\" to stop the flow of fentanyl into the US, as well as illegal migrants. Meanwhile, Canada's prime minister Justin Trudeau said almost 10,000 frontline personnel \"are and will be working on protecting the border\". He added that his country was appointing a \"fentanyl czar\", drug cartels would be listed as terrorists, and there would be \"24/7 eyes on the border\"."
    },
    {
        "title": "Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes",
        "description": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra &#163;350m for housebuilding.",
        "url": "https://news.sky.com/story/angela-rayner-insists-15m-housing-target-can-be-met-as-extra-163350m-pledged-for-affordable-homes-13307405",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-cambridgeshire-angela-rayner_6773952.jpg?20241212100932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-11 19:27:00",
        "Headline": "The deputy prime minister says the government \"can't afford not to\" meet its manifesto commitment with 160,000 children currently in temporary accommodation.",
        "Content": "Angela Rayner has insisted the government can meet its target to build 1.5m homes over the next five years as ministers pledged an extra £350m for housebuilding. An extra £300m has been injected to the affordable homes programme, a move ministers believe will allow 2,800 additional homes to be built. More than half of these extra homes will be for social rent, the government has said, while more than 250 council homes are expected to be made available through a £50m boost to the local authority housing fund. The scale of the challenge is stark, with more than 123,000 households in temporary accommodation - including nearly 160,000 children - while almost 6,000 families with children are in bed and breakfast accommodation. Asked whether she was worried about whether the government could meet the 1.5m homes target, Ms Rayner said she was \"determined\" to meet the challenge. Politics latest: No 10 says it will work with Trump on tariffs \"We will meet that target because we can't afford not to,\" she told broadcasters. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  Local elections for millions postponed as Nigel Farage hits out at government\n                 \n                  How Elon Musk took over British politics\n                 \"We have 1.3 million people waiting on housing waiting lists, there isn't a person listening to this show that will not know somebody who is desperate to get on the housing ladder. \"So, therefore, we're determined to turn that tide.\" And pressed on whether the expected 250 increase of council homes was a big enough increase to meet the need, Ms Rayner said: \"We think the measures we're taking will unlock thousands more council and social homes as part of that programme. We want to help councils who want to build those homes. \"We see 160,000 children in temporary accommodation, and the cost of that on local authorities is significant, as well as the impact on children's life chances,\" she said. \"So we need to build the homes, and we're doing everything we can to turn the tide of decline and build the houses that people desperately need.\"  The extra £350m promised comes on top of £500m that was earmarked for affordable housing in October's budget. According to housing charity Shelter, at least 90,000 social rent homes would need to be built each year for the next 10 years to clear most social housing waiting lists in England and to house every homeless household. A report by MPs last month found that a record number of children are living in B&Bs beyond the legal limit as England's homelessness crisis pushes councils to breaking point. MPs on the Public Accounts Committee (PAC) said there was a \"dire need\" for housing reform, with the lack of affordable homes forcing cash-strapped local authorities to haemorrhage their funds on temporary accommodation. A recent Sky News investigation found that children in some parts of England were spending as long as five-and-a-half years on average in temporary accommodation. The length of stay has increased significantly in many areas since 2021, with particularly long stays in London and the South East. Read more:Labour suspends 11 councillors over WhatsApp scandalSue Gray takes up seat in House of Lords Elsewhere, ministers are expected to set out plans to crack down on exploitative behaviour by rogue landlords who they say are costing the taxpayer by claiming uncapped housing benefit in return for providing homes that are unsuitable. Last week the government announced that a law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October. The legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester."
    },
    {
        "title": "Top candidate for borders watchdog says he would commute from Finland",
        "description": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to.",
        "url": "https://news.sky.com/story/top-candidate-for-borders-watchdog-says-he-would-commute-from-finland-13307607",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-john-tuckett_6826201.jpg?20250211235512",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-11 23:22:00",
        "Headline": "John Tuckett, who has worked as the immigration services commissioner for six years, has told MPs he currently travels to the UK for work when he needs to.",
        "Content": "The government's top candidate to become the chief of the borders and immigration watchdog has told MPs he lives in Finland and commutes to the UK when he needs to. John Tuckett, who has worked as the immigration services commissioner for six years, was questioned by the Home Affairs Select Committee on Tuesday ahead of the appointment of the next independent chief inspector of borders and immigration (ICIBI). Asked if he lives in commuting distance from the London office, he replied: \"No I don't, I have a family home in Finland and I come across to this country whenever I need to.\" When MPs put it to him that he would expect to inspect the UK's borders without being a resident here, he added: \"I work in UK and I would be in the UK, I'm resident in Finland.\" Mr Tuckett told the committee he pays for travel and accommodation himself and \"always have done\". Follow latest: Live politics updates He also said he would be fine to work five days in the office if needed, adding: \"I have done this kind of work before, and when I was asked this question at my interview, I said, I think that my judgment is you need time when you're available for ministers, visits, all the things where you need to do face to face. \n                  Prisoners being sent back to jail because it's the 'easiest thing to do', chief inspector of probation says\n                 \n                  Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats\n                 \n                  Post-mortem results reveal injuries of British couple found dead at home in France\n                 \"You also need time where you can think, sit back, write, because you don't write a report, you know, in 10 spare minutes in between two major appointments. So I think there's a 60-40, split between for the chief inspector this is.! Mr Tuckett was announced as the preferred applicant for the chief inspector position by the Home Office in January, with previous experience as the chief executive of the Marine Management Organisation and working for the Archbishop of York. Read more politics news:CCTV to be installed in Parliament bar after drink-spiking claimLabour suspends 11 councillors over WhatsApp scandalGrenfell Tower - what happens now? Announcing the recommendation of Mr Tuckett for the role, migration minister Seema Malhotra said: \"His track record of delivering complex change programmes across government, combined with his current role as immigration services commissioner, makes him ideally suited to take on this crucial independent oversight role at an important time for our border security.\" If Mr Tuckett is confirmed as the next inspector, he will replace interim watchdog boss David Bolt - who has served since June last year. Mr Bolt's appointment came after the previous borders watchdog David Neal was sacked in February last year amid claims he breached the terms of his appointment. He later voiced his frustrations of the time taken for his reports to be published, and said there were \"very few\" ways of speaking out about his concerns on security."
    },
    {
        "title": "Thatcher's Britain? The legacy of the most influential post-war prime minister",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/thatchers-britain-the-legacy-of-the-most-influential-post-war-prime-minister-13307271",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daily-podcast-110225_6825701.jpg?20250211152502",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:29:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 It is 50 years ago this week that Margaret Thatcher became leader of the Conservative Party, and it’s a testament to her legacy that she's being invoked by both Sir Keir Starmer and Kemi Badenoch. When she became prime minister in 1979, she drove through radical policies like council house sales, privatisation and a crackdown on trade unions which continue to shape Britain today. On the Sky News Daily, Niall is joined by chief political correspondent, Jon Craig to discuss how Margaret Thatcher’s legacy is still driving today’s politics. Plus he speaks to Caroline Slocock, former private secretary to Mrs Thatcher during her final 18 months in office on what she was like to work for.Producer: Alex BishopEditor: Wendy Parker"
    },
    {
        "title": "CCTV to be installed in Parliament bar as it reopens after drink-spiking allegation",
        "description": "Parliament's famous Strangers' Bar, closed in January after a drink-spiking allegation, is to reopen with CCTV cameras as part of a major security crackdown.",
        "url": "https://news.sky.com/story/cctv-to-be-installed-in-parliament-bar-as-it-reopens-after-drink-spiking-allegation-13307324",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-palace-of-westminster_6777507.jpg?20241216103702",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-02-11 16:37:00",
        "Headline": "Rules on guests allowed in the bar will also be tightened and covers on glasses will be available for drinkers who want them.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Parliament's famous Strangers' Bar, closed in January after a drink-spiking allegation, is to reopen with CCTV cameras as part of a major security crackdown. Rules on guests allowed in the bar are to be \"rigorously\" enforced, and, in a bid to prevent drinks being tampered with, covers on glasses will be available for drinkers who want them. The House of Commons authorities announced the crackdown as they confirmed an exclusive Sky News report that the bar will re-open on 24 February, after the half-term recess. The decision to re-open Strangers was taken at a secret meeting of the House of Commons Commission, chaired by Speaker Sir Lindsay Hoyle, on Monday. Politics latest: Reform hit new polling high A House of Commons spokesperson told Sky News: \"The safety of everyone on the estate remains a key priority of both Houses. \"Following a review of arrangements in Strangers' Bar, the House of Commons Commission has endorsed a number of changes that aim to enhance existing safety measures and ensure the well-being of all customers who visit the bar.\" Used for decades by MPs and their guests, peers, parliamentary staff and political journalists, Strangers' Bar was closed on Monday 20 January. The closure was announced after a parliamentary researcher complained her drink had been spiked. The woman told bar staff and security personnel the drink had been tampered with. The alleged incident, said to have taken place at about 6.30pm on Tuesday 7 January, in the first week after parliament returned from recess, prompted a police inquiry. The Metropolitan Police has confirmed that an investigation was launched and the victim was being supported. No arrests have been made, however. The decision to close the bar was taken by Sir Lindsay, in consultation with the clerk of the House, Tom Goldsmith, and the director of parliamentary security, Alison Giles. The new security and safety measures, which will come into force when the bar re-opens five weeks after its closure, are: • Closed circuit TV (CCTV) in the bar, which the commission says will be accessed only in the event of an incident;• Covers for glassware available to customers on request;• An increased presence of security and access staff in and near the bar, to help manage access and ensure it does not become overcrowded, with signs on access rules;• More training for staff on vulnerable customers and spiking awareness;• Clear information displayed in the bar and elsewhere on drink safety and the measures in place. The commission has said there will be no changes to existing access rules, but they will be \"enforced rigorously with identities checked\". The existing access arrangements are: • Monday-Thursday: MPs, with up to three guests;• Journalists accredited to the parliamentary press gallery, but no guests;• On Thursday, in addition: Commons digital staff pass-holders and MPs' staff, no guests;• Ex-MPs who have served at least 10 years, no guests;• Peers who are former MPs, no guests;• Lay members of select committees, no guests. Under the rules, only MPs can bring in guests - up to three at any time - but guests may not buy drinks or stay unaccompanied for more than 15 minutes, the length of time it takes for MPs to vote in a division. And in a warning that the rules may be made even stricter if necessary, the commission says it has decided to keep these arrangements, including access rules, under review. It has also pointed to parliament's behaviour code, which makes clear that all those who work on or visit the parliamentary estate should always be treated respectfully. Those who choose to drink in parliament must do so responsibly, and the authorities reserve the right to refuse to serve alcohol if they believe a person is, or is likely to become, drunk. Read more:Sue Gray takes up seat in House of LordsMPs set for above inflation pay rise to nearly £94,000 There are also rules regarding the responsible consumption of alcohol. The commission says it has previously agreed moves to promote responsible alcohol consumption. These include increasing the range of non-alcoholic drinks and lower strength beers available, expanding and encouraging alcohol-free areas, and not running promotional advertisements for alcohol. The House of Commons Commission is parliament's most senior rule-making committee. It is made up of seven MPs, including the Speaker, and four lay members. The other MPs are Commons Leader Lucy Powell, the Tories' shadow leader Jesse Norman, Labour MPs Rachel Blake and Nick Smith, former Tory cabinet minister Steve Barclay and Lib Dem MP Maria Goldman."
    },
    {
        "title": "King Charles invites Sir Keir Starmer and devolved government leaders for dinner at Windsor Castle",
        "description": "King Charles will host the prime minister and the first ministers of the devolved governments at Windsor Castle on Wednesday night, Sky News understands.",
        "url": "https://news.sky.com/story/king-charles-invites-sir-keir-starmer-and-devolved-government-leaders-for-dinner-at-windsor-castle-13307474",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-king-charles-aberden_6804958.jpg?20250120113759",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-11 20:56:00",
        "Headline": "The dinner on Wednesday comes after Downing Street denied involving the monarch in politics after he appeared alongside the prime minister and Angela Rayner at a housing project in Cornwall.",
        "Content": "King Charles will host the prime minister and the first ministers of the devolved governments at Windsor Castle on Wednesday night, Sky News understands. The monarch has invited John Swinney, the Scottish first minister, to the Berkshire royal residence, along with Northern Irish First Minister Michelle O'Neill, Northern Irish Deputy First Minister Emma Little-Pengelly and Welsh first minister Eluned Morgan, it is understood. The King hosts a number of informal dinners at Windsor Castle for a wide variety of guests from across the arts, science, charity and politics each year. Politics latest: No 10 says it will work with Trump on tariffs  However, the latest event risks adding fuel to the criticism that the King is intervening in politics after he joined Sir Keir Starmer and his deputy Angela Rayner on a rare engagement to see a housing project in Cornwall on Monday. The monarch Sir Keir and Ms Rayner carried out three engagements in Nansledan, a 540-acre extension to the seaside town of Newquay. The visit is understood to have followed conversations about housing over the past few months between King Charles and Sir Keir, during which the Nansledan project was mentioned. \n                  Sue Gray takes up seat in House of Lords - and receives new title\n                 \n                  Sir Keir Starmer takes HIV test in effort to reduce stigma\n                 \n                  Why sacked minister's outrageous comments will concern Starmer\n                 The joint trip came ahead of the government outlining further measures to meet its target to build 1.5m homes over the next five years. The monarch famously does not intervene in political matters and remains politically neutral under the constitutional monarchy - but critics have claimed the visit risked dragging the King into politics. Asked whether making the visit ahead of the announcement risked that perception, the prime minister's official spokesperson said: \"No\". They added: \"Obviously, this project is entirely run by the Palace and the Duchy [of Cornwall], but the government has spoken repeatedly on its ambitions on housebuilding, it is a key part of the plan for change to deliver 1.5m homes, to tackle the housing crisis that we've inherited, to drive economic growth across the country.\" Read more:Labour suspends 11 councillors over WhatsApp scandalSue Gray takes up seat in House of Lords Sir Keir has made improving ties with the devolved leaders one of his priorities following years of thorny relations under the previous Conservative government. Last October, the prime minister held a summit with devolved leaders in Edinburgh where they discussed working together to grow the economy and to make the UK a clean energy superpower."
    },
    {
        "title": "Labour suspends 11 councillors over WhatsApp scandal",
        "description": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench.",
        "url": "https://news.sky.com/story/labour-suspends-11-councillors-over-whatsapp-scandal-13307367",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-gwynne_6823559.jpg?20250208191233",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-11 18:09:00",
        "Headline": "The move comes after Andrew Gwynne was sacked as health minister at the weekend over messages posted in a WhatsApp group.",
        "Content": "The Labour Party has suspended 11 of its councillors over their membership of a WhatsApp group that led to a minister being sacked from the frontbench. It is understood most of the councillors are part of Tameside Council while two are members of Stockport Council. The move comes after the party sacked health minister Andrew Gwynne and suspended MP Oliver Ryan over messages reportedly posted in the group. Politics latest: UK and US refuse to sign AI safety deal On the suspension of the 11 councillors - which reportedly includes Mr Gwynne's wife, Allison Gwynne - a party spokesperson said: \"As part of our WhatsApp group investigation, a group of councillors have been administratively suspended from the Labour Party. \"As soon as this group was brought to our attention, a thorough investigation was launched in line with the Labour Party's rules and procedures and this process is ongoing. \"Swift action will always be taken where individuals are found to have breached the high standards expected of them as Labour Party members.\" \n                  Sue Gray takes up seat in House of Lords - and receives new title\n                 \n                  Starmer will hope he can draw a line under damage of WhatsApp scandal after second MP's suspension\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 Sky News understands the following councillors have now been suspended: The suspension of the Tameside councillors comes after three Labour members of the same local authority \"stepped away\" from their duties on Tameside Council. Councillors Jack Naylor, Claire Reid, and George Newton - who were members of the WhatsApp group - are also being investigated by the Labour Party. Mr Gwynne was sacked by Sir Keir Starmer after the Mail on Sunday reported he made racist comments about Labour MP Diane Abbott and sexist remarks about Deputy Prime Minister Angela Rayner. He is also reported to have said he hoped a pensioner would soon die after she asked a councillor about bin collections - and to have joked about a constituent being \"mown down\" by a truck. Mr Gwynne said he deeply regretted his \"badly misjudged comments\" and apologised for any offence caused. Shortly after he was sacked from the frontbench, the Labour Party revealed that it was also investigating Mr Ryan over comments which a government source said were \"unacceptable and deeply disappointing\". Mr Ryan then had had the whip removed on Monday, meaning he will now sit as an independent MP in the Commons. The 29-year-old Burnley MP apologised on Sunday and said he \"deeply regrets\" the comments he made, which a government source said were \"unacceptable and deeply disappointing\". According to the Daily Mail, Mr Ryan joked about a fellow Labour MP being gay. In a statement on X over the weekend and before his suspension, Mr Ryan apologised for remarks he made which he \"would not make today\", and said he would \"cooperate fully\" with the investigation. Read more:The Labour WhatsApp investigation, the alleged messages and the MPs involvedWhy sacked minister's outrageous comments will concern Starmer He said that between 2019 and early 2022, he was a member of a WhatsApp group \"created by my MP and former employer, Andrew Gwynne\". Mr Ryan said: \"Some of the comments made in that group were completely unacceptable, and I fully condemn them.\" The MP also said he regretted \"not speaking out at the time\", and he recognised that \"failing to do so was wrong\". Mr Gwynne is the latest MP to lose his position on the frontbench after ex-treasury minister Tulip Siddiq quit last month and Louise Haigh resigned as transport minister in November."
    },
    {
        "title": "Heathrow set to announce multibillion-pound investment - as it prepares proposal for third runway",
        "description": "Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway.",
        "url": "https://news.sky.com/story/heathrow-set-to-announce-multibillion-pound-investment-as-it-prepares-proposal-for-third-runway-13307372",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-heathrow-terminal-five_6826084.jpg?20250211215936",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-02-11 18:20:00",
        "Headline": "Plans for a third Heathrow runway will be with the government \"by summer\", the airport has said, amid projections it could be decades before the project is completed, if at all.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Heathrow is set to announce a multibillion-pound expansion plan to create extra capacity at the airport - as it prepares its proposal for a third runway. The UK's biggest airport has announced a \"once-in-a-generation investment\" beginning this year to improve existing buildings and boost passenger numbers. The development is separate from a new runway - which the government recently announced support for - and will be funded by Heathrow shareholders with airlines and customers charged for the expanded services. Money blog: Major lender cuts mortgage rates below 4% As part of the investment, the capacity of terminals two and five will be increased and the layout of the airfield will be reconfigured in a bid to improve punctuality and to increase the number of aircraft stands. In a speech on Wednesday, chief executive Thomas Woldbye is expected to say: \"This privately-funded programme will upgrade existing infrastructure while laying the groundwork for a third runway, boosting UK investment and economic growth, with tangible benefits felt this year.\" Heathrow was last month criticised by Europe's largest airline Ryanair for being \"incredibly operationally inefficient\". Because of this, Ryanair chief executive Michael O'Leary said the airline had no interest in and would \"never\" fly from the airport, even if it were free. \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 \n                  Heathrow Airport: The case for and against a third runway\n                 \n                  Money and public backlash are not the only issues Heathrow expansion plans face\n                 Proposals for a third runway will be submitted to the government \"by summer\", the airport said, after Chancellor Rachel Reeves backed the expansion as part of her aim of growing the economy. The support is seen as controversial as many senior Labour politicians such as London mayor Sadiq Khan and cabinet members including Energy Secretary Ed Miliband have long opposed a third runway on environmental and health grounds.  It's unclear how the additional carbon emissions from the extra flights would be compatible with the state's legally binding 2050 emissions reduction targets. A third runway? Doubt has been cast over whether a runway could even be built during Labour's time in power. The process would have to be planned and approved before construction could begin.  Rivers and the M25 road would have to be diverted and hundreds of homes would need to be demolished as part of construction. Ryanair's Mr O'Leary said the chance of it being built was \"slim\" but it could be 2050 even if it does get built. A question over the third runway's ability to boost the economy was raised by left-leaning thinktank the New Economics Foundation (NEF) According to its analysis, growth in the number of business travellers - who may grow commercial links - has ceased and instead, passenger growth has been driven by wealthy British residents rather than foreign tourists entering the country. The air travel industry is also one of the poorest job creators in the economy per pound of revenue, the NEF said, while the environmental downsides of more flights are \"significant\". Steel pact  As part of interim, pre-third runway expansion Heathrow signed a charter to maximise opportunities for the use of British steel, a move welcomed by steel bosses, unions and the government."
    },
    {
        "title": "Sue Gray takes up seat in House of Lords - and receives new title",
        "description": "Sir Keir Starmer's former chief of staff Sue Gray has taken up her place in the House of Lords after she was nominated by the prime minister for a peerage.",
        "url": "https://news.sky.com/story/sue-gray-takes-up-seat-in-house-of-lords-and-receives-new-title-13307229",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sue-gray-house-of-lords_6825634.jpg?20250211145019",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-11 14:22:00",
        "Headline": "Sir Keir Starmer's ex-chief of staff resigned last October amid a power struggle in Number 10.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer's former chief of staff Sue Gray has taken up her place in the House of Lords after she was nominated by the prime minister for a peerage. Ms Gray will now be known as Baroness Gray of Tottenham, representing the area in north London where she was born, and she will sit in the upper chamber as a Labour peer. The former civil servant, who quit Downing Street last October after about three months in the role, was nominated for a life peerage by the prime minister in December. She had resigned from her job as Sir Keir's top adviser amid a power struggle in Number 10. It saw Morgan McSweeney, Labour's former campaign director who masterminded the party's election landslide, replace her in the role. Politics latest: UK 'ready to work' with Trump on steel tariffs Ms Gray rose to public prominence after authoring the report into parties in Downing Street during the pandemic. \n                  King Charles invites Sir Keir Starmer and devolved government leaders for dinner at Windsor Castle\n                 \n                  Sir Keir Starmer takes HIV test in effort to reduce stigma\n                 \n                  Why sacked minister's outrageous comments will concern Starmer\n                 Her move to Labour attracted headlines from the beginning, with the Tories raising questions about how much contact she'd had with the party about the top job while still a civil servant. But it was an internal row that led to her leaving the chief of staff role, with Labour's first three months in office dominated by negative headlines about her. Tensions over Ms Gray's position reached a crescendo when her salary of £170,000 - some £3,000 more than the prime minister - was leaked to the BBC in an apparent attempt to damage her politically. It was also reported at the time that she was blamed by party staff who were disgruntled they were not being paid more than what they received when Labour was in opposition. Ms Gray missed Labour's first party conference in power as the prime minister attracted scrutiny for the more than £100,000 worth of gifts he accepted as Labour leader, including tickets to football matches, concerts and luxury clothes. Baroness Gray was later offered the role of the prime minister's envoy for the nations and regions, which she ultimately rejected after missing the first key summit relevant to her new remit. In her resignation letter last October, Ms Gray said that while it had been \"an honour to take on the role of chief of staff\", it had become clear that \"intense commentary around my position risked becoming a distraction to the government's vital work of change\". \"It is for that reason I have chosen to stand aside, and I look forward to continuing to support the prime minister in my new role,\" she added. Read more:Insiders lift lid on Morgan McSweeney - PM's new closest confidanteHow Thatcher's legacy lives on 50 years after she became Tory leader Ms Gray was among 30 new Labour peerages announced ahead of Christmas to redress the party \"imbalance\" in the House of Lords. The Conservatives nominated six people, and the Liberal Democrats two. Taking her seat in the unelected House of Lords, Ms Gray wore the traditional scarlet robes for the short introduction ceremony in the upper chamber, where she swore the oath of allegiance to the King. She was supported by former Whitehall chief and independent crossbencher Lord O'Donnell and fellow Labour peer Baroness Harman. Her son, the Labour MP Liam Conlon, watched the ceremony from the public gallery in the Lords."
    },
    {
        "title": "British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner",
        "description": "Steel \"absolutely has a future\" in the UK despite Donald Trump's tariffs, the deputy prime minister has said.",
        "url": "https://news.sky.com/story/british-steel-absolutely-has-a-future-despite-us-tariffs-says-deputy-pm-angela-rayner-13307346",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-downing-street-angela-rayne_6825280.jpg?20250211092542",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-11 17:05:00",
        "Headline": "Angela Rayner seeks to assure the industry after the US president announced 25% tariffs on all steel and aluminium imports into the US.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Steel \"absolutely has a future\" in the UK despite Donald Trump's tariffs, the deputy prime minister has said. Angela Rayner, who is also the housing secretary, said that although the steel industry had endured a \"very difficult time\" in recent years, the government remained \"committed\" to supporting it into the future. Politics latest: Reform hit new polling high Sir Keir Starmer's deputy sought to reassure steel workers and businesses in the wake of the American president announcing 25% tariffs on all steel and aluminium imports into the US. British steel exports to the US are worth about £400m and aluminium exports have been worth about £300m over recent years. Speaking to broadcasters, Ms Rayner said British steel had been through a \"very difficult time\" but \"absolutely [...] has a future\". She said Labour's plans to rip up planning rules and get Britain building more homes and infrastructure mean domestic steelmakers have a \"crucial role to play\". \n                  Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes\n                 \n                  Local elections for millions postponed as Nigel Farage hits out at government\n                 \n                  How Elon Musk took over British politics\n                 \"Well, we know that British steel has been through a very difficult time, and our business secretary has been working hard with the industry to make sure that we have a future for British steel,\" she said. \"But this government is committed to supporting that industry into the future.\" She continued: \"We've been doing that already. We will continue to do that.\" Addressing Mr Trump's decision to impose tariffs on steel and aluminium imports, she added: \"Obviously, we'll have to see what comes out of the US and what that means to UK steel. \"We absolutely believe that British steel has a future. We're investing in British steel, we're working with the industry and of course our infrastructure and long-term planning that we're doing around rebuilding in Britain. British steel has a crucial role to play in that too.\" The US president announced the taxes on foreign steel and aluminium late on Monday, saying they will be enforced \"without exceptions or exemptions\". UK Steel said the tariffs \"would be a devastating blow to our industry\" and accused Mr Trump of taking \"a sledgehammer to free trade, with huge ramifications for the steel sector in the UK and across the world\".  However, trade minister Douglas Alexander urged a \"cool and clear-headed\" response from the industry rather than a \"knee-jerk\" reaction. Speaking in the Commons on Tuesday, he said the UK \"stands ready\" to find solutions that work for both countries. He said the US had so far only published details about tariffs on steel, not on aluminium. Mr Alexander confirmed the business secretary, Jonathan Reynolds, would be meeting the steel industry and trade unions \"within the next 24 hours\", adding the UK has historically \"benefited from a strong and balanced trade relationship with the United States worth around £300m\". The MP, who is also a Cabinet Office minister, said it was \"right and reasonable to be mindful\" of what Mr Trump has said and to \"undertake analysis\". The US president \"has a speciality in generating uncertainty - it's part of his style of negotiations\", he added. In addition to the negative impact that could be felt from Mr Trump's tariffs, steel workers have also been hit by job losses at a giant Tata steel plant. Up to 2,800 jobs at Tata Steel are expected to be axed at the country's biggest steelworks in Port Talbot as the company transitions to a greener form of steel production which requires fewer workers. The government has sought to compensate the supply chain businesses and workers affected by changes at Tata's Port Talbot site in south Wales with a fund of millions of pounds."
    },
    {
        "title": "How Margaret Thatcher's legacy lives on 50 years after she became Tory leader",
        "description": "Even after half a century, she's still adored and revered by Tories, grudgingly respected by present and former Labour prime ministers and yet despised and reviled on the left and in many working class communities.",
        "url": "https://news.sky.com/story/how-margaret-thatchers-legacy-lives-on-50-years-after-she-became-tory-leader-13306941",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-thatcher-badenoch-tories_6825452.png?20250211123803",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-02-11 00:57:00",
        "Headline": "Sir Keir Starmer has invoked her and she was Kemi Badenoch's political heroine - but both party leaders can only dream of the Iron Lady's election-winning record.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Even after half a century, she's still adored and revered by Tories, grudgingly respected by present and former Labour prime ministers and yet despised and reviled on the left and in many working class communities. It was 50 years ago this week that Margaret Thatcher became Conservative Party leader and began to change the course of political history, winning three general elections in the UK and becoming a major figure on the world stage. She became leader aged 49, after defeating former prime minister Edward Heath in a shock result in the first ballot, on 4 February, by 130 votes to 119 and then beating William Whitelaw by 146 to 79 in the second ballot a week later. In those days, Conservative MPs chose the leader and Mrs Thatcher's biographer, Charles Moore, has revealed that when she told husband Denis she was standing, he muttered: \"Heath will murder you.\" She had also declared in a TV interview in 1973, when she was Mr Heath's education secretary and denounced as \"Milk Snatcher\" for scrapping free school milk: \"I don't think there will be a woman prime minister in my lifetime.\" But ironically, given that nickname, she was backed by a powerful group of Tory MPs known as the \"Milk Street mafia\", led by the controversial businessman and 1922 Committee chairman Edward du Cann, who Private Eye called \"du Cann of Worms\". After her victory, Mrs Thatcher appointed Mr Whitelaw, a Scottish toff and veteran Tory fixer, as deputy leader. \n                  Angela Rayner insists 1.5m housing target can be met as extra £350m pledged for affordable homes\n                 \n                  Top candidate for borders watchdog says he would commute from Finland\n                 \n                  Politics latest: UK and US refuse to sign AI safety deal - as No 10 says it will work with Trump on tariffs\n                 He served her loyally until 1988, after he suffered a stroke. But her famous quote, \"Every prime minister needs a Willie,\" has become part of political folklore. Labour's prime minister when Mrs Thatcher became opposition leader on 11 February 1975 was Harold Wilson, who by then had won four general elections, but was to step down a year later, when he was succeeded by James Callaghan. Follow latest: Live politics updates Mrs Thatcher won decisive general election victories over Callaghan, Michael Foot and Neil Kinnock, but was eventually ousted from 10 Downing Street in 1990 not by the Labour Party but by her own mutinous cabinet ministers and Tory backbenchers. Now, 50 years after she became leader, the Conservatives once again have a new female leader and Labour is led by a prime minister who won a spectacular general election victory but leads a government rapidly becoming unpopular. But parallels between 1975 and 2025 end there. On the evidence so far, critics would say Kemi Badenoch is no Margaret Thatcher and Sir Keir Starmer is no Harold Wilson. On becoming leader, Mrs Thatcher revolutionised Tory thinking, so that when she became PM in 1979 she brought in radical policies never seen before: council house sales, privatisation and a tough crackdown on trade unions. Along with spending curbs and tax cuts, her policies became known as \"Thatcherism\". She called her ideology \"rolling back the frontiers of the state\". And when the going got tough, as it did in 1980 when unemployment was rising sharply and she was urged to make a U-turn, she told her critics at the Tory conference: \"You turn if you want to. The lady's not for turning.\" But two even bigger episodes defined her premiership: victory in the Falklands War in 1982 and her handling of the bruising miners' strike of 1984-85, which even to this day provokes fury and loathing in former mining communities. Abroad, she found a soulmate in US president Ronald Reagan, making the so-called special relationship extra special as they fought communism. The Russians had already dubbed her the \"Iron Lady\". It was a nickname that stuck and she revelled in it. And her toughness suggests that Donald Trump would have had a healthy respect for her and bonded with her had she been PM today. She was a workaholic who claimed she only needed four hours sleep a night and hated taking holidays. At an event to mark the 50th anniversary last week, her former secretary Alison Wakeham said: \"She would long for a telephone call saying there was a world crisis.\" In 2020, Kemi Badenoch described Margaret Thatcher as \"inspirational\", for taking a country in decline and transforming it through what she called \"the politics of conviction\". She had met her \"political heroine\" briefly when she was photographed with Lady Thatcher when she was Conservative candidate against Labour's Tessa Jowell in Dulwich and West Norwood in 2010. Read more politics news:MPs set for above inflation pay riseParliament bar to reopen after spiking allegationFarage says 100 Labour MPs will be 'getting scared' Despite criticism that in her first 100 days she has made a slow start, some Tories have speculated whether Ms Badenoch could be the new Margaret Thatcher. Her robust views, anti-woke values and no-nonsense style have, after all, made her a darling of the Tory right and party activists. But as Charles Moore points out, a major difference between the pair is that Mrs Thatcher faced no serious challenge from the right. Mrs Badenoch does, from Reform UK, whereas Mrs Thatcher's whole task was to fight the left, says Mr Moore. But her legacy lives on not just in the Conservative Party. In 2007, Labour PM Gordon Brown welcomed her to 10 Downing Street for a teatime chat and commissioned a portrait of her which was unveiled two years later when she visited No 10 again. \"I admire the fact that she is a conviction politician,\" Mr Brown said before her 2007 visit. \"I am a conviction politician like her.\" Last year Sir Keir Starmer was criticised by Tory MPs after moving her portrait from the study known as the Thatcher Room. That was despite praising her for bringing \"meaningful change\" to the UK, in an appeal to Tory voters in 2023. Sir Keir also invoked Mrs Thatcher as recently as two weeks ago when he vowed to cut \"the thickets of red tape\" in the government's pursuit of economic growth, claiming it was \"our equivalent\" of her government's deregulation in the 1980s. And Sir Keir and Mrs T have at least one thing in common: they've both employed a voice coach, which Sir Keir may have regretted last week in the row over Leonie Mellinger visiting him during lockdown. In the 1970s Mrs Thatcher's PR chief Gordon Reece hired a voice coach used by Laurence Olivier. Unlike Mrs Thatcher, Harold Wilson - who Sir Keir has said is the Labour leader he most admires over the past 50 years - was no \"conviction politician\". He was a wily - critics would say devious - and scheming political genius and party manager. He was also paranoid about plots against him. \"I know what's going on,\" he once famously said. \"I'm going on.\" In his biography, \"Harold Wilson: the winner\", Labour minister Nick Thomas-Symonds praises his government's achievements - on the death penalty, homosexuality, abortion, censorship and the voting age - and describes him as \"one of the 20th century's great political personalities\". Mr Wilson cultivated a man-of-the-people image, with a pipe, a dry wit, Private Eye's Mrs Wilson's Diary about his wife Mary, his dog Paddy, a fondness for brown sauce and a bungalow in the Scilly Isles, though in private he drank brandy and smoked cigars. Is Sir Keir copying Harold Wilson? Last year the football fanatic PM gave high-profile public support for Gareth Southgate's England in the final of the Euros. In 1966, Mr Wilson famously declared after Alf Ramsey's heroes triumphed: \"Have you ever noticed how we only win the World Cup under a Labour government?\" But compared to the music hall style of Mr Wilson, Sir Keir is a wooden performer. He's also a political novice, an MP only since 2015, whereas Mr Wilson had been a minister under Clement Attlee and a leading Labour Party figure for nearly two decades when he became PM. But that's not all. According to a new book by political journalists Gabriel Pogrund and Patrick Maguire, Sir Keir's own chief of staff Morgan McSweeney complained he behaved \"like an HR manager, not a leader\" and his deputy Angela Rayner joked that he was so inept he couldn't run a bath. With last week's Sky News-YouGov poll placing Nigel Farage's Reform UK ahead of Labour, that's hardly a vote of confidence in Sir Keir's ability to win the next election, let alone the four Harold Wilson won. For Kemi Badenoch, the future could be even more bleak. YouGov put the Conservatives in third place and in the Sky News Electoral Dysfunction podcast with Beth Rigby last week, former Scottish Tory leader Ruth Davidson suggested she might get less than 18 months in the job. So the bad news for Kemi and Keir is that 50 years after Margaret Thatcher became Tory leader, her election-winning record - and that of Harold Wilson, Labour PM back then - look unassailable."
    },
    {
        "title": "Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government",
        "description": "Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce.",
        "url": "https://news.sky.com/story/elon-musk-joins-donald-trump-in-oval-office-as-he-denies-hostile-takeover-of-us-government-13307516",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250211223932",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-11 21:52:00",
        "Headline": "The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for\".",
        "Content": " Elon Musk joined Donald Trump in the Oval Office as the US president signed an executive order allowing the tech billionaire to make large-scale reductions in the federal workforce. As head of the Department of Government Efficiency (DOGE), an advisory group, Mr Musk says he wants to add \"common sense controls\" to government and ensure taxpayer money is spent wisely. The executive order requires government agencies to work with DOGE, in some cases so they can be \"eliminated or combined because their functions aren't required by law\". In addition, the agencies have been told to \"hire no more than one employee for every four employees that depart from federal service\", with exceptions for immigration, law enforcement and public safety. Answering reporters' questions in the Oval Office, Mr Musk was asked to respond to accusations he is orchestrating a \"hostile takeover\" of government in a non-transparent way. The Tesla CEO and owner of X said \"the public voted for major government reform... and they're going to get what they voted for. And that's what democracy is all about\". \"We have this unelected, fourth unconstitutional branch of government, which is the bureaucracy, which has in a lot of ways, currently more power than any elected representative,\" he added, while stood alongside his son X Æ A-12. \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  US defence secretary Pete Hegseth works out with marines ahead of first NATO meeting\n                 \n                  Trump signs order reversing US move to ban plastic straws as he declares paper ones 'don't work'\n                 Mr Musk also spoke about what he described as a lack of Treasury controls. \"Your tax dollars need to be spent wisely on things that matter to the people... it's just common sense. It's not draconian or radical\". When challenged about what checks and balances are in place to ensure accountability for Mr Musk, who is unelected, he replied: \"We are trying to be as transparent as possible... I don't know of a case where an organisation has been more transparent\". 👉 Follow Trump 100 on your podcast app 👈 Another reporter raised the possibility of conflicts of interest, pointing out Mr Musk has received billions of dollars in federal contracts. \"All of our actions are fully public,\" he says, adding that he fully expects to be \"scrutinised nonstop\" - comparing it to \"a daily proctologist exam\" - but also admitting \"we will make mistakes, but we'll also fix the mistakes very quickly\". \"Some of the things that I say will be incorrect and should be corrected,\" he said. \"So nobody can bat 1,000.\" US correspondent This was the most awkward news conference starring the most awkward man, with his son picking his nose. It was quite a remarkable event. The president of the US was justifying a full-scale assault on the federal government in the Oval Office with Elon Musk by his side. There was little in the way of accountability, even if the country did vote for Donald Trump. Nobody saw Elon Musk coming. Nobody saw the half dozen young men that have been sent into these federal agencies to sack people by the thousands. Musk's description of bureaucracy as an unconstitutional branch of government is \"a stretch to say the least\". Over many years, the will of the people has been to construct a bureaucracy to deal with their interests, whether that's social security payments or high finance. At the same time, team Trump is attempting to \"railroad\" their legislation through the courts despite the objections of judges. Earlier on Tuesday, Mr Musk posted an attack aimed at judges who have issued rulings that paused Mr Trump's executive actions. \"Democracy in America is being destroyed by judicial coup,\" Mr Musk wrote on X. The president voiced a similar complaint in the Oval Office alongside Mr Musk. Read more from Sky News:Kanye blocked from selling swastika T-shirts'Historic blow' landed against Sicilian mafiaRussia releases American teacher from prison \"We want to weed out the corruption. And it seems hard to believe that a judge could say, we don't want you to do that,\" he said. \"So maybe we have to look at the judges, because that's very serious. I think it's a very serious violation.\" Mr Trump also held discussions with Jordan's King Abdullah at the White House. The president repeated his pledge to \"take Gaza\" and move its residents to Jordan and Egypt, something the king has rejected."
    },
    {
        "title": "Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties",
        "description": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties.",
        "url": "https://news.sky.com/story/daffodil-hunt-launched-by-royal-horticultural-society-as-flower-lovers-urged-to-look-out-for-rare-varieties-13307357",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-daffodil-flower_6825890.jpg?20250211184222",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-11 17:41:00",
        "Headline": "Royal Horticultural Society scientist James Kirkham Ramsbottom was honoured in 1925 for developing a hot water treatment against eelworms - credited with saving the daffodil. A century later, the charity is asking people to help track and map the flowers.",
        "Content": "Flower lovers are being urged to help map daffodils across the UK - and look out for rare pink, white and \"bonfire\" yellow varieties. The Royal Horticultural Society (RHS) is launching a \"daffodil diaries\" project in commemoration of 100 years since the charity helped save the flower. One of its scientists, James Kirkham Ramsbottom, was awarded the Barr Memorial in 1924 for developing a hot water treatment against eelworms - credited with saving the daffodil. The project runs from 12 February to Saint David's Day on 1 March, when the flowers are worn to mark the patron saint of Wales. Businesses and gardeners are being asked to log where daffodils are blooming, along with basic information such as colour, type and height. RHS scientists will then use the information from the mapping project to understand the environmental influences on the popular spring plant, its spread, and what buyers prefer. In particular, the charity is asking people to look for three varieties of daffodils that are at risk or thought to be extinct, including: • Mrs R O Backhouse, one of the first pink daffodils, which has a solid coral pink trumpet and ivory flowers • Mrs William Copeland - a white double-flowered daffodil which has not been on sale in recent years • The Sussex bonfire, a double-flowered yellow and orange daffodil, which has never been located The RHS said finding rarer daffodils can help better understand gardening heritage in the UK, aid the survival of the varieties, and even ensure the preservation of genetic material to help breed the flowers in the future. Dr Kalman Konyves, daffodil expert with the RHS, said: \"Daffodils have come to mark the arrival of spring and are celebrated for their welcome burst of colour in gardens, parks and roadsides. \"But there's more to this ubiquitous yellow flower than meets the eye, with 31,000 known varieties available in green, pink and red. \"Understanding where they can be found will help us in preserving this diversity for the future.\" Read more from Sky news:Lisa Riley reacts to Peter Kay's gig jibeSri Lanka power outage blamed on a monkey Gwen Hines, chief executive of plant conservation charity Plant Heritage, which helped select which rare cultivars to search for, added: \"Springtime daffodils are abundant, but rare varieties could be lost from our gardens and roadsides if they're not found and cared for. \"While six national plant collections do protect some, many others aren't yet safeguarded, which is why we encourage everyone to look for rare varieties this spring.\""
    },
    {
        "title": "Older people in England happier and more satisfied now than before COVID, researchers say",
        "description": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found.",
        "url": "https://news.sky.com/story/older-people-in-england-happier-and-more-satisfied-now-than-before-covid-researchers-say-13307277",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-older-couple-smiling_6825842.jpg?20250211173509",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:42:00",
        "Headline": "\"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic,\" says Prof Paola Zaninotto.",
        "Content": "Older people are \"happier, more satisfied, and have a greater sense of purpose\" than before the COVID-19 pandemic, a study has found. Experts analysed data from a long-term study, the English Longitudinal Study of Ageing, tracking the wellbeing of 3,999 people aged 50 in England over time. The researchers found that those surveyed reported that their happiness, eudaemonic wellbeing - which measures whether life feels worthwhile - and life satisfaction all plummeted during the COVID-19 pandemic. However, Paola Zaninotto, professor of medical and social statistics at UCL's Department of Epidemiology and Public Health, said \"remarkably\" people reported higher happiness, wellbeing and satisfaction since then. \"As many would expect, we found that wellbeing declined during the pandemic, and instances of depression rose,\" she said. \"While depression is still slightly more prevalent than before 2020, remarkably, overall older people are now happier, more satisfied and have a greater sense of purpose than before the pandemic.\" The study did find levels of depression among the 50-year-olds surveyed have not returned to pre-pandemic levels. \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  COVID inquiry latest: Watch live as Matt Hancock gives evidence\n                 \n                  Watch COVID inquiry latest: Grieving families speak at hearing\n                 Around 11.4% reported depressive symptoms before COVID-19, which rose to 27.2% in late 2020. Post-pandemic, the study found levels of depression had fallen to 14.9% - still above pre-COVID figures. Read more from Sky News:Ageism limits mental health care for elderly - reportThings do seem better in the morning, study suggests Ms Zaninotto added that \"the pandemic had a profound effect on the wellbeing of older people in England,\" but added \"we can only speculate on the reasons\" why those surveyed reported feeling better after COVID-19. \"It perhaps could reflect a renewed appreciation for social connections and meaningful activities, as well as increased psychological resilience after a period of adversity,\" she said. \"Improved health security following widespread vaccinations could also have contributed to this positive shift. \"We saw marked differences by age and affluence, underscoring the importance of tailored support policies for the immediate and lingering effects of pandemics on the well-being of our older population.\" The study was published in the journal Aging and Mental Health."
    },
    {
        "title": "OpenAI co-founder tells Sky News his platform is 'not for sale'",
        "description": "OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (&#163;78.7bn) bid overnight. ",
        "url": "https://news.sky.com/story/openai-co-founder-sam-altman-tells-sky-news-his-platform-can-be-safer-13307024",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-altman-openai_6825170.jpg?20250210224002",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-11 09:24:00",
        "Headline": "Sam Altman, who is attending the Paris AI Summit with world leaders, said the company is not for sale after Elon Musk's $97.4bn bid for the platform.",
        "Content": " OpenAI's chief executive and co-founder has told Sky News that his platform is \"not for sale\" after a group led by Elon Musk launched an unsolicited $97.4bn (£78.7bn) bid overnight.  Sam Altman, who is attending the Paris AI Summit with world leaders, was asked whether he can still afford OpenAI after Mr Musk's bid. \"The board will decide what to do there... the mission is really important and we're totally focused on making sure we preserve that,\" he told Sky's science and technology editor Tom Clarke on Tuesday morning. \"The company is not for sale, neither is the mission,\" he said. OpenAI is planning to transition to a for-profit company which Mr Musk has vehemently opposed. He has even launched legal action over it. \"It's time for OpenAI to return to the open-source, safety-focused force for good it once was,\" Mr Musk - who was also a co-founder of OpenAI - said in a statement on Monday. \"We will make sure that happens.\" Mr Altman also said he would like to \"work with China\" although he doesn't know if the US government would let him do that. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Daffodil hunt launched by Royal Horticultural Society as flower lovers urged to look out for rare varieties\n                 \n                  Older people in England happier and more satisfied now than before COVID, researchers say\n                 \"Should we try as hard as we absolutely can [to work with them]? Yes,\" he said.  Chinese company DeepSeek sent shockwaves through the AI industry a fortnight ago, when it revealed a powerful AI model that was significantly cheaper than OpenAI's ChatGPT. US officials have raised security concerns about the company, however, and it is already banned on some government devices. Read more from Sky News:Teacher admits stabbing girl, 7, to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark Mr Altman was asked if he can reassure users that one of the fastest-growing generative AI platforms will continue to put safety at the forefront of what the company does. He said his platform can be safer amid concerns that red tape around artificial intelligence will be resisted as businesses say it stifles innovation. \"Safety is integral to what we do... We've got to make these systems really safe for people, or people just won't use them. It's the same thing and we'll work super hard on that,\" said Mr Altman. Acknowledging that safety is not high on the summit's agenda, he added: \"That's not actually the main thing that we've been hearing about - the main concern has been 'can we make this cheaper, can you have more of it, can we get it better and more advanced'.\" But asked if OpenAI can look at all of those elements as well as safety, he added: \"Yes, we can also do that.\" It comes as US vice president JD Vance warned that \"excessive regulation\" would kill the rapidly growing AI industry. \"Now, at this moment, we face the extraordinary prospect of a new industrial revolution, one on par with the invention of the steam engine,\" he said. \"But it will never come to pass if overregulation deters innovators from taking the risks necessary to advance the ball.\" In his first foreign trip as vice president, Mr Vance said President Trump's administration will \"ensure that AI systems developed in America are free from ideological bias\". He said the United States would \"never restrict our citizens' right to free speech.\""
    },
    {
        "title": "Musk v Altman: The battle to become king of AI",
        "description": "Elon Musk's bid to buy OpenAI for $97.4bn (&#163;78.7bn) came unsolicited on Monday night and was quickly rejected by his former friend and OpenAI chief executive Sam Altman.",
        "url": "https://news.sky.com/story/musk-v-altman-the-battle-to-become-king-of-ai-13307145",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-musk-altman-openai_6825600.png?20250211142631",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-11 12:22:00",
        "Headline": "In 2015, Elon Musk and Sam Altman founded OpenAI to ensure \"artificial general intelligence benefits all of humanity\". A decade later, the pair are battling it out over AI.",
        "Content": "\n          Science and Technology reporter\n       Elon Musk's bid to buy OpenAI for $97.4bn (£78.7bn) came unsolicited on Monday night and was quickly rejected by his former friend and OpenAI chief executive Sam Altman. \"The company is not for sale, neither is the mission,\" Mr Altman said to Sky News this morning. \"We'll happily buy Twitter though.\" Read more: OpenAI co-founder tells Sky News it's 'not for sale' It's the latest in a long-running spat between the former tech buddies. Back in 2015, Mr Musk and Mr Altman founded OpenAI along with nine other Silicon Valley entrepreneurs to ensure \"artificial general intelligence benefits all of humanity\". But the idealistic partnership wasn't to last. Three years later, Mr Musk left after a power struggle. \"Elon wanted us to merge with Tesla or he wanted full control,\" the company wrote in a blog post about the split in 2024.  When Mr Altman and the others refused to hand over control, Mr Musk left acrimoniously, taking a promised $1bn donation with him, according to OpenAI. However, he had been right about one thing. When he'd offered to let OpenAI treat Tesla as a \"cash cow\", he'd said it was the only way to compete with Google's DeepMind project, which was developing quickly. OpenAI wasn't bringing in enough cash and everyone agreed the company would need more resources if it wanted to reach the AI holy grail: artificial general intelligence (AGI). AGI is a hypothetical AI system that can perform any intellectual task that a human can. So, after rejecting Mr Musk's offer, Mr Altman set up a \"capped-profit\" subsidiary of the company and got investments from Microsoft and others. Elon Musk was not happy. He founded his own company, xAI, and then took OpenAI to court, suing for a breach of contract. He accused the ChatGPT developer of transforming into \"a closed-source de facto subsidiary of the largest technology company, Microsoft\", according to a court filing. \"It is not just developing but is actually refining an AGI [artificial general intelligence] to maximise profits for Microsoft, rather than for the benefit of humanity\", the filing said. OpenAI denied this and also said it never promised to open-source its technology, just to spread the benefits of it. \"The Open in openAI means that everyone should benefit from the fruits of AI after it's built, but it's totally OK to not share the science...\", wrote former OpenAI chief scientist Ilya Sutskever in an email to Elon Musk in 2016. \"Yup,\" he replied, according to OpenAI. But the subsidiary still wasn't bringing in enough money and rumours began swirling in 2024 that Mr Altman would turn OpenAI into a for-profit company. Despite Mr Musk asking a judge to block this from happening, in December, Mr Altman officially released his plans for OpenAI's for-profit arm to take control and \"raise the necessary capital\" to reach general artificial intelligence. The non-profit side of the company would still exist to work on AI for the public good, the company reassured people. In order to make the switch from non-profit to for-profit, OpenAI's board is currently going through a complex process to value parts of the company. Sam Altman will then have to essentially buy the company from the non-profit, which is currently thought to be worth around $40 billion.  Musk throws a 'wrench' into Altman's profit-making plans But Elon Musk has now \"thrown a wrench\" into those proceedings with his $97.4bn (£78.7bn) offer, according to Yale professor Jonathan Macey, who specialises in corporate governance. \"The non-profit is supposed to take money to do whatever good deeds, and if OpenAI prefers to sell it to somebody else for less money, it's a concern for protecting the interests of the beneficiaries of the not-for-profit.\" OpenAI \"may not be able to ignore\" the bid, according to analyst Gil Luria, because it has credible investors backing it, including Ari Emanuel, chief executive of entertainment company Endeavour, and multiple other investment groups. However, others think this could just be another dig from Elon Musk to his former friend. \"It's partially a troll, and partially setting a price that may cause Sam to pay more than he might want to,\" wrote Dan Primack, Axios's business editor, on X. However, when Sam Altman spoke to Sky News from an AI summit in Paris on Tuesday morning, he sounded confident. \"The company is not for sale, neither is the mission.\" He was asked whether he can still afford to keep control of OpenAI after Mr Musk's bid. \"The board will decide what to do there... the mission is really important and we're totally focused on making sure we preserve that,\" he told Sky's science and technology editor Tom Clarke. Read more from Sky News:Has Elon Musk just put OpenAI in a tricky situation?In China's Silicon Valley, where DeepSeek founder keeps a low profile 'Consolidating power' If Mr Musk's bid were to be successful, some are worried about the degree of influence it could give him. \"Musk obviously already controls [X],\" Sherif Elsayed-Ali, executive director of the Future of Technology Institute, told Sky News. \"If he were to take control of OpenAI, or ChatGPT, which is the most widespread AI system out there, then you can see how that's really starting to consolidate power,\" he said. \"The reality is, Musk is a political actor as well, so this is not a pure business transaction.\""
    },
    {
        "title": "Has Elon Musk just put OpenAI in a tricky situation?",
        "description": "The AI summit in Paris is a coming together of world leaders and technology firms designed to shape a responsible and sustainable future for artificial intelligence.",
        "url": "https://news.sky.com/story/has-elon-musk-just-put-openai-in-a-tricky-situation-13307200",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-elon-musk-sam-altman_6825606.jpg?20250211143453",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-02-11 13:40:00",
        "Headline": "Elon Musk's $97.4bn (£78.7bn) bid for OpenAI is part of a long-running feud between the pair, who co-founded OpenAI as a non-profit entity for the benefit of humanity.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n The AI summit in Paris is a coming together of world leaders and technology firms designed to shape a responsible and sustainable future for artificial intelligence. But the big political day of the summit was overshadowed by a bust-up between rival billionaire tech-bros. Timed perfectly to coincide with OpenAI chief executive Sam Altman's arrival in Paris, Elon Musk put in a formal $97.4 (£78.7bn) billion offer to buy OpenAI. Read more: OpenAI co-founder tells Sky News his platform is 'not for sale' It would be easy to write it off as a typically mischievous play by Mr Musk. But his move is calculated and potentially very problematic for Mr Altman. OpenAI, which brought the world ChatGPT, is one of the global leaders in AI. Mr Altman has ambitious plans for growth. But in order to deliver on them, he wants to free OpenAI from the non-for-profit company that owns it.  That involves him essentially buying his own company from the non-profit board that formally owns it. It's rumoured the sum he was considering paying was around $40bn (£32.3bn). \n                  In China's Silicon Valley, where founder of DeepSeek Liang Wenfeng keeps a low profile\n                 \n                  Musk v Altman: The battle to become king of AI\n                 \n                  Elon Musk launches $97bn bid to buy ChatGPT-maker OpenAI\n                 So Musk's far higher offer puts the not-for-profit board in a tricky situation. If they refuse Mr Musk's offer, can they accept a far lower one from Mr Altman and still be doing their job according to the rules of the company's non-profit status? Or could Mr Musk have effectively forced Mr Altman to pay more than double for his own company? Read more from Sky News:Teacher admits stabbing girl to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark It's part of a long-running feud between the pair, who co-founded OpenAI as a non-profit entity for the benefit of humanity. And one that won't be of much interest to the political leaders convening in Paris. But it does speak to a concern AI safety campaigners have long held when it comes to the technology. How can we trust AI when it's controlled by a few, often capricious, billionaires? What further worries campaigners is that AI safety and regulation have been given short-shrift at the summit. In his address, US vice president JD Vance said the new \"industrial revolution\" that AI promises \"will never come to pass if overregulation deters innovators from taking the risks necessary\". European leaders, who have long held a tougher stance on AI regulation, seem to be softening their stance too. Concerned, perhaps, that if they don't follow America they won't be able to attract AI firms to their countries and have their own share of the power AI promises to bring."
    },
    {
        "title": "Whale earwax and parasitic worms go on display at Natural History Museum as part of 'broken planet' exhibition",
        "description": "Whale earwax and parasitic worms are going on display at the Natural History Museum in a new exhibition about the \"broken planet\".",
        "url": "https://news.sky.com/story/whale-earwax-and-parasitic-worms-go-on-display-at-natural-history-museum-as-part-of-broken-planet-exhibition-13307093",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-whale-tail_6825513.jpg?20250211132647",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-11 11:33:00",
        "Headline": "A new, permanent and free exhibition at the Natural History Museum is designed to warn people about their impact on our \"broken planet\" and help them make changes for the better.",
        "Content": "Whale earwax and parasitic worms are going on display at the Natural History Museum in a new exhibition about the \"broken planet\". The free new gallery is designed to \"explore the biggest challenges facing our planet\" and provide visitors with solutions and positive actions they can take. It is the first new, permanent gallery to open at the famous London museum since 2016. 'Fixing our Broken Planet' will feature bacteria that can be used to extract valuable copper from mine waste, show how bison are redesigning British forests for the better and explain how DNA analysis is fighting mosquito-borne diseases like malaria. Specimens like a Sumatran rhinoceros, parasitic worms and whale's earwax will be on show, curated to tell the story of the relationship between people and the planet. It comes amid mounting warnings about humans' impact on the natural world, including via \"dangerous climate breakdown\". Read more: 'The future is in our hands' scientists say, as 2024 passes warming limit \n                  Prisoners being sent back to jail because it's the 'easiest thing to do', chief inspector of probation says\n                 \n                  Sheffield city centre roads remain shut as police negotiate with 'armed man' at flats\n                 \n                  Post-mortem results reveal injuries of British couple found dead at home in France\n                 Visitors will be given \"practical, evidence-based choices they can take to combat the planetary emergency\" as demand for food, materials and energy soars. Museum director Dr Doug Gurr said: \"Our scientists have been working to find solutions for and from nature. Fixing Our Broken Planet places this research at the heart of the Museum... showing that we all have the power to make change.\" Opening in April, it is part-funded by the government's Department for Culture, Media and Sport. Arts minister Chris Bryant said: \"To create effective lasting change for the planet we must inspire all generations.\" The gallery will \"[demonstrate] how we can all make a difference\", he added. Last week, the museum crowned a photo of a badger looking at graffiti as the winner of the wildlife photographer people's choice award."
    },
    {
        "title": "In China's Silicon Valley, where founder of DeepSeek Liang Wenfeng keeps a low profile",
        "description": "The city of Hangzhou in southern China is one of the country's leading technology hubs, and home to the groundbreaking artificial intelligence (AI) company DeepSeek.",
        "url": "https://news.sky.com/story/in-chinas-silicon-valley-where-founder-of-deepseek-liang-wenfeng-keeps-a-low-profile-13307158",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-hangzhou-deepseek_6825575.jpg?20250211141134",
        "type": "Technology",
        "Author": "Nicole Johnston",
        "Date Published": "2025-02-11 12:32:00",
        "Headline": "The US is alarmed at China's AI progress. It has tried to stymie its development by placing export controls on the most advanced computer chips. But DeepSeek found a workaround and surprised the world. And there are other firms waiting to emerge with other innovations.",
        "Content": "\n          Asia correspondent\n              @nicole_reporter\n  The city of Hangzhou in southern China is one of the country's leading technology hubs, and home to the groundbreaking artificial intelligence (AI) company DeepSeek. Think of Hangzhou as a Chinese version of Silicon Valley. The headquarters of DeepSeek is on the twelfth floor of a modern office building. Security guard Mr Ma says for the last two weeks the lobby has been packed with people hoping to get a glimpse of the elusive founder of DeepSeek, Liang Wenfeng. \"For now, we as Chinese are happy and proud, but the future is uncertain,\" Mr Ma says. Chinese vloggers, tech jobseekers, journalists and members of the public have dropped in to try and visit the company, but it is keeping a low profile.  We were told by security that Liang Wenfeng hasn't been in the office for the last few days. He has gone to ground since DeepSeek hit the headlines. The company shocked the world when it launched its latest AI model and announced it had built it for less than $6m and without using the world's most advanced semiconductor chips. If this is true, it has upended the prevailing view that China was well behind in the AI race. DeepSeek appears to have made tremendous strides in AI and the Chinese government is also paying attention. Read more from Sky News:What is DeepSeek?Elon Musk launches $97bn bid to buy ChatGPT-maker OpenAI Liang Wenfeng met China's premier Li Qiang on the day the AI app was launched, 20 January. DeepSeek is exactly the type of innovative company and culture China has been pushing for under a policy it calls \"new productive forces.\" Most of China's upstart tech companies are heavily subsidised by local governments. However, DeepSeek is funded by Mr Liang's hedge fund company High Flyer. Meanwhile, Chinese Vice Premier Zhang Guoqing is attending the Paris AI summit with other world leaders and tech bosses, including US vice president JD Vance and OpenAI's chief executive Sam Altman, who spoke to Sky News on Monday morning. He said said China was willing to work with other countries to safeguard security and share achievements in the field ofartificial intelligence to build \"a community with a shared future for mankind\". Hangzhou is home to dozens of high-tech companies, the most famous are referred to as the \"six little dragons\". One of these is Deep Robotics. It develops robot dogs and is the first Chinese company to deploy its canines overseas (to Singapore) for industrial use. Deep Robotics brand manager Vera Huang told Sky News: \"Hangzhou places great emphasis on the cultivation of technological talent, with excellent institutions like Zhejiang University.\" Ms Huang says the government helps businesses develop, and if they achieve so-called \"Little Giant\" status they are eligible for state funding. The US is alarmed at China's AI progress and prowess. It has tried to stymie its development by placing export controls on the most advanced semi-conductor chips. But DeepSeek has found a workaround and says it built its model with legacy chips. US President Donald Trump said DeepSeek's development was a \"wake-up call\". Well the world has woken up. What's unclear is how it will respond."
    },
    {
        "title": "Trump signs order reversing US move to ban plastic straws as he declares paper ones 'don't work'",
        "description": "President Donald Trump is trying to bring back plastic drinking straws, reversing efforts to replace them with paper straws that he says \"don't work\".",
        "url": "https://news.sky.com/story/trump-signs-order-reversing-us-move-to-ban-plastic-straws-as-he-declares-paper-ones-dont-work-13307012",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-plastic-straw-straws_6825336.jpg?20250211104532",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-02-11 09:14:00",
        "Headline": "President Trump has railed against paper straws that \"disgustingly\" dissolve, ordering government agencies to go back to those made from plastic. It comes after several years of concerns about plastic waste accumulating on beaches and in the oceans.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n President Donald Trump is trying to bring back plastic drinking straws, reversing efforts to replace them with paper straws that he says \"don't work\". On Monday, he signed an executive order overturning a move by his predecessor Joe Biden to phase out government purchases of plastic straws, as well as plastic cutlery and packaging. Over the weekend, he declared Mr Biden's mandate \"dead\". \"Enjoy your next drink without a straw that disgustingly dissolves in your mouth!!!,\" Mr Trump wrote on Truth Social. Instead, the US president wants the government to exclusively move to plastic.  The order tells government agencies to stop buying paper straws \"and otherwise ensure that paper straws are no longer provided within agency buildings\". \"I don't think that plastic is going to affect the shark very much as they're eating, as they're munching their way through the ocean,'' he said at a White House announcement. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  British steel 'absolutely has a future' despite US tariffs, says deputy PM Angela Rayner\n                 \n                  US defence secretary Pete Hegseth works out with marines ahead of first NATO meeting\n                 In the run-up to the 2020 presidential election his campaign raised nearly $500,000 (£411,000) from selling plastic straws. Amid concerns about plastic waste accumulating on beaches and in the oceans, and about the fossil fuels required to produce them, several US states and cities have banned plastic straws, and some restaurants no longer automatically give them to customers. A 2015 video of researchers removing a straw that had got stuck in a turtle's nose went viral and helped fuel a shift away from plastic straws and other single-use items, which sometimes are used for just minutes. Plastic takes between decades and hundreds of years to break down in the environment. The plastic manufacturing industry welcomed Mr Trump's move. \"Straws are just the beginning,\" Matt Seaholm, president and CEO of the Plastics Industry Association, said in a statement. \"'Back to Plastic' is a movement we should all get behind.\" Lisa Ramsden, Greenpeace USA's senior plastics campaigner, said: \"Once again, President Trump is pretending to be a populist while siding with his Big Oil buddies over the public interest.\" The move is just one in a wave of actions by Mr Trump to rollback environmental protections. On his first day in office, he withdrew the USA, the world's second-largest climate polluter, from the landmark Paris Agreement on fighting climate change."
    },
    {
        "title": "Kanye West's Yeezy online shopping platform taken down over swastika T-shirts",
        "description": "Kanye West's Yeezy online shopping platform has been taken down after selling T-shirts featuring a swastika.",
        "url": "https://news.sky.com/story/kanye-wests-yeezy-online-shopping-platform-taken-down-over-swastika-t-shirts-13307276",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kanye-west-bianca-censori_6825747.jpg?20250211160033",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-11 15:33:00",
        "Headline": "The T-shirts were accompanied by the label \"HH-01\", understood to be code for \"Heil Hitler\". On Monday the rapper deactivated his account on X after coming under pressure for posting antisemitic messages. ",
        "Content": "Kanye West's Yeezy online shopping platform has been taken down after selling T-shirts featuring a swastika. The rapper, also known as Ye, used a Super Bowl commercial on Sunday to send people to his website to buy the clothing emblazoned with the Nazi symbol - an image often used by the extreme-right. The ecommerce platform Shopify, which hosts many online shops and businesses, has deactivated his site. Shopify said in an emailed statement to Sky News' partner network NBC News: \"All merchants are responsible for following the rules of our platform. This merchant did not engage in authentic commerce practices and violated our terms so we removed them from Shopify.\" West's representative is yet to respond to a request from NBC for comment. The white T-shirts featured a black swastika on the front and were the only items for sale on the front page of yeezy.com. No text or explanation accompanied the $20 (£16) item, just the letters \"HH-01\", which the Anti-Defamation League (ADF) said was code for \"Heil Hitler\". West's site showed a notice from Shopify which said the store was \"unavailable\". The decision to sell the T-shirt triggered widespread criticism, including from the ADF which posted a statement on X on Monday, describing the shirt sales as \"further proof\" of West's antisemitism. The organisation, formed to combat anti-Jewish bigotry and discrimination, explained that the swastika was adopted by Hitler and \"continues to threaten and instil fear in those targeted by antisemitism and white supremacy\". Read more from Sky News:Steve Bannon avoids jail after admitting fraudUkraine targets fuel used by Russian militaryArmie Hammer addresses cannibalism claims West has in recent days been posting antisemitic messages on X, as well as writing \"I love Hitler\" and \"I'm a Nazi\". His account then had a \"sensitive content warning\" added to it before he posted a final message. \"I'm logging out of Twitter,\" he wrote. \"I appreciate [X owner] Elon [Musk] for allowing me to vent.\" After his account was deactivated on Monday, his spokesperson Milo Yiannopoulos issued an explanation. \"Ye is an intergenerational artist and icon who continues to redefine the limits of creativity and free expression. He has deactivated his X account for the time being,\" he said in a statement. The Campaign Against Antisemitism was joined by Friends star David Schwimmer in calling for Elon Musk to remove West from X over a string of offensive posts. One of the most successful figures in hop-hip, West built up a fashion brand called Yeezy which began as a collaboration with Adidas. But the German sportswear giant cut ties with him in 2022 over his antisemitic remarks and eventually reached a settlement in October."
    },
    {
        "title": "Peter Kay breaks silence after comparing heckler to Lisa Riley",
        "description": "Peter Kay has said it was not \"an insult\" to liken a heckler to Lisa Riley at his show last weekend.",
        "url": "https://news.sky.com/story/lisa-riley-reacts-to-peter-kays-upsetting-gig-jibe-13307118",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peter-kay-lisa-riley_6825341.jpg?20250211104738",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-11 11:46:00",
        "Headline": "Lisa Riley says she's \"not offended\" by the jibe - but the audience member in question says she is \"annoyed and upset\".\n",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Peter Kay has said it was not \"an insult\" to liken a heckler to Lisa Riley at his show last weekend. The Bolton comedian was performing his Manchester gig on Saturday night when a woman was removed by security guards after constant heckling, including shouting \"We love you Peter\". Kay is said to have likened her to the Emmerdale actress as she was being taken out. In a statement posted to Instagram, the 51-year-old said he did his \"best to address the situation\", and \"made light of it as any comedian would\". He wrote: \"I then tried to ignore them, hoping they'd settle down, but when the disruption persisted into the second half of the show, I asked the audience around them if they were being bothered by the noise.\" He said they all shouted \"yes\", and when he asked for a show of hands, around 40 people responded by raising theirs. \"At that point I had no choice but to take action,\" he wrote. \"The lady who was escorted out did bear a striking resemblance to Lisa Riley, though I don't see how that's an insult. \"As a comedian, you never want to eject anyone, but when repeated disruptions make it impossible to continue, it's important to consider the experience of the rest of the audience, who've paid to see a show without interruption.\" The audience member has said she was \"annoyed and upset\" about the comments. Lisa Riley, meanwhile, has insisted she's \"not offended\". \"To go to a show and feel like you're having the mick taken out of you because of your weight, I was just a bit shocked,\" she told the Manchester Evening News. \"The whole arena was laughing, I think they thought it was part of the show but there was a nastiness to his voice. It was like he was trying to get the crowd against me - it just wasn't nice, to be honest.\" Riley, 48, is best known for playing Mandy Dingle in Emmerdale and also fronted You've Been Framed in the late 1990s and early 2000s. Appearing to respond to her impromptu mention during the show, Riley posted a picture on Instagram on Monday which read: \"Keep calm and laugh\". She added the message: \"It's a laugh, it's funny!!!\" She then followed it up on Tuesday with a post on Instagram which said: \"Please draw a line under this now. I am not offended, never was offended. I love Peter Kay to pieces. Laughter is my favourite medicine\". Kay was also understood to have thrown two men out of the same gig after one repeatedly shouted \"garlic bread,\" which is one of Kay's catchphrases. Kay told ITV's Good Morning Britain he had taken action against hecklers as they were ruining the show for others, and it was \"no longer fair\" to the other audience members. One audience member told the Manchester Evening News that Kay had \"shouted\" at the hecklers for \"a good three to five minutes\" during the show. They said the audience was mixed in their reaction: \"Some couldn't believe it and were obviously annoyed and others were laughing, either thinking it was part of the show or going along with it.\" Read more:Barcelona player denies inappropriately touching rivalMystery over claims of shaved cats Kay, who has been performing his record-breaking Better Late Than Never Again tour since 2022, recently performed his 100th show at the AO Arena - the same venue the three hecklers were expelled from. Tickets to watch the show start at £35, but go up to about £350 for top-notch seats. Sky News has contacted representatives for Kay for comment. Kay is currently scheduled to perform his tour into spring 2026."
    },
    {
        "title": "Armie Hammer addresses cannibalism and assault allegations",
        "description": "Armie Hammer has again denied claims that he is a cannibal and said his actions were \"not illegal\" after facing allegations of sexual assault.",
        "url": "https://news.sky.com/story/armie-hammer-addresses-cannibalism-and-assault-allegations-13307203",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-armie-hammer-actor_6825669.jpg?20250211151659",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-11 13:46:00",
        "Headline": "The 38-year-old Call Me By Your Name actor spoke candidly about allegations of rape on a podcast with presenter Louis Theroux.",
        "Content": "Armie Hammer has again denied claims that he is a cannibal and said his actions were \"not illegal\" after facing allegations of sexual assault. Speaking on The Louis Theroux Podcast, the 38-year-old Call Me By Your Name actor spoke candidly about allegations of rape made by a woman in Los Angeles in 2021. He also addressed leaked messages that detailed disturbing and violent sexual fantasies including cannibalism and rape. Asked directly by Theroux \"are you a cannibal?\" Hammer replied: \"You know what you have to do to actually be a cannibal? You have to actually eat human flesh. So no.\" The father-of-two has always vehemently denied all allegations against him, and, in the latest interview, said the accusations led to him losing his work, access to his children and professional representation. Prosecutors decided not to charge the actor over the allegations in 2023, citing \"insufficient evidence\". \"I think the most important context to give these kinds of things is they are one side of a conversation,\" Hammer said, talking about the leaked messages. \"As you'll notice of all the text messages that were released, the person who released them, their side was cut out of the entire conversation.\" 'I was a dick, but that's not illegal' Addressing a specific claim that he had eaten the organ of a living animal - a reference to one of the leaked messages - Hammer recalled taking a singular bite out of an animal's heart during a hunting trip. \"One of the traditions is you take a bite out of the heart, and you've got all your buddies around you. They're goading you on,\" the actor said. \"It's sort of like almost overly charged male rite of passage when you go hunting for your first time. \"Everyone that I know who went hunting for their first time had to do something similar.\" He went on to say that he left a lot of people \"angry\" for his behaviour, but he did nothing that was illegal. \"I'm very, I'm very quick to admit that I was selfish and inconsiderate and an asshole and a cad and I used people to make me feel better,\" he said. \"I left a lot of people in that wake very angry at me for my behaviour, which by the way, was asshole behaviour. \"Does it make me a dick? Absolutely. I have no problem admitting that I was a dick, but that's not illegal, you know?\" Following the allegations, Hammer stepped down from a film role opposite Jennifer Lopez and took to selling timeshares in the Cayman Islands, which he told Theroux he \"loved\". \"I was at the point of my life where things were so bleak that having anything to do felt amazing,\" he said. \"I was also the gardener for a school at one point. In the Cayman Islands, I helped manage an apartment building and I sold timeshares and honestly, I was having the time of my life.\" Read more from Sky News:Lisa Riley reacts to Peter Kay's 'upsetting' gig jibeKanye West criticised over Super Bowl ad Ending the podcast Hammer said he has \"moved through\" the allegations. Admitting that working on himself is still a \"daily process\" he added: \"I get that on things like this [the podcast], that stuff needs to come up, but I'm just very happy to report that that's not a part of my life anymore.\""
    },
    {
        "title": "Pilot killed as Motley Crue frontman's jet crashes at Arizona airport",
        "description": "A pilot has died after a private jet owned by Motley Crue frontman Vince Neil crashed into another plane at an airport in Arizona.",
        "url": "https://news.sky.com/story/pilot-killed-as-motley-crue-frontmans-jet-crashes-at-arizona-airport-13306945",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vince-neil_6825192.jpg?20250211042709",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-11 03:53:00",
        "Headline": "Motley Crue singer Vince Neil was not on board at the time of the fatal collision, which happened off the runway at Scottsdale Airport on Monday afternoon.",
        "Content": "A pilot has died after a private jet owned by Motley Crue frontman Vince Neil crashed into another plane at an airport in Arizona. Neil was not on board at the time of the collision, which happened off the runway at Scottsdale Airport on Monday afternoon. Neil's girlfriend Rain Andreani and her friend suffered injuries which are not thought to be life-threatening. They were taken to hospital with the jet's co-pilot, who was also injured. \"While details are still emerging, our hearts go out to the families of both the pilot who lost his life and the passengers who suffered injuries,\" Motley Crue said in a statement. \"Motley Crue will announce a way to help support the family of the deceased pilot - stand by for an announcement very soon\". Rain Andreani broke five ribs in the crash and the dogs the women were travelling with survived, TMZ reports. \n                  Elon Musk joins Donald Trump in Oval Office as he denies 'hostile takeover' of US government\n                 \n                  Trump doubles down on plans to 'take Gaza' as he meets Jordan's King Abdullah\n                 \n                  FBI uncovers thousands of secret JFK assassination files after Trump order\n                 Read more from Sky News:Teacher admits stabbing girl, 7, to deathNationwide power outage blamed on monkeyDozens of unexploded WW2 bombs found in playpark Neil's jet was arriving from Austin, Texas, when one of its two sets of landing gears failed. The Learjet veered off the runway after landing and crashed into a Gulfstream 200 business jet. Neil's lawyer said the singer is \"grateful for the critical aid of all first responders assisting today\". The Federal Aviation Administration said the incident was under investigation. Motley Crue enjoyed major success throughout the 1980s, selling more than 100 million records. Vince Neil fronted the rock band from their formation in 1981 until he left in 1992. He later reunited with the band in 1996 and fronted them until they retired in 2015, and again from the band's 2018 reunion onwards."
    }
]