[
    {
        "title": "World leaders arrive for Pope's funeral as 250,000 mourners pay final respects",
        "description": "World leaders including Sir Keir Starmer, Donald Trump and Emmanuel Macron have arrived in Rome ahead of the funeral of Pope Francis.",
        "url": "https://news.sky.com/story/world-leaders-arrive-for-popes-funeral-as-250000-mourners-pay-final-respects-13355701",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-vatican_6896876.jpg?20250425231404",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 23:01:00",
        "Headline": "Police sources have told Sky News around 200,000 people are expected to attend the pontiff's funeral, including some 130 delegations, with around one million estimated to be trying to see the procession in Rome.",
        "Content": " World leaders including Sir Keir Starmer, Donald Trump and Emmanuel Macron have arrived in Rome ahead of the funeral of Pope Francis. Police sources have told Sky News around 200,000 people are expected to attend the pontiff's funeral, including some 130 delegations, with around one million estimated to be trying to see the procession in Rome. At least 250,000 people have taken the opportunity to view the 88-year-old's casket as he lay in state over the last three days in St Peter's Basilica. Follow the latest updates ahead of the Pope's funeral  A livestream inside the basilica which had been broadcasting since Wednesday was stopped on Friday evening for the closing of the coffin, which was described as a \"private act\". An open-air funeral will take place in St Peter's Square today, which will be attended by world leaders including the UK prime minister and US president, as well as the Prince of Wales, who is attending on behalf of the King. It remains to be seen whether Ukrainian President Volodymyr Zelenskyy will attend the funeral. He had been expected to attend but Ukrainian embassy sources have told US reporters he may not be there. The funeral service typically lasts around two-and-a-half hours and will mostly be conducted in Latin. Francis's birth country of Argentina will be seated first, before Italy, a Vatican spokesperson has said, and then reigning sovereigns will be seated in alphabetical order but in the French language, followed by heads of state. The head of the Catholic Church in England and Wales told Sky News's Anna Botting he understood the seating plan to be \"royalty first, then heads of state, then political leaders\". He said the event would be \"exactly the same Catholic rite as everyone else - just on a grander scale\". Mr Trump and his wife, first lady Melania, will be seated ahead of the British government's delegation, which includes Sir Keir and his wife Victoria, as well as Foreign Secretary David Lammy. Prince William will sit with Norway's Crown Prince Haakon as he is not a reigning monarch. Read more:Inside the plans for Pope Francis's funeralFull order of service'Unprecedented' security operation for Pope's funeralCardinal who will be in conclave says picking pope is 'intimidating' After the funeral ceremony, the Pope's remains will then be taken through the streets of Rome as his body is brought to his favourite church, Santa Maria Maggiore Basilica, where it will be interred in a simple underground tomb. The Vatican said a group of \"poor and needy\" people will be present on the steps leading to the basilica to pay their respects. Scaffolding has been erected to give international media the best vantage points overlooking St Peter's Square for the funeral while there is a strong Italian police presence managing numbers and security. Watch full coverage of the Pope's funeral live on Sky News from 8am."
    },
    {
        "title": "Fighter jets, a naval destroyer and guns on show: 'Unprecedented' security operation for Pope's funeral",
        "description": "As the line of mourners moves slowly along behind him, Ciriaco Sarnelli peers at me from beneath the immaculate brim of his cap.",
        "url": "https://news.sky.com/story/guns-and-grins-the-unprecedented-security-operation-for-pope-franciss-funeral-13355677",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rome-police-adam-parsons_6896803.jpg?20250425213734",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-04-25 20:29:00",
        "Headline": "Pope Francis's decision to be buried outside the Vatican has heightened the security operation around his funeral, which is drawing in leaders from around the world.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  As the line of mourners moves slowly along behind him, Ciriaco Sarnelli peers at me from beneath the immaculate brim of his cap. The military police chief looks, by any standards, magnificent - shoulders back and proudly wearing the black uniform of the Carabinieri. \"Our history goes back more than 200 years,\" he says. \"We remember our past, and our place. The only people with black uniforms are the priests, the judges and the Carabinieri.\" He leaves the rest unsaid - the Carabinieri sit at the heart of Italian cultural life. Pope latest: Security ramping up ahead of funeral Once, they defended the borders of a young nation. Now, they have a new challenge that has its own weighty burden - to keep St Peter's Square safe during the funeral of Pope Francis. This is no easy task. Hundreds of thousands will descend upon the Vatican for the event. \n                  World leaders arrive for Pope's funeral as 250,000 mourners pay final respects\n                 \n                  Full order of service for Pope Francis's funeral\n                 \n                  Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'\n                 Many of the world's best-known politicians and dignitaries will be welcomed into St Peter's Basilica. Inside will be Donald Trump, Sir Keir Starmer, Joe Biden, Emmanuel Macron, Prince William and dozens upon dozens of other dignitaries. Outside will be the Carabinieri. They won't be alone - there are thousands of other police officers due to be assigned to protect the event - but the Carabinieri are affiliated to the military; the most highly-trained officers on duty. Read more:How Pope Francis's funeral will unfoldPope's doctor reveals pontiff's last regret \"This is an extraordinary operation,\" says Sarnelli, as we look out over the crowd. \"So we have employed some special units that belong to Carabinieri - the bomb squad, a dogs unit, snipers and helicopters. We want to assure the people who are arriving here that they can take part in this event in the best way, in a secure way.\" He says they are ready for \"common crimes\" - like pickpockets in the crowd - but also \"the biggest, terrifying events\". He says there is \"excellent coordination\" with police forces from other countries. Around him, his officers are smiling, chatting to tourists and Romans alike. The security here is overt but friendly, even if I'm told there are also plenty of plain-clothed officers mingling within the crowd. Guns and grins both on show. A police helicopter circles above. In the port of Rome, a naval destroyer has been primed for action; there are fighter jets ready to take off. You can watch full coverage of the funeral live on Sky News on Saturday If the impression is relaxed, the reality is different. The classic swan. All the strands are pulled together from one place and, what's more, it offers a perfect view of Vatican City. From where I'm standing, I can see the front of St Peter's Basilica, the side, and the roads around it. I can see the crowds coming in, and the crowds going out. And I can see an anxious policeman drumming his fingers. But we are not in St Peter's and not even in the Vatican. This is the high-security control room on the fifth floor of Rome's police headquarters. And from here, you can see everything. An array of screens are in front of us and, watching them, men and women, huddled over screens and all wearing contrasting uniforms. Some are military, some national police, some wear the clothes of firefighters. A few are in plain clothes and there is even a man wearing the badge of the prison officers' service. This centre is a hub for collaboration and decision-making and it brings together every service that is involved in ensuring the safety and security of the funeral. There is a Carabinieri officer here, as well as the Guardia di Finanza national police and the Roman force. The government's secret intelligence service is represented here, too. Elisabetta Accardo is from Rome's police department. We talk against the gentle hubbub in the control room, colleagues pointing at screens and agreeing plans. I ask when Italy last had to deal with a security operation on this scale, and she laughs. \"Hundreds of years,\" she says. \"It is unprecedented. The level of security is at the maximum.\" She describes the plan as \"structured three-dimensional security\". It is a plan that has been long in the making, but which has been reshaped over the past few days to react to the whims of the Pope's final wishes. It is, after all, more than a century since a pope was buried outside the walls of the Vatican. You get the impression that the people designing the security plan could rather have done without having to add an hour-long procession through Rome into the plan. But so be it. By Saturday night, it will be done. Rome can start to get back to normal; the foreign leaders will be on their way home. And the Rome police will breathe just a little bit easier."
    },
    {
        "title": "Full order of service for Pope Francis's funeral",
        "description": "The full order of service for the funeral of Pope Francis has been released by the Vatican.",
        "url": "https://news.sky.com/story/full-order-of-service-for-pope-franciss-funeral-13355326",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vatican-st-peters-basilica_6896432.jpg?20250425140434",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 10:35:00",
        "Headline": "More than 200,000 people are expected to attend Pope Francis's funeral in St Peter's Square. He will then be buried in Rome's Basilica of Santa Maria Maggiore - or Saint Mary Major - unlike most of his predecessors. ",
        "Content": "The full order of service for the funeral of Pope Francis has been released by the Vatican. More than 200,000 people are expected to attend Saturday's ceremony in St Peter's Square, including some 130 delegations. The service usually lasts about two-and-a-half hours and is mostly conducted in Latin. Read more: Inside the plans for Pope Francis's funeral It is being led by the dean of the College of Cardinals, Cardinal Giovanni Battista Re, who will begin with a procession led by a priest carrying a cross, followed by the coffin and ordained clergy. Francis will then be buried in Rome's Basilica of Santa Maria Maggiore - or Saint Mary Major - rather than at St Peter's Basilica in the Vatican, like almost all his predecessors. Watch full coverage of the Pope's funeral live on Sky News from 8am. Entrance antiphon The ceremony will begin with the entrance antiphon - one or more psalm verses or sentences from Holy Scripture which are typically sung or spoken. Eternal rest grant unto him, O Lord, and let perpetual light shine upon him. Praise is due to you in Sion, O God. To you we pay our vows in Jerusalem. You who hear our prayer. To you all flesh will come. Our evil deeds are too heavy for us, but only you can pardon our transgressions. Blessed the one whom you choose and call to dwell in your courts. We are filled with the good things of your house, of your holy temple. In the name of the Father, and of the Son, and of the Holy Spirit. Peace be with you. And with your spirit. The Penitential Act This follows the welcome and is a way for the faithful to confess their sinfulness. Brethren, let us acknowledge our sins, and so prepare ourselves to celebrate the sacred mysteries. I confess to almighty God and to you, my brothers and sisters, that I have greatly sinned, in my thoughts and in my words, in what I have done and in what I have failed to do, through my fault, through my fault, through my most grievous fault; therefore I ask blessed Mary ever-virgin, all the angels and saints, and you, my brothers and sisters, to pray for me to the Lord our God. May almighty God have mercy on us, forgive us our sins, and bring us to everlasting life. Collect - opening prayer Let us pray. O God, immortal shepherd of souls, look on your people's prayers and grant that our servant Pope Francis, who presided over your Church in charity, may, with the flock entrusted to his care, receive from your mercy the reward of a faithful steward. Through our Lord Jesus Christ, your Son, who lives and reigns with you in the unity of the Holy Spirit, God, for ever and ever.  First reading - from the Acts of the Apostles  He is the one appointed by God to be judge of the living and the dead. In those days: Peter opened his mouth and said: 'Truly I understand that God shows no partiality, but in every nation anyone who fears him and does what is right is acceptable to him. As for the word that he sent to Israel, preaching good news of peace through Jesus Christ - he is Lord of all - you yourselves know what happened throughout all Judea, beginning from Galilee after the baptism that John proclaimed: how God anointed Jesus of Nazareth with the Holy Spirit and with power. He went about doing good and healing all those who were oppressed by the devil, for God was with him. And we are witnesses of all that he did both in the country of the Jews and in Jerusalem. They put him to death by hanging him on a tree, but God raised him on the third day and caused him to appear, not to all the people but to us who had been chosen by God as witnesses, who ate and drank with him after he rose from the dead. And he commanded us to preach to the people and to testify that he is the one appointed by God to be judge of the living and the dead. To him all the prophets bear witness that everyone who believes in him receives forgiveness of sins through his name.' The word of the Lord. Thanks be to God. Responsorial Psalm The Lord is my shepherd; there is nothing I shall want. Fresh and green are the pastures where he gives me repose. Near restful waters he leads me; he revives my soul. He guides me along the right path, for the sake of his name. Though I should walk in the valley of the shadow of death, no evil would I fear, for you are with me. Your crook and your staff will give me comfort. You have prepared a table before me in the sight of my foes. My head you have anointed with oil; my cup is overflowing. Surely goodness and mercy shall follow me all the days of my life. In the Lord's own house shall I dwell for length of days unending.  Second Reading - from the Letter of Saint Paul to the Philippians He will transform our lowly body to be like his glorious body. Brothers and sisters, our citizenship is in heaven, and from it we await for, the Lord Jesus Christ, who will transform our lowly body to be like his glorious body, by the power that enables him even to subject all things to himself. Therefore, my brothers and sisters, whom I love and long for, my joy and crown, stand firm thus in the Lord, my beloved. The word of the Lord. Thanks be to God. Acclamation before the Gospel This is the will of my Father, says the Lord, everyone who believes in the Son should have eternal life, and I will raise him up on the last day. Gospel The Lord be with you. And with your spirit. A reading from the holy Gospel according to John. Glory to you, O Lord. When Jesus had revealed himself to his disciples and they had finished breakfast, Jesus said to Simon Peter: 'Simon, son of John, do you love me more than these?' He said to him: 'Yes, Lord; you know that I love you.' He said to him, 'Feed my lambs.' He said to him a second time: 'Simon son of John, do you love me?' He said to him, 'Yes, Lord; you know that I love you'. He said to him: 'Tend my sheep.' He said to him the third time: 'Simon, son of John, do you love me?' Peter was grieved because he said to him the third time, 'Do you love me?' and he said to him: 'Lord, you know everything; you know that I love you.' Jesus said to him: 'Feed my sheep. Truly, truly, I say to you, when you were young, you used to dress yourself and walk wherever you wanted but when you are old, you will stretch out your hands, and another will dress you and carry you where you do not want to go (this he said to show by what kind of death he was to glorify God).' And after saying this he said to him: 'Follow me.' The Gospel of the Lord. Praise to you, Lord Jesus Christ. Homily Universal Prayer or Prayer of the Faithful Brothers and sisters, let us pray to God our Father, who today brings us together to commemorate the Paschal Mystery of his only-begotten Son as we celebrate the funeral of the pastor of the universal Church. May he welcome him into his peace and bestow every blessing upon the Church and the whole world. Let us pray to the Lord. Lord, hear our prayer. For the late Pope Francis, that the chief shepherd, who eternally lives to intercede for us, may welcome him into his kingdom of light and peace. Let us pray to the Lord. Lord, hear our prayer. For the holy Church of God, that in fidelity to her mandate, she may be, in Christ, a leaven of renewal in our human family. Let us pray to the Lord. Lord, hear our prayer. For the souls of the deceased Roman pontiffs and of all those who in the Church proclaimed the Gospel and exercised the priestly ministry, that they may come to share in the heavenly liturgy. Let us pray to the Lord. Lord, hear our prayer. Read more:Who will be at the Pope's funeral - and who won't beInside Pope Francis's personal tailorsThe Irish woman who broke protocol when she welcomed the Pope For all the faithful departed, that they may be granted entrance into the kingdom of heaven. Let us pray to the Lord. Lord, hear our prayer. For us gathered here, that having celebrated the sacred mysteries, we may one day be called by Christ to enter his glorious kingdom. Let us pray to the Lord. Lord, hear our prayer. God, our salvation, hear us as we make our prayer in union with the Blessed Virgin Mary and all the Saints: welcome into the assembly of your elect the soul of your servant and our Pope Francis, who put his trust in the prayer of the Church. Through Christ our Lord.  Offertory Chant The offertory chant accompanies the procession that brings the bread and wine to the altar. Give light to my eyes lest I fall asleep in death; lest my enemy say, 'I have prevailed over him'. Pray, brethren, that my sacrifice and yours may be acceptable to God, the almighty Father. May the Lord accept the sacrifice at your hands for the praise and glory of his name, for our good and the good of all his holy Church. Prayer over the offerings Look with favour, we pray, O Lord, on the peaceful offering of your people, with which we confidently commit to your mercy the soul of your servant Pope Francis, and grant, we pray, that, having been, in the midst of the human family, an instrument of your charity and peace, he may merit to delight in the same, for ever with all your Saints. Through Christ our Lord. Eucharistic Prayer III Preface The hope of resurrection in Christ The Lord be with you. And with your spirit. Lift up your hearts. We lift them up to the Lord. Let us give thanks to the Lord our God. It is truly right and just, our duty and our salvation, always and everywhere to give you thanks, Lord, holy Father, almighty and eternal God, through Christ our lord. In him the hope of blessed resurrection has dawned, that those saddened by the certainty of dying might be consoled by the promise of immortality to come. Indeed for your faithful, Lord, life is changed not ended, and, when this earthly dwelling turns to dust, an eternal dwelling is made ready for them in heaven. And so, with angels and archangels, with thrones and dominions, and with all the hosts and powers of heaven, we sing the hymn of your glory, as without end we acclaim: You are indeed holy, O Lord, and all you have created rightly gives you praise, for through your Son our Lord Jesus Christ, by the power and working of the Holy Spirit, you give life to all things and make them holy, and you never cease to gather a people to yourself, so that from the rising of the sun to its setting a pure sacrifice may be offered to your name. Therefore, O Lord, we humbly implore you: by the same Spirit graciously make holy these gifts we have brought to you for consecration, that they may become the body and blood of your Son our Lord Jesus Christ, at whose command we celebrate these mysteries. For on the night he was betrayed he himself took bread, and giving you thanks, he said the blessing, broke the bread and gave it to his disciples, saying: 'Take this, all of you, and eat of it, for this is my body, which will be given up for you.' In a similar way, when supper was ended, he took the chalice, and giving you thanks, he said the blessing, and gave the chalice to his disciples, saying: 'Take this, all of you, and drink from it, for this is the chalice of my blood, the blood of the new and eternal covenant, which will be poured out for you and for many for the forgiveness of sins. 'Do this in memory of me.' The mystery of faith. We proclaim your death, O Lord, and profess your resurrection until you come again. Therefore, O Lord, as we celebrate the memorial of the saving passion of your Son, his wondrous resurrection and ascension into heaven, and as we look forward to his second coming, we offer you in thanksgiving this holy and living sacrifice. Look, we pray, upon the oblation of your Church and, recognising the sacrificial victim by whose death you willed to reconcile us to yourself, grant that we, who are nourished by the body and blood of your Son and filled with his Holy Spirit, may become on body, one spirit in Christ. May he make of us an eternal offering to you, so that we may obtain an inheritance with your elect, especially with the most Blessed Virgin Mary, Mother of God, with blessed Joseph, her spouse, with your blessed apostles and glorious martyrs, and with all the saints, on whose constant intercession in your presence we rely for unfailing help. May this Sacrifice of our reconciliation, we pray, O Lord, advance the peace and salvation of all the world. Be pleased to confirm in faith and charity your pilgrim Church on Earth, with the order of bishops, all the clergy, and the entire people you have gained for your own. Listen graciously to the prayers of this family, whom you have summoned before you: in your compassion, O merciful Father, gather to yourself all your children scattered throughout the world. Remember your servant Pope Francis whom you have called from this world to yourself. Grant that he who was united with your Son in a death like his, may also be one with him in his resurrection, when from the Earth he will raise up in the flesh those who have died, and transform our lowly body after the pattern of his own glorious body. To our departed brothers and sisters, too, and to all who were pleasing to you at their passing from this life, give kind admittance to your kingdom. There we hope to enjoy for ever the fullness of your glory, when you will wipe away every tear from our eyes. For seeing you, our God, as you are we shall be like you for all the ages and praise you without end, through Christ our Lord, through whom you bestow on the world all that is good. Through him, and with him, and in him, O God, almighty Father, in the unity of the Holy Spirit, all glory and honour is yours, for ever and ever. At the Saviour's command and formed by divine teaching, we dare to say: Our Father, who art in heaven, hallowed by thy name; thy kingdom come, thy will be done on earth as it is in heaven. Give us this day our daily bread, and forgive us our trespasses, as we forgive those who trespass against us; and lead us not into temptation, but deliver us from evil. Deliver us, Lord, we pray, from every evil, graciously grant our peace in our days, that, by the help of your mercy, we may be always free from sin and safe from all distress, as we await the blessed hope and the coming of our Saviour, Jesus Christ. For the kingdom, the power and the glory are yours now and for ever. Lord Jesus Christ, who said to your Apostles: Peace I leave you, my peace I give you, look not on our sins, but on the faith of your Church, and graciously grant her peace and unity in accordance with your will. Who live and reign for ever and ever. The peace of the Lord be with you always. And with your spirit. Let us offer each other the sign of peace. Behold the Lamb of God, behold him who takes away the sins of the world. Blessed are those called to the supper of the Lamb. Lord, I am not worthy that you should enter under my roof, but only say the word and my soul shall be healed. Communion Antiphon Let perpetual light shine upon him, with your Saints for ever, for you are merciful. Out of the depths I cry to you, O LORD; LORD, hear my voice! O let your ears be attentive to the sound of my pleadings. If you O LORD, should mark iniquities, LORD, who could stand? But with you is found forgiveness, that you may be revered. I long for you, O LORD, my soul longs for his word. My soul awaits the LORD more than watchmen for daybreak. More than watchmen for daybreak, let Israel hope for the LORD. For with the LORD there is mercy, in him is plentiful redemption It is he who will redeem Israel from all its iniquities. Like the deer that yearns for running streams, so my soul is yearning for you, my God. My soul is thirsting for God, the living God; when can I enter and appear before the face of God? My tears have become my bread, by night, by day, as I hear it said all the day long: 'Where is your God?' Prayer after Communion Let us pray. As we come to the table of your eternal banquet, we humbly beg your mercy, Lord, for the soul of your departed servant Pope Francis, that he may rejoice at last in possession of the truth in which he faithfully confirmed your people. Through Christ our Lord. Introduction Dear brothers and sisters, let us commend to God's tender mercy the soul of Pope Francis, bishop of the Catholic Church, who confirmed his brothers and sisters in the faith of the resurrection. Let us pray to God our Father through Jesus Christ and in the Holy Spirit; may he deliver him from death, welcome him to eternal peace and raise up him on the last day. Through the intercession of the Blessed Virgin Mary, queen of apostles and protectress of the Roman people, may God reveal to our Pope the face of his beloved Son and console the Church with the light of the resurrection. Prayer of the Church in Rome Holy Mary, Pray for him. Holy Mother of God... Mother of the Church... Protectress of the Roman people... The cardinal will then list all holy angels, patriarchs and prophets, apostles and evangelists, disciples, pontiffs and holy men and women, which he asks the congregation to pray for. O God, faithful rewarder of souls, grant that your departed servant and our bishop, Pope Francis, whom you made successor of Peter and shepherd of your Church, may happily enjoy for ever in your presence in heaven the mysteries of your grace and compassion, which he faithfully ministered on Earth. Through Christ our Lord. Prayer of the Eastern Churches God of our salvation, grant rest to the soul of your servant. Lover of mankind, lead him, with the souls of the just, to the blessings of eternal life in your presence. Guide the soul of your servant to the place of your rest, Lord, where your Saints repose, you who alone are immortal. Glory be to the Father, and to the Son, and to the Holy Spirit. You are our Saviour, our God, who descended into hell and freed those imprisoned there from its pains; now grant repose to the soul of your servant. As it was in the beginning, is now, and ever shall be. Amen. May the Blessed Virgin Mary, most pure and immaculate, who without loss to her virginity became the Mother of God, pray for the salvation of the soul of your servant. Have mercy on us, O God, in your great kindness; we beseech you, hear us and be merciful. Lord, have mercy. Again, let us pray for the repose of the soul of this departed servant of God, Francis, bishop, that he may be forgiven his every sin and failing. Lord, have mercy. May the Lord God lead his soul to the resting place of the righteous. Let us ask Christ, our immortal king and God, to bestow on him the divine mercy, the kingdom of heaven, and the forgiveness of his sins. Hear us, Lord. Let us pray to the Lord. Lord, have mercy. God of souls and of all flesh, who trampled death underfoot, vanquished the devil and gave life to the world, grant repose to the soul of your departed servant Francis, bishop, in a place of light and joy, a verdant place, a place of blessedness, where suffering, pain and sorrow are no more. Forgive every sin he committed in thought, word or deed, for you are a gracious God and a friend to mankind. No one who lives is without sin; you alone are sinless, your righteousness is eternal and your word is truth. For you, O Christ our God, are the resurrection, the life and the repose of your servant Francis, bishop, who has fallen asleep. We give you glory, with your eternal Father and your Holy Spirit, who is gracious and the giver of life, now and forever. Amen. May your remembrance be eternal, dear brother, worthy of blessedness, never to be forgotten. Amen. Responsory A responsory is an anthem said or sung by a choir. I know that my redeemer lives: on the last day I shall rise again. And in my flesh I shall see God my saviour. I shall see him myself, face to face and my own eyes shall behold him. And in my flesh I shall see God my saviour. Within my heart this hope I cherish: That in my flesh I shall see God my saviour. Gracious Father, we commend to your mercy our Pope Francis whom you made successor of Peter and shepherd of the Church, a fearless preacher of your word and a faithful minister of the divine mysteries. Welcome him, we pray, into your heavenly dwelling place, to enjoy eternal glory with all your chosen ones. We give you thanks, Lord, for all the blessings that in your goodness you bestowed upon him for the good of your people. Grant us the comfort of faith and the strength of hope. To you Father, source of life, through Christ, the conqueror of death, in the life-giving Spirit, be all honour and glory for ever and ever. Antiphons May the angels lead you into paradise; may the martyrs come and welcome you and take you to the holy city, the new and eternal Jerusalem. May choirs of angels welcome you and with Lazarus, who is poor no longer, may you have eternal rest. Canticle of the Blessed Virgin Mary Luke 1:46-55 My soul magnifies the Lord, and my spirit rejoices in God my Saviour, for he has looked on the humble estate of his servant. For behold, from now on all generations will call me blessed; for he who is mighty has done great things for me, and holy is his name. And his mercy is for those who fear him from generation to generation. He has shown strength with his arm; he has scattered the proud in the thoughts of their hearts; he has brought down the mighty from their thrones and exalted those of humble estate; he has filled the hungry with good things, and the rich he has sent away empty. He has helped his servant Israel, in remembrance of his mercy, as he spoke to our fathers, to Abraham and to his offspring for ever. Glory be to the Father and to the Son and to the Holy Spirit, as it was in the beginning, is now, and ever shall be, world without end. Amen."
    },
    {
        "title": "Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'",
        "description": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet. ",
        "url": "https://news.sky.com/story/donald-trump-says-russia-and-ukraine-are-very-close-to-a-deal-and-says-two-sides-should-now-meet-13355720",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-air-force-one_6896884.jpg?20250425233152",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 21:58:00",
        "Headline": "Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials from Russia and Ukraine should meet to \"finish [the deal] off\".",
        "Content": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet.  Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials should now meet to \"finish [the deal] off\". \"A good day in talks and meetings with Russia and Ukraine,\" Mr Trump wrote on his Truth Social platform. \"They are very close to a deal, and the two sides should now meet, at very high levels, to 'finish it off'. \"Most of the major points are agreed to. Stop the bloodshed, NOW. We will be wherever is necessary to help facilitate the END to this cruel and senseless war!\"  Throughout the week, the US president has criticised both Ukraine and Russia for failing to agree to a peace deal. On Wednesday, he accused Mr Zelenskyy of harming talks on Truth Social, saying \"the man with 'no cards to play' should now, finally, GET IT DONE\". \n                  FBI arrests US judge accused of helping man evade immigration authorities\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 A day later, after nine people were killed in Kyiv after a Russian missile and drone strike, Mr Trump said: \"Vladimir, STOP! 5000 soldiers a week are dying. Let's get the Peace Deal DONE!\" The president and other officials have also threatened to withdraw from negotiations if no progress is made toward a deal. It comes after Mr Trump's envoy Steve Witkoff met Vladimir Putin in Moscow to discuss a US-brokered peace plan for Ukraine.  The talks allowed Russia and the United States to \"further bring their positions closer together\" on \"a number of international issues\", a Kremlin aide said. Speaking earlier on the flight to Italy, Mr Trump said he hadn't been fully briefed on Mr Witkoff and Mr Putin's meeting - but added it was a \"pretty good meeting\". World leaders are gathering in Vatican City for the Pope's funeral. There are no formal plans for meetings, but their close proximity could give them opportunity to discuss the war in Ukraine. Speaking on Air Force One, Mr Trump suggested it would be \"disrespectful\" for them to meet for political discussions, though he later added: \"But I'll be talking to people.\" Read more:US and Russia talks moving in 'right direction', top diplomat saysA 'barbaric' 24 hours in a 'horrendous' war Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Ukraine has repeatedly said it would not accept a deal conceding land or handing over sovereignty to Russia. However, Mr Trump said in an interview with TIME magazine that \"Crimea will stay with Russia,\" describing the region as a place where Moscow has \"had their submarines\" and \"the people speak largely Russian\". \"Zelenskyy understands that, and everybody understands that it's been with them for a long time,\" he added. \"It's been with them long before Trump came along.\" When asked on Friday about Mr Trump's comments, Mr Zelenskyy did not want to comment but reiterated that recognising occupied Ukrainian territory as Russian is a red line."
    },
    {
        "title": "FBI arrests US judge accused of helping man evade immigration authorities",
        "description": "The FBI has arrested a US judge who is accused of helping a man evade immigration authorities.",
        "url": "https://news.sky.com/story/fbi-arrests-us-judge-accused-of-helping-man-evade-immigration-authorities-13355660",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-judge-hannah-dugan_6896780.jpg?20250425210505",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 20:01:00",
        "Headline": "Judge Hannah Dugan has been accused of escorting a man and his lawyer out of her courtroom through the jury door, escalating tensions between the Trump administration and the US judiciary over the president's sweeping immigration crackdown.",
        "Content": "The FBI has arrested a US judge who is accused of helping a man evade immigration authorities. Judge Hannah Dugan allegedly escorted a man and his lawyer out of her Milwaukee courtroom through the jury door on 18 April after learning that officials were seeking his arrest. The man, named as Eduardo Flores-Ruiz, was taken into custody outside the courthouse after officers chased him on foot. The judge's arrest escalates tensions between the Trump administration and the US judiciary over the president's sweeping immigration crackdown. Speaking onboard Air Force One, Donald Trump was asked about the case, and claimed \"the courts are holding us back\". He also complained about the length of the judicial process for removing people from the country. Wisconsin governor Tony Evers accused Mr Trump's government of using \"dangerous rhetoric to attack and attempt to undermine our judiciary at every level\". \n                  Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 Ms Dugan was taken into custody by the FBI on Friday morning on courthouse grounds, according to a US Marshals spokesperson. She appeared briefly in federal court before being released. Her next court appearance is 15 May. She faces charges of \"concealing an individual to prevent his discovery and arrest\" and obstructing or impeding a proceeding. A statement issued on behalf of Ms Dugan, issued later on Friday, said: \"Judge Hannah C Dugan has committed herself to the rule of law and the principles of due process for her entire career as a lawyer and a judge. \"She has retained former United States attorney Steven Biskupic to represent her. Judge Dugan will defend herself vigorously, and looks forward to being exonerated.\" 'Out through jury door' Court papers suggest that Ms Dugan was alerted to the presence of US immigration authorities in the courthouse by her clerk - who in turn was told by a lawyer that officers appeared to be in the hallway. An FBI affidavit described Ms Dugan as \"visibly angry\" over the arrival of immigration officers in the building. It said she described the situation as \"absurd\" before leaving the bench for her chambers. It added that along with another judge, she later approached the officers inside the court, displaying what witnesses said was a \"confrontational, angry demeanour\". After a discussion with officers over the warrant for the man, according to the affidavit, she demanded the officers speak to the chief judge and led them from the courtroom. Afterwards, Ms Dugan was said to have returned to the courtroom and was heard saying words to the effect of \"wait, come with me\", before allegedly ushering Flores-Ruiz and his lawyer out through a jury door and into a non-public area of the courthouse. Attorney general Pam Bondi said Flores-Ruiz was facing domestic violence charges and his alleged victims were in the courtroom at the time. The officers were said to have caught the defendant after chasing him outside the court. Read more from Sky News:How Pope Francis's funeral will unfoldLuigi Mangione pleads not guiltyWarhol artwork 'likely' binned by Dutch town hall US senator Tammy Baldwin called the arrest a \"gravely serious and drastic move\" that \"threatens to breach\" the separation of power between the executive and judicial branches. The case is similar to one brought during the first Trump administration against a Massachusetts judge accused of helping a man sneak out the back door of a court to evade immigration officers."
    },
    {
        "title": "Claire Chick: Paul Butler jailed for life for murdering Plymouth university lecturer",
        "description": "A former doorman has been jailed for life for the murder of a university lecturer in Plymouth.",
        "url": "https://news.sky.com/story/claire-chick-paul-butler-jailed-for-life-for-murdering-plymouth-university-lecturer-13355217",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-plymouth-claire-chick_6812791.jpg?20250425153757",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 07:16:00",
        "Headline": "Claire Chick was found seriously injured on a Plymouth street on 22 January. She was taken to hospital, but died the next day after the frenzied attack by her husband. He had spent six months stalking and harassing her.",
        "Content": "A former doorman has been jailed for life for the murder of a university lecturer in Plymouth. Paul Butler, 53, was sentenced to a minimum term of 27 years for killing his estranged wife Claire Chick after a six-month campaign of stalking and harassment when he refused to accept their relationship was over. Ms Chick, 48, was found seriously injured on West Hoe Road just before 9pm on 22 January. She was taken to hospital, but died soon after. Previously known as Claire Butler, Ms Chick worked at the University of Plymouth. She died after a frenzied attack outside her home. The attack was the culmination of months of harassment, stalking and violence at the hands of Butler. Devon and Cornwall Police made a referral to the police watchdog due to previous contact with Ms Chick prior to her death. Jo Martin KC, prosecuting, said Ms Chick had made six statements to the police about Butler and he had been arrested three times before the attack. Victim's final statement to police In her final statement to police the day before he killed her outside her own home, she said: \"I only feel that Butler will kill me if further action is not taken. I am in fear of leaving my house.\" Butler was arrested around 20 miles away in the Liskeard area on 24 January. He was sentenced on Friday at Plymouth Crown Court, having previously pleaded guilty to murder, and to one charge of possession of a bladed article. The court heard that after killing Ms Chick, Butler went to McDonald's for food and told a friend: \"I am pretty certain I have ended her.\" After the judge handed down Butler's sentence, Devon and Cornwall Police said it had made \"immediate changes\" to its stalking and harassment procedures, to try and focus more on protecting victims and targeting perpetrators. 'I loved Claire' The family of Ms Chick told the court how her murder left a \"huge void\" in their lives. Her eldest daughter, Bethany Hancock-Baxter, described Butler as \"evil\". She said: \"I want this evil man to listen to me. I want you to know what you have done to us as a family.\" Her sister, Lydia Peers, said Butler was a \"parasite\". After her short-lived marriage to Butler, Ms Chick began a relationship with another man, Paul Maxwell. Mr Maxwell spoke from the witness box and repeatedly stared at the defendant as he spoke. Butler stared back at him. \"I loved Claire. She was beautiful, funny and kind,\" Mr Maxwell said. The attack Despite being on bail and banned from going near her, 6ft 5in Butler continued to stalk 5ft 2in Ms Chick, even putting a tracking device on her car, the court heard. When he learned she had begun a new relationship, he went to her flat and waited for her. He then attacked her in the street, stabbing her more than 20 times with a large kitchen knife he had bought from a supermarket that day. Before fleeing the scene, Butler chased Ms Chick's new partner, Mr Maxwell, who had returned from a regular evening run and witnessed the attack. 'She regretted getting married' Following the end of her first marriage, Ms Chick moved to the same street as Butler, leading to them meeting in 2021, the court heard. They became a couple by summer 2022 and married in June 2024. However, the prosecution said Ms Chick had \"expressed some doubts\" before the wedding, and the honeymoon was \"the end of the relationship\". Read more from Sky News:Inside Pope Francis's final farewellHeadteacher jailed for attacking his deputyLuigi Mangione due in court Ms Martin said: \"They had a huge argument. She told friends she regretted getting married and everything was about him. \"On August 23, she told him she wanted to live alone. He made it clear he would make her change her mind. \"He would tell her he loved her, make threats of violence and threaten suicide. \"He also expressed feelings of jealousy and thought she was seeing someone.\" It was amid this escalating behaviour that Ms Chick began contacting the police."
    },
    {
        "title": "'Bring on the fight' over net zero, energy secretary Ed Miliband tells critics",
        "description": "The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband.",
        "url": "https://news.sky.com/story/bring-on-the-fight-over-net-zero-energy-secretary-ed-miliband-tells-critics-13355444",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6896599.jpg?20250425172110",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-25 13:50:00",
        "Headline": "Wrapping up a two-day summit on energy security in London, Mr Miliband said clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband. Amid growing attacks on its climate policies from the Trump administration, UK political parties and some businesses, the government this week reiterated its assertion that clean power will make Britain more secure. Wrapping up a two-day summit on energy security in London, Mr Miliband said: \"The critics need to know that if they want to fight about this, this government says 'bring it on'.\" Clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\", he said. Whereas \"insecure\" fossil fuels are to blame for \"the cost of living crisis, which ruined family finances, which ruined public finances, which ruined business finances\". Renewable electricity in the UK is cheaper than gas, but the benefits don't reach households very easily because prices are still closely linked with the cost of gas - something the government wants to fix. In the last week, Reform UK leader Nigel Farage MP accused Mr Miliband of \"net zero lunacy\", while President Trump's US official at the London summit Tommy Joyce on Thursday called net zero \"harmful and dangerous\". \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  'Nervous wees' of women at London Marathon 'to be turned into something amazing'\n                 \n                  Tech firms face fines up to £60,000 for failing to remove knife crime content\n                 In a news conference on Friday, Mr Miliband said: \"Whether it is political parties or other forces that want to take on net zero and the clean energy transition, they need to know this government is not for bending, this government is not for buckling, this government is standing firm.\"  But, with trade talks under way and the UK still heavily reliant on US oil and gas, Mr Miliband said Britain will find \"common ground\" with America on energy, despite wildly different views on climate policy. \"Obviously there are some differences, but there is also common ground,\" he said, citing shared interests in boosting nuclear power. The American official at the summit, acting assistant secretary Tommy Joyce, enjoyed plenty of time with the government during his visit, sitting next to Mr Miliband at a ceremonial dinner on Thursday evening, and meeting energy minister Michael Shanks on Friday. Also on the charm offensive with the Americans this week was Chancellor Rachel Reeves, who has been in Washington trying to win favour for a US-UK trade deal. Washington's attacks on climate and net zero policies, which Mr Trump sees as a threat that empowers rival China, threatened to overshadow the energy security summit. But it wrapped up on Friday with little fanfare, just closing remarks from co-host the International Energy Agency and Mr Miliband about the importance of clean energy and the materials need to build them. They will both be pleased that they and the other 60 countries present held the line on the transition to cleaner energy. On Thursday, Prime Minister Sir Keir Starmer told the summit that clean power was \"in the DNA of my government\". But his government was also the target of environmental protesters outside the summit at Lancaster House, who called out its wavering over the Rosebank oil and gas field. It has also been criticised for approving airport expansions and relaxing rules around electric vehicles."
    },
    {
        "title": "Kremlin blames Ukraine for car bomb killing of Russian general near Moscow - as Trump envoy meets Putin",
        "description": "The Kremlin has blamed Ukraine for a car bomb that killed a Russian general near Moscow hours before Donald Trump's envoy was due to meet Vladimir Putin in the capital.",
        "url": "https://news.sky.com/story/kremlin-blames-ukraine-for-car-bomb-killing-of-russian-general-near-moscow-as-trump-envoy-meets-putin-13355393",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yaroslav-moskalik-moscow_6896772.jpg?20250425205429",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-25 12:32:00",
        "Headline": "The killing of Lieutenant General Yaroslav Moskalik follows that of another senior Russian military figure in December.",
        "Content": " The Kremlin has blamed Ukraine for a car bomb that killed a Russian general near Moscow hours before Donald Trump's envoy was due to meet Vladimir Putin in the capital. The death of Lieutenant General Yaroslav Moskalik is the second such fatal attack on a top Russian military officer in four months. Russia's top criminal investigation agency said he was killed by an explosive device placed in his car in Balashikha, just outside the capital. Follow the latest updates on the Ukraine war Moskalik was a deputy head of the main operational department in the General Staff of the Russian armed forces. \"The Kyiv regime once again simply shows its true nature. The Kyiv regime continues to be involved in terrorist activity on the territory of our country,\" Kremlin spokesman Dmitry Peskov said. He didn't offer any evidence. \n                  Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'\n                 \n                  Russian foreign minister Sergei Lavrov says US and Moscow moving in 'right direction' for Ukraine peace\n                 \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \"It shows once again that, despite the peace talks, we must be on guard and understand the nature of this regime.\" Ukraine has not responded to the killing. Investigative committee spokesperson Svetlana Petrenko said the explosive device was rigged with shrapnel, adding that investigators were at the scene. Videos showed a vehicle burning in the courtyard of an apartment building and a body covered in a sheet could be seen on the pavement nearby. Moscow correspondent Explosions like this are happening with increasing frequency in Moscow. There have now been four since last summer, with high-ranking military figures the target each time. The latest victim was another senior officer called Yaroslav Moskalik. He was a lieutenant general, and deputy head of the main operational department in the General Staff of Russia's armed forces. It's unclear why he was targeted - it may simply be because of his seniority and apparent vulnerability. As with previous the bombings, there is an obvious question: is it because of the war in Ukraine? Kyiv hasn't commented on this bombing, but they did claim responsibility for the one in December that killed a top Russian general. Speaking to Sky News, Russian Foreign Ministry spokesperson Maria Zakharova called it a \"terrorist attack\", echoing language Moscow has used when describing similar attacks in the past. The timing feels significant - coinciding with Steve Witkoff's visit to the Russian capital to meet Vladimir Putin. If it was Ukraine, could it be a way of signalling their displeasure at the way peace talks are progressing? Or an attempt to demonstrate how Moscow can still be hurt? Either way, it's not a great look for the Kremlin. It comes after Lieutenant General Igor Kirillov was killed in December when a bomb hidden on an electric scooter parked outside his apartment building exploded as he left for his office. Russian authorities blamed Ukraine for the killing of Kirillov, and Ukraine's security agency acknowledged that it was behind that attack. Kirillov was the chief of Russia's radiation, biological and chemical protection forces, the special troops tasked with protecting the military from the enemy's use of nuclear, chemical or biological weapons and ensuring operations in a contaminated environment. His assistant also died in the attack. Talks bring Russia and US 'closer together' Friday's bombing came as Mr Trump's envoy Steve Witkoff met Mr Putin in Moscow to discuss a US-brokered peace plan for Ukraine. The talks allowed Russia and the United States to \"further bring their positions closer together\" on \"a number of international issues\", a Kremlin aide said. The two sides discussed \"the possibility of resuming direct negotiations between representatives of the Russian Federation and Ukraine\", Yuri Ushakov said.  The talks in Moscow lasted for three hours and were \"constructive and useful\", he added. Speaking on a flight to Italy for the Pope's funeral, the US president said he hadn't been fully briefed on Mr Witkoff and Mr Putin's meeting - but added it was a \"pretty good meeting\". The meeting was their fourth encounter since February. Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022."
    },
    {
        "title": "Three men jailed for plotting to murder £54m Securitas robber Paul Allen",
        "description": "Three men have been jailed for a combined total of 99 years for plotting to murder a member of a gang that carried out Britain's biggest-ever cash robbery.",
        "url": "https://news.sky.com/story/three-men-jailed-for-plotting-to-murder-16354m-securitas-robber-paul-allen-13355215",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stewart-ahearne-louis-ahearne_6860244.jpg?20250318093610",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-25 07:05:00",
        "Headline": "Paul Allen, who took part in Britain's biggest-ever cash robbery, was shot twice. The attack has left him paralysed from the chest down.",
        "Content": " Three men have been jailed for a combined total of 99 years for plotting to murder a member of a gang that carried out Britain's biggest-ever cash robbery. Paul Allen, 46, was shot twice as he stood in his kitchen in Woodford, east London, on 11 July 2019. He was a member of the Securitas heist gang that stole £54m from a cash depot in Tonbridge, Kent, in 2006. The former cage fighter was living in a large detached rented house with his partner and three young children after being released from an 18-year prison sentence over the raid. The attack at his home has left him paralysed from the chest down. Louis Ahearne, 36, Stewart Ahearne, 46, and Daniel Kelly, 46, denied conspiring to murder Allen but were found guilty last month following a trial at the Old Bailey. The trio were sentenced at the Old Bailey in central London on Friday. Kelly was sentenced to 36 years in prison and an extra five years on licence, Louis Ahearne was jailed for 33 years, and his sibling Stewart Ahearne - 30 years. Prosecutors did not give a motive for the murder plot, though they described the victim as a \"sophisticated\" career criminal. Detectives said the shooting could seem like \"the plot [of] a Hollywood blockbuster\" but added it was actually \"horrific criminality\" from \"hardened organised criminals\". In her sentencing remarks, the judge said she believed the trio \"were motivated by a promise of financial gain\". Judge Sarah Whitehouse KC said: \"I have no doubt that this agreement to murder Paul Allen involved other people apart from the three of you and that you three were motivated by a promise of financial gain. \"The culpability of each one of you is very high. \"The harm caused to the victim was very serious - indeed, short of killing him it could hardly be more serious. He is currently paralysed and relies on others for every single need.\" The shooting was just the latest act in a long list of criminal deeds. The day before, Kelly and Louise Ahearne used a rented car to carry out a burglary in Kent, accessing the gated community by pretending to be police officers. A month before that, the trio had stolen more than $3.5m (£2.78m) worth of Ming dynasty antiques from the Museum of Far Eastern Arts in Geneva, for which the Ahearne brothers had been jailed in Switzerland. Kelly is also wanted in Japan over the robbery of a Tokyo jewellery store in 2015 in which a security guard was punched in the face."
    },
    {
        "title": "Claire Chick: Paul Butler jailed for life for murdering Plymouth university lecturer",
        "description": "A former doorman has been jailed for life for the murder of a university lecturer in Plymouth.",
        "url": "https://news.sky.com/story/claire-chick-paul-butler-jailed-for-life-for-murdering-plymouth-university-lecturer-13355217",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-plymouth-claire-chick_6812791.jpg?20250425153757",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-25 07:16:00",
        "Headline": "Claire Chick was found seriously injured on a Plymouth street on 22 January. She was taken to hospital, but died the next day after the frenzied attack by her husband. He had spent six months stalking and harassing her.",
        "Content": "A former doorman has been jailed for life for the murder of a university lecturer in Plymouth. Paul Butler, 53, was sentenced to a minimum term of 27 years for killing his estranged wife Claire Chick after a six-month campaign of stalking and harassment when he refused to accept their relationship was over. Ms Chick, 48, was found seriously injured on West Hoe Road just before 9pm on 22 January. She was taken to hospital, but died soon after. Previously known as Claire Butler, Ms Chick worked at the University of Plymouth. She died after a frenzied attack outside her home. The attack was the culmination of months of harassment, stalking and violence at the hands of Butler. Devon and Cornwall Police made a referral to the police watchdog due to previous contact with Ms Chick prior to her death. Jo Martin KC, prosecuting, said Ms Chick had made six statements to the police about Butler and he had been arrested three times before the attack. Victim's final statement to police In her final statement to police the day before he killed her outside her own home, she said: \"I only feel that Butler will kill me if further action is not taken. I am in fear of leaving my house.\" Butler was arrested around 20 miles away in the Liskeard area on 24 January. He was sentenced on Friday at Plymouth Crown Court, having previously pleaded guilty to murder, and to one charge of possession of a bladed article. The court heard that after killing Ms Chick, Butler went to McDonald's for food and told a friend: \"I am pretty certain I have ended her.\" After the judge handed down Butler's sentence, Devon and Cornwall Police said it had made \"immediate changes\" to its stalking and harassment procedures, to try and focus more on protecting victims and targeting perpetrators. 'I loved Claire' The family of Ms Chick told the court how her murder left a \"huge void\" in their lives. Her eldest daughter, Bethany Hancock-Baxter, described Butler as \"evil\". She said: \"I want this evil man to listen to me. I want you to know what you have done to us as a family.\" Her sister, Lydia Peers, said Butler was a \"parasite\". After her short-lived marriage to Butler, Ms Chick began a relationship with another man, Paul Maxwell. Mr Maxwell spoke from the witness box and repeatedly stared at the defendant as he spoke. Butler stared back at him. \"I loved Claire. She was beautiful, funny and kind,\" Mr Maxwell said. The attack Despite being on bail and banned from going near her, 6ft 5in Butler continued to stalk 5ft 2in Ms Chick, even putting a tracking device on her car, the court heard. When he learned she had begun a new relationship, he went to her flat and waited for her. He then attacked her in the street, stabbing her more than 20 times with a large kitchen knife he had bought from a supermarket that day. Before fleeing the scene, Butler chased Ms Chick's new partner, Mr Maxwell, who had returned from a regular evening run and witnessed the attack. 'She regretted getting married' Following the end of her first marriage, Ms Chick moved to the same street as Butler, leading to them meeting in 2021, the court heard. They became a couple by summer 2022 and married in June 2024. However, the prosecution said Ms Chick had \"expressed some doubts\" before the wedding, and the honeymoon was \"the end of the relationship\". Read more from Sky News:Inside Pope Francis's final farewellHeadteacher jailed for attacking his deputyLuigi Mangione due in court Ms Martin said: \"They had a huge argument. She told friends she regretted getting married and everything was about him. \"On August 23, she told him she wanted to live alone. He made it clear he would make her change her mind. \"He would tell her he loved her, make threats of violence and threaten suicide. \"He also expressed feelings of jealousy and thought she was seeing someone.\" It was amid this escalating behaviour that Ms Chick began contacting the police."
    },
    {
        "title": "Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'",
        "description": "The head of the Catholic Church in England and Wales has told Sky News it's \"intimidating\" to be one of those responsible for choosing the next pope.",
        "url": "https://news.sky.com/story/cardinal-vincent-nichols-british-cardinal-who-will-be-in-the-conclave-says-picking-the-next-pope-is-intimidating-13355243",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vincent-nichols-cardinal_6896410.jpg?20250425134132",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-25 08:29:00",
        "Headline": "Pope Francis's funeral will take place at St Peter's Square on Saturday 26 April from 9am UK time and will be attended by world leaders.",
        "Content": " The head of the Catholic Church in England and Wales has told Sky News it's \"intimidating\" to be one of those responsible for choosing the next pope. Vincent Nichols is among four UK cardinals in Rome for the Pope's funeral on Saturday. Following the funeral, and after nine days of mourning, cardinals from around the world will gather in the Vatican's Sistine Chapel to cast their votes, with white smoke announcing to the world when a new pope has been elected. Cardinal Nichols told Sky's Anna Botting: \"I hope nobody goes into this conclave, as it were, with the sole purpose of wanting to win. I think it's very important that we go in wanting to listen to each other... It has to be together, trying to sense what God wants next. Not just for the church.\" He described the procession that took Pope Francis to lie in state as \"the most moving thing I've ever attended here\". Describing the Pope as a \"master of the gesture and the phrase\", he also recalled the pontiff's last journey away from the Vatican. Cardinal Nichols said Pope Francis had visited the Regina Coeli prison, telling the inmates: \"You know, except for the grace of God, it could well have been me ... Don't lose hope, God has you written in his heart.\" \n                  Liverpool defender Virgil van Dijk signs new contact with Premier League club\n                 \n                  Man arrested on suspicion of murder after woman stabbed in Liverpool flat\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 Read more: How Pope Francis's funeral will unfoldThe full order of service  The Pope later told his doctor his last regret was not being able to wash the feet of the prisoners during that visit. Becoming emotional, he also said the final message he would like to have given Pope Francis is \"thank you\". The 88-year-old died peacefully on Easter Monday, the Vatican confirmed. Heads of state - including Sir Keir Starmer, Donald Trump and Emmanuel Macron - have all confirmed their attendance at his funeral, which takes place on Saturday at St Peter's Square. Prince William will attend on behalf of the King, Kensington Palace has said. You can watch full coverage of the funeral live on Sky News on Saturday  Talking about the seating plan at the funeral, Cardinal Nichols said he understood it to be \"royalty first, then heads of state, then political leaders\". Cardinal Nichols explained event would be \"exactly the same Catholic rite as everyone else - just on a grander scale\".  In a break from tradition, Pope Francis will be the first pope in a century to be interred outside the Vatican - and will instead be laid to rest at his favourite church, Santa Maria Maggiore Basilica in Rome's Esquilino neighbourhood. He will also be buried in just one simple wooden coffin, instead of the traditional three coffins which are usually used for pontiffs. Born in Crosby near Liverpool, Cardinal Vincent Nichols hoped to be a lorry driver as a child - but as a teenager reportedly felt the calling to join the priesthood while watching Liverpool FC. As cardinal, he is known for leading the church's work tackling human trafficking and modern slavery, for which he received the UN Path to Peace Award. He was criticised by the UK's Independent Inquiry into Child Sexual Abuse, which said he \"demonstrated a lack of understanding\" of the impact of abuse and \"seemingly put the reputation of the church first\". Cardinal Nichols, responding to the findings, previously told Sky News he was \"ashamed at what has happened in the context of the Catholic Church\" and promised to improve the church's response. He has appeared to rule himself out of the running for pope, telling reporters he was \"too old, not capable\"."
    },
    {
        "title": "Headteacher jailed for attacking his deputy over 'sexual jealousy'",
        "description": "A headteacher who attacked his deputy with a wrench at school due to \"overwhelming sexual jealousy\" has been jailed.",
        "url": "https://news.sky.com/story/anthony-felton-headteacher-jailed-for-assaulting-his-deputy-at-school-over-sexual-jealousy-13348713",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-anthony-john-felton_6878639.jpg?20250407104540",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-25 08:18:00",
        "Headline": "Anthony Felton armed himself with a wrench and sought out his colleague - believing he had slept with another teacher with whom he had recently been in a relationship.",
        "Content": "A headteacher who attacked his deputy with a wrench at school due to \"overwhelming sexual jealousy\" has been jailed. Anthony John Felton previously pleaded guilty to one count of attempting to cause grievous bodily harm with intent to Richard Pyke, 51. The 54-year-old armed himself with the tool and sought out his colleague - attacking him from behind. Ieuan Rees, for the prosecution, said Felton believed Mr Pyke had slept with another teacher, with whom he had recently been in a relationship. Felton was sentenced to 28 months in prison at Swansea Crown Court on Friday. He was also given a restraining order. After the incident at St Joseph's Roman Catholic Comprehensive School in Aberavon, South Wales, on 5 March this year, Felton threw the wrench away and left the school premises in his car. \n                  Alexander Zurawski: Mum sentenced for killing six-year-old son after hearing 'demonic voices'\n                 \n                  Owner of paddleboarding company jailed over deaths of four people in Pembrokeshire\n                 \n                  Family of man killed by psychiatric patient say they've been 'treated like dirt' after learning attacker can leave hospital\n                 He then sent an email to his staff, apologising \"for the problems and distress his actions were likely to cause\". Read more from Sky News:Trio jailed for plotting to murder man who took part in biggest-ever cash robberyMan shot dead by police called 999 himself, report indicates Sentencing Felton, Judge Paul Thomas KC said the attack was the result of \"overwhelming sexual jealousy\". \"That a headmaster of a school should take and use a weapon to try to badly injure their deputy, is I suspect, entirely without precedent,\" he said. \"You are more than intelligent enough to realise when you plotted this bizarre attack that the impact and ramifications would be immense and far-reaching.\" The judge said the attack \"was in effect an ambush,\" with Mr Pyke believing his attacker to be his friend. In a victim impact statement, Mr Pyke told the court he would live with the attack for the rest of his life, saying it had taken \"what made me, me\". \"I trusted you completely,\" he said. While John Hipkin KC, for the defence, said Felton had recently suffered due to the death of his mother and a cancer diagnosis, the judge argued his actions were due to jealousy. He said: \"Ultimately, the trigger for your act of extreme violence was of your own doing, the overwhelming sexual jealousy arising from an adulterous affair and the uncontrollable rage it created in you.\" Following the incident, police said Mr Pyke was discharged from hospital after suffering minor injuries. Abul Hussain, of the Crown Prosecution Service, said: \"Anthony Felton struck a defenceless man repeatedly to the head with a metal weapon, demonstrating he had an intent to cause his victim really serious harm. \"The level of unprovoked violence, from a professional in the workplace, was shocking. \"Too often we see attacks of this nature result in life-changing injuries or fatal consequences, and thankfully, that was not the result in this case.\" Felton was appointed headteacher in September 2023, according to an annual report from the governing body."
    },
    {
        "title": "'Bring on the fight' over net zero, energy secretary Ed Miliband tells critics",
        "description": "The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband.",
        "url": "https://news.sky.com/story/bring-on-the-fight-over-net-zero-energy-secretary-ed-miliband-tells-critics-13355444",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6896599.jpg?20250425172110",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-25 13:50:00",
        "Headline": "Wrapping up a two-day summit on energy security in London, Mr Miliband said clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband. Amid growing attacks on its climate policies from the Trump administration, UK political parties and some businesses, the government this week reiterated its assertion that clean power will make Britain more secure. Wrapping up a two-day summit on energy security in London, Mr Miliband said: \"The critics need to know that if they want to fight about this, this government says 'bring it on'.\" Clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\", he said. Whereas \"insecure\" fossil fuels are to blame for \"the cost of living crisis, which ruined family finances, which ruined public finances, which ruined business finances\". Renewable electricity in the UK is cheaper than gas, but the benefits don't reach households very easily because prices are still closely linked with the cost of gas - something the government wants to fix. In the last week, Reform UK leader Nigel Farage MP accused Mr Miliband of \"net zero lunacy\", while President Trump's US official at the London summit Tommy Joyce on Thursday called net zero \"harmful and dangerous\". \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  'Nervous wees' of women at London Marathon 'to be turned into something amazing'\n                 \n                  Tech firms face fines up to £60,000 for failing to remove knife crime content\n                 In a news conference on Friday, Mr Miliband said: \"Whether it is political parties or other forces that want to take on net zero and the clean energy transition, they need to know this government is not for bending, this government is not for buckling, this government is standing firm.\"  But, with trade talks under way and the UK still heavily reliant on US oil and gas, Mr Miliband said Britain will find \"common ground\" with America on energy, despite wildly different views on climate policy. \"Obviously there are some differences, but there is also common ground,\" he said, citing shared interests in boosting nuclear power. The American official at the summit, acting assistant secretary Tommy Joyce, enjoyed plenty of time with the government during his visit, sitting next to Mr Miliband at a ceremonial dinner on Thursday evening, and meeting energy minister Michael Shanks on Friday. Also on the charm offensive with the Americans this week was Chancellor Rachel Reeves, who has been in Washington trying to win favour for a US-UK trade deal. Washington's attacks on climate and net zero policies, which Mr Trump sees as a threat that empowers rival China, threatened to overshadow the energy security summit. But it wrapped up on Friday with little fanfare, just closing remarks from co-host the International Energy Agency and Mr Miliband about the importance of clean energy and the materials need to build them. They will both be pleased that they and the other 60 countries present held the line on the transition to cleaner energy. On Thursday, Prime Minister Sir Keir Starmer told the summit that clean power was \"in the DNA of my government\". But his government was also the target of environmental protesters outside the summit at Lancaster House, who called out its wavering over the Rosebank oil and gas field. It has also been criticised for approving airport expansions and relaxing rules around electric vehicles."
    },
    {
        "title": "Man shot dead by police had called 999 himself, preliminary report indicates",
        "description": "A man who was shot dead by police had called 999 himself, an initial investigation into the death has suggested. ",
        "url": "https://news.sky.com/story/man-shot-dead-by-police-had-called-999-himself-preliminary-report-indicates-13355302",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-milton-keynes-station_6873430.jpg?20250401224813",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-25 09:49:00",
        "Headline": "The IOPC reveals evidence suggesting David Joyce made an emergency call saying a man outside Milton Keynes station \"looked like he was about to do something bad and 'definitely' had a gun\" - before he was shot dead at close range by police.",
        "Content": "A man who was shot dead by police had called 999 himself, an initial investigation into the death has suggested.  David Joyce was killed by \"a single gunshot wound to the abdomen\" after officers shot him at close range outside Milton Keynes railway station on 1 April, according to preliminary findings. The 38-year-old, who lived in the town, was given first aid by officers but died at the scene. The Independent Office for Police Conduct (IOPC) is investigating the circumstances leading up to the death and revealed its initial findings. It said it had established that Mr Joyce was armed with a 12cm steak knife when he \"ran at two officers\" before being shot by an officer from a Thames Valley Police armed response unit. The IOPC said police had been alerted to the incident following a 999 call \"from a man reporting that 'there is a man with a gun down at the train station in Milton Keynes'\". \"The call handler rang back after the caller hung up during the call and spoke to the man again who said the man with the gun was acting suspiciously, looked like he was about to do something bad and 'definitely' had a gun,\" it said in a statement. \n                  Three men jailed for plotting to murder £54m Securitas robber Paul Allen\n                 \n                  Claire Chick: Paul Butler jailed for life for murdering Plymouth university lecturer\n                 \n                  Money blog: M&S forced to stop taking online orders amid payment meltdown\n                 \"Records show that the mobile phone number used to make the 999 call had been used to call police before and was linked to Mr Joyce. \"CCTV footage shows Mr Joyce making a phone call at a time which matches with when the 999 call to police was made.\" An inquest into his death was opened and adjourned at Milton Keynes Coroners' Court earlier in April and a full hearing will follow after the IOPC investigation concludes. IOPC Director Derrick Campbell said: \"We again extend our sincere condolences to the family and friends of David Joyce and all those affected by this incident. We continue to keep his family informed of our progress. \"Our investigators are working hard to piece together the circumstances leading up to Mr Joyce being shot by a police officer and have already carried out a significant amount of enquiries.\" He said the enquiries included accounts from the police officers involved, CCTV from inside and outside the station, footage from officers' bodyworn cameras and police vehicle dashcam footage, and statements from members of the public who witnessed the shooting. The IOPC added that, as is standard in investigations following a fatal police shooting, it would \"look at the decisions and actions of officers prior to and during their interaction with Mr Joyce - including the medical care they provided at the scene; if the lethal force was necessary, justified and proportionate; and whether the officers followed policy\"."
    },
    {
        "title": "Green Party co-leader denies split over trans rights",
        "description": "The Greens have denied a split at the top of the party over trans rights, as they appeal to voters ahead of next week's local elections.",
        "url": "https://news.sky.com/story/green-party-co-leader-denies-split-over-trans-rights-13355566",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-carla-denyer-green-mp_6896775.jpg?20250425205851",
        "type": "UK",
        "Author": "Liz Bates",
        "Date Published": "2025-04-25 18:18:00",
        "Headline": "Carla Denyer has defended her fellow co-leader Adrian Ramsay after he failed to say whether he believed that \"trans women are women\". The episode raised questions for the defiantly pro-trans party.",
        "Content": "\n          Political correspondent\n              @wizbates\n  The Greens have denied a split at the top of the party over trans rights, as they appeal to voters ahead of next week's local elections. Carla Denyer defended fellow co-leader Adrian Ramsay after he failed to say whether he still believed \"trans women are women\". This cast doubt over the stance of the defiantly pro-trans party and raised questions over whether the two leaders were at odds. But as she joined activists on the campaign trail in Kent on Friday, Ms Denyer claimed she and her fellow Green MP were still unified but couldn't say whether they had spoken about the contentious issue. She told Sky News: \"Green Party policy is clear that trans women are women, trans men are men, and non-binary identities exist and are valid. \"I support that policy and I know that Adrian and I are united in standing up for trans rights and for women's rights. \"I don't see those in conflict, I understand some people will express themselves slightly differently, and I absolutely understand why a man, a cis-man, might feel slightly uncomfortable defining womanhood from the outside.\" \n                  Labour have been 'crushing disappointment', say Greens at local elections campaign launch\n                 \n                  Green Party to demand wealth tax to 'defend public services'\n                 \n                  After the 'revenge' election, what’s politics going to be like now? \n                 Local elections It may have caused some tricky conversations this week, but the issue is unlikely to have a huge impact on next Thursday's elections. And as the campaigners and candidates went from door to door in the town of Dartford, it became clear that they were feeling confident. Although the Greens only have five seats on Kent County Council, they are contesting almost all of the 81 up for grabs and believe they can make gains from the Conservatives, who currently have an overwhelming majority. It's a pattern they hope to see across the country, building on previous momentum and capitalising as people lose faith in establishment politics. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Laying out their track record, Ms Denyer said: \"In the general election we quadrupled our representation in the House of Commons and not only that, we came second in 40 constituencies as well, and in the local elections, we've increased our number of councillors nearly fivefold.\" Critics though have suggested there may be a ceiling on the green vote and cited their inability to grab attention nationally. A Reform-shaped problem This is in contrast to other leaders of smaller parties, in particular Nigel Farage, who has relentlessly drawn the spotlight and driven up Reform support since the general election. They're now streets ahead of the Greens in the polls despite having the same number of MPs. So, does Ms Denyer think she can learn anything from her anti-establishment rival? \"Nigel Farage's model of reform is very much about ego and celebrity and a one-man band,\" she said. \"That's never been the Green Party's values, we're a grassroots bottom-up organisation.\" Read more from Sky News:'Bring on the Net Zero fight', Ed Miliband saysSausage wielder, rollercoaster rider… vote winner?Ultimate guide to local elections Whether this strategy will deliver the breakthrough moment they are chasing will be decided when voters go to the polls next Thursday."
    },
    {
        "title": "'Bad times': Eubank Jr reveals conversation with father about attending Benn fight",
        "description": "Benn vs Eubank is a boxing rivalry that goes back over 35 years.",
        "url": "https://news.sky.com/story/benn-vs-eubank-jr-fight-father-conversation-ring-walk-watch-time-13355226",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-eubank-jr-conor-benn_6896190.jpg?20250425102612",
        "type": "UK",
        "Author": "Jacquie Beltrao",
        "Date Published": "2025-04-25 07:53:00",
        "Headline": "Chris Eubank Jr and Conor Benn fight at a sold out Tottenham Hotspur Stadium on Saturday night - when a simmering feud that has taken in insults, family pride and an infamous \"egg slap\" finally comes to a head once again after more than three decades.",
        "Content": "\n          Sports presenter\n        Benn vs Eubank is a boxing rivalry that goes back over 35 years. And as the sons Conor and Chris Jr prepare to reignite that rivalry on Saturday night at a sold-out Tottenham Hotspur Stadium, there was an edgy feel to their final news conference. Neither fighter could bear to lose to the other and tarnish the legacy of their famous fathers. Conor Benn, the younger fighter at 28, says he will try to enjoy the occasion. \"I'm undefeated, so every fight is... well, I especially don't want to lose to this man,\" he says. \"But my whole career there's been pressure. I treat every fight like a world title fight. You know, the crowd, 65,000 people - I've visualised this fight over a hundred times in my head. \"You know, we're modern-day gladiators. So for me, it is just going there and enjoying myself, trying to take in the moment. \n                  George Foreman: From fighting in ring to fighting fat in kitchen - how boxing legend became cultural icon\n                 \n                  Olympic boxer who won refugee team's first-ever medal turns pro after UK citizenship rejection\n                 \n                  Tyson Fury: What is the meaning behind boxing star's cryptic Dick Turpin retirement message?\n                 \"Every single fight I'm nervous. I thrive off fear, I thrive off the fear of losing.\" For 35-year-old Chris Eubank Jr, this isn't just about himself but very much about legacy. His father Chris Eubank won the first Eubank-Benn bout in 1990, while the second fight three years later was drawn. He also points out often that he believes Benn to be a cheat. The fight should have taken place two-and-a-half years ago but was called off because Conor Benn failed two drugs tests, blaming contaminated eggs, which prompted Eubank to smash an egg in his face in one of the pre-fight news conferences. Benn has always said he was innocent and has now been cleared to fight, while Eubank maintains he cheated. Read more:Eubank Jr vs Benn: Everything you need to know \"Every fight is a must-not-lose fight, but this one for sure has an unprecedented amount of pressure and, you know, responsibility,\" he says. \"I have a responsibility to my family name, to the public, to the boxing fans who were let down by the fact Conor Benn cheated two-and-a-half years ago when we were first scheduled to fight. \"I have a responsibility to kids who are watching this fight. Knowing that Conor Benn was using performance-enhancing drugs, I have a responsibility to them to [show] that isn't the way.\" The two couldn't be more different as characters, just as their fathers were in their prime. Benn is close to his father, Nigel, who will do the ring walk with him tomorrow night with him, but ordinarily he says boxing isn't something they talk much about. \"What's funny is me and my dad, our relationship isn't boxing at all, it's just my dad,\" he says. \"It's the maddest thing because me and my dad don't care about boxing. He cares about me and my wellbeing... 'How are you son? How are you getting on? How are you coping?'\" Chris Eubank Jr, though, hasn't been on speaking terms with his father for some time. He did reach out to him about the fight but Eubank Sr, who has referred to the bout as a \"circus\" because of the size difference, wants nothing to do with it. \"We had one conversation a few months back and he showed no interest in wanting to be a part of the fight,\" Eubank Jr says of his father. \"Obviously I was hoping that would change the closer we got but we haven't spoken since. So at this moment in time it does not look like he will be there. \"Unfortunately, as sad as that is to say, that is the situation I am in and having to deal with. \"Everyone goes through bad times when it comes to family. It's just unfortunate I am going through it at a time like this, during such an important event in my life, in my career, but it is what it is. \"I've still got to go out there and win.\" The fight is at middleweight (160lbs) meaning that Benn has had to jump up in weight from welterweight (147lbs), while Eubank, who does fight at this weight and above, has had to come down for the weigh in. There's also a strict rehydration clause, which means neither fighter can gain more than 10lbs between the weigh-in and the fight itself. It's a painful and important next few hours ahead for the bigger fighter. \"Cutting [weight] can be excruciating, and it's only going to get more intense over the next 12 hours when I have to start really cutting, but that's part of the game I'm not here to complain,\" says Eubank. But what about Benn - how does his father feeling about his son going into the ring with a naturally bigger fighter? \"My dad's not concerned with size,\" he says. \"As I said, us fighters are wired differently. You know, if size mattered, the elephant would be king of the jungle. I don't sit there and go 'I'm worried, I'm concerned'.\" The two don't like each other, that is clear, but neither would they go as far as to call their feelings for the other hate. \"If you hate somebody you're gonna get emotional - I do not see that as a benefit,\" says Eubank. \"Some guys might use hate and anger to be able to fight. I found that being cold, cool, calm and collected, that is what works best for me.\" But what about his opponent? \"As for hate, no, I just think he's an idiot,\" Benn says. \"I don't say 'I hate him'. As for the egg slap and all that nonsense, well done, great PR, well done you. \"But apart from that I just think he's an idiot and I'd love to punch his head in and that's what I'm going to do on Saturday night.\""
    },
    {
        "title": "World leaders arrive for Pope's funeral as 250,000 mourners pay final respects",
        "description": "World leaders including Sir Keir Starmer, Donald Trump and Emmanuel Macron have arrived in Rome ahead of the funeral of Pope Francis.",
        "url": "https://news.sky.com/story/world-leaders-arrive-for-popes-funeral-as-250000-mourners-pay-final-respects-13355701",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-vatican_6896876.jpg?20250425231404",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 23:01:00",
        "Headline": "Police sources have told Sky News around 200,000 people are expected to attend the pontiff's funeral, including some 130 delegations, with around one million estimated to be trying to see the procession in Rome.",
        "Content": " World leaders including Sir Keir Starmer, Donald Trump and Emmanuel Macron have arrived in Rome ahead of the funeral of Pope Francis. Police sources have told Sky News around 200,000 people are expected to attend the pontiff's funeral, including some 130 delegations, with around one million estimated to be trying to see the procession in Rome. At least 250,000 people have taken the opportunity to view the 88-year-old's casket as he lay in state over the last three days in St Peter's Basilica. Follow the latest updates ahead of the Pope's funeral  A livestream inside the basilica which had been broadcasting since Wednesday was stopped on Friday evening for the closing of the coffin, which was described as a \"private act\". An open-air funeral will take place in St Peter's Square today, which will be attended by world leaders including the UK prime minister and US president, as well as the Prince of Wales, who is attending on behalf of the King. It remains to be seen whether Ukrainian President Volodymyr Zelenskyy will attend the funeral. He had been expected to attend but Ukrainian embassy sources have told US reporters he may not be there. The funeral service typically lasts around two-and-a-half hours and will mostly be conducted in Latin. Francis's birth country of Argentina will be seated first, before Italy, a Vatican spokesperson has said, and then reigning sovereigns will be seated in alphabetical order but in the French language, followed by heads of state. The head of the Catholic Church in England and Wales told Sky News's Anna Botting he understood the seating plan to be \"royalty first, then heads of state, then political leaders\". He said the event would be \"exactly the same Catholic rite as everyone else - just on a grander scale\". Mr Trump and his wife, first lady Melania, will be seated ahead of the British government's delegation, which includes Sir Keir and his wife Victoria, as well as Foreign Secretary David Lammy. Prince William will sit with Norway's Crown Prince Haakon as he is not a reigning monarch. Read more:Inside the plans for Pope Francis's funeralFull order of service'Unprecedented' security operation for Pope's funeralCardinal who will be in conclave says picking pope is 'intimidating' After the funeral ceremony, the Pope's remains will then be taken through the streets of Rome as his body is brought to his favourite church, Santa Maria Maggiore Basilica, where it will be interred in a simple underground tomb. The Vatican said a group of \"poor and needy\" people will be present on the steps leading to the basilica to pay their respects. Scaffolding has been erected to give international media the best vantage points overlooking St Peter's Square for the funeral while there is a strong Italian police presence managing numbers and security. Watch full coverage of the Pope's funeral live on Sky News from 8am."
    },
    {
        "title": "Fighter jets, a naval destroyer and guns on show: 'Unprecedented' security operation for Pope's funeral",
        "description": "As the line of mourners moves slowly along behind him, Ciriaco Sarnelli peers at me from beneath the immaculate brim of his cap.",
        "url": "https://news.sky.com/story/guns-and-grins-the-unprecedented-security-operation-for-pope-franciss-funeral-13355677",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rome-police-adam-parsons_6896803.jpg?20250425213734",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-04-25 20:29:00",
        "Headline": "Pope Francis's decision to be buried outside the Vatican has heightened the security operation around his funeral, which is drawing in leaders from around the world.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  As the line of mourners moves slowly along behind him, Ciriaco Sarnelli peers at me from beneath the immaculate brim of his cap. The military police chief looks, by any standards, magnificent - shoulders back and proudly wearing the black uniform of the Carabinieri. \"Our history goes back more than 200 years,\" he says. \"We remember our past, and our place. The only people with black uniforms are the priests, the judges and the Carabinieri.\" He leaves the rest unsaid - the Carabinieri sit at the heart of Italian cultural life. Pope latest: Security ramping up ahead of funeral Once, they defended the borders of a young nation. Now, they have a new challenge that has its own weighty burden - to keep St Peter's Square safe during the funeral of Pope Francis. This is no easy task. Hundreds of thousands will descend upon the Vatican for the event. \n                  World leaders arrive for Pope's funeral as 250,000 mourners pay final respects\n                 \n                  Full order of service for Pope Francis's funeral\n                 \n                  Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'\n                 Many of the world's best-known politicians and dignitaries will be welcomed into St Peter's Basilica. Inside will be Donald Trump, Sir Keir Starmer, Joe Biden, Emmanuel Macron, Prince William and dozens upon dozens of other dignitaries. Outside will be the Carabinieri. They won't be alone - there are thousands of other police officers due to be assigned to protect the event - but the Carabinieri are affiliated to the military; the most highly-trained officers on duty. Read more:How Pope Francis's funeral will unfoldPope's doctor reveals pontiff's last regret \"This is an extraordinary operation,\" says Sarnelli, as we look out over the crowd. \"So we have employed some special units that belong to Carabinieri - the bomb squad, a dogs unit, snipers and helicopters. We want to assure the people who are arriving here that they can take part in this event in the best way, in a secure way.\" He says they are ready for \"common crimes\" - like pickpockets in the crowd - but also \"the biggest, terrifying events\". He says there is \"excellent coordination\" with police forces from other countries. Around him, his officers are smiling, chatting to tourists and Romans alike. The security here is overt but friendly, even if I'm told there are also plenty of plain-clothed officers mingling within the crowd. Guns and grins both on show. A police helicopter circles above. In the port of Rome, a naval destroyer has been primed for action; there are fighter jets ready to take off. You can watch full coverage of the funeral live on Sky News on Saturday If the impression is relaxed, the reality is different. The classic swan. All the strands are pulled together from one place and, what's more, it offers a perfect view of Vatican City. From where I'm standing, I can see the front of St Peter's Basilica, the side, and the roads around it. I can see the crowds coming in, and the crowds going out. And I can see an anxious policeman drumming his fingers. But we are not in St Peter's and not even in the Vatican. This is the high-security control room on the fifth floor of Rome's police headquarters. And from here, you can see everything. An array of screens are in front of us and, watching them, men and women, huddled over screens and all wearing contrasting uniforms. Some are military, some national police, some wear the clothes of firefighters. A few are in plain clothes and there is even a man wearing the badge of the prison officers' service. This centre is a hub for collaboration and decision-making and it brings together every service that is involved in ensuring the safety and security of the funeral. There is a Carabinieri officer here, as well as the Guardia di Finanza national police and the Roman force. The government's secret intelligence service is represented here, too. Elisabetta Accardo is from Rome's police department. We talk against the gentle hubbub in the control room, colleagues pointing at screens and agreeing plans. I ask when Italy last had to deal with a security operation on this scale, and she laughs. \"Hundreds of years,\" she says. \"It is unprecedented. The level of security is at the maximum.\" She describes the plan as \"structured three-dimensional security\". It is a plan that has been long in the making, but which has been reshaped over the past few days to react to the whims of the Pope's final wishes. It is, after all, more than a century since a pope was buried outside the walls of the Vatican. You get the impression that the people designing the security plan could rather have done without having to add an hour-long procession through Rome into the plan. But so be it. By Saturday night, it will be done. Rome can start to get back to normal; the foreign leaders will be on their way home. And the Rome police will breathe just a little bit easier."
    },
    {
        "title": "Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'",
        "description": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet. ",
        "url": "https://news.sky.com/story/donald-trump-says-russia-and-ukraine-are-very-close-to-a-deal-and-says-two-sides-should-now-meet-13355720",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-air-force-one_6896884.jpg?20250425233152",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 21:58:00",
        "Headline": "Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials from Russia and Ukraine should meet to \"finish [the deal] off\".",
        "Content": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet.  Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials should now meet to \"finish [the deal] off\". \"A good day in talks and meetings with Russia and Ukraine,\" Mr Trump wrote on his Truth Social platform. \"They are very close to a deal, and the two sides should now meet, at very high levels, to 'finish it off'. \"Most of the major points are agreed to. Stop the bloodshed, NOW. We will be wherever is necessary to help facilitate the END to this cruel and senseless war!\"  Throughout the week, the US president has criticised both Ukraine and Russia for failing to agree to a peace deal. On Wednesday, he accused Mr Zelenskyy of harming talks on Truth Social, saying \"the man with 'no cards to play' should now, finally, GET IT DONE\". \n                  FBI arrests US judge accused of helping man evade immigration authorities\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 A day later, after nine people were killed in Kyiv after a Russian missile and drone strike, Mr Trump said: \"Vladimir, STOP! 5000 soldiers a week are dying. Let's get the Peace Deal DONE!\" The president and other officials have also threatened to withdraw from negotiations if no progress is made toward a deal. It comes after Mr Trump's envoy Steve Witkoff met Vladimir Putin in Moscow to discuss a US-brokered peace plan for Ukraine.  The talks allowed Russia and the United States to \"further bring their positions closer together\" on \"a number of international issues\", a Kremlin aide said. Speaking earlier on the flight to Italy, Mr Trump said he hadn't been fully briefed on Mr Witkoff and Mr Putin's meeting - but added it was a \"pretty good meeting\". World leaders are gathering in Vatican City for the Pope's funeral. There are no formal plans for meetings, but their close proximity could give them opportunity to discuss the war in Ukraine. Speaking on Air Force One, Mr Trump suggested it would be \"disrespectful\" for them to meet for political discussions, though he later added: \"But I'll be talking to people.\" Read more:US and Russia talks moving in 'right direction', top diplomat saysA 'barbaric' 24 hours in a 'horrendous' war Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Ukraine has repeatedly said it would not accept a deal conceding land or handing over sovereignty to Russia. However, Mr Trump said in an interview with TIME magazine that \"Crimea will stay with Russia,\" describing the region as a place where Moscow has \"had their submarines\" and \"the people speak largely Russian\". \"Zelenskyy understands that, and everybody understands that it's been with them for a long time,\" he added. \"It's been with them long before Trump came along.\" When asked on Friday about Mr Trump's comments, Mr Zelenskyy did not want to comment but reiterated that recognising occupied Ukrainian territory as Russian is a red line."
    },
    {
        "title": "Kremlin blames Ukraine for car bomb killing of Russian general near Moscow - as Trump envoy meets Putin",
        "description": "The Kremlin has blamed Ukraine for a car bomb that killed a Russian general near Moscow hours before Donald Trump's envoy was due to meet Vladimir Putin in the capital.",
        "url": "https://news.sky.com/story/kremlin-blames-ukraine-for-car-bomb-killing-of-russian-general-near-moscow-as-trump-envoy-meets-putin-13355393",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yaroslav-moskalik-moscow_6896772.jpg?20250425205429",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 12:32:00",
        "Headline": "The killing of Lieutenant General Yaroslav Moskalik follows that of another senior Russian military figure in December.",
        "Content": " The Kremlin has blamed Ukraine for a car bomb that killed a Russian general near Moscow hours before Donald Trump's envoy was due to meet Vladimir Putin in the capital. The death of Lieutenant General Yaroslav Moskalik is the second such fatal attack on a top Russian military officer in four months. Russia's top criminal investigation agency said he was killed by an explosive device placed in his car in Balashikha, just outside the capital. Follow the latest updates on the Ukraine war Moskalik was a deputy head of the main operational department in the General Staff of the Russian armed forces. \"The Kyiv regime once again simply shows its true nature. The Kyiv regime continues to be involved in terrorist activity on the territory of our country,\" Kremlin spokesman Dmitry Peskov said. He didn't offer any evidence. \n                  Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'\n                 \n                  Russian foreign minister Sergei Lavrov says US and Moscow moving in 'right direction' for Ukraine peace\n                 \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \"It shows once again that, despite the peace talks, we must be on guard and understand the nature of this regime.\" Ukraine has not responded to the killing. Investigative committee spokesperson Svetlana Petrenko said the explosive device was rigged with shrapnel, adding that investigators were at the scene. Videos showed a vehicle burning in the courtyard of an apartment building and a body covered in a sheet could be seen on the pavement nearby. Moscow correspondent Explosions like this are happening with increasing frequency in Moscow. There have now been four since last summer, with high-ranking military figures the target each time. The latest victim was another senior officer called Yaroslav Moskalik. He was a lieutenant general, and deputy head of the main operational department in the General Staff of Russia's armed forces. It's unclear why he was targeted - it may simply be because of his seniority and apparent vulnerability. As with previous the bombings, there is an obvious question: is it because of the war in Ukraine? Kyiv hasn't commented on this bombing, but they did claim responsibility for the one in December that killed a top Russian general. Speaking to Sky News, Russian Foreign Ministry spokesperson Maria Zakharova called it a \"terrorist attack\", echoing language Moscow has used when describing similar attacks in the past. The timing feels significant - coinciding with Steve Witkoff's visit to the Russian capital to meet Vladimir Putin. If it was Ukraine, could it be a way of signalling their displeasure at the way peace talks are progressing? Or an attempt to demonstrate how Moscow can still be hurt? Either way, it's not a great look for the Kremlin. It comes after Lieutenant General Igor Kirillov was killed in December when a bomb hidden on an electric scooter parked outside his apartment building exploded as he left for his office. Russian authorities blamed Ukraine for the killing of Kirillov, and Ukraine's security agency acknowledged that it was behind that attack. Kirillov was the chief of Russia's radiation, biological and chemical protection forces, the special troops tasked with protecting the military from the enemy's use of nuclear, chemical or biological weapons and ensuring operations in a contaminated environment. His assistant also died in the attack. Talks bring Russia and US 'closer together' Friday's bombing came as Mr Trump's envoy Steve Witkoff met Mr Putin in Moscow to discuss a US-brokered peace plan for Ukraine. The talks allowed Russia and the United States to \"further bring their positions closer together\" on \"a number of international issues\", a Kremlin aide said. The two sides discussed \"the possibility of resuming direct negotiations between representatives of the Russian Federation and Ukraine\", Yuri Ushakov said.  The talks in Moscow lasted for three hours and were \"constructive and useful\", he added. Speaking on a flight to Italy for the Pope's funeral, the US president said he hadn't been fully briefed on Mr Witkoff and Mr Putin's meeting - but added it was a \"pretty good meeting\". The meeting was their fourth encounter since February. Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022."
    },
    {
        "title": "Full order of service for Pope Francis's funeral",
        "description": "The full order of service for the funeral of Pope Francis has been released by the Vatican.",
        "url": "https://news.sky.com/story/full-order-of-service-for-pope-franciss-funeral-13355326",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vatican-st-peters-basilica_6896432.jpg?20250425140434",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 10:35:00",
        "Headline": "More than 200,000 people are expected to attend Pope Francis's funeral in St Peter's Square. He will then be buried in Rome's Basilica of Santa Maria Maggiore - or Saint Mary Major - unlike most of his predecessors. ",
        "Content": "The full order of service for the funeral of Pope Francis has been released by the Vatican. More than 200,000 people are expected to attend Saturday's ceremony in St Peter's Square, including some 130 delegations. The service usually lasts about two-and-a-half hours and is mostly conducted in Latin. Read more: Inside the plans for Pope Francis's funeral It is being led by the dean of the College of Cardinals, Cardinal Giovanni Battista Re, who will begin with a procession led by a priest carrying a cross, followed by the coffin and ordained clergy. Francis will then be buried in Rome's Basilica of Santa Maria Maggiore - or Saint Mary Major - rather than at St Peter's Basilica in the Vatican, like almost all his predecessors. Watch full coverage of the Pope's funeral live on Sky News from 8am. Entrance antiphon The ceremony will begin with the entrance antiphon - one or more psalm verses or sentences from Holy Scripture which are typically sung or spoken. Eternal rest grant unto him, O Lord, and let perpetual light shine upon him. Praise is due to you in Sion, O God. To you we pay our vows in Jerusalem. You who hear our prayer. To you all flesh will come. Our evil deeds are too heavy for us, but only you can pardon our transgressions. Blessed the one whom you choose and call to dwell in your courts. We are filled with the good things of your house, of your holy temple. In the name of the Father, and of the Son, and of the Holy Spirit. Peace be with you. And with your spirit. The Penitential Act This follows the welcome and is a way for the faithful to confess their sinfulness. Brethren, let us acknowledge our sins, and so prepare ourselves to celebrate the sacred mysteries. I confess to almighty God and to you, my brothers and sisters, that I have greatly sinned, in my thoughts and in my words, in what I have done and in what I have failed to do, through my fault, through my fault, through my most grievous fault; therefore I ask blessed Mary ever-virgin, all the angels and saints, and you, my brothers and sisters, to pray for me to the Lord our God. May almighty God have mercy on us, forgive us our sins, and bring us to everlasting life. Collect - opening prayer Let us pray. O God, immortal shepherd of souls, look on your people's prayers and grant that our servant Pope Francis, who presided over your Church in charity, may, with the flock entrusted to his care, receive from your mercy the reward of a faithful steward. Through our Lord Jesus Christ, your Son, who lives and reigns with you in the unity of the Holy Spirit, God, for ever and ever.  First reading - from the Acts of the Apostles  He is the one appointed by God to be judge of the living and the dead. In those days: Peter opened his mouth and said: 'Truly I understand that God shows no partiality, but in every nation anyone who fears him and does what is right is acceptable to him. As for the word that he sent to Israel, preaching good news of peace through Jesus Christ - he is Lord of all - you yourselves know what happened throughout all Judea, beginning from Galilee after the baptism that John proclaimed: how God anointed Jesus of Nazareth with the Holy Spirit and with power. He went about doing good and healing all those who were oppressed by the devil, for God was with him. And we are witnesses of all that he did both in the country of the Jews and in Jerusalem. They put him to death by hanging him on a tree, but God raised him on the third day and caused him to appear, not to all the people but to us who had been chosen by God as witnesses, who ate and drank with him after he rose from the dead. And he commanded us to preach to the people and to testify that he is the one appointed by God to be judge of the living and the dead. To him all the prophets bear witness that everyone who believes in him receives forgiveness of sins through his name.' The word of the Lord. Thanks be to God. Responsorial Psalm The Lord is my shepherd; there is nothing I shall want. Fresh and green are the pastures where he gives me repose. Near restful waters he leads me; he revives my soul. He guides me along the right path, for the sake of his name. Though I should walk in the valley of the shadow of death, no evil would I fear, for you are with me. Your crook and your staff will give me comfort. You have prepared a table before me in the sight of my foes. My head you have anointed with oil; my cup is overflowing. Surely goodness and mercy shall follow me all the days of my life. In the Lord's own house shall I dwell for length of days unending.  Second Reading - from the Letter of Saint Paul to the Philippians He will transform our lowly body to be like his glorious body. Brothers and sisters, our citizenship is in heaven, and from it we await for, the Lord Jesus Christ, who will transform our lowly body to be like his glorious body, by the power that enables him even to subject all things to himself. Therefore, my brothers and sisters, whom I love and long for, my joy and crown, stand firm thus in the Lord, my beloved. The word of the Lord. Thanks be to God. Acclamation before the Gospel This is the will of my Father, says the Lord, everyone who believes in the Son should have eternal life, and I will raise him up on the last day. Gospel The Lord be with you. And with your spirit. A reading from the holy Gospel according to John. Glory to you, O Lord. When Jesus had revealed himself to his disciples and they had finished breakfast, Jesus said to Simon Peter: 'Simon, son of John, do you love me more than these?' He said to him: 'Yes, Lord; you know that I love you.' He said to him, 'Feed my lambs.' He said to him a second time: 'Simon son of John, do you love me?' He said to him, 'Yes, Lord; you know that I love you'. He said to him: 'Tend my sheep.' He said to him the third time: 'Simon, son of John, do you love me?' Peter was grieved because he said to him the third time, 'Do you love me?' and he said to him: 'Lord, you know everything; you know that I love you.' Jesus said to him: 'Feed my sheep. Truly, truly, I say to you, when you were young, you used to dress yourself and walk wherever you wanted but when you are old, you will stretch out your hands, and another will dress you and carry you where you do not want to go (this he said to show by what kind of death he was to glorify God).' And after saying this he said to him: 'Follow me.' The Gospel of the Lord. Praise to you, Lord Jesus Christ. Homily Universal Prayer or Prayer of the Faithful Brothers and sisters, let us pray to God our Father, who today brings us together to commemorate the Paschal Mystery of his only-begotten Son as we celebrate the funeral of the pastor of the universal Church. May he welcome him into his peace and bestow every blessing upon the Church and the whole world. Let us pray to the Lord. Lord, hear our prayer. For the late Pope Francis, that the chief shepherd, who eternally lives to intercede for us, may welcome him into his kingdom of light and peace. Let us pray to the Lord. Lord, hear our prayer. For the holy Church of God, that in fidelity to her mandate, she may be, in Christ, a leaven of renewal in our human family. Let us pray to the Lord. Lord, hear our prayer. For the souls of the deceased Roman pontiffs and of all those who in the Church proclaimed the Gospel and exercised the priestly ministry, that they may come to share in the heavenly liturgy. Let us pray to the Lord. Lord, hear our prayer. Read more:Who will be at the Pope's funeral - and who won't beInside Pope Francis's personal tailorsThe Irish woman who broke protocol when she welcomed the Pope For all the faithful departed, that they may be granted entrance into the kingdom of heaven. Let us pray to the Lord. Lord, hear our prayer. For us gathered here, that having celebrated the sacred mysteries, we may one day be called by Christ to enter his glorious kingdom. Let us pray to the Lord. Lord, hear our prayer. God, our salvation, hear us as we make our prayer in union with the Blessed Virgin Mary and all the Saints: welcome into the assembly of your elect the soul of your servant and our Pope Francis, who put his trust in the prayer of the Church. Through Christ our Lord.  Offertory Chant The offertory chant accompanies the procession that brings the bread and wine to the altar. Give light to my eyes lest I fall asleep in death; lest my enemy say, 'I have prevailed over him'. Pray, brethren, that my sacrifice and yours may be acceptable to God, the almighty Father. May the Lord accept the sacrifice at your hands for the praise and glory of his name, for our good and the good of all his holy Church. Prayer over the offerings Look with favour, we pray, O Lord, on the peaceful offering of your people, with which we confidently commit to your mercy the soul of your servant Pope Francis, and grant, we pray, that, having been, in the midst of the human family, an instrument of your charity and peace, he may merit to delight in the same, for ever with all your Saints. Through Christ our Lord. Eucharistic Prayer III Preface The hope of resurrection in Christ The Lord be with you. And with your spirit. Lift up your hearts. We lift them up to the Lord. Let us give thanks to the Lord our God. It is truly right and just, our duty and our salvation, always and everywhere to give you thanks, Lord, holy Father, almighty and eternal God, through Christ our lord. In him the hope of blessed resurrection has dawned, that those saddened by the certainty of dying might be consoled by the promise of immortality to come. Indeed for your faithful, Lord, life is changed not ended, and, when this earthly dwelling turns to dust, an eternal dwelling is made ready for them in heaven. And so, with angels and archangels, with thrones and dominions, and with all the hosts and powers of heaven, we sing the hymn of your glory, as without end we acclaim: You are indeed holy, O Lord, and all you have created rightly gives you praise, for through your Son our Lord Jesus Christ, by the power and working of the Holy Spirit, you give life to all things and make them holy, and you never cease to gather a people to yourself, so that from the rising of the sun to its setting a pure sacrifice may be offered to your name. Therefore, O Lord, we humbly implore you: by the same Spirit graciously make holy these gifts we have brought to you for consecration, that they may become the body and blood of your Son our Lord Jesus Christ, at whose command we celebrate these mysteries. For on the night he was betrayed he himself took bread, and giving you thanks, he said the blessing, broke the bread and gave it to his disciples, saying: 'Take this, all of you, and eat of it, for this is my body, which will be given up for you.' In a similar way, when supper was ended, he took the chalice, and giving you thanks, he said the blessing, and gave the chalice to his disciples, saying: 'Take this, all of you, and drink from it, for this is the chalice of my blood, the blood of the new and eternal covenant, which will be poured out for you and for many for the forgiveness of sins. 'Do this in memory of me.' The mystery of faith. We proclaim your death, O Lord, and profess your resurrection until you come again. Therefore, O Lord, as we celebrate the memorial of the saving passion of your Son, his wondrous resurrection and ascension into heaven, and as we look forward to his second coming, we offer you in thanksgiving this holy and living sacrifice. Look, we pray, upon the oblation of your Church and, recognising the sacrificial victim by whose death you willed to reconcile us to yourself, grant that we, who are nourished by the body and blood of your Son and filled with his Holy Spirit, may become on body, one spirit in Christ. May he make of us an eternal offering to you, so that we may obtain an inheritance with your elect, especially with the most Blessed Virgin Mary, Mother of God, with blessed Joseph, her spouse, with your blessed apostles and glorious martyrs, and with all the saints, on whose constant intercession in your presence we rely for unfailing help. May this Sacrifice of our reconciliation, we pray, O Lord, advance the peace and salvation of all the world. Be pleased to confirm in faith and charity your pilgrim Church on Earth, with the order of bishops, all the clergy, and the entire people you have gained for your own. Listen graciously to the prayers of this family, whom you have summoned before you: in your compassion, O merciful Father, gather to yourself all your children scattered throughout the world. Remember your servant Pope Francis whom you have called from this world to yourself. Grant that he who was united with your Son in a death like his, may also be one with him in his resurrection, when from the Earth he will raise up in the flesh those who have died, and transform our lowly body after the pattern of his own glorious body. To our departed brothers and sisters, too, and to all who were pleasing to you at their passing from this life, give kind admittance to your kingdom. There we hope to enjoy for ever the fullness of your glory, when you will wipe away every tear from our eyes. For seeing you, our God, as you are we shall be like you for all the ages and praise you without end, through Christ our Lord, through whom you bestow on the world all that is good. Through him, and with him, and in him, O God, almighty Father, in the unity of the Holy Spirit, all glory and honour is yours, for ever and ever. At the Saviour's command and formed by divine teaching, we dare to say: Our Father, who art in heaven, hallowed by thy name; thy kingdom come, thy will be done on earth as it is in heaven. Give us this day our daily bread, and forgive us our trespasses, as we forgive those who trespass against us; and lead us not into temptation, but deliver us from evil. Deliver us, Lord, we pray, from every evil, graciously grant our peace in our days, that, by the help of your mercy, we may be always free from sin and safe from all distress, as we await the blessed hope and the coming of our Saviour, Jesus Christ. For the kingdom, the power and the glory are yours now and for ever. Lord Jesus Christ, who said to your Apostles: Peace I leave you, my peace I give you, look not on our sins, but on the faith of your Church, and graciously grant her peace and unity in accordance with your will. Who live and reign for ever and ever. The peace of the Lord be with you always. And with your spirit. Let us offer each other the sign of peace. Behold the Lamb of God, behold him who takes away the sins of the world. Blessed are those called to the supper of the Lamb. Lord, I am not worthy that you should enter under my roof, but only say the word and my soul shall be healed. Communion Antiphon Let perpetual light shine upon him, with your Saints for ever, for you are merciful. Out of the depths I cry to you, O LORD; LORD, hear my voice! O let your ears be attentive to the sound of my pleadings. If you O LORD, should mark iniquities, LORD, who could stand? But with you is found forgiveness, that you may be revered. I long for you, O LORD, my soul longs for his word. My soul awaits the LORD more than watchmen for daybreak. More than watchmen for daybreak, let Israel hope for the LORD. For with the LORD there is mercy, in him is plentiful redemption It is he who will redeem Israel from all its iniquities. Like the deer that yearns for running streams, so my soul is yearning for you, my God. My soul is thirsting for God, the living God; when can I enter and appear before the face of God? My tears have become my bread, by night, by day, as I hear it said all the day long: 'Where is your God?' Prayer after Communion Let us pray. As we come to the table of your eternal banquet, we humbly beg your mercy, Lord, for the soul of your departed servant Pope Francis, that he may rejoice at last in possession of the truth in which he faithfully confirmed your people. Through Christ our Lord. Introduction Dear brothers and sisters, let us commend to God's tender mercy the soul of Pope Francis, bishop of the Catholic Church, who confirmed his brothers and sisters in the faith of the resurrection. Let us pray to God our Father through Jesus Christ and in the Holy Spirit; may he deliver him from death, welcome him to eternal peace and raise up him on the last day. Through the intercession of the Blessed Virgin Mary, queen of apostles and protectress of the Roman people, may God reveal to our Pope the face of his beloved Son and console the Church with the light of the resurrection. Prayer of the Church in Rome Holy Mary, Pray for him. Holy Mother of God... Mother of the Church... Protectress of the Roman people... The cardinal will then list all holy angels, patriarchs and prophets, apostles and evangelists, disciples, pontiffs and holy men and women, which he asks the congregation to pray for. O God, faithful rewarder of souls, grant that your departed servant and our bishop, Pope Francis, whom you made successor of Peter and shepherd of your Church, may happily enjoy for ever in your presence in heaven the mysteries of your grace and compassion, which he faithfully ministered on Earth. Through Christ our Lord. Prayer of the Eastern Churches God of our salvation, grant rest to the soul of your servant. Lover of mankind, lead him, with the souls of the just, to the blessings of eternal life in your presence. Guide the soul of your servant to the place of your rest, Lord, where your Saints repose, you who alone are immortal. Glory be to the Father, and to the Son, and to the Holy Spirit. You are our Saviour, our God, who descended into hell and freed those imprisoned there from its pains; now grant repose to the soul of your servant. As it was in the beginning, is now, and ever shall be. Amen. May the Blessed Virgin Mary, most pure and immaculate, who without loss to her virginity became the Mother of God, pray for the salvation of the soul of your servant. Have mercy on us, O God, in your great kindness; we beseech you, hear us and be merciful. Lord, have mercy. Again, let us pray for the repose of the soul of this departed servant of God, Francis, bishop, that he may be forgiven his every sin and failing. Lord, have mercy. May the Lord God lead his soul to the resting place of the righteous. Let us ask Christ, our immortal king and God, to bestow on him the divine mercy, the kingdom of heaven, and the forgiveness of his sins. Hear us, Lord. Let us pray to the Lord. Lord, have mercy. God of souls and of all flesh, who trampled death underfoot, vanquished the devil and gave life to the world, grant repose to the soul of your departed servant Francis, bishop, in a place of light and joy, a verdant place, a place of blessedness, where suffering, pain and sorrow are no more. Forgive every sin he committed in thought, word or deed, for you are a gracious God and a friend to mankind. No one who lives is without sin; you alone are sinless, your righteousness is eternal and your word is truth. For you, O Christ our God, are the resurrection, the life and the repose of your servant Francis, bishop, who has fallen asleep. We give you glory, with your eternal Father and your Holy Spirit, who is gracious and the giver of life, now and forever. Amen. May your remembrance be eternal, dear brother, worthy of blessedness, never to be forgotten. Amen. Responsory A responsory is an anthem said or sung by a choir. I know that my redeemer lives: on the last day I shall rise again. And in my flesh I shall see God my saviour. I shall see him myself, face to face and my own eyes shall behold him. And in my flesh I shall see God my saviour. Within my heart this hope I cherish: That in my flesh I shall see God my saviour. Gracious Father, we commend to your mercy our Pope Francis whom you made successor of Peter and shepherd of the Church, a fearless preacher of your word and a faithful minister of the divine mysteries. Welcome him, we pray, into your heavenly dwelling place, to enjoy eternal glory with all your chosen ones. We give you thanks, Lord, for all the blessings that in your goodness you bestowed upon him for the good of your people. Grant us the comfort of faith and the strength of hope. To you Father, source of life, through Christ, the conqueror of death, in the life-giving Spirit, be all honour and glory for ever and ever. Antiphons May the angels lead you into paradise; may the martyrs come and welcome you and take you to the holy city, the new and eternal Jerusalem. May choirs of angels welcome you and with Lazarus, who is poor no longer, may you have eternal rest. Canticle of the Blessed Virgin Mary Luke 1:46-55 My soul magnifies the Lord, and my spirit rejoices in God my Saviour, for he has looked on the humble estate of his servant. For behold, from now on all generations will call me blessed; for he who is mighty has done great things for me, and holy is his name. And his mercy is for those who fear him from generation to generation. He has shown strength with his arm; he has scattered the proud in the thoughts of their hearts; he has brought down the mighty from their thrones and exalted those of humble estate; he has filled the hungry with good things, and the rich he has sent away empty. He has helped his servant Israel, in remembrance of his mercy, as he spoke to our fathers, to Abraham and to his offspring for ever. Glory be to the Father and to the Son and to the Holy Spirit, as it was in the beginning, is now, and ever shall be, world without end. Amen."
    },
    {
        "title": "Kashmir 'terror attack': What happened and how have India and Pakistan reacted?",
        "description": "Tensions between India and Pakistan have ramped up following a militant gun attack in the disputed area of Kashmir.",
        "url": "https://news.sky.com/story/kashmir-terrorist-attack-what-happened-and-how-have-india-and-pakistan-reacted-13355235",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-india-pakistan-kashmir_6895349.jpg?20250424112520",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 08:18:00",
        "Headline": "A deadly attack in the Indian-controlled region of Kashmir has escalated tensions between India and Pakistan. Here is everything you need to know.",
        "Content": " Tensions between India and Pakistan have ramped up following a militant gun attack in the disputed area of Kashmir. At least 26 people, most of whom were Indian tourists, were shot dead by gunmen at a beauty spot near the resort town of Pahalgam in the Indian-controlled part of the region on 22 April. India described the massacre as a \"terror attack\" and said it had \"cross border\" links, blaming Pakistan for backing it. Pakistan denied any connection to the atrocity, which was claimed by a previously unknown militant group called the Kashmir Resistance. It was one of the worst attacks in recent times in Kashmir, which is split between the two countries, and, as Pakistan's defence minister told Sky's The World With Yalda Hakim, has the potential to lead to a full-scale conflict involving the nuclear-armed neighbours. Here is everything you need to know. What happened during the attack? At least four gunmen fired at dozens of tourists who were enjoying their holidays in Baisaran meadow, which is three miles (5km) from Pahalgam, and known as 'mini Switzerland'. At least 26 people were killed, and three dozen others were injured, according to police officers.  Sky News' India correspondent Neville Lazarus said on 23 April that security forces had been called to the area and an anti-terror operation was ongoing. It is believed police and soldiers were continuing to search for the attackers. Funerals for several of those killed have been held in some Indian cities, and people took part in candle-lit vigils at several places, including in Srinagar, the biggest city in Indian-administered Jammu and Kashmir, in the disputed region. Locals shut down markets, businesses and schools the day after the attack in protest, amid worries that it would hurt the region's tourism economy. What is the Kashmir Resistance? The Kashmir Resistance, also known as The Resistance Front, has claimed responsibility for the attack. The group, which emerged in 2019 is considered a splinter group of the Pakistan-based Lashkar-e-Taiba (LeT), according to the South Asia Terrorism Portal, a Delhi-based think-tank. LeT is listed as a terrorist organisation by the US. The same group was accused of killing 166 people during a four-day attack on Mumbai in 2008. At the time, the group was alleged to have close ties to Pakistan's spy agency, the Inter-Service Intelligence - an accusation Islamabad denied. Ajai Sahni, head of the South Asia Terrorism Portal, told Reuters that groups like these have been created by Pakistan particularly as a way to create a \"pattern of denial that they were involved in terrorism in Jammu and Kashmir\". Pakistan has always denied that it supports and funds militants in Kashmir, saying it offers only moral and diplomatic support. How have India and Pakistan reacted? India's Prime Minister Narendra Modi, who cut short his visit to Saudi Arabia and returned to India, \"strongly\" condemned the attack. Addressing a rally in the east Indian state of Bihar on 24 April, he said his government will \"identify, track and punish every terrorist and their backers\". \"We will pursue them to the ends of the earth,\" he said, adding: \"Terrorism will not go unpunished. Every effort will be made to ensure that justice is done.\"  India also announced a number of punitive measures against Pakistan, including revoking visas issued to Pakistan nationals, expelling military advisers, closing a border crossing and suspending a crucial water-sharing treaty known as the Indus Water Treaty. During a phone call with Mr Modi, the UK's prime minister Sir Keir Starmer \"expressed his deep condolences\" to all those affected and agreed to stay in touch with the Indian leader. India has accused Pakistan of harbouring and arming militant organisations whose members infiltrate the almost 500-mile border in Kashmir and attack the state.  Speaking to Sky News' Yalda Hakim, Pakistan's defence minister Khawaja Asif denied his country was behind the Pahalgam attack. In a meeting of the country's national security committee, Pakistan's Prime Minister Shehbaz Sharif passed reciprocal measures on India including cancelling visas, closing its airspace for all Indian-owned or Indian-operated airlines and suspending all trade with India, including to and from any third country. He also warned that the suspension of the Indus Water Treaty would be considered an act of war. The treaty, which was brokered by the World Bank in 1960, is essential for supporting agriculture and hydropower for Pakistan's 240 million people. Suspending it could lead to water shortages at a time when parts of the country are already struggling with drought and declining rainfall. 'Brief exchange of fire' Days after the attack, three Indian army officials said that its army had a brief exchange of fire with Pakistani soldiers along the highly militarised border of Kashmir. The officials claimed Pakistan soldiers used small arms to fire at Indian positions in Kashmir late on 24 April, to which Indian soldiers retaliated. No casualties were reported. Pakistan's foreign ministry declined to confirm or deny the report. Ministry spokesman Shafqat Ali Khan told a news conference: \"I will wait for a formal confirmation from the military before I make any comment.\" The exchange of fire followed Pakistan's defence minister Mr Asif warning that the attack could lead to an \"all-out war\" between his country and India and that the world should be \"worried\". Mr Asif suggested India had \"staged\" the shooting in a \"false flag\" operation. He warned his military was \"prepared for any eventuality\" amid escalating tensions and diplomatic measures from both sides. \"We will measure our response to whatever is initiated by India. It would be a measured response,\" he said. \"If there is an all-out attack or something like that, then obviously there will be an all-out war... If things get wrong, there could be a tragic outcome of this confrontation.\" The United Nations has urged both sides \"to exercise maximum restraint and to ensure that the situation and the developments we've seen do not deteriorate any further\". What caused the two country's tensions? India and Pakistan have fought several wars and conflicts since their independence from Britain in 1947, primarily due to territorial disputes over Kashmir. Both countries claim the Himalayan region as their own, but in reality control different sections of the territory. Armed insurgents in Kashmir have resisted New Delhi for decades, with many Muslim people in the region supporting the rebels' goal of uniting the territory either under Pakistan's rule or as an independent country. The dispute over the land has claimed the lives of tens of thousands of people over the past three decades, although outbreaks of sporadic violence did seem to have eased in recent years. In 2019, a suicide bomber in a vehicle killed 40 paramilitary soldiers in a military convoy, which brought the two countries close to war. Read more from Sky News:A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine warThere are signs the world is losing faith in the dollar Before that, there was the Mumbai terror attack in 2008 and in 1999, the 10-week-long Kargil War. The conflict began after Pakistan's military covertly occupied Indian posts across the line of control (LoC) in the Kargil region. At least 1,000 combatants were killed on both sides. The fighting stopped after Pakistan asked then US president Bill Clinton to help de-escalate the conflict."
    },
    {
        "title": "World Food Programme stocks in Gaza have run out under Israel's blockade, UN agency says",
        "description": "The UN food agency has warned its food stocks in Gaza have run out under Israel's blockade.",
        "url": "https://news.sky.com/story/world-food-programme-stocks-in-gaza-have-run-out-under-israels-blockade-un-agency-says-13355542",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-palestine-gaza-charity_6896662.jpg?20250425184300",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-25 17:22:00",
        "Headline": "The World Food Programme was one of the major suppliers of food to Gaza's displaced population. On Friday, it delivered the last of its stocks to kitchens in the enclave.",
        "Content": "The UN food agency has warned its food stocks in Gaza have run out under Israel's blockade. The World Food Programme (WFP) has been a main source of sustenance for hundreds of thousands of Palestinians in the territory. In a statement, it said it had delivered its last remaining food stocks on Friday, with kitchens it supports expected to fully run out of food in the coming days. The WFP said it has 116,000 tonnes of food, enough to feed one million people for up to four months, ready to be brought into Gaza as soon as Israel lifts its nearly eight-week blockade. Some 80% of Gaza's population of more than two million people rely primarily on charity kitchens for food after other sources shut down due to the sustained closure of crossings into the enclave, according to the UN. Such kitchens, the WFP said, have been the \"only consistent source of food\" for the people of Gaza for weeks. The WFP distributes 644,000 meals a day, according to its spokesperson, and in its absence, it isn't clear how many kitchens will be operating in Gaza. \n                  IDF admits responsibility for deadly attack on UN building last month\n                 \n                  At least 44 killed in Israeli strikes in Gaza, Hamas-backed health ministry says\n                 \n                  Israeli troops shot at Gaza aid workers from 'point-blank range', leaked documents reportedly show\n                 Speaking on his way to Rome for the Pope's funeral, US President Donald Trump claimed he had pushed Israeli Prime Minister Benjamin Netanyahu to get more food and medicine into Gaza. The deepening crisis takes place against the backdrop of continued Israeli airstrikes in Gaza. At least 78 people have been killed in Israeli strikes in the past 24 hours, according to Gaza's Hamas-run health ministry. It comes after a Sky News investigation into Israeli killings of aid workers found inconsistencies in the Israel Defence Forces' version of events.  Israel's blockade Israel is yet to comment on the latest warnings by the WFP. It cut off the entry of all food, fuel, medicine and other supplies on 2 March and resumed bombing Gaza two weeks later, ending a two-month ceasefire. Israel made the decision to stop aid going into Gaza after Hamas rejected an Israeli request to extend the first phase of the Gaza ceasefire. While Hamas wanted to move on to the second phase of the ceasefire, working towards a permanent peace, Israel wanted to immediately release more hostages, extending the then-current phase. Responding to previous criticisms of its blockade, Israel has claimed Hamas hijacks the aid trucks and \"turns aid into weapons\". Humanitarian workers deny there is a diversion of supplies, saying the UN strictly monitors distribution. The UK government previously said that Israel was breaking international law by stopping aid from getting into Gaza. With no new food entering Gaza, many items have disappeared from the markets, including meat, eggs, fruits, dairy products and many vegetables. Prices for what remains have risen dramatically, now unaffordable for much of the population. Malnutrition is already surging and many leading charities have repeatedly warned of a humanitarian crisis in the enclave. Read more from Sky News:Inside Pope Francis's final farewellLuigi Mangione pleads not guiltyWarhol art 'most likely' thrown away by Dutch town hall The latest round of fighting began on 7 October 2023 when Hamas and other militant groups surged across the southern Israeli border, killing some 1,200 people and abducting 251 hostages. Most have since been released, but the release of those remaining has proven a sticking point in any ceasefire efforts. More than 51,000 people have been killed in Israel's offensive, mostly women and children, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants in its count."
    },
    {
        "title": "Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'",
        "description": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet. ",
        "url": "https://news.sky.com/story/donald-trump-says-russia-and-ukraine-are-very-close-to-a-deal-and-says-two-sides-should-now-meet-13355720",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-air-force-one_6896884.jpg?20250425233152",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-25 21:58:00",
        "Headline": "Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials from Russia and Ukraine should meet to \"finish [the deal] off\".",
        "Content": "Donald Trump has said Russia and Ukraine are \"very close to a deal\" with \"most of the major points agreed\" - as he called for the two sides to meet.  Shortly after arriving in Rome for Pope Francis's funeral, the US president said high-level officials should now meet to \"finish [the deal] off\". \"A good day in talks and meetings with Russia and Ukraine,\" Mr Trump wrote on his Truth Social platform. \"They are very close to a deal, and the two sides should now meet, at very high levels, to 'finish it off'. \"Most of the major points are agreed to. Stop the bloodshed, NOW. We will be wherever is necessary to help facilitate the END to this cruel and senseless war!\"  Throughout the week, the US president has criticised both Ukraine and Russia for failing to agree to a peace deal. On Wednesday, he accused Mr Zelenskyy of harming talks on Truth Social, saying \"the man with 'no cards to play' should now, finally, GET IT DONE\". \n                  FBI arrests US judge accused of helping man evade immigration authorities\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 A day later, after nine people were killed in Kyiv after a Russian missile and drone strike, Mr Trump said: \"Vladimir, STOP! 5000 soldiers a week are dying. Let's get the Peace Deal DONE!\" The president and other officials have also threatened to withdraw from negotiations if no progress is made toward a deal. It comes after Mr Trump's envoy Steve Witkoff met Vladimir Putin in Moscow to discuss a US-brokered peace plan for Ukraine.  The talks allowed Russia and the United States to \"further bring their positions closer together\" on \"a number of international issues\", a Kremlin aide said. Speaking earlier on the flight to Italy, Mr Trump said he hadn't been fully briefed on Mr Witkoff and Mr Putin's meeting - but added it was a \"pretty good meeting\". World leaders are gathering in Vatican City for the Pope's funeral. There are no formal plans for meetings, but their close proximity could give them opportunity to discuss the war in Ukraine. Speaking on Air Force One, Mr Trump suggested it would be \"disrespectful\" for them to meet for political discussions, though he later added: \"But I'll be talking to people.\" Read more:US and Russia talks moving in 'right direction', top diplomat saysA 'barbaric' 24 hours in a 'horrendous' war Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Ukraine has repeatedly said it would not accept a deal conceding land or handing over sovereignty to Russia. However, Mr Trump said in an interview with TIME magazine that \"Crimea will stay with Russia,\" describing the region as a place where Moscow has \"had their submarines\" and \"the people speak largely Russian\". \"Zelenskyy understands that, and everybody understands that it's been with them for a long time,\" he added. \"It's been with them long before Trump came along.\" When asked on Friday about Mr Trump's comments, Mr Zelenskyy did not want to comment but reiterated that recognising occupied Ukrainian territory as Russian is a red line."
    },
    {
        "title": "Luigi Mangione pleads not guilty to murder of healthcare boss - as death penalty bid confirmed",
        "description": "Luigi Mangione has pleaded not guilty to murdering a US healthcare chief executive - as prosecutors formally confirmed they plan to seek the death penalty for him.",
        "url": "https://news.sky.com/story/luigi-mangione-due-in-court-over-murder-of-healthcare-boss-as-death-penalty-bid-confirmed-13355360",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-luigi-mangione-court_6896573.jpg?20250425163623",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-25 11:33:00",
        "Headline": "While the killing has been condemned by public officials, some Americans have lauded Luigi Mangione - saying he drew attention to steep US healthcare costs and the power of health insurers to refuse payment for some treatments.",
        "Content": "Luigi Mangione has pleaded not guilty to murdering a US healthcare chief executive - as prosecutors formally confirmed they plan to seek the death penalty for him. The 26-year-old defendant appeared in a Manhattan federal court for an arraignment over the killing of Brian Thompson in New York last year. Mangione has previously pleaded not guilty to a separate New York state indictment he faces over the murder of Mr Thompson, the boss of UnitedHealth's insurance division. While public officials condemned the killing, some Americans - and people elsewhere across the world - have lauded Mangione, saying he drew attention to steep US healthcare costs and the power of health insurers to refuse payment for some treatments. In justifying their decision to seek the death penalty, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence\". US attorney general Pam Bondi earlier this month announced that the Justice Department would seek the death penalty for Mangione. Mangione's lawyers did not immediately respond to a request for comment on Thursday. \n                  Luigi Mangione indicted on federal charges over UnitedHealthcare CEO Brian Thompson's death\n                 \n                  Luigi Mangione: US prosecutors directed to seek death penalty for man accused of killing healthcare boss\n                 \n                  Dozens turn out in support of Luigi Mangione over killing of US healthcare boss Brian Thompson\n                 They have said Ms Bondi's announcement on 1 April was \"unapologetically political\" and breached government protocols for death penalty decisions. Read more:Dozens turn out in support of Luigi Mangione at court appearanceUS prosecutors directed to seek death penalty for Mangione If Mangione is convicted in the federal case, the jury would determine in a separate phase of the trial whether to recommend the death penalty. Any such recommendation must be unanimous, and the judge would be required to impose it. Mr Thompson was shot dead on 4 December outside a hotel in Midtown Manhattan, where an investor conference for the company was planned. The killing sparked a five-day manhunt that captivated Americans. Police officers in Altoona, Pennsylvania, found Mangione with a 9mm pistol and silencer, clothing that matched the apparel worn by Thompson's gunman in surveillance footage, and a notebook describing an intent to \"wack\" an insurance company CEO, according to a court filing."
    },
    {
        "title": "FBI arrests US judge accused of helping man evade immigration authorities",
        "description": "The FBI has arrested a US judge who is accused of helping a man evade immigration authorities.",
        "url": "https://news.sky.com/story/fbi-arrests-us-judge-accused-of-helping-man-evade-immigration-authorities-13355660",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-judge-hannah-dugan_6896780.jpg?20250425210505",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-25 20:01:00",
        "Headline": "Judge Hannah Dugan has been accused of escorting a man and his lawyer out of her courtroom through the jury door, escalating tensions between the Trump administration and the US judiciary over the president's sweeping immigration crackdown.",
        "Content": "The FBI has arrested a US judge who is accused of helping a man evade immigration authorities. Judge Hannah Dugan allegedly escorted a man and his lawyer out of her Milwaukee courtroom through the jury door on 18 April after learning that officials were seeking his arrest. The man, named as Eduardo Flores-Ruiz, was taken into custody outside the courthouse after officers chased him on foot. The judge's arrest escalates tensions between the Trump administration and the US judiciary over the president's sweeping immigration crackdown. Speaking onboard Air Force One, Donald Trump was asked about the case, and claimed \"the courts are holding us back\". He also complained about the length of the judicial process for removing people from the country. Wisconsin governor Tony Evers accused Mr Trump's government of using \"dangerous rhetoric to attack and attempt to undermine our judiciary at every level\". \n                  Donald Trump says Russia and Ukraine are 'very close to a deal' - and says 'two sides should now meet'\n                 \n                  Canada election 2025: Who could win and how big an influence is Donald Trump?\n                 \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 Ms Dugan was taken into custody by the FBI on Friday morning on courthouse grounds, according to a US Marshals spokesperson. She appeared briefly in federal court before being released. Her next court appearance is 15 May. She faces charges of \"concealing an individual to prevent his discovery and arrest\" and obstructing or impeding a proceeding. A statement issued on behalf of Ms Dugan, issued later on Friday, said: \"Judge Hannah C Dugan has committed herself to the rule of law and the principles of due process for her entire career as a lawyer and a judge. \"She has retained former United States attorney Steven Biskupic to represent her. Judge Dugan will defend herself vigorously, and looks forward to being exonerated.\" 'Out through jury door' Court papers suggest that Ms Dugan was alerted to the presence of US immigration authorities in the courthouse by her clerk - who in turn was told by a lawyer that officers appeared to be in the hallway. An FBI affidavit described Ms Dugan as \"visibly angry\" over the arrival of immigration officers in the building. It said she described the situation as \"absurd\" before leaving the bench for her chambers. It added that along with another judge, she later approached the officers inside the court, displaying what witnesses said was a \"confrontational, angry demeanour\". After a discussion with officers over the warrant for the man, according to the affidavit, she demanded the officers speak to the chief judge and led them from the courtroom. Afterwards, Ms Dugan was said to have returned to the courtroom and was heard saying words to the effect of \"wait, come with me\", before allegedly ushering Flores-Ruiz and his lawyer out through a jury door and into a non-public area of the courthouse. Attorney general Pam Bondi said Flores-Ruiz was facing domestic violence charges and his alleged victims were in the courtroom at the time. The officers were said to have caught the defendant after chasing him outside the court. Read more from Sky News:How Pope Francis's funeral will unfoldLuigi Mangione pleads not guiltyWarhol artwork 'likely' binned by Dutch town hall US senator Tammy Baldwin called the arrest a \"gravely serious and drastic move\" that \"threatens to breach\" the separation of power between the executive and judicial branches. The case is similar to one brought during the first Trump administration against a Massachusetts judge accused of helping a man sneak out the back door of a court to evade immigration officers."
    },
    {
        "title": "Kim Kardashian's Paris robbery trial: Everything you need to know",
        "description": "In October 2016, Kim Kardashian was robbed at gunpoint - with jewellery worth millions of dollars stolen during the audacious heist in Paris. ",
        "url": "https://news.sky.com/story/eight-years-ago-kim-kardashian-was-robbed-at-gunpoint-with-jewellery-worth-millions-stolen-now-the-case-is-coming-to-court-13351530",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-kardashian-paris_6896534.png?20250425153146",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-04-25 10:22:00",
        "Headline": "\"Grandpa robbers\", jewellery worth millions of pounds and one of the most famous women in the world, Kim Kardashian's Paris robbery was headline news almost a decade ago, and now it's finally coming to trial.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n In October 2016, Kim Kardashian was robbed at gunpoint - with jewellery worth millions of dollars stolen during the audacious heist in Paris.  It was the biggest robbery of an individual in France for more than 20 years - and made front pages around the world. Now, almost a decade on, the case is finally coming to court. Why has it taken so long? Will Kardashian give evidence? And who exactly are the \"grandpa robbers\" facing trial? Here's everything you need to know. What happened? Two years after Kardashian and rapper Kanye West tied the knot in an ostentatious week-long celebration spanning Paris and Florence, the Kardashian-West clan were back in the French capital for Paris Fashion Week. \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 \n                  Kim Kardashian visits Lyle and Erik Menendez in jail amid controversy over Netflix show\n                 \n                  'Where is Kate?': US reaction to royal story is 'extraordinary'\n                 Her then husband had returned to the US to pick up his Saint Pablo tour - but Kardashian, along with her sister Kourtney and various members of their entourage, remained in Paris, staying in an exclusive set of apartments so discreet they've been dubbed the No Address Hotel. Nestled on Tronchet Street, just a stone's throw from Place de l'Opéra, and close to the fashionable Avenue Montaigne, the Hotel de Pourtalès is popular with A-list stars staying in the French capital. A stay in the Sky Penthouse, the suite occupied by Kardashian, will currently set you back about £13,000 a night. On the evening of 3 October, after attending a fashion show with her sister, Kardashian remained in the apartment alone while the rest of her convoy - including her bodyguard Pascal Duvier - went out for the night. At about 2.30am, three armed men wearing ski masks and dressed as police forced their way into the apartment block - and according to investigators, they threatened the concierge at gunpoint. Two of them are alleged to have forced the concierge to lead them to Kardashian's suite. He later told police they yelled at him: \"Where's the rapper's wife?\" Kardashian said she had been \"dozing\" on her bed when the men then entered her room. She has said she believes her social media posts provided the alleged robbers with \"a window of opportunity\". \"I was Snapchatting that I was home, and that everyone was going out,\" she said in the months after the incident. The Keeping Up With The Kardashians star vividly described the attack in a police report, as reported in the French weekly paper Le Journal Du Dimanche. \"They grabbed me and took me into the hallway. They tied me up with plastic cables and taped my hands, then they put tape over my mouth and my legs.\" She said they pointed a gun at her, asking specifically for her ring and also for money. Kardashian says they carried her into the bathroom and put her in the bathtub. She said she was wearing only a bathrobe at the time. She had initially thought the robbers \"were terrorists who had come to kidnap me\", according to a French police report taken in New York three months after the robbery. Kardashian told officers: \"I thought I was going to die.\" According to police, the robbers - who left the room after grabbing their haul, escaped on bicycles with items estimated to be worth about $10m (£7.5m), including a $4m (£3m) 18.88-carat diamond engagement ring from West. After they had left, Kardashian said she escaped her restraints and went to find help. After speaking to detectives, she immediately returned to the US on a private jet and later hired a completely new security team. What was stolen? As well as her engagement ring, Kardashian said the thieves took her large Louis Vuitton jewellery box, which she said contained \"everything I owned\". In police reports given to the French authorities at about 4.30am on the night of the alleged robbery, Kardashian listed these items as having been stolen: • Two diamond Cartier bracelets• A gold and diamond Jacob necklace• Diamond earrings by Lauren Schwartz• Yanina earrings• Three gold Jacob necklaces• Little bracelets, jewels and rings• A Lauren Schwartz diamond necklace• A necklace with six little diamonds• A necklace with Saint spelt out in diamonds• A cross-shaped diamond-encrusted Jacob cross• A yellow gold Rolex watch• Two yellow gold rings• An iPhone 6 and a BlackBerry Police recovered only the diamond-encrusted cross that was dropped by the robbers while leaving. It's likely the gold in the haul was melted down and resold, while the diamond engagement ring that is now so associated with the robbery would be far too recognisable to sell on the open market. What will happen in court? The hearing will begin at the Court of Appeal of Paris - the largest appeals court in France - on 28 April and is scheduled to last a month. It will consist of a presiding judge, two professional assessors, and six main jurors. The hearing involves more than 2,000 documents and there are four civil parties. Who is being tried? There were initially 12 defendants in the case, but one person has died and another has a medical condition that prevents their involvement. This means 10 people - nine men and one woman - are standing trial. Five of them, who were all aged between 60 and 72 at the time of the incident, face armed robbery and kidnapping charges. They are: • Yunice Abbas• Aomar Ait Khedache• Harminv Ait Khedache• Didier Dubreucq• Marc-Alexandre Boyer Abbas, 72, has admitted his participation in the robbery. In 2021, he published a book about the robbery, titled I Kidnapped Kim Kardashian. In 2021, a court ruled he would not benefit financially from the book. Aomar Ait Khedache, 69, known to French crime reporters as \"Old Omar\", has also admitted participating in the heist but denies the prosecution's accusation that he was the ringleader. The remaining five defendants are charged with complicity in the heist or the unauthorised possession of a weapon. They are: • Florus Heroui• Gary Mader• Christiane Glotin• François Delaporte• Marc Boyer Among those, Mader was a VIP greeter who worked for the car company Kardashian used in Paris, and Heroui was a bar manager who allegedly passed on information about Kardashian's movements. With many of the accused now ageing and with various serious health conditions, and some having spent time in jail following their arrest, all are currently free under judicial supervision. If found guilty, those accused of the more serious crimes could face 10 years to life imprisonment. Will Kardashian give evidence? Yes. Lawyer Michael Rhodes said Kardashian has \"tremendous appreciation and admiration for the French judicial system\" and \"wishes for the trial to proceed in an orderly fashion in accordance with French law and with respect for all parties to the case\". A trainee lawyer herself, Kardashian has become a high-profile criminal justice advocate in the US in recent years. Why has it taken so long to come to court? There was initially a manhunt after the robbery, with French police under pressure to prove that Paris's security was not in question. Just the year before in 2015, the capital had been shaken by terrorist attacks by Islamic militants, in which 130 people were killed, including 90 at a music event at the Bataclan theatre. French police initially arrested 17 people in the Kardashian case in January 2017 - three months after the robbery - assisted by DNA traces found on plastic bands used to tie her wrists. Twelve people were later charged. It was ordered to be sent to trial in 2021 - at a time when limited court proceedings were happening due to multiple COVID lockdowns, and France was holding its largest ever criminal trial over the November 2015 terror attacks. What has Kardashian said about the incident? Kardashian has described the robbery as a \"life-changing\" moment. She took three weeks away from filming her reality TV show Keeping Up With the Kardashians, and took a three-month break from social media. In a March 2017 episode titled Paris, Kardashian first spoke publicly about her ordeal. She described first hearing a noise in her apartment, and calling out, thinking it was her sister and assistant: \"At that moment when there wasn't an answer, my heart started to get really tense. Like, you know, your stomach just kind of like, knots up and you're like, 'OK, what's going on?' I knew something wasn't quite right.\" She went on: \"They asked for money. I said, 'I don't have any money'. They dragged me out to the hallway on top of the stairs. That's when I saw the gun, clear as day. I was looking at the gun, looking down back at the stairs. I was like, I have a split second in my mind to make this quick decision. \"Either they're going to shoot me in the back or if I make it [down the stairs] and the elevator does not open in time or the stairs are locked, there's no way out.\" Three months later, she told a Forbes Power Women's Summit she had changed her approach to posting on social media: \"They had followed my moves on social media, and they knew my every move and what I had.\" She added: \"It was definitely a huge, huge, huge lesson for me to not show off some of the things that I have. It was a huge lesson to me to not show off where I go. \"It's just changed my whole life, but I think for the better.\" In October 2020, Kardashian told US interviewer David Letterman she feared she would be raped and murdered during the heist, and that her sister had been at the forefront of her mind during the incident. Speaking on My Next Guest Needs No Introduction, Kardashian said: \"I kept on thinking about Kourtney, I kept on thinking she's going to come home and I'm going to be dead in the room and she's going to be traumatised for the rest of her life if she sees me... I thought that was my fate.\" When speaking to French police about the impact the robbery had had on her three months after it, Kardashian said: \"I think that my perception of jewellery now is that I am not as attached to it as I used to be. I don't have the same feeling about it. In fact, I even think that it has become a bit of a burden to have the responsibility of such expensive jewels. \"There is nothing of sentimental value to compare with the act of going home and finding one's children and one's family.\" She went on to describe Paris as \"not the right place\" for her, and didn't return to the French capital for two years following the robbery. Kardashian has since said in a 2023 episode of Keeping Up With The Kardashians that she did not purchase any jewellery in the seven years following the robbery, kept no jewellery at her home and only wore items that are either borrowed or fake. She said the realisation that material items don't matter has made her \"a completely different person in the best way\"."
    },
    {
        "title": "Trump trade war: How UK figures show his tariff argument doesn't add up",
        "description": "As Chancellor Rachel Reeves meets her counterpart, US treasury secretary Scott Bessent to discuss an \"economic agreement\" between the two countries, the latest trade figures confirm three realities that ought to shape negotiations.",
        "url": "https://news.sky.com/story/trump-trade-war-how-uk-figures-show-his-tariff-argument-doesnt-add-up-13355276",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cargo-oakland-california_6876193.jpg?20250404191431",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2025-04-25 09:16:00",
        "Headline": "The latest official data from the Office for National Statistics continues to show that trade tariffs against goods from the UK should not be necessary, Sky's Paul Kelso writes.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n As Chancellor Rachel Reeves meets her counterpart, US treasury secretary Scott Bessent to discuss an \"economic agreement\" between the two countries, the latest trade figures confirm three realities that ought to shape negotiations. The first is that the US remains a vital customer for UK businesses, the largest single-nation export market for British goods and the third-largest import partner, critical to the UK automotive industry, already landed with a 25% tariff, and pharmaceuticals, which might yet be. In 2024, the US was the UK's largest export market for cars, worth £9bn to companies including Jaguar Land Rover, Bentley and Aston Martin, and accounting for more than 27% of UK automotive exports. Little wonder the domestic industry fears a heavy and immediate impact on sales and jobs should tariffs remain.  Money latest: '14 million Britons on course for parking fine this year' American car exports to the UK by contrast are worth just £1bn, which may explain why the chancellor may be willing to lower the current tariff of 10% to 2.5%. For UK medicines and pharmaceutical producers meanwhile, the US was a more than £6bn market in 2024. Currently exempt from tariffs, while Mr Trump and his advisers think about how to treat an industry he has long-criticised for high prices, it remains vulnerable. \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 \n                  Day 96: 'Vladimir STOP!' Will Trump's plea to Putin make a difference?\n                 \n                  Rate cut speculation lights up as economic outlook darkens\n                 The second point is that the US is even more important for the services industry. British exports of consultancy, PR, financial and other professional services to America were worth £131bn last year. That's more than double the total value of the goods traded in the same direction, but mercifully services are much harder to hammer with the blunt tool of tariffs, though not immune from regulation and other \"non-tariff barriers\".  The third point is that, had Donald Trump stuck to his initial rationale for tariffs, UK exporters should not be facing a penny of extra cost for doing business with the US. The president says he slapped blanket tariffs on every nation bar Russia to \"rebalance\" the US economy and reverse goods trade 'deficits' - in which the US imports more than it exports to a given country. That heavily contested argument might apply to Mexico, Canada, China and many other manufacturing nations, but it does not meaningfully apply to Britain. Read more: Could Trump tariffs tip the world into recession? Figures from the Office for National Statistics show the US ran a small goods trade deficit with the UK in 2024 of £2.2bn, importing £59.3bn of goods against exports of £57.1bn.  Add in services trade, in which the UK exports more than double what it imports from the US, and the UK's surplus - and thus the US 'deficit' - swells to nearly £78bn. That might be a problem were it not for the US' own accounts of the goods and services trade with Britain, which it says actually show a $15bn (£11.8bn) surplus with the UK. You might think that they cannot both be right, but the ONS disagrees. The disparity is caused by the way the US Bureau of Economic Analysis accounts for services, as well as a range of statistical assumptions. Read more from Sky News:Water regulation slammed by spending watchdogRate cut speculation lights up as economic outlook darkens \"The presence of trade asymmetries does not indicate that either country is inaccurate in their estimation,\" the ONS said. That might be encouraging had Mr Trump not ignored his own arguments and landed the UK, like everyone else in the world, with a blanket 10% tariff on all goods. Trade agreements are notoriously complex, protracted affairs, which helps explain why after nine years of trying, the UK still has not got one with the US, and the Brexit deal it did with the EU against a self-imposed deadline has been proved highly disadvantageous."
    },
    {
        "title": "Post Office to unveil £1.75bn banking deal with big British lenders",
        "description": "The Post Office will next week unveil a &#163;1.75bn deal with dozens of banks which will allow their customers to continue using Britain&#8217;s biggest retail network.",
        "url": "https://news.sky.com/story/post-office-to-unveil-163175bn-banking-deal-with-big-british-lenders-13355300",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-paddington-post-office_6747204.jpg?20241113103312",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-25 09:45:00",
        "Headline": "A five-year agreement with dozens of banks will deliver a welcome boost to the state-owned company's finances.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Post Office will next week unveil a £1.75bn deal with dozens of banks which will allow their customers to continue using Britain’s biggest retail network. Sky News has learnt the next Post Office banking framework will be launched next Wednesday, with an agreement that will deliver an additional £500m to the government-owned company. Banking industry sources said on Friday the deal would be worth roughly £350m annually to the Post Office - an uplift from the existing £250m-a-year deal, which expires at the end of the year. Money latest: '14 million Britons on course for parking fine this year' The sources added that in return for the additional payments, the Post Office would make a range of commitments to improving the service it provides to banks' customers who use its branches. Banks which participate in the arrangements include Barclays, HSBC, Lloyds Banking Group, NatWest Group and Santander UK. Under the Banking Framework Agreement, the 30 banks and mutuals' customers can access the Post Office's 11,500 branches for a range of services, including depositing and withdrawing cash. \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 \n                  Sir Alan Bates urges victims of Post Office scandal to take govt to court over compensation delays\n                 \n                  Former sub-postmaster Lee Castleton becomes first individual to sue Post Office and Fujitsu after uncovering 'fraud'\n                 The service is particularly valuable to those who still rely on physical cash after a decade in which well over 6,000 bank branches have been closed across Britain. In 2023, more than £10bn worth of cash was withdrawn over the counter and £29bn in cash was deposited over the counter, the Post Office said last year. Read more from Sky News:Water regulation slammed by spending watchdogRate cut speculation lights up as economic outlook darkens A new, longer-term deal with the banks comes at a critical time for the Post Office, which is trying to secure government funding to bolster the pay of thousands of sub-postmasters. Reliant on an annual government subsidy, the reputation of the network's previous management team was left in tatters by the Horizon IT scandal and the wrongful conviction of hundreds of sub-postmasters. A Post Office spokesperson declined to comment ahead of next week's announcement."
    },
    {
        "title": "Struggling discounter Poundland gets bids from Hilco and Endless",
        "description": "A pack of suitors will table takeover offers on Friday for Poundland, the struggling discount retail giant, as its owner pursues a speedy exit from the British high street.",
        "url": "https://news.sky.com/story/struggling-discounter-poundland-gets-bids-from-hilco-and-endless-13355318",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-poundland-pound_6802760.jpg?20250118095137",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-25 10:23:00",
        "Headline": "The two specialist turnaround investors are among those tabling offers for one of Britain's biggest high street employers ahead of a bid deadline on Friday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A pack of suitors will table takeover offers on Friday for Poundland, the struggling discount retail giant, as its owner pursues a speedy exit from the British high street. Sky News has learnt that Endless, the turnaround investor, and Hilco Capital, the new owner of Lakeland, are among the bidders expected to lodge indicative proposals for the business ahead of a deadline set by Poundland's owner. The duo join Alteri Investors, which owns Bensons for Beds, in the auction of Poundland. Money latest: '14 million Britons on course for parking fine this year' Modella Capital, which has just agreed a deal to buy WH Smith's high street division and this week announced rescue restructurings at Hobbycraft and The Original Factory Shop, may also be among those vying to buy the discounter. Poundland has been put up for sale by Pepco Group, its Warsaw-listed owner, amid mounting losses and a struggle to turn the company around. Pepco confirmed in March that it planned to explore a sale of the business, with Teneo hired to advise on an auction. \n                  Money blog: M&S forced to stop taking online orders amid payment meltdown\n                 \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Trump trade war: How UK figures show his tariff argument doesn't add up\n                 Last year, Poundland, which employs about 18,000 people, recorded roughly €2bn of sales. Earlier this year, Pepco, which also trades as Pepco and Dealz in Europe, said Poundland had seen a like-for-like sales slump of 7.3% during the Christmas trading period. Read more from Sky News:Water regulation slammed by spending watchdogRate cut speculation lights up as economic outlook darkens In an accompanying trading statement, Pepco said that Poundland had suffered \"a more difficult sales environment and consumer backdrop in the UK, alongside margin pressure and an increasingly higher operating cost environment\". Recent tax hikes announced by Rachel Reeves, the chancellor, in last autumn's Budget have also increased the financial pressure on high street retailers. Hilco and Endless both declined to comment."
    },
    {
        "title": "Trump trade war: How UK figures show his tariff argument doesn't add up",
        "description": "As Chancellor Rachel Reeves meets her counterpart, US treasury secretary Scott Bessent to discuss an \"economic agreement\" between the two countries, the latest trade figures confirm three realities that ought to shape negotiations.",
        "url": "https://news.sky.com/story/trump-trade-war-how-uk-figures-show-his-tariff-argument-doesnt-add-up-13355276",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-cargo-oakland-california_6876193.jpg?20250404191431",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-04-25 09:16:00",
        "Headline": "The latest official data from the Office for National Statistics continues to show that trade tariffs against goods from the UK should not be necessary, Sky's Paul Kelso writes.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n As Chancellor Rachel Reeves meets her counterpart, US treasury secretary Scott Bessent to discuss an \"economic agreement\" between the two countries, the latest trade figures confirm three realities that ought to shape negotiations. The first is that the US remains a vital customer for UK businesses, the largest single-nation export market for British goods and the third-largest import partner, critical to the UK automotive industry, already landed with a 25% tariff, and pharmaceuticals, which might yet be. In 2024, the US was the UK's largest export market for cars, worth £9bn to companies including Jaguar Land Rover, Bentley and Aston Martin, and accounting for more than 27% of UK automotive exports. Little wonder the domestic industry fears a heavy and immediate impact on sales and jobs should tariffs remain.  Money latest: '14 million Britons on course for parking fine this year' American car exports to the UK by contrast are worth just £1bn, which may explain why the chancellor may be willing to lower the current tariff of 10% to 2.5%. For UK medicines and pharmaceutical producers meanwhile, the US was a more than £6bn market in 2024. Currently exempt from tariffs, while Mr Trump and his advisers think about how to treat an industry he has long-criticised for high prices, it remains vulnerable. \n                  Trump has shifted priorities of world's economic policymakers - but their views of US have changed too\n                 \n                  Day 96: 'Vladimir STOP!' Will Trump's plea to Putin make a difference?\n                 \n                  Rate cut speculation lights up as economic outlook darkens\n                 The second point is that the US is even more important for the services industry. British exports of consultancy, PR, financial and other professional services to America were worth £131bn last year. That's more than double the total value of the goods traded in the same direction, but mercifully services are much harder to hammer with the blunt tool of tariffs, though not immune from regulation and other \"non-tariff barriers\".  The third point is that, had Donald Trump stuck to his initial rationale for tariffs, UK exporters should not be facing a penny of extra cost for doing business with the US. The president says he slapped blanket tariffs on every nation bar Russia to \"rebalance\" the US economy and reverse goods trade 'deficits' - in which the US imports more than it exports to a given country. That heavily contested argument might apply to Mexico, Canada, China and many other manufacturing nations, but it does not meaningfully apply to Britain. Read more: Could Trump tariffs tip the world into recession? Figures from the Office for National Statistics show the US ran a small goods trade deficit with the UK in 2024 of £2.2bn, importing £59.3bn of goods against exports of £57.1bn.  Add in services trade, in which the UK exports more than double what it imports from the US, and the UK's surplus - and thus the US 'deficit' - swells to nearly £78bn. That might be a problem were it not for the US' own accounts of the goods and services trade with Britain, which it says actually show a $15bn (£11.8bn) surplus with the UK. You might think that they cannot both be right, but the ONS disagrees. The disparity is caused by the way the US Bureau of Economic Analysis accounts for services, as well as a range of statistical assumptions. Read more from Sky News:Water regulation slammed by spending watchdogRate cut speculation lights up as economic outlook darkens \"The presence of trade asymmetries does not indicate that either country is inaccurate in their estimation,\" the ONS said. That might be encouraging had Mr Trump not ignored his own arguments and landed the UK, like everyone else in the world, with a blanket 10% tariff on all goods. Trade agreements are notoriously complex, protracted affairs, which helps explain why after nine years of trying, the UK still has not got one with the US, and the Brexit deal it did with the EU against a self-imposed deadline has been proved highly disadvantageous."
    },
    {
        "title": "Tories 'are not doing a deal with Reform,' Kemi Badenoch insists",
        "description": "Kemi Badenoch has said the Tories are \"not doing a deal with Reform\" after a Conservative mayor appeared to advocate for a \"coming together\" of the two rival parties. ",
        "url": "https://news.sky.com/story/tories-are-not-doing-a-deal-with-reform-kemi-badenoch-insists-13355333",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kemi-badenoch-nigel-farage_6831162.jpg?20250216235952",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-04-25 10:52:00",
        "Headline": "The Tory leader dismisses talk of pre-election \"stitch ups\" after Tees Valley mayor Ben Houchen suggests there needs to be a \"merger\" or \"pact of trust\" between the two parties.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Kemi Badenoch has said the Tories are \"not doing a deal with Reform\" after a Conservative mayor appeared to advocate for a \"coming together\" of the two rival parties.  The leader of the opposition criticised talk of \"stitch ups\" ahead of next week's local elections and said she was instead focused on ensuring that voters have a \"credible Conservative offer\". Speaking to reporters from Stratford-upon-Avon, she said: \"We are not doing a deal with Reform. There's not going to be a pact. \"What we need to do right now is focus on ensuring that voters have a credible Conservative offer. \"When we start talking about stitch ups before an election it sounds as if we are not thinking about the people out there but just about how we win. \"Winning is just the first step - we need to talk about how we are going to deliver for the people of this country.\"  Her words come after Tees Valley mayor Ben Houchen suggested his party may have to join forces with Nigel Farage's Reform UK. \n                  Could the local elections reshape British politics?\n                 \n                  Robert Jenrick vows to 'bring coalition together' to end Tory-Reform fight\n                 \n                  'Stop Brexit Man' cleared of flouting police ban with anti-Brexit edits of Muppet Show and Darth Vader\n                 In an interview with Politico, he said: \"I don't know what it looks like. I don't know whether it's a pact. I don't know whether it's a merger … [or] a pact of trust and confidence or whatever. \"But if we want to make sure that there is a sensible centre-right party leading this country, then there is going to have to be a coming together of Reform and the Conservative Party in some way.\" He added: \"What that looks like is slightly above my pay grade at the moment.\" The intervention from the Conservatives' last remaining mayor will create further trouble for Ms Badenoch after shadow justice secretary Robert Jenrick vowed to \"bring this coalition together\" to ensure that Conservatives and Reform UK are no longer competing for votes by the time of the next election. According to a leaked recording obtained by Sky News, Mr Jenrick - who lost the Tory leadership campaign to Ms Badenoch - said he would try \"one way or another\" to make sure the two right-wing parties do not end up handing a second term to Sir Keir Starmer. Mr Jenrick has denied his words amounted to calling for a pact with Reform - and told Good Morning Britain: \"I've said time and again that I want to put Reform out of business ... I want to send Nigel Farage back to retirement.\" Read more:Chancellor Rachel Reeves outlines red lines for US trade deal'Consensus has got to be rebuilt': Harriet Harman reacts to gender ruling  Questioned about Mr Jenrick's remarks, Reform UK leader Nigel Farage told Sky News he was not going to do a deal with the Conservative Party. He said: \"I mean he's clearly shaping himself up to be the next leader of the Conservative Party. He doesn't care what internal division he causes within the Parliamentary Party. \"But he's actually mistaken. We are not going to do a deal with a Conservative Party that gave us record tax levels since the war, mass migration, I mean I could go on.\""
    },
    {
        "title": "'Bring on the fight' over net zero, energy secretary Ed Miliband tells critics",
        "description": "The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband.",
        "url": "https://news.sky.com/story/bring-on-the-fight-over-net-zero-energy-secretary-ed-miliband-tells-critics-13355444",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6896599.jpg?20250425172110",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-25 13:50:00",
        "Headline": "Wrapping up a two-day summit on energy security in London, Mr Miliband said clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband. Amid growing attacks on its climate policies from the Trump administration, UK political parties and some businesses, the government this week reiterated its assertion that clean power will make Britain more secure. Wrapping up a two-day summit on energy security in London, Mr Miliband said: \"The critics need to know that if they want to fight about this, this government says 'bring it on'.\" Clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\", he said. Whereas \"insecure\" fossil fuels are to blame for \"the cost of living crisis, which ruined family finances, which ruined public finances, which ruined business finances\". Renewable electricity in the UK is cheaper than gas, but the benefits don't reach households very easily because prices are still closely linked with the cost of gas - something the government wants to fix. In the last week, Reform UK leader Nigel Farage MP accused Mr Miliband of \"net zero lunacy\", while President Trump's US official at the London summit Tommy Joyce on Thursday called net zero \"harmful and dangerous\". \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  'Nervous wees' of women at London Marathon 'to be turned into something amazing'\n                 \n                  Tech firms face fines up to £60,000 for failing to remove knife crime content\n                 In a news conference on Friday, Mr Miliband said: \"Whether it is political parties or other forces that want to take on net zero and the clean energy transition, they need to know this government is not for bending, this government is not for buckling, this government is standing firm.\"  But, with trade talks under way and the UK still heavily reliant on US oil and gas, Mr Miliband said Britain will find \"common ground\" with America on energy, despite wildly different views on climate policy. \"Obviously there are some differences, but there is also common ground,\" he said, citing shared interests in boosting nuclear power. The American official at the summit, acting assistant secretary Tommy Joyce, enjoyed plenty of time with the government during his visit, sitting next to Mr Miliband at a ceremonial dinner on Thursday evening, and meeting energy minister Michael Shanks on Friday. Also on the charm offensive with the Americans this week was Chancellor Rachel Reeves, who has been in Washington trying to win favour for a US-UK trade deal. Washington's attacks on climate and net zero policies, which Mr Trump sees as a threat that empowers rival China, threatened to overshadow the energy security summit. But it wrapped up on Friday with little fanfare, just closing remarks from co-host the International Energy Agency and Mr Miliband about the importance of clean energy and the materials need to build them. They will both be pleased that they and the other 60 countries present held the line on the transition to cleaner energy. On Thursday, Prime Minister Sir Keir Starmer told the summit that clean power was \"in the DNA of my government\". But his government was also the target of environmental protesters outside the summit at Lancaster House, who called out its wavering over the Rosebank oil and gas field. It has also been criticised for approving airport expansions and relaxing rules around electric vehicles."
    },
    {
        "title": "Green Party co-leader denies split over trans rights",
        "description": "The Greens have denied a split at the top of the party over trans rights, as they appeal to voters ahead of next week's local elections.",
        "url": "https://news.sky.com/story/green-party-co-leader-denies-split-over-trans-rights-13355566",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-carla-denyer-green-mp_6896775.jpg?20250425205851",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-04-25 18:18:00",
        "Headline": "Carla Denyer has defended her fellow co-leader Adrian Ramsay after he failed to say whether he believed that \"trans women are women\". The episode raised questions for the defiantly pro-trans party.",
        "Content": "\n          Political correspondent\n              @wizbates\n  The Greens have denied a split at the top of the party over trans rights, as they appeal to voters ahead of next week's local elections. Carla Denyer defended fellow co-leader Adrian Ramsay after he failed to say whether he still believed \"trans women are women\". This cast doubt over the stance of the defiantly pro-trans party and raised questions over whether the two leaders were at odds. But as she joined activists on the campaign trail in Kent on Friday, Ms Denyer claimed she and her fellow Green MP were still unified but couldn't say whether they had spoken about the contentious issue. She told Sky News: \"Green Party policy is clear that trans women are women, trans men are men, and non-binary identities exist and are valid. \"I support that policy and I know that Adrian and I are united in standing up for trans rights and for women's rights. \"I don't see those in conflict, I understand some people will express themselves slightly differently, and I absolutely understand why a man, a cis-man, might feel slightly uncomfortable defining womanhood from the outside.\" \n                  Labour have been 'crushing disappointment', say Greens at local elections campaign launch\n                 \n                  Green Party to demand wealth tax to 'defend public services'\n                 \n                  After the 'revenge' election, what’s politics going to be like now? \n                 Local elections It may have caused some tricky conversations this week, but the issue is unlikely to have a huge impact on next Thursday's elections. And as the campaigners and candidates went from door to door in the town of Dartford, it became clear that they were feeling confident. Although the Greens only have five seats on Kent County Council, they are contesting almost all of the 81 up for grabs and believe they can make gains from the Conservatives, who currently have an overwhelming majority. It's a pattern they hope to see across the country, building on previous momentum and capitalising as people lose faith in establishment politics. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Laying out their track record, Ms Denyer said: \"In the general election we quadrupled our representation in the House of Commons and not only that, we came second in 40 constituencies as well, and in the local elections, we've increased our number of councillors nearly fivefold.\" Critics though have suggested there may be a ceiling on the green vote and cited their inability to grab attention nationally. A Reform-shaped problem This is in contrast to other leaders of smaller parties, in particular Nigel Farage, who has relentlessly drawn the spotlight and driven up Reform support since the general election. They're now streets ahead of the Greens in the polls despite having the same number of MPs. So, does Ms Denyer think she can learn anything from her anti-establishment rival? \"Nigel Farage's model of reform is very much about ego and celebrity and a one-man band,\" she said. \"That's never been the Green Party's values, we're a grassroots bottom-up organisation.\" Read more from Sky News:'Bring on the Net Zero fight', Ed Miliband saysSausage wielder, rollercoaster rider… vote winner?Ultimate guide to local elections Whether this strategy will deliver the breakthrough moment they are chasing will be decided when voters go to the polls next Thursday."
    },
    {
        "title": "'Bring on the fight' over net zero, energy secretary Ed Miliband tells critics",
        "description": "The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband.",
        "url": "https://news.sky.com/story/bring-on-the-fight-over-net-zero-energy-secretary-ed-miliband-tells-critics-13355444",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6896599.jpg?20250425172110",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-25 13:50:00",
        "Headline": "Wrapping up a two-day summit on energy security in London, Mr Miliband said clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is up for the fight over net zero every hour, day and month of the year, says Energy Secretary Ed Miliband. Amid growing attacks on its climate policies from the Trump administration, UK political parties and some businesses, the government this week reiterated its assertion that clean power will make Britain more secure. Wrapping up a two-day summit on energy security in London, Mr Miliband said: \"The critics need to know that if they want to fight about this, this government says 'bring it on'.\" Clean power provides \"energy security, lower bills [and] the biggest economic opportunity of the 21st century\", he said. Whereas \"insecure\" fossil fuels are to blame for \"the cost of living crisis, which ruined family finances, which ruined public finances, which ruined business finances\". Renewable electricity in the UK is cheaper than gas, but the benefits don't reach households very easily because prices are still closely linked with the cost of gas - something the government wants to fix. In the last week, Reform UK leader Nigel Farage MP accused Mr Miliband of \"net zero lunacy\", while President Trump's US official at the London summit Tommy Joyce on Thursday called net zero \"harmful and dangerous\". \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  'Nervous wees' of women at London Marathon 'to be turned into something amazing'\n                 \n                  Tech firms face fines up to £60,000 for failing to remove knife crime content\n                 In a news conference on Friday, Mr Miliband said: \"Whether it is political parties or other forces that want to take on net zero and the clean energy transition, they need to know this government is not for bending, this government is not for buckling, this government is standing firm.\"  But, with trade talks under way and the UK still heavily reliant on US oil and gas, Mr Miliband said Britain will find \"common ground\" with America on energy, despite wildly different views on climate policy. \"Obviously there are some differences, but there is also common ground,\" he said, citing shared interests in boosting nuclear power. The American official at the summit, acting assistant secretary Tommy Joyce, enjoyed plenty of time with the government during his visit, sitting next to Mr Miliband at a ceremonial dinner on Thursday evening, and meeting energy minister Michael Shanks on Friday. Also on the charm offensive with the Americans this week was Chancellor Rachel Reeves, who has been in Washington trying to win favour for a US-UK trade deal. Washington's attacks on climate and net zero policies, which Mr Trump sees as a threat that empowers rival China, threatened to overshadow the energy security summit. But it wrapped up on Friday with little fanfare, just closing remarks from co-host the International Energy Agency and Mr Miliband about the importance of clean energy and the materials need to build them. They will both be pleased that they and the other 60 countries present held the line on the transition to cleaner energy. On Thursday, Prime Minister Sir Keir Starmer told the summit that clean power was \"in the DNA of my government\". But his government was also the target of environmental protesters outside the summit at Lancaster House, who called out its wavering over the Rosebank oil and gas field. It has also been criticised for approving airport expansions and relaxing rules around electric vehicles."
    },
    {
        "title": "'Nervous wees' of women at London Marathon 'to be turned into something amazing'",
        "description": "The urine of thousands of women taking part in the London Marathon this Sunday will be recycled and turned into fertiliser for wheat. ",
        "url": "https://news.sky.com/story/nervous-wees-of-women-at-london-marathon-to-be-turned-into-something-amazing-13355168",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-peequal-urinal_6896029.jpg?20250425040604",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-25 02:40:00",
        "Headline": "A total of 1,000 litres of urine will be collected from runners making use of PEEQUAL women's urinals at the London Marathon on Sunday.",
        "Content": "The urine of thousands of women taking part in the London Marathon this Sunday will be recycled and turned into fertiliser for wheat.  More than 1,000 litres will be collected from PEEQUAL's women's urinals - which are 2.7 times faster to use than other portable toilets and reduce queues. The company is pairing up with fellow Bristol-based start-up NPK Recovery to recycle urine and help reduce the event's carbon footprint. Wheat has been chosen because this crop is hungry for urine's nitrogen content - and the fertiliser could help grow enough to make approximately 195 loaves of bread.  'Recycled into something amazing' Runner Susan Farrell said: \"It's brilliant to think that the nervous wees of thousands of women are helping a good cause. \"I used PEEQUAL's novel urinals at Glastonbury - their design means they don't sacrifice privacy and it honestly felt like we were cheating by skipping the queues. \n                  Man charged with murder after woman stabbed to death in Enfield\n                 \n                  'Everyone should watch': New TV drama focuses on man shot dead at Tube station after being mistaken for a terrorist \n                 \n                  Murder arrest after woman stabbed to death in Enfield - as victim named\n                 \"I used to watch guys breeze through and think, 'Why can't we have that?' \"Now we do, and I really hope we get to see them at more events.\" Amber Probyn, co-founder of PEEQUAL, said: \"We love coming to the TCS London Marathon because we firmly believe that women shouldn't have to choose between starting their race on time or waiting to go to the loo. \"We're really proud that 1,000 litres of wee won't go to sewage, and will instead be recycled into something amazing.\" NPK Recovery uses bacteria to recover naturally occurring nutrients from the urine, creating a liquid fertiliser. Hannah Vandenbergh, founder of the firm, said: \"Urine doesn't have to be a waste product and we're excited to be playing a small part in helping support the sustainability commitments of the iconic TCS London Marathon. \"Ultimately, we want to help event organisers all over recycle their urine and reduce their carbon footprints.\" Read more:Sky News political editor running London marathonLondon Marathon: Four mistakes to avoid, according to experts Kate Chapman, head of sustainability at London Marathon Events, said: \"Part of our environmental strategy is to try and find an 'onward use' for all waste that is generated at our events, for instance composting, reusing, upcycling and much more besides. \"We are delighted that the urine from the PEEQUAL urinals can be used for something so positive rather than going to waste.\""
    },
    {
        "title": "Kim Kardashian's Paris robbery trial: Everything you need to know",
        "description": "In October 2016, Kim Kardashian was robbed at gunpoint - with jewellery worth millions of dollars stolen during the audacious heist in Paris. ",
        "url": "https://news.sky.com/story/eight-years-ago-kim-kardashian-was-robbed-at-gunpoint-with-jewellery-worth-millions-stolen-now-the-case-is-coming-to-court-13351530",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kim-kardashian-paris_6896534.png?20250425153146",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-04-25 10:22:00",
        "Headline": "\"Grandpa robbers\", jewellery worth millions of pounds and one of the most famous women in the world, Kim Kardashian's Paris robbery was headline news almost a decade ago, and now it's finally coming to trial.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n In October 2016, Kim Kardashian was robbed at gunpoint - with jewellery worth millions of dollars stolen during the audacious heist in Paris.  It was the biggest robbery of an individual in France for more than 20 years - and made front pages around the world. Now, almost a decade on, the case is finally coming to court. Why has it taken so long? Will Kardashian give evidence? And who exactly are the \"grandpa robbers\" facing trial? Here's everything you need to know. What happened? Two years after Kardashian and rapper Kanye West tied the knot in an ostentatious week-long celebration spanning Paris and Florence, the Kardashian-West clan were back in the French capital for Paris Fashion Week. \n                  Menendez brothers murder case: Prosecutors review new evidence - as Kim Kardashian calls for their release\n                 \n                  Kim Kardashian visits Lyle and Erik Menendez in jail amid controversy over Netflix show\n                 \n                  'Where is Kate?': US reaction to royal story is 'extraordinary'\n                 Her then husband had returned to the US to pick up his Saint Pablo tour - but Kardashian, along with her sister Kourtney and various members of their entourage, remained in Paris, staying in an exclusive set of apartments so discreet they've been dubbed the No Address Hotel. Nestled on Tronchet Street, just a stone's throw from Place de l'Opéra, and close to the fashionable Avenue Montaigne, the Hotel de Pourtalès is popular with A-list stars staying in the French capital. A stay in the Sky Penthouse, the suite occupied by Kardashian, will currently set you back about £13,000 a night. On the evening of 3 October, after attending a fashion show with her sister, Kardashian remained in the apartment alone while the rest of her convoy - including her bodyguard Pascal Duvier - went out for the night. At about 2.30am, three armed men wearing ski masks and dressed as police forced their way into the apartment block - and according to investigators, they threatened the concierge at gunpoint. Two of them are alleged to have forced the concierge to lead them to Kardashian's suite. He later told police they yelled at him: \"Where's the rapper's wife?\" Kardashian said she had been \"dozing\" on her bed when the men then entered her room. She has said she believes her social media posts provided the alleged robbers with \"a window of opportunity\". \"I was Snapchatting that I was home, and that everyone was going out,\" she said in the months after the incident. The Keeping Up With The Kardashians star vividly described the attack in a police report, as reported in the French weekly paper Le Journal Du Dimanche. \"They grabbed me and took me into the hallway. They tied me up with plastic cables and taped my hands, then they put tape over my mouth and my legs.\" She said they pointed a gun at her, asking specifically for her ring and also for money. Kardashian says they carried her into the bathroom and put her in the bathtub. She said she was wearing only a bathrobe at the time. She had initially thought the robbers \"were terrorists who had come to kidnap me\", according to a French police report taken in New York three months after the robbery. Kardashian told officers: \"I thought I was going to die.\" According to police, the robbers - who left the room after grabbing their haul, escaped on bicycles with items estimated to be worth about $10m (£7.5m), including a $4m (£3m) 18.88-carat diamond engagement ring from West. After they had left, Kardashian said she escaped her restraints and went to find help. After speaking to detectives, she immediately returned to the US on a private jet and later hired a completely new security team. What was stolen? As well as her engagement ring, Kardashian said the thieves took her large Louis Vuitton jewellery box, which she said contained \"everything I owned\". In police reports given to the French authorities at about 4.30am on the night of the alleged robbery, Kardashian listed these items as having been stolen: • Two diamond Cartier bracelets• A gold and diamond Jacob necklace• Diamond earrings by Lauren Schwartz• Yanina earrings• Three gold Jacob necklaces• Little bracelets, jewels and rings• A Lauren Schwartz diamond necklace• A necklace with six little diamonds• A necklace with Saint spelt out in diamonds• A cross-shaped diamond-encrusted Jacob cross• A yellow gold Rolex watch• Two yellow gold rings• An iPhone 6 and a BlackBerry Police recovered only the diamond-encrusted cross that was dropped by the robbers while leaving. It's likely the gold in the haul was melted down and resold, while the diamond engagement ring that is now so associated with the robbery would be far too recognisable to sell on the open market. What will happen in court? The hearing will begin at the Court of Appeal of Paris - the largest appeals court in France - on 28 April and is scheduled to last a month. It will consist of a presiding judge, two professional assessors, and six main jurors. The hearing involves more than 2,000 documents and there are four civil parties. Who is being tried? There were initially 12 defendants in the case, but one person has died and another has a medical condition that prevents their involvement. This means 10 people - nine men and one woman - are standing trial. Five of them, who were all aged between 60 and 72 at the time of the incident, face armed robbery and kidnapping charges. They are: • Yunice Abbas• Aomar Ait Khedache• Harminv Ait Khedache• Didier Dubreucq• Marc-Alexandre Boyer Abbas, 72, has admitted his participation in the robbery. In 2021, he published a book about the robbery, titled I Kidnapped Kim Kardashian. In 2021, a court ruled he would not benefit financially from the book. Aomar Ait Khedache, 69, known to French crime reporters as \"Old Omar\", has also admitted participating in the heist but denies the prosecution's accusation that he was the ringleader. The remaining five defendants are charged with complicity in the heist or the unauthorised possession of a weapon. They are: • Florus Heroui• Gary Mader• Christiane Glotin• François Delaporte• Marc Boyer Among those, Mader was a VIP greeter who worked for the car company Kardashian used in Paris, and Heroui was a bar manager who allegedly passed on information about Kardashian's movements. With many of the accused now ageing and with various serious health conditions, and some having spent time in jail following their arrest, all are currently free under judicial supervision. If found guilty, those accused of the more serious crimes could face 10 years to life imprisonment. Will Kardashian give evidence? Yes. Lawyer Michael Rhodes said Kardashian has \"tremendous appreciation and admiration for the French judicial system\" and \"wishes for the trial to proceed in an orderly fashion in accordance with French law and with respect for all parties to the case\". A trainee lawyer herself, Kardashian has become a high-profile criminal justice advocate in the US in recent years. Why has it taken so long to come to court? There was initially a manhunt after the robbery, with French police under pressure to prove that Paris's security was not in question. Just the year before in 2015, the capital had been shaken by terrorist attacks by Islamic militants, in which 130 people were killed, including 90 at a music event at the Bataclan theatre. French police initially arrested 17 people in the Kardashian case in January 2017 - three months after the robbery - assisted by DNA traces found on plastic bands used to tie her wrists. Twelve people were later charged. It was ordered to be sent to trial in 2021 - at a time when limited court proceedings were happening due to multiple COVID lockdowns, and France was holding its largest ever criminal trial over the November 2015 terror attacks. What has Kardashian said about the incident? Kardashian has described the robbery as a \"life-changing\" moment. She took three weeks away from filming her reality TV show Keeping Up With the Kardashians, and took a three-month break from social media. In a March 2017 episode titled Paris, Kardashian first spoke publicly about her ordeal. She described first hearing a noise in her apartment, and calling out, thinking it was her sister and assistant: \"At that moment when there wasn't an answer, my heart started to get really tense. Like, you know, your stomach just kind of like, knots up and you're like, 'OK, what's going on?' I knew something wasn't quite right.\" She went on: \"They asked for money. I said, 'I don't have any money'. They dragged me out to the hallway on top of the stairs. That's when I saw the gun, clear as day. I was looking at the gun, looking down back at the stairs. I was like, I have a split second in my mind to make this quick decision. \"Either they're going to shoot me in the back or if I make it [down the stairs] and the elevator does not open in time or the stairs are locked, there's no way out.\" Three months later, she told a Forbes Power Women's Summit she had changed her approach to posting on social media: \"They had followed my moves on social media, and they knew my every move and what I had.\" She added: \"It was definitely a huge, huge, huge lesson for me to not show off some of the things that I have. It was a huge lesson to me to not show off where I go. \"It's just changed my whole life, but I think for the better.\" In October 2020, Kardashian told US interviewer David Letterman she feared she would be raped and murdered during the heist, and that her sister had been at the forefront of her mind during the incident. Speaking on My Next Guest Needs No Introduction, Kardashian said: \"I kept on thinking about Kourtney, I kept on thinking she's going to come home and I'm going to be dead in the room and she's going to be traumatised for the rest of her life if she sees me... I thought that was my fate.\" When speaking to French police about the impact the robbery had had on her three months after it, Kardashian said: \"I think that my perception of jewellery now is that I am not as attached to it as I used to be. I don't have the same feeling about it. In fact, I even think that it has become a bit of a burden to have the responsibility of such expensive jewels. \"There is nothing of sentimental value to compare with the act of going home and finding one's children and one's family.\" She went on to describe Paris as \"not the right place\" for her, and didn't return to the French capital for two years following the robbery. Kardashian has since said in a 2023 episode of Keeping Up With The Kardashians that she did not purchase any jewellery in the seven years following the robbery, kept no jewellery at her home and only wore items that are either borrowed or fake. She said the realisation that material items don't matter has made her \"a completely different person in the best way\"."
    },
    {
        "title": "Laurence Fox denies sharing upskirting photo of TV star Narinder Kaur",
        "description": "Laurence Fox has denied sharing a compromising photo of TV star Narinder Kaur on social media.",
        "url": "https://news.sky.com/story/laurence-fox-denies-sharing-upskirting-photo-of-tv-star-narinder-kaur-13355481",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-laurence-fox-narinder-kaur_6896669.jpg?20250425185223",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-25 14:49:00",
        "Headline": "Fox is accused of sharing a photograph or film of a person in an intimate state \"intending to cause alarm, distress or humiliation\".",
        "Content": "Laurence Fox has denied sharing a compromising photo of TV star Narinder Kaur on social media. The 46-year-old is alleged to have shared a compromising image in a tweet posted in April 2024 of Kaur, who appears regularly on Good Morning Britain and has previously appeared on GB News. Fox, of Peldon in Essex, appeared at Westminster Magistrates' Court on Friday, charged with two counts under the Sexual Offences Act 2003. He is accused in the first count of sharing a \"photograph or film of the person in an intimate state intending to cause alarm, distress or humiliation\". The second alleges he sent a \"photograph or film of genitals to cause alarm, distress or humiliation\". Kaur has waived her right to anonymity. Fox, who has recently attempted to enter the world of politics, spoke to confirm his identity and enter not guilty pleas to both charges. Read more from Sky News:Kim Kardashian robbery trial: Everything you need to knowOasis fans lost more than £2m to ticket scams The police previously said Fox had been \"charged with an offence contrary to section 66A of the Sexual Offences Act 2003\" which \"relates to an image that was posted on a social media platform in April 2024\". Section 66A of the Sexual Offences Act relates to \"cyber flashing\". The charge, introduced in 2023, makes it an offence to intentionally share a sexual image of someone without consent, with the aim of causing alarm, distress, humiliation or for sexual gratification. Upskirting, taking pictures of people under their clothes without their permission, became a specific criminal offence in 2019. Fox elected for a jury trial at crown court and will appear at Woolwich Crown Court for a pre-trial hearing on 23 May. Hailing from the well-known Fox acting family dynasty, Fox is best known for his role in Inspector Morse spin-off, Lewis. Fox was fired from a presenter role at GB News in October 2023 after the channel deemed comments he's made about a female journalist \"totally unacceptable\"."
    }
]