[
    {
        "title": "Heathrow Airport reopens for some flights after fire led to 'unprecedented' shutdown",
        "description": "Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers.",
        "url": "https://news.sky.com/story/heathrow-says-it-will-reopen-after-more-than-1000-flights-cancelled-and-200000-passengers-affected-by-shutdown-13332920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250321234610",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 00:42:00",
        "Headline": "The blaze triggered a \"significant power outage\" that resulted in more than 1,000 flights to and from the airport being cancelled.",
        "Content": " Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers. Counter-terror police were leading the investigation into the cause of the blaze, which triggered a \"significant power outage\" that led to more than 1,000 flights to and from the airport being cancelled. Heathrow's boss apologised to passengers, describing the disruption \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". Follow live updates on Heathrow shutdown In an update on Friday evening, the Metropolitan Police said the cause of the fire is believed to be non-suspicious, while the London Fire Brigade (LFB) announced its investigation will focus on the electrical distribution equipment. Heathrow is expected to run a full schedule on Saturday. The fire that caused the power outage is at the North Hyde substation in Hayes, about 1.5 miles to the north of the west London airport. LFB received the first reports of the fire at 11.23pm on Thursday. Heathrow initially announced the airport would be closed until 11.59pm on Friday but later said repatriation flights for passengers diverted to other airports in Europe would resume on Friday evening.  Several airlines announced they would restart scheduled flights both to and from Heathrow, including British Airways (BA), Air Canada and United Airlines. A BA flight to Riyadh, in Saudi Arabia, took off just before 9pm after a slight delay to its expected departure time. Restrictions on overnight flights have also been temporarily lifted to help ease congestion, the Department of Transport said. Read more:What we know so farAnalysis: Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy?  Airport disruption nearly 'as big as it gets' Heathrow Airport's chief executive Thomas Woldbye told reporters the flights taking off on Friday evening would help make sure the airport has \"operations in place\" for Saturday morning. He continued: \"Tomorrow morning we expect to be back in full operation, so 100% operation as a normal day.\" Mr Woldbye added that passengers who were planning to fly from Heathrow on Saturday should arrive at the airport in time for their flight as normal. The chief executive also apologised to the passengers whose journeys had been disrupted but said he would not have closed down the airport unless there were \"severe safety concerns\". Asked whether the disruption caused by the fire suggested there was a \"weak point\" in Heathrow's operations, Mr Woldbye replied: \"We can't guard ourselves 100%. This has been a major incident. \"Short of anybody getting hurt, this is as big as it gets for our airport and we are actually coming back quite fast.\" He added: \"This is unprecedented, it's never happened before.\" It comes after Number 10 said earlier that there are questions to be answered about how the fire has caused so much chaos. Flight delayed or cancelled? What are your rights? Mr Woldbye said: \"Our procedures have worked the way they should... Of course the prime minister should ask questions and we'll be happy to answer them.\" Earlier, the airport said it expected \"significant disruption over the coming days\" and warned passengers \"not travel to the airport under any circumstances until the airport reopens\". All trains to Heathrow were suspended.  Some power has returned to Terminal 4, with lights in the main building and lifts in the multi-storey car park operational again. The disruption began late on Thursday night when fire crews were called to a blaze in west London at an electricity substation serving Heathrow and local properties.  You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material. Thousands of passengers stranded Heathrow is one of the world's busiest airports and had a record 83.9 million passengers last year, with a plane landing or taking off around every 45 seconds. The figure, from the Civil Aviation Authority, is equivalent to about 229,000 passengers using the hub every day. Aviation analytics firm Cirium told the New York Times that it believed as many as 290,000 passengers could have been affected on Friday - enough to fill Wembley Stadium three times. Oil fire still alight at substation LFB deputy commissioner Jonathan Smith told reporters at a news conference the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies have been restored. Earlier LFB said 10 engines and around 70 firefighters had been working to extinguish the blaze. Pictures from the scene showed large flames and plumes of thick black smoke. The LFB said in a statement that 5% of the fire was still alight as of 7pm on Friday."
    },
    {
        "title": "Heathrow shutdown is embarrassing at best - but at worst it points to serious vulnerabilities in UK infrastructure",
        "description": "An electrical substation fire and an entire airport shut down - with over 1,000 flights cancelled, others rerouted worldwide, and 200,000 passengers affected by the disruption.",
        "url": "https://news.sky.com/story/heathrow-shutdown-is-embarrassing-at-best-but-at-worst-it-points-to-serious-vulnerabilities-in-uk-infrastructure-13333252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-infrastructure-uk-heathrow_6863340.png?20250321154240",
        "type": "Home",
        "Author": "Tom Cheshire",
        "Date Published": "2025-03-21 14:48:00",
        "Headline": "As one of the busiest travel hubs in the world, Heathrow is considered a part of the UK's critical national infrastructure. The power failure and the chaos that ensued on Friday exposed that system's overall vulnerability.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  An electrical substation fire and an entire airport shut down - with over 1,000 flights cancelled, others rerouted worldwide, and 200,000 passengers affected by the disruption. The Heathrow closure on Friday really highlights the 'critical' part of critical national infrastructure (CNI) - the systems and facilities that are essential for society to function. At best it's an embarrassment. At worst, it points to serious vulnerabilities across the country that could be exploited by bad actors. Heathrow first. Heathrow needs a lot of power, the equivalent of a small town, and the bulk of this is supplied by a dedicated connection at the North Hyde substation - reflecting Heathrow’s critical status. But that also appears to be the problem - because Heathrow requires so much power, having a second dedicated connection would likely be prohibitively expensive, especially for the low probability scenario of such a catastrophic fire. This is the first time this has happened in decades, after all. \"Fires like this are not common at all,\" said Dr Robin Preece, a reader in future power systems at the University of Manchester. \"If it just broke down without catching fire… you might never have noticed anything as we have sufficient alternative routes for the electricity to follow.\" But uncommon doesn't mean impossible - and when infrastructure is critical, it's supposed to be protected. MI5 in charge of critical infrastructure protection The organisation ultimately responsible is MI5, through the National Protective Security Authority. This lists 13 national infrastructure sectors, from chemicals to nuclear, emergency services to food, space to water. It's a lot to look after - this map shows just some of the sites that would be considered CNI. Airports and power stations. Or the tubes that supply us with energy (gas and fuel pipelines) and internet (undersea cables). Many of those risks are collected in the National Risk Register. This plots the likelihood and the impact of a risk. Measuring risk chances and impact So an accidental fire or explosion at an onshore fuel pipeline is estimated to have less than a 0.2% chance of happening in the next two years but would have only a \"moderate\" impact, defined as between 41-200 casualties and/or hundreds of millions of pounds in economic losses. A civil nuclear accident has a similar probability but would have a \"catastrophic\" impact, defined as the loss of more than 1,000 lives and/or an economic cost of tens of billions of pounds. Pandemics also meet the catastrophic impact threshold. A regional failure of the electricity network, one due perhaps to \"a specific power substation\", is listed as having a 1% to 5% chance of happening every two years, and a moderate impact. But this is what happened to Heathrow - and the impact doesn’t appear moderate at all. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:How Heathrow closure ruined travel plansWhat we know about shutdown as flights grounded Catalogue of vulnerabilities The National Risk Register is sensible planning but it's also a catalogue of vulnerabilities. Accidents do happen, but so do attacks. It can be hard to tell the difference - and that's the point of what are known as \"grey zone\" attacks. For example, undersea cables keep unfortunately being cut, whether in the Baltic Sea or the waters around Taiwan. Taiwan has accused China of doing this deliberately. China responded by saying that damage to undersea cables is a \"common maritime accident\". \"Malicious actors see opportunities and vulnerabilities\", Marco Wyss, Professor of International History and Security at Lancaster University, told Sky News. \"And if you showcase vulnerabilities to such an extent as today, even if it wasn't a malicious actor, it can give them some ideas.\" Additional reporting by Sophia Massam, junior digital investigations journalist "
    },
    {
        "title": "Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US",
        "description": "Donald Trump has said Russia is only fearful of NATO with the US as a member.&#160;",
        "url": "https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump_6863645.jpg?20250321213221",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 14:55:00",
        "Headline": "The US president made the comments while awarding Boeing a contract to develop the F-47, the US Air Force's most sophisticated fighter jet yet. ",
        "Content": " Donald Trump has said Russia is only fearful of NATO with the US as a member.  In a news conference on Friday, the US president claimed: \"NATO was gone until I came along\". \"President Putin will tell you that without the United States, he wouldn't be worried, but he is worried when the United States is involved,\" he said. Mr Trump also alleged the previous and current NATO secretary generals said: \"If it wasn't for Trump, you wouldn't even have NATO because we were paying the costs of almost all of the countries.\" Mr Trump made the comments as he announced in the White House that Boeing has won a contract to develop the US Air Force's most sophisticated fighter jet yet. The new sixth-generation jet would be named F-47, Mr Trump said. \"Nothing in the world comes close to it... it's something the likes of which nobody has seen before,\" he added. \n                  Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears\n                 \n                  China has 'executed four Canadians'\n                 \n                  Trump's call with Putin: Ending one war, preparing for another? \n                 \"(The F-47) will be the most lethal aircraft ever built.\" On defence, Mr Trump said the US is also \"well-equipped\" to fight any potential war with China. \"We don't want to have a potential war with China. But I can tell you if we did, we're very well-equipped to handle it,\" he said. He also rejected reports that his adviser Elon Musk would be briefed on how the United States would fight a hypothetical war with China - a rare suggestion that his far-reaching role in the administration will face limits. \"Elon has businesses in China,\" he said. \"And he would be susceptible, perhaps, to that.\" The president confirmed he would be speaking to China's president Xi Jinping about tariffs. Mr Trump also said there was flexibility on his controversial economic measure. It comes as Mr Trump expressed enthusiasm for possibly becoming a member of the Commonwealth. Sharing an article on his Truth Social network about plans to allegedly make the USA the next associate member, the President wrote: \"I Love King Charles. Sounds good to me!\" 'Our allies are calling constantly' The plane's design remains a closely-held secret, but would likely include stealth, advanced sensors, and cutting-edge engines. The initial contract to proceed with production on the jets is worth an estimated $20bn (£15.5bn). 👉 Follow Trump 100 on your podcast app 👈 Mr Trump said the jets will be built over several years and \"it's something nobody has ever seen before\". \"Our allies are calling constantly,\" Trump said, adding foreign sales could be an option. \"They want to buy them also.\" Read more:Trump signs order to dismantle US department of educationWhat are Donald Trump's tariffs? After saying the US would \"tone down\" the new jets by 10% for any sales to allies, Trump said: \"[It] probably makes sense, because someday, maybe they're not our allies.\" Critics have questioned the cost and the necessity of the programme as the Pentagon is still struggling to fully produce its current most advanced jet, the F-35, which is expected to cost taxpayers more than $1.7tr (£1.01tr) over its lifespan. 'I'll pay out of my own pocket' Meanwhile, Mr Trump said he will pay NASA astronauts Suni Williams and Butch Wilmore overtime pay after their trip to the International Space Station lasted nine months longer than planned. A reporter at the news conference said the pair are not entitled to overtime pay, prompting Mr Trump to say: \"If I have to, I'll pay it out of my own pocket.\""
    },
    {
        "title": "Murder arrest after woman in her 40s dies in Clacton",
        "description": "A man has been arrested on suspicion of murder over the death of a woman in her 40s in Essex.",
        "url": "https://news.sky.com/story/murder-arrest-after-woman-in-her-40s-dies-in-clacton-13333492",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-clacton-police_6863662.jpg?20250321215334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:32:00",
        "Headline": "A man in his 20s has been arrested on suspicion of murder after police were called to a property on Skelmersdale Road in the Essex seaside town on Friday morning.",
        "Content": "A man has been arrested on suspicion of murder over the death of a woman in her 40s in Essex. Police said the suspect in his 20s has been taken to hospital in a serious condition. Officers were called to a property on Skelmersdale Road in the seaside town at 11:30am on Friday. Essex Police said officers attended with ambulance crews and an air ambulance but the woman died at the scene. The force added that it was not looking for anyone else in connection with the incident. Detective Chief Inspector Rob Huddleston said: \"We know how concerning this incident will be to the local community and I can assure you that we are working diligently to understand exactly what happened. \"Our officers were on the scene within five minutes of the call coming into to us and worked with our colleagues from the ambulance service to try and help the woman.\" Read more from Sky News:Man 'with horror fixation' dismembered housematePrince William joins UK troops in Challenger 2 tanksTrump announces 'most lethal aircraft ever built' Witnesses or anyone with footage of the incident is urged to come forward."
    },
    {
        "title": "Israel says it has killed Hamas military intelligence chief Osama Tabash - as forces told to push further into Gaza",
        "description": "Israel has said Hamas' military intelligence chief in southern Gaza has been \"eliminated\".",
        "url": "https://news.sky.com/story/israel-says-it-has-killed-hamas-military-intelligence-chief-osama-tabash-as-forces-told-to-push-further-into-gaza-13333403",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-israel-gaza_6861471.jpg?20250321224714",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 19:10:00",
        "Headline": "Nearly 600 Palestinians have been killed since Tuesday - many of them children, according to Gaza health authorities.",
        "Content": "Israel has said Hamas' military intelligence chief in southern Gaza has been \"eliminated\". In a post on X, Israel Defence Forces (IDF) said Osama Tabash was also head of the group's surveillance and targeting unit. It said he was responsible for \"planning and coordinating targets and infiltration objectives\" during the October 2023 terror attack and was in charge of \"combat strategy on the ground\". It did not say when or where he was killed and Hamas has not commented on the claim. It comes as Israel's defence minister said he had ordered ground forces to advance deeper into Gaza and to hold more land in an effort to pressure Hamas to free more hostages. \"The more Hamas continues its refusal to release the kidnapped, the more territory it will lose to Israel,\" said Israel Katz. Israel resumed airstrikes a few days ago after an extension to the ceasefire that had seen Israeli hostages swapped for Palestinian prisoners could not be agreed. \n                  UN says teachers, doctors, nurses were among staff killed in Israeli strikes – which killed 91 people in Gaza\n                 \n                  Israel launches new 'limited ground invasion' of Gaza amid deadly bombardment \n                 \n                  Fresh strikes in Gaza with at least 14 killed - as Israel army targets Hamas military site\n                 The truce was supposed to continue as long as talks on the second phase continued, but Israeli leader Benjamin Netanyahu refused to enter substantive negotiations. Nearly 600 Palestinians have now been killed since Tuesday - many of them children, according to Gaza health authorities.  Israel has said it will escalate operations until Hamas releases the 59 hostages it still holds - 24 of whom are believed alive - and gives up control of Gaza. On Thursday, after retaking part of the Netzarim corridor that divides Gaza's north from south, Israeli troops moved towards the town of Beit Lahiya, as well as the southern border city of Rafah. Israel also said it had resumed enforcing a blockade on northern Gaza, including Gaza City. Read more:Top court blocks Netanyahu's sacking of security chiefWhat happened to the Israel-Hamas ceasefire? Meanwhile, an explosion on Friday east of Gaza City killed a couple and their two children, plus another two children not related to them but in the same building, according to witnesses and a local hospital. The Israeli military said it had targeted a militant in a Gaza City building - with steps taken to minimise civilian harm. It was not clear if it was referring to the same strike. Israel also said it planned to conduct raids in three neighbourhoods west of Gaza City and warned Palestinians to evacuate in advance. The warning came shortly after it said it had intercepted two rockets that set off sirens in the Israeli coastal city of Ashkelon."
    },
    {
        "title": "Andrew Tate leaves the US to return to Romania",
        "description": "Andrew Tate, the self-styled \"king of toxic masculinity\", and his brother Tristan have left the US for Romania to fulfil legal obligations related to a criminal investigation against them.&#160;",
        "url": "https://news.sky.com/story/andrew-tate-leaves-the-us-to-return-to-romania-13333367",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate-tristan-tate_6841076.jpg?20250227075032",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 18:16:00",
        "Headline": "Tate and his brother Tristan are under investigation in Romania on multiple accusations, including forming an organised crime group and human trafficking. They have denied all wrongdoing.",
        "Content": "Andrew Tate, the self-styled \"king of toxic masculinity\", and his brother Tristan have left the US for Romania to fulfil legal obligations related to a criminal investigation against them.  The brothers are under investigation in Romania on multiple accusations, including forming an organised crime group and human trafficking. They have denied all wrongdoing. In a post on X, Tate said: \"Spending $185,000 on a private jet across the Atlantic to sign one single piece of paper in Romania. Innocent men don't run. They clear their name in court.\" As part of preventative judicial control measures pending the investigation, the Tates are required to regularly check in with authorities in Romania. Their next check-in is due on Monday. Their return to Romania comes almost a month after the brothers travelled to Florida after Romanian prosecutors lifted a travel ban against them. Florida's attorney general James Uthmeier said earlier this month that his office had opened a criminal investigation against the brothers, a move welcomed by the US National Centre on Sexual Exploitation, which represents one of Tate's alleged victims. Tate said on X at the time that the brothers had returned to Miami to see family and had been insulted by the opening of the investigation. \n                  Kyle Clifford: Violent misogyny of kind promoted by Andrew Tate 'fuelled rape and triple murder', prosecution says\n                 \n                  Florida launches criminal investigation into Tate brothers\n                 \n                  The Tates and Trump's inner circle: The deepening ties that led to the controversial influencers flying to freedom in America\n                 Read more on Sky News:Trump announces 'most lethal aircraft ever built'What we know about Heathrow closure \"We have no criminal record and expected a hero's welcome after being unfairly abused abroad,\" he wrote. An initial criminal case against the Tate brothers failed in December when a Bucharest court decided not to start the trial and sent the files back to prosecutors, citing flaws in the indictment. A British arrest warrant has also been issued for the Tates and they will be extradited after the Romanian trial proceedings are completed. The allegations in Britain, which they have denied, relate to sexual aggression between 2012 and 2015."
    },
    {
        "title": "Diamond Tiffany earrings swallowed by suspected thief are recovered by Florida police",
        "description": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly &#163;600,000 during his arrest, US police have said.",
        "url": "https://news.sky.com/story/diamond-tiffany-earrings-swallowed-by-suspected-thief-are-recovered-by-florida-police-13333505",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-diamomd-diamond-swallowed_6863657.jpg?20250321214842",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:44:00",
        "Headline": "The suspect was heard saying: \"I should have thrown them out the window\" and asked jail staff: \"Am I going to be charged with what is in my stomach?\", according to an arrest report.",
        "Content": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly £600,000 during his arrest, US police have said. The man, who was detained in Florida, had told staff at a Tiffany & Co store he was interested in buying earrings and a diamond ring on behalf of an Orlando Magic basketball player in February. He was escorted to a VIP room where he could view the jewellery but a short time later, he jumped out of his chair, grabbed the jewellery and forced his way out the door, Orlando Police Department said. Officers obtained the licence plate of the suspect's car through shopping centre security footage and tracked the vehicle. He was pulled over for driving without rear lights in Washington County, almost 340 miles away, a police report said. In the police car, an officer heard the suspect say: \"I should have thrown them out the window,\" and at the Washington County jail he asked staff: \"Am I going to be charged with what is in my stomach?\" according to the arrest report. While some earrings were quickly recovered, the suspect was then transferred to hospital where detectives monitored him as they waited to collect the remaining evidence. The four stolen earrings, valued at $770,000 (£596,000), matched the serial numbers from the jewellery taken from the Tiffany store last month, detectives said. Read more from Sky News:What Heathrow shutdown tells usUS unlikely to replace important steal with domestic version After the jewellery was recovered, the arrested man was taken to Orange County Jail where he faces charges of robbery with a mask and first-degree grand theft."
    },
    {
        "title": "How Donald Trump's tariffs are wreaking chaos in the British metal industry",
        "description": "As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-are-wreaking-chaos-in-the-british-metal-industry-13331951",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariff-ed-conway_6862428.jpg?20250320174408",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-03-21 04:00:00",
        "Headline": "Producers have been in a race against time, fighting weather and a changeable political climate to avoid paying millions in import fees.  ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser. Over the preceding weeks, Marcegaglia, the stainless steel company whose long products division he headed up, had rushed to melt and ship as much metal as it could from its furnaces in Sheffield across to the east coast of America, ahead of the imposition of tariffs. UK and US industrially interlocked Of all the varieties of steel, stainless steel - an alloy of iron and chrome, along with other elements like nickel, molybdenum and carbon - is among the most important. Unlike most other iron alloys, which can rust when they encounter oxygen, stainless steel has a passive film that protects it from corrosion and can even self-heal. That makes it essential not just for use in sinks and cutlery (where most people will encounter it on a daily basis) but, arguably even more essential, in surgical instruments, heavy machinery and the pipes and ducts out of sight but essential to keeping civilisation working. The trick of how to make stainless steel in large quantities was discovered here in Sheffield by Harry Brearley, and while the laboratories he worked for shut down long ago, the furnace at Marcegaglia, in an industrial park just outside the city, can trace a continuous thread back to him. This furnace used to be owned by British Steel, the nationalised corporation responsible for most of Britain's steel manufacture until the days of privatisation. Ever since the invention of stainless steel, Britain has melted, cast and exported vast quantities of the stuff to America. For all that the US has a sizeable stainless steel sector, the two countries' stainless sectors have nonetheless been industrially interlocked since the days of Henry Ford. You can see it in the way Marcegaglia functions. It melts down scrap in its electric arc furnace in Sheffield - an enormous cauldron whose electrodes create a storm of lightning that consumes the same power as a sizeable northern city - and adds the relevant alloy ingredients to form a long, heavy metallic bar, a billet as it's known. That billet is then shipped across the Atlantic to the company's other site, where the billets are processed into bars that are then sold into the North American market. It is a single economic organism, split only by an ocean. But today that ocean and that cross-country split have become an enormous problem. The last time Donald Trump imposed tariffs on steel imports, back in 2018, so-called \"intermediate\" products like the billet made by Marcegaglia and then processed in America were excluded from the duties. This time around, the initial tariff rules had no such exemptions. The upshot was that any steel arriving in American ports after 12.01am Eastern Standard Time on 12 March - including Marcegaglia's half-finished stainless billets - would incur hefty 25% tariffs. A race against time  All of which was why Liam Bates had raced to get as much steel as possible into the US before that deadline. But as he refreshed his browser in the run-up to that deadline, he noticed two straggling shipments, still stuck on the Atlantic. The two ships, the Eva Marie and the Atlantic Star, were, between them, carrying about $12m of steel and they had been due to dock in the US on 10 or 11 March. If so, they would have avoided having to pay those 25% tariffs. But now storms and squalls were spreading across the North Atlantic. Would they stray into the ships' path, disrupting shipping? If the cargo arrived late, it would obliterate any margin the company hoped to make on its steel. And since those bars were destined for Marcegaglia's own plant, the company would have to pay all those costs itself (tariffs are technically paid by the importer). Somehow, Bates had found himself helplessly witnessing an unexpected collision of politics and weather - with profound commercial consequences. Of all the metal items Britain exports to the US, stainless steel is by far and away the biggest category. And the vast majority of that steel comes from the melt shop at Marcegaglia. But the quandary facing Liam Bates, and those companies he sells to in the US, helps illustrate the difficulties of economic policy-by-tariff. Americans will see cost of most things go up The prevailing theory behind the White House measures is that by raising the price of all imported metals, it will encourage domestic producers to build new production. It will help the US to reindustrialise - or so says Donald Trump. And in the long run, that might well prove right. Already, metals producers are raising money, promising to restart old, mothballed smelters. After all, if your main overseas competitors have seen their prices rise by 25%, that's quite a competitive opportunity. The problem is: building industrial production takes time. Marcegaglia itself is planning to replace its old furnace with a newer model, but the planning process has already taken years; the construction itself will be measured in months if not years too. In other words, even if everything goes to plan, America is very unlikely to replace imported steel with domestic production within the period of Donald Trump's term as president. In the meantime, American consumers will see the cost of pretty much everything going up. After all, steel - ignored or dismissed as it sometimes is - is the single most important metallic substance in the world. If something isn't made of steel it's made in machines made of steel. And lifting some of those steel prices by 25% will travel like an economic tidal wave through US supply chains. UK flooded with cheap imported steel The tidal wave is already washing back elsewhere too. With so much steel now unable to get into the US at a decent price, exporters are redeploying shipments elsewhere. All of a sudden countries like the UK are seeing a flood of cheap imported steel - good news in the short run for consumers, but disastrous for what is left of Britain's domestic industry. As the deadline approached and Bates nervously refreshed his live vessel tracking map, disaster struck. The squalls across the Atlantic mounted and the Eva Marie and Atlantic Star slowed nearly to a halt. By the time midnight struck and the tariffs came into place, the two vessels were still many miles off the US coast. They had lost the race. The upshot was Marcegaglia would have to pay around $4m in tariffs - about £3m. That a company was struck with a somewhat arbitrary fee simply to pass goods from one of its factories to another might be among the most egregious examples of the collateral economic damage wrought by trade barriers, but it is likely to be the first of many perverse episodes, with consequences all around the world. For steel is not the only metal to be hit with tariffs. If anything, the drama is even greater for another metal: aluminium. The world's biggest factory - hidden in Scotland Here's a riddle for you: what is the biggest factory in the world? You're probably thinking of vast, cavernous car production lines in Michigan, of shipyards in Korea or steelworks in China. But there's a strong case to be made that the world's biggest factory is instead to be found deep in the Highlands of Scotland. Not that it looks anything like a factory. To the untrained eye, it looks, instead, like heather, forests and bubbling burns of water trickling into lochs. But the 114,000 acres of estates in Lochaber and Badenoch - the third biggest rural estate in Scotland - play a crucial role in helping produce one of the most important substances in the world. The Fort William aluminium plant sits under the shadow of Ben Nevis, the tallest peak in the United Kingdom. Once upon a time, it was just one of a constellation of smelters dotted around Scotland, that made this country, all told, one of the world's biggest aluminium producers. For all that it is very prevalent in the earth's crust, aluminium used to be one of the world's most precious metals - so much so that no one had even laid eyes on it until the 19th century. When he wanted to impress his guests, Napoleon III served them dinner not on gold plates but on aluminium. An extraordinary metal Why? Because aluminium is very difficult - even harder than iron - to convert from the ores you find in the ground into its metallic form. Burn iron ore hot enough, in the right kind of furnace alongside the right kind of charcoal or coal, and you eventually smelt out a form of metal. But aluminium needs a different kind of force to be persuaded to loosen its bonds and form into a pure metal - the force of electricity. So only when the Hall-Heroult process, which allows you to smelt aluminium via electrolysis of alumina (a processed version of the bauxite you get out of the ground), was invented in 1886 did aluminium become a widely available metal. Few people talk these days about the Hall-Heroult process, but it was a breakthrough of earth-shattering proportions. Aluminium is an extraordinary metal - strong but light. And those qualities make it essential in aeronautic deployments. No aluminium, no planes. It is no coincidence that the Wright Brothers' plane at Kitty Hawk had an engine made out of aluminium. Steel would have weighed the glider down too much. And it's no coincidence that powered flight happened shortly after aluminium became widely available. Without the Hall-Heroult process, the world would have been a very different place. While the process wasn't dreamt up in the UK, British industrialists rapidly embraced it, building smelters all over the country. But the catch with aluminium is that you can't smelt it without a big and (this is important) very reliable supply of power. Turn off the power to those enormous carbon electrodes inside an aluminium smelter and in a matter of hours the metal at its base will solidify, effectively destroying it. More than nearly any other industrial process, this is not something you can just switch off willy-nilly, which helps explain why smelters aren't typically dependent on variable power sources like wind and solar. It also explains why, throughout history, these plants have been seen as some of the most important industrial locations throughout the world. The Fort William plant provided most of the aluminium used in Spitfires during WWII. It was repeatedly targeted by the Luftwaffe - indeed there is an old German bomb kept as a memento just near the turbines that power the cells here. Some of the world's earliest smelters were powered by hydroelectricity - most notably the ones which drew their power from the Niagara Falls plants near Buffalo, New York. But the Fort William plant was subtly but importantly different. Those other hydro plants would typically piggyback off a big dam generating power from a big river - such as the ones you find in the US or Canada, or the fjords of Norway. But none of Britain's rivers is quite powerful enough or with a reliable enough flow to provide that kind of uninterrupted power. Radical design So the designers of the Fort William plant did something radical. They bought up vast stretches of the countryside around Ben Nevis (including Ben Nevis itself). And within that estate, they built a series of dams to collect the rainwater trickling down from local watersheds. Those dams weren't there to generate power for homes - they were there to collect the water and channel it through a series of tunnels, running 16 miles through the hills and through the flanks of Ben Nevis. Then the water, collected from those 114,000 acres, feeds five pipes running down the side of the mountain which run into an enormous hydroelectric power station. There are many aluminium smelters around the world and many hydroelectric dams. But none are quite like this one. The point being that without the estate, without all those trickling streams and heather-covered watersheds, the plant here simply wouldn't function. It is all part of a single ecosystem. These days the plant is connected to the national grid, meaning it also serves another function: balancing. This comes back to one of the dysfunctions of the grid: it doesn't have enough high-voltage lines connecting Scotland, with all its wind farms, and the south. So on windy days, when there's too much power in Scotland, instead of curtailing those farms and wasting the electricity, the plant can suck in extra power from the Scottish section of the grid and leave its water where it is as a sort of battery. Competition from China The problem the plant has faced is that these days aluminium is a commodity metal. And it's becoming harder and harder to compete with the cheap metal being exported from China. China dominates the global supply of the metal, in large part because its suppliers benefit from cheap energy and generous government subsidies - neither of which are available in the UK. As the years have gone by, the workers at Fort William have watched as, one by one, every other plant in Britain was shuttered. Rumours still abound that they may eventually be next. And, much as for Marcegaglia down in Sheffield, the tariffs on aluminium will only make life tougher for Alvance, the unit of Liberty House - part of Indian-born Sanjeev Gupta's business empire - that now owns the Fort William plant. Arguably, the impact could be even greater. The last time Donald Trump imposed tariffs on aluminium back in 2018, the rate he chose was 10%. The difference with the steel tariff level (which was 25% then and now) reflected the fact that the US imported far more aluminium than steel. Imposing severe extra costs on it would, the White House worried, cripple the American aerospace and car businesses dependent on the metal. No such concern this time around. The tariff is 25%. Quite how that will affect the plant here in the Scottish Highlands remains to be seen. After all, Alvance itself doesn't sell anything directly to the US, sending its large slabs of metal to other firms in England which process and roll them into sheets and specialised components, some of which end up in the US. Perhaps, as the defence industry ratchets up in the coming years, more of that aluminium will be used by domestic industry. But what's to stop UK manufacturers doing what they've been doing for years, and simply opting for the cheapest metal available, which usually comes from China? Either way, life for the last remaining aluminium plant in the UK is about to get harder, not easier. But while the main upshot of the trade war building across the Atlantic and the Pacific will be to make both sides worse off - that, at least, is the prediction from the Organisation for Economic Co-operation and Development - that doesn't mean there won't be some beneficiaries in this country. For a small but important example, let's travel from the far north of Britain to its far south. UK has one of its biggest resources in world  Drive across Dartmoor, the windswept national park in the heart of Devon, and every so often you come across the remains of an old tin mine. At Fox Tor you find the remains of alluvial mining; there is Golden Dagger Mine, which ran all the way to the 1930s, as well as the hollow stone chimney of the pumping house at Wheal Betsy. For much of the ancient era, tin - which when mixed with copper creates the alloy bronze - was what we would today call a \"critical mineral\", essential for the production of the strong tools and weapons of the Bronze Age. And for centuries, the majority of Europe's tin came from Cornwall and Devon. That, of course, is long in the past. But just on the outskirts of Dartmoor is a site that could - just could - make this an important site for critical minerals once again. For here, beneath the soil of southwest England, is one of the world's biggest resources of tungsten. Tungsten among few substances on everyone's list Tungsten is among the 21st century's most important critical minerals. Nearly every country has a list of these materials - the kinds of things they need to make their most important products - and the members of those lists vary by region. But tungsten is one of the few substances that feature in everyone's list. The hardest metal in existence, with the highest melting point, it is essential in the production of hard steel tools, weapons, armour and as the electrodes inside semiconductor circuits. If you are making electronics you need tungsten. If you are going to war you need tungsten. Perhaps it's no coincidence that the main heyday for this mine, which contains plenty of tin as well as tungsten, was in the First and Second World Wars. Much as the Fort William plant provided aluminium for British Spitfires, Hemerdon provided the tungsten and tin needed for the weapons Britain used to fight the Nazis. But ever since then, its history has been chequered, to say the least. It went into hibernation for decades, a sleep broken for only a single day during the Korean War. Then, a few years ago, investors tried to get it up and running again. They built a vast processing plant and began to mine the metal. But by 2019 the operation had run out of money and imploded. All that was left was an even bigger hole in the ground, a large tailings dam for waste and a hangar filled with processing equipment. In part, the reason Hemerdon went belly-up that time was because the company made the mistake miners often make: they misjudged the type of ore they were expecting to grind through, meaning their processing plant was far less efficient than it could have been. But an even bigger challenge came back to something that will sound familiar: they were trying to compete with China. China dominates world tungsten production - even more so than for aluminium and steel. It essentially controls the global market and, just as importantly, the tungsten price. Anyone trying to sell tungsten is contending with Chinese prices which can yo-yo for reasons no one can entirely explain. That makes it fiendishly difficult to compete. But in recent years, new investors have begun to put fresh funds into the Hemerdon mine, hoping history will not repeat itself and this time around it can exploit that enormous ore resource. And there are at least a couple of reasons to believe (famous last words in finance) that \"this time might be different\". The first is that, in retaliation against Donald Trump's latest metal tariffs, China has begun to put export limits on tungsten. How this will work in practice remains unclear (remember that like most markets China controls, the way tungsten sales function is almost completely opaque) but if it encourages domestic buyers to look for local suppliers, that could help the mine to find buyers. After all, in theory, it could produce a few thousand tonnes of the metal each year, which would instantly leapfrog Britain to become the world's second or third-biggest producer (albeit a long way down from China). Supplies matter more than ever The second big shift comes back to defence. With the world remilitarising, all of a sudden tungsten supplies matter more than ever. And since defence suppliers pay outsized attention to where metals come from, again, that might allow a British tungsten mine to succeed where predecessors have failed. Add to this the fact that the mine itself is nearly ready to be exploited and that the new owners reckon they've ironed out the problems that beset their predecessors, and it's a compelling case. They think they could be getting metal out of the ground as soon as next year. But those overarching challenges haven't gone away. And nor has another, bigger problem facing the entire industry, not just in the UK but - perhaps even more so - in the US. How can you plan in a world where you just don't know what's coming out of the White House in the next few days, let alone the next few years? Consider: imagine you're a stainless steel producer or an aluminium smelter in the US. Those 25% tariffs mean all of a sudden in theory you have a competitive advantage over anyone shipping metal into the country. All of a sudden, there's a strong case to build a smelter or a stainless steel melting shop. So you get to work looking for backers. Uncertainty creates challenges But building a plant like this takes time. You need to find a site, connect it to high-voltage power, and build the facilities and all the necessary infrastructure. Best case scenario: it might take a couple of years, but even that is ambitious. And as you contemplate this and map out your plans, those backers will ask you the same nagging question you've been asking yourself: sure, the economics of an aluminium smelter might add up today; but what if the president changes his mind tomorrow, or next year? What if those tariffs are pulled by the next president? Then, all of a sudden, the sums very much don't add up. All of which is to say, uncertainty around tariffs is a challenge not just for those companies hoping to ship products to America, but for American firms hoping to benefit from this trade war. And bear in mind metals are only the first chapter of what could be a long saga, which ends up engulfing all corners of American trade. These are unpredictable times, however you look at it."
    },
    {
        "title": "Five jihadists found guilty of holding French journalists hostage",
        "description": "Five jihadists have been found guilty of holding French journalists captive in Syria for the terror group Islamic State.\n",
        "url": "https://news.sky.com/story/five-jihadists-found-guilty-of-holding-french-journalists-hostage-13333290",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mehdi-nemmouche_6863365.jpg?20250321160705",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-03-21 15:59:00",
        "Headline": "During their imprisonment, the four journalists were forced to watch the executions of other captives and endure beatings while surrounded by the screams of fellow detainees.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Five jihadists have been found guilty of holding French journalists captive in Syria for the terror group Islamic State.\n One of the guilty, Mehdi Nemmouche, 39, has been described by the prosecution as \"one of the most perverse and cruel jihadists of the past 10 years\" with a \"total absence of empathy and remorse.\" \"Yes, I was a terrorist, and I will never apologise for it,\" Nemmouche told the court in France hours before the verdict was due, while denying he held the men captive. \"I don't regret a day, an hour, or an act,\" he added. Nemmouche was sentenced to life in prison, and will serve a minimum of 22 years behind bars. Abdelmalek Tanem was given 22 years and Kais Al Abdullah was sentenced to 20 years.Meanwhile, Oussama Atar and Salim Benghalem, who are both referred to as integral figures in the Islamic State's operations and believed to be dead were sentenced to life in absentia. The trial in Paris heard that journalists Didier Francois, Edouard Elias, Nicolas Henin, and Pierre Torres were terrorised during their 10 months in captivity between June 2013 and April 2014. The four spoke of relentless physical and psychological torture at the hands of ISIS. During their imprisonment, they were forced to watch the executions of other captives and endure beatings while surrounded by the screams of fellow detainees.  Nicolas Henin was snatched in the Syrian city of Raqqa with photographer Pierre Torres in 2013. He told Sky News he was just \"taken off the streets\". During his time in captivity, he met American journalist James Foley and British aid worker David Haines, both of whom were later murdered by the notorious British ISIS militants \"the Beatles\". \"We were a total of 24. Nineteen men held in one cell and five women in another one…and the plan was to start everything with an execution,\" he says. He remembers the first person executed on the day they arrived was a Russian man, but the murders would continue. At times, their captors also carried out mock executions, dragging their terrified prisoners out for fake beheadings or leaving them in the boiling sun for hours during mock crucifixions. \"All our captors treated us badly. It is not only about beatings or torture; to keep someone captured in the dark sometimes blindfolded is enough,\" Mr Henin said. Throughout the trial, Nemmouche has always denied being their jailer, but the four former hostages recognised him. Edouard Elias said he remembers him tormenting them for hours with constant chatter and singing French songs. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' Nicolas Henin will never forget his face or his manner. \"[He's] sadistic, narcissistic, and I would say 'gamer' because for him nothing is serious. Everything is a game. He wants to win everything…he plays with the court,\" he said. Nemmouche is already serving a life sentence for the fatal attack on the Jewish Museum in Brussels in May 2014. He carried out the killings for ISIS a few weeks after the French journalists were released. \"This man, who fancies himself intelligent, is devoid of any human sentiment,\" Prosecutor Benjamin Chambre said, describing him as a \"real sociopath\". It's more than a decade since the journalists spent months witnessing and enduring the darkest and cruellest acts of humanity. Asked how he managed to survive, Nicolas Henin paid tribute to his fellow hostages David Haines and James Foley who he says supported him mentally while he was detained. Ahead of the verdict, he called for sentences that reflected the gravity of the crimes inflicted on them. And what of the men who seemingly take joy in inflicting such pain and suffering - are they evil? That's what they need us to believe, he explains. \"It's part of the game of terrorists to terrorise people. They need us to believe that they are not human. \"We have to look for the humanity still in them to prevent ourselves being totally petrified by fear facing them,\" Mr Henin adds, refusing to be cowed. \"I prevent myself from feeling any hatred against them as much as any fear,\" he says."
    },
    {
        "title": "Heathrow Airport reopens for some flights after fire led to 'unprecedented' shutdown",
        "description": "Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers.",
        "url": "https://news.sky.com/story/heathrow-says-it-will-reopen-after-more-than-1000-flights-cancelled-and-200000-passengers-affected-by-shutdown-13332920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250321234610",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 00:42:00",
        "Headline": "The blaze triggered a \"significant power outage\" that resulted in more than 1,000 flights to and from the airport being cancelled.",
        "Content": " Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers. Counter-terror police were leading the investigation into the cause of the blaze, which triggered a \"significant power outage\" that led to more than 1,000 flights to and from the airport being cancelled. Heathrow's boss apologised to passengers, describing the disruption \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". Follow live updates on Heathrow shutdown In an update on Friday evening, the Metropolitan Police said the cause of the fire is believed to be non-suspicious, while the London Fire Brigade (LFB) announced its investigation will focus on the electrical distribution equipment. Heathrow is expected to run a full schedule on Saturday. The fire that caused the power outage is at the North Hyde substation in Hayes, about 1.5 miles to the north of the west London airport. LFB received the first reports of the fire at 11.23pm on Thursday. Heathrow initially announced the airport would be closed until 11.59pm on Friday but later said repatriation flights for passengers diverted to other airports in Europe would resume on Friday evening.  Several airlines announced they would restart scheduled flights both to and from Heathrow, including British Airways (BA), Air Canada and United Airlines. A BA flight to Riyadh, in Saudi Arabia, took off just before 9pm after a slight delay to its expected departure time. Restrictions on overnight flights have also been temporarily lifted to help ease congestion, the Department of Transport said. Read more:What we know so farAnalysis: Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy?  Airport disruption nearly 'as big as it gets' Heathrow Airport's chief executive Thomas Woldbye told reporters the flights taking off on Friday evening would help make sure the airport has \"operations in place\" for Saturday morning. He continued: \"Tomorrow morning we expect to be back in full operation, so 100% operation as a normal day.\" Mr Woldbye added that passengers who were planning to fly from Heathrow on Saturday should arrive at the airport in time for their flight as normal. The chief executive also apologised to the passengers whose journeys had been disrupted but said he would not have closed down the airport unless there were \"severe safety concerns\". Asked whether the disruption caused by the fire suggested there was a \"weak point\" in Heathrow's operations, Mr Woldbye replied: \"We can't guard ourselves 100%. This has been a major incident. \"Short of anybody getting hurt, this is as big as it gets for our airport and we are actually coming back quite fast.\" He added: \"This is unprecedented, it's never happened before.\" It comes after Number 10 said earlier that there are questions to be answered about how the fire has caused so much chaos. Flight delayed or cancelled? What are your rights? Mr Woldbye said: \"Our procedures have worked the way they should... Of course the prime minister should ask questions and we'll be happy to answer them.\" Earlier, the airport said it expected \"significant disruption over the coming days\" and warned passengers \"not travel to the airport under any circumstances until the airport reopens\". All trains to Heathrow were suspended.  Some power has returned to Terminal 4, with lights in the main building and lifts in the multi-storey car park operational again. The disruption began late on Thursday night when fire crews were called to a blaze in west London at an electricity substation serving Heathrow and local properties.  You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material. Thousands of passengers stranded Heathrow is one of the world's busiest airports and had a record 83.9 million passengers last year, with a plane landing or taking off around every 45 seconds. The figure, from the Civil Aviation Authority, is equivalent to about 229,000 passengers using the hub every day. Aviation analytics firm Cirium told the New York Times that it believed as many as 290,000 passengers could have been affected on Friday - enough to fill Wembley Stadium three times. Oil fire still alight at substation LFB deputy commissioner Jonathan Smith told reporters at a news conference the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies have been restored. Earlier LFB said 10 engines and around 70 firefighters had been working to extinguish the blaze. Pictures from the scene showed large flames and plumes of thick black smoke. The LFB said in a statement that 5% of the fire was still alight as of 7pm on Friday."
    },
    {
        "title": "Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected",
        "description": "Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation.",
        "url": "https://news.sky.com/story/heathrow-closure-throws-travel-plans-into-chaos-as-weddings-rugby-tours-and-arctic-circle-trips-affected-13333120",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicolas-francescantonio_6863052.jpg?20250321095110",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 10:39:00",
        "Headline": "Forty-five children were supposed to graduate to their first junior rugby games this weekend after fundraising for a trip to Dublin for a year - now, they don't know if they will even make the matches.",
        "Content": " Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation. Travellers heading to weddings, the Arctic Circle, rugby matches and birthdays have been left scrambling to find alternatives.  Around 1,357 flights have been affected, according to data from Flight Radar. Follow live updates on Heathrow closure Sleeping in the snow Jordan Wylie MBE told Sky News he is sleeping in the snow tonight after his flight home from northern Sweden was cancelled. The adventurer was training for an Antarctic expedition where he will attempt to climb a series of unclimbed and unnamed peaks in aid of the Army Cadets Charity. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 \n                  Heathrow closure: Sir Keir Starmer receiving 'regular updates'\n                 However, his training has been extended by one more day because of the Heathrow chaos and he will sleep in his tent again. Read more: What are your rights if your flight is delayed or cancelled? He will now have to fly \"from Northern Sweden to Stockholm to Frankfurt to Heathrow but not for at least 24 hours\", according to representatives he's spoken to from Scandinavia Airlines (SAS). Long-awaited best friend's wedding One woman in Minneapolis said her husband would miss his best friend's wedding after their flight was turned around over the Atlantic Ocean. \"This wedding is a huge deal because it got postponed due to Covid, then their toddler got leukaemia,\" she said. \"Now the wedding is finally happening. We are so gutted,\" she said, adding it was the family's first international flight. \"We are back in our car in Minneapolis heading home at 2.40am with our toddlers wide awake in the back seat wondering why we aren't in London.\" \"Absolute shambles\" says passenger heading back for new job Lloyd Mcbratney described \"panic and confusion\" on his flight from Kuwait to Heathrow when the plane \"suddenly U-turned without explanation\". He and his girlfriend were travelling back from a trip to the Philippines but are now waiting at an airport hotel in Kuwait. \"We have no idea when we will be going back home, 0 guidance, 0 communication,\" he told Sky News. To make matters worse, Mr Mcbratney starts a new job on Monday. \"Absolute shambles,\" he said. Rugby juniors missing out on 'trip of a lifetime' Alex Wiffen says the London Irish Under 12s rugby team have had the \"trip of a lifetime\" to Dublin thrown into disarray. Forty-five girls and boys were supposed to graduate from minis to their first junior rugby games this weekend after fundraising for the trip for a year, he said. \"It's a trip that's been happening for 40 years and it's the inaugural trip for the girls' team,\" says Alex. \"Our flights at 8am this morning were cancelled and now there is no way to get to Dublin.\" The players and 70 parents are now just \"praying we can get there ASAP\" before their first match against Clontarf Rugby Club tomorrow morning. Stuck at Manchester airport  Nigel and Pam Turner have been diverted into Manchester Airport from Heathrow after they flew out from Dubai. They were expecting to land at Heathrow at 7am - but are now stuck waiting in Manchester Airport until 7pm for an onward flight to Guernsey, which they paid for themselves. The couple said they only found out what had happened while they were in the air - when they saw the couple in front had the news on their screens, and realised there had been a fire affecting Heathrow. It wasn't until the plane was over the English Channel they found out they would actually be landing in Manchester. Speaking from a coffee shop at T2 arrivals, they said they were in good spirits, but hoping to find somewhere comfortable to wait out the nine hours before their flight out. \"C'est la vie\" Nigel said. \"Nothing we can do about it\".  Husky-sledding in the Arctic Circle John Climpson said he was up at 3am to fly out to the north of Sweden to start a 240km husky sledding challenge in the Arctic Circle. \"Now the whole trip might be cancelled,\" he said. \"Everyone is now desperately trying to rebook hotel rooms at the Terminal 2 Premier Inn.\"  Confusion in Shanghai A family of four coming home from a two-week tour of China said they found out their flight home was \"delayed\" at check-in at Shanghai airport. After travelling from Beijing to Xi'an and Shanghai, Sohan Shah and his family, from Croydon, found confusing scenes at the airport. \"Due to the language barrier staff could not explain to us why, until we saw the Sky News report explaining the Heathrow fire,\" said Mr Shah. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' \"[The airport staff] kept sending us back and forth to different counters where we have now been rebooked to a flight to London Gatwick at 1.30 in the morning,\" he told Sky News.\"They eventually put us in a coach to a local hotel and provided food vouchers for the night,\" he said. From Derby to DC for 50th birthday Virgin Atlantic passenger Andy was supposed to be flying from Heathrow to Washington DC today to start his 50th birthday celebrations.  Instead, he is stuck in a hotel room he booked for last night to break up the travel day. \"I live in Derby - and I'm unsure whether to stay in London or go home and wait to hear more,\" he said. Heathrow has cancelled all flights until midnight on Friday. U-turn to the US Rafa, from London, was on a flight from Dallas when the pilot U-turned at 4am. \"Cannot believe that Heathrow, one of the world's busiest and best airports, is not running on some sort of independent power to carry on operations,\" he said. \"And the decision made to turn around to America is crazy considering how many flight options [there] are from Germany and France back to the UK.\" He added: \"Nightmare on all accounts.\" Anniversary celebrations delayed Carly and Mel were due to fly to Bali with Singapore Airlines this morning for their seven-year anniversary before finding out what had happened at 5.20am. After working out their options, they managed to book a flight from Charles de Gaulle in Paris to Singapore. They then headed to Victoria Coach station before overnight travel to the French capital. From there, they'll make their way to Denpasar in Indonesia before another connecting flight will take them to Labuan Bajo and then to the island of Komodo. \"By the time we arrive, we will have had to take a train, coach, another train and three flights, but thanks to our own tenacity and the help of Singapore Airlines we will at least make it!\""
    },
    {
        "title": "Heathrow shutdown is embarrassing at best - but at worst it points to serious vulnerabilities in UK infrastructure",
        "description": "An electrical substation fire and an entire airport shut down - with over 1,000 flights cancelled, others rerouted worldwide, and 200,000 passengers affected by the disruption.",
        "url": "https://news.sky.com/story/heathrow-shutdown-is-embarrassing-at-best-but-at-worst-it-points-to-serious-vulnerabilities-in-uk-infrastructure-13333252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-infrastructure-uk-heathrow_6863340.png?20250321154240",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-03-21 14:48:00",
        "Headline": "As one of the busiest travel hubs in the world, Heathrow is considered a part of the UK's critical national infrastructure. The power failure and the chaos that ensued on Friday exposed that system's overall vulnerability.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  An electrical substation fire and an entire airport shut down - with over 1,000 flights cancelled, others rerouted worldwide, and 200,000 passengers affected by the disruption. The Heathrow closure on Friday really highlights the 'critical' part of critical national infrastructure (CNI) - the systems and facilities that are essential for society to function. At best it's an embarrassment. At worst, it points to serious vulnerabilities across the country that could be exploited by bad actors. Heathrow first. Heathrow needs a lot of power, the equivalent of a small town, and the bulk of this is supplied by a dedicated connection at the North Hyde substation - reflecting Heathrow’s critical status. But that also appears to be the problem - because Heathrow requires so much power, having a second dedicated connection would likely be prohibitively expensive, especially for the low probability scenario of such a catastrophic fire. This is the first time this has happened in decades, after all. \"Fires like this are not common at all,\" said Dr Robin Preece, a reader in future power systems at the University of Manchester. \"If it just broke down without catching fire… you might never have noticed anything as we have sufficient alternative routes for the electricity to follow.\" But uncommon doesn't mean impossible - and when infrastructure is critical, it's supposed to be protected. MI5 in charge of critical infrastructure protection The organisation ultimately responsible is MI5, through the National Protective Security Authority. This lists 13 national infrastructure sectors, from chemicals to nuclear, emergency services to food, space to water. It's a lot to look after - this map shows just some of the sites that would be considered CNI. Airports and power stations. Or the tubes that supply us with energy (gas and fuel pipelines) and internet (undersea cables). Many of those risks are collected in the National Risk Register. This plots the likelihood and the impact of a risk. Measuring risk chances and impact So an accidental fire or explosion at an onshore fuel pipeline is estimated to have less than a 0.2% chance of happening in the next two years but would have only a \"moderate\" impact, defined as between 41-200 casualties and/or hundreds of millions of pounds in economic losses. A civil nuclear accident has a similar probability but would have a \"catastrophic\" impact, defined as the loss of more than 1,000 lives and/or an economic cost of tens of billions of pounds. Pandemics also meet the catastrophic impact threshold. A regional failure of the electricity network, one due perhaps to \"a specific power substation\", is listed as having a 1% to 5% chance of happening every two years, and a moderate impact. But this is what happened to Heathrow - and the impact doesn’t appear moderate at all. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:How Heathrow closure ruined travel plansWhat we know about shutdown as flights grounded Catalogue of vulnerabilities The National Risk Register is sensible planning but it's also a catalogue of vulnerabilities. Accidents do happen, but so do attacks. It can be hard to tell the difference - and that's the point of what are known as \"grey zone\" attacks. For example, undersea cables keep unfortunately being cut, whether in the Baltic Sea or the waters around Taiwan. Taiwan has accused China of doing this deliberately. China responded by saying that damage to undersea cables is a \"common maritime accident\". \"Malicious actors see opportunities and vulnerabilities\", Marco Wyss, Professor of International History and Security at Lancaster University, told Sky News. \"And if you showcase vulnerabilities to such an extent as today, even if it wasn't a malicious actor, it can give them some ideas.\" Additional reporting by Sophia Massam, junior digital investigations journalist "
    },
    {
        "title": "Harshita Brella: Police get disciplinary notices over case of woman found dead in car boot",
        "description": "Four police have been given disciplinary notices over alleged failings in handling a domestic abuse report by a woman later found dead in a car boot.",
        "url": "https://news.sky.com/story/harshita-brella-police-get-disciplinary-notices-over-case-of-woman-found-dead-in-car-boot-13333540",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-harshita-brella-corby_6750040.jpg?20241116210007",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 23:58:00",
        "Headline": "The police watchdog is looking at how officers dealt with the domestic violence report - as the suspect in the case remains at large.",
        "Content": "Four police have been given disciplinary notices over alleged failings in handling a domestic abuse report by a woman later found dead in a car boot. Harshita Brella, 24, was found in a Vauxhall Corsa in Ilford, east London, on 14 November. Her husband, Pankaj Lamba, is the target of an international manhunt and earlier this week was charged with her murder, rape and other offences. Indian police have also arrested Lamba's parents and believe Ms Brella's death is connected to a dispute over a dowry. The couple lived in Corby, Northamptonshire, and Ms Brella made a domestic abuse report at the end of August. Lamba, 23, was arrested on 3 September but was released on bail, with a court granting a domestic violence protection order. Officers from Northamptonshire Police have now been served with disciplinary notices by the Independent Office for Police Conduct (IOPC) Two detective constables are being investigated over potential gross misconduct. The IOPC said it was over \"alleged failings to progress inquiries and communicate with Ms Brella\" after she made her domestic abuse complaint. Two more senior officers have been served with misconduct notices over their \"supervision of the case and relevant risk assessments\". The IOPC said it was still gathering and assessing evidence and it does not automatically mean disciplinary proceedings will follow. Read more from Sky News:Heathrow reopens for some flightsAndrew Tate leaves US to return to Romania Lamba and Ms Brella had an arranged marriage and moved to the UK in April 2024, just seven months before she was killed. A neighbour in Corby described hearing two blistering rows, involving one where a woman \"sounded scared\", days before her body was found. The victim's family believe Lamba was on a flight to Delhi that arrived on 12 November. Ms Brella's sister, Sonia Davas, told Sky News she believes he could be \"somewhere in Haryana or near Chandigarh\", states in northern India."
    },
    {
        "title": "Murder arrest after woman in her 40s dies in Clacton",
        "description": "A man has been arrested on suspicion of murder over the death of a woman in her 40s in Essex.",
        "url": "https://news.sky.com/story/murder-arrest-after-woman-in-her-40s-dies-in-clacton-13333492",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-clacton-police_6863662.jpg?20250321215334",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:32:00",
        "Headline": "A man in his 20s has been arrested on suspicion of murder after police were called to a property on Skelmersdale Road in the Essex seaside town on Friday morning.",
        "Content": "A man has been arrested on suspicion of murder over the death of a woman in her 40s in Essex. Police said the suspect in his 20s has been taken to hospital in a serious condition. Officers were called to a property on Skelmersdale Road in the seaside town at 11:30am on Friday. Essex Police said officers attended with ambulance crews and an air ambulance but the woman died at the scene. The force added that it was not looking for anyone else in connection with the incident. Detective Chief Inspector Rob Huddleston said: \"We know how concerning this incident will be to the local community and I can assure you that we are working diligently to understand exactly what happened. \"Our officers were on the scene within five minutes of the call coming into to us and worked with our colleagues from the ambulance service to try and help the woman.\" Read more from Sky News:Man 'with horror fixation' dismembered housematePrince William joins UK troops in Challenger 2 tanksTrump announces 'most lethal aircraft ever built' Witnesses or anyone with footage of the incident is urged to come forward."
    },
    {
        "title": "How Donald Trump's tariffs are wreaking chaos in the British metal industry",
        "description": "As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-are-wreaking-chaos-in-the-british-metal-industry-13331951",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariff-ed-conway_6862428.jpg?20250320174408",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-03-21 04:00:00",
        "Headline": "Producers have been in a race against time, fighting weather and a changeable political climate to avoid paying millions in import fees.  ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser. Over the preceding weeks, Marcegaglia, the stainless steel company whose long products division he headed up, had rushed to melt and ship as much metal as it could from its furnaces in Sheffield across to the east coast of America, ahead of the imposition of tariffs. UK and US industrially interlocked Of all the varieties of steel, stainless steel - an alloy of iron and chrome, along with other elements like nickel, molybdenum and carbon - is among the most important. Unlike most other iron alloys, which can rust when they encounter oxygen, stainless steel has a passive film that protects it from corrosion and can even self-heal. That makes it essential not just for use in sinks and cutlery (where most people will encounter it on a daily basis) but, arguably even more essential, in surgical instruments, heavy machinery and the pipes and ducts out of sight but essential to keeping civilisation working. The trick of how to make stainless steel in large quantities was discovered here in Sheffield by Harry Brearley, and while the laboratories he worked for shut down long ago, the furnace at Marcegaglia, in an industrial park just outside the city, can trace a continuous thread back to him. This furnace used to be owned by British Steel, the nationalised corporation responsible for most of Britain's steel manufacture until the days of privatisation. Ever since the invention of stainless steel, Britain has melted, cast and exported vast quantities of the stuff to America. For all that the US has a sizeable stainless steel sector, the two countries' stainless sectors have nonetheless been industrially interlocked since the days of Henry Ford. You can see it in the way Marcegaglia functions. It melts down scrap in its electric arc furnace in Sheffield - an enormous cauldron whose electrodes create a storm of lightning that consumes the same power as a sizeable northern city - and adds the relevant alloy ingredients to form a long, heavy metallic bar, a billet as it's known. That billet is then shipped across the Atlantic to the company's other site, where the billets are processed into bars that are then sold into the North American market. It is a single economic organism, split only by an ocean. But today that ocean and that cross-country split have become an enormous problem. The last time Donald Trump imposed tariffs on steel imports, back in 2018, so-called \"intermediate\" products like the billet made by Marcegaglia and then processed in America were excluded from the duties. This time around, the initial tariff rules had no such exemptions. The upshot was that any steel arriving in American ports after 12.01am Eastern Standard Time on 12 March - including Marcegaglia's half-finished stainless billets - would incur hefty 25% tariffs. A race against time  All of which was why Liam Bates had raced to get as much steel as possible into the US before that deadline. But as he refreshed his browser in the run-up to that deadline, he noticed two straggling shipments, still stuck on the Atlantic. The two ships, the Eva Marie and the Atlantic Star, were, between them, carrying about $12m of steel and they had been due to dock in the US on 10 or 11 March. If so, they would have avoided having to pay those 25% tariffs. But now storms and squalls were spreading across the North Atlantic. Would they stray into the ships' path, disrupting shipping? If the cargo arrived late, it would obliterate any margin the company hoped to make on its steel. And since those bars were destined for Marcegaglia's own plant, the company would have to pay all those costs itself (tariffs are technically paid by the importer). Somehow, Bates had found himself helplessly witnessing an unexpected collision of politics and weather - with profound commercial consequences. Of all the metal items Britain exports to the US, stainless steel is by far and away the biggest category. And the vast majority of that steel comes from the melt shop at Marcegaglia. But the quandary facing Liam Bates, and those companies he sells to in the US, helps illustrate the difficulties of economic policy-by-tariff. Americans will see cost of most things go up The prevailing theory behind the White House measures is that by raising the price of all imported metals, it will encourage domestic producers to build new production. It will help the US to reindustrialise - or so says Donald Trump. And in the long run, that might well prove right. Already, metals producers are raising money, promising to restart old, mothballed smelters. After all, if your main overseas competitors have seen their prices rise by 25%, that's quite a competitive opportunity. The problem is: building industrial production takes time. Marcegaglia itself is planning to replace its old furnace with a newer model, but the planning process has already taken years; the construction itself will be measured in months if not years too. In other words, even if everything goes to plan, America is very unlikely to replace imported steel with domestic production within the period of Donald Trump's term as president. In the meantime, American consumers will see the cost of pretty much everything going up. After all, steel - ignored or dismissed as it sometimes is - is the single most important metallic substance in the world. If something isn't made of steel it's made in machines made of steel. And lifting some of those steel prices by 25% will travel like an economic tidal wave through US supply chains. UK flooded with cheap imported steel The tidal wave is already washing back elsewhere too. With so much steel now unable to get into the US at a decent price, exporters are redeploying shipments elsewhere. All of a sudden countries like the UK are seeing a flood of cheap imported steel - good news in the short run for consumers, but disastrous for what is left of Britain's domestic industry. As the deadline approached and Bates nervously refreshed his live vessel tracking map, disaster struck. The squalls across the Atlantic mounted and the Eva Marie and Atlantic Star slowed nearly to a halt. By the time midnight struck and the tariffs came into place, the two vessels were still many miles off the US coast. They had lost the race. The upshot was Marcegaglia would have to pay around $4m in tariffs - about £3m. That a company was struck with a somewhat arbitrary fee simply to pass goods from one of its factories to another might be among the most egregious examples of the collateral economic damage wrought by trade barriers, but it is likely to be the first of many perverse episodes, with consequences all around the world. For steel is not the only metal to be hit with tariffs. If anything, the drama is even greater for another metal: aluminium. The world's biggest factory - hidden in Scotland Here's a riddle for you: what is the biggest factory in the world? You're probably thinking of vast, cavernous car production lines in Michigan, of shipyards in Korea or steelworks in China. But there's a strong case to be made that the world's biggest factory is instead to be found deep in the Highlands of Scotland. Not that it looks anything like a factory. To the untrained eye, it looks, instead, like heather, forests and bubbling burns of water trickling into lochs. But the 114,000 acres of estates in Lochaber and Badenoch - the third biggest rural estate in Scotland - play a crucial role in helping produce one of the most important substances in the world. The Fort William aluminium plant sits under the shadow of Ben Nevis, the tallest peak in the United Kingdom. Once upon a time, it was just one of a constellation of smelters dotted around Scotland, that made this country, all told, one of the world's biggest aluminium producers. For all that it is very prevalent in the earth's crust, aluminium used to be one of the world's most precious metals - so much so that no one had even laid eyes on it until the 19th century. When he wanted to impress his guests, Napoleon III served them dinner not on gold plates but on aluminium. An extraordinary metal Why? Because aluminium is very difficult - even harder than iron - to convert from the ores you find in the ground into its metallic form. Burn iron ore hot enough, in the right kind of furnace alongside the right kind of charcoal or coal, and you eventually smelt out a form of metal. But aluminium needs a different kind of force to be persuaded to loosen its bonds and form into a pure metal - the force of electricity. So only when the Hall-Heroult process, which allows you to smelt aluminium via electrolysis of alumina (a processed version of the bauxite you get out of the ground), was invented in 1886 did aluminium become a widely available metal. Few people talk these days about the Hall-Heroult process, but it was a breakthrough of earth-shattering proportions. Aluminium is an extraordinary metal - strong but light. And those qualities make it essential in aeronautic deployments. No aluminium, no planes. It is no coincidence that the Wright Brothers' plane at Kitty Hawk had an engine made out of aluminium. Steel would have weighed the glider down too much. And it's no coincidence that powered flight happened shortly after aluminium became widely available. Without the Hall-Heroult process, the world would have been a very different place. While the process wasn't dreamt up in the UK, British industrialists rapidly embraced it, building smelters all over the country. But the catch with aluminium is that you can't smelt it without a big and (this is important) very reliable supply of power. Turn off the power to those enormous carbon electrodes inside an aluminium smelter and in a matter of hours the metal at its base will solidify, effectively destroying it. More than nearly any other industrial process, this is not something you can just switch off willy-nilly, which helps explain why smelters aren't typically dependent on variable power sources like wind and solar. It also explains why, throughout history, these plants have been seen as some of the most important industrial locations throughout the world. The Fort William plant provided most of the aluminium used in Spitfires during WWII. It was repeatedly targeted by the Luftwaffe - indeed there is an old German bomb kept as a memento just near the turbines that power the cells here. Some of the world's earliest smelters were powered by hydroelectricity - most notably the ones which drew their power from the Niagara Falls plants near Buffalo, New York. But the Fort William plant was subtly but importantly different. Those other hydro plants would typically piggyback off a big dam generating power from a big river - such as the ones you find in the US or Canada, or the fjords of Norway. But none of Britain's rivers is quite powerful enough or with a reliable enough flow to provide that kind of uninterrupted power. Radical design So the designers of the Fort William plant did something radical. They bought up vast stretches of the countryside around Ben Nevis (including Ben Nevis itself). And within that estate, they built a series of dams to collect the rainwater trickling down from local watersheds. Those dams weren't there to generate power for homes - they were there to collect the water and channel it through a series of tunnels, running 16 miles through the hills and through the flanks of Ben Nevis. Then the water, collected from those 114,000 acres, feeds five pipes running down the side of the mountain which run into an enormous hydroelectric power station. There are many aluminium smelters around the world and many hydroelectric dams. But none are quite like this one. The point being that without the estate, without all those trickling streams and heather-covered watersheds, the plant here simply wouldn't function. It is all part of a single ecosystem. These days the plant is connected to the national grid, meaning it also serves another function: balancing. This comes back to one of the dysfunctions of the grid: it doesn't have enough high-voltage lines connecting Scotland, with all its wind farms, and the south. So on windy days, when there's too much power in Scotland, instead of curtailing those farms and wasting the electricity, the plant can suck in extra power from the Scottish section of the grid and leave its water where it is as a sort of battery. Competition from China The problem the plant has faced is that these days aluminium is a commodity metal. And it's becoming harder and harder to compete with the cheap metal being exported from China. China dominates the global supply of the metal, in large part because its suppliers benefit from cheap energy and generous government subsidies - neither of which are available in the UK. As the years have gone by, the workers at Fort William have watched as, one by one, every other plant in Britain was shuttered. Rumours still abound that they may eventually be next. And, much as for Marcegaglia down in Sheffield, the tariffs on aluminium will only make life tougher for Alvance, the unit of Liberty House - part of Indian-born Sanjeev Gupta's business empire - that now owns the Fort William plant. Arguably, the impact could be even greater. The last time Donald Trump imposed tariffs on aluminium back in 2018, the rate he chose was 10%. The difference with the steel tariff level (which was 25% then and now) reflected the fact that the US imported far more aluminium than steel. Imposing severe extra costs on it would, the White House worried, cripple the American aerospace and car businesses dependent on the metal. No such concern this time around. The tariff is 25%. Quite how that will affect the plant here in the Scottish Highlands remains to be seen. After all, Alvance itself doesn't sell anything directly to the US, sending its large slabs of metal to other firms in England which process and roll them into sheets and specialised components, some of which end up in the US. Perhaps, as the defence industry ratchets up in the coming years, more of that aluminium will be used by domestic industry. But what's to stop UK manufacturers doing what they've been doing for years, and simply opting for the cheapest metal available, which usually comes from China? Either way, life for the last remaining aluminium plant in the UK is about to get harder, not easier. But while the main upshot of the trade war building across the Atlantic and the Pacific will be to make both sides worse off - that, at least, is the prediction from the Organisation for Economic Co-operation and Development - that doesn't mean there won't be some beneficiaries in this country. For a small but important example, let's travel from the far north of Britain to its far south. UK has one of its biggest resources in world  Drive across Dartmoor, the windswept national park in the heart of Devon, and every so often you come across the remains of an old tin mine. At Fox Tor you find the remains of alluvial mining; there is Golden Dagger Mine, which ran all the way to the 1930s, as well as the hollow stone chimney of the pumping house at Wheal Betsy. For much of the ancient era, tin - which when mixed with copper creates the alloy bronze - was what we would today call a \"critical mineral\", essential for the production of the strong tools and weapons of the Bronze Age. And for centuries, the majority of Europe's tin came from Cornwall and Devon. That, of course, is long in the past. But just on the outskirts of Dartmoor is a site that could - just could - make this an important site for critical minerals once again. For here, beneath the soil of southwest England, is one of the world's biggest resources of tungsten. Tungsten among few substances on everyone's list Tungsten is among the 21st century's most important critical minerals. Nearly every country has a list of these materials - the kinds of things they need to make their most important products - and the members of those lists vary by region. But tungsten is one of the few substances that feature in everyone's list. The hardest metal in existence, with the highest melting point, it is essential in the production of hard steel tools, weapons, armour and as the electrodes inside semiconductor circuits. If you are making electronics you need tungsten. If you are going to war you need tungsten. Perhaps it's no coincidence that the main heyday for this mine, which contains plenty of tin as well as tungsten, was in the First and Second World Wars. Much as the Fort William plant provided aluminium for British Spitfires, Hemerdon provided the tungsten and tin needed for the weapons Britain used to fight the Nazis. But ever since then, its history has been chequered, to say the least. It went into hibernation for decades, a sleep broken for only a single day during the Korean War. Then, a few years ago, investors tried to get it up and running again. They built a vast processing plant and began to mine the metal. But by 2019 the operation had run out of money and imploded. All that was left was an even bigger hole in the ground, a large tailings dam for waste and a hangar filled with processing equipment. In part, the reason Hemerdon went belly-up that time was because the company made the mistake miners often make: they misjudged the type of ore they were expecting to grind through, meaning their processing plant was far less efficient than it could have been. But an even bigger challenge came back to something that will sound familiar: they were trying to compete with China. China dominates world tungsten production - even more so than for aluminium and steel. It essentially controls the global market and, just as importantly, the tungsten price. Anyone trying to sell tungsten is contending with Chinese prices which can yo-yo for reasons no one can entirely explain. That makes it fiendishly difficult to compete. But in recent years, new investors have begun to put fresh funds into the Hemerdon mine, hoping history will not repeat itself and this time around it can exploit that enormous ore resource. And there are at least a couple of reasons to believe (famous last words in finance) that \"this time might be different\". The first is that, in retaliation against Donald Trump's latest metal tariffs, China has begun to put export limits on tungsten. How this will work in practice remains unclear (remember that like most markets China controls, the way tungsten sales function is almost completely opaque) but if it encourages domestic buyers to look for local suppliers, that could help the mine to find buyers. After all, in theory, it could produce a few thousand tonnes of the metal each year, which would instantly leapfrog Britain to become the world's second or third-biggest producer (albeit a long way down from China). Supplies matter more than ever The second big shift comes back to defence. With the world remilitarising, all of a sudden tungsten supplies matter more than ever. And since defence suppliers pay outsized attention to where metals come from, again, that might allow a British tungsten mine to succeed where predecessors have failed. Add to this the fact that the mine itself is nearly ready to be exploited and that the new owners reckon they've ironed out the problems that beset their predecessors, and it's a compelling case. They think they could be getting metal out of the ground as soon as next year. But those overarching challenges haven't gone away. And nor has another, bigger problem facing the entire industry, not just in the UK but - perhaps even more so - in the US. How can you plan in a world where you just don't know what's coming out of the White House in the next few days, let alone the next few years? Consider: imagine you're a stainless steel producer or an aluminium smelter in the US. Those 25% tariffs mean all of a sudden in theory you have a competitive advantage over anyone shipping metal into the country. All of a sudden, there's a strong case to build a smelter or a stainless steel melting shop. So you get to work looking for backers. Uncertainty creates challenges But building a plant like this takes time. You need to find a site, connect it to high-voltage power, and build the facilities and all the necessary infrastructure. Best case scenario: it might take a couple of years, but even that is ambitious. And as you contemplate this and map out your plans, those backers will ask you the same nagging question you've been asking yourself: sure, the economics of an aluminium smelter might add up today; but what if the president changes his mind tomorrow, or next year? What if those tariffs are pulled by the next president? Then, all of a sudden, the sums very much don't add up. All of which is to say, uncertainty around tariffs is a challenge not just for those companies hoping to ship products to America, but for American firms hoping to benefit from this trade war. And bear in mind metals are only the first chapter of what could be a long saga, which ends up engulfing all corners of American trade. These are unpredictable times, however you look at it."
    },
    {
        "title": "Man who took pressure cooker bomb into hospital jailed for life",
        "description": "A man who took a viable pressure cooker bomb into a hospital in Leeds intending to \"kill as many nurses as possible\" has been jailed for life.",
        "url": "https://news.sky.com/story/man-who-took-pressure-cooker-bomb-into-hospital-jailed-for-life-13333247",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farooq-cps_6863329.jpg?20250321162645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 14:34:00",
        "Headline": "Farooq, who was a trainee nurse, was found guilty after his trial last year of attempting to launch an Islamic State-inspired suicide attack using a homemade bomb on the hospital where he worked in 2023.",
        "Content": "A man who took a viable pressure cooker bomb into a hospital in Leeds intending to \"kill as many nurses as possible\" has been jailed for life. Mohammad Farooq was sentenced to a minimum term of 37 years at Sheffield Crown Court on Friday. Farooq, who was a trainee nurse, was found guilty after his trial last year of attempting to launch an Islamic State-inspired suicide attack using a homemade bomb on the hospital where he worked in 2023. He was also jailed for plotting to attack RAF Mentwith Hill in North Yorkshire. Sentencing Farooq, Mrs Justice Cheema-Grubb praised the actions of Nathan Newby, the patient who talked him out of exploding his homemade device. The device would have been twice as powerful as those used by the 2013 Boston Marathon bombers. The judge said: \"He's an extraordinary, ordinary man whose decency and kindness on 20 January 2023 prevented an atrocity in a maternity wing of a major British hospital.\" \n                  Thief who drove off as Amazon driver tried to hold on to van found guilty of his murder\n                 \n                  Authorities' involvement with family - which sparked Leeds riot - 'was never about discrimination', judge says\n                 \n                  Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea\n                 She said Mr Newby is a \"modest and gentle man whose evidence was among the most remarkable this court has ever heard\". The jury heard how the clinical support worker was inspired by Islamic State propaganda to procure weapons and manufacture an explosive device in readiness for an attack. Farooq was arrested outside the maternity ward of St James's Hospital after revealing a gun and saying that he \"felt like killing everyone\". Police arrived and discovered the bomb. A semi-automatic pistol, discovered to be an imitation, was found nearby. Farooq's car contained a floorplan of four different hospital wards, nails, a knife and five plastic tubs containing a low explosive mixture. 'Plan B' Farooq originally intended to target the military base, with the hospital being his \"Plan B\" after he failed to get in to the base due to high security. Online searches of RAF Menwith Hill were also made by Farooq and location data extracted from his phone revealed he was in the vicinity of the base on two occasions. He denied this was for any terrorist purpose but prosecutors proved his interest went beyond internet research. Read more:Man guilty of murdering pensionerTommy Robinson loses court bid Bethan David, head of the Crown Prosecution Service Counter Terrorism Division, said: \"Farooq is an extremely dangerous individual who amassed a significant amount of practical and theoretical information that enabled him to produce a viable explosive device.\" \"He then took that homemade explosive device to a hospital where he worked with the intention to cause serious harm. Examination of his electronic devices revealed a hatred towards his colleagues at work and those he considered non-believers. \"It is clear from his internet searches that he was also conducting extensive research of RAF Menwith Hill, with a view to launching a potential attack.\""
    },
    {
        "title": "Boys aged 13, 14 and 15 charged with rape of girl",
        "description": "Three teenage boys have been charged with rape of a girl under the age of 16, police have said.",
        "url": "https://news.sky.com/story/boys-aged-13-14-and-15-charged-with-rape-of-girl-13333263",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-greater-manchester-police_6452285.jpg?20240211180008",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 15:12:00",
        "Headline": "Police have said the girl is continuing to be supported by specially-trained officers more than a year after the attack.",
        "Content": "Three teenage boys have been charged with rape of a girl under the age of 16, police have said. The incident happened on 10 February last year in Newbold, Rochdale, according to Greater Manchester Police. The force said each of the boys, aged 13,14 and 15, have been charged with one count of rape of a female under 16. Additionally, they have all been jointly charged with two further counts of rape of a female under 16. The boys, who cannot be named for legal reasons, are due to appear at Manchester Youth Court on Monday. A fourth boy, who was arrested in connection with the case, has been released without charge. The victim is continuing to be supported by specially-trained officers more than a year after the attack. Read more from Sky News:How Heathrow closure ruined travel plansIsraeli PM tries to sack Shin Bet chiefStephen Lawrence killer 'admits role in attack' Detective Superintendent Phil Key said: \"This investigation has seen extensive and thorough work reviewing all available evidence in this case. We are now in a position to charge three boys following the incident last year. \"We continue to provide support to the victim and her wellbeing has been a priority for us over the last 12 months. \"I would remind the public not to speculate on names of those they believe to be involved, as those under 18 have a legal right to anonymity and in speculating over names, this poses a risk to justice, and criminal proceedings can and may be brought against those naming.\""
    },
    {
        "title": "Man found guilty of murdering pensioner - whose dismembered body was scattered across Manchester",
        "description": "A man with a \"fixation\" for horror and gore has been found guilty of murdering his housemate and sawing him into 27 pieces.",
        "url": "https://news.sky.com/story/man-found-guilty-of-murdering-pensioner-whose-dismembered-body-was-scattered-across-manchester-13332122",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marcin-majerkiewicz_6863151.jpg?20250321114743",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-21 10:00:00",
        "Headline": "A jury heard the pensioner's body was cut into 27 pieces using a hacksaw and the parts were dumped in multiple locations.",
        "Content": " A man with a \"fixation\" for horror and gore has been found guilty of murdering his housemate and sawing him into 27 pieces. Warning: Some readers may find content distressing Marcin Majerkiewicz killed 67-year-old Stuart Everett with a hammer before dismembering him using a hacksaw at their home in Winton, Salford, overnight between 27 and 28 March 2024, Manchester Crown Court heard. Majerkiewicz, 42, flayed off Mr Everett's face before carrying his body parts on several bus journeys across Salford and Greater Manchester to dump the evidence. Police were only alerted when they found the victim's torso in Kersal Dale nature reserve in Salford on 4 April. Officers scoured CCTV footage from the site and saw a man going into a wooded area of the reserve with a heavy blue bag - emerging soon after without it. Three weeks later, an officer working on the case drove past Majerkiewicz by chance - realising he looked like the suspect from CCTV. When police arrested him and searched the address, where Majerkiewicz had moved to in 2017, they found heavy bloodstaining in his bedroom - suggesting he had attacked his victim there. Only third of victim's body recovered Other remains were found across five nature sites including Linnyshaw Colliery Woods, Blackleach Reservoir, Worsley Woods, and Boggart Hole Clough. Only a third of his body has been recovered. There were a total of 15 crime scenes, including one on the side of the canal near the men's home. Only 30% of Mr Everett's body was recovered - with the rest unlikely to ever be found, police said. On Friday, jurors took less than two hours to convict Majerkiewicz, who was born in the UK to Polish parents and grew up in Derby. He denied the murder but offered no evidence to support his plea during the three-week trial. Read more from Sky News:Tommy Robinson loses appeal against segregationMan arrested after life-threatening chemicals foundHeathrow closed due to fire at electricity substation 'No clear motive' Speaking after the case, Greater Manchester Police's (GMP) Detective Superintendent Lewis Hewis said: \"Marjerkiewicz does have a fixation with horror and gore as we know from his search history, the videos he watches, his tattoos. \"We don't know why he removed the face, if it's something, sort of weird fantasy or behaviour or it's just an attempt to mask identification, we don't know. \"We haven't confirmed any clear motive, these are all relevant factors in what may have been going on, financial issues, debt, problems paying the bills, potentially relationship between the two of them.\"  Mr Everett met his killer when he was teaching English to recently arrived Polish immigrants. He had also worked for the NHS and Department for Work and Pensions. Mr Everett was unmarried and had no children. Known as \"Benny\" to his family, they did not realise he was dead - as Majerkiewicz had taken control of his phone and finances, sending text messages and a birthday card to his relatives to pretend he was still alive. Mr Everett began living in the three-bedroom house in Winton in 2013. He then sub-let the other two rooms to two Polish men - Majerkiewicz and Michal Polchowsk, 68. Mr Polchowsk, a food-processing factory worker, was initially charged with his housemate's murder but the case against him was dropped. Majerkiewicz was unemployed when he committed his crimes and was £60,000 in debt, his trial was told. Jurors excused for five years Thanking jurors afterwards, the judge Mr Justice Cavanagh excused them from jury service for the next five years as the case \"had its stressful and traumatic elements\". Rebecca Macaulay-Addison, from the Crown Prosecution Service (CPS), said: \"Marcin Majerkiewicz murdered Stuart Everett before making a despicable and disturbing attempt to cover his tracks by disposing of Mr Everett's remains.\""
    },
    {
        "title": "Israel says it has killed Hamas military intelligence chief Osama Tabash - as forces told to push further into Gaza",
        "description": "Israel has said Hamas' military intelligence chief in southern Gaza has been \"eliminated\".",
        "url": "https://news.sky.com/story/israel-says-it-has-killed-hamas-military-intelligence-chief-osama-tabash-as-forces-told-to-push-further-into-gaza-13333403",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-israel-gaza_6861471.jpg?20250321224714",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 19:10:00",
        "Headline": "Nearly 600 Palestinians have been killed since Tuesday - many of them children, according to Gaza health authorities.",
        "Content": "Israel has said Hamas' military intelligence chief in southern Gaza has been \"eliminated\". In a post on X, Israel Defence Forces (IDF) said Osama Tabash was also head of the group's surveillance and targeting unit. It said he was responsible for \"planning and coordinating targets and infiltration objectives\" during the October 2023 terror attack and was in charge of \"combat strategy on the ground\". It did not say when or where he was killed and Hamas has not commented on the claim. It comes as Israel's defence minister said he had ordered ground forces to advance deeper into Gaza and to hold more land in an effort to pressure Hamas to free more hostages. \"The more Hamas continues its refusal to release the kidnapped, the more territory it will lose to Israel,\" said Israel Katz. Israel resumed airstrikes a few days ago after an extension to the ceasefire that had seen Israeli hostages swapped for Palestinian prisoners could not be agreed. \n                  UN says teachers, doctors, nurses were among staff killed in Israeli strikes – which killed 91 people in Gaza\n                 \n                  Israel launches new 'limited ground invasion' of Gaza amid deadly bombardment \n                 \n                  Fresh strikes in Gaza with at least 14 killed - as Israel army targets Hamas military site\n                 The truce was supposed to continue as long as talks on the second phase continued, but Israeli leader Benjamin Netanyahu refused to enter substantive negotiations. Nearly 600 Palestinians have now been killed since Tuesday - many of them children, according to Gaza health authorities.  Israel has said it will escalate operations until Hamas releases the 59 hostages it still holds - 24 of whom are believed alive - and gives up control of Gaza. On Thursday, after retaking part of the Netzarim corridor that divides Gaza's north from south, Israeli troops moved towards the town of Beit Lahiya, as well as the southern border city of Rafah. Israel also said it had resumed enforcing a blockade on northern Gaza, including Gaza City. Read more:Top court blocks Netanyahu's sacking of security chiefWhat happened to the Israel-Hamas ceasefire? Meanwhile, an explosion on Friday east of Gaza City killed a couple and their two children, plus another two children not related to them but in the same building, according to witnesses and a local hospital. The Israeli military said it had targeted a militant in a Gaza City building - with steps taken to minimise civilian harm. It was not clear if it was referring to the same strike. Israel also said it planned to conduct raids in three neighbourhoods west of Gaza City and warned Palestinians to evacuate in advance. The warning came shortly after it said it had intercepted two rockets that set off sirens in the Israeli coastal city of Ashkelon."
    },
    {
        "title": "Israeli PM tries to sack Shin Bet chief amid hostage protests - but top court blocks move",
        "description": "Israeli Prime Minister Benjamin Netanyahu has ordered the dismissal of the head of the Shin Bet internal security service - a move temporarily blocked by the country's top court.",
        "url": "https://news.sky.com/story/israeli-pm-tries-to-sack-shin-bet-chief-amid-hostage-protests-but-top-court-blocks-move-13333127",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ronen-bar_6859475.jpg?20250317112844",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 10:51:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu proposed sacking the head of the country's internal security service, Ronen Bar, saying he had \"ongoing distrust\" in him. While he got the backing of his cabinet, Israel's top court blocked the move temporarily.",
        "Content": "Israeli Prime Minister Benjamin Netanyahu has ordered the dismissal of the head of the Shin Bet internal security service - a move temporarily blocked by the country's top court. Israel's government voted in favour of Mr Netanyahu's proposal to sack Ronen Bar - despite thousands protesting against it and criticising the prime minister's handling of the hostage crisis. But Mr Bar got a brief reprieve hours after the vote, as the Supreme Court said it was delaying the firing until an appeal could be heard no later than 8 April. The prime minister's office had said Mr Bar's dismissal was effective from 10 April, but that it could come earlier if a replacement was found. It would be the first time a head of Shin Bet has been sacked in Israel's history. Israel's attorney general has ruled that the cabinet has no legal basis to dismiss Mr Bar. The cabinet vote came as thousands protested outside Mr Netanyahu's residence in Jerusalem on Thursday over his handling of the hostage situation and his plans to fire Mr Bar. There were also protests calling for the release of hostages near his residence on Friday. \"Instead of firing the head of the Shin Bet, just to avoid an investigation, I think that the prime minister should be involved in rescuing the last hostages there are left in Gaza to die,\" said Michal Halperin, a protester. The prime minister is facing mounting pressure at home after resuming airstrikes in Gaza earlier this week, bringing an end to a fragile ceasefire with Hamas which had brought relative peace to the region for almost two months. Read more from Sky News:Germany's 'neglected' military set for new eraTommy Robinson loses bid to challenge prison segregation  Announcing his plans to sack Mr Bar, Mr Netanyahu said he had \"ongoing distrust\" in the head of Shin Bet. Mr Bar, who has headed the agency since 2021, was until recently one of the senior negotiators for Israel with mediators in Egypt and Qatar. He was replaced by Ron Dermer, strategic affairs minister and a close confidante of the prime minister's, because Mr Netanyahu believed he was too soft in negotiations and leaked information to embarrass the government. Mr Bar accepted responsibility for his failure to prevent the 7 October attacks and had already indicated he would step down once all the hostages were freed and a number of sensitive investigations were completed."
    },
    {
        "title": "Five jihadists found guilty of holding French journalists hostage",
        "description": "Five jihadists have been found guilty of holding French journalists captive in Syria for the terror group Islamic State.\n",
        "url": "https://news.sky.com/story/five-jihadists-found-guilty-of-holding-french-journalists-hostage-13333290",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mehdi-nemmouche_6863365.jpg?20250321160705",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-03-21 15:59:00",
        "Headline": "During their imprisonment, the four journalists were forced to watch the executions of other captives and endure beatings while surrounded by the screams of fellow detainees.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Five jihadists have been found guilty of holding French journalists captive in Syria for the terror group Islamic State.\n One of the guilty, Mehdi Nemmouche, 39, has been described by the prosecution as \"one of the most perverse and cruel jihadists of the past 10 years\" with a \"total absence of empathy and remorse.\" \"Yes, I was a terrorist, and I will never apologise for it,\" Nemmouche told the court in France hours before the verdict was due, while denying he held the men captive. \"I don't regret a day, an hour, or an act,\" he added. Nemmouche was sentenced to life in prison, and will serve a minimum of 22 years behind bars. Abdelmalek Tanem was given 22 years and Kais Al Abdullah was sentenced to 20 years.Meanwhile, Oussama Atar and Salim Benghalem, who are both referred to as integral figures in the Islamic State's operations and believed to be dead were sentenced to life in absentia. The trial in Paris heard that journalists Didier Francois, Edouard Elias, Nicolas Henin, and Pierre Torres were terrorised during their 10 months in captivity between June 2013 and April 2014. The four spoke of relentless physical and psychological torture at the hands of ISIS. During their imprisonment, they were forced to watch the executions of other captives and endure beatings while surrounded by the screams of fellow detainees.  Nicolas Henin was snatched in the Syrian city of Raqqa with photographer Pierre Torres in 2013. He told Sky News he was just \"taken off the streets\". During his time in captivity, he met American journalist James Foley and British aid worker David Haines, both of whom were later murdered by the notorious British ISIS militants \"the Beatles\". \"We were a total of 24. Nineteen men held in one cell and five women in another one…and the plan was to start everything with an execution,\" he says. He remembers the first person executed on the day they arrived was a Russian man, but the murders would continue. At times, their captors also carried out mock executions, dragging their terrified prisoners out for fake beheadings or leaving them in the boiling sun for hours during mock crucifixions. \"All our captors treated us badly. It is not only about beatings or torture; to keep someone captured in the dark sometimes blindfolded is enough,\" Mr Henin said. Throughout the trial, Nemmouche has always denied being their jailer, but the four former hostages recognised him. Edouard Elias said he remembers him tormenting them for hours with constant chatter and singing French songs. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' Nicolas Henin will never forget his face or his manner. \"[He's] sadistic, narcissistic, and I would say 'gamer' because for him nothing is serious. Everything is a game. He wants to win everything…he plays with the court,\" he said. Nemmouche is already serving a life sentence for the fatal attack on the Jewish Museum in Brussels in May 2014. He carried out the killings for ISIS a few weeks after the French journalists were released. \"This man, who fancies himself intelligent, is devoid of any human sentiment,\" Prosecutor Benjamin Chambre said, describing him as a \"real sociopath\". It's more than a decade since the journalists spent months witnessing and enduring the darkest and cruellest acts of humanity. Asked how he managed to survive, Nicolas Henin paid tribute to his fellow hostages David Haines and James Foley who he says supported him mentally while he was detained. Ahead of the verdict, he called for sentences that reflected the gravity of the crimes inflicted on them. And what of the men who seemingly take joy in inflicting such pain and suffering - are they evil? That's what they need us to believe, he explains. \"It's part of the game of terrorists to terrorise people. They need us to believe that they are not human. \"We have to look for the humanity still in them to prevent ourselves being totally petrified by fear facing them,\" Mr Henin adds, refusing to be cowed. \"I prevent myself from feeling any hatred against them as much as any fear,\" he says."
    },
    {
        "title": "Incoming IOC president to open talks on Russia's potential return to Olympics",
        "description": "The incoming IOC president has revealed to Sky News she is against banning countries from the Olympics over wars and will open talks on Russia's potential return to the Games.",
        "url": "https://news.sky.com/story/incoming-ioc-president-to-open-talks-on-russias-potential-return-to-olympics-13333288",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kirsty-coventry-ioc_6862309.jpg?20250320153241",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-03-21 16:10:00",
        "Headline": "Kirsty Coventry, who will be the first African leader of the IOC, sees inconsistencies in the current approach of singling out Russia while there are conflicts on her own continent.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The incoming IOC president has revealed to Sky News she is against banning countries from the Olympics over wars and will open talks on Russia's potential return to the Games. Only Russians competing as neutrals were allowed to take part in Paris 2024 as Moscow was punished for launching the full-scale invasion of Ukraine. Kirsty Coventry will be the first female president of the International Olympic Committee (IOC) and its first African leader. The former Olympic swimmer, who won two gold medals for Zimbabwe, has said she sees inconsistencies in the current approach of singling out Russia while there are conflicts on her own continent. Asked a day after her election if she was against banning countries from the Olympics over conflicts, Ms Coventry told Sky News: \"I am, but I think you have to take each situation into account. \"What I would like to do is set up a taskforce where this taskforce tries to set out some policies and some guiding frameworks that we as the movement can use to make decisions when we are brought into conflicts. \"We have conflicts in Africa and they're horrific at the moment. So this is not going away, sadly. \n                  Kirsty Coventry: After historic win, new IOC president must deal with Trump, Putin and transgender issue\n                 \n                  New Olympic president elected as Britain's Lord Seb Coe discovers fate\n                 \n                  The Olympics' own Conclave begins - as hotly contested race for IOC president reaches climax\n                 \"So how are we going to protect and support athletes? \"How are we going to ensure that all athletes have the opportunity to come to the Olympic Games? \"And our responsibility is also to ensure once those athletes are all there, that they're safe and that we protect and support them during the Olympic Games. \"So there's a fine balance. But ultimately I believe that it's best for our movement to ensure that we have all athletes represented.\"  Analysis:New IOC president will have to deal with Trump, Putin and transgender issue US President Donald Trump has also apparently discussed with Russian leader Vladimir Putin the idea of using sports to heal relations with Russia. Ms Coventry was congratulated on her IOC election by Putin, who said her \"experience and interest in the real advancement of the noble Olympic ideals will ensure your success in such a responsible position\". While the next Summer Olympics are not until 2028 in Los Angeles, there are fewer than 11 months until the Winter Games in Milan and Cortina d'Ampezzo. So will Russia be back by then? \"We're going to have that discussion with a collective group …with the taskforce,\" she said. Gender eligibility This interview was taking place a day after her election to the highest job in sport - seeing off six rivals, including Sebastian Coe. World Athletics - led by Lord Coe - has been exploring whether to introduce swab tests to assess gender eligibility. A key athletics meeting next week is due to discuss the issue amid concerns about fairness over athletes with differences of sex development and transgender women competing in women's sport. The IOC has previously called a return to sex testing a \"bad idea\", but Ms Coventry is not ruling it out as she has talked about protecting the female category. \"This is a conversation that's happened and the international federations have taken a far greater lead in this conversation,\" she said in the Greek costal resort of Costa Navarino. \"What I was proposing is to bring a group together with the international federations and really understand each sport is slightly different. \"We know in equestrian, sex is really not an issue, but in other sports it is. \"So what I'd like to do again is bring the international federations together and sit down and try and come up with a collective way forward for all of us to move.\" Future Olympic hosts Looking ahead there are the 2036 Olympics to be awarded. And Ms Coventry pledged IOC members will get more of a say after behind-the-scenes deals under Thomas Bach seeing Paris (2024), LA (2028) and Brisbane (2034) uncontested decisions. The IOC presidential campaign has raised when Africa and the Middle East will host the Olympics for the first time, as well as potential interest from India to host the Games in 2036. \"There's a few slight adjustments that I'd like to make in terms of involvement of the IOC members - that was something very clearly related to me in this campaign,\" Ms Coventry said. \"But new regions and embracing new regions … will be a part of what I would like to see. \"I think if we can embrace new regions across the entire movement, it opens this up for so many different opportunities, including revenue growth, including being able to reach new audiences.\" Zimbabwe rights concerns There has been scrutiny over Ms Coventry's role in Zimbabwe's government as sports minister given concerns - raised by the UK government - about whether the country is violating human rights and clamping down on political freedoms. \"I have always been a very proud Zimbabwean and when I was asked to step into this role (as a minister in 2018), I took time to really consider it,\" she said. \"I knew that it would come with different thoughts and feelings, but I wanted to try and create change in my country. I wanted to try and make things better for athletes in my country and we're doing that. \"We're working on strengthening pieces of legislation that have never been there before. And these are things that I don't believe I would have been able to achieve on the outside.\" IOC agenda Ms Coventry officially starts in June as the first female IOC president. \"It shows that we are moving and we're changing and we're global and we're diverse and we represent everybody,\" she said. And how will her presidency be judged a success? The rules allow her to serve until 2037 if she is re-elected for a final four-year term after being given an initial eight-year mandate. She said: \"I want to ensure that we can find these young, talented athletes from around the world and we can give them an opportunity to be identified and to have training and be connected to the best coaches in the world and that's all going to be driven by embracing technology. \"And I think that is going to be really a game changer in the next few years.\""
    },
    {
        "title": "Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US",
        "description": "Donald Trump has said Russia is only fearful of NATO with the US as a member.&#160;",
        "url": "https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump_6863645.jpg?20250321213221",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 14:55:00",
        "Headline": "The US president made the comments while awarding Boeing a contract to develop the F-47, the US Air Force's most sophisticated fighter jet yet. ",
        "Content": " Donald Trump has said Russia is only fearful of NATO with the US as a member.  In a news conference on Friday, the US president claimed: \"NATO was gone until I came along\". \"President Putin will tell you that without the United States, he wouldn't be worried, but he is worried when the United States is involved,\" he said. Mr Trump also alleged the previous and current NATO secretary generals said: \"If it wasn't for Trump, you wouldn't even have NATO because we were paying the costs of almost all of the countries.\" Mr Trump made the comments as he announced in the White House that Boeing has won a contract to develop the US Air Force's most sophisticated fighter jet yet. The new sixth-generation jet would be named F-47, Mr Trump said. \"Nothing in the world comes close to it... it's something the likes of which nobody has seen before,\" he added. \n                  Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears\n                 \n                  China has 'executed four Canadians'\n                 \n                  Trump's call with Putin: Ending one war, preparing for another? \n                 \"(The F-47) will be the most lethal aircraft ever built.\" On defence, Mr Trump said the US is also \"well-equipped\" to fight any potential war with China. \"We don't want to have a potential war with China. But I can tell you if we did, we're very well-equipped to handle it,\" he said. He also rejected reports that his adviser Elon Musk would be briefed on how the United States would fight a hypothetical war with China - a rare suggestion that his far-reaching role in the administration will face limits. \"Elon has businesses in China,\" he said. \"And he would be susceptible, perhaps, to that.\" The president confirmed he would be speaking to China's president Xi Jinping about tariffs. Mr Trump also said there was flexibility on his controversial economic measure. It comes as Mr Trump expressed enthusiasm for possibly becoming a member of the Commonwealth. Sharing an article on his Truth Social network about plans to allegedly make the USA the next associate member, the President wrote: \"I Love King Charles. Sounds good to me!\" 'Our allies are calling constantly' The plane's design remains a closely-held secret, but would likely include stealth, advanced sensors, and cutting-edge engines. The initial contract to proceed with production on the jets is worth an estimated $20bn (£15.5bn). 👉 Follow Trump 100 on your podcast app 👈 Mr Trump said the jets will be built over several years and \"it's something nobody has ever seen before\". \"Our allies are calling constantly,\" Trump said, adding foreign sales could be an option. \"They want to buy them also.\" Read more:Trump signs order to dismantle US department of educationWhat are Donald Trump's tariffs? After saying the US would \"tone down\" the new jets by 10% for any sales to allies, Trump said: \"[It] probably makes sense, because someday, maybe they're not our allies.\" Critics have questioned the cost and the necessity of the programme as the Pentagon is still struggling to fully produce its current most advanced jet, the F-35, which is expected to cost taxpayers more than $1.7tr (£1.01tr) over its lifespan. 'I'll pay out of my own pocket' Meanwhile, Mr Trump said he will pay NASA astronauts Suni Williams and Butch Wilmore overtime pay after their trip to the International Space Station lasted nine months longer than planned. A reporter at the news conference said the pair are not entitled to overtime pay, prompting Mr Trump to say: \"If I have to, I'll pay it out of my own pocket.\""
    },
    {
        "title": "Diamond Tiffany earrings swallowed by suspected thief are recovered by Florida police",
        "description": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly &#163;600,000 during his arrest, US police have said.",
        "url": "https://news.sky.com/story/diamond-tiffany-earrings-swallowed-by-suspected-thief-are-recovered-by-florida-police-13333505",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-diamomd-diamond-swallowed_6863657.jpg?20250321214842",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:44:00",
        "Headline": "The suspect was heard saying: \"I should have thrown them out the window\" and asked jail staff: \"Am I going to be charged with what is in my stomach?\", according to an arrest report.",
        "Content": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly £600,000 during his arrest, US police have said. The man, who was detained in Florida, had told staff at a Tiffany & Co store he was interested in buying earrings and a diamond ring on behalf of an Orlando Magic basketball player in February. He was escorted to a VIP room where he could view the jewellery but a short time later, he jumped out of his chair, grabbed the jewellery and forced his way out the door, Orlando Police Department said. Officers obtained the licence plate of the suspect's car through shopping centre security footage and tracked the vehicle. He was pulled over for driving without rear lights in Washington County, almost 340 miles away, a police report said. In the police car, an officer heard the suspect say: \"I should have thrown them out the window,\" and at the Washington County jail he asked staff: \"Am I going to be charged with what is in my stomach?\" according to the arrest report. While some earrings were quickly recovered, the suspect was then transferred to hospital where detectives monitored him as they waited to collect the remaining evidence. The four stolen earrings, valued at $770,000 (£596,000), matched the serial numbers from the jewellery taken from the Tiffany store last month, detectives said. Read more from Sky News:What Heathrow shutdown tells usUS unlikely to replace important steal with domestic version After the jewellery was recovered, the arrested man was taken to Orange County Jail where he faces charges of robbery with a mask and first-degree grand theft."
    },
    {
        "title": "Sudan's military says it has seized control of presidential palace ",
        "description": "Sudan's military has said it has retaken the Republican Palace in the country's capital Khartoum after nearly two years of fighting.",
        "url": "https://news.sky.com/story/sudans-military-says-it-has-seized-control-of-presidential-palace-13332962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sudan-presidential-palace_6862936.jpg?20250321083315",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 05:59:00",
        "Headline": "The palace appeared to be partly in ruins, with soldiers' steps crunching broken tiles underneath their boots.",
        "Content": " Sudan's military has said it has retaken the Republican Palace in the country's capital Khartoum after nearly two years of fighting. The current conflict in Sudan erupted in April 2023 when a power struggle between the leaders of the military and the Rapid Support Forces (RSF) boiled over into open fighting in Khartoum and other cities. Social media videos showed the military's soldiers inside on the 21st day of Ramadan, the holy Muslim fasting month. A Sudanese military officer wearing a captain's epaulettes made the announcement in a video and confirmed the troops were inside the compound. Eyewitness: Waiting and praying for news of victory after two years of war The palace appeared to be partly in ruins, with soldiers' steps crunching broken tiles underneath their boots.  Soldiers carrying assault rifles and rocket-propelled grenade launchers chanted: \"God is the greatest!\" Sudan's information minister said the military had retaken the palace in a post on X. \"Today the flag is raised, the palace is back and the journey continues until victory is complete,\" he wrote. Read more: Maps show Sudan conflict's shifting frontlines as SAF regains territory The Republican Palace was the seat of government before the war erupted and is immortalised on Sudanese banknotes and postage stamps.  Its recapture by the military marks another gain for Sudan's military which has made steady advances in recent months. The rival RSF has been mostly expelled from the capital of Khartoum after Sudan's war began in April 2023. Africa correspondent Sudan's military operations have pointed towards a specific target for several weeks: reclaim the Republican Palace from their entrenched enemy the Rapid Support Forces (RSF) after close to two years of war. After two days of intense battles in and around the palace complex, victory over the symbolic site has been declared by the Sudanese Armed Forces (SAF) with soldiers sharing videos and photos from inside the palace. \"People will say it is photoshop but this is the Republican Palace. Inside the palace! Inside the palace!\" yells an SAF Captain in a video filmed inside the building. The Republican Palace is the country's seat of power and the official residence of its president.\n Though the iconic building on the bank of the Blue Nile River decorates banknotes, it is rarely home to the military rulers who prefer to live in the Sudanese Armed Forces (SAF) headquarters to the southeast of the palace complex. The palace was unveiled in 2015 as a gift to former military dictator Omar Al-Bashir by China. It stands behind the colonial governor-general's residence where decorated British General Charles Gordon was killed by Sudanese fighters 140 years ago. The symbolism of the old palace and the political significance of the Chinese rebuild often draws history to its steps. Gunfire was heard in the capital overnight on Friday, although whether this was from fighting or celebrations is unclear. The RSF hasn't acknowledged the loss of the presidential palace but the group still holds territory elsewhere in Sudan so fighting is likely to continue. The war has killed more than 28,000 people, according to UN figures, and forced millions to flee their homes. Families have been left eating grass in a desperate attempt to survive a famine that is sweeping through parts of the country."
    },
    {
        "title": "Sudan's recaptured palace is a significant sign of return to order",
        "description": "Sudan's military operations have pointed towards a specific target for several weeks: reclaim the Republican Palace from their entrenched enemy, the Rapid Support Forces (RSF), after close to two years of war.",
        "url": "https://news.sky.com/story/sudans-recaptured-palace-is-a-significant-sign-of-return-to-order-13333079",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sudan-presidential_6862995.jpg?20250321090542",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-03-21 09:08:00",
        "Headline": "When war erupted in 2023, the RSF quickly captured Khartoum's airport, the Republican Palace and the bridges that connect the tri-city capital, causing millions to flee their homes.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Sudan's military operations have pointed towards a specific target for several weeks: reclaim the Republican Palace from their entrenched enemy, the Rapid Support Forces (RSF), after close to two years of war. After two days of intense battles in and around the palace complex, victory over the symbolic site has been declared by the Sudanese Armed Forces (SAF) and soldiers sharing videos and photos from inside the palace. \"Allahu Akbar, Allahu Akbar - Friday, the 21st day of Ramadan and the 21st of March - we entered the Republican Palace. Allahu Akbar!\" a SAF captain says in a video filmed inside the building. The broken glass and bits of cement crunch under their feet as they tour the building and exclaim \"Allahu Akbar!\". \"People will say it is photoshop but this is the Republican Palace. Inside the palace! Inside the palace!\" yells the captain. The Republican Palace is the country's seat of power and the official residence of its president. Though the iconic building on the bank of the Blue Nile River decorates banknotes, it is rarely home to military rulers who prefer to live in the SAF headquarters southeast of the palace complex. \n                  Sudan's military says it has seized control of presidential palace \n                 \n                  Maps show Sudan conflict's shifting frontlines as SAF regains territory\n                 \n                  The battle for Sudan's capital has ravaged bodies and minds and left the city a ruin\n                 The palace was unveiled in 2015 as a gift to former military dictator Omar Al-Bashir from China. It stands behind the colonial governor-general's residence where decorated British general Charles Gordon was killed by Sudanese fighters 140 years ago. The symbolism of the old palace and the political significance of the Chinese rebuild often draws history to its steps. In 2019, protesters marched to the palace calling for an end to military rule.  On Friday morning, revolutionaries-turned-military-recruits entered the palace complex as victors in a battle to reclaim the cornerstones of their city. This time under the command of Abdelfattah Al-Burhan, Al-Bashir's former inspector-general who replaced him as head of state in the wake of the popular uprising. Eyewitness: Waiting and praying for news of victory after two years of war For four years, RSF leader Mohamed Hamdan \"Hemedti\" Dagalo was Al-Burhan's de facto vice president. As a Janjaweed militia leader from Darfur, Hemedti worked with Al-Burhan under Al-Bashir to crush rebellions and commit ethnic cleansing in Sudan's western region in the early 2000s.  The pair joined forces again to upend an agreed post-revolution transition to civilian rule with a military coup in October 2021. In April 2023, their uneasy partnership collapsed after a simmering power struggle and war erupted in Khartoum. The RSF quickly captured the airport, the Republican Palace and the bridges that connect the tri-city capital causing millions to flee their homes. Read more: Maps show Sudan conflict's shifting frontlines as SAF regains territory This conflict has created the world's largest humanitarian disaster without a single ceasefire since the start of the fighting. RSF shelling, SAF airstrikes, starvation and disease have claimed at least 61,000 lives in Khartoum state alone. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' In under two years, the US has accused the RSF of committing genocide in Darfur and the United Nations (UN) has reported extreme sexual violence, crimes against humanity and ethnic cleansing of civilians at the hands of their fighters across Sudan. SAF has been accused of war crimes, the recruitment of child soldiers and blocking much-needed humanitarian aid access. With its shattered windows and burnt edges, the now reclaimed palace is a significant sign of a potential return to order. A stifling status quo that was rejected by masses in popular protest but is now welcomed and celebrated after 22 months of violent terror and uncertainty."
    },
    {
        "title": "Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected",
        "description": "Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation.",
        "url": "https://news.sky.com/story/heathrow-closure-throws-travel-plans-into-chaos-as-weddings-rugby-tours-and-arctic-circle-trips-affected-13333120",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicolas-francescantonio_6863052.jpg?20250321095110",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-21 10:39:00",
        "Headline": "Forty-five children were supposed to graduate to their first junior rugby games this weekend after fundraising for a trip to Dublin for a year - now, they don't know if they will even make the matches.",
        "Content": " Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation. Travellers heading to weddings, the Arctic Circle, rugby matches and birthdays have been left scrambling to find alternatives.  Around 1,357 flights have been affected, according to data from Flight Radar. Follow live updates on Heathrow closure Sleeping in the snow Jordan Wylie MBE told Sky News he is sleeping in the snow tonight after his flight home from northern Sweden was cancelled. The adventurer was training for an Antarctic expedition where he will attempt to climb a series of unclimbed and unnamed peaks in aid of the Army Cadets Charity. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 \n                  Heathrow closure: Sir Keir Starmer receiving 'regular updates'\n                 However, his training has been extended by one more day because of the Heathrow chaos and he will sleep in his tent again. Read more: What are your rights if your flight is delayed or cancelled? He will now have to fly \"from Northern Sweden to Stockholm to Frankfurt to Heathrow but not for at least 24 hours\", according to representatives he's spoken to from Scandinavia Airlines (SAS). Long-awaited best friend's wedding One woman in Minneapolis said her husband would miss his best friend's wedding after their flight was turned around over the Atlantic Ocean. \"This wedding is a huge deal because it got postponed due to Covid, then their toddler got leukaemia,\" she said. \"Now the wedding is finally happening. We are so gutted,\" she said, adding it was the family's first international flight. \"We are back in our car in Minneapolis heading home at 2.40am with our toddlers wide awake in the back seat wondering why we aren't in London.\" \"Absolute shambles\" says passenger heading back for new job Lloyd Mcbratney described \"panic and confusion\" on his flight from Kuwait to Heathrow when the plane \"suddenly U-turned without explanation\". He and his girlfriend were travelling back from a trip to the Philippines but are now waiting at an airport hotel in Kuwait. \"We have no idea when we will be going back home, 0 guidance, 0 communication,\" he told Sky News. To make matters worse, Mr Mcbratney starts a new job on Monday. \"Absolute shambles,\" he said. Rugby juniors missing out on 'trip of a lifetime' Alex Wiffen says the London Irish Under 12s rugby team have had the \"trip of a lifetime\" to Dublin thrown into disarray. Forty-five girls and boys were supposed to graduate from minis to their first junior rugby games this weekend after fundraising for the trip for a year, he said. \"It's a trip that's been happening for 40 years and it's the inaugural trip for the girls' team,\" says Alex. \"Our flights at 8am this morning were cancelled and now there is no way to get to Dublin.\" The players and 70 parents are now just \"praying we can get there ASAP\" before their first match against Clontarf Rugby Club tomorrow morning. Stuck at Manchester airport  Nigel and Pam Turner have been diverted into Manchester Airport from Heathrow after they flew out from Dubai. They were expecting to land at Heathrow at 7am - but are now stuck waiting in Manchester Airport until 7pm for an onward flight to Guernsey, which they paid for themselves. The couple said they only found out what had happened while they were in the air - when they saw the couple in front had the news on their screens, and realised there had been a fire affecting Heathrow. It wasn't until the plane was over the English Channel they found out they would actually be landing in Manchester. Speaking from a coffee shop at T2 arrivals, they said they were in good spirits, but hoping to find somewhere comfortable to wait out the nine hours before their flight out. \"C'est la vie\" Nigel said. \"Nothing we can do about it\".  Husky-sledding in the Arctic Circle John Climpson said he was up at 3am to fly out to the north of Sweden to start a 240km husky sledding challenge in the Arctic Circle. \"Now the whole trip might be cancelled,\" he said. \"Everyone is now desperately trying to rebook hotel rooms at the Terminal 2 Premier Inn.\"  Confusion in Shanghai A family of four coming home from a two-week tour of China said they found out their flight home was \"delayed\" at check-in at Shanghai airport. After travelling from Beijing to Xi'an and Shanghai, Sohan Shah and his family, from Croydon, found confusing scenes at the airport. \"Due to the language barrier staff could not explain to us why, until we saw the Sky News report explaining the Heathrow fire,\" said Mr Shah. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' \"[The airport staff] kept sending us back and forth to different counters where we have now been rebooked to a flight to London Gatwick at 1.30 in the morning,\" he told Sky News.\"They eventually put us in a coach to a local hotel and provided food vouchers for the night,\" he said. From Derby to DC for 50th birthday Virgin Atlantic passenger Andy was supposed to be flying from Heathrow to Washington DC today to start his 50th birthday celebrations.  Instead, he is stuck in a hotel room he booked for last night to break up the travel day. \"I live in Derby - and I'm unsure whether to stay in London or go home and wait to hear more,\" he said. Heathrow has cancelled all flights until midnight on Friday. U-turn to the US Rafa, from London, was on a flight from Dallas when the pilot U-turned at 4am. \"Cannot believe that Heathrow, one of the world's busiest and best airports, is not running on some sort of independent power to carry on operations,\" he said. \"And the decision made to turn around to America is crazy considering how many flight options [there] are from Germany and France back to the UK.\" He added: \"Nightmare on all accounts.\" Anniversary celebrations delayed Carly and Mel were due to fly to Bali with Singapore Airlines this morning for their seven-year anniversary before finding out what had happened at 5.20am. After working out their options, they managed to book a flight from Charles de Gaulle in Paris to Singapore. They then headed to Victoria Coach station before overnight travel to the French capital. From there, they'll make their way to Denpasar in Indonesia before another connecting flight will take them to Labuan Bajo and then to the island of Komodo. \"By the time we arrive, we will have had to take a train, coach, another train and three flights, but thanks to our own tenacity and the help of Singapore Airlines we will at least make it!\""
    },
    {
        "title": "Prince William joins British troops in Challenger 2 tank on visit to Estonia",
        "description": "The Prince of Wales has joined troops in a Challenger 2 tank as he visited UK soldiers on a NATO base less than 100 miles from the Russian border.",
        "url": "https://news.sky.com/story/prince-william-pictured-in-challenger-2-tank-on-visit-to-british-troops-in-estonia-13333246",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-prince-of-wales-prince-william_6862928.jpg?20250321082921",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-03-21 14:30:00",
        "Headline": "The prince oversaw the operational handover between the Royal Dragoon Guards and the Mercians, and was shown a selection of military vehicles on the second day of his Estonia trip.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The Prince of Wales has joined troops in a Challenger 2 tank as he visited UK soldiers on a NATO base less than 100 miles from the Russian border. Prince William travelled in the commander's turret of the tank as it sped across muddy terrain at Tapa army camp in Estonia. He watched on as soldiers from the Mercian Regiment took part in training exercises. The Mercians, of which he is colonel-in-chief, have just started their six-month deployment in Estonia as the lead battlegroup working alongside NATO partners. With 900 British service personnel in Estonia, it is the UK's largest permanent overseas deployment. The prince witnessed how soldiers worked to clear trenches, as smoke grenades were set off and blank rounds of gunfire rang out. Earlier, as he oversaw the operational handover between the Royal Dragoon Guards and the Mercians, he was shown a selection of military vehicles including the Warrior, an infantry fighting vehicle, the Challenger 2 main battle tank, and the multiple launch rocket systems on the parade ground. Later he was allowed to get behind the wheel of an Archer, a mobile artillery vehicle with a weapon range of 50km (31 miles). \n                  Prince William's style of diplomacy is welcome in these tense times\n                 \n                  Prince William meets Estonia's president amid tensions with Russia\n                 \n                  'New reality' of landmine use in Europe\n                 Speaking to soldiers about his visit, he said: \"Hopefully this provides a bit of interest for you all and what you're doing and keeps everyone on their toes.\" His trip to Tapa Camp was part of a two-day visit on behalf of the UK government, with the prince deployed to show his support to Estonia, to Ukraine and the UK's commitment to NATO. The visit has been in the planning for six months, but its timing couldn't feel more significant amid the ongoing threats from Russia, discussions of a ceasefire between Ukraine and Russia, and Trump's criticisms of NATO.  Read more:Sophie first royal to visit Ukraine since Russia's invasionDocuments about Harry's US visa application released Lt Col Grant Brown from 1st Battalion The Mercian Regiment, who was accompanying the prince during the field training exercise, said: \"Every week there is something new going on. Our job is to reassure our allies that we are absolutely committed to freedom. And to ensure we are ready to face any threat no matter where that might come from... We are constantly out here training to ensure that we are ready.\" But aside from his high-level diplomatic role, Prince William wanted to draw attention to the reality of life for those troops expected to be ready to fight at any time. Talking to Estonian troops, one of them told him how they daily think about the close proximity of Russia, with the prince saying: \"Yes it must focus the mind\". He also spent time talking to British troops about their experiences of deployment and the impact it can have on their mental health. Breaking down the stigma around mental health is a cornerstone of the Prince's official work. British forces are deployed to Estonia and Poland under Operation Cabrit, the UK's contribution to NATO's Forward Land Forces in the two countries, providing a deterrent to Russian aggression."
    },
    {
        "title": "Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US",
        "description": "Donald Trump has said Russia is only fearful of NATO with the US as a member.&#160;",
        "url": "https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump_6863645.jpg?20250321213221",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-21 14:55:00",
        "Headline": "The US president made the comments while awarding Boeing a contract to develop the F-47, the US Air Force's most sophisticated fighter jet yet. ",
        "Content": " Donald Trump has said Russia is only fearful of NATO with the US as a member.  In a news conference on Friday, the US president claimed: \"NATO was gone until I came along\". \"President Putin will tell you that without the United States, he wouldn't be worried, but he is worried when the United States is involved,\" he said. Mr Trump also alleged the previous and current NATO secretary generals said: \"If it wasn't for Trump, you wouldn't even have NATO because we were paying the costs of almost all of the countries.\" Mr Trump made the comments as he announced in the White House that Boeing has won a contract to develop the US Air Force's most sophisticated fighter jet yet. The new sixth-generation jet would be named F-47, Mr Trump said. \"Nothing in the world comes close to it... it's something the likes of which nobody has seen before,\" he added. \n                  Duchess of York offered to help secure PPE early in COVID-19 pandemic, inquiry hears\n                 \n                  China has 'executed four Canadians'\n                 \n                  Trump's call with Putin: Ending one war, preparing for another? \n                 \"(The F-47) will be the most lethal aircraft ever built.\" On defence, Mr Trump said the US is also \"well-equipped\" to fight any potential war with China. \"We don't want to have a potential war with China. But I can tell you if we did, we're very well-equipped to handle it,\" he said. He also rejected reports that his adviser Elon Musk would be briefed on how the United States would fight a hypothetical war with China - a rare suggestion that his far-reaching role in the administration will face limits. \"Elon has businesses in China,\" he said. \"And he would be susceptible, perhaps, to that.\" The president confirmed he would be speaking to China's president Xi Jinping about tariffs. Mr Trump also said there was flexibility on his controversial economic measure. It comes as Mr Trump expressed enthusiasm for possibly becoming a member of the Commonwealth. Sharing an article on his Truth Social network about plans to allegedly make the USA the next associate member, the President wrote: \"I Love King Charles. Sounds good to me!\" 'Our allies are calling constantly' The plane's design remains a closely-held secret, but would likely include stealth, advanced sensors, and cutting-edge engines. The initial contract to proceed with production on the jets is worth an estimated $20bn (£15.5bn). 👉 Follow Trump 100 on your podcast app 👈 Mr Trump said the jets will be built over several years and \"it's something nobody has ever seen before\". \"Our allies are calling constantly,\" Trump said, adding foreign sales could be an option. \"They want to buy them also.\" Read more:Trump signs order to dismantle US department of educationWhat are Donald Trump's tariffs? After saying the US would \"tone down\" the new jets by 10% for any sales to allies, Trump said: \"[It] probably makes sense, because someday, maybe they're not our allies.\" Critics have questioned the cost and the necessity of the programme as the Pentagon is still struggling to fully produce its current most advanced jet, the F-35, which is expected to cost taxpayers more than $1.7tr (£1.01tr) over its lifespan. 'I'll pay out of my own pocket' Meanwhile, Mr Trump said he will pay NASA astronauts Suni Williams and Butch Wilmore overtime pay after their trip to the International Space Station lasted nine months longer than planned. A reporter at the news conference said the pair are not entitled to overtime pay, prompting Mr Trump to say: \"If I have to, I'll pay it out of my own pocket.\""
    },
    {
        "title": "How Donald Trump's tariffs are wreaking chaos in the British metal industry",
        "description": "As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-are-wreaking-chaos-in-the-british-metal-industry-13331951",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariff-ed-conway_6862428.jpg?20250320174408",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-03-21 04:00:00",
        "Headline": "Producers have been in a race against time, fighting weather and a changeable political climate to avoid paying millions in import fees.  ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser. Over the preceding weeks, Marcegaglia, the stainless steel company whose long products division he headed up, had rushed to melt and ship as much metal as it could from its furnaces in Sheffield across to the east coast of America, ahead of the imposition of tariffs. UK and US industrially interlocked Of all the varieties of steel, stainless steel - an alloy of iron and chrome, along with other elements like nickel, molybdenum and carbon - is among the most important. Unlike most other iron alloys, which can rust when they encounter oxygen, stainless steel has a passive film that protects it from corrosion and can even self-heal. That makes it essential not just for use in sinks and cutlery (where most people will encounter it on a daily basis) but, arguably even more essential, in surgical instruments, heavy machinery and the pipes and ducts out of sight but essential to keeping civilisation working. The trick of how to make stainless steel in large quantities was discovered here in Sheffield by Harry Brearley, and while the laboratories he worked for shut down long ago, the furnace at Marcegaglia, in an industrial park just outside the city, can trace a continuous thread back to him. This furnace used to be owned by British Steel, the nationalised corporation responsible for most of Britain's steel manufacture until the days of privatisation. Ever since the invention of stainless steel, Britain has melted, cast and exported vast quantities of the stuff to America. For all that the US has a sizeable stainless steel sector, the two countries' stainless sectors have nonetheless been industrially interlocked since the days of Henry Ford. You can see it in the way Marcegaglia functions. It melts down scrap in its electric arc furnace in Sheffield - an enormous cauldron whose electrodes create a storm of lightning that consumes the same power as a sizeable northern city - and adds the relevant alloy ingredients to form a long, heavy metallic bar, a billet as it's known. That billet is then shipped across the Atlantic to the company's other site, where the billets are processed into bars that are then sold into the North American market. It is a single economic organism, split only by an ocean. But today that ocean and that cross-country split have become an enormous problem. The last time Donald Trump imposed tariffs on steel imports, back in 2018, so-called \"intermediate\" products like the billet made by Marcegaglia and then processed in America were excluded from the duties. This time around, the initial tariff rules had no such exemptions. The upshot was that any steel arriving in American ports after 12.01am Eastern Standard Time on 12 March - including Marcegaglia's half-finished stainless billets - would incur hefty 25% tariffs. A race against time  All of which was why Liam Bates had raced to get as much steel as possible into the US before that deadline. But as he refreshed his browser in the run-up to that deadline, he noticed two straggling shipments, still stuck on the Atlantic. The two ships, the Eva Marie and the Atlantic Star, were, between them, carrying about $12m of steel and they had been due to dock in the US on 10 or 11 March. If so, they would have avoided having to pay those 25% tariffs. But now storms and squalls were spreading across the North Atlantic. Would they stray into the ships' path, disrupting shipping? If the cargo arrived late, it would obliterate any margin the company hoped to make on its steel. And since those bars were destined for Marcegaglia's own plant, the company would have to pay all those costs itself (tariffs are technically paid by the importer). Somehow, Bates had found himself helplessly witnessing an unexpected collision of politics and weather - with profound commercial consequences. Of all the metal items Britain exports to the US, stainless steel is by far and away the biggest category. And the vast majority of that steel comes from the melt shop at Marcegaglia. But the quandary facing Liam Bates, and those companies he sells to in the US, helps illustrate the difficulties of economic policy-by-tariff. Americans will see cost of most things go up The prevailing theory behind the White House measures is that by raising the price of all imported metals, it will encourage domestic producers to build new production. It will help the US to reindustrialise - or so says Donald Trump. And in the long run, that might well prove right. Already, metals producers are raising money, promising to restart old, mothballed smelters. After all, if your main overseas competitors have seen their prices rise by 25%, that's quite a competitive opportunity. The problem is: building industrial production takes time. Marcegaglia itself is planning to replace its old furnace with a newer model, but the planning process has already taken years; the construction itself will be measured in months if not years too. In other words, even if everything goes to plan, America is very unlikely to replace imported steel with domestic production within the period of Donald Trump's term as president. In the meantime, American consumers will see the cost of pretty much everything going up. After all, steel - ignored or dismissed as it sometimes is - is the single most important metallic substance in the world. If something isn't made of steel it's made in machines made of steel. And lifting some of those steel prices by 25% will travel like an economic tidal wave through US supply chains. UK flooded with cheap imported steel The tidal wave is already washing back elsewhere too. With so much steel now unable to get into the US at a decent price, exporters are redeploying shipments elsewhere. All of a sudden countries like the UK are seeing a flood of cheap imported steel - good news in the short run for consumers, but disastrous for what is left of Britain's domestic industry. As the deadline approached and Bates nervously refreshed his live vessel tracking map, disaster struck. The squalls across the Atlantic mounted and the Eva Marie and Atlantic Star slowed nearly to a halt. By the time midnight struck and the tariffs came into place, the two vessels were still many miles off the US coast. They had lost the race. The upshot was Marcegaglia would have to pay around $4m in tariffs - about £3m. That a company was struck with a somewhat arbitrary fee simply to pass goods from one of its factories to another might be among the most egregious examples of the collateral economic damage wrought by trade barriers, but it is likely to be the first of many perverse episodes, with consequences all around the world. For steel is not the only metal to be hit with tariffs. If anything, the drama is even greater for another metal: aluminium. The world's biggest factory - hidden in Scotland Here's a riddle for you: what is the biggest factory in the world? You're probably thinking of vast, cavernous car production lines in Michigan, of shipyards in Korea or steelworks in China. But there's a strong case to be made that the world's biggest factory is instead to be found deep in the Highlands of Scotland. Not that it looks anything like a factory. To the untrained eye, it looks, instead, like heather, forests and bubbling burns of water trickling into lochs. But the 114,000 acres of estates in Lochaber and Badenoch - the third biggest rural estate in Scotland - play a crucial role in helping produce one of the most important substances in the world. The Fort William aluminium plant sits under the shadow of Ben Nevis, the tallest peak in the United Kingdom. Once upon a time, it was just one of a constellation of smelters dotted around Scotland, that made this country, all told, one of the world's biggest aluminium producers. For all that it is very prevalent in the earth's crust, aluminium used to be one of the world's most precious metals - so much so that no one had even laid eyes on it until the 19th century. When he wanted to impress his guests, Napoleon III served them dinner not on gold plates but on aluminium. An extraordinary metal Why? Because aluminium is very difficult - even harder than iron - to convert from the ores you find in the ground into its metallic form. Burn iron ore hot enough, in the right kind of furnace alongside the right kind of charcoal or coal, and you eventually smelt out a form of metal. But aluminium needs a different kind of force to be persuaded to loosen its bonds and form into a pure metal - the force of electricity. So only when the Hall-Heroult process, which allows you to smelt aluminium via electrolysis of alumina (a processed version of the bauxite you get out of the ground), was invented in 1886 did aluminium become a widely available metal. Few people talk these days about the Hall-Heroult process, but it was a breakthrough of earth-shattering proportions. Aluminium is an extraordinary metal - strong but light. And those qualities make it essential in aeronautic deployments. No aluminium, no planes. It is no coincidence that the Wright Brothers' plane at Kitty Hawk had an engine made out of aluminium. Steel would have weighed the glider down too much. And it's no coincidence that powered flight happened shortly after aluminium became widely available. Without the Hall-Heroult process, the world would have been a very different place. While the process wasn't dreamt up in the UK, British industrialists rapidly embraced it, building smelters all over the country. But the catch with aluminium is that you can't smelt it without a big and (this is important) very reliable supply of power. Turn off the power to those enormous carbon electrodes inside an aluminium smelter and in a matter of hours the metal at its base will solidify, effectively destroying it. More than nearly any other industrial process, this is not something you can just switch off willy-nilly, which helps explain why smelters aren't typically dependent on variable power sources like wind and solar. It also explains why, throughout history, these plants have been seen as some of the most important industrial locations throughout the world. The Fort William plant provided most of the aluminium used in Spitfires during WWII. It was repeatedly targeted by the Luftwaffe - indeed there is an old German bomb kept as a memento just near the turbines that power the cells here. Some of the world's earliest smelters were powered by hydroelectricity - most notably the ones which drew their power from the Niagara Falls plants near Buffalo, New York. But the Fort William plant was subtly but importantly different. Those other hydro plants would typically piggyback off a big dam generating power from a big river - such as the ones you find in the US or Canada, or the fjords of Norway. But none of Britain's rivers is quite powerful enough or with a reliable enough flow to provide that kind of uninterrupted power. Radical design So the designers of the Fort William plant did something radical. They bought up vast stretches of the countryside around Ben Nevis (including Ben Nevis itself). And within that estate, they built a series of dams to collect the rainwater trickling down from local watersheds. Those dams weren't there to generate power for homes - they were there to collect the water and channel it through a series of tunnels, running 16 miles through the hills and through the flanks of Ben Nevis. Then the water, collected from those 114,000 acres, feeds five pipes running down the side of the mountain which run into an enormous hydroelectric power station. There are many aluminium smelters around the world and many hydroelectric dams. But none are quite like this one. The point being that without the estate, without all those trickling streams and heather-covered watersheds, the plant here simply wouldn't function. It is all part of a single ecosystem. These days the plant is connected to the national grid, meaning it also serves another function: balancing. This comes back to one of the dysfunctions of the grid: it doesn't have enough high-voltage lines connecting Scotland, with all its wind farms, and the south. So on windy days, when there's too much power in Scotland, instead of curtailing those farms and wasting the electricity, the plant can suck in extra power from the Scottish section of the grid and leave its water where it is as a sort of battery. Competition from China The problem the plant has faced is that these days aluminium is a commodity metal. And it's becoming harder and harder to compete with the cheap metal being exported from China. China dominates the global supply of the metal, in large part because its suppliers benefit from cheap energy and generous government subsidies - neither of which are available in the UK. As the years have gone by, the workers at Fort William have watched as, one by one, every other plant in Britain was shuttered. Rumours still abound that they may eventually be next. And, much as for Marcegaglia down in Sheffield, the tariffs on aluminium will only make life tougher for Alvance, the unit of Liberty House - part of Indian-born Sanjeev Gupta's business empire - that now owns the Fort William plant. Arguably, the impact could be even greater. The last time Donald Trump imposed tariffs on aluminium back in 2018, the rate he chose was 10%. The difference with the steel tariff level (which was 25% then and now) reflected the fact that the US imported far more aluminium than steel. Imposing severe extra costs on it would, the White House worried, cripple the American aerospace and car businesses dependent on the metal. No such concern this time around. The tariff is 25%. Quite how that will affect the plant here in the Scottish Highlands remains to be seen. After all, Alvance itself doesn't sell anything directly to the US, sending its large slabs of metal to other firms in England which process and roll them into sheets and specialised components, some of which end up in the US. Perhaps, as the defence industry ratchets up in the coming years, more of that aluminium will be used by domestic industry. But what's to stop UK manufacturers doing what they've been doing for years, and simply opting for the cheapest metal available, which usually comes from China? Either way, life for the last remaining aluminium plant in the UK is about to get harder, not easier. But while the main upshot of the trade war building across the Atlantic and the Pacific will be to make both sides worse off - that, at least, is the prediction from the Organisation for Economic Co-operation and Development - that doesn't mean there won't be some beneficiaries in this country. For a small but important example, let's travel from the far north of Britain to its far south. UK has one of its biggest resources in world  Drive across Dartmoor, the windswept national park in the heart of Devon, and every so often you come across the remains of an old tin mine. At Fox Tor you find the remains of alluvial mining; there is Golden Dagger Mine, which ran all the way to the 1930s, as well as the hollow stone chimney of the pumping house at Wheal Betsy. For much of the ancient era, tin - which when mixed with copper creates the alloy bronze - was what we would today call a \"critical mineral\", essential for the production of the strong tools and weapons of the Bronze Age. And for centuries, the majority of Europe's tin came from Cornwall and Devon. That, of course, is long in the past. But just on the outskirts of Dartmoor is a site that could - just could - make this an important site for critical minerals once again. For here, beneath the soil of southwest England, is one of the world's biggest resources of tungsten. Tungsten among few substances on everyone's list Tungsten is among the 21st century's most important critical minerals. Nearly every country has a list of these materials - the kinds of things they need to make their most important products - and the members of those lists vary by region. But tungsten is one of the few substances that feature in everyone's list. The hardest metal in existence, with the highest melting point, it is essential in the production of hard steel tools, weapons, armour and as the electrodes inside semiconductor circuits. If you are making electronics you need tungsten. If you are going to war you need tungsten. Perhaps it's no coincidence that the main heyday for this mine, which contains plenty of tin as well as tungsten, was in the First and Second World Wars. Much as the Fort William plant provided aluminium for British Spitfires, Hemerdon provided the tungsten and tin needed for the weapons Britain used to fight the Nazis. But ever since then, its history has been chequered, to say the least. It went into hibernation for decades, a sleep broken for only a single day during the Korean War. Then, a few years ago, investors tried to get it up and running again. They built a vast processing plant and began to mine the metal. But by 2019 the operation had run out of money and imploded. All that was left was an even bigger hole in the ground, a large tailings dam for waste and a hangar filled with processing equipment. In part, the reason Hemerdon went belly-up that time was because the company made the mistake miners often make: they misjudged the type of ore they were expecting to grind through, meaning their processing plant was far less efficient than it could have been. But an even bigger challenge came back to something that will sound familiar: they were trying to compete with China. China dominates world tungsten production - even more so than for aluminium and steel. It essentially controls the global market and, just as importantly, the tungsten price. Anyone trying to sell tungsten is contending with Chinese prices which can yo-yo for reasons no one can entirely explain. That makes it fiendishly difficult to compete. But in recent years, new investors have begun to put fresh funds into the Hemerdon mine, hoping history will not repeat itself and this time around it can exploit that enormous ore resource. And there are at least a couple of reasons to believe (famous last words in finance) that \"this time might be different\". The first is that, in retaliation against Donald Trump's latest metal tariffs, China has begun to put export limits on tungsten. How this will work in practice remains unclear (remember that like most markets China controls, the way tungsten sales function is almost completely opaque) but if it encourages domestic buyers to look for local suppliers, that could help the mine to find buyers. After all, in theory, it could produce a few thousand tonnes of the metal each year, which would instantly leapfrog Britain to become the world's second or third-biggest producer (albeit a long way down from China). Supplies matter more than ever The second big shift comes back to defence. With the world remilitarising, all of a sudden tungsten supplies matter more than ever. And since defence suppliers pay outsized attention to where metals come from, again, that might allow a British tungsten mine to succeed where predecessors have failed. Add to this the fact that the mine itself is nearly ready to be exploited and that the new owners reckon they've ironed out the problems that beset their predecessors, and it's a compelling case. They think they could be getting metal out of the ground as soon as next year. But those overarching challenges haven't gone away. And nor has another, bigger problem facing the entire industry, not just in the UK but - perhaps even more so - in the US. How can you plan in a world where you just don't know what's coming out of the White House in the next few days, let alone the next few years? Consider: imagine you're a stainless steel producer or an aluminium smelter in the US. Those 25% tariffs mean all of a sudden in theory you have a competitive advantage over anyone shipping metal into the country. All of a sudden, there's a strong case to build a smelter or a stainless steel melting shop. So you get to work looking for backers. Uncertainty creates challenges But building a plant like this takes time. You need to find a site, connect it to high-voltage power, and build the facilities and all the necessary infrastructure. Best case scenario: it might take a couple of years, but even that is ambitious. And as you contemplate this and map out your plans, those backers will ask you the same nagging question you've been asking yourself: sure, the economics of an aluminium smelter might add up today; but what if the president changes his mind tomorrow, or next year? What if those tariffs are pulled by the next president? Then, all of a sudden, the sums very much don't add up. All of which is to say, uncertainty around tariffs is a challenge not just for those companies hoping to ship products to America, but for American firms hoping to benefit from this trade war. And bear in mind metals are only the first chapter of what could be a long saga, which ends up engulfing all corners of American trade. These are unpredictable times, however you look at it."
    },
    {
        "title": "Diamond Tiffany earrings swallowed by suspected thief are recovered by Florida police",
        "description": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly &#163;600,000 during his arrest, US police have said.",
        "url": "https://news.sky.com/story/diamond-tiffany-earrings-swallowed-by-suspected-thief-are-recovered-by-florida-police-13333505",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-diamomd-diamond-swallowed_6863657.jpg?20250321214842",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:44:00",
        "Headline": "The suspect was heard saying: \"I should have thrown them out the window\" and asked jail staff: \"Am I going to be charged with what is in my stomach?\", according to an arrest report.",
        "Content": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly £600,000 during his arrest, US police have said. The man, who was detained in Florida, had told staff at a Tiffany & Co store he was interested in buying earrings and a diamond ring on behalf of an Orlando Magic basketball player in February. He was escorted to a VIP room where he could view the jewellery but a short time later, he jumped out of his chair, grabbed the jewellery and forced his way out the door, Orlando Police Department said. Officers obtained the licence plate of the suspect's car through shopping centre security footage and tracked the vehicle. He was pulled over for driving without rear lights in Washington County, almost 340 miles away, a police report said. In the police car, an officer heard the suspect say: \"I should have thrown them out the window,\" and at the Washington County jail he asked staff: \"Am I going to be charged with what is in my stomach?\" according to the arrest report. While some earrings were quickly recovered, the suspect was then transferred to hospital where detectives monitored him as they waited to collect the remaining evidence. The four stolen earrings, valued at $770,000 (£596,000), matched the serial numbers from the jewellery taken from the Tiffany store last month, detectives said. Read more from Sky News:What Heathrow shutdown tells usUS unlikely to replace important steal with domestic version After the jewellery was recovered, the arrested man was taken to Orange County Jail where he faces charges of robbery with a mask and first-degree grand theft."
    },
    {
        "title": "Trump 100 Day 61: Can team Trump impeach judges?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>     ",
        "url": "https://news.sky.com/story/trump-100-day-61-can-team-donald-trump-impeach-judges-13332922",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-21 05:38:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈    The row between the Trump administration and the judiciary has intensified. On Day 61 of Trump 100, US correspondents Martha Kelner, James Matthews and Mark Stone discuss what comes next as the rule of law is tested by the White House. Plus, can Trump \"eliminate the department of education once and for all\"? Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Don't forget, you can watch all episodes on our YouTube channel."
    },
    {
        "title": "How Donald Trump's tariffs are wreaking chaos in the British metal industry",
        "description": "As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-are-wreaking-chaos-in-the-british-metal-industry-13331951",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariff-ed-conway_6862428.jpg?20250320174408",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-03-21 04:00:00",
        "Headline": "Producers have been in a race against time, fighting weather and a changeable political climate to avoid paying millions in import fees.  ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser. Over the preceding weeks, Marcegaglia, the stainless steel company whose long products division he headed up, had rushed to melt and ship as much metal as it could from its furnaces in Sheffield across to the east coast of America, ahead of the imposition of tariffs. UK and US industrially interlocked Of all the varieties of steel, stainless steel - an alloy of iron and chrome, along with other elements like nickel, molybdenum and carbon - is among the most important. Unlike most other iron alloys, which can rust when they encounter oxygen, stainless steel has a passive film that protects it from corrosion and can even self-heal. That makes it essential not just for use in sinks and cutlery (where most people will encounter it on a daily basis) but, arguably even more essential, in surgical instruments, heavy machinery and the pipes and ducts out of sight but essential to keeping civilisation working. The trick of how to make stainless steel in large quantities was discovered here in Sheffield by Harry Brearley, and while the laboratories he worked for shut down long ago, the furnace at Marcegaglia, in an industrial park just outside the city, can trace a continuous thread back to him. This furnace used to be owned by British Steel, the nationalised corporation responsible for most of Britain's steel manufacture until the days of privatisation. Ever since the invention of stainless steel, Britain has melted, cast and exported vast quantities of the stuff to America. For all that the US has a sizeable stainless steel sector, the two countries' stainless sectors have nonetheless been industrially interlocked since the days of Henry Ford. You can see it in the way Marcegaglia functions. It melts down scrap in its electric arc furnace in Sheffield - an enormous cauldron whose electrodes create a storm of lightning that consumes the same power as a sizeable northern city - and adds the relevant alloy ingredients to form a long, heavy metallic bar, a billet as it's known. That billet is then shipped across the Atlantic to the company's other site, where the billets are processed into bars that are then sold into the North American market. It is a single economic organism, split only by an ocean. But today that ocean and that cross-country split have become an enormous problem. The last time Donald Trump imposed tariffs on steel imports, back in 2018, so-called \"intermediate\" products like the billet made by Marcegaglia and then processed in America were excluded from the duties. This time around, the initial tariff rules had no such exemptions. The upshot was that any steel arriving in American ports after 12.01am Eastern Standard Time on 12 March - including Marcegaglia's half-finished stainless billets - would incur hefty 25% tariffs. A race against time  All of which was why Liam Bates had raced to get as much steel as possible into the US before that deadline. But as he refreshed his browser in the run-up to that deadline, he noticed two straggling shipments, still stuck on the Atlantic. The two ships, the Eva Marie and the Atlantic Star, were, between them, carrying about $12m of steel and they had been due to dock in the US on 10 or 11 March. If so, they would have avoided having to pay those 25% tariffs. But now storms and squalls were spreading across the North Atlantic. Would they stray into the ships' path, disrupting shipping? If the cargo arrived late, it would obliterate any margin the company hoped to make on its steel. And since those bars were destined for Marcegaglia's own plant, the company would have to pay all those costs itself (tariffs are technically paid by the importer). Somehow, Bates had found himself helplessly witnessing an unexpected collision of politics and weather - with profound commercial consequences. Of all the metal items Britain exports to the US, stainless steel is by far and away the biggest category. And the vast majority of that steel comes from the melt shop at Marcegaglia. But the quandary facing Liam Bates, and those companies he sells to in the US, helps illustrate the difficulties of economic policy-by-tariff. Americans will see cost of most things go up The prevailing theory behind the White House measures is that by raising the price of all imported metals, it will encourage domestic producers to build new production. It will help the US to reindustrialise - or so says Donald Trump. And in the long run, that might well prove right. Already, metals producers are raising money, promising to restart old, mothballed smelters. After all, if your main overseas competitors have seen their prices rise by 25%, that's quite a competitive opportunity. The problem is: building industrial production takes time. Marcegaglia itself is planning to replace its old furnace with a newer model, but the planning process has already taken years; the construction itself will be measured in months if not years too. In other words, even if everything goes to plan, America is very unlikely to replace imported steel with domestic production within the period of Donald Trump's term as president. In the meantime, American consumers will see the cost of pretty much everything going up. After all, steel - ignored or dismissed as it sometimes is - is the single most important metallic substance in the world. If something isn't made of steel it's made in machines made of steel. And lifting some of those steel prices by 25% will travel like an economic tidal wave through US supply chains. UK flooded with cheap imported steel The tidal wave is already washing back elsewhere too. With so much steel now unable to get into the US at a decent price, exporters are redeploying shipments elsewhere. All of a sudden countries like the UK are seeing a flood of cheap imported steel - good news in the short run for consumers, but disastrous for what is left of Britain's domestic industry. As the deadline approached and Bates nervously refreshed his live vessel tracking map, disaster struck. The squalls across the Atlantic mounted and the Eva Marie and Atlantic Star slowed nearly to a halt. By the time midnight struck and the tariffs came into place, the two vessels were still many miles off the US coast. They had lost the race. The upshot was Marcegaglia would have to pay around $4m in tariffs - about £3m. That a company was struck with a somewhat arbitrary fee simply to pass goods from one of its factories to another might be among the most egregious examples of the collateral economic damage wrought by trade barriers, but it is likely to be the first of many perverse episodes, with consequences all around the world. For steel is not the only metal to be hit with tariffs. If anything, the drama is even greater for another metal: aluminium. The world's biggest factory - hidden in Scotland Here's a riddle for you: what is the biggest factory in the world? You're probably thinking of vast, cavernous car production lines in Michigan, of shipyards in Korea or steelworks in China. But there's a strong case to be made that the world's biggest factory is instead to be found deep in the Highlands of Scotland. Not that it looks anything like a factory. To the untrained eye, it looks, instead, like heather, forests and bubbling burns of water trickling into lochs. But the 114,000 acres of estates in Lochaber and Badenoch - the third biggest rural estate in Scotland - play a crucial role in helping produce one of the most important substances in the world. The Fort William aluminium plant sits under the shadow of Ben Nevis, the tallest peak in the United Kingdom. Once upon a time, it was just one of a constellation of smelters dotted around Scotland, that made this country, all told, one of the world's biggest aluminium producers. For all that it is very prevalent in the earth's crust, aluminium used to be one of the world's most precious metals - so much so that no one had even laid eyes on it until the 19th century. When he wanted to impress his guests, Napoleon III served them dinner not on gold plates but on aluminium. An extraordinary metal Why? Because aluminium is very difficult - even harder than iron - to convert from the ores you find in the ground into its metallic form. Burn iron ore hot enough, in the right kind of furnace alongside the right kind of charcoal or coal, and you eventually smelt out a form of metal. But aluminium needs a different kind of force to be persuaded to loosen its bonds and form into a pure metal - the force of electricity. So only when the Hall-Heroult process, which allows you to smelt aluminium via electrolysis of alumina (a processed version of the bauxite you get out of the ground), was invented in 1886 did aluminium become a widely available metal. Few people talk these days about the Hall-Heroult process, but it was a breakthrough of earth-shattering proportions. Aluminium is an extraordinary metal - strong but light. And those qualities make it essential in aeronautic deployments. No aluminium, no planes. It is no coincidence that the Wright Brothers' plane at Kitty Hawk had an engine made out of aluminium. Steel would have weighed the glider down too much. And it's no coincidence that powered flight happened shortly after aluminium became widely available. Without the Hall-Heroult process, the world would have been a very different place. While the process wasn't dreamt up in the UK, British industrialists rapidly embraced it, building smelters all over the country. But the catch with aluminium is that you can't smelt it without a big and (this is important) very reliable supply of power. Turn off the power to those enormous carbon electrodes inside an aluminium smelter and in a matter of hours the metal at its base will solidify, effectively destroying it. More than nearly any other industrial process, this is not something you can just switch off willy-nilly, which helps explain why smelters aren't typically dependent on variable power sources like wind and solar. It also explains why, throughout history, these plants have been seen as some of the most important industrial locations throughout the world. The Fort William plant provided most of the aluminium used in Spitfires during WWII. It was repeatedly targeted by the Luftwaffe - indeed there is an old German bomb kept as a memento just near the turbines that power the cells here. Some of the world's earliest smelters were powered by hydroelectricity - most notably the ones which drew their power from the Niagara Falls plants near Buffalo, New York. But the Fort William plant was subtly but importantly different. Those other hydro plants would typically piggyback off a big dam generating power from a big river - such as the ones you find in the US or Canada, or the fjords of Norway. But none of Britain's rivers is quite powerful enough or with a reliable enough flow to provide that kind of uninterrupted power. Radical design So the designers of the Fort William plant did something radical. They bought up vast stretches of the countryside around Ben Nevis (including Ben Nevis itself). And within that estate, they built a series of dams to collect the rainwater trickling down from local watersheds. Those dams weren't there to generate power for homes - they were there to collect the water and channel it through a series of tunnels, running 16 miles through the hills and through the flanks of Ben Nevis. Then the water, collected from those 114,000 acres, feeds five pipes running down the side of the mountain which run into an enormous hydroelectric power station. There are many aluminium smelters around the world and many hydroelectric dams. But none are quite like this one. The point being that without the estate, without all those trickling streams and heather-covered watersheds, the plant here simply wouldn't function. It is all part of a single ecosystem. These days the plant is connected to the national grid, meaning it also serves another function: balancing. This comes back to one of the dysfunctions of the grid: it doesn't have enough high-voltage lines connecting Scotland, with all its wind farms, and the south. So on windy days, when there's too much power in Scotland, instead of curtailing those farms and wasting the electricity, the plant can suck in extra power from the Scottish section of the grid and leave its water where it is as a sort of battery. Competition from China The problem the plant has faced is that these days aluminium is a commodity metal. And it's becoming harder and harder to compete with the cheap metal being exported from China. China dominates the global supply of the metal, in large part because its suppliers benefit from cheap energy and generous government subsidies - neither of which are available in the UK. As the years have gone by, the workers at Fort William have watched as, one by one, every other plant in Britain was shuttered. Rumours still abound that they may eventually be next. And, much as for Marcegaglia down in Sheffield, the tariffs on aluminium will only make life tougher for Alvance, the unit of Liberty House - part of Indian-born Sanjeev Gupta's business empire - that now owns the Fort William plant. Arguably, the impact could be even greater. The last time Donald Trump imposed tariffs on aluminium back in 2018, the rate he chose was 10%. The difference with the steel tariff level (which was 25% then and now) reflected the fact that the US imported far more aluminium than steel. Imposing severe extra costs on it would, the White House worried, cripple the American aerospace and car businesses dependent on the metal. No such concern this time around. The tariff is 25%. Quite how that will affect the plant here in the Scottish Highlands remains to be seen. After all, Alvance itself doesn't sell anything directly to the US, sending its large slabs of metal to other firms in England which process and roll them into sheets and specialised components, some of which end up in the US. Perhaps, as the defence industry ratchets up in the coming years, more of that aluminium will be used by domestic industry. But what's to stop UK manufacturers doing what they've been doing for years, and simply opting for the cheapest metal available, which usually comes from China? Either way, life for the last remaining aluminium plant in the UK is about to get harder, not easier. But while the main upshot of the trade war building across the Atlantic and the Pacific will be to make both sides worse off - that, at least, is the prediction from the Organisation for Economic Co-operation and Development - that doesn't mean there won't be some beneficiaries in this country. For a small but important example, let's travel from the far north of Britain to its far south. UK has one of its biggest resources in world  Drive across Dartmoor, the windswept national park in the heart of Devon, and every so often you come across the remains of an old tin mine. At Fox Tor you find the remains of alluvial mining; there is Golden Dagger Mine, which ran all the way to the 1930s, as well as the hollow stone chimney of the pumping house at Wheal Betsy. For much of the ancient era, tin - which when mixed with copper creates the alloy bronze - was what we would today call a \"critical mineral\", essential for the production of the strong tools and weapons of the Bronze Age. And for centuries, the majority of Europe's tin came from Cornwall and Devon. That, of course, is long in the past. But just on the outskirts of Dartmoor is a site that could - just could - make this an important site for critical minerals once again. For here, beneath the soil of southwest England, is one of the world's biggest resources of tungsten. Tungsten among few substances on everyone's list Tungsten is among the 21st century's most important critical minerals. Nearly every country has a list of these materials - the kinds of things they need to make their most important products - and the members of those lists vary by region. But tungsten is one of the few substances that feature in everyone's list. The hardest metal in existence, with the highest melting point, it is essential in the production of hard steel tools, weapons, armour and as the electrodes inside semiconductor circuits. If you are making electronics you need tungsten. If you are going to war you need tungsten. Perhaps it's no coincidence that the main heyday for this mine, which contains plenty of tin as well as tungsten, was in the First and Second World Wars. Much as the Fort William plant provided aluminium for British Spitfires, Hemerdon provided the tungsten and tin needed for the weapons Britain used to fight the Nazis. But ever since then, its history has been chequered, to say the least. It went into hibernation for decades, a sleep broken for only a single day during the Korean War. Then, a few years ago, investors tried to get it up and running again. They built a vast processing plant and began to mine the metal. But by 2019 the operation had run out of money and imploded. All that was left was an even bigger hole in the ground, a large tailings dam for waste and a hangar filled with processing equipment. In part, the reason Hemerdon went belly-up that time was because the company made the mistake miners often make: they misjudged the type of ore they were expecting to grind through, meaning their processing plant was far less efficient than it could have been. But an even bigger challenge came back to something that will sound familiar: they were trying to compete with China. China dominates world tungsten production - even more so than for aluminium and steel. It essentially controls the global market and, just as importantly, the tungsten price. Anyone trying to sell tungsten is contending with Chinese prices which can yo-yo for reasons no one can entirely explain. That makes it fiendishly difficult to compete. But in recent years, new investors have begun to put fresh funds into the Hemerdon mine, hoping history will not repeat itself and this time around it can exploit that enormous ore resource. And there are at least a couple of reasons to believe (famous last words in finance) that \"this time might be different\". The first is that, in retaliation against Donald Trump's latest metal tariffs, China has begun to put export limits on tungsten. How this will work in practice remains unclear (remember that like most markets China controls, the way tungsten sales function is almost completely opaque) but if it encourages domestic buyers to look for local suppliers, that could help the mine to find buyers. After all, in theory, it could produce a few thousand tonnes of the metal each year, which would instantly leapfrog Britain to become the world's second or third-biggest producer (albeit a long way down from China). Supplies matter more than ever The second big shift comes back to defence. With the world remilitarising, all of a sudden tungsten supplies matter more than ever. And since defence suppliers pay outsized attention to where metals come from, again, that might allow a British tungsten mine to succeed where predecessors have failed. Add to this the fact that the mine itself is nearly ready to be exploited and that the new owners reckon they've ironed out the problems that beset their predecessors, and it's a compelling case. They think they could be getting metal out of the ground as soon as next year. But those overarching challenges haven't gone away. And nor has another, bigger problem facing the entire industry, not just in the UK but - perhaps even more so - in the US. How can you plan in a world where you just don't know what's coming out of the White House in the next few days, let alone the next few years? Consider: imagine you're a stainless steel producer or an aluminium smelter in the US. Those 25% tariffs mean all of a sudden in theory you have a competitive advantage over anyone shipping metal into the country. All of a sudden, there's a strong case to build a smelter or a stainless steel melting shop. So you get to work looking for backers. Uncertainty creates challenges But building a plant like this takes time. You need to find a site, connect it to high-voltage power, and build the facilities and all the necessary infrastructure. Best case scenario: it might take a couple of years, but even that is ambitious. And as you contemplate this and map out your plans, those backers will ask you the same nagging question you've been asking yourself: sure, the economics of an aluminium smelter might add up today; but what if the president changes his mind tomorrow, or next year? What if those tariffs are pulled by the next president? Then, all of a sudden, the sums very much don't add up. All of which is to say, uncertainty around tariffs is a challenge not just for those companies hoping to ship products to America, but for American firms hoping to benefit from this trade war. And bear in mind metals are only the first chapter of what could be a long saga, which ends up engulfing all corners of American trade. These are unpredictable times, however you look at it."
    },
    {
        "title": "Heathrow Airport reopens for some flights after fire led to 'unprecedented' shutdown",
        "description": "Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers.",
        "url": "https://news.sky.com/story/heathrow-says-it-will-reopen-after-more-than-1000-flights-cancelled-and-200000-passengers-affected-by-shutdown-13332920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250321234610",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-21 00:42:00",
        "Headline": "The blaze triggered a \"significant power outage\" that resulted in more than 1,000 flights to and from the airport being cancelled.",
        "Content": " Heathrow Airport has reopened for a limited number of flights after a large fire at a nearby electrical substation disrupted travel for around 200,000 passengers. Counter-terror police were leading the investigation into the cause of the blaze, which triggered a \"significant power outage\" that led to more than 1,000 flights to and from the airport being cancelled. Heathrow's boss apologised to passengers, describing the disruption \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". Follow live updates on Heathrow shutdown In an update on Friday evening, the Metropolitan Police said the cause of the fire is believed to be non-suspicious, while the London Fire Brigade (LFB) announced its investigation will focus on the electrical distribution equipment. Heathrow is expected to run a full schedule on Saturday. The fire that caused the power outage is at the North Hyde substation in Hayes, about 1.5 miles to the north of the west London airport. LFB received the first reports of the fire at 11.23pm on Thursday. Heathrow initially announced the airport would be closed until 11.59pm on Friday but later said repatriation flights for passengers diverted to other airports in Europe would resume on Friday evening.  Several airlines announced they would restart scheduled flights both to and from Heathrow, including British Airways (BA), Air Canada and United Airlines. A BA flight to Riyadh, in Saudi Arabia, took off just before 9pm after a slight delay to its expected departure time. Restrictions on overnight flights have also been temporarily lifted to help ease congestion, the Department of Transport said. Read more:What we know so farAnalysis: Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy?  Airport disruption nearly 'as big as it gets' Heathrow Airport's chief executive Thomas Woldbye told reporters the flights taking off on Friday evening would help make sure the airport has \"operations in place\" for Saturday morning. He continued: \"Tomorrow morning we expect to be back in full operation, so 100% operation as a normal day.\" Mr Woldbye added that passengers who were planning to fly from Heathrow on Saturday should arrive at the airport in time for their flight as normal. The chief executive also apologised to the passengers whose journeys had been disrupted but said he would not have closed down the airport unless there were \"severe safety concerns\". Asked whether the disruption caused by the fire suggested there was a \"weak point\" in Heathrow's operations, Mr Woldbye replied: \"We can't guard ourselves 100%. This has been a major incident. \"Short of anybody getting hurt, this is as big as it gets for our airport and we are actually coming back quite fast.\" He added: \"This is unprecedented, it's never happened before.\" It comes after Number 10 said earlier that there are questions to be answered about how the fire has caused so much chaos. Flight delayed or cancelled? What are your rights? Mr Woldbye said: \"Our procedures have worked the way they should... Of course the prime minister should ask questions and we'll be happy to answer them.\" Earlier, the airport said it expected \"significant disruption over the coming days\" and warned passengers \"not travel to the airport under any circumstances until the airport reopens\". All trains to Heathrow were suspended.  Some power has returned to Terminal 4, with lights in the main building and lifts in the multi-storey car park operational again. The disruption began late on Thursday night when fire crews were called to a blaze in west London at an electricity substation serving Heathrow and local properties.  You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material. Thousands of passengers stranded Heathrow is one of the world's busiest airports and had a record 83.9 million passengers last year, with a plane landing or taking off around every 45 seconds. The figure, from the Civil Aviation Authority, is equivalent to about 229,000 passengers using the hub every day. Aviation analytics firm Cirium told the New York Times that it believed as many as 290,000 passengers could have been affected on Friday - enough to fill Wembley Stadium three times. Oil fire still alight at substation LFB deputy commissioner Jonathan Smith told reporters at a news conference the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies have been restored. Earlier LFB said 10 engines and around 70 firefighters had been working to extinguish the blaze. Pictures from the scene showed large flames and plumes of thick black smoke. The LFB said in a statement that 5% of the fire was still alight as of 7pm on Friday."
    },
    {
        "title": "UK government borrowing and spending defies expectations, adding to tax rise or spending cut pressure",
        "description": "Government spending and borrowing have defied expectations, resulting in \"perilous\" public finances and placing pressure on the chancellor to raise taxes or cut spending. ",
        "url": "https://news.sky.com/story/uk-government-borrows-more-than-expected-putting-pressure-on-rachel-reeves-13332973",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-rachel-reeves-media_6772166.jpg?20241210105047",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-21 06:38:00",
        "Headline": "Public sector finance data will be unwelcome to Chancellor Rachel Reeves ahead of her spring statement, and to a government determined to have an iron grip on spending. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Government spending and borrowing have defied expectations, resulting in \"perilous\" public finances and placing pressure on the chancellor to raise taxes or cut spending.  Government borrowing last month was £15bn more than at this point last year, with the deficit higher than economists predicted, according to official figures. The gap between what the government takes in and what it spends was £10.7bn in February, the Office for National Statistics said, as spending was higher and tax takes were lower than forecast. The sum is the fourth-highest since records began in 1993 and £4.1bn higher than anticipated by economists polled by the Reuters news agency. Money blog: Trustpilot 'can't be trusted' say small businesses Tax takes have been below the estimates provided by independent forecasters the Office for Budget Responsibility (OBR). Tax receipts are now £11.4bn below the OBR forecast 11 months into the financial year while borrowing is £20.4bn higher. This time last year, the government borrowed £117.5bn but the figure has soared to £132.2bn, a £15bn increase, ONS data showed. Tax rises and spending cuts to come It's unwelcome news just days before Chancellor Rachel Reeves gives an update on the health of the British economy in her spring statement. The surplus reported last month was revised down by £2.1bn, worsening the picture. Public finances have been described as being in a \"perilous\" state by respected thinktank the Resolution Foundation. Other economic observers have said the news will mean spending cuts and tax rises. Read more:How tariffs are wreaking chaos in the UK metal industry Analysts Pantheon Macro predicted cuts will be made at next week's spring statement while tax rises will be announced in the October budget. The sentiment was echoed by the Resolution Foundation, which said \"if the economy doesn't turn a corner soon tax rises will need to come back into play\". Government reaction In response to the figures, chief secretary to the Treasury Darren Jones said: \"We're refocusing the public sector on our missions and, for the first time in 17 years, going through every penny of taxpayer money line by line, to make sure it is helping us secure Britain's future\". \"At the core of this urgent mission is sound public finances, based on our non-negotiable fiscal rules. This government will never play fast and loose with the public finances.\""
    },
    {
        "title": "Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected",
        "description": "Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation.",
        "url": "https://news.sky.com/story/heathrow-closure-throws-travel-plans-into-chaos-as-weddings-rugby-tours-and-arctic-circle-trips-affected-13333120",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nicolas-francescantonio_6863052.jpg?20250321095110",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-21 10:39:00",
        "Headline": "Forty-five children were supposed to graduate to their first junior rugby games this weekend after fundraising for a trip to Dublin for a year - now, they don't know if they will even make the matches.",
        "Content": " Thousands of passengers are facing delays and cancellations after Heathrow, Europe's busiest airport, was forced to close following a fire at a nearby substation. Travellers heading to weddings, the Arctic Circle, rugby matches and birthdays have been left scrambling to find alternatives.  Around 1,357 flights have been affected, according to data from Flight Radar. Follow live updates on Heathrow closure Sleeping in the snow Jordan Wylie MBE told Sky News he is sleeping in the snow tonight after his flight home from northern Sweden was cancelled. The adventurer was training for an Antarctic expedition where he will attempt to climb a series of unclimbed and unnamed peaks in aid of the Army Cadets Charity. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 \n                  Heathrow closure: Sir Keir Starmer receiving 'regular updates'\n                 However, his training has been extended by one more day because of the Heathrow chaos and he will sleep in his tent again. Read more: What are your rights if your flight is delayed or cancelled? He will now have to fly \"from Northern Sweden to Stockholm to Frankfurt to Heathrow but not for at least 24 hours\", according to representatives he's spoken to from Scandinavia Airlines (SAS). Long-awaited best friend's wedding One woman in Minneapolis said her husband would miss his best friend's wedding after their flight was turned around over the Atlantic Ocean. \"This wedding is a huge deal because it got postponed due to Covid, then their toddler got leukaemia,\" she said. \"Now the wedding is finally happening. We are so gutted,\" she said, adding it was the family's first international flight. \"We are back in our car in Minneapolis heading home at 2.40am with our toddlers wide awake in the back seat wondering why we aren't in London.\" \"Absolute shambles\" says passenger heading back for new job Lloyd Mcbratney described \"panic and confusion\" on his flight from Kuwait to Heathrow when the plane \"suddenly U-turned without explanation\". He and his girlfriend were travelling back from a trip to the Philippines but are now waiting at an airport hotel in Kuwait. \"We have no idea when we will be going back home, 0 guidance, 0 communication,\" he told Sky News. To make matters worse, Mr Mcbratney starts a new job on Monday. \"Absolute shambles,\" he said. Rugby juniors missing out on 'trip of a lifetime' Alex Wiffen says the London Irish Under 12s rugby team have had the \"trip of a lifetime\" to Dublin thrown into disarray. Forty-five girls and boys were supposed to graduate from minis to their first junior rugby games this weekend after fundraising for the trip for a year, he said. \"It's a trip that's been happening for 40 years and it's the inaugural trip for the girls' team,\" says Alex. \"Our flights at 8am this morning were cancelled and now there is no way to get to Dublin.\" The players and 70 parents are now just \"praying we can get there ASAP\" before their first match against Clontarf Rugby Club tomorrow morning. Stuck at Manchester airport  Nigel and Pam Turner have been diverted into Manchester Airport from Heathrow after they flew out from Dubai. They were expecting to land at Heathrow at 7am - but are now stuck waiting in Manchester Airport until 7pm for an onward flight to Guernsey, which they paid for themselves. The couple said they only found out what had happened while they were in the air - when they saw the couple in front had the news on their screens, and realised there had been a fire affecting Heathrow. It wasn't until the plane was over the English Channel they found out they would actually be landing in Manchester. Speaking from a coffee shop at T2 arrivals, they said they were in good spirits, but hoping to find somewhere comfortable to wait out the nine hours before their flight out. \"C'est la vie\" Nigel said. \"Nothing we can do about it\".  Husky-sledding in the Arctic Circle John Climpson said he was up at 3am to fly out to the north of Sweden to start a 240km husky sledding challenge in the Arctic Circle. \"Now the whole trip might be cancelled,\" he said. \"Everyone is now desperately trying to rebook hotel rooms at the Terminal 2 Premier Inn.\"  Confusion in Shanghai A family of four coming home from a two-week tour of China said they found out their flight home was \"delayed\" at check-in at Shanghai airport. After travelling from Beijing to Xi'an and Shanghai, Sohan Shah and his family, from Croydon, found confusing scenes at the airport. \"Due to the language barrier staff could not explain to us why, until we saw the Sky News report explaining the Heathrow fire,\" said Mr Shah. Read more from Sky News:Heathrow Airport closed after 'significant power outage'How Donald Trump's tariffs are wreaking chaos in British industryPutin will break any peace deal where Ukraine is not 'defended' \"[The airport staff] kept sending us back and forth to different counters where we have now been rebooked to a flight to London Gatwick at 1.30 in the morning,\" he told Sky News.\"They eventually put us in a coach to a local hotel and provided food vouchers for the night,\" he said. From Derby to DC for 50th birthday Virgin Atlantic passenger Andy was supposed to be flying from Heathrow to Washington DC today to start his 50th birthday celebrations.  Instead, he is stuck in a hotel room he booked for last night to break up the travel day. \"I live in Derby - and I'm unsure whether to stay in London or go home and wait to hear more,\" he said. Heathrow has cancelled all flights until midnight on Friday. U-turn to the US Rafa, from London, was on a flight from Dallas when the pilot U-turned at 4am. \"Cannot believe that Heathrow, one of the world's busiest and best airports, is not running on some sort of independent power to carry on operations,\" he said. \"And the decision made to turn around to America is crazy considering how many flight options [there] are from Germany and France back to the UK.\" He added: \"Nightmare on all accounts.\" Anniversary celebrations delayed Carly and Mel were due to fly to Bali with Singapore Airlines this morning for their seven-year anniversary before finding out what had happened at 5.20am. After working out their options, they managed to book a flight from Charles de Gaulle in Paris to Singapore. They then headed to Victoria Coach station before overnight travel to the French capital. From there, they'll make their way to Denpasar in Indonesia before another connecting flight will take them to Labuan Bajo and then to the island of Komodo. \"By the time we arrive, we will have had to take a train, coach, another train and three flights, but thanks to our own tenacity and the help of Singapore Airlines we will at least make it!\""
    },
    {
        "title": "Heathrow shutdown: Cost of airport closure could be worth millions",
        "description": "The closure of Heathrow Airport could cost millions of pounds, with travellers and goods grounded as Europe's largest airport spent the vast majority of Friday without power.",
        "url": "https://news.sky.com/story/heathrow-shutdown-cost-of-airport-closure-could-be-worth-millions-13333089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport-passengers_6863283.jpg?20250321142922",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-21 09:37:00",
        "Headline": "Airlines and the broader economy are to be hurt by the closure. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The closure of Heathrow Airport could cost millions of pounds, with travellers and goods grounded as Europe's largest airport spent the vast majority of Friday without power. As well as airlines being impacted by diversions and associated compensation, the UK economy will be affected by the absence of cargo, tourists and business travellers landing for a day. In the early hours of Friday morning Heathrow announced it would be closed for the rest of the day with no flights landing or taking off due to a \"significant\" power outage caused by a fire at an electricity substation. The cause of the fire is not yet known. Heathrow closure latest: Counter-terrorism police leading investigation Every year Heathrow handles nearly £200bn worth of cargo which breaks down to goods priced at £543m travelling through every day, according to the airport. Top exports from the airport are salmon, books and medicine, while items most commonly imported through the hub are vegetables, flowers and compounds found in medicine, plastics and perfume.  Nearly half (48%) of all UK air cargo was processed through Heathrow in 2023, meaning around 0.13% of the UK's annual cargo was due to be handled today. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected\n                 \n                  Heathrow closure: Sir Keir Starmer receiving 'regular updates'\n                 The broader economy cost Researchers at the Centre for Economics and Business Research (CEBR) calculated the economic impacts of the airport and estimated in 2021 the value of trade it contributed would reach £204bn by 2025. Money blog: Trustpilot 'can't be trusted' say small businesses It would contribute £4.7bn to the economy, it forecast, meaning a daily contribution of £12.88m, a figure that could be lost by the airport's shutdown. The financial loss could be in the region of hundreds of millions of pounds, according to the founder of Endau Analytics, an aviation industry advisory firm. A hit to airlines Airlines and suppliers alone could have costs of \"at least\" £20m for a day of halted operations, according to travel expert Paul Charles, a former Virgin Atlantic communications director and chief executive of travel consultancy The PC Agency. The figure is so high as it includes an estimate of expenses for passengers, crew accommodation, additional transport, fuel and other costs for the aircraft themselves. Analysts at investment bank Jefferies said compensation for delays could knock 1% to 3% off profits at BA and Aer Lingus parent company IAG. However, the head of the Spanish airlines association Javier Gandara said the outage was likely considered a force majeure event, meaning passengers would not be entitled to compensation. In a force majeure situation, airlines have to assist passengers by providing accommodation and meals but don't have to pay compensation. Aside from the costs of dealing with the closure the company values have dropped as share prices fell. IAG, which also owns airlines Vueling and Iberia, saw its share price fall 2.34% as of 3pm on Friday, wiping £326m off the company value. Similarly, EasyJet shed £33.5m with a 0.9% stock fall and Wizz Air lost £38.37m after a £2.18% drop in share price."
    },
    {
        "title": "Ad giant WPP launches £75m sale of in-flight media service Spafax",
        "description": "WPP, the FTSE-100 marketing services group, is in talks to sell a provider of in-flight entertainment which counts some of the world's leading airlines among its clients.",
        "url": "https://news.sky.com/story/ad-giant-wpp-launches-16375m-sale-of-in-flight-media-service-spafax-13333162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-cabin-interior-airplane_6863173.jpg?20250321120530",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-21 11:56:00",
        "Headline": "The embattled FTSE-100 marketing services group is working with bankers on a sale of a provider of entertainment services to dozens of airlines, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n WPP, the FTSE-100 marketing services group, is in talks to sell a provider of in-flight entertainment which counts some of the world's leading airlines among its clients. Sky News has learnt that the London-listed owner of advertising agencies such as Ogilvy, is working with bankers on a disposal of Spafax, which it bought a quarter of a century ago. Sources said on Friday that WPP hoped to fetch between £50m and £75m for Spafax. While the proceeds would not be material to a company with a market capitalisation of £6.8bn, the process highlights the pressure on Mark Read, its chief executive. Shares in WPP have fallen sharply during his tenure, and have slid a further 13% during the last 12 months. The company's new chairman - former BT Group chief Philip Jansen - is keen to oversee a reshaping of WPP to embrace rapid developments in artificial intelligence. WPP acquired Spafax in 2000 when the group was run by Sir Martin Sorrell. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected\n                 \n                  A long history of Heathrow's third runway plans\n                 At that point, Spafax published the Tate Galleries' in-house magazine as well as providing in-flight media services to dozens of airlines. Suitors for the business, whose clients have included British Airways, Emirates, JetBlue and Latam, are said to include trade bidders and private equity firms. The sale is being handled by JEGI CLARITY, an adviser on media industry deals. A WPP spokesman declined to comment."
    },
    {
        "title": "'British people don't want culture war on climate' says Ed Miliband as cuts to GB Energy ruled out",
        "description": "Ed Miliband said he is \"not anticipating\" cuts to GB Energy ahead of the chancellor announcing the biggest spending squeeze on Whitehall in years.",
        "url": "https://news.sky.com/story/british-people-dont-want-culture-war-on-climate-says-ed-miliband-as-cuts-to-gb-energy-ruled-out-13332995",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ed-miliband-london-power-tunnels_6863115.jpg?20250321110506",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-03-21 07:25:00",
        "Headline": "The energy secretary has hit out at the Tories' scepticism on net zero as he said Labour's climate plans would grow the economy.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Ed Miliband said he is \"not anticipating\" cuts to GB Energy ahead of the chancellor announcing the biggest spending squeeze on Whitehall in years. The energy secretary told Sky News Breakfast with Anna Jones that his department got the largest funding settlement in the October budget because Rachel Reeves knows clean power \"is the root to grow our economy\". Politics live: Defence secretary issues nuclear warning to UK's enemies He also accused Tory leader Kemi Badenoch of starting a \"culture war on climate\" with her recent claim that reaching net zero by 2050 is \"impossible\" without a decline in living standards.  \"She's completely wrong and I think she's way out of step with the British people,\" said Mr Miliband. \"I don't think the British people want a culture war on climate, which I think is what she wants.\" Ms Badenoch's comment creates a big dividing line with Labour, who made setting up a state-owned clean energy company, GB Energy, a flagship promise in their manifesto. \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 \n                  Net Zero Secretary Ed Miliband says he will not resign if govt backs Heathrow third runway - after years of opposition\n                 \n                  Ed Miliband tells Sky News he doesn't regret opposing airstrikes in Syria against Assad in 2013\n                 It has been promised £8.3bn of capital over this parliament, with the money to be invested in clean power projects that the government hopes will bring household energy bills down by £300 annually by 2030. Only £125m was allocated for the project in the October budget for 2025-26 and there has been speculation that the overall funding promised could be cut as Ms Reeves needs to balance the books in her spring statement on Wednesday.  But Mr Miliband told Sky News: \"I'm certainly not anticipating cuts in Great British Energy. We made a manifesto commitment of around £8.3bn investment in GB Energy. The plan is to stick to that.\" More rooftop solar panels for schools and NHS He said clean energy was important for economic growth and security - highlighting GB Energy's first project to put rooftop solar panels on around 200 schools and 200 NHS sites. Announced by the government on Friday morning, it is hoped this will save schools up to £25,000 per year and NHS sites up to £45,000 per year. Read More:Starmer's 1,000 jobs pledge could take 20 years, GB Energy boss admits Any climbdown on GB Energy would risk causing another row within Labour on climate. While in opposition last year, Sir Keir Starmer ditched a flagship pledge to invest £28bn a year into clean projects, blaming the Tories for \"crashing the economy\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 At the time, the party insisted its commitment to becoming a clean superpower by 2030 remained unchanged, and that is one of their main pledges in the 2024 manifesto. However Ms Reeves is under pressure as new figures reveal the budget deficit she was looking to make up in her spring statement is even higher than expected, and the UK is set for a major downgrade in growth forecasts. Ms Reeves is not expected to make tax changes in the spring statement, with a large package of spending cuts on the cards instead. Despite Labour's pledge not to return to austerity, this could amount to the biggest spending squeeze on Whitehall in years, putting it on a collision course with its backbenchers. There has already been a backlash over the £5bn cut to the welfare bill, with ministers forced to deny they are now a \"centre-right government\" and \"turning into the Tories\"."
    },
    {
        "title": "Heathrow closure: What are your rights if your flight is delayed or cancelled?",
        "description": "London Heathrow was forced to close on Friday due to a fire at a nearby electricity substation.",
        "url": "https://news.sky.com/story/heathrow-closure-what-are-your-rights-if-your-flight-is-delayed-or-cancelled-13258382",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-terminal-fire_6862947.jpg?20250321084018",
        "type": "Business",
        "Author": "Jake Levison",
        "Date Published": "2025-03-21 03:00:00",
        "Headline": "Heathrow is one of the world's busiest airports and had a record 83.9 million passengers last year, with a plane landing or taking off around every 45 seconds.",
        "Content": "\n          News reporter\n       London Heathrow was forced to close on Friday due to a fire at a nearby electricity substation. More than 1,000 flights to and from Europe's busiest airport were cancelled, causing disruption for about 200,000 passengers, before the airport reopen for a limited number of plane journeys on Friday evening. Follow live updates on Heathrow disruption So what are the rights of passengers if their flights are delayed or cancelled?  Your rights during delays Your flight is covered by UK law if it departs or arrives at a UK airport on a UK or EU airline, or arrives at an EU airport on a UK airline. When it comes to significant delays, UK law says airlines must provide you with care and assistance. Significant delays are classed as: Here's what the law says the airline must provide you with until it is able to fly you to your destination: It says this must be provided for you for however long delays last, irrespective of what has caused them. Airlines may not always be able to arrange care and assistance for all passengers during major disruptions directly, but the UK Civil Aviation Authority (CAA) says you can organise the things listed for yourself and then claim the cost back from your airline later if you keep every receipt and do not spend more than is deemed reasonable. In other words, don't splash out on things like alcohol and luxury hotels during your wait and expect to claim your money back later. Who isn't covered? People who are not flying on a UK or EU airline from outside of Europe are \"the people to be concerned about\", travel expert Simon Calder told Sky News. \"Those airlines, because they're not British, do not have any obligations when they are flying to the UK from their home countries,\" he says. \"So they might look after you - but they can't just turn around and say, 'look, this isn't our fault'. 'You're on your own. Good luck finding a hotel'. And then you will try and claim from your travel insurance.\" Mr Calder gives the example of a Qatar Airways flight from a destination in the Gulf to Heathrow. Spain's airlines association has suggested the fire could be treated as a so-called 'force majeure' or 'act of God', which exempts airlines from having to give compensation. Heathrow has not yet commented on this, however.  What are your rights if your flight is cancelled? If your flight is cancelled, the airline must either give you a refund or book you on an alternative flight. You can get your money back for all parts of a ticket you haven't used, the CAA says. If you have booked a return flight and the outbound leg is cancelled, for example, you can get the full cost of the return ticket back from your airline. \"If you are a transfer passenger and you have already completed part of your journey, you are also entitled to a flight back to your original departure point when your connecting flight is cancelled and you decide not to continue your journey,\" it adds. If you still want to travel, your airline must find you an alternative flight - whether it is the next available one, or a flight at an alternative, later date. If another airline is flying significantly sooner than yours is able to offer, you may have the right to be booked onto a rival airline's flight, but this has to be negotiated with the company. British Airways is the biggest operator at Heathrow. Its cancellation policy states: \"We'll do our best to offer you a new flight and you'll be able to change it once for free. If you'd prefer, you can apply for a refund. \"If you made your booking via a travel agent or tour operator and your departure time is more than 24 hours away, get in touch with them directly to find out more about your options or request a refund.\" On last-minute cancellations, Naveen Dittakavi, founder and chief executive of Next Vacay, said: \"If you're already at the airport once the flight is cancelled, the best thing you can do is stay calm - you are protected against many things that might go wrong. \"Try calling the airline helpline rather than waiting to speak directly with the airport staff. The helpline is often more flexible and may provide you with an e-credit or voucher, or flexibility to change your travel dates quickly.\" Can you get compensation? In some cases, airlines may have to provide compensation if your flight arrives at its destination more than three hours late - but that is only if the delay is deemed to be your airline's fault. Disruptions caused by things deemed \"extraordinary circumstances\" are not eligible for compensation, according to the CAA."
    },
    {
        "title": "'British people don't want culture war on climate' says Ed Miliband as cuts to GB Energy ruled out",
        "description": "Ed Miliband said he is \"not anticipating\" cuts to GB Energy ahead of the chancellor announcing the biggest spending squeeze on Whitehall in years.",
        "url": "https://news.sky.com/story/british-people-dont-want-culture-war-on-climate-says-ed-miliband-as-cuts-to-gb-energy-ruled-out-13332995",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ed-miliband-london-power-tunnels_6863115.jpg?20250321110506",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-21 07:25:00",
        "Headline": "The energy secretary has hit out at the Tories' scepticism on net zero as he said Labour's climate plans would grow the economy.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Ed Miliband said he is \"not anticipating\" cuts to GB Energy ahead of the chancellor announcing the biggest spending squeeze on Whitehall in years. The energy secretary told Sky News Breakfast with Anna Jones that his department got the largest funding settlement in the October budget because Rachel Reeves knows clean power \"is the root to grow our economy\". Politics live: Defence secretary issues nuclear warning to UK's enemies He also accused Tory leader Kemi Badenoch of starting a \"culture war on climate\" with her recent claim that reaching net zero by 2050 is \"impossible\" without a decline in living standards.  \"She's completely wrong and I think she's way out of step with the British people,\" said Mr Miliband. \"I don't think the British people want a culture war on climate, which I think is what she wants.\" Ms Badenoch's comment creates a big dividing line with Labour, who made setting up a state-owned clean energy company, GB Energy, a flagship promise in their manifesto. \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 \n                  Net Zero Secretary Ed Miliband says he will not resign if govt backs Heathrow third runway - after years of opposition\n                 \n                  Ed Miliband tells Sky News he doesn't regret opposing airstrikes in Syria against Assad in 2013\n                 It has been promised £8.3bn of capital over this parliament, with the money to be invested in clean power projects that the government hopes will bring household energy bills down by £300 annually by 2030. Only £125m was allocated for the project in the October budget for 2025-26 and there has been speculation that the overall funding promised could be cut as Ms Reeves needs to balance the books in her spring statement on Wednesday.  But Mr Miliband told Sky News: \"I'm certainly not anticipating cuts in Great British Energy. We made a manifesto commitment of around £8.3bn investment in GB Energy. The plan is to stick to that.\" More rooftop solar panels for schools and NHS He said clean energy was important for economic growth and security - highlighting GB Energy's first project to put rooftop solar panels on around 200 schools and 200 NHS sites. Announced by the government on Friday morning, it is hoped this will save schools up to £25,000 per year and NHS sites up to £45,000 per year. Read More:Starmer's 1,000 jobs pledge could take 20 years, GB Energy boss admits Any climbdown on GB Energy would risk causing another row within Labour on climate. While in opposition last year, Sir Keir Starmer ditched a flagship pledge to invest £28bn a year into clean projects, blaming the Tories for \"crashing the economy\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 At the time, the party insisted its commitment to becoming a clean superpower by 2030 remained unchanged, and that is one of their main pledges in the 2024 manifesto. However Ms Reeves is under pressure as new figures reveal the budget deficit she was looking to make up in her spring statement is even higher than expected, and the UK is set for a major downgrade in growth forecasts. Ms Reeves is not expected to make tax changes in the spring statement, with a large package of spending cuts on the cards instead. Despite Labour's pledge not to return to austerity, this could amount to the biggest spending squeeze on Whitehall in years, putting it on a collision course with its backbenchers. There has already been a backlash over the £5bn cut to the welfare bill, with ministers forced to deny they are now a \"centre-right government\" and \"turning into the Tories\"."
    },
    {
        "title": "Heathrow closure: Sir Keir Starmer receiving 'regular updates'",
        "description": "Sir Keir Starmer said he is receiving \"regular updates\" about the fire that shut down Heathrow Airport as counter-terror police lead enquiries into its cause. ",
        "url": "https://news.sky.com/story/heathrow-closure-backup-generator-that-could-have-kept-airport-open-also-affected-by-fire-13333071",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hayes-electrical-heathrow_6863011.jpg?20250321092157",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-21 09:11:00",
        "Headline": "The huge impact of a fire near Heathrow Airport has raised questions about the safety of the UK's critical infrastructure.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer said he is receiving \"regular updates\" about the fire that shut down Heathrow Airport as counter-terror police lead enquiries into its cause.  In a post on X, the prime minister acknowledged the \"distress and disruption\" caused by the blaze at the nearby electricity substation, which has left thousands of homes without power and resulted in at least 1,300 flights being cancelled.  Follow live updates on Heathrow closure Sir Keir said: \"I'm receiving regular updates and I'm in close contact with partners on the ground. \"Thanks to our emergency workers for keeping people safe.\" Following the post, the Metropolitan Police confirmed its counter-terrorism command is taking the lead in investigating the fire's cause. A spokesperson stressed there was no indication of foul play yet but \"retain an open mind at this time\". They added: \"Given the location of the substation and the impact this incident has had on critical national infrastructure, the Met's Counter Terrorism Command is now leading enquiries. \"This is due to the specialist resources and capabilities within that command that can assist in progressing this investigation at pace to minimise disruption and identify the cause.\" The prime minister's official spokesperson cautioned against speculation when asked if foul play could be involved. He also said that while the priority is getting the fire under control, there are questions to be answered on what can be done to prevent this in future and \"as part of that it wouldn't be unreasonable to expect checks on resilience to be carried out\". Experts are alarmed by the scale of the fire, which happened after a transformer at a North Hyde substation caught alight, the London Fire Brigade (LFB) said. Earlier, Energy Secretary Ed Miliband told Sky News that while the cause \"is not clear\" a back-up generator that could have kept Heathrow open was affected by the fire. Asked what this says about the safety of our critical infrastructure, Mr Miliband said he didn't want to \"jump to conclusions\" but added: \"I understand it from the national grid there was a back-up generator, but that was also affected by the fire, which gives a sense of how unusual and unprecedented it was. \"There is a second back-up which they are seeking to use to restore power, so there are back-up mechanisms in place, but given the scale of this fire the back-up mechanisms also seem to have been affected.\" Speaking later on Good Morning Britain, he said the National Grid told him they had not seen \"anything like the scale\" of what happened with the fire and admitted that Heathrow's closure makes the airport look \"quite vulnerable\". Substation fire 'not common at all' Dr Robin Preece, Reader in Future Power Systems at the University of Manchester, said the transformers at the substation are filled with oil so if they catch fire it makes the blaze \"large and difficult to control\". He said fires like this are \"not common at all\" but the electricity grid \"will have sufficient alternative supplies to get pretty much everyone back on supply very quickly\". Dr Preece said the substation is not the only one that supplies Heathrow but perhaps supplies \"some of the more critical services at the airport\". He added: \"To restore power, there will be some switching happening across the network to allow the electricity to find alternative paths to get to affected areas.\" Heathrow will remain shut until midnight due to the power outage caused by the fire. Read More:What are your rights if your flight is cancelled? Tracking site Flightradar24 estimates 1,357 flights would be affected (679 into and 678 out of Heathrow) today, including around 120 which were already in the air this morning before the shutdown. A number of flights were turned around and returned to airports in Canada and the United States, while Gatwick Airport accepted seven diverted flights. Passengers have been warned to stay away from the airport and all trains to Heathrow have been suspended. Politics latest: Defence secretary issues nuclear warning A National Grid spokesperson said the fire had damaged equipment and they were \"working at speed to restore power supplies as quickly as possible\". A Heathrow spokesperson said: \"Whilst fire crews are responding to the incident, we do not have clarity on when power may be reliably restored. \"We expect significant disruption over the coming days and passengers should not travel to the airport under any circumstances until the airport reopens. \"We will provide an update when more information on the resumption of operations is available. We know this will be disappointing for passengers and we want to reassure that we are working as hard as possible to resolve the situation.\""
    },
    {
        "title": "UK government borrowing and spending defies expectations, adding to tax rise or spending cut pressure",
        "description": "Government spending and borrowing have defied expectations, resulting in \"perilous\" public finances and placing pressure on the chancellor to raise taxes or cut spending. ",
        "url": "https://news.sky.com/story/uk-government-borrows-more-than-expected-putting-pressure-on-rachel-reeves-13332973",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-rachel-reeves-media_6772166.jpg?20241210105047",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-21 06:38:00",
        "Headline": "Public sector finance data will be unwelcome to Chancellor Rachel Reeves ahead of her spring statement, and to a government determined to have an iron grip on spending. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Government spending and borrowing have defied expectations, resulting in \"perilous\" public finances and placing pressure on the chancellor to raise taxes or cut spending.  Government borrowing last month was £15bn more than at this point last year, with the deficit higher than economists predicted, according to official figures. The gap between what the government takes in and what it spends was £10.7bn in February, the Office for National Statistics said, as spending was higher and tax takes were lower than forecast. The sum is the fourth-highest since records began in 1993 and £4.1bn higher than anticipated by economists polled by the Reuters news agency. Money blog: Trustpilot 'can't be trusted' say small businesses Tax takes have been below the estimates provided by independent forecasters the Office for Budget Responsibility (OBR). Tax receipts are now £11.4bn below the OBR forecast 11 months into the financial year while borrowing is £20.4bn higher. This time last year, the government borrowed £117.5bn but the figure has soared to £132.2bn, a £15bn increase, ONS data showed. Tax rises and spending cuts to come It's unwelcome news just days before Chancellor Rachel Reeves gives an update on the health of the British economy in her spring statement. The surplus reported last month was revised down by £2.1bn, worsening the picture. Public finances have been described as being in a \"perilous\" state by respected thinktank the Resolution Foundation. Other economic observers have said the news will mean spending cuts and tax rises. Read more:How tariffs are wreaking chaos in the UK metal industry Analysts Pantheon Macro predicted cuts will be made at next week's spring statement while tax rises will be announced in the October budget. The sentiment was echoed by the Resolution Foundation, which said \"if the economy doesn't turn a corner soon tax rises will need to come back into play\". Government reaction In response to the figures, chief secretary to the Treasury Darren Jones said: \"We're refocusing the public sector on our missions and, for the first time in 17 years, going through every penny of taxpayer money line by line, to make sure it is helping us secure Britain's future\". \"At the core of this urgent mission is sound public finances, based on our non-negotiable fiscal rules. This government will never play fast and loose with the public finances.\""
    },
    {
        "title": "Jack Fincham: Love Island star wins appeal against prison sentence for dangerous dog offences",
        "description": "Former Love Island winner Jack Fincham has won an appeal against his prison sentence for two dangerous dog offences.",
        "url": "https://news.sky.com/story/former-love-island-winner-jack-fincham-wins-appeal-against-prison-sentence-for-dangerous-dog-offences-13333200",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jack-fincham-love-island_6863222.jpg?20250321143708",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-21 13:11:00",
        "Headline": "Fincham, 32, was originally sentenced to six weeks imprisonment after pleading guilty to two counts of having a dangerously out-of-control dog. On Friday, a judge replaced the custodial sentence with an extension of a previous suspended one for unrelated drug and fraud offences.",
        "Content": "Former Love Island winner Jack Fincham has won an appeal against his prison sentence for two dangerous dog offences. Fincham, 32, was sentenced to six weeks imprisonment at Southend Magistrates' Court on 29 January after pleading guilty to two counts of having a dangerously out-of-control black cane corso. But within hours of the sentencing, he was released on conditional bail and vowed to appeal it. On Friday, Fincham, who won the ITV dating show with Dani Dyer in 2018, was told by a judge at Basildon Crown Court that the original sentence had not been \"just in the circumstances\". Instead, Judge Samantha Leigh set aside the custodial sentence and extended a suspended sentence he was given in March last year for two unrelated offences in 2023 - drug driving and fraudulent use of a registered trademark. That order of 12 weeks custody - suspended for 18 months - has been lengthened by three months, Judge Leigh told the court. Prosecutors said Fincham's dog, Elvis, bit and injured the arm of a runner named Robert Sudell in Swanley, Kent, in September 2022. Separately in June 2024, the dog grabbed a woman's leg in Fincham's hometown of Grays, Essex. It left no injury but the animal was said to be out of control. Fincham attended a police interview of his own volition that month, when he received a caution and was told to keep the dog muzzled. Prosecuting, Hannah Steventon said police then attended a hotel in August 2024 following reports the dog had been in a public pool area and was not on a lead or muzzled. Defending, Richard Cooper, said Fincham had chosen the hotel specifically because it was advertised as \"dog-friendly\" online. He then \"let him off the lead at the swimming pool\", broadcasting the scene to his social media followers, \"of which there are about two million\", he said. Judge Leigh described this as \"his own stupidity\". Read more from Sky NewsDrag queen died after taking ketamineActress 'shell-shocked' at being told to 'bend over'Stalker who 'terrified' Cheryl jailed As part of the original sentence, Fincham was ordered to pay £3,680, including £2,000 in kennelling costs, a fine of £961, and £200 in compensation to Mr Sudell. His lawyer said he had made \"remarkable progress\" since his last court appearance, \"returning to a nine-to-five job\" and boxing. The judge warned him to be \"very careful now\"."
    },
    {
        "title": "Diamond Tiffany earrings swallowed by suspected thief are recovered by Florida police",
        "description": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly &#163;600,000 during his arrest, US police have said.",
        "url": "https://news.sky.com/story/diamond-tiffany-earrings-swallowed-by-suspected-thief-are-recovered-by-florida-police-13333505",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-diamomd-diamond-swallowed_6863657.jpg?20250321214842",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-03-21 21:44:00",
        "Headline": "The suspect was heard saying: \"I should have thrown them out the window\" and asked jail staff: \"Am I going to be charged with what is in my stomach?\", according to an arrest report.",
        "Content": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly £600,000 during his arrest, US police have said. The man, who was detained in Florida, had told staff at a Tiffany & Co store he was interested in buying earrings and a diamond ring on behalf of an Orlando Magic basketball player in February. He was escorted to a VIP room where he could view the jewellery but a short time later, he jumped out of his chair, grabbed the jewellery and forced his way out the door, Orlando Police Department said. Officers obtained the licence plate of the suspect's car through shopping centre security footage and tracked the vehicle. He was pulled over for driving without rear lights in Washington County, almost 340 miles away, a police report said. In the police car, an officer heard the suspect say: \"I should have thrown them out the window,\" and at the Washington County jail he asked staff: \"Am I going to be charged with what is in my stomach?\" according to the arrest report. While some earrings were quickly recovered, the suspect was then transferred to hospital where detectives monitored him as they waited to collect the remaining evidence. The four stolen earrings, valued at $770,000 (£596,000), matched the serial numbers from the jewellery taken from the Tiffany store last month, detectives said. Read more from Sky News:What Heathrow shutdown tells usUS unlikely to replace important steal with domestic version After the jewellery was recovered, the arrested man was taken to Orange County Jail where he faces charges of robbery with a mask and first-degree grand theft."
    }
]