[
    {
        "title": "Trump's state visit begins as Epstein images beamed on to Windsor Castle",
        "description": "Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\".",
        "url": "https://news.sky.com/story/trumps-state-visit-begins-as-epstein-images-beamed-on-to-windsor-castle-13432498",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump_7022635.jpg?20250917004840",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-16 21:37:00",
        "Headline": "The US president's historic second state visit has begun - with him telling journalists upon arrival \"everyone's looking forward to it\". But not everyone greeted him warmly.",
        "Content": " Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\". But as he headed to the residence of the US ambassador to the UK in central London to spend Tuesday night, giant projections of the president alongside paedophile Jeffrey Epstein were beamed on to Windsor Castle by protesters. It is there he will meet with King Charles later today.  Four people were arrested on \"suspicion of malicious communications\" after the images of Mr Trump and Epstein appeared on the landmark, Thames Valley Police said. Mr Trump has faced mounting questions about his relationship with the disgraced late billionaire after messages allegedly sent to him by the president were published by Congress earlier this month. The apparent notes - which Mr Trump denies having written - appeared in a 2003 \"birthday book\" for Epstein which also included messages from Peter Mandelson, who has since been sacked as Sir Keir Starmer's ambassador to the US over his ties to the financier. Foreign Secretary Yvette Cooper was among those who greeted the president and First Lady Melania as they disembarked their official plane at Stansted airport on Tuesday evening. An honour guard of RAF personnel from The King's Colour Squadron lined up as he stepped off the plane. Trump excited to see 'my friend' Charles Speaking to reporters mid-flight, Trump said: \"My relationship is very good with the UK, and Charles, as you know, who's now King, is my friend. \"It's the first time this has ever happened where somebody was honoured twice. So, it's a great honour.\" He told the journalists \"everybody is looking forward to it. You're going to have the best pictures\". To mark the president's arrival, a new UK-US tech deal was announced that could generate billions of pounds of investment for Britain. Sir Keir - who will host Mr Trump at his Chequers country retreat tomorrow - said the deal would deliver \"growth, security and opportunity up and down the country\". Read more:No one does pomp better than Britain The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets underway. The \"tech prosperity deal\", announced as Mr Trump touched down, will see the UK and US co-operate in areas including artificial intelligence (AI), quantum computing and nuclear power. It comes alongside £31bn of investment in Britain from top US tech firms, including £22bn from Microsoft.  'I'm into helping Britain' It also follows the agreement of an economic deal in May that covered a reduction in some of Mr Trump's tariffs. However, the government is understood to have given up hope - for now at least - of reducing the president's levy on steel back down to zero. It currently stands at 25%. Mr Trump had hinted at possible tariff relief for British steel as he boarded Air Force One, telling reporters he was \"into helping\" Britain on refining the trade deal signed earlier this year."
    },
    {
        "title": "Trump will be treated to full pomp and pageantry - and no one does it better than Britain",
        "description": "While the nature of Donald Trump's second state visit is indeed unusual, from the moment Sir Keir Starmer delivered the gold-edged invitation it began a process steeped in tradition.",
        "url": "https://news.sky.com/story/trump-will-be-treated-to-full-pomp-and-pageantry-and-no-one-does-it-better-than-britain-13432061",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-state-visit_7022636.jpg?20250917004120",
        "type": "Home",
        "Author": "Alastair Bruce, Sky News royal commentator",
        "Date Published": "2025-09-16 09:48:00",
        "Headline": "State visits are usually reserved to one per head of state, with Donald Trump last being hosted by the late Queen Elizabeth in 2019. But the full pomp and pageantry once again will be on display as he's hosted by King Charles.",
        "Content": "By Alastair Bruce, Sky News royal commentator   While the nature of Donald Trump's second state visit is indeed unusual, from the moment Sir Keir Starmer delivered the gold-edged invitation it began a process steeped in tradition. State visits are usually reserved to one per head of state, with Trump last hosted by Queen Elizabeth II in 2019. Typically, second-term US presidents are offered a shorter visit, perhaps tea or lunch with the monarch at Windsor Castle. But the red carpet is literally being rolled out once again, with Trump receiving a second full state visit, with all the pomp and pageantry it entails. An indication was given early on in Trump's second term that he'd be receptive to a second state visit, and so - on perhaps the advice of the new prime minister - the King issued a second invitation. The greatest form of tradition is one that always evolves, and so this may now set a new precedent for presidents who are voted out but then return to serve a second term. Any nation can hold a state visit, but what is unique about Britain remains our internationally respected pageantry. Even down to the very invitation - there is a very precise format for inviting someone on a state visit. An invite must be issued, established by international law. Written on a special gold-edged paper, embossed with a golden coat of arms that is issued, it forms part of a historic archive. Breaches of protocol Much has been made in the past about moments where protocol was breached - Michelle Obama famously put her arm around Queen Elizabeth in 2011, but, in all honesty, I doubt very much the Queen was upset by this. The fuss was not made by the late monarch, who accepted that what mattered was that Americans should be made very welcome on behalf of the UK. In 2018, criticism emerged against Trump, who appeared to make the Queen change places when the Guard of Honour was to be inspected. But, in truth, it was Elizabeth II who had to correct herself because, in her long life as sovereign, she never escorted a visiting president.  The escort should stand further from the troops and her self-correction was misinterpreted as his error. Trump's visit this time will likely generate just as many headlines, but I don't think there will be critical moments where a breach occurs. The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets underway. What it means for Trump - and is it worth it? Trump's mother would cut out and keep in a scrapbook containing pictures of the young Princess Elizabeth and her sister, Margaret Rose. It was an era before endless celebrity news, a time when public life revolved around the royals, the war, and survival. And the president loved his mother, like many men do, so these things mean an enormous amount to him. Read more:No state visit has had a backdrop quite like this When the horses go back to the stables and the carriages are put away, the impact of this visit will remain fresh in the mind of a president who may feel his nation - and maybe even he himself - have been affirmed by their ally. Quite apart from the politics, although much will be said and written on that, there is one great hope for any state visit: that the country so many (myself included) have fought for can be safer and more successful as a result of the pomp and pageantry on display."
    },
    {
        "title": "Charlie Kirk suspect Tyler Robinson appears in court - as prosecutors say they will seek death penalty",
        "description": "Tyler Robinson has appeared in court via video link charged with the murder of right-wing influencer Charlie Kirk.",
        "url": "https://news.sky.com/story/tyler-robinson-charged-with-the-murder-of-right-wing-influencer-charlie-kirk-13432215",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-tyler-robinson_7022621.jpg?20250916232107",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-16 14:40:00",
        "Headline": "Prosecutors said the suspect's DNA was found on the trigger of the alleged murder weapon and that he had ordered his roommate to delete \"incriminating texts\".",
        "Content": " Tyler Robinson has appeared in court via video link charged with the murder of right-wing influencer Charlie Kirk. The 22-year-old, from Washington, Utah, was seen for the first time since his arrest after being charged with aggravated murder, weapon, and obstruction of justice offences. Robinson, who was seen on screen from Utah County Jail, spoke only to confirm his name. He was otherwise silent and appeared calm during the brief hearing. Judge Tony Graf read out the charges against him and said a further hearing would be held at the end of the month. Robinson did not appear to have any legal representation and was seen wearing a green vest with straps, reportedly designed to prevent him from self-harming, according to The New York Times. It came after prosecutors held a press conference earlier today to announce they would be seeking the death penalty. They claimed that Robinson's DNA was found on the trigger of the alleged murder weapon. A note was also found under his keyboard, which said: \"I had the opportunity to take out Charlie Kirk and I'm going to take it,\" according to a charging document from prosecutors. It is also alleged that the suspect ordered his roommate to delete \"incriminating texts\" about the killing and to stay silent if questioned by police. When his roommate texted to ask if he was the \"one who did it\", Robinson replied: \"I am, I'm sorry,\" prosecutors allege. Robinson is said to have written in another text: \"I had enough of his hatred. Some hate can't be negotiated out.\" He also allegedly wrote he had been planning the shooting for just over a week. Kirk, 31, was killed at one of his rallies at Utah Valley University last Wednesday. The political activist, a close ally of US President Donald Trump, died after being shot in the neck with a bullet. County attorney Jeff Gray said \"aggravating factors\" in the killing included that the \"defendant is believed to have targeted Charlie Kirk based on his political expression and did so knowing children were present and would witness the homicide\". Read more from Sky News:UN says Israel is committing genocideHollywood actor Robert Redford diesTrump sues New York Times The obstruction of justice charges relate to allegations that Robinson disposed of the weapon used in the killing, along with clothing he is said to have worn at the time. Robinson has been held without bail since his arrest. Investigators have spoken to Robinson's relatives and have carried out a search at his family home, 240 miles (385km) southwest of where the shooting took place. Mr Gray said Robinson had accused Kirk of \"spreading hate\" during a conversation with his father. He also allegedly described the university as a \"stupid venue\" for the influencer to hold an event. After the shooting, the county attorney said the suspect confessed to his parents after they confronted him, telling them he shot Kirk because \"there is too much evil in the guy\". Robinson's mother told police that her son had become more political and had \"started to lean more to the left\" in the past year or so, Mr Gray said. He added that the 22-year-old had become more \"pro-gay and trans-rights oriented\", according to his parents. His mother said he had started to date his roommate, who was \"transitioning genders\", prompting \"discussions\" with his father, who had very different political views. Robinson allegedly wrote in another message to his roommate that \"since Trump got into office [my father] has been pretty diehard MAGA\"."
    },
    {
        "title": "Bob Geldof reveals why he won't run for Irish presidency",
        "description": "Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\".",
        "url": "https://news.sky.com/story/bob-geldof-reveals-why-he-wont-run-for-irish-presidency-13432479",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bob-geldof-sky-arts_7022550.jpg?20250916221500",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-16 21:10:00",
        "Headline": "The Boomtown Rat musician said he'd spoken to the Irish PM about being the candidate for the Fianna Fail Party, but decided he didn't have time. He's also relieved Conor McGregor won't be running.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\". Speaking to Sky News at the Sky Arts Awards on Tuesday night, the 73-year-old musician and aid campaigner said: \"My kids are here, my missus is here, my homes are here. \"I'd miss London. The band is here, I wouldn't be able to play.\" In Ireland, any Irish citizen over 35 can run for president - but to get on the ballot, a candidate must be nominated by 20 members of parliament or four local authorities. Geldof said: \"I simply wouldn't have had time.\" He said he had considered it, thinking it could be something \"new, interesting and useful\", 50 years after finding fame in The Boomtown Rats, and 40 years after launching Band Aid. Geldof said he'd briefly spoken to Prime Minister Micheal Martin, asking him: \"'What would you think about Bob Geldof being the candidate for the Fianna Fail Party?' He said, 'I think it'd be great, but I've already chosen someone'. \"I said, 'That's the end of the conversation Taoiseach, thanks very much,' and that was it.\" Former football manager Jim Gavin was later announced as Fianna Fail's official candidate. Conor McGregor pulls out Geldof admitted he was relieved former mixed martial arts fighter Conor McGregor was no longer in the running. McGregor, who had promised to curb immigration in order to protect \"Irish culture\" and to give power \"back to the people,\" announced he was withdrawing from the race earlier this week. Ex-Riverdance performer Michael Flatley, 67, has also expressed an interest in running for office. This year's ballot deadline is midday on 24 September, a month ahead of the election on 24 October. A largely ceremonial role, representing Ireland at home and abroad, it runs for a seven-year term. 'Please stop,' Geldof tells Israel Geldof, who has Jewish heritage and is the Founding Patron of the British Holocaust Museums Aegis Trust for Genocide Studies, also spoke passionately about the ongoing Israel-Hamas war. Following a UN Commission report which found Israel was committing genocide in Gaza, Geldof said: \"When you purposefully starve children as an instrument of war then you are a war criminal.\" He went on: \"People simply don't have the bandwidth to deal with the cost of living, the flag waving, the horror of Ukraine, the horrors of Gaza. They're just tired, and they just want Israel to please stop it. And the UN has just confirmed that. Stop.\" The accusation of genocide has been made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished.  Read more entertainment news:Hollywood legend Robert Redford diesSpain votes to boycott Eurovision if Israel competes Geldof was speaking at the prestigious Sky Arts event, where he was recognised for his influence as a musician and cultural figure over the last five decades with a lifetime achievement award. Never afraid to be outspoken, he was one of the defining voices of the 1970s punk era before going on to co-create Band Aid and the historic Live Aid concerts, reshaping the relationship between music and global activism. Geldof performed with his band, The Boomtown Rats, during the ceremony which took place at London's Roundhouse, hosted by comedian Bill Bailey. See all the Sky Arts Awards winners here."
    },
    {
        "title": "Trump to sign US-UK tech partnership in drive for AI",
        "description": "Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal.",
        "url": "https://news.sky.com/story/trump-to-sign-us-uk-tech-partnership-in-drive-for-ai-13432253",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976103.jpg?20250728142513",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-16 15:56:00",
        "Headline": "Plans for billions of pounds of investment by US tech firms include an AI Growth Zone in Northumberland and a big expansion of data centre capacity.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal. Nvidia, Microsoft, Open AI and Google made a flurry of announcements to coincide with President Trump's state visit to the UK. They include plans to build data centres and invest in AI research and engineering. Money latest: Tax warning over state pension Sir Keir Starmer described the agreement, which both leaders will sign over the coming days, as \"a generational step change\" in Britain's relationship with the US. The deal will see both countries cooperate on AI, quantum computing and nuclear energy, with investment in modular reactors revealed earlier this week.  The prime minister said it was \"shaping the futures of millions of people on both sides of the Atlantic, and delivering growth, security and opportunity up and down the country\". \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 The government said the deal would deliver thousands of jobs, with a new AI Growth Zone in the North East of England earmarked for 5,000 jobs. The region will host a new data centre developed in partnership with ChatGPT developer OpenAI, the US chip giant Nvidia and the British data centre company Nscale. The UK government will supply energy for the project, which will be based in Blyth. Jensen Huang, chief executive of Nvidia, who has previously drawn attention to Britain's inadequate levels of digital infrastructure, said: \"Today marks a historic chapter in US-United Kingdom technology collaboration. \"We are at the Big Bang of the AI era - and the United Kingdom stands in a Goldilocks position, where world-class talent, research and industry converge.\" The Blyth data centre is part of Stargate, Open AI's infrastructure project to build large data centres across the US. The company has also developed sites in Norway and the UAE. Nvidia, which provides the graphic processing chips (GPUs), expects to generate $20bn (£14.6bn) by the end of this year from \"sovereign\" deals with national governments over the coming years. Sam Altman, OpenAI's chief executive, said: \"The UK has been a longstanding pioneer of AI, and is now home to world-class researchers, millions of ChatGPT users and a government that quickly recognised the potential of this technology. \"Stargate UK builds on this foundation to help accelerate scientific breakthroughs, improve productivity, and drive economic growth.\" Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' Microsoft also pledged £22bn, its largest ever investment in the UK, to expand data centres and construct the country's largest AI supercomputer. Meanwhile, Google owner Alphabet pledged £5bn to expand its data centres in Hertfordshire and fund its London-based subsidiary DeepMind, which uses AI to power cutting edge scientific research. The company was founded in Britain and acquired by Google in 2014. Other investments include £1.5bn from AI cloud computing company CoreWeave and £1.4bn from Salesforce."
    },
    {
        "title": "Thomas Partey: Ex-Arsenal player due in court on rape charges - just hours after playing against Spurs",
        "description": "Ex-Arsenal player Thomas Partey is due to appear in court on rape and sexual assault charges today - hours after returning to north London for a Champions League match with new side Villarreal.",
        "url": "https://news.sky.com/story/thomas-partey-ex-arsenal-player-to-appear-in-court-on-rape-charges-just-hours-after-playing-against-spurs-13432514",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-thomas-partey-villarreal_7022612.jpg?20250916230656",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-16 21:51:00",
        "Headline": "The Ghanaian midfielder was a consistent performer for Arsenal after joining from Atletico Madrid in 2020. He left the club when his contract expired at the end of last season, having made 35 appearances during the campaign.",
        "Content": "Ex-Arsenal player Thomas Partey is due to appear in court on rape and sexual assault charges today - hours after returning to north London for a Champions League match with new side Villarreal. The Spanish team were in town to take on Tottenham in their first European match of the season, and Partey was introduced from the bench with 12 minutes to go. The Ghana midfielder was met by a chorus of boos when he came on, less than a month after an appearance at Westminster Magistrates Court on 5 August. He has been charged with five counts of rape and one of sexual assault. Lawyer Jenny Wiltshire has previously said Partey \"denies all the charges against him\". Today's appearance at Southwark Crown Court is for a plea and trial preparation hearing. Read more from Sky News:Actor Robert Redford diesCharlie Kirk suspect appears in court Partey, 32, was charged in July - just four days after leaving Arsenal following the expiration of his contract. He had joined the club from Atletico Madrid in 2020. The Metropolitan Police said it first received reports of an allegation of rape in February 2022. An Arsenal spokesperson previously said: \"The player's contract ended on 30 June. Due to ongoing legal proceedings, the club is unable to comment on the case.\" Why was Partey playing? Villarreal signed him last month despite opposition from some of their fans, with the midfielder having been granted conditional bail. He has made a handful of appearances since then. Partey is not prevented from playing football, but must inform police of any international travel a day in advance, and must not contact the complainants. Partey's appearance in Tuesday night's match - his first on English soil since being charged - had no bearing on the outcome, as Tottenham held on to a 1-0 lead taken just four minutes in."
    },
    {
        "title": "Hollywood actor and director Robert Redford dies at 89",
        "description": "Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89.",
        "url": "https://news.sky.com/story/hollywood-actor-and-director-robert-redford-dies-at-89-13432112",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-robert-redford-butch-cassidy_7022311.jpg?20250916172819",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-16 12:15:00",
        "Headline": "Best known for his performance in Butch Cassidy And The Sundance Kid, Robert Redford's film career, both in front of and behind the camera, spanned seven decades.",
        "Content": " Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89. Redford, who was also the founder of the Sundance Film Festival, the largest independent film festival in the US, died on Tuesday morning. In a statement, his representative said he was \"surrounded by those he loved\", at home in \"the place he loved\" in the mountains of Utah. \"He will be missed greatly,\" she added. Born Charles Robert Redford Jr in Santa Monica, California, in 1936, he attended college on a baseball scholarship but later went on to study at the American Academy of Dramatic Arts. He debuted on Broadway in the late 1950s before moving into television, in shows such as The Twilight Zone, Alfred Hitchcock Presents and The Untouchables. Rising to stardom in the 1960s, Redford became a go-to leading man in Hollywood and a huge star of the following decade, leading films including The Candidate, All the President's Men and The Way We Were. He worked hard to transcend being typecast for his good looks, through his political advocacy and a willingness to take on unglamorous roles. In the 1990s and 2000s, his film credits included Indecent Proposal, The Last Castle and Spy Game, and he also worked actively as a filmmaker - helming movies including A River Runs Through It and The Legend Of Bagger Vance. In 1998, he both starred in and directed The Horse Whisperer. But he was best known for his role as wily outlaw the Sundance Kid, opposite Paul Newman's Butch Cassidy in the 1969 film. The pair became a famous screen partnership, starring opposite each other again in The Sting a few years later, and good friends. As well as his starring roles, Redford was also an activist and an accomplished filmmaker - winning the Oscar for best director for Ordinary People in 1981. He had four Academy Award nominations in total - the first for acting for his performance in The Sting - as well as an honorary prize in 2002. In a career spanning seven decades, he also received three Golden Globe Awards, including the Cecil B DeMille lifetime achievement honor in 1994. In his later years, Redford took on a challenging role in All Is Lost, a 2013 survival story that featured virtually no other characters and barely any dialogue. His performance earned a standing ovation after the film was screened at the Cannes Film Festival.  In 2018, he received critical acclaim again in what he called his farewell movie, The Old Man And The Gun. His legacy lives on in the Sundance Film Festival, which grew into a cornerstone of the film industry and provided a launching pad for filmmakers including Quentin Tarantino, Paul Thomas Anderson, Steven Soderbergh, Gina Prince-Bythewood and Darren Aronofsky. And in 2016, former President Barack Obama awarded him the presidential medal of freedom - considered the US government's highest civilian honour - saying at the time that Americans \"admire Bob not just for his remarkable acting, but for having figured out what to do next\". Robert Redford leaves behind his wife Sibylle Szaggars and two daughters - Shauna, a painter, and Amy, an actress and director. He was previously married to Lola Van Wagenen. One of their children, Scott, died at the age of two months from sudden infant death syndrome. Another, James, died of cancer in 2020. 'One of the lions has passed' Tributes have been shared across social media following the announcement of Redford's death. Meryl Streep, who starred in Out Of Africa and Lions For Lambs opposite Redford, said: \"One of the lions has passed. Rest in peace my lovely friend.\" Filmmaker Ron Howard, known for Apollo 13 and A Beautiful Mind, described Redford as \"a tremendously influential cultural figure for the creative choices\" he made as an actor, producer and director, and said Sundance had been a \"gamechanger\". Marlee Matlin, star of the Oscar-winning CODA, said the film \"came to the attention of everyone\" because of the Sundance Festival. \"Sundance happened because of Robert Redford. A genius has passed,\" she said. \"He was part of a new and exciting Hollywood in the 70s and 80s,\" wrote author Stephen King. \"Hard to believe he was 89.\" Spencer Cox, the governor of Utah, wrote: \"Decades ago, Robert Redford came to Utah and fell in love with this place. \"He cherished our landscapes and built a legacy that made Utah a home for storytelling and creativity. \"Through Sundance and his devotion to conservation, he shared Utah with the world. Today we honor his life, his vision, and his lasting contribution to our state.\" In a statement, the Sundance Institute said: \"We are deeply saddened by the loss of our founder and friend Robert Redford. Bob's vision of a space and a platform for independent voices launched a movement that, over four decades later, has inspired generations of artists and redefined cinema in the US and around the world. \"Beyond his enormous contributions to culture at large, we will miss his generosity, clarity of purpose, curiosity, rebellious spirit, and his love for the creative process. We are humbled to be among the stewards of his remarkable legacy, which will continue to guide the Institute in perpetuity.\""
    },
    {
        "title": "Trump's state visit begins as Epstein images beamed on to Windsor Castle",
        "description": "Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\".",
        "url": "https://news.sky.com/story/trumps-state-visit-begins-as-epstein-images-beamed-on-to-windsor-castle-13432498",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump_7022635.jpg?20250917004840",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-16 21:37:00",
        "Headline": "The US president's historic second state visit has begun - with him telling journalists upon arrival \"everyone's looking forward to it\". But not everyone greeted him warmly.",
        "Content": " Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\". But as he headed to the residence of the US ambassador to the UK in central London to spend Tuesday night, giant projections of the president alongside paedophile Jeffrey Epstein were beamed on to Windsor Castle by protesters. It is there he will meet with King Charles later today.  Four people were arrested on \"suspicion of malicious communications\" after the images of Mr Trump and Epstein appeared on the landmark, Thames Valley Police said. Mr Trump has faced mounting questions about his relationship with the disgraced late billionaire after messages allegedly sent to him by the president were published by Congress earlier this month. The apparent notes - which Mr Trump denies having written - appeared in a 2003 \"birthday book\" for Epstein which also included messages from Peter Mandelson, who has since been sacked as Sir Keir Starmer's ambassador to the US over his ties to the financier. Foreign Secretary Yvette Cooper was among those who greeted the president and First Lady Melania as they disembarked their official plane at Stansted airport on Tuesday evening. An honour guard of RAF personnel from The King's Colour Squadron lined up as he stepped off the plane. Trump excited to see 'my friend' Charles Speaking to reporters mid-flight, Trump said: \"My relationship is very good with the UK, and Charles, as you know, who's now King, is my friend. \"It's the first time this has ever happened where somebody was honoured twice. So, it's a great honour.\" He told the journalists \"everybody is looking forward to it. You're going to have the best pictures\". To mark the president's arrival, a new UK-US tech deal was announced that could generate billions of pounds of investment for Britain. Sir Keir - who will host Mr Trump at his Chequers country retreat tomorrow - said the deal would deliver \"growth, security and opportunity up and down the country\". Read more:No one does pomp better than Britain The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets underway. The \"tech prosperity deal\", announced as Mr Trump touched down, will see the UK and US co-operate in areas including artificial intelligence (AI), quantum computing and nuclear power. It comes alongside £31bn of investment in Britain from top US tech firms, including £22bn from Microsoft.  'I'm into helping Britain' It also follows the agreement of an economic deal in May that covered a reduction in some of Mr Trump's tariffs. However, the government is understood to have given up hope - for now at least - of reducing the president's levy on steel back down to zero. It currently stands at 25%. Mr Trump had hinted at possible tariff relief for British steel as he boarded Air Force One, telling reporters he was \"into helping\" Britain on refining the trade deal signed earlier this year."
    },
    {
        "title": "Trump will be treated to full pomp and pageantry - and no one does it better than Britain",
        "description": "While the nature of Donald Trump's second state visit is indeed unusual, from the moment Sir Keir Starmer delivered the gold-edged invitation it began a process steeped in tradition.",
        "url": "https://news.sky.com/story/trump-will-be-treated-to-full-pomp-and-pageantry-and-no-one-does-it-better-than-britain-13432061",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-state-visit_7022636.jpg?20250917004120",
        "type": "UK",
        "Author": "Alastair Bruce, Sky News royal commentator",
        "Date Published": "2025-09-16 09:48:00",
        "Headline": "State visits are usually reserved to one per head of state, with Donald Trump last being hosted by the late Queen Elizabeth in 2019. But the full pomp and pageantry once again will be on display as he's hosted by King Charles.",
        "Content": "By Alastair Bruce, Sky News royal commentator   While the nature of Donald Trump's second state visit is indeed unusual, from the moment Sir Keir Starmer delivered the gold-edged invitation it began a process steeped in tradition. State visits are usually reserved to one per head of state, with Trump last hosted by Queen Elizabeth II in 2019. Typically, second-term US presidents are offered a shorter visit, perhaps tea or lunch with the monarch at Windsor Castle. But the red carpet is literally being rolled out once again, with Trump receiving a second full state visit, with all the pomp and pageantry it entails. An indication was given early on in Trump's second term that he'd be receptive to a second state visit, and so - on perhaps the advice of the new prime minister - the King issued a second invitation. The greatest form of tradition is one that always evolves, and so this may now set a new precedent for presidents who are voted out but then return to serve a second term. Any nation can hold a state visit, but what is unique about Britain remains our internationally respected pageantry. Even down to the very invitation - there is a very precise format for inviting someone on a state visit. An invite must be issued, established by international law. Written on a special gold-edged paper, embossed with a golden coat of arms that is issued, it forms part of a historic archive. Breaches of protocol Much has been made in the past about moments where protocol was breached - Michelle Obama famously put her arm around Queen Elizabeth in 2011, but, in all honesty, I doubt very much the Queen was upset by this. The fuss was not made by the late monarch, who accepted that what mattered was that Americans should be made very welcome on behalf of the UK. In 2018, criticism emerged against Trump, who appeared to make the Queen change places when the Guard of Honour was to be inspected. But, in truth, it was Elizabeth II who had to correct herself because, in her long life as sovereign, she never escorted a visiting president.  The escort should stand further from the troops and her self-correction was misinterpreted as his error. Trump's visit this time will likely generate just as many headlines, but I don't think there will be critical moments where a breach occurs. The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets underway. What it means for Trump - and is it worth it? Trump's mother would cut out and keep in a scrapbook containing pictures of the young Princess Elizabeth and her sister, Margaret Rose. It was an era before endless celebrity news, a time when public life revolved around the royals, the war, and survival. And the president loved his mother, like many men do, so these things mean an enormous amount to him. Read more:No state visit has had a backdrop quite like this When the horses go back to the stables and the carriages are put away, the impact of this visit will remain fresh in the mind of a president who may feel his nation - and maybe even he himself - have been affirmed by their ally. Quite apart from the politics, although much will be said and written on that, there is one great hope for any state visit: that the country so many (myself included) have fought for can be safer and more successful as a result of the pomp and pageantry on display."
    },
    {
        "title": "Thomas Partey: Ex-Arsenal player due in court on rape charges - just hours after playing against Spurs",
        "description": "Ex-Arsenal player Thomas Partey is due to appear in court on rape and sexual assault charges today - hours after returning to north London for a Champions League match with new side Villarreal.",
        "url": "https://news.sky.com/story/thomas-partey-ex-arsenal-player-to-appear-in-court-on-rape-charges-just-hours-after-playing-against-spurs-13432514",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-thomas-partey-villarreal_7022612.jpg?20250916230656",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-16 21:51:00",
        "Headline": "The Ghanaian midfielder was a consistent performer for Arsenal after joining from Atletico Madrid in 2020. He left the club when his contract expired at the end of last season, having made 35 appearances during the campaign.",
        "Content": "Ex-Arsenal player Thomas Partey is due to appear in court on rape and sexual assault charges today - hours after returning to north London for a Champions League match with new side Villarreal. The Spanish team were in town to take on Tottenham in their first European match of the season, and Partey was introduced from the bench with 12 minutes to go. The Ghana midfielder was met by a chorus of boos when he came on, less than a month after an appearance at Westminster Magistrates Court on 5 August. He has been charged with five counts of rape and one of sexual assault. Lawyer Jenny Wiltshire has previously said Partey \"denies all the charges against him\". Today's appearance at Southwark Crown Court is for a plea and trial preparation hearing. Read more from Sky News:Actor Robert Redford diesCharlie Kirk suspect appears in court Partey, 32, was charged in July - just four days after leaving Arsenal following the expiration of his contract. He had joined the club from Atletico Madrid in 2020. The Metropolitan Police said it first received reports of an allegation of rape in February 2022. An Arsenal spokesperson previously said: \"The player's contract ended on 30 June. Due to ongoing legal proceedings, the club is unable to comment on the case.\" Why was Partey playing? Villarreal signed him last month despite opposition from some of their fans, with the midfielder having been granted conditional bail. He has made a handful of appearances since then. Partey is not prevented from playing football, but must inform police of any international travel a day in advance, and must not contact the complainants. Partey's appearance in Tuesday night's match - his first on English soil since being charged - had no bearing on the outcome, as Tottenham held on to a 1-0 lead taken just four minutes in."
    },
    {
        "title": "Trump to sign US-UK tech partnership in drive for AI",
        "description": "Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal.",
        "url": "https://news.sky.com/story/trump-to-sign-us-uk-tech-partnership-in-drive-for-ai-13432253",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976103.jpg?20250728142513",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-16 15:56:00",
        "Headline": "Plans for billions of pounds of investment by US tech firms include an AI Growth Zone in Northumberland and a big expansion of data centre capacity.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal. Nvidia, Microsoft, Open AI and Google made a flurry of announcements to coincide with President Trump's state visit to the UK. They include plans to build data centres and invest in AI research and engineering. Money latest: Tax warning over state pension Sir Keir Starmer described the agreement, which both leaders will sign over the coming days, as \"a generational step change\" in Britain's relationship with the US. The deal will see both countries cooperate on AI, quantum computing and nuclear energy, with investment in modular reactors revealed earlier this week.  The prime minister said it was \"shaping the futures of millions of people on both sides of the Atlantic, and delivering growth, security and opportunity up and down the country\". \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 The government said the deal would deliver thousands of jobs, with a new AI Growth Zone in the North East of England earmarked for 5,000 jobs. The region will host a new data centre developed in partnership with ChatGPT developer OpenAI, the US chip giant Nvidia and the British data centre company Nscale. The UK government will supply energy for the project, which will be based in Blyth. Jensen Huang, chief executive of Nvidia, who has previously drawn attention to Britain's inadequate levels of digital infrastructure, said: \"Today marks a historic chapter in US-United Kingdom technology collaboration. \"We are at the Big Bang of the AI era - and the United Kingdom stands in a Goldilocks position, where world-class talent, research and industry converge.\" The Blyth data centre is part of Stargate, Open AI's infrastructure project to build large data centres across the US. The company has also developed sites in Norway and the UAE. Nvidia, which provides the graphic processing chips (GPUs), expects to generate $20bn (£14.6bn) by the end of this year from \"sovereign\" deals with national governments over the coming years. Sam Altman, OpenAI's chief executive, said: \"The UK has been a longstanding pioneer of AI, and is now home to world-class researchers, millions of ChatGPT users and a government that quickly recognised the potential of this technology. \"Stargate UK builds on this foundation to help accelerate scientific breakthroughs, improve productivity, and drive economic growth.\" Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' Microsoft also pledged £22bn, its largest ever investment in the UK, to expand data centres and construct the country's largest AI supercomputer. Meanwhile, Google owner Alphabet pledged £5bn to expand its data centres in Hertfordshire and fund its London-based subsidiary DeepMind, which uses AI to power cutting edge scientific research. The company was founded in Britain and acquired by Google in 2014. Other investments include £1.5bn from AI cloud computing company CoreWeave and £1.4bn from Salesforce."
    },
    {
        "title": "Prime suspect in Madeleine McCann case slapped with strict conditions ahead of jail release",
        "description": "The suspect in the Madeleine McCann case has had strict conditions slapped on him ahead of his expected release from prison in the morning.",
        "url": "https://news.sky.com/story/prime-suspect-in-madeleine-mccann-case-slapped-with-strict-conditions-ahead-of-jail-release-13432447",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-court-madeleine_7022538.jpg?20250916220445",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-16 20:29:00",
        "Headline": "The German national is being freed after serving a seven-year sentence for rape, but he remains the only suspect in the abduction of the toddler in Portugal 18 years ago.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n The suspect in the Madeleine McCann case has had strict conditions slapped on him ahead of his expected release from prison in the morning. Christian B, who can't be fully identified under privacy laws, will have to wear an electronic tag, surrender his passport and register his address with probation officers. The German drifter, 49, is being freed after serving a seven-year sentence for rape, but remains the only suspect for the abduction of Madeleine, the toddler who vanished on a family holiday in Portugal in 2007. It was not known where he would head, or who might help him adjust to a new life as the only suspect in the world's most notorious unsolved child abduction mystery. Prosecutor Hans Christian Wolters, who leads the Madeleine investigation, believes Christian B, 49, abducted and murdered the three-year-old during a family holiday in Portugal in 2007. Madeleine vanished from her bed in a rented apartment as her parents and their friends dined nearby at the hotel complex in Praia da Luz on the Algarve coast. Earlier this week it emerged the Metropolitan Police had sent a formal \"international letter of request\" to Christian B in order for them to interview him - but he rejected it. \n                  What we know about Christian B -  the prime suspect in Madeleine McCann's disappearance\n                 \n                  Prime suspect in Madeleine McCann case refuses to speak to British police\n                 \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 Explainer: The chequered history of Christian B In the past few days, a probation case conference decided on the restrictions which his lawyers are expected to challenge. His lawyer Philipp Marquort said: \"This is an attempt by the public prosecutor's office to keep him in a kind of pre-trial detention where they would have access to him at any time.\"  Christian B has denied any involvement in Madeleine's disappearance. Madeleine, who was nearly four, was sleeping in a room with her younger twin siblings when she went missing."
    },
    {
        "title": "Southport killer's parents took delivery of machetes and knives and tried to hide them from him, inquiry told",
        "description": "The parents of the Southport killer took delivery of a number of machetes and knives, which they tried to hide from him, the inquiry into the stabbings has been told.",
        "url": "https://news.sky.com/story/southport-killers-parents-took-delivery-of-machetes-and-knives-and-tried-to-hide-them-from-him-inquiry-told-13432260",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250214221350",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-16 16:10:00",
        "Headline": "Nicholas Moss KC, counsel to the inquiry, said the killer's parents had a \"fear\" of their son's response if they asked him questions about packages or attempted to tidy his room",
        "Content": "By Duncan Gardham, security journalist  The parents of the Southport killer took delivery of a number of machetes and knives, which they tried to hide from him, the inquiry into the stabbings has been told. Alice da Silva Aguiar, nine, Bebe King, six, and Elsie Stancombe, seven, were murdered at a Taylor Swift-themed class on 29 July last year by Axel Rudakubana, who was jailed for a minimum of 52 years. He seriously injured eight more girls and two adults who had tried to stop him. Nicholas Moss KC, counsel to the inquiry into the killings, said the purchase of weapons by Rudakubana - referred to by the inquiry throughout as AR - is \"important because it will highlight vulnerabilities in the law against the purchase of knives, crossbows and machetes\". Read more:The missed chances to stop RudakubanaGrandfather who tackled killer  Killer 'used dad's details to order knife' On the purchase of weapons, Mr Moss said it is \"also important because it is one significant factor in the questions which we need to explore with his family, particularly his parents\", asking \"What did they know of the weapons purchases?\" The inquiry was told that his father or mother appeared to have taken delivery of the knife that was used in the attack, and that it was ordered via Amazon under an IP address suggesting the use of a Virtual Private Network. Rudakubana used his father's details instead of his own when ordering the knife, which was approved by Amazon because the name and address provided were those of an adult and matched up with credit check agency information. Mr Moss said the package was shipped to an \"Ax Rud\" at his home address near Southport, arriving at around 5.40pm on 15 July 2024. Ring camera footage from the property of Rudakubana's next-door neighbour showed the delivery, but the recipient could not be seen. The driver entered the recipient's year of birth as 1978 and confirmed that they appeared to be over the age of 25. Rudakubana's father's date of birth is in 1975, and his mother's is in 1972, Mr Moss told the hearing. 'Parents accepted - and hid - weapon deliveries from son' Mr Moss then said Rudakubana's parents had accepted deliveries of weapons and hidden them from him on multiple occasions. A June 2023 delivery of a 22-inch machete - ordered using the driving licence of a woman named Alice born in 1991 and living in Sunderland - was found on top of the wardrobe in Rudakubana's parents' bedroom in sealed packaging. In his statement to Merseyside Police after the attack, Rudakubana's father said he had signed for a parcel containing knives that was addressed to someone with a British-sounding name, and he hid the parcel on top of his wardrobe despite his son asking for it. An October 2023 order of a machete with a 16.5-inch blade - ordered using a driving licence for Samuel, a black man born in Nigeria in 1961, living in Uxbridge - was found by the police after Rudakubana's prosecution, still in its packaging and unopened. Rudakubana ordered a third machete that month, called a Kukri Congo 488 JKR with a blade length of 30.5cm from Huntingandknives.co.uk, again using Samuel's driving licence. That machete was found in the search of Rudakubana's home in a black holdall under the bunk beds in his bedroom. 'Parents scared of Rudakubana's behaviour' The inquiry heard that Rudakubana's parents had a \"fear\" of their son's response if they asked him questions about packages or attempted to tidy his room. Mr Moss said they were scared that he may be violent towards them, towards his older brother or cause damage to the house, and that they had noticed a \"marked deterioration\" in his behaviour after being excluded from the Range School for possessing a knife in 2019. \"However, it may be said to be apparent that AR's parents were aware of other aspects of AR's conduct that might have been expected to give rise to a concern,\" he added. The inquiry has asked Rudakubana's parents about any steps that they took to recover knives from their son, and whether they considered reporting the incident to the police or any other agency. The inquiry continues."
    },
    {
        "title": "The King, Prince William and Kate attend Duchess of Kent's funeral  - as Buckingham Palace says Queen withdrew due to illness",
        "description": "The King, Prince William and the Princess of Wales have attended the funeral of the Duchess of Kent.",
        "url": "https://news.sky.com/story/the-king-prince-william-and-kate-attend-duchess-of-kents-funeral-as-buckingham-palace-says-queen-withdrew-due-to-illness-13432092",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-wales_7022252.jpg?20250916160343",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-16 11:16:00",
        "Headline": "Queen Camilla had withdrawn from attending while she recovers from acute sinusitis, Buckingham Palace said on Tuesday.",
        "Content": " The King, Prince William and the Princess of Wales have attended the funeral of the Duchess of Kent. The trio were joined by other royals at Westminster Cathedral for the requiem mass - a Catholic funeral - the first to be held for a member of the Royal Family in modern British history. Katharine, Duchess of Kent, who became the oldest living member of the Royal Family on the death of Queen Elizabeth II in 2022, died at the age of 92 on 4 September. It emerged earlier that the Queen had withdrawn from attending while she recovers from illness. Buckingham Palace said on Tuesday that Camilla, 78, is recovering from acute sinusitis, with the withdrawal raising questions over her attendance for US President Donald Trump's state visit, which begins at Windsor on Wednesday. That visit is being hosted by the King, but the Queen is understood to be hopeful she will recover in time to attend all royal elements of Mr Trump's trip, which includes a lavish state banquet. A Buckingham Palace spokesperson said: \"With great regret, Her Majesty the Queen has withdrawn from attendance at this afternoon's requiem mass for the Duchess of Kent as she is recovering from acute sinusitis.\" The Duke of Kent was informed and was said to fully understand the decision, wishing her a speedy recovery. The Queen had travelled down from Scotland this morning and is currently travelling to Windsor, where she will rest. \"Her thoughts and prayers will be with the Duke of Kent and all the family,\" the spokesperson added. During the service, Pope Leo XIV paid a personal tribute to the Duchess of Kent, praising her \"legacy of Christian goodness\" in a message delivered during her funeral. In words read out by Archbishop Miguel Maury Buendia, the pontiff highlighted her \"dedication to official duties\". Prince Andrew and Sarah, Duchess of York, were seen approaching Westminster Cathedral for the service. Former Formula 1 world champion Sir Jackie Stewart and actresses Rula Lenska and Dame Maureen Lipman were also among the mourners."
    },
    {
        "title": "Thousands of families remain in Gaza City as Israeli army advances",
        "description": "As the Israeli army advances on Gaza City, thousands of families remain in the city's crowded tent camps.",
        "url": "https://news.sky.com/story/thousands-of-families-remain-in-gaza-city-as-israeli-army-advances-13432280",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-teaser-dxf_7022355.png?20250916184707",
        "type": "World",
        "Author": "Ben van der Merwe, Freya Gibson and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-09-16 16:53:00",
        "Headline": "The UN last week estimated that one million people remained in Gaza City. Sky News analysis shows that only a fraction have fled in recent days.",
        "Content": "By Ben van der Merwe, Freya Gibson and Sophia Massam, Data & Forensics Unit  As the Israeli army advances on Gaza City, thousands of families remain in the city's crowded tent camps. Sky News analysis of satellite imagery taken on Monday 15 September shows tent camps stretching across the western half of the city. A close-up view shows one camp spilling out on to the city's beaches. The Israel Defence Forces (IDF) launched its ground assault overnight on Tuesday 16 September, in what the military said was a \"new phase\" in its offensive. \"Gaza is burning,\" defence minister Israel Katz posted on X as the operation began. \"IDF soldiers are fighting bravely to create the conditions for the release of the hostages and the defeat of Hamas.\" UK Foreign Secretary Yvette Cooper described the offensive as \"utterly reckless and appalling\", adding that it \"will only bring more bloodshed, kill more innocent civilians & endanger the remaining hostages\". Footage verified by Sky News shows Israeli tanks entering the Gaza Strip from the north overnight on Tuesday. Israeli soldiers later filmed themselves in an area just north of Gaza City. Satellite imagery taken a day earlier shows that while some tent camps in the area have been abandoned in the past few days, many others have not. The IDF advance comes after an intense week of airstrikes targeting buildings in Gaza City. Sky News has verified dozens of videos showing strikes on buildings across the city. Several of these strikes destroyed entire tower blocks, such as this strike on Al Ghafari Tower. At least 50 people were killed across the Gaza Strip on Tuesday, health officials said, most of them in Gaza City. The IDF said it estimated 40% of people in Gaza City had fled south, while Hamas said that only 190,000 out of 1.3 million residents had left (15%). An evacuation order for the entire city was first issued on 9 September, with a map on 13 September instructing Palestinians to flee to what Israel has designated a \"humanitarian area\" along a stretch of sandy coastline known as Al Mawasi. Satellite imagery from Sunday 14 September shows that the area is already crowded with tents. Last week, the UN's Gaza humanitarian country team said that \"neither the size nor scale of services provided is fit to support those already there, let alone new arrivals\". Those fleeing south face a journey of at least 15km (9.3 miles), much of it through Israeli-designated combat zones. Local health officials said at least one vehicle travelling south from Gaza City had been hit by an Israeli strike. Among those staying put on Tuesday was Um Mohammad, who lives in the Sabra neighbourhood of Gaza City. \"It is like escaping from death towards death, so we are not leaving,\" she said. The IDF says the next stage of the operation will involve both air and ground forces, and that the number of soldiers involved will increase over the coming days. Additional reporting by Sam Doak, OSINT producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "UN Commission says Israel is committing genocide in Gaza",
        "description": "Israel is committing genocide in Gaza, according to a commission established by the United Nations. ",
        "url": "https://news.sky.com/story/un-commission-says-israel-is-committing-genocide-in-gaza-13431987",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-israel_7021942.jpg?20250916104120",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-16 07:00:00",
        "Headline": "It is the first time the allegation has been made publicly by a UN body, and is likely to be greeted with fury by the Israeli government.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Israel is committing genocide in Gaza, according to a commission established by the United Nations.  The report claims \"it is clear that there is an intent to destroy the Palestinians in Gaza\" and says Israel's actions meet the criteria set down for defining a genocide. It is the first time that such an explosive allegation has been made publicly by a UN body, and is likely to be greeted with fury by the Israeli government. Follow live updates: 'Gaza is burning' after overnight strikes  Israel's Foreign Ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished. \"Three individuals serving as Hamas proxies, notorious for their openly antisemitic positions - and whose horrific statements about Jews have been condemned worldwide - released today another fake 'report' about Gaza,\" it said in a statement. \"The report relies entirely on Hamas falsehoods, laundered and repeated by others. These fabrications have already been thoroughly debunked.\" \n                  Bob Geldof reveals why he won't run for Irish presidency\n                 \n                  Thousands of families remain in Gaza City as Israeli army advances\n                 \n                  Donald Trump's top diplomat Marco Rubio seeks answers from Israel on way forward in Gaza after Qatar strike\n                 The accusation of genocide is made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. The commission, which has been studying the conduct of Israel since the Hamas attacks of 7 October 2023, has concluded that Israel has committed four of the five acts laid out in the Genocide Convention. It alleges Israel has been killing Palestinians or forcing them to live in inhumane conditions that led to death; causing serious bodily or mental harm, including through torture, displacement and sexual crime; deliberately imposing inhumane conditions, and fourthly, imposing measures intending to prevent births. This final claim is linked to an attack on the Al-Basma IVF clinic, which the commission claims destroyed around 4,000 embryos and a further 1,000 sperm samples. The report claims Israel has \"flagrantly\" ignored \"numerous warnings\" over the humanitarian crisis in Gaza and has set out to \"destroy the healthcare system in Gaza\". It also alleges that Israeli military personnel have carried out sexual and gender-based violence, including \"rape and sexualised torture\", as part of \"a pattern of collective punishment\", and accuses Israeli forces of deliberately targeting some children \"with the intention to kill them\". Although other UN bodies and personnel have previously linked Israel's actions with allegations of genocide, this is the first time that any UN body has claimed to have made a definitive judgment. \"The responsibility for these atrocity crimes lies with the Israeli authorities at the highest echelons,\" said Navi Pillay, the chair of the commission. Within the report, it concludes that \"Israeli President Isaac Herzog, Prime Minister Benjamin Netanyahu and then Defence Minister Yoav Gallant, have incited the commission of genocide\". Nearly 65,000 people are now believed to have died, according to figures collated by Gaza's health ministry. It does not distinguish between civilians and combatants in its count. The commission claims that a majority of these are women, children and elderly people. The commission says it is now looking at further evidence against other individuals accused of inciting genocide. Last year, the International Criminal Court (ICC) issued arrest warrants against both Mr Netanyahu and Mr Gallant for allegedly committing the war crime of using starvation as a method of warfare and also for war crimes during the Gaza conflict. Mr Netanyahu described the warrants as \"antisemitic\", while a sense of outrage echoed across much of the political spectrum in Israel. Then US President Joe Biden called the warrants \"outrageous\"; his successor, Donald Trump, issued an executive order to introduce sanctions against personnel from the ICC, while inviting Netanyahu to the White House. It is hard to believe that either Israel or the US will be any more accepting of this report. Israel has long claimed that the UN is biased against it and is more liable to criticise Israel than any other nation. The US, which offered a rare, if mild, rebuke to Mr Netanyahu after he launched an attack on Hamas officials in Qatar last week, has since sent Secretary of State Marco Rubio to Jerusalem as a sign of solidarity. The commission has asked for nations to stop supplying Israel with weapons and says states have a \"legal obligation\" to do everything within their power \"to stop the genocide in Gaza\". It also calls on Israel to immediately allow \"unhindered\" access for internationally recognised aid agencies, including the UN.  It wants the Gaza Humanitarian Foundation (GHF), set up earlier this year by Israel with American help, in order to distribute aid, to be shut down. Hundreds of people have been killed around GHF sites, while a separate UN-backed body has said that parts of Gaza have been designated as suffering from famine. Read more from Sky News:Zelenskyy makes demand of TrumpTrump sues New York Times  Israel denies this - a senior military leader told me that \"it is a pure, total lie - there is enough food for everyone\". It claims that the UN relied on faulty data and Hamas propaganda. This latest UN report is likely to be met with similar claims. Earlier this month, the International Association of Genocide Scholars passed a resolution stating that Israel's conduct passed the threshold of committing genocide. However, a report from the British government said it had \"not concluded\" that Israel intended to \"destroy in whole or in part a national, ethnic, racial or religious group\"."
    },
    {
        "title": "Bob Geldof reveals why he won't run for Irish presidency",
        "description": "Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\".",
        "url": "https://news.sky.com/story/bob-geldof-reveals-why-he-wont-run-for-irish-presidency-13432479",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bob-geldof-sky-arts_7022550.jpg?20250916221500",
        "type": "World",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-16 21:10:00",
        "Headline": "The Boomtown Rat musician said he'd spoken to the Irish PM about being the candidate for the Fianna Fail Party, but decided he didn't have time. He's also relieved Conor McGregor won't be running.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\". Speaking to Sky News at the Sky Arts Awards on Tuesday night, the 73-year-old musician and aid campaigner said: \"My kids are here, my missus is here, my homes are here. \"I'd miss London. The band is here, I wouldn't be able to play.\" In Ireland, any Irish citizen over 35 can run for president - but to get on the ballot, a candidate must be nominated by 20 members of parliament or four local authorities. Geldof said: \"I simply wouldn't have had time.\" He said he had considered it, thinking it could be something \"new, interesting and useful\", 50 years after finding fame in The Boomtown Rats, and 40 years after launching Band Aid. Geldof said he'd briefly spoken to Prime Minister Micheal Martin, asking him: \"'What would you think about Bob Geldof being the candidate for the Fianna Fail Party?' He said, 'I think it'd be great, but I've already chosen someone'. \"I said, 'That's the end of the conversation Taoiseach, thanks very much,' and that was it.\" Former football manager Jim Gavin was later announced as Fianna Fail's official candidate. Conor McGregor pulls out Geldof admitted he was relieved former mixed martial arts fighter Conor McGregor was no longer in the running. McGregor, who had promised to curb immigration in order to protect \"Irish culture\" and to give power \"back to the people,\" announced he was withdrawing from the race earlier this week. Ex-Riverdance performer Michael Flatley, 67, has also expressed an interest in running for office. This year's ballot deadline is midday on 24 September, a month ahead of the election on 24 October. A largely ceremonial role, representing Ireland at home and abroad, it runs for a seven-year term. 'Please stop,' Geldof tells Israel Geldof, who has Jewish heritage and is the Founding Patron of the British Holocaust Museums Aegis Trust for Genocide Studies, also spoke passionately about the ongoing Israel-Hamas war. Following a UN Commission report which found Israel was committing genocide in Gaza, Geldof said: \"When you purposefully starve children as an instrument of war then you are a war criminal.\" He went on: \"People simply don't have the bandwidth to deal with the cost of living, the flag waving, the horror of Ukraine, the horrors of Gaza. They're just tired, and they just want Israel to please stop it. And the UN has just confirmed that. Stop.\" The accusation of genocide has been made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished.  Read more entertainment news:Hollywood legend Robert Redford diesSpain votes to boycott Eurovision if Israel competes Geldof was speaking at the prestigious Sky Arts event, where he was recognised for his influence as a musician and cultural figure over the last five decades with a lifetime achievement award. Never afraid to be outspoken, he was one of the defining voices of the 1970s punk era before going on to co-create Band Aid and the historic Live Aid concerts, reshaping the relationship between music and global activism. Geldof performed with his band, The Boomtown Rats, during the ceremony which took place at London's Roundhouse, hosted by comedian Bill Bailey. See all the Sky Arts Awards winners here."
    },
    {
        "title": "Face-to-face with Zelenskyy, his frustration with the West is clear",
        "description": "Ukraine's president has a very clear message for Donald Trump - you alone have the power to stop Vladimir Putin, and the time to act is now. ",
        "url": "https://news.sky.com/story/face-to-face-with-zelenskyy-his-frustration-with-trump-was-clear-13431949",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-volodymyr-zelenskyy_7021627.png?20250915194014",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-09-16 00:05:00",
        "Headline": "Donald Trump has brought Vladimir Putin back in from the cold since his return to the White House, but it's a strategy that has so far failed to bring an end to the war in Ukraine - and Volodymyr Zelenskyy clearly doesn't approve of the tactics.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  Ukraine's president has a very clear message for Donald Trump - you alone have the power to stop Vladimir Putin, and the time to act is now.  Meeting with me in Kyiv on the eve of the US president's state visit to Britain, Volodymyr Zelenskyy bristled with frustration at the failure of the Western powers to ramp up pressure on the Kremlin, even as the Russians escalated their attacks on Ukraine. Asked if the summit between Trump and Putin in Alaska has proven a mistake, he responded without hesitation that Putin is clearly not paying a price for his actions. \"He should have received a setback in this war and stop. Instead, he received de-isolation,\" he said. \"He definitely wants to trick the US. He is doing everything he can to avoid sanctions, to prevent the US and Trump from putting sanctions on him.\" Zelenskyy believes Trump is reluctant to put pressure on Putin because it might jeopardise attempts to end the war. But the Ukrainian leader argues this isn't the way to handle the Russian president: \"He understands force. That's his language. That's the language he understands. He doesn't speak many languages, but that's the language of force he understands - just like Russian, you know, his mother tongue.\"  Read more from Sky News:Moscow trying to send a message with military drillsBritish fighter jets to fly defence missions over Poland Zelenskyy also argued Trump's emphasis on getting the Europeans to ratchet up economic pressure - foremost by stopping their purchases of Russian energy, and by putting tariffs on other buyers like China and India - was understandable, but that the world's superpower shouldn't wait for others to act. Trump has called on EU countries to end all Russian oil and gas purchases, and only then will he consider imposing sanctions on Russia. \"I think the US is strong enough on its own,\" Zelenskyy said. \"They can make this happen quicker and all that's lacking now is a strong sanctions package from the US.\""
    },
    {
        "title": "Prime suspect in Madeleine McCann case slapped with strict conditions ahead of jail release",
        "description": "The suspect in the Madeleine McCann case has had strict conditions slapped on him ahead of his expected release from prison in the morning.",
        "url": "https://news.sky.com/story/prime-suspect-in-madeleine-mccann-case-slapped-with-strict-conditions-ahead-of-jail-release-13432447",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-court-madeleine_7022538.jpg?20250916220445",
        "type": "World",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-16 20:29:00",
        "Headline": "The German national is being freed after serving a seven-year sentence for rape, but he remains the only suspect in the abduction of the toddler in Portugal 18 years ago.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n The suspect in the Madeleine McCann case has had strict conditions slapped on him ahead of his expected release from prison in the morning. Christian B, who can't be fully identified under privacy laws, will have to wear an electronic tag, surrender his passport and register his address with probation officers. The German drifter, 49, is being freed after serving a seven-year sentence for rape, but remains the only suspect for the abduction of Madeleine, the toddler who vanished on a family holiday in Portugal in 2007. It was not known where he would head, or who might help him adjust to a new life as the only suspect in the world's most notorious unsolved child abduction mystery. Prosecutor Hans Christian Wolters, who leads the Madeleine investigation, believes Christian B, 49, abducted and murdered the three-year-old during a family holiday in Portugal in 2007. Madeleine vanished from her bed in a rented apartment as her parents and their friends dined nearby at the hotel complex in Praia da Luz on the Algarve coast. Earlier this week it emerged the Metropolitan Police had sent a formal \"international letter of request\" to Christian B in order for them to interview him - but he rejected it. \n                  What we know about Christian B -  the prime suspect in Madeleine McCann's disappearance\n                 \n                  Prime suspect in Madeleine McCann case refuses to speak to British police\n                 \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 Explainer: The chequered history of Christian B In the past few days, a probation case conference decided on the restrictions which his lawyers are expected to challenge. His lawyer Philipp Marquort said: \"This is an attempt by the public prosecutor's office to keep him in a kind of pre-trial detention where they would have access to him at any time.\"  Christian B has denied any involvement in Madeleine's disappearance. Madeleine, who was nearly four, was sleeping in a room with her younger twin siblings when she went missing."
    },
    {
        "title": "Spain votes to boycott Eurovision if Israel competes",
        "description": "Spain has become the latest country to threaten a boycott of next year's Eurovision Song Contest if Israel competes.",
        "url": "https://news.sky.com/story/spain-votes-to-boycott-eurovision-if-israel-competes-13432081",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-melody-spain-eurovision_7021978.jpg?20250916115514",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-16 10:32:00",
        "Headline": "Broadcaster RTVE is now the fifth to threaten withdrawal from Eurovision over Israel, following the Netherlands, Ireland, Slovenia and Iceland.",
        "Content": " Spain has become the latest country to threaten a boycott of next year's Eurovision Song Contest if Israel competes. It is now the fifth broadcaster to say it will pull out over Israel's participation, following recent announcements by the Netherlands, Ireland, Slovenia and Iceland - but the first of the competition's so-called \"Big Five\", a group which also includes Britain, Germany, Italy and France. These countries provide the biggest financial contributions to Eurovision, with participants automatically qualifying for the final round, and their withdrawal would increase the pressure on the European Broadcasting Union (EBU), which organises the event. The Eurovision Song Contest Reference Group, the competition's governing body, said a decision on Israel's participation is pending and that it has \"taken note of the concerns expressed by several broadcasters\". RTVE, the Spanish state broadcaster, announced the decision following a board vote on Tuesday. The measure, proposed by president Jose Pablo Lopez, garnered 10 votes in favour, four against, and one abstention in the 15-member board, the broadcaster said in a statement. Spain's prime minister Pedro Sanchez has previously called for Israel to be banned from the competition, highlighting how Russia was expelled following its invasion of Ukraine in 2022. At the time, the EBU said the decision reflected \"concern that, in light of the unprecedented crisis in Ukraine, the inclusion of a Russian entry in this year's contest would bring the competition into disrepute\". Recent editions of the contest, which has always expressed political neutrality, have involved demonstrations against Israel's continued military action in Gaza - launched in response to the attack by Hamas militants on 7 October 2023, which left some 1,200 people dead. Israeli contestant Yuval Raphael, a survivor of the Hamas attack, finished second in this year's competition, held in Basel, Switzerland, in May - but there were protests before and during her performance. Austrian singer JJ, who won, has also called for Israel's exclusion in 2026. Israel has denied accusations it is committing genocide and claimed its actions have been in self-defence against Hamas. More than 64,000 Palestinians have been killed since Israel launched its military action. In a statement following the vote in Spain, contest director Martin Green said he understood the \"concerns and deeply held views around the ongoing conflict in the Middle East\", and that consultation with members is ongoing \"to gather views on how we manage participation and geopolitical tensions\". Broadcasters have until mid-December to conform if they want to take part. What have others said? Dutch broadcaster AvroTros said last week that it was taking a stance in response to the loss of life in Gaza, with the deaths of journalists there a factor in the decision. Irish broadcaster RTE said the country was taking the same stance, saying it was \"unconscionable\" to take part given the \"ongoing and appalling loss of lives in Gaza\". Following his win in May, singer JJ said it was \"disappointing to see Israel still participating\", according to Spanish newspaper El Pais. \"I would like the next Eurovision to be held in Vienna and without Israel,\" he added. Read more from Sky News:Trump sues New York TimesGoogle makes $5bn pledge to Britain The \"potential impacts and consequences of either decision\" are being assessed, the Eurovision Song Contest Reference Group said in a statament. Next year's Eurovision will be the 70th anniversary of the event, and will take place at the Wiener Stadthalle in Vienna on 16 May."
    },
    {
        "title": "OpenAI reveals how most people are using ChatGPT",
        "description": "Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed.",
        "url": "https://news.sky.com/story/openai-reveals-how-most-people-are-using-chatgpt-13432157",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-openai_7002687.jpg?20250827150243",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-16 13:42:00",
        "Headline": "Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released, according to new data. ",
        "Content": "\n          Science and technology reporter\n       Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed. Although AI bots can do anything from coding to drafting emails or even helping users to imagine and play, around 49% of the requests sent to ChatGPT since November 2022 were people asking the bot questions and looking for information. The report by the National Bureau of Economic Research (NBER) and OpenAI is the biggest study of its kind and draws from the huge amount of data collected by OpenAI - around 10% of the world's population is now thought to use the AI tool.  Although there was a steady growth in people using ChatGPT for work-related queries, more than 70% of all usage was non-work related, according to the report. There's also been a shift in who is using AI tools. Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released. By June 2025, however, users were more likely to have typically female first names, something the authors described as a \"dramatic shift\". \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 Anthropic AI, which runs the Claude AI chatbot, also released its own data on how customers are using AI. It found that the use of AI strongly correlated with average incomes. More affluent nations like Singapore and Canada were at the top end of countries using AI, while emerging economies like Indonesia, India and Nigeria, used Claude less. In the US, economic differences even played out at state level, and Claude researchers found that adoption of the technology rose faster with income. Read more from Sky News:PM's 'AI superpower' dream at risk, industry warnsZelenskyy makes demand of TrumpTrump sues New York Times Each 1% increase in state GDP was associated with a 1.8% increase in usage of AI. Usage also reflected what those areas were best known for; in California, Claude was often used to help with IT problems, in Florida, it was used for financial services and in Washington DC it was used for document editing and career assistance. AI literacy consultant Sarah J Lundrigan posted about the two reports, saying the \"blunt truth\" is: \"If you're still treating AI as 'something to try later,' you're behind. \"The value isn't in futuristic features - it's in solving today's friction points. \"The winners will be the ones who can simplify adoption, reduce overwhelm, and make AI part of how people work and live.\""
    },
    {
        "title": "Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 ",
        "description": "Two teenagers who filmed themselves urinating into a restaurant's hotpot broth have been ordered, along with their parents, to apologise and pay a fine of &#163;227,000, Chinese state media has said.",
        "url": "https://news.sky.com/story/teenagers-wu-and-tang-who-urinated-in-shanghai-restaurants-hotpot-fined-more-than-163230000-13432264",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hot-pot-food-chinese_7022289.jpg?20250916164411",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-16 16:27:00",
        "Headline": "The pair, both 17, took turns to stand on a table and filmed themselves urinating into a cooking vessel at an eatery in Shanghai, before posting the video online.",
        "Content": "Two teenagers who filmed themselves urinating into a restaurant's hotpot broth have been ordered, along with their parents, to apologise and pay a fine of £227,000, Chinese state media has said. The pair, both 17 and named Wu and Tang, took turns standing on a table and urinating into the dish in a private dining room at a branch of the Haidilao restaurant chain in Shanghai, NBC News, Sky's US partner, said, quoting state-run broadcaster CCTV News. One of them posted the video on social media earlier this year, revealing it was an \"intentional\" act and despite being \"fully aware\" of potential negative impact, CCTV News said, quoting a decision by Shanghai's Huangpu District People's Court. After the post went viral, Haidilao apologised about the incident and said it had \"destroyed and replaced\" all the affected utensils. The chain also refunded more than 4,000 affected dine-in orders and gave each customer extra compensation worth 10 times what they had paid. Hotpot is a dish of broth kept simmering in a pot by a heat source on the table, served with an array of meats or vegetables dipped into the broth as both flavour and cooking method. Tang and Wu and their parents were sued in March by two catering companies, described by NBC as \"likely linked to Haidilao\". \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 \n                  Prosecutors drop charges against two men accused of spying for China\n                 \n                  Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war\n                 The firms demanded a public apology and more than 23 million yuan (£2.4m) in damages for business losses, reputational harm and other related costs. The court ruled the full refunds were reasonable and directly related to the incident, but said the extra payments lacked legal basis and were deemed a \"voluntary business decision,\" NBC said, quoting CCTV News. The teenagers and their parents were ordered to place apologies in designated newspapers to the catering companies, and the parents would pay a fine of 2.2m yuan (£227,000), reports said. The court ruling shows that parents risk \"heavy penalties\" if they fail to supervise their youngsters, China Comment, an influential magazine of the ruling Communist Party, said in an editorial on Monday, NBC reported. Read more on Sky News:Robert Redford diesIsrael committing genocide in Gaza - UNHatton remembered by ex-girlfriend \"This behaviour can no longer be dismissed as a simple prank,\" it said, calling it \"extreme disregard for others' rights and a blatant challenge to social norms\". Authorities in China have faced food safety issues related to similar incidents recently. In August, Hong Kong police arrested a 63-year-old man for allegedly adding urine to soft drinks in supermarkets."
    },
    {
        "title": "Agnes Wanjiru: Arrest warrant issued for former British soldier over murder of Kenyan woman found in septic tank",
        "description": "An arrest warrant has been issued by a Kenyan High Court for a former British soldier in connection with the murder of a 21-year-old mother in 2012. ",
        "url": "https://news.sky.com/story/agnes-wanjiru-arrest-warrant-issued-for-british-national-over-murder-of-kenyan-woman-found-in-septic-tank-13431973",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-agnes-wanjiru_6637544.jpg?20250916122059",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-16 11:10:00",
        "Headline": "The 21-year-old was found dead two months after she disappeared in her hometown, Nanyuki, 2012. ",
        "Content": "An arrest warrant has been issued by a Kenyan High Court for a former British soldier in connection with the murder of a 21-year-old mother in 2012.  Agnes Wanjiru was found dead in a hotel septic tank in her Kenyan hometown, Nanyuki, which is close to the Batuk (British Army Training Unit Kenya) camp. In 2018, an inquest concluded that she was murdered by one or more British soldiers based in the area. Judge Alexander Muteti said there was sufficient evidence to compel the UK citizen to appear before the court on a charge of murder. Agnes' family welcomed the news in a statement issued by law firm Leigh Day. \"We have lived with the pain of Agnes' death for over a decade, they said. \"The reports that an arrest warrant has been issued against a UK citizen is a significant moment for us and is incredibly welcome. \"We hope this marks the beginning of justice being done for our beloved Agnes.\" The mother-of-one's body was found near the Lions Court Hotel two months after she disappeared in March 2012. An inquest found sex worker Ms Wanjiru was unlawfully kiflled and a post-mortem examination concluded she had died as a result of stab wounds to her chest and abdomen. There was also evidence that she had been beaten but, because of the condition of her body, it was unclear whether she had been sexually assaulted. Read more from Sky News:Zelenskyy demands 'clear position' from TrumpUN commission says Israel committing genocide According to an investigation by The Sunday Times, a British soldier accused of the murder has been named by his comrades after he allegedly confessed to the killing. Police in Kenya reopened the case into Ms Wanjiru's murder in 2021 after her family said they were upset no one had been convicted of the killing. Defence Secretary John Healey met with her family in April during a visit to Kenya, where the British Army has an agreement to deploy up to six battalions a year for training. Leigh Day human rights partner Tessa Gregory said: \"It is a very long road to justice for our client who has been fighting for accountability for Agnes' murder for over a decade. \"The family now calls upon the British government to do everything in its power to ensure that the accused can be extradited and face trial in Kenya as soon as possible.\" A UK government spokeswoman said: \"Our thoughts remain with the family of Agnes Wanjiru and we remain absolutely committed to helping them secure justice. \"We understand that the Kenyan Director of Public Prosecutions has determined that a British national should face trial in relation to the murder of Ms Wanjiru in 2012. \"This is subject to ongoing legal proceedings and we will not comment further at this stage.\""
    },
    {
        "title": "Trump's state visit begins as Epstein images beamed on to Windsor Castle",
        "description": "Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\".",
        "url": "https://news.sky.com/story/trumps-state-visit-begins-as-epstein-images-beamed-on-to-windsor-castle-13432498",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump_7022635.jpg?20250917004840",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 21:37:00",
        "Headline": "The US president's historic second state visit has begun - with him telling journalists upon arrival \"everyone's looking forward to it\". But not everyone greeted him warmly.",
        "Content": " Donald Trump has arrived in the UK for his second state visit, telling reporters Britain is \"a very special place\". But as he headed to the residence of the US ambassador to the UK in central London to spend Tuesday night, giant projections of the president alongside paedophile Jeffrey Epstein were beamed on to Windsor Castle by protesters. It is there he will meet with King Charles later today.  Four people were arrested on \"suspicion of malicious communications\" after the images of Mr Trump and Epstein appeared on the landmark, Thames Valley Police said. Mr Trump has faced mounting questions about his relationship with the disgraced late billionaire after messages allegedly sent to him by the president were published by Congress earlier this month. The apparent notes - which Mr Trump denies having written - appeared in a 2003 \"birthday book\" for Epstein which also included messages from Peter Mandelson, who has since been sacked as Sir Keir Starmer's ambassador to the US over his ties to the financier. Foreign Secretary Yvette Cooper was among those who greeted the president and First Lady Melania as they disembarked their official plane at Stansted airport on Tuesday evening. An honour guard of RAF personnel from The King's Colour Squadron lined up as he stepped off the plane. Trump excited to see 'my friend' Charles Speaking to reporters mid-flight, Trump said: \"My relationship is very good with the UK, and Charles, as you know, who's now King, is my friend. \"It's the first time this has ever happened where somebody was honoured twice. So, it's a great honour.\" He told the journalists \"everybody is looking forward to it. You're going to have the best pictures\". To mark the president's arrival, a new UK-US tech deal was announced that could generate billions of pounds of investment for Britain. Sir Keir - who will host Mr Trump at his Chequers country retreat tomorrow - said the deal would deliver \"growth, security and opportunity up and down the country\". Read more:No one does pomp better than Britain The Prince and Princess of Wales will greet the president and his wife in the grounds of the Windsor estate in the morning, before accompanying them to meet the King and Queen for an open-air greeting. Mr and Mrs Trump, the King, Camilla, William, and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is customary, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle.\n The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II, whom they both met on their first state visit. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. They will then be treated to a flypast by the Red Arrows alongside UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The traditional grand state banquet is set to follow in the castle's St George's Hall in the evening, with both Mr Trump and the King to give speeches as the event gets underway. The \"tech prosperity deal\", announced as Mr Trump touched down, will see the UK and US co-operate in areas including artificial intelligence (AI), quantum computing and nuclear power. It comes alongside £31bn of investment in Britain from top US tech firms, including £22bn from Microsoft.  'I'm into helping Britain' It also follows the agreement of an economic deal in May that covered a reduction in some of Mr Trump's tariffs. However, the government is understood to have given up hope - for now at least - of reducing the president's levy on steel back down to zero. It currently stands at 25%. Mr Trump had hinted at possible tariff relief for British steel as he boarded Air Force One, telling reporters he was \"into helping\" Britain on refining the trade deal signed earlier this year."
    },
    {
        "title": "Charlie Kirk suspect Tyler Robinson appears in court - as prosecutors say they will seek death penalty",
        "description": "Tyler Robinson has appeared in court via video link charged with the murder of right-wing influencer Charlie Kirk.",
        "url": "https://news.sky.com/story/tyler-robinson-charged-with-the-murder-of-right-wing-influencer-charlie-kirk-13432215",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-tyler-robinson_7022621.jpg?20250916232107",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 14:40:00",
        "Headline": "Prosecutors said the suspect's DNA was found on the trigger of the alleged murder weapon and that he had ordered his roommate to delete \"incriminating texts\".",
        "Content": " Tyler Robinson has appeared in court via video link charged with the murder of right-wing influencer Charlie Kirk. The 22-year-old, from Washington, Utah, was seen for the first time since his arrest after being charged with aggravated murder, weapon, and obstruction of justice offences. Robinson, who was seen on screen from Utah County Jail, spoke only to confirm his name. He was otherwise silent and appeared calm during the brief hearing. Judge Tony Graf read out the charges against him and said a further hearing would be held at the end of the month. Robinson did not appear to have any legal representation and was seen wearing a green vest with straps, reportedly designed to prevent him from self-harming, according to The New York Times. It came after prosecutors held a press conference earlier today to announce they would be seeking the death penalty. They claimed that Robinson's DNA was found on the trigger of the alleged murder weapon. A note was also found under his keyboard, which said: \"I had the opportunity to take out Charlie Kirk and I'm going to take it,\" according to a charging document from prosecutors. It is also alleged that the suspect ordered his roommate to delete \"incriminating texts\" about the killing and to stay silent if questioned by police. When his roommate texted to ask if he was the \"one who did it\", Robinson replied: \"I am, I'm sorry,\" prosecutors allege. Robinson is said to have written in another text: \"I had enough of his hatred. Some hate can't be negotiated out.\" He also allegedly wrote he had been planning the shooting for just over a week. Kirk, 31, was killed at one of his rallies at Utah Valley University last Wednesday. The political activist, a close ally of US President Donald Trump, died after being shot in the neck with a bullet. County attorney Jeff Gray said \"aggravating factors\" in the killing included that the \"defendant is believed to have targeted Charlie Kirk based on his political expression and did so knowing children were present and would witness the homicide\". Read more from Sky News:UN says Israel is committing genocideHollywood actor Robert Redford diesTrump sues New York Times The obstruction of justice charges relate to allegations that Robinson disposed of the weapon used in the killing, along with clothing he is said to have worn at the time. Robinson has been held without bail since his arrest. Investigators have spoken to Robinson's relatives and have carried out a search at his family home, 240 miles (385km) southwest of where the shooting took place. Mr Gray said Robinson had accused Kirk of \"spreading hate\" during a conversation with his father. He also allegedly described the university as a \"stupid venue\" for the influencer to hold an event. After the shooting, the county attorney said the suspect confessed to his parents after they confronted him, telling them he shot Kirk because \"there is too much evil in the guy\". Robinson's mother told police that her son had become more political and had \"started to lean more to the left\" in the past year or so, Mr Gray said. He added that the 22-year-old had become more \"pro-gay and trans-rights oriented\", according to his parents. His mother said he had started to date his roommate, who was \"transitioning genders\", prompting \"discussions\" with his father, who had very different political views. Robinson allegedly wrote in another message to his roommate that \"since Trump got into office [my father] has been pretty diehard MAGA\"."
    },
    {
        "title": "FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing",
        "description": "The FBI director has shouted at Democratic senators during a hearing, taking questions on the assassination of Charlie Kirk, Jeffrey Epstein and the firing of agents.",
        "url": "https://news.sky.com/story/fbi-director-kash-patel-shouts-at-democrat-senators-over-charlie-kirk-and-jeffrey-epstein-during-oversight-hearing-13432299",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-fbi-kash-patel-senate_7022363.jpg?20250916190036",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 17:32:00",
        "Headline": "Democratic senator Cory Booker accused Mr Patel of lying about firing FBI agents out of retribution for political investigations.",
        "Content": " The FBI director has shouted at Democratic senators during a hearing, taking questions on the assassination of Charlie Kirk, Jeffrey Epstein and the firing of agents. Kash Patel was testifying before a Senate Judiciary Committee for the first oversight hearing of his tenure as director of the US federal law enforcement bureau. During the hearing on Tuesday, Mr Patel defended the FBI's handling of the investigation into the killing of Mr Kirk, as well as his social media post saying that a suspect had been arrested, before that person was ultimately released. Follow the latest on Trump's state visit \"Could I have been more careful in my verbiage and included 'a' subject instead of 'the' subject? Sure,\" he said of the post. Democratic senator Cory Booker opened his questioning by accusing Patel of lying about firing FBI agents out of retribution for political investigations. Five FBI agents and top-level executives were known to have been summarily fired last month, according to the Associated Press. \n                  Watch as charges against Charlie Kirk killing suspect announced in Utah court\n                 \n                  Charlie Kirk suspect Tyler Robinson appears in court - as prosecutors say they will seek death penalty\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 Mr Booker said that the director \"pushed out senior FBI agents with decades of knowledge and experience\", and added: \"You've shifted the agency's priorities primarily to pursuing Donald Trump's immigration enforcement agenda. \"I believe you have made our country weaker and less safe.\" Mr Patel responded that \"you don't get to say that America is not safer under this leadership\", and said that Mr Booker's \"rant of false information does not bring this country together\", prompting the Democrat to raise his voice. Read more on Charlie Kirk:Vance says 'left-wing extremism' contributed to killingNew details emerge about suspect in Kirk killing The two then shouted at each other before committee chair and Republican senator Chuck Grassley banged his gavel to interrupt them. \"I've watched him talk over us, and you've never once criticised him for us,\" Mr Booker said to the chair as he got up to leave the room. \"He has been really disrespectful to senator after senator.\" Mr Patel also clashed with Democratic Senator Adam Schiff, who questioned the FBI and Trump administration's handling of questions relating to the deceased paedophile financier Epstein. The director accused him of \"the biggest fraud to ever sit in the United States Senate\" as they shouted at each other, and said \"you are a political buffoon, at best\". Read more from Sky News:Luigi Mangione terrorism charges droppedDonald Trump sues New York Times Mr Patel, a former lawyer who has been accused of spreading conspiracy theories, was controversially nominated to be the FBI director by US President Donald Trump last year. He was narrowly confirmed by the Senate in a 51-49 vote in February. Two Republicans voted against his nomination."
    },
    {
        "title": "In pictures: Memorable moments between the royals and US presidents",
        "description": "American presidents have travelled to Britain to meet the Royal Family for more than 100 years.",
        "url": "https://news.sky.com/story/in-pictures-memorable-moments-between-the-royals-and-us-presidents-13427162",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-royals-trump-president_7022185.jpg?20250916151529",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 14:24:00",
        "Headline": "Some presidential visits have run more smoothly than others. While Ronald Reagan enjoyed a horse ride around the grounds of Windsor with the late Queen, Jimmy Carter accidentally kissed the Queen Mother on the lips.",
        "Content": "American presidents have travelled to Britain to meet the Royal Family for more than 100 years. Donald Trump will meet King Charles for the second time when he arrives in Windsor on Wednesday, having been hosted by the late Queen Elizabeth II on his previous state visit during his first term. For the King, it will be the first time he welcomes a US president as monarch. Some presidents' visits have run more smoothly than others. Here, we look back at some of the most memorable. Woodrow Wilson was the first US president to visit the Royal Family while in office, making the long journey on SS Washington in December 1918 - weeks after the First World War came to an end. Arriving in London on Boxing Day, thousands of people lined the route to Buckingham Palace, where he appeared on the balcony alongside King George V and Queen Mary after chants of \"we want Wilson\" from the crowd. King George VI also made history when he met Franklin D Roosevelt, after becoming the first reigning British monarch to travel to the US in June 1939. People flocked to greet him and the Queen Mother as they rode through the streets of Washington DC. After state dinner formalities at the White House, they travelled to New York, where they enjoyed a more relaxed hot dog picnic in Hyde Park. Harry Truman was the first US president to meet Queen Elizabeth - while she was still a princess in 1951. Seven years after she took the throne, Dwight D Eisenhower met her at Balmoral, where a young Princess Anne and Prince Charles were pictured alongside him, wearing kilts. John F Kennedy met the then-35-year-old Queen Elizabeth in June 1961, just six months into his presidency. A state banquet was held at Buckingham Palace, with the glamorous visit dramatised in the Netflix series The Crown. Just two years later, on 22 November 1963, Kennedy was assassinated in Dallas. Gerald Ford didn't visit the UK during his two-and-a-half years in office, but the Queen met him on a visit to the US in July 1976. The pair danced together at a White House state dinner, but with unfortunate timing, the band played The Lady Is A Tramp just as the Queen took to the floor - a now infamous faux pas. Jimmy Carter met the late Queen at Buckingham Palace in May 1977. His more memorable interaction was with the Queen Mother, however, when he abandoned protocol and greeted her with a kiss on the lips. According to biographer William Shawcross, she later wrote: \"I took a sharp step backwards - not quite far enough.\" Among the most memorable meetings of a British monarch and a US president was that of Ronald Reagan and the late Queen. When he came to Windsor Castle in 1982, the pair were famously pictured riding horses together in the grounds. He met her a further three times in London throughout the 1980s and she gave him an honorary knighthood when he left the White House in 1989. George HW Bush, wasted no time in making the Queen's acquaintance, travelling to the UK in May 1989, just five months after he was sworn in. There were a few red faces when Her Majesty travelled to the US to visit him a year later. As she stood up to give a speech on the White House lawn, she was partially obscured behind a cluster of microphones that had been arranged for the much taller Mr Bush. He later reassured reporters that the Queen laughed off the incident. George W Bush's state visit in November 2003 was met with huge protests over the Iraq War. Tens of thousands of people crowded into Trafalgar Square, where an effigy of the president was toppled by demonstrators. The protests did not appear to affect the 'special relationship', however, with the Queen visiting the US to meet Mr Bush in 2007, and him returning to the UK to see her a year later. Barack Obama first met the Queen on a visit to the UK in 2009 when his wife, First Lady Michelle, made headlines for breaking royal protocol and giving Her Majesty a hug. The Obamas received the full pomp of an official state visit in May 2011. They visited a final time during the president's second term in April 2016, when Marine One landed in the grounds of Windsor Castle and the royal couple walked to greet them. Donald Trump first met the King while he was still Prince of Wales in December 2019, when his mother hosted a state visit to mark the 75th anniversary of D-Day. His trip was met with huge protests in London, which memorably featured a giant 'blimp' that depicted him as a baby. Despite being accused of breaching royal protocol on several occasions, he described the Queen as an \"incredible woman\" in one of his speeches. When Joe Biden visited Windsor Castle in June 2021 it was the first time the Queen had met a head of state alone - following the death of her husband Prince Philip. It was also the first state visit of any foreign leader after the coronavirus pandemic saw Her Majesty halt royal duties and quarantine at Windsor as part of 'HMS Bubble'."
    },
    {
        "title": "Hollywood actor and director Robert Redford dies at 89",
        "description": "Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89.",
        "url": "https://news.sky.com/story/hollywood-actor-and-director-robert-redford-dies-at-89-13432112",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-robert-redford-butch-cassidy_7022311.jpg?20250916172819",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 12:15:00",
        "Headline": "Best known for his performance in Butch Cassidy And The Sundance Kid, Robert Redford's film career, both in front of and behind the camera, spanned seven decades.",
        "Content": " Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89. Redford, who was also the founder of the Sundance Film Festival, the largest independent film festival in the US, died on Tuesday morning. In a statement, his representative said he was \"surrounded by those he loved\", at home in \"the place he loved\" in the mountains of Utah. \"He will be missed greatly,\" she added. Born Charles Robert Redford Jr in Santa Monica, California, in 1936, he attended college on a baseball scholarship but later went on to study at the American Academy of Dramatic Arts. He debuted on Broadway in the late 1950s before moving into television, in shows such as The Twilight Zone, Alfred Hitchcock Presents and The Untouchables. Rising to stardom in the 1960s, Redford became a go-to leading man in Hollywood and a huge star of the following decade, leading films including The Candidate, All the President's Men and The Way We Were. He worked hard to transcend being typecast for his good looks, through his political advocacy and a willingness to take on unglamorous roles. In the 1990s and 2000s, his film credits included Indecent Proposal, The Last Castle and Spy Game, and he also worked actively as a filmmaker - helming movies including A River Runs Through It and The Legend Of Bagger Vance. In 1998, he both starred in and directed The Horse Whisperer. But he was best known for his role as wily outlaw the Sundance Kid, opposite Paul Newman's Butch Cassidy in the 1969 film. The pair became a famous screen partnership, starring opposite each other again in The Sting a few years later, and good friends. As well as his starring roles, Redford was also an activist and an accomplished filmmaker - winning the Oscar for best director for Ordinary People in 1981. He had four Academy Award nominations in total - the first for acting for his performance in The Sting - as well as an honorary prize in 2002. In a career spanning seven decades, he also received three Golden Globe Awards, including the Cecil B DeMille lifetime achievement honor in 1994. In his later years, Redford took on a challenging role in All Is Lost, a 2013 survival story that featured virtually no other characters and barely any dialogue. His performance earned a standing ovation after the film was screened at the Cannes Film Festival.  In 2018, he received critical acclaim again in what he called his farewell movie, The Old Man And The Gun. His legacy lives on in the Sundance Film Festival, which grew into a cornerstone of the film industry and provided a launching pad for filmmakers including Quentin Tarantino, Paul Thomas Anderson, Steven Soderbergh, Gina Prince-Bythewood and Darren Aronofsky. And in 2016, former President Barack Obama awarded him the presidential medal of freedom - considered the US government's highest civilian honour - saying at the time that Americans \"admire Bob not just for his remarkable acting, but for having figured out what to do next\". Robert Redford leaves behind his wife Sibylle Szaggars and two daughters - Shauna, a painter, and Amy, an actress and director. He was previously married to Lola Van Wagenen. One of their children, Scott, died at the age of two months from sudden infant death syndrome. Another, James, died of cancer in 2020. 'One of the lions has passed' Tributes have been shared across social media following the announcement of Redford's death. Meryl Streep, who starred in Out Of Africa and Lions For Lambs opposite Redford, said: \"One of the lions has passed. Rest in peace my lovely friend.\" Filmmaker Ron Howard, known for Apollo 13 and A Beautiful Mind, described Redford as \"a tremendously influential cultural figure for the creative choices\" he made as an actor, producer and director, and said Sundance had been a \"gamechanger\". Marlee Matlin, star of the Oscar-winning CODA, said the film \"came to the attention of everyone\" because of the Sundance Festival. \"Sundance happened because of Robert Redford. A genius has passed,\" she said. \"He was part of a new and exciting Hollywood in the 70s and 80s,\" wrote author Stephen King. \"Hard to believe he was 89.\" Spencer Cox, the governor of Utah, wrote: \"Decades ago, Robert Redford came to Utah and fell in love with this place. \"He cherished our landscapes and built a legacy that made Utah a home for storytelling and creativity. \"Through Sundance and his devotion to conservation, he shared Utah with the world. Today we honor his life, his vision, and his lasting contribution to our state.\" In a statement, the Sundance Institute said: \"We are deeply saddened by the loss of our founder and friend Robert Redford. Bob's vision of a space and a platform for independent voices launched a movement that, over four decades later, has inspired generations of artists and redefined cinema in the US and around the world. \"Beyond his enormous contributions to culture at large, we will miss his generosity, clarity of purpose, curiosity, rebellious spirit, and his love for the creative process. We are humbled to be among the stewards of his remarkable legacy, which will continue to guide the Institute in perpetuity.\""
    },
    {
        "title": "Labour peer Lord Glasman got a 'discreet suggestion to shut up' after warning No 10 about Mandelson",
        "description": "A Labour peer has claimed he was \"discreetly\" told to \"shut up\" by Number 10 after issuing warnings about the appointment of Peter Mandelson as US ambassador.",
        "url": "https://news.sky.com/story/labour-peer-lord-glasman-got-a-discreet-suggestion-to-shut-up-after-warning-no-10-about-mandelson-13432288",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lord-glasman-pol-hub_6971978.jpg?20250723201404",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 17:00:00",
        "Headline": "The peer, who was the only Labour figure to attend Donald Trump's inauguration, said he was shown \"photos of Peter Mandelson blowing out birthday candles with Jeffrey Epstein\" while in the US last January.",
        "Content": "A Labour peer has claimed he was \"discreetly\" told to \"shut up\" by Number 10 after issuing warnings about the appointment of Peter Mandelson as US ambassador. Maurice Glasman, who was the only Labour figure to attend Donald Trump's inauguration, said he was shown \"photos of Peter Mandelson blowing out birthday candles with Jeffrey Epstein\" while in the US in January. The peer told Sophy Ridge on the Politics Hub that he reported this back to Downing Street, and was given a \"discreet suggestion to basically shut up about that\". Lord Mandelson was sacked as the UK's ambassador to the US last Thursday after details of his close relationship with disgraced financier Mr Epstein emerged in the media. Politics Live: Speaker grants emergency debate on Mandelson He had always admitted to having known Epstein, but emails between Lord Mandelson and the convicted paedophile showed the diplomat had sent messages of support even as the financier faced jail for sex offences in 2008. Lord Glasman, who founded the Blue Labour movement in 2009 as a counter to New Labour, told Sophy that he \"held the line\" on Lord Mandelson even as he was presented with photographs of the ambassador and Epstein together. \n                  No 10 insists migrant returns deal isn't a 'shambles' after court blocks man's removal\n                 \n                  Politics latest: PM told to make discussing Gaza with Trump 'top priority' - as Lib Dems accuse Israel of 'genocide'\n                 \n                  Investigation launched into ex-Reform MP over 'racial abuse' against Sky News journalist\n                 He said he \"reported back to No 10, that really I would think again about this appointment because really [his dismissal] was bound to happen\". \"It was not out of the clear blue sky, was it?\" The peer said he was asked to send back a report on the matter, which he did, and \"that was that\". \"I did say when I got back, I'd think again about this publicly. And then I did get a discreet suggestion to basically shut up about that. And I did.\" Sir Keir Starmer said on Monday he would have \"never appointed\" Lord Mandelson as US ambassador if he knew then what he knows now. The prime minister said Lord Mandelson went through a proper due diligence process before his appointment. But, he added: \"Had I known then what I know now, I'd have never appointed him.\" Sir Keir said he knew before Prime Minister's Questions on Wednesday that Lord Mandelson had not yet answered questions from government officials, but was unaware of the contents of the messages that led to his sacking. He said Lord Mandelson did not provide answers until \"very late\" on Wednesday, which was when he decided he had to be \"removed\". Lord Mandelson has said he regrets his relationship with Epstein, claiming repeatedly he wishes they had never met."
    },
    {
        "title": "Luigi Mangione: Terrorism charges dropped against alleged killer of healthcare boss",
        "description": "A judge has dismissed terrorism charges against Luigi Mangione, who is accused of murdering a US healthcare boss.",
        "url": "https://news.sky.com/story/luigi-mangione-terrorism-charges-dropped-against-alleged-killer-of-healthcare-boss-13432224",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-luigi-mangione-court_7022200.jpg?20250916155726",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 14:54:00",
        "Headline": "A New York state judge said the fatal shooting of UnitedHealthcare chief executive Brian Thompson did not amount to a terrorist act - but said the 27-year-old suspect could be charged with second-degree murder.",
        "Content": "A judge has dismissed terrorism charges against Luigi Mangione, who is accused of murdering a US healthcare boss. New York state judge Gregory Carro said there was no evidence that the killing of UnitedHealthcare (UHC) chief executive Brian Thompson amounted to a terrorist act. However, he upheld prosecutors' demand that the 27-year-old face second-degree murder charges - meaning there was malicious intent behind the killing but it was not premeditated. Mangione has previously pleaded not guilty to multiple counts, including murder as an act of terrorism, over the killing of Mr Thompson. The UHC boss was shot dead as he arrived for an investor conference at the New York Hilton Midtown on 4 December 2024. Mangione was arrested five days later after he was spotted at a McDonald's in Altoona, Pennsylvania, about 230 miles west of New York City. In his written decision, the judge said that although the killing was not a case of ordinary street crime, it did not meet the threshold for terrorism under New York law. \"While the defendant was clearly expressing an animus toward UHC, and the healthcare industry generally, it does not follow that his goal was to 'intimidate and coerce a civilian population', and indeed, there was no evidence presented of such a goal,\" Judge Carro wrote. The terrorism charges carried a maximum sentence of life in prison. However, as well as the case in New York state, Mangione is also facing separate federal murder charges, which could see him being sentenced to death if convicted. The federal case does not involve terrorism allegations. Read more from Sky News:UN says Israel is committing genocideHollywood actor Robert Redford diesTrump sues New York Times The suspect's lawyers argued that the parallel prosecutions had created a \"legal quagmire\" and amounted to double jeopardy, although Judge Carro rejected the claim. Further pretrial hearings, for both the federal and state cases, will be held in December. US Attorney General Pam Bondi said in April that she had asked federal prosecutors to seek the death penalty for \"an act of political violence\" and a \"premeditated, cold-blooded assassination that shocked America\". The Manhattan district attorney's office quoted extensively from Mangione's alleged handwritten diary in a court filing seeking to uphold his state murder charges.  In the writings, prosecutors said, Mangione wrote about rebelling against \"the deadly, greed-fuelled health insurance cartel\" and said killing an industry executive \"conveys a greedy bastard that had it coming\". They added that the writings \"convey one clear message: that the murder of Brian Thompson was intended to bring about revolutionary change to the healthcare industry\"."
    },
    {
        "title": "OpenAI reveals how most people are using ChatGPT",
        "description": "Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed.",
        "url": "https://news.sky.com/story/openai-reveals-how-most-people-are-using-chatgpt-13432157",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-openai_7002687.jpg?20250827150243",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-16 13:42:00",
        "Headline": "Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released, according to new data. ",
        "Content": "\n          Science and technology reporter\n       Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed. Although AI bots can do anything from coding to drafting emails or even helping users to imagine and play, around 49% of the requests sent to ChatGPT since November 2022 were people asking the bot questions and looking for information. The report by the National Bureau of Economic Research (NBER) and OpenAI is the biggest study of its kind and draws from the huge amount of data collected by OpenAI - around 10% of the world's population is now thought to use the AI tool.  Although there was a steady growth in people using ChatGPT for work-related queries, more than 70% of all usage was non-work related, according to the report. There's also been a shift in who is using AI tools. Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released. By June 2025, however, users were more likely to have typically female first names, something the authors described as a \"dramatic shift\". \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 Anthropic AI, which runs the Claude AI chatbot, also released its own data on how customers are using AI. It found that the use of AI strongly correlated with average incomes. More affluent nations like Singapore and Canada were at the top end of countries using AI, while emerging economies like Indonesia, India and Nigeria, used Claude less. In the US, economic differences even played out at state level, and Claude researchers found that adoption of the technology rose faster with income. Read more from Sky News:PM's 'AI superpower' dream at risk, industry warnsZelenskyy makes demand of TrumpTrump sues New York Times Each 1% increase in state GDP was associated with a 1.8% increase in usage of AI. Usage also reflected what those areas were best known for; in California, Claude was often used to help with IT problems, in Florida, it was used for financial services and in Washington DC it was used for document editing and career assistance. AI literacy consultant Sarah J Lundrigan posted about the two reports, saying the \"blunt truth\" is: \"If you're still treating AI as 'something to try later,' you're behind. \"The value isn't in futuristic features - it's in solving today's friction points. \"The winners will be the ones who can simplify adoption, reduce overwhelm, and make AI part of how people work and live.\""
    },
    {
        "title": "Trump sues New York Times",
        "description": "Donald Trump has announced he's suing The New York Times, just days after he threatened to do so over its reporting into his ties to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/trump-sues-new-york-times-13431962",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-president-trump_7020134.jpg?20250914131933",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-16 04:18:00",
        "Headline": "The US president has long accused the newspaper of being biased towards the Democrats and being hostile towards the MAGA movement.",
        "Content": "Donald Trump has announced he's suing The New York Times, just days after he threatened to do so over its reporting into his ties to Jeffrey Epstein. In a post on his Truth Social platform, the US president said he had \"the Great Honor of bringing a $15bn Defamation and Libel Lawsuit\" against \"one of the worst and most degenerate newspapers in the History of our Country\". Mr Trump's lengthy post - made late on Monday - is focused on his belief the outlet is bias towards the Democrats, citing the endorsement of Kamala Harris in last year's presidential election. It has \"been allowed to freely lie, smear, and defame me for far too long\", he added. Read more from Sky News:Trump sends National Guard into another cityThe massive security operation for Trump's visit The lawsuit - which has been brought in Florida - comes after Mr Trump raised the prospect of suing the newspaper last week for publishing articles about alleged notes he had sent Epstein. He dismissed the reporting as false. A lewd birthday message Trump allegedly sent to the convicted sex offender for his 50th birthday in 2003 was published by the US Congress days later. The pages are contained in files from the estate of the deceased billionaire paedophile, handed over to a Congressional committee. The collection of birthday tributes include a hand-drawing of a woman's body, signed \"Donald\". They also contain a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\". Mr Trump has maintained the note wasn't written by him, claiming the handwriting and signature do not match his own. The \"birthday book\" also included notes from former British minister Peter Mandelson, who has been sacked as the UK's ambassador to the US over revelations about his relationship with Epstein. Mr Trump has repeatedly denied any impropriety involving Epstein, whom he once counted as a friend.  Responding to his initial threat to sue, a spokeswoman for The New York Times said last week: \"Our journalists reported the facts, provided the visual evidence and printed the president's denial. It's all there for the American people to see and to make up their own minds about. \"We will continue to pursue the facts without fear or favour and stand up for journalists' First Amendment right to ask questions on behalf of the American people.\""
    },
    {
        "title": "Trump to sign US-UK tech partnership in drive for AI",
        "description": "Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal.",
        "url": "https://news.sky.com/story/trump-to-sign-us-uk-tech-partnership-in-drive-for-ai-13432253",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976103.jpg?20250728142513",
        "type": "US",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-16 15:56:00",
        "Headline": "Plans for billions of pounds of investment by US tech firms include an AI Growth Zone in Northumberland and a big expansion of data centre capacity.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal. Nvidia, Microsoft, Open AI and Google made a flurry of announcements to coincide with President Trump's state visit to the UK. They include plans to build data centres and invest in AI research and engineering. Money latest: Tax warning over state pension Sir Keir Starmer described the agreement, which both leaders will sign over the coming days, as \"a generational step change\" in Britain's relationship with the US. The deal will see both countries cooperate on AI, quantum computing and nuclear energy, with investment in modular reactors revealed earlier this week.  The prime minister said it was \"shaping the futures of millions of people on both sides of the Atlantic, and delivering growth, security and opportunity up and down the country\". \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 The government said the deal would deliver thousands of jobs, with a new AI Growth Zone in the North East of England earmarked for 5,000 jobs. The region will host a new data centre developed in partnership with ChatGPT developer OpenAI, the US chip giant Nvidia and the British data centre company Nscale. The UK government will supply energy for the project, which will be based in Blyth. Jensen Huang, chief executive of Nvidia, who has previously drawn attention to Britain's inadequate levels of digital infrastructure, said: \"Today marks a historic chapter in US-United Kingdom technology collaboration. \"We are at the Big Bang of the AI era - and the United Kingdom stands in a Goldilocks position, where world-class talent, research and industry converge.\" The Blyth data centre is part of Stargate, Open AI's infrastructure project to build large data centres across the US. The company has also developed sites in Norway and the UAE. Nvidia, which provides the graphic processing chips (GPUs), expects to generate $20bn (£14.6bn) by the end of this year from \"sovereign\" deals with national governments over the coming years. Sam Altman, OpenAI's chief executive, said: \"The UK has been a longstanding pioneer of AI, and is now home to world-class researchers, millions of ChatGPT users and a government that quickly recognised the potential of this technology. \"Stargate UK builds on this foundation to help accelerate scientific breakthroughs, improve productivity, and drive economic growth.\" Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' Microsoft also pledged £22bn, its largest ever investment in the UK, to expand data centres and construct the country's largest AI supercomputer. Meanwhile, Google owner Alphabet pledged £5bn to expand its data centres in Hertfordshire and fund its London-based subsidiary DeepMind, which uses AI to power cutting edge scientific research. The company was founded in Britain and acquired by Google in 2014. Other investments include £1.5bn from AI cloud computing company CoreWeave and £1.4bn from Salesforce."
    },
    {
        "title": "Trump to sign US-UK tech partnership in drive for AI",
        "description": "Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal.",
        "url": "https://news.sky.com/story/trump-to-sign-us-uk-tech-partnership-in-drive-for-ai-13432253",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976103.jpg?20250728142513",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-16 15:56:00",
        "Headline": "Plans for billions of pounds of investment by US tech firms include an AI Growth Zone in Northumberland and a big expansion of data centre capacity.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal. Nvidia, Microsoft, Open AI and Google made a flurry of announcements to coincide with President Trump's state visit to the UK. They include plans to build data centres and invest in AI research and engineering. Money latest: Tax warning over state pension Sir Keir Starmer described the agreement, which both leaders will sign over the coming days, as \"a generational step change\" in Britain's relationship with the US. The deal will see both countries cooperate on AI, quantum computing and nuclear energy, with investment in modular reactors revealed earlier this week.  The prime minister said it was \"shaping the futures of millions of people on both sides of the Atlantic, and delivering growth, security and opportunity up and down the country\". \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 The government said the deal would deliver thousands of jobs, with a new AI Growth Zone in the North East of England earmarked for 5,000 jobs. The region will host a new data centre developed in partnership with ChatGPT developer OpenAI, the US chip giant Nvidia and the British data centre company Nscale. The UK government will supply energy for the project, which will be based in Blyth. Jensen Huang, chief executive of Nvidia, who has previously drawn attention to Britain's inadequate levels of digital infrastructure, said: \"Today marks a historic chapter in US-United Kingdom technology collaboration. \"We are at the Big Bang of the AI era - and the United Kingdom stands in a Goldilocks position, where world-class talent, research and industry converge.\" The Blyth data centre is part of Stargate, Open AI's infrastructure project to build large data centres across the US. The company has also developed sites in Norway and the UAE. Nvidia, which provides the graphic processing chips (GPUs), expects to generate $20bn (£14.6bn) by the end of this year from \"sovereign\" deals with national governments over the coming years. Sam Altman, OpenAI's chief executive, said: \"The UK has been a longstanding pioneer of AI, and is now home to world-class researchers, millions of ChatGPT users and a government that quickly recognised the potential of this technology. \"Stargate UK builds on this foundation to help accelerate scientific breakthroughs, improve productivity, and drive economic growth.\" Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' Microsoft also pledged £22bn, its largest ever investment in the UK, to expand data centres and construct the country's largest AI supercomputer. Meanwhile, Google owner Alphabet pledged £5bn to expand its data centres in Hertfordshire and fund its London-based subsidiary DeepMind, which uses AI to power cutting edge scientific research. The company was founded in Britain and acquired by Google in 2014. Other investments include £1.5bn from AI cloud computing company CoreWeave and £1.4bn from Salesforce."
    },
    {
        "title": "NHS medicines bill should rise to preserve UK drug industry, minister says",
        "description": "The NHS will increase the amount it spends on medicines in response to criticism from pharmaceutical companies that the UK is becoming uncompetitive, science minister Lord Vallance has told MPs.",
        "url": "https://news.sky.com/story/nhs-medicines-bill-should-rise-to-preserve-uk-drug-industry-minister-says-13432231",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pharmacy-prescription_6988037.jpg?20250811122809",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-09-16 15:12:00",
        "Headline": "Science minister Lord Vallance, who rose to public prominence during the COVID pandemic, made his comments as drugs firms U-turn on planned UK investments.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n The NHS will increase the amount it spends on medicines in response to criticism from pharmaceutical companies that the UK is becoming uncompetitive, science minister Lord Vallance has told MPs. Investments worth close to £2bn have been paused or cancelled this year by three of the world's largest companies, Merck, AstraZeneca and Eli Lilly, amid a fraught negotiation between the industry and government over medicines pricing. Addressing an emergency session of the science, technology and innovation select committee, Lord Vallance acknowledged that low prices historically paid by the NHS, and pressure from US President Donald Trump to cut prices for US consumers, had made the UK less attractive to industry. Money latest: Tax warning over state pension He said: \"I'm deeply concerned that there's been a 10-year decrease in the investment in support for a vital industry; vital for the economy, vital for patients and vital for the NHS at a time when medicines are making a bigger contribution than ever. \"I think the NHS will spend a larger percentage of its budget on medicines. These things are all about trade-offs, and the trade-off that has been made for the last decade has been [to spend] a lower percentage on medicines. \"We are now reaping the consequences of that in a very urgent way, and that is what we need now to address.\" \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  Jaguar Land Rover cyber attack: No discussions' on taxpayer aid to suppliers\n                 \n                  State pension likely to rise by 4.7% after latest figures\n                 Lord Vallance's comments came after industry executives warned MPs the UK's commitment to the life sciences faces a \"credibility challenge\", and was losing out on investment to competitors including Germany, Ireland and Singapore. Ben Lucas, the UK managing director of drugs giant Merck, which last week cancelled a £1bn research investment in London, said the decision was made in part because of the \"end-to-end\" difficulty of doing business in the UK. He said: \"This is a credibility challenge. The reality is we have been having, with successive governments, this continued conversation about the potential of the UK. But from a US-based executive team looking in, I hear; 'We have heard this plan before, but it hasn't necessarily been delivered'.\" Tom Keith-Roach, the UK president of AstraZeneca, which has paused or cancelled $650m of investment in recent months, said: \"The UK is an increasingly challenging place to bring forward that innovation, to get through the front door… of the NHS, to deliver to patients and improve patient lives. \"What we are seeing globally is that discretionary investment in R&D is flowing into countries that are seen to value innovation and pull that through to patients. It is increasingly challenging to bring that investment into an environment that is apparently not.\" Read more:UK drugs industry's challenges may prove costly  The industry wants the threshold for allowing new drugs into the NHS increased from the current £20,000-£30,000, unchanged since 1999, and to increase an overall medicines budget that has fallen in real terms by 11% in a decade. It also wants a reduction in the complex \"clawback\" arrangements governing drug pricing, which this year will see the industry return 23% of total revenues to the NHS, around four times comparable schemes in Europe. Lord Vallance said discussions with industry over reforming the clawback arrangements continued, despite formal negotiations ending without agreement earlier this year."
    },
    {
        "title": "Jaguar Land Rover cyber attack: No discussions' on taxpayer aid to suppliers",
        "description": "There are \"no discussions around taxpayers' money\" to prop up Jaguar Land Rover's (JLR) suppliers, according to the prime minister's official spokesman, as the carmaker grapples with a lengthening production shutdown following last month's cyber attack.",
        "url": "https://news.sky.com/story/jaguar-land-rover-cyber-attack-no-discussions-on-taxpayer-aid-to-suppliers-13432113",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-tata-jaguar-land-rover_6166176.jpg?20230524173007",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-16 12:21:00",
        "Headline": "It would appear that pleas for aid, such as a COVID-style furlough scheme to preserve jobs, are not being considered at this stage of the crisis facing JLR and its supply chain.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n There are \"no discussions around taxpayers' money\" to prop up Jaguar Land Rover's (JLR) suppliers, according to the prime minister's official spokesman, as the carmaker grapples with a lengthening production shutdown following last month's cyber attack. JLR factories fell silent more than two weeks ago. While it is damaging for the company, it represents a perilous loss of business for the supply chain which has also been forced to send workers home. Some have already lost their jobs. Unions and the Business and Trade Committee of MPs were among those to request the possibility of aid to prevent job losses and employers going bust as the disruption drags on. Money latest: Tax warning over state pension What happened? It was revealed on 1 September that global production at JLR had been stopped following a cyber attack. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  NHS medicines bill should rise to preserve UK drug industry, minister says\n                 \n                  State pension likely to rise by 4.7% after latest figures\n                 IT systems were taken offline by the company under efforts to limit penetration and damage. The company appeared confident initially that manufacturing could resume but restart dates have been consistently put back. What damage was done? Jaguar Land Rover has said very little about the extent of the attack. But it admitted last week that some data had been accessed. It gave no further details. Who is to blame? A criminal investigation is continuing. A group of English-speaking hackers claimed responsibility for the JLR attack via a Telegram platform called Scattered Lapsus$ Hunters, an amalgamation of the names of hacking groups Scattered Spider, Lapsus$ and ShinyHunters. Scattered Spider, a loose group of relatively young hackers, was behind the Co-Op, Harrods and M&S attacks earlier in the year. It is widely believed that M&S paid a sum to regain control of its systems after it was targeted with ransomware though it has refused to confirm if this was the case. How is this affecting JLR as a business? JLR typically produces about 1,000 vehicles a day. Production staff are being paid but kept away from plants at Halewood on Merseyside, Solihull in the West Midlands, and its engine factory in Wolverhampton. It is the same story for workers at sites in Slovakia, China and India. JLR revealed on Tuesday that production lines would now remain shut until at least 24 September. David Bailey, professor of business economics at the Birmingham Business School, told the PA news agency: \"The value of cars usually made at the sites means that around £1.7bn worth of vehicles will not have been produced, and I'd estimate that would have an initial impact of around £120m on profits.\" JLR achieved a pre-tax profit of £2.5bn for the financial year ending 31 March 2025, so should be able to absorb such a hit. Sales and service operations continue as normal at its retail partners but the longer the disruption goes on, so do the risks to its inventories and bottom line. Why does its supply chain need help? This is the part of the operation that was always bound to suffer most in the event of a global JLR production shutdown. No manufacturing means no need for parts. The company usually depends on a \"just in time\" supply chain to feed its factories and keep production lines running smoothly. The Unite union has appealed for a COVID-style furlough scheme to prevent job losses and the risk of affected companies, often small or medium-sized firms, being forced out of business. JLR's operations are understood to directly support more than 100,000 jobs in the UK though that sum doubles through indirect roles. The loss of any major supplier would risk further production delays once JLR's IT systems are back online. It is currently understood that the vast majority of directly affected workers remain in their jobs but have either been sent home or are on restricted tasks. JLR suppliers Evtec, WHS Plastics, SurTec and OPmobility have had to temporarily lay off roughly 6,000 staff while a growing number of other firms are cutting workers, with temporary or contracted workers most likely to be affected. What has the government said? In addition to the remarks by the PM's official spokesman, minister for industry Chris McDonald told Sky News: \"We know this is a worrying time for those affected by this incident and our cyber experts are supporting JLR to help them resolve this issue as quickly as possible. \"I met the company today to discuss their plans to resolve this issue and get production started again, and we continue to discuss the impact on the supply chain.\""
    },
    {
        "title": "State pension likely to rise by 4.7% after latest figures",
        "description": "The state pension is likely to rise by 4.7% in April, after the latest official figures showed this was the pace of wage growth. ",
        "url": "https://news.sky.com/story/state-pension-likely-to-rise-by-47-after-latest-figures-13431979",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pensioner-tax-money_7000874.jpg?20250825112559",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-16 05:29:00",
        "Headline": "Official figures, from the ONS, also showed fewer job vacancies and payrolled staff, reflecting a challenging jobs market. Though more people than ever now work for the NHS. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The state pension is likely to rise by 4.7% in April, after the latest official figures showed this was the pace of wage growth.  The pension is determined by the triple lock, which means it will rise every year by whichever is highest: inflation in September, average weekly earnings from May to July or 2.5%. Inflation in September is expected to be 4% by the Bank of England, meaning wage data, released by the Office for National Statistics (ONS) on Tuesday, is set to be the highest figure. Government retains control of pension increases and, despite commitments, could decide not to abide by the triple lock. The new pension sum will start being paid in April, and if increased by 4.7% would reach £12,534.60, above £12,000 for the first time. A political challenge Despite the significant cost implications for the state, Work and Pensions Secretary Pat McFadden said the government was committed to the triple lock. \n                  Surge in the price of matcha as global demand soars, with US sales up by 86%\n                 \n                  US financial firms pledge £1.25bn to UK ahead of Trump's visit\n                 \n                  'Don't drive great people away': Tory peer urges Rachel Reeves to 'think again' on tax rises\n                 He said: \"The OBR estimates that will mean a rise in the state pension of around £1,900 a year over the course of the parliament... that's something that we said we will do in the election and something that we will keep to.\" It's likely to be a headache for Chancellor Rachel Reeves as she struggles to stick within her self-imposed fiscal rules to reduce government debt and balance the budget. Read more:Britain's drugs industry is suffering withdrawal symptoms'If we're not there already, we're coming near you', Aldi says There may be additional political pressure from pensioners themselves, as the elevated payment nearly becomes taxable, hovering just below the £12,570 income tax threshold. While the average weekly earnings measure of wage growth rose, up from 4.5% a month earlier, another figure slowed. Earnings excluding bonuses dropped from 5% to 4.8% across the month. It means pay is still rising faster than inflation, which was 3.8% at the latest reading, and wage growth is high by historical standards. A tough job market The data was not so positive for those looking for a job. There are fewer vacant roles and fewer people on payrolls, the ONS said. Compared to a year earlier, there were 127,000 fewer payrolled employees in August, provisional estimates show. There were estimated to be 10,000 fewer vacancies from June to August 2025, marking the 38th consecutive period of vacancy drops. The drops have decreased from previous months, suggesting the worst of the industry reaction to increased employers' national insurance contributions and minimum wage rises. Vacancies decreased in nine of the 18 industry sectors. Statistics also released on Tuesday showed a record 2.07 million people are working for the NHS. The unemployment rate, however, remained at 4.7%. The ONS continued to advise caution when interpreting changes in the monthly unemployment rate due to concerns over the reliability of the figures. The exact number of unemployed people is unknown, due to low survey response rates."
    },
    {
        "title": "Surge in the price of matcha as global demand soars, with US sales up by 86%",
        "description": "The price of matcha has surged, with sales of the powdered tea up by 86% in the US, according to new research.",
        "url": "https://news.sky.com/story/surge-in-the-price-of-matcha-as-global-demand-soars-with-us-sales-up-by-86-13432148",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-matcha-tea_7022143.jpg?20250916144451",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-16 13:31:00",
        "Headline": "The green tea has gone viral on social media, with bright green lattes a common sight on apps like TikTok.",
        "Content": "The price of matcha has surged, with sales of the powdered tea up by 86% in the US, according to new research. The green beverage has gone viral on social media thanks to a trend for sweet colourful drinks made from milk, sometimes called \"bright lattes\". As a result, the cost has risen as manufacturers have struggled to keep up with global demand. Market research firm, NIQ, says retail sales in the US are up 86% from three years ago. Donald Trump's tariffs may also be impacting costs in the US, although it is not clear if matcha will be exempt because it's a natural product not grown in significant quantities in America. President Trump previously made an exception for cork from the European Union. China has also raised prices because of labour shortages and high demand. \n                  State pension likely to rise by 4.7% after latest figures\n                 \n                  US financial firms pledge £1.25bn to UK ahead of Trump's visit\n                 \n                  'Don't drive great people away': Tory peer urges Rachel Reeves to 'think again' on tax rises\n                 Japan, one of the world's biggest matcha producers, suffered a reduction in output in this year's harvest owing to poor weather. Aaron Vick, a senior tea buyer with California-based tea importer GS Haly, claims he paid 75% more for the highest-grade 2025 crop of Japanese matcha, which will arrive later this year. He added that lower grades of matcha will cost 30% to 50% more. Chinese matcha, which is generally cheaper than the tea from Japan, is also getting more expensive, he added. Mr Vick said: \"People should expect an enormous increase in the price of matcha this year. \"It's going to be a bit of a tough ride for matcha devotees. They will have to show the depth of their commitment at the cash register.\" The report did not outline an increase in prices for UK customers. But Starbucks, a major player in the UK's coffee shop scene, says it sources matcha from China, Japan and South Korea."
    },
    {
        "title": "Channel 4 ventures arm takes stake in start-up AllergyRhino",
        "description": "The ventures arm of Channel 4, the state-owned broadcaster, is taking a stake in a new digital health company which aims to help tackle the growing scourge of chronic allergies in the UK.",
        "url": "https://news.sky.com/story/channel-4-ventures-arm-takes-stake-in-start-up-allergyrhino-13432149",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-16 13:31:00",
        "Headline": "The latest media-for-equity deal struck by the state-owned broadcaster involves a digital health start-up aiming to tackle Britain's growing chronic allergies crisis, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The ventures arm of Channel 4, the state-owned broadcaster, is taking a stake in a new digital health company which aims to help tackle the growing scourge of chronic allergies in the UK. Sky News has learnt that AllergyRhino, which has been set up to offer patients access to personalised allergy immunotherapy, has struck a deal with Channel 4 Ventures as part of a fundraising which also includes the early-stage investment firm Lexham Partners. The so-called media-for-equity arrangement will give the AllergyRhino brand exposure using Channel 4's advertising inventory as it seeks to build name recognition. It is the latest such agreement signed by Channel 4 Ventures, with previous counterparties having included the online estate agent Purplebricks and Crowdcube, the crowd-funding platform. Money latest: Tax warning over state pension AllergyRhino is chaired by Dr Sneh Khemka, a former global medical chief at Bupa and ex-chief executive of Simplyhealth. It counts Professor Adam Fox, past president of the British Society for Allergy and Clinical Immunology, and Professor Stephen Till, a consultant allergist at Guy's and St Thomas' NHS Foundation Trust, among the members of its clinical advisory team. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  NHS medicines bill should rise to preserve UK drug industry, minister says\n                 \n                  Jaguar Land Rover cyber attack: No discussions' on taxpayer aid to suppliers\n                 The company's formation comes as the problem of chronic allergies soars in Britain, with data suggesting that one in four people now live with seasonal or persistent rhinitis, triggered by factors such as hay fever and dust mite allergy. It is said to be the fastest-growing chronic condition among children. Its funding round - encompassing the value of the Channel 4 Ventures deal and capital from Lexham - is said to be worth more than £4m. Channel 4 declined to comment, while neither Allergy Rhino nor Lexham could be reached for comment."
    },
    {
        "title": "Google makes £5bn pledge to Britain - but concerns raised over mooted UK-US tech deal",
        "description": "Google is set to invest &#163;5bn in the UK in the next two years, to support growing demands for AI services.",
        "url": "https://news.sky.com/story/google-makes-1635bn-pledge-to-britain-but-concerns-raised-over-mooted-uk-us-tech-deal-13431957",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-google-deepmind_7021723.jpg?20250916050617",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-16 03:32:00",
        "Headline": "The major deal is part of a package of announcements expected to be made during Donald Trump's state visit to Britain.",
        "Content": "Google is set to invest £5bn in the UK in the next two years, to support growing demands for AI services. The announcement, which comes as Google opens a new data centre in Waltham Cross in Hertfordshire, is expected to contribute to the creation of thousands of jobs, the US tech giant said. Chancellor Rachel Reeves described it as a \"vote of confidence\" in the UK economy. The news comes hours before Donald Trump lands in the UK for a state visit at which he and Sir Keir Starmer are widely expected to sign a new UK-US tech deal. It also follows reports that ChatGPT parent firm OpenAI, and Nvidia, will also unveil billions of dollars' worth of investment into UK data centres this week. The chancellor said the investment would boost research and development, capital expenditure and engineering. However, Liberal Democrat leader Sir Ed Davey has criticised the proposed deal as a \"Silicon Valley stitch-up\", and has demanded that the government put it to a vote in parliament. He said: \"I am really concerned the government is going to agree to a Silicon Valley stitch-up that hands tax cuts to tech billionaires while undermining protections for our children online.\" Sir Ed added: \"Parents want protections for children online to be kept in place, not traded away in a backroom deal with tech barons. \"We can't let the government sign up to a deal that benefits Elon Musk at the expense of the British people.\" Read more:What Elon Musk told crowds in London via video link Google has confirmed it will invest £5bn into capital expenditure, research and development, and related engineering over the next two years, which will include \"pioneering\" AI research in science and healthcare through its DeepMind operation. The Silicon Valley firm said the investment will help the UK grow its AI economy and contribute to technological breakthroughs, improvements in cybersecurity and job creation. Google predicted the investment will help to create 8,250 jobs annually at UK businesses. DeepMind co-founder and chief executive Demis Hassabis said: \"We founded DeepMind in London because we knew the UK had the potential and talent to be a global hub for pioneering AI. \"The UK has a rich history of being at the forefront of technology - from Lovelace to Babbage to Turing - so it's fitting that we're continuing that legacy by investing in the next wave of innovation and scientific discovery in the UK.\""
    },
    {
        "title": "Sky to cut about 600 tech jobs",
        "description": "Sky is to cut roughly 600 tech jobs as a consultation involving 900 people begins. ",
        "url": "https://news.sky.com/story/sky-to-cut-about-600-tech-jobs-13432039",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sky-livingstone_6868456.jpg?20250327125844",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-16 09:04:00",
        "Headline": "Roles will be at risk at Sky's Osterley, Leeds and Livingston sites.",
        "Content": "Sky is to cut roughly 600 tech jobs as a consultation involving 900 people begins.  Employees working at the Leeds, Livingston and Osterley sites are to be affected. The jobs are going as part of a reorganisation of Sky's technology team as it moves from creating new platforms, like Sky Glass and Sky Stream television, to working on existing services. As the company moves from product development, it's understood that teams need to be simpler, more focused and flexible. More tech functions are also being carried out across Sky's international operations. Read more:Britain's drugs industry is suffering withdrawal symptoms'If we're not there already, we're coming near you', Aldi says Job losses will not be down to individual performance, Sky News understands, but rather to better meet the needs of customers and the business. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  NHS medicines bill should rise to preserve UK drug industry, minister says\n                 \n                  Jaguar Land Rover cyber attack: No discussions' on taxpayer aid to suppliers\n                 Internal redeployment opportunities will be available, as will assistance in finding new jobs externally, Sky News also understands. Sky is the owner of Sky News, with Comcast the parent company. A Sky spokesperson said, \"Over the past few years, Sky has launched a set of market-leading products including Sky Glass, Sky Stream and our full fibre broadband service. \"These products are now firmly established and used by millions of customers, strengthening Sky's reputation for innovation and great service. \"As we look ahead, we are shifting our approach to bring customers the next generation of experience by investing in digital-first service, unbeatable content, and even better performance from our products, powered by the best of global innovation.\""
    },
    {
        "title": "Aldermore Bank chief Cooper to run wealth manager Fairstone",
        "description": "The boss of Aldermore Bank, one of Britain's biggest challenger lenders, is leaving to run Fairstone Group, a privately owned wealth management and mortgage provider.",
        "url": "https://news.sky.com/story/aldermore-bank-chief-cooper-to-run-wealth-manager-fairstone-13432017",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-waterloo-bridge-london_6988596.jpg?20250812074610",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-16 07:56:00",
        "Headline": "Former Barclays executive Steven Cooper will this week be named as the new CEO of private equity-backed wealth management firm Fairstone Group, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The boss of Aldermore Bank, one of Britain's biggest challenger lenders, is leaving to run Fairstone Group, a privately owned wealth management and mortgage provider. Sky News understands that Steven Cooper, a former boss of C Hoare & Co, the UK's oldest private bank, will be named this week as Fairstone's chief executive. The company has set Mr Cooper the target of replicating his performance at Aldermore by doubling Fairstone's size by 2030. Backed by investors including TA Associates, Fairstone has roughly £20bn of assets under management, and a client base of more than 120,000 people. Under Mr Cooper, South African-owned Aldermore doubled in size, and explored ambitious takeover deals including a bid for the Co-operative Bank. More recently, it has been grappling with the unfolding crisis in the motor finance market, which is expected to lead to consumers receiving close to £20bn in compensation payouts. Mr Cooper, a former Barclays executive, will replace Fairstone founder Lee Hartley, who is moving to the role of deputy chairman. \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  NHS medicines bill should rise to preserve UK drug industry, minister says\n                 \n                  Jaguar Land Rover cyber attack: No discussions' on taxpayer aid to suppliers\n                 \"As well as being one of the fastest growing wealth advisory firms in the UK and Ireland, Fairstone is also one of the most trusted by its clients,\" Mr Cooper said in a statement issued to Sky News. Fairstone is expected to continue to pursue acquisitions as part of its strategy under its new chief executive. Last year, revenues at Fairstone, which has more than 1,250 staff and regulated advisers, exceeded £175m for the first time."
    },
    {
        "title": "Investigation launched into ex-Reform MP over 'racial abuse' against Sky News journalist",
        "description": "An investigation has been launched into a former Reform MP over alleged racial abuse against a Sky News journalist.",
        "url": "https://news.sky.com/story/investigation-launched-into-ex-reform-mp-over-racial-abuse-against-sky-news-journalist-13432175",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-james-mcmurdock-mp_7004903.jpg?20250829182503",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-16 14:07:00",
        "Headline": "The parliamentary standards commissioner is investigating James McMurdock, who was elected as a Reform MP last year but suspended himself after allegations emerged over loans he claimed during the pandemic.",
        "Content": "An investigation has been launched into a former Reform MP over alleged racial abuse against a Sky News journalist. The parliamentary standards commissioner is investigating James McMurdock, who was elected as a Reform MP last year but suspended himself after allegations emerged over loans he claimed during the pandemic. Ben Obese-Jecty, the Conservative MP, wrote to the watchdog in August to urge an investigation into Mr McMurdock's \"use of social media to apparently facilitate racial abuse\" against Sky News political correspondent Mhari Aurora. Politics Live: Speaker grants emergency debate on Mandelson The standards commissioner has now confirmed it will consider allegations that Mr McMurdock started an \"N-Tower\" on social media by posting the single letter \"N\" under an X post that was critical of Aurora. This was described by Mr Obese-Jecty as \"a means of using a racial slur against an individual on an online platform whilst circumventing moderation that would remove racially abusive content\". He added: \"The practice involves spelling out a racial slur vertically with each individual posting a single letter of the word in order to spell it vertically\" as the posts appear below each other. \n                  No 10 insists migrant returns deal isn't a 'shambles' after court blocks man's removal\n                 \n                  Politics latest: PM told to make discussing Gaza with Trump 'top priority' - as Lib Dems accuse Israel of 'genocide'\n                 \n                  Labour peer Lord Glasman got a 'discreet suggestion to shut up' after warning No 10 about Mandelson\n                 Mr McMurdock is under investigation for potentially breaching rule 11 of the House of Commons Code of Conduct. This states: \"Members shall never undertake any action which would cause significant damage to the reputation and integrity of the House of Commons as a whole, or of its Members generally.\" Mr Obese-Jecty said in his complaint that the alleged actions of the former Reform MP \"reflect a lack of adherence\" to the seven principles of public life. He said by \"deleting the post without challenging the subsequent spelling\" that was started by him, Mr McMurdock showed a \"failure to challenge poor behaviour\" and \"absence of moral courage\". Mr Obese-Jecty added: \"Having repeatedly experienced this specific type of online racial abuse myself I am horrified that a fellow member of parliament would apparently see this as a legitimate means of challenging a Westminster lobby journalist in a public forum. \"I sincerely hope that there is a coherent and believable explanation for this horrendous action.\" At the time, Mr McMurdock appeared to deny he made the post, sharing a screenshot of X's AI assistant Grok claiming he never posted the letter N, based on a screenshot of the N-Tower. Grok is a large language model, which is known to be inaccurate. He added that Mr Obese-Jecty's \"complaint regarding the alleged posting of a single letter is beyond ridiculous\". Mr McMurdock has been contacted for comment."
    },
    {
        "title": "Labour peer Lord Glasman got a 'discreet suggestion to shut up' after warning No 10 about Mandelson",
        "description": "A Labour peer has claimed he was \"discreetly\" told to \"shut up\" by Number 10 after issuing warnings about the appointment of Peter Mandelson as US ambassador.",
        "url": "https://news.sky.com/story/labour-peer-lord-glasman-got-a-discreet-suggestion-to-shut-up-after-warning-no-10-about-mandelson-13432288",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lord-glasman-pol-hub_6971978.jpg?20250723201404",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-16 17:00:00",
        "Headline": "The peer, who was the only Labour figure to attend Donald Trump's inauguration, said he was shown \"photos of Peter Mandelson blowing out birthday candles with Jeffrey Epstein\" while in the US last January.",
        "Content": "A Labour peer has claimed he was \"discreetly\" told to \"shut up\" by Number 10 after issuing warnings about the appointment of Peter Mandelson as US ambassador. Maurice Glasman, who was the only Labour figure to attend Donald Trump's inauguration, said he was shown \"photos of Peter Mandelson blowing out birthday candles with Jeffrey Epstein\" while in the US in January. The peer told Sophy Ridge on the Politics Hub that he reported this back to Downing Street, and was given a \"discreet suggestion to basically shut up about that\". Lord Mandelson was sacked as the UK's ambassador to the US last Thursday after details of his close relationship with disgraced financier Mr Epstein emerged in the media. Politics Live: Speaker grants emergency debate on Mandelson He had always admitted to having known Epstein, but emails between Lord Mandelson and the convicted paedophile showed the diplomat had sent messages of support even as the financier faced jail for sex offences in 2008. Lord Glasman, who founded the Blue Labour movement in 2009 as a counter to New Labour, told Sophy that he \"held the line\" on Lord Mandelson even as he was presented with photographs of the ambassador and Epstein together. \n                  No 10 insists migrant returns deal isn't a 'shambles' after court blocks man's removal\n                 \n                  Politics latest: PM told to make discussing Gaza with Trump 'top priority' - as Lib Dems accuse Israel of 'genocide'\n                 \n                  Investigation launched into ex-Reform MP over 'racial abuse' against Sky News journalist\n                 He said he \"reported back to No 10, that really I would think again about this appointment because really [his dismissal] was bound to happen\". \"It was not out of the clear blue sky, was it?\" The peer said he was asked to send back a report on the matter, which he did, and \"that was that\". \"I did say when I got back, I'd think again about this publicly. And then I did get a discreet suggestion to basically shut up about that. And I did.\" Sir Keir Starmer said on Monday he would have \"never appointed\" Lord Mandelson as US ambassador if he knew then what he knows now. The prime minister said Lord Mandelson went through a proper due diligence process before his appointment. But, he added: \"Had I known then what I know now, I'd have never appointed him.\" Sir Keir said he knew before Prime Minister's Questions on Wednesday that Lord Mandelson had not yet answered questions from government officials, but was unaware of the contents of the messages that led to his sacking. He said Lord Mandelson did not provide answers until \"very late\" on Wednesday, which was when he decided he had to be \"removed\". Lord Mandelson has said he regrets his relationship with Epstein, claiming repeatedly he wishes they had never met."
    },
    {
        "title": "Former Tory minister Maria Caulfield defects to Reform UK",
        "description": "Another former Conservative MP has defected to Reform UK.",
        "url": "https://news.sky.com/story/former-tory-minister-maria-caulfield-defects-to-reform-uk-13432053",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-maria-caulfield-lewes_7021932.jpg?20250916103104",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-16 09:37:00",
        "Headline": "Maria Caulfield, who served as the MP for Lewes for nearly a decade, has become the latest former Conservative to defect to Nigel Farage's paty.",
        "Content": " Another former Conservative MP has defected to Reform UK. Maria Caulfield, who served as the MP for Lewes for nearly a decade, as well as a government minister, is the 13th ex-Tory to join Nigel Farage's party, which continues to gather momentum. The announcement of her move on Tuesday follows sitting MP Danny Kruger's decision to defect yesterday and head up Reform's work to prepare for government. Politics latest: MPs to debate Mandelson appointment and Epstein links Ms Caulfield, a former health minister, told GB News: \"If you are Conservative right-minded, then the future is Reform. The country is going to change a lot. \"The same people who thought that Brexit would not happen think that Reform will not happen. They are in for a shock.\" She added: \"I have joined. My husband joined a few months ago and I joined a month ago.\" \n                  Kemi Badenoch reveals her conditions for helping Sir Keir Starmer with 'out of control' welfare spending\n                 \n                  Boris Johnson ally Nadine Dorries latest Tory to defect to Reform UK\n                 \n                  Everything you need to know about being a political party member\n                 Reacting to the defection, Tory leader Kemi Badenoch admitted her party is having a \"tough and bumpy time\", but reiterated her argument that it takes time to develop policies, and called on the public and her party to be patient. Ms Caulfield is a former nurse, and her first ministerial job came in 2021, when she joined the Department for Health in Boris Johnson's government. After a spell on the backbenches during the brief premiership of Liz Truss, she was brought back into government under Rishi Sunak, becoming the minister responsible for mental health and women's health. She lost her seat at the 2024 general election to the Liberal Democrats, with her vote share having plummeted by nearly 22%. 'We need to hold our nerve' Her announcement follows that of Danny Kruger, the MP for East Wiltshire, who announced his move at a press conference alongside Nigel Farage on Monday. He said the Conservative Party is \"over\", and Reform is now the primary vehicle for conservatism.  But shadow chancellor Sir Mel Stride said his analysis was \"profoundly wrong\". He told BBC Radio 4's Today programme: \"It is certainly the case that we had a devastating defeat about a year ago, that we lost that connection with the electorate, that trust with the electorate, and it is also true that it will take us time to rebuild that.\" He added: \"We need to hold our nerve.\""
    },
    {
        "title": "State pension likely to rise by 4.7% after latest figures",
        "description": "The state pension is likely to rise by 4.7% in April, after the latest official figures showed this was the pace of wage growth. ",
        "url": "https://news.sky.com/story/state-pension-likely-to-rise-by-47-after-latest-figures-13431979",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pensioner-tax-money_7000874.jpg?20250825112559",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-16 05:29:00",
        "Headline": "Official figures, from the ONS, also showed fewer job vacancies and payrolled staff, reflecting a challenging jobs market. Though more people than ever now work for the NHS. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The state pension is likely to rise by 4.7% in April, after the latest official figures showed this was the pace of wage growth.  The pension is determined by the triple lock, which means it will rise every year by whichever is highest: inflation in September, average weekly earnings from May to July or 2.5%. Inflation in September is expected to be 4% by the Bank of England, meaning wage data, released by the Office for National Statistics (ONS) on Tuesday, is set to be the highest figure. Government retains control of pension increases and, despite commitments, could decide not to abide by the triple lock. The new pension sum will start being paid in April, and if increased by 4.7% would reach £12,534.60, above £12,000 for the first time. A political challenge Despite the significant cost implications for the state, Work and Pensions Secretary Pat McFadden said the government was committed to the triple lock. \n                  Surge in the price of matcha as global demand soars, with US sales up by 86%\n                 \n                  US financial firms pledge £1.25bn to UK ahead of Trump's visit\n                 \n                  'Don't drive great people away': Tory peer urges Rachel Reeves to 'think again' on tax rises\n                 He said: \"The OBR estimates that will mean a rise in the state pension of around £1,900 a year over the course of the parliament... that's something that we said we will do in the election and something that we will keep to.\" It's likely to be a headache for Chancellor Rachel Reeves as she struggles to stick within her self-imposed fiscal rules to reduce government debt and balance the budget. Read more:Britain's drugs industry is suffering withdrawal symptoms'If we're not there already, we're coming near you', Aldi says There may be additional political pressure from pensioners themselves, as the elevated payment nearly becomes taxable, hovering just below the £12,570 income tax threshold. While the average weekly earnings measure of wage growth rose, up from 4.5% a month earlier, another figure slowed. Earnings excluding bonuses dropped from 5% to 4.8% across the month. It means pay is still rising faster than inflation, which was 3.8% at the latest reading, and wage growth is high by historical standards. A tough job market The data was not so positive for those looking for a job. There are fewer vacant roles and fewer people on payrolls, the ONS said. Compared to a year earlier, there were 127,000 fewer payrolled employees in August, provisional estimates show. There were estimated to be 10,000 fewer vacancies from June to August 2025, marking the 38th consecutive period of vacancy drops. The drops have decreased from previous months, suggesting the worst of the industry reaction to increased employers' national insurance contributions and minimum wage rises. Vacancies decreased in nine of the 18 industry sectors. Statistics also released on Tuesday showed a record 2.07 million people are working for the NHS. The unemployment rate, however, remained at 4.7%. The ONS continued to advise caution when interpreting changes in the monthly unemployment rate due to concerns over the reliability of the figures. The exact number of unemployed people is unknown, due to low survey response rates."
    },
    {
        "title": "UK's first drug consumption room in Glasgow should not be seen as 'silver bullet', says Westminster committee",
        "description": "The UK's first safer drug consumption room should not be seen as a \"silver bullet\" to tackle Scotland's drug deaths crisis, a Westminster committee has said.",
        "url": "https://news.sky.com/story/uks-first-drug-consumption-room-in-glasgow-should-not-be-seen-as-silver-bullet-says-westminster-committee-13432048",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-sdcf-glasgow-safer-drug_6796050.jpg?20250916103427",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-16 09:27:00",
        "Headline": "MPs on the Scottish Affairs Committee have said funding for The Thistle in Glasgow should not come at the expense of other efforts to reduce drug harm.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The UK's first safer drug consumption room should not be seen as a \"silver bullet\" to tackle Scotland's drug deaths crisis, a Westminster committee has said. MPs on the Scottish Affairs Committee have said funding for The Thistle in Glasgow should not come at the expense of other efforts to reduce drug harm, with a suggestion that mobile facilities could be used to best meet the needs of a community. In a report published on Tuesday, the committee cited a visit to Lisbon to see a mobile unit in operation. Key advantages include being more cost-effective to set up and allowing greater flexibility in service delivery. The introduction of an inhalation room has also been suggested to meet the needs of those who inhale drugs rather than inject them. The UK's first safer drug consumption facility (SDCF) opened in Glasgow in January and allows users to consume drugs under supervision in a clean and hygienic environment. Data from the National Records of Scotland (NRS) recently showed there were a total of 1,017 deaths due to drug misuse in 2024 - a decrease of 155 (13%) on the previous year. \n                  Pensioner caught with cocaine worth £600k in mobility scooter at Gatwick Airport\n                 \n                  Man arrested for allegedly living in crawl space of Oregon housing complex\n                 \n                  Former pilot who tried to cut plane engines after taking magic mushrooms pleads guilty\n                 Despite the drop, Scotland remains the drugs death capital of Europe. While the Glasgow City Council area recorded the highest rate of deaths, the number did decrease from 246 in 2023 to 185 in 2024 (-61). It is hoped that The Thistle's work will be reflected in the 2025 stats when they are published next year. A total of 418 people (333 men and 85 women) have made 6,147 visits to the facility up to 25 August. According to the latest figures, there have been 4,068 injecting episodes and 56 medical emergencies. The committee's report notes that while The Thistle is \"likely\" to reduce drug-related deaths on a local level, it is not anticipated to have an impact on the city-wide or national rates. Although \"expensive\", the report said it could prove \"good value by saving money elsewhere in the health service\".  Read more:Living beside the UK's first drug consumption roomDigger mobilised to clean up drugs den near The Thistle The committee said the UK government should not make up its mind on the facility's future before an expert evaluation takes place on the three-year pilot scheme. If found to be effective, the report argues that UK legislation should create a new legal framework to properly operate and regulate the site and any potential future SCDFs. Drug laws are set at Westminster but are enforced by the Scottish courts. The Thistle was only able to go ahead after Scotland's lord advocate said there would be no public interest in prosecuting people injecting illegal drugs under medical supervision at the facility. The committee was told the UK government does not support the use of SDCFs and would not make legislative changes to facilitate them, irrespective of The Thistle's success or not. MP Patricia Ferguson, chairwoman of the committee, said: \"Scotland has the highest rate of drug-related deaths in Europe. Without a doubt, this is the most pressing public health issue facing the nation, and things need to change urgently to stop more people dying. \"The Thistle could be one way of helping Scotland do this. If the facility, after its three-year pilot, is shown to be effective at tackling drug-related harm, we're urging the UK government to follow the evidence, and take the legislative action needed to create a proper legal framework that will ensure it can run and be regulated properly. \"However, we also recognise that The Thistle is not a silver bullet. \"Our report emphasises that this pilot shouldn't come at the cost of other recovery services - rather, they should operate in tandem to offer as much help as possible to people with problem drug use.\""
    },
    {
        "title": "Flagship Scottish government justice reform bill which will scrap not proven verdict to go before MSPs today",
        "description": "The Scottish government's flagship justice reform bill - which includes abolishing the controversial not proven verdict - will go before MSPs today.",
        "url": "https://news.sky.com/story/flagship-scottish-government-justice-reform-bill-which-will-scrap-not-proven-verdict-to-go-before-msps-today-13431644",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-scottish-parliament_7021409.jpg?20250915143451",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-16 00:00:00",
        "Headline": "The Victims, Witnesses and Justice Reform (Scotland) Bill faces its final vote at Holyrood, with a lengthy session of more than 160 amendments to be debated ahead of a decision.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government's flagship justice reform bill - which includes abolishing the controversial not proven verdict - will go before MSPs today. The Victims, Witnesses and Justice Reform (Scotland) Bill faces its final vote at the Scottish parliament, with a lengthy session of more than 160 amendments to be debated ahead of a decision. If passed, the new legislation will make a series of changes to the justice system, including scrapping the not proven verdict; establishing a specialist sexual offences court; creating a victims and witnesses commissioner; reforming the jury process to require a two-thirds majority for conviction; and requiring the parole board to take into account if a killer continues to refuse to reveal where they hid their victim's body - a proposal named Suzanne's Law. An earlier plan to pilot juryless trials in rape cases was dropped by the Scottish government last year due to a lack of cross-party support. Ahead of the Stage 3 vote, Justice Secretary Angela Constance said: \"This landmark bill, if passed by parliament, will transform the experiences of victims and witnesses within Scotland's justice system. \"Victims will be heard, supported, protected and treated with compassion, while the rights of the accused will continue to be safeguarded.\" Ms Constance said abolishing the not proven verdict will ensure a \"clearer, fairer and more transparent decision-making process\". She added: \"There will also be wholesale reform to the management of sexual offence cases as we know these victims in particular, who are mostly women and girls, can be retraumatised by the current system. \"This legislation was shaped by the voices of victims, survivors, and their families who have campaigned long and hard for further change. \"Parliament must stand with them and help ensure the justice system doesn't just respond to crime but helps those who have been harmed to rebuild their lives.\" Opposition parties have lodged a series of amendments in a bid to bolster the bill, including allowing victims to be given the right to make a statement in court; ensuring victims are told if a decision is taken not to prosecute an accused; and informing all victims when a plea deal is struck between the defence and prosecution lawyers. The Scottish Conservatives want to see a Scotland-only grooming gangs inquiry and are additionally calling for Suzanne's Law to be strengthened, which would compel killers to reveal the location of their victim's bodies or face having their parole rejected. Read more from Sky News:Why next year's Scottish elections could get messy The proposal is named after Suzanne Pilley, 38, who was murdered by David Gilroy in 2010 but whose body has never been found. Under current legislation, parole board rules dictate that a killer's refusal to disclose the information \"may\" be taken into account. Scottish ministers have accepted a proposed amendment that states parole boards \"must\" take into account the refusal to cooperate, but the Scottish Tories and campaigners are calling for it to go further and instead ensure \"no body, no release\". 👉 Tap here to follow Electoral Dysfunction wherever you get your podcasts 👈 Scottish Tory MSP Liam Kerr, shadow justice secretary, said: \"Parliament has the chance to reboot Scotland's justice system so that it finally gives crime victims the rights they need and deserve. \"But the SNP bill, as it currently stands, fails to deliver that, so we can't vote for it. At the moment, it's a victims' bill in name only - a wasted opportunity. \"The Scottish Conservatives have submitted several common sense amendments to strengthen this bill and deliver the real change that victims' groups demand. \"I'm pleased that the SNP have backed our calls to scrap the not proven verdict and have heeded our opposition to their juryless trials plan - but now they must go further. \"I urge the nationalists to accept our amendments, instead of selling victims short.\""
    },
    {
        "title": "Trump to sign US-UK tech partnership in drive for AI",
        "description": "Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal.",
        "url": "https://news.sky.com/story/trump-to-sign-us-uk-tech-partnership-in-drive-for-ai-13432253",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-donald-trump_6976103.jpg?20250728142513",
        "type": "Technology",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-09-16 15:56:00",
        "Headline": "Plans for billions of pounds of investment by US tech firms include an AI Growth Zone in Northumberland and a big expansion of data centre capacity.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Some of the biggest US technology companies have pledged billions of pounds of investment to turbocharge Britain's artificial intelligence (AI) industry, as the two countries announce a landmark technology deal. Nvidia, Microsoft, Open AI and Google made a flurry of announcements to coincide with President Trump's state visit to the UK. They include plans to build data centres and invest in AI research and engineering. Money latest: Tax warning over state pension Sir Keir Starmer described the agreement, which both leaders will sign over the coming days, as \"a generational step change\" in Britain's relationship with the US. The deal will see both countries cooperate on AI, quantum computing and nuclear energy, with investment in modular reactors revealed earlier this week.  The prime minister said it was \"shaping the futures of millions of people on both sides of the Atlantic, and delivering growth, security and opportunity up and down the country\". \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 The government said the deal would deliver thousands of jobs, with a new AI Growth Zone in the North East of England earmarked for 5,000 jobs. The region will host a new data centre developed in partnership with ChatGPT developer OpenAI, the US chip giant Nvidia and the British data centre company Nscale. The UK government will supply energy for the project, which will be based in Blyth. Jensen Huang, chief executive of Nvidia, who has previously drawn attention to Britain's inadequate levels of digital infrastructure, said: \"Today marks a historic chapter in US-United Kingdom technology collaboration. \"We are at the Big Bang of the AI era - and the United Kingdom stands in a Goldilocks position, where world-class talent, research and industry converge.\" The Blyth data centre is part of Stargate, Open AI's infrastructure project to build large data centres across the US. The company has also developed sites in Norway and the UAE. Nvidia, which provides the graphic processing chips (GPUs), expects to generate $20bn (£14.6bn) by the end of this year from \"sovereign\" deals with national governments over the coming years. Sam Altman, OpenAI's chief executive, said: \"The UK has been a longstanding pioneer of AI, and is now home to world-class researchers, millions of ChatGPT users and a government that quickly recognised the potential of this technology. \"Stargate UK builds on this foundation to help accelerate scientific breakthroughs, improve productivity, and drive economic growth.\" Read more from Sky News:How most people are using ChatGPTNHS medicines bill 'should rise to preserve UK drug industry' Microsoft also pledged £22bn, its largest ever investment in the UK, to expand data centres and construct the country's largest AI supercomputer. Meanwhile, Google owner Alphabet pledged £5bn to expand its data centres in Hertfordshire and fund its London-based subsidiary DeepMind, which uses AI to power cutting edge scientific research. The company was founded in Britain and acquired by Google in 2014. Other investments include £1.5bn from AI cloud computing company CoreWeave and £1.4bn from Salesforce."
    },
    {
        "title": "OpenAI reveals how most people are using ChatGPT",
        "description": "Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed.",
        "url": "https://news.sky.com/story/openai-reveals-how-most-people-are-using-chatgpt-13432157",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-openai_7002687.jpg?20250827150243",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-16 13:42:00",
        "Headline": "Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released, according to new data. ",
        "Content": "\n          Science and technology reporter\n       Most people are using ChatGPT to ask questions and get advice, new data from its developer OpenAI has revealed. Although AI bots can do anything from coding to drafting emails or even helping users to imagine and play, around 49% of the requests sent to ChatGPT since November 2022 were people asking the bot questions and looking for information. The report by the National Bureau of Economic Research (NBER) and OpenAI is the biggest study of its kind and draws from the huge amount of data collected by OpenAI - around 10% of the world's population is now thought to use the AI tool.  Although there was a steady growth in people using ChatGPT for work-related queries, more than 70% of all usage was non-work related, according to the report. There's also been a shift in who is using AI tools. Early adopters of AI tended to be men, with around 80% of weekly users having typically masculine first names in the months after ChatGPT was released. By June 2025, however, users were more likely to have typically female first names, something the authors described as a \"dramatic shift\". \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \n                  Govt still hoping for £45bn in savings from AI as trial shows time saved for programmers\n                 Anthropic AI, which runs the Claude AI chatbot, also released its own data on how customers are using AI. It found that the use of AI strongly correlated with average incomes. More affluent nations like Singapore and Canada were at the top end of countries using AI, while emerging economies like Indonesia, India and Nigeria, used Claude less. In the US, economic differences even played out at state level, and Claude researchers found that adoption of the technology rose faster with income. Read more from Sky News:PM's 'AI superpower' dream at risk, industry warnsZelenskyy makes demand of TrumpTrump sues New York Times Each 1% increase in state GDP was associated with a 1.8% increase in usage of AI. Usage also reflected what those areas were best known for; in California, Claude was often used to help with IT problems, in Florida, it was used for financial services and in Washington DC it was used for document editing and career assistance. AI literacy consultant Sarah J Lundrigan posted about the two reports, saying the \"blunt truth\" is: \"If you're still treating AI as 'something to try later,' you're behind. \"The value isn't in futuristic features - it's in solving today's friction points. \"The winners will be the ones who can simplify adoption, reduce overwhelm, and make AI part of how people work and live.\""
    },
    {
        "title": "Google makes £5bn pledge to Britain - but concerns raised over mooted UK-US tech deal",
        "description": "Google is set to invest &#163;5bn in the UK in the next two years, to support growing demands for AI services.",
        "url": "https://news.sky.com/story/google-makes-1635bn-pledge-to-britain-but-concerns-raised-over-mooted-uk-us-tech-deal-13431957",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-google-deepmind_7021723.jpg?20250916050617",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-16 03:32:00",
        "Headline": "The major deal is part of a package of announcements expected to be made during Donald Trump's state visit to Britain.",
        "Content": "Google is set to invest £5bn in the UK in the next two years, to support growing demands for AI services. The announcement, which comes as Google opens a new data centre in Waltham Cross in Hertfordshire, is expected to contribute to the creation of thousands of jobs, the US tech giant said. Chancellor Rachel Reeves described it as a \"vote of confidence\" in the UK economy. The news comes hours before Donald Trump lands in the UK for a state visit at which he and Sir Keir Starmer are widely expected to sign a new UK-US tech deal. It also follows reports that ChatGPT parent firm OpenAI, and Nvidia, will also unveil billions of dollars' worth of investment into UK data centres this week. The chancellor said the investment would boost research and development, capital expenditure and engineering. However, Liberal Democrat leader Sir Ed Davey has criticised the proposed deal as a \"Silicon Valley stitch-up\", and has demanded that the government put it to a vote in parliament. He said: \"I am really concerned the government is going to agree to a Silicon Valley stitch-up that hands tax cuts to tech billionaires while undermining protections for our children online.\" Sir Ed added: \"Parents want protections for children online to be kept in place, not traded away in a backroom deal with tech barons. \"We can't let the government sign up to a deal that benefits Elon Musk at the expense of the British people.\" Read more:What Elon Musk told crowds in London via video link Google has confirmed it will invest £5bn into capital expenditure, research and development, and related engineering over the next two years, which will include \"pioneering\" AI research in science and healthcare through its DeepMind operation. The Silicon Valley firm said the investment will help the UK grow its AI economy and contribute to technological breakthroughs, improvements in cybersecurity and job creation. Google predicted the investment will help to create 8,250 jobs annually at UK businesses. DeepMind co-founder and chief executive Demis Hassabis said: \"We founded DeepMind in London because we knew the UK had the potential and talent to be a global hub for pioneering AI. \"The UK has a rich history of being at the forefront of technology - from Lovelace to Babbage to Turing - so it's fitting that we're continuing that legacy by investing in the next wave of innovation and scientific discovery in the UK.\""
    },
    {
        "title": "Bob Geldof reveals why he won't run for Irish presidency",
        "description": "Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\".",
        "url": "https://news.sky.com/story/bob-geldof-reveals-why-he-wont-run-for-irish-presidency-13432479",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bob-geldof-sky-arts_7022550.jpg?20250916221500",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-16 21:10:00",
        "Headline": "The Boomtown Rat musician said he'd spoken to the Irish PM about being the candidate for the Fianna Fail Party, but decided he didn't have time. He's also relieved Conor McGregor won't be running.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Bob Geldof has confirmed he will not be running for the Irish presidency - and says it's partly because he'd \"miss London\". Speaking to Sky News at the Sky Arts Awards on Tuesday night, the 73-year-old musician and aid campaigner said: \"My kids are here, my missus is here, my homes are here. \"I'd miss London. The band is here, I wouldn't be able to play.\" In Ireland, any Irish citizen over 35 can run for president - but to get on the ballot, a candidate must be nominated by 20 members of parliament or four local authorities. Geldof said: \"I simply wouldn't have had time.\" He said he had considered it, thinking it could be something \"new, interesting and useful\", 50 years after finding fame in The Boomtown Rats, and 40 years after launching Band Aid. Geldof said he'd briefly spoken to Prime Minister Micheal Martin, asking him: \"'What would you think about Bob Geldof being the candidate for the Fianna Fail Party?' He said, 'I think it'd be great, but I've already chosen someone'. \"I said, 'That's the end of the conversation Taoiseach, thanks very much,' and that was it.\" Former football manager Jim Gavin was later announced as Fianna Fail's official candidate. Conor McGregor pulls out Geldof admitted he was relieved former mixed martial arts fighter Conor McGregor was no longer in the running. McGregor, who had promised to curb immigration in order to protect \"Irish culture\" and to give power \"back to the people,\" announced he was withdrawing from the race earlier this week. Ex-Riverdance performer Michael Flatley, 67, has also expressed an interest in running for office. This year's ballot deadline is midday on 24 September, a month ahead of the election on 24 October. A largely ceremonial role, representing Ireland at home and abroad, it runs for a seven-year term. 'Please stop,' Geldof tells Israel Geldof, who has Jewish heritage and is the Founding Patron of the British Holocaust Museums Aegis Trust for Genocide Studies, also spoke passionately about the ongoing Israel-Hamas war. Following a UN Commission report which found Israel was committing genocide in Gaza, Geldof said: \"When you purposefully starve children as an instrument of war then you are a war criminal.\" He went on: \"People simply don't have the bandwidth to deal with the cost of living, the flag waving, the horror of Ukraine, the horrors of Gaza. They're just tired, and they just want Israel to please stop it. And the UN has just confirmed that. Stop.\" The accusation of genocide has been made by the UN Independent International Commission of Inquiry on the Occupied Palestinian Territory. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished.  Read more entertainment news:Hollywood legend Robert Redford diesSpain votes to boycott Eurovision if Israel competes Geldof was speaking at the prestigious Sky Arts event, where he was recognised for his influence as a musician and cultural figure over the last five decades with a lifetime achievement award. Never afraid to be outspoken, he was one of the defining voices of the 1970s punk era before going on to co-create Band Aid and the historic Live Aid concerts, reshaping the relationship between music and global activism. Geldof performed with his band, The Boomtown Rats, during the ceremony which took place at London's Roundhouse, hosted by comedian Bill Bailey. See all the Sky Arts Awards winners here."
    },
    {
        "title": "Hollywood actor and director Robert Redford dies at 89",
        "description": "Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89.",
        "url": "https://news.sky.com/story/hollywood-actor-and-director-robert-redford-dies-at-89-13432112",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-robert-redford-butch-cassidy_7022311.jpg?20250916172819",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-16 12:15:00",
        "Headline": "Best known for his performance in Butch Cassidy And The Sundance Kid, Robert Redford's film career, both in front of and behind the camera, spanned seven decades.",
        "Content": " Hollywood actor and Oscar-winning director Robert Redford, known for films including Butch Cassidy And The Sundance Kid, All The President's Men and The Sting, has died at the age of 89. Redford, who was also the founder of the Sundance Film Festival, the largest independent film festival in the US, died on Tuesday morning. In a statement, his representative said he was \"surrounded by those he loved\", at home in \"the place he loved\" in the mountains of Utah. \"He will be missed greatly,\" she added. Born Charles Robert Redford Jr in Santa Monica, California, in 1936, he attended college on a baseball scholarship but later went on to study at the American Academy of Dramatic Arts. He debuted on Broadway in the late 1950s before moving into television, in shows such as The Twilight Zone, Alfred Hitchcock Presents and The Untouchables. Rising to stardom in the 1960s, Redford became a go-to leading man in Hollywood and a huge star of the following decade, leading films including The Candidate, All the President's Men and The Way We Were. He worked hard to transcend being typecast for his good looks, through his political advocacy and a willingness to take on unglamorous roles. In the 1990s and 2000s, his film credits included Indecent Proposal, The Last Castle and Spy Game, and he also worked actively as a filmmaker - helming movies including A River Runs Through It and The Legend Of Bagger Vance. In 1998, he both starred in and directed The Horse Whisperer. But he was best known for his role as wily outlaw the Sundance Kid, opposite Paul Newman's Butch Cassidy in the 1969 film. The pair became a famous screen partnership, starring opposite each other again in The Sting a few years later, and good friends. As well as his starring roles, Redford was also an activist and an accomplished filmmaker - winning the Oscar for best director for Ordinary People in 1981. He had four Academy Award nominations in total - the first for acting for his performance in The Sting - as well as an honorary prize in 2002. In a career spanning seven decades, he also received three Golden Globe Awards, including the Cecil B DeMille lifetime achievement honor in 1994. In his later years, Redford took on a challenging role in All Is Lost, a 2013 survival story that featured virtually no other characters and barely any dialogue. His performance earned a standing ovation after the film was screened at the Cannes Film Festival.  In 2018, he received critical acclaim again in what he called his farewell movie, The Old Man And The Gun. His legacy lives on in the Sundance Film Festival, which grew into a cornerstone of the film industry and provided a launching pad for filmmakers including Quentin Tarantino, Paul Thomas Anderson, Steven Soderbergh, Gina Prince-Bythewood and Darren Aronofsky. And in 2016, former President Barack Obama awarded him the presidential medal of freedom - considered the US government's highest civilian honour - saying at the time that Americans \"admire Bob not just for his remarkable acting, but for having figured out what to do next\". Robert Redford leaves behind his wife Sibylle Szaggars and two daughters - Shauna, a painter, and Amy, an actress and director. He was previously married to Lola Van Wagenen. One of their children, Scott, died at the age of two months from sudden infant death syndrome. Another, James, died of cancer in 2020. 'One of the lions has passed' Tributes have been shared across social media following the announcement of Redford's death. Meryl Streep, who starred in Out Of Africa and Lions For Lambs opposite Redford, said: \"One of the lions has passed. Rest in peace my lovely friend.\" Filmmaker Ron Howard, known for Apollo 13 and A Beautiful Mind, described Redford as \"a tremendously influential cultural figure for the creative choices\" he made as an actor, producer and director, and said Sundance had been a \"gamechanger\". Marlee Matlin, star of the Oscar-winning CODA, said the film \"came to the attention of everyone\" because of the Sundance Festival. \"Sundance happened because of Robert Redford. A genius has passed,\" she said. \"He was part of a new and exciting Hollywood in the 70s and 80s,\" wrote author Stephen King. \"Hard to believe he was 89.\" Spencer Cox, the governor of Utah, wrote: \"Decades ago, Robert Redford came to Utah and fell in love with this place. \"He cherished our landscapes and built a legacy that made Utah a home for storytelling and creativity. \"Through Sundance and his devotion to conservation, he shared Utah with the world. Today we honor his life, his vision, and his lasting contribution to our state.\" In a statement, the Sundance Institute said: \"We are deeply saddened by the loss of our founder and friend Robert Redford. Bob's vision of a space and a platform for independent voices launched a movement that, over four decades later, has inspired generations of artists and redefined cinema in the US and around the world. \"Beyond his enormous contributions to culture at large, we will miss his generosity, clarity of purpose, curiosity, rebellious spirit, and his love for the creative process. We are humbled to be among the stewards of his remarkable legacy, which will continue to guide the Institute in perpetuity.\""
    },
    {
        "title": "Adolescence continues winning streak with two Sky Arts Awards",
        "description": "Adolescence has followed up its Emmy success with two Sky Arts Awards, triumphing in the television category along with a breakthrough award for its young star Owen Cooper.",
        "url": "https://news.sky.com/story/adolescence-continues-winning-streak-with-two-sky-arts-awards-13432075",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-owen-cooper-adolescence_6862013.jpg?20250916114528",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-16 10:20:00",
        "Headline": "Bill Bailey handed out the Sky Arts Awards at London's Roundhouse, with Adolescence, Sally Rooney and political thriller Conclave all winners.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Adolescence has followed up its Emmy success with two Sky Arts Awards, triumphing in the television category along with a breakthrough award for its young star Owen Cooper. The hit Netflix drama beat the BBC's Bernardine Evaristo adaptation Mr Loverman and Disney+ Jilly Cooper comedy-drama Rivals in the TV category, while Cooper saw off competition from visual artist Alex Margo Arden and writer Nussaibah Younis. Cooper's win saw him become the youngest winner in that category, after making history on Sunday as the youngest male to win a supporting actor Emmy. The four-part mini-series sparked a national conversation on misogyny and online safety, while also drawing attention for its breakout performance from the 15-year-old and its technical brilliance, with each episode shot in a single continuous take. Co-written by actor Stephen Graham and Jack Thorne, the show topped Netflix's charts around the world, and had real-world impact, with Prime Minister Sir Keir Starmer - who said he watched it with his own family - supporting a campaign for it to be shown in parliament and schools. The two Sky Arts wins follow the show's dominance at the Emmy's in Los Angeles earlier this week, where it took home six gongs. That followed two National Television awards earlier this year. The Sky Arts Awards, presented by Bill Bailey at London's Roundhouse, showcase the best of British and Irish arts and culture, celebrating achievements across all arts, ranging from classical music, film, and poetry to popular music, TV and visual arts. \n                  Bob Geldof reveals why he won't run for Irish presidency\n                 \n                  Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza\n                 \n                  Ed Sheeran says he didn't give Band Aid 40 permission to use his vocals\n                 Read more:Cooper's drama teachers on his Emmy-winning rolePM backs campaign to show Adolescence in schools Other wins include Lola Young's This Wasn't Meant for You Anyway triumphing in the popular music category, beating Charli XCX's Brat and Kneecap's Fine Art. It wasn't Kneecap's night, as the self-named biopic about the band, directed and written by Rich Peppiatt, lost out to political thriller Conclave, which also saw off Karan Kandhari's black comedy, Sister Midnight. Sally Rooney, who has recently been in the news after pledging her royalties to proscribed group Palestine Action, won in the literature category for her latest novel Intermezzo, beating fellow writers Alan Hollinghurst and Gwyneth Lewis. Bob Geldof received the Sky Arts lifetime achievement award, performing live with his band, The Boomtown Rats. The 73-year-old musician was recognised for his influence as a musician and cultural figure over the last five decades. Never afraid to be outspoken, Geldof was one of the defining voices of the 1970s punk era before going on to co-create Band Aid and the historic Live Aid concerts, reshaping the relationship between music and global activism. Sky Arts executive director Phil Edgar-Jones OBE said: \"Honouring Bob Geldof feels especially fitting, not only for his contribution to music but for the way he's harnessed creativity to change the world.\" Other live performances on the night included Madness, Nyah Grace, Soweto Kinch and Royal Ballet. Full list of Sky Arts Awards winners: Classical Music: Bold Tendencies - Body of workErrollyn Wallen - Body of workManchester Camerata - Body of work Comedy: Elf Lyons - HorsesJen Brister - Body of workSarah Keyworth - My Eyes Are Up Here Dance: Nederland Dans Theatre and Complicité - Figures in ExtinctionLost Dog - RuinationStopgap Dance Company - Lived Fiction Film: ConclaveKneecapSister Midnight Literature: Sally Rooney - IntermezzoAlan Hollinghurst - Our EveningsGwyneth Lewis - Nightshade Mother: A Disentangling Opera: Opera North - Simone BoccanegraGarsington Opera - Body of WorkSound Voice - The Sound Voice Project Poetry: Caleb Femi - The WickedestJanetta Otter-Barry - Body of workRoundhouse - The Roundhouse Poetry Slam Popular Music: Lola Young - This Wasn't Meant for You AnywayCharli XCX - BratKneecap - Fine Art Television: Adolescence (Netflix)Mr Loverman (BBC)Rivals (Disney+) Theatre: Lung - The Children's InquiryDavid Byrne - Body of workJamie Hale - Body of work Visual Art: Barbara Walker - Being HereClaudette Johnson - Three WomenMichelle Roberts - Body of work, including Red Blue Up The Times Breakthrough Award: Owen Cooper (TV)Alex Margo Arden (Visual art)Nussaibah Younis (Literature) Lifetime Achievement: Bob Geldof Arts Hero: Diane Carroll, assistant manager at Oran Mor in Glasgow"
    },
    {
        "title": "Spain votes to boycott Eurovision if Israel competes",
        "description": "Spain has become the latest country to threaten a boycott of next year's Eurovision Song Contest if Israel competes.",
        "url": "https://news.sky.com/story/spain-votes-to-boycott-eurovision-if-israel-competes-13432081",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-melody-spain-eurovision_7021978.jpg?20250916115514",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-16 10:32:00",
        "Headline": "Broadcaster RTVE is now the fifth to threaten withdrawal from Eurovision over Israel, following the Netherlands, Ireland, Slovenia and Iceland.",
        "Content": " Spain has become the latest country to threaten a boycott of next year's Eurovision Song Contest if Israel competes. It is now the fifth broadcaster to say it will pull out over Israel's participation, following recent announcements by the Netherlands, Ireland, Slovenia and Iceland - but the first of the competition's so-called \"Big Five\", a group which also includes Britain, Germany, Italy and France. These countries provide the biggest financial contributions to Eurovision, with participants automatically qualifying for the final round, and their withdrawal would increase the pressure on the European Broadcasting Union (EBU), which organises the event. The Eurovision Song Contest Reference Group, the competition's governing body, said a decision on Israel's participation is pending and that it has \"taken note of the concerns expressed by several broadcasters\". RTVE, the Spanish state broadcaster, announced the decision following a board vote on Tuesday. The measure, proposed by president Jose Pablo Lopez, garnered 10 votes in favour, four against, and one abstention in the 15-member board, the broadcaster said in a statement. Spain's prime minister Pedro Sanchez has previously called for Israel to be banned from the competition, highlighting how Russia was expelled following its invasion of Ukraine in 2022. At the time, the EBU said the decision reflected \"concern that, in light of the unprecedented crisis in Ukraine, the inclusion of a Russian entry in this year's contest would bring the competition into disrepute\". Recent editions of the contest, which has always expressed political neutrality, have involved demonstrations against Israel's continued military action in Gaza - launched in response to the attack by Hamas militants on 7 October 2023, which left some 1,200 people dead. Israeli contestant Yuval Raphael, a survivor of the Hamas attack, finished second in this year's competition, held in Basel, Switzerland, in May - but there were protests before and during her performance. Austrian singer JJ, who won, has also called for Israel's exclusion in 2026. Israel has denied accusations it is committing genocide and claimed its actions have been in self-defence against Hamas. More than 64,000 Palestinians have been killed since Israel launched its military action. In a statement following the vote in Spain, contest director Martin Green said he understood the \"concerns and deeply held views around the ongoing conflict in the Middle East\", and that consultation with members is ongoing \"to gather views on how we manage participation and geopolitical tensions\". Broadcasters have until mid-December to conform if they want to take part. What have others said? Dutch broadcaster AvroTros said last week that it was taking a stance in response to the loss of life in Gaza, with the deaths of journalists there a factor in the decision. Irish broadcaster RTE said the country was taking the same stance, saying it was \"unconscionable\" to take part given the \"ongoing and appalling loss of lives in Gaza\". Following his win in May, singer JJ said it was \"disappointing to see Israel still participating\", according to Spanish newspaper El Pais. \"I would like the next Eurovision to be held in Vienna and without Israel,\" he added. Read more from Sky News:Trump sues New York TimesGoogle makes $5bn pledge to Britain The \"potential impacts and consequences of either decision\" are being assessed, the Eurovision Song Contest Reference Group said in a statament. Next year's Eurovision will be the 70th anniversary of the event, and will take place at the Wiener Stadthalle in Vienna on 16 May."
    },
    {
        "title": "Ricky Hatton's ex-girlfriend Claire Sweeney pays tribute after boxer's death",
        "description": "Ricky Hatton's ex-girlfriend Claire Sweeney has paid tribute to the former boxer after he was found dead on Sunday morning.",
        "url": "https://news.sky.com/story/ricky-hattons-ex-girlfriend-claire-sweeney-pays-tribute-after-boxers-death-13432028",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-claire-sweeney-ricky-hatton_7021952.png?20250916110426",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-16 08:28:00",
        "Headline": "Ricky Hatton was found dead at the age of 46 on Sunday, leading to an outpouring of tributes.",
        "Content": " Ricky Hatton's ex-girlfriend Claire Sweeney has paid tribute to the former boxer after he was found dead on Sunday morning. Tributes have poured in for Hatton, 46, who had a decorated career in the sport. His body was found at his home in Hyde, and police are not treating the death as suspicious. Sweeney, who met Hatton on ITV's Dancing on Ice last year, wrote on Instagram: \"I've needed a few days to process the devastating news about my dear friend Ricky. \"My thoughts are with his family especially his children Campbell, Millie, Fearne and Lyla, his granddaughter. \"To them, Speaky (Paul Speak) and to all his friends who loved him so deeply and for so many years I send you my deepest sympathy. Ricky, you were the people's champ. \"We adored and cherished you. Love you always.\" \n                  'He inspired generations': Ricky Hatton's family pay tribute after boxer's death\n                 \n                  Former world champion boxer Ricky Hatton has died aged 46\n                 \n                  Joe Bugner: Former British heavyweight boxing champion, who fought Muhammad Ali, dies\n                 The death of the popular boxer has rocked the boxing community, and tributes have been flooding in since his death. Hatton had announced he was coming out of retirement for an exhibition bout on 2 December, in Dubai. That would have marked 13 years since his last professional contest. Hatton, from Manchester, enjoyed a glittering career at the height of the sport and was admired for his aggressive, exciting style. He won multiple world championships at light-welterweight and one at welterweight. In 2007, he flew thousands of fans over for his blockbuster fight with Floyd Mayweather, the first loss of his career, and later Manny Pacquiao, in which he was knocked out in the second round by the Filipino great. Sky News sport correspondent Rob Harris called Hatton \"one of the great personalities of British boxing\". He said: \"As he would travel around the world, winning fights, he would bring that huge fan base with him… To have the career he had, with 45 victories and three defeats, was impressive... \"This will be devastating to many boxing fans and particularly his family, given it was just weeks before he was due to make his comeback… So many people will be reflecting on just what a contribution and what an icon he was to British boxing and just how he could seem so ordinary as well, while still achieving great sporting heights\". In his last professional bout, Hatton suffered a knockout loss to Ukraine's Vyacheslav Senchenko in November 2012. He became an ambassador for mental health and was open about his struggles with depression. Messages from around the world in sport paid tribute to Hatton, who was famed for a spectacular left-hook body shot.  Retired and active boxers, including Amir Khan, Tyson Fury, Chris Eubank Jr and Barry McGuigan, paid their tributes, but so did football legends Wayne Rooney, Michael Owen and David Beckham. His boyhood team, Manchester City, paid tribute before their 3-0 win over rivals Manchester United with a minute's applause. City player Phil Foden, who scored in the win, said afterwards: \"It was for him and his family. It was all for him and we are delighted with the result.\""
    },
    {
        "title": "Trump sues New York Times",
        "description": "Donald Trump has announced he's suing The New York Times, just days after he threatened to do so over its reporting into his ties to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/trump-sues-new-york-times-13431962",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-president-trump_7020134.jpg?20250914131933",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-16 04:18:00",
        "Headline": "The US president has long accused the newspaper of being biased towards the Democrats and being hostile towards the MAGA movement.",
        "Content": "Donald Trump has announced he's suing The New York Times, just days after he threatened to do so over its reporting into his ties to Jeffrey Epstein. In a post on his Truth Social platform, the US president said he had \"the Great Honor of bringing a $15bn Defamation and Libel Lawsuit\" against \"one of the worst and most degenerate newspapers in the History of our Country\". Mr Trump's lengthy post - made late on Monday - is focused on his belief the outlet is bias towards the Democrats, citing the endorsement of Kamala Harris in last year's presidential election. It has \"been allowed to freely lie, smear, and defame me for far too long\", he added. Read more from Sky News:Trump sends National Guard into another cityThe massive security operation for Trump's visit The lawsuit - which has been brought in Florida - comes after Mr Trump raised the prospect of suing the newspaper last week for publishing articles about alleged notes he had sent Epstein. He dismissed the reporting as false. A lewd birthday message Trump allegedly sent to the convicted sex offender for his 50th birthday in 2003 was published by the US Congress days later. The pages are contained in files from the estate of the deceased billionaire paedophile, handed over to a Congressional committee. The collection of birthday tributes include a hand-drawing of a woman's body, signed \"Donald\". They also contain a picture of Epstein holding an outsized cheque, signed by \"DJTRUMP\". Mr Trump has maintained the note wasn't written by him, claiming the handwriting and signature do not match his own. The \"birthday book\" also included notes from former British minister Peter Mandelson, who has been sacked as the UK's ambassador to the US over revelations about his relationship with Epstein. Mr Trump has repeatedly denied any impropriety involving Epstein, whom he once counted as a friend.  Responding to his initial threat to sue, a spokeswoman for The New York Times said last week: \"Our journalists reported the facts, provided the visual evidence and printed the president's denial. It's all there for the American people to see and to make up their own minds about. \"We will continue to pursue the facts without fear or favour and stand up for journalists' First Amendment right to ask questions on behalf of the American people.\""
    },
    {
        "title": "Teenagers Wu and Tang who urinated in Shanghai restaurant's hotpot fined more than £230,000 ",
        "description": "Two teenagers who filmed themselves urinating into a restaurant's hotpot broth have been ordered, along with their parents, to apologise and pay a fine of &#163;227,000, Chinese state media has said.",
        "url": "https://news.sky.com/story/teenagers-wu-and-tang-who-urinated-in-shanghai-restaurants-hotpot-fined-more-than-163230000-13432264",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hot-pot-food-chinese_7022289.jpg?20250916164411",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-09-16 16:27:00",
        "Headline": "The pair, both 17, took turns to stand on a table and filmed themselves urinating into a cooking vessel at an eatery in Shanghai, before posting the video online.",
        "Content": "Two teenagers who filmed themselves urinating into a restaurant's hotpot broth have been ordered, along with their parents, to apologise and pay a fine of £227,000, Chinese state media has said. The pair, both 17 and named Wu and Tang, took turns standing on a table and urinating into the dish in a private dining room at a branch of the Haidilao restaurant chain in Shanghai, NBC News, Sky's US partner, said, quoting state-run broadcaster CCTV News. One of them posted the video on social media earlier this year, revealing it was an \"intentional\" act and despite being \"fully aware\" of potential negative impact, CCTV News said, quoting a decision by Shanghai's Huangpu District People's Court. After the post went viral, Haidilao apologised about the incident and said it had \"destroyed and replaced\" all the affected utensils. The chain also refunded more than 4,000 affected dine-in orders and gave each customer extra compensation worth 10 times what they had paid. Hotpot is a dish of broth kept simmering in a pot by a heat source on the table, served with an array of meats or vegetables dipped into the broth as both flavour and cooking method. Tang and Wu and their parents were sued in March by two catering companies, described by NBC as \"likely linked to Haidilao\". \n                  Mummies found in southeast Asia could be world's oldest, as scientists say they date back 12,000 years\n                 \n                  Prosecutors drop charges against two men accused of spying for China\n                 \n                  Donald Trump urges NATO countries to stop 'shocking' Russian oil purchases to end Ukraine war\n                 The firms demanded a public apology and more than 23 million yuan (£2.4m) in damages for business losses, reputational harm and other related costs. The court ruled the full refunds were reasonable and directly related to the incident, but said the extra payments lacked legal basis and were deemed a \"voluntary business decision,\" NBC said, quoting CCTV News. The teenagers and their parents were ordered to place apologies in designated newspapers to the catering companies, and the parents would pay a fine of 2.2m yuan (£227,000), reports said. The court ruling shows that parents risk \"heavy penalties\" if they fail to supervise their youngsters, China Comment, an influential magazine of the ruling Communist Party, said in an editorial on Monday, NBC reported. Read more on Sky News:Robert Redford diesIsrael committing genocide in Gaza - UNHatton remembered by ex-girlfriend \"This behaviour can no longer be dismissed as a simple prank,\" it said, calling it \"extreme disregard for others' rights and a blatant challenge to social norms\". Authorities in China have faced food safety issues related to similar incidents recently. In August, Hong Kong police arrested a 63-year-old man for allegedly adding urine to soft drinks in supermarkets."
    }
]